{"id":1,"author":"Donald Trump","title":"FirstDraft - Speech: Donald Trump Holds a Campaign Rally in Presott, Arizona","date":"2020-10-19","link":"https://factba.se/transcript/donald-trump-speech-campaign-rally-prescott-arizona-october-19-2020","paragraphs":["Hello Prescott. Hello, Prescott. I'd better speak fast. This sun is hot, This sun is hot. So did anybody notice? I'm sure you did that we flew over, right over your -- we have the greatest pilots and the greatest equipment anywhere in the world. I said. I wonder if there'd be any danger. No, sir, don't words fly and then flying over.","I noticed something red, I saw this crowd, and then I saw a crowd bigger than this over there trying to get in. Can you let him in, let him in let him come again, just let him in. I felt we could wait. Would you like to wait about an hour as they feel? Do you have speakers back there, please? All right, you know the fact is in every report, this stuff right, right.","Sleepy, Joe Biden yesterday had seven people and then they say he's tied in the polls in Pennsylvania. I don't know there's something going on here. There's something funny going on. So you know the votes are coming in and they're very much inclined to be with us. I don't know if you see, you know early voting because our people like to go out like and vote, right?","They like to vote, they like to vote and it's incredible. What's happening so the early votes are coming in and a lot of areas and they're starting to get a little bit nervous on the other side. In Michigan, we're leading the early vote, we're supposed to be a 20 percent, and then we catch him right in the final days like a racehorse.","No, no, no, it's uh, it's gonna be very big. You don't have events like this and you come in second in Arizona. okay. You don't do that, you don't say I don't like -- I don't like say let's leave now. Goodbye, you twenty five-forty thousand, whatever the hell the number of people. Goodbye, everybody. Oh, we're in second place in Arizona.","You know, I don't think so. Nowhere we're in first place in Arizona, but you know these fake people back here, the press the media, they're fake and same thing. Same thing happened last time, only worse it was crazy. Unless I may never did it before, so I believed him, and then what happened is we had the day and I was down in nine states that I had to win, right.","I was down in all nine on Election Day and we won all nine, right? No, they said they said this will be a very poor day for Donald Trump that time Donald Trump. This is going to be a rough day for Donald Trump down in nine states into the evening and you saw them cry. Remember the guy with also John King, oh my God, he just won Wisconsin, he just won Michigan, he just won Arizona, he just won Pennsylvania.","What's going on, not a -- we're not having a good day. They were not. This is going to be even better. I think. I mean, the only difference is that one big risk is they sent out tens of millions of these unsolicited ballots and we're trying to find out who did this send them to, when do they send them, where did they send them, who sends them back.","Some of these governors say you don't need certain signature verification. Why would you need a thing like that? No signature verification. In some cases, you don't need a signature. Why would you need a thing like that now they found 50,000 in a river, they found 53,000 in a creek. They found many in a garbage.","Can. They happened to be from the military, many of them they were in a garbage can. They found them and they all had the name Trump on that shotgun. They were military all in favor of Trump and they found him in a garbage can. I got to tell you, that's the only thing I'm concerned about. And we have law enforcement watching every one of them, but they have -- they have and you have to watch him to 15 days from now.","We're going to win the state of Arizona and we're going to win four more years in the White. Everybody needs to get out and vote return your absentee ballot today or vote early in person as soon as you can. When is that starting the early, when does that start now now get out now, right? I like that better Mom, you know, you always get this but and your state is doing great.","You have a great governor as you know and your state is doing great. With a pandemic pandemic, you're getting tired of the pandemic rather than tired of it. You turn on CNN, That's all they cover, covered, covered pandemic covered, covered, covered toes. You know why? They're trying to talk everybody out of voting.","People aren't buying it, CNN, you dumb bastards. They're not -- I watch this guy's got lousy ratings, Fredo, you know, Fredo got horrible ratings. He's talking about the pandemic. That's all they talk about. You know, I don't know, he said he had it. I'm -- I'm not sure he had it. He went to the basement, it's the only time his ratings were up, people want to see what was going to happen.","You'll probably get it again, even though in theory, you're not supposed to be able to -- well, I had it and they say you're not going to catch it again. And that's okay with me. Oh, were they happy when they heard? I had it right? Did you see it? Oh, I was -- they were dry. Well, we hope he gets better.","We hope he gets better soon. And then I came out, I did a rally. They said this guy hasn't changed. Actually. I say I'm nuts. I don't know if this is a compliment, they said he looks better now than before he had it. What's -- What's that, who knows? If you haven't, you haven't -- you get better, but we have great therapeutics.","We had -- I took something regeneration which we're making available to everybody free. But to me, it was a cure. It wasn't a pen, it really -- it wasn't a therapeutic. To me, it was a cure. I took it, I didn't feel so great. I will tell you that I don't like to admit that, but for a long time, I didn't feel too great.","And when you're President, you have a lot of doctors checking you out, right. I told a story last night. We went by the way these rallies they're unbelievable and I like this better. Remember we're outside. They all want us to be outside. You know they were -- they're all wanting us to be outside and these are outdoor rallies and we could hold more people than we can in the arenas.","These are the biggest rallies these are the biggest rallies ever had in history by a political candidate. They won't say, oh, it's great, it's great, but I took it and it was incredible credible. And I was out -- I took it and I felt like Superman The next morning I woke up. I -- I love you, Adam, with your vote.","We will continue to cut your taxes and regulations to maintain your energy independence, strengthen our military. Support our great beliefs protect our Second Amendment, which is under defend our borders, arrest violent criminals, and confirm more judges to uphold the rule of law. We have a record number of judges who say that a record number of federal judges and we have a great one right now hopefully gets approved next week.","Amy, under my leadership prosperity, will surge, patriotism will soar optimism will boom, the pandemic will soon end its rounding the corner. They hate it when I say, you know, they always like to say about Europe for this and that really, oh, really how they doing, how are they doing, I'll tell you what and we're working with them.","We're sending them ventilators, we're sending them everything, but we're rounding the turn. We're going to have the vaccine, but with or without it just happening soon, by the way, would even happen sooner if we didn't have these characters. On the other side, the Democrats that are running all these failed cities.","The Democrats are running your failed cities, you know that, right, and states, but if they weren't talking because they don't want it to be, you know they -- they don't want it to be successful. I really mean it. But ultimately it's going to all come together because it was coming together and then we got hit by the China plague.","We were going to all be well, unified people were calling me that you would have never expected it was coming together because of success and then we got hit by the plague we closed up, which we did a great thing. We saved 2 million lives or more. 2 million lives, you did a great job, we never got credit for.","We helped all of the states and the governors, some did a good job, some did a horrible job. I'll tell you who they are one day. Do I have the all-time great book? I have the real Booker. But like a lot of these other people, I don't like writing books while I'm running, I don't like writing books while we're in office because you don't do that.","Normal life will rapidly return, that's what we want normal go take us back seven and next year will be the greatest economic year in the history of our country. That's what's going to happen and we're going to cut your taxes. This guy's going to raise your taxes by four times, think of it and now he's saying, well, maybe I won't take away the tax cuts because you said we're going to end the Trump tax cuts.","They said, well, it's going to ultimately be eight thousand dollars a family. He said, well, maybe we won't end up. That doesn't sound so good. He has look, he's Gonzo folks, he's gone, he has no idea. And the people that are running that party are radical far-left maniacs and you can't let this -- this is the most important election in the history of our country.","This is election that's a choice between a Trump recovery at the highest and -- or a Biden depression. You're going to have with what he's going to do with regulations, what he's going to do with taxes, every company that came in from Europe, from Asia, every company is going to leave as soon as I'll tell you what, even the thought of it as an example, Foxconn?","Foxconn in Wisconsin, incredible company. It makes a lot of the Apple equipment stuff, right. The phones, the iPhones, iPads, incredible company, they don't like the Democrat governor. They don't want to spend the money. They want to come and spend a lot of money. They don't like the possibility that a sleepy, Joe could get in.","They don't want to invest billions of dollars in having those policies, so they pull back. If Trump gets in, they will spend billions and billions and billions, not your state, but Wisconsin, probably your state to billions of dollars. But we speak to them. They're unhappy when they see this Democrat kind of leadership or even the chance that it is.","So where do you see what Foxconn does in Wisconsin? OK Different place, but where do you see if we win, they will make an investment the likes of which our country has rarely seen before. But this is all a choice between getting a safe vaccine or really a lockdown. You know Biden wants to lock it down. He wants to listen to dr.","Fouchier he wants to listen to Dr. Fouchier. And don't forget Dr. Fouchier what he said is No, no, don't close it to China. I said -- I'm sorry, Doctor, you're a wonderful man and I is a nice man. You're a wonderful man. I'm closing it. I saved thousands of lives. He admitted that two months later, two months later, and Dr.","Fouchier said, don't put on masks, don't you see the thing? And now he's just put on masks and they say, you know, he's a wonderful guy and he is a wonderful guy. I like him. He just happens, have a very bad arm. He's a bad guy, but he's a good guy. He's a good guy. A lot of our people don't like him, I like him.","You have to understand him, he's a promoter and it's a choice between the American dream or a totally socialist nightmare. That's what you'll have. You'll be a socialist country and I said our country will never be a socialist country. We're not going to let it happen. Joe Biden has made a corrupt bargain.","By the way, he's made many corrupt bargains. If you've been really, you know, he's all shut down again. Can you believe it? He's going lead, you know, lead means lead means a politician, goes into I guess a garbage cans put the lid, they put the lid on it, right? I guess, I don't know, maybe it's something else it sounds, you know, there's an expression that kept saying Sir the vice, but our Vice President Pence is working his ass off until he's All over the place.","He's great, did he do a good job against Kamala if that were a fight, they would have stopped it. Now Pence is great, but they put the lid on it every day you wake up. Where's my dinner, sir? He's lit it out, He's lit it up. What does that mean? That means he's going to stay in the basement all day, but I think today he's staying in the basement to talk to his lawyers.","They got him called, I'll tell you something. I mean this suit, he is lucky that we have in our country and they don't appreciate a wonderful human being and the most fair attorney general of the United States because I know people that would have had him locked up five weeks ago. Bill Barr is a very nice man and a very fair man.","And they have no idea because somebody else would have taken that thing and all that crap and corruption. He's been a corrupt politician for a long time this guy and in many ways, it doesn't make some of us happy. But in many ways, Bill Barr is a wonderful human being and a very fair person and he's not a person that wants to hurt people.","Just remember that I say it and I say it once just remember it because I get angry too, but just remember he's a very fair man and in many ways and especially in that position, there's something very nice about it. Okay So what can I say, joe? Biden has made a corrupt bargain in exchange for his party's nomination.","He has handed control of his whole group over to the socialists, the communists, the Marxists and the left-wing extremists. You know that you see a march in the streets in these Democrat-run cities. You don't see him in the Republican-run cities. They're in charge and they are calling the shots if elected Biden will delay the therapies.","Look, I mean even the vaccines they're trying to say, oh, it's no good. If Trump has it, it's being done by Johnson and Johnson Pfizer. Then I don't even know who these people are right. If it comes out with Trump, How bad is that they are willing to demean a vaccine for political purposes. I saw it this morning.","If it's No, no, I saw it this morning where a governor who's done a truly poor thousands, tens of thousands of people have died in this state. Andrew Cuomo, he's done a terrible job. 11,000 people died in nursing home. He have put him in the convention center that I built. He could have we open up twenty-eight hundred beds.","We moved the big hospital ship. It was empty, could have put him there. He put him back in infected people back in with our elderly population knowing that our elderly population is susceptible. Andrew Cuomo, he killed thousands and thousands of people probably listened to his brother Fredo. You know, Fredo.","Right now, it's a shame and you know it's just a shame, but I saw him. He was knocking the vaccine. If the vaccine comes out during the Trump administration, we're not going to use it something to do with me. It's Johnson and Johnson, it's Pfizer, it's about Derna. These are the greatest companies in the war has nothing to do with me.","We need a vaccine and when it's ready, it should come out already. It could, in my opinion, except for politics, they just don't want it to come out before the election. But you know what I'm the one that did it. This thing wouldn't be here for two years and they're ready to come. But it's a shame, it's a shame when you try and demean something so important for politics.","It's a shame. But they'd like to postpone the vaccine, prolong the pandemic, close, your schools shut down your country. We're not doing it, by the way, you have -- you have a great governor the way he did it. You have a great guy. He's here someplace. We'll get into it with Alex, where's that guy? I don't get up yet.","You'll have huge. Don't get too much sunburn the governor and tell me who's gonna be this hot out here. Does anybody have a little sunblock? I'd love to use it right now. I'm always preaching to my kids sunblock and here I am like an idiot. But that's a. Massively raise your taxes by and he's going to raise your taxes.","First time I've ever heard of a politician he wants, he's running on raising taxes, that's how crazy the world has become all my life. I see politicians, they want to cut your taxes. We're going to cut your taxes. The other guy says we're going to cut it more well. This is an easy one for me then because we're cut it.","We gave you the greatest biggest tax cut in history. And he's going to give you the biggest tax cut in reverse because what he's going -- he's going to endorse, but he's going to give you the biggest tax increase in the history of our country. Now. Now think of it, think of it who the hell can win with that platform and if you listen to these people, this election is tied with three points up in your state.","But I don't know, I think how can you be three points up when we have droughts like this and nobody shows up so he wants it. So we're cutting your taxes, he's increasing your taxes. Just those two things isn't that sort of the end of the election. Now we can make the case, you know, something is good, it will destroy your -- for one case, it will destroy the stock market which is ready to reach new historic.","Can you imagine rounding the turn or the pandemic and we have the highest stock market we've ever had, think of this and some of our numbers are higher than they were housing and different things. Some of our numbers are higher than they were even before the pandemic. I mean, it's pretty amazing, you know why?","Because we built such a strong foundation, if we didn't have that strong foundation, this would be a disaster he wants to bury you in regulations, outsource your jobs, dismantle your police departments, dissolve our borders. He doesn't want borders. The wall by the way is almost finished. And you have the strongest southern border you've ever had.","He wants to confiscate your guns, get rid of your second amendment. He wants to ban American energy, no fracking, how about that for a year and a half? He says no fracking. Then he goes to Pennsylvania. We have a million jobs. The state is dependent on it and all of a sudden he says, Oh, but I guess we can fry.","And the press doesn't call him because they are more corrupt than Biden himself. They want to wipe out your private health care plans. A lot of people have 180 million people have private health care and they love it. They're so happy and it's all going to disappear. You will be able to go to your local hospital ward and stand in line for six weeks when you have a cold or when you have something worse?","This is what's going to happen. He wants to terminate your religious liberty, destroyed the suburbs. They're not destroyed. We ended the regulation. I ended it, you know that women of the suburbs, please raise your hands okay. Look at it. Look at that crowd. So women of the suburbs, look, here's a state where women of this up, the fake news has been saying the women of this show, they said this last time too.","Women don't like Trump and then they saw then they saw 52 percent voted for Trump, right? I said why don't they like me that I like me they couldn't get. And then after we won, they said women, women came out for Trump. What happened? Women, I like women, I like them. So anyway, no. But listen, here's the story.","They said suburban women, I used to call suburban housewives, I got killed all the time. I said I better go politically correct and I'll bet there's not. Is there one woman here that minds being called if you're married, at least a suburban housewife the only one she wants to, because he's single, no, the only one that minded those characters?","A lot of people up there the press right, that's the only one. The rest of them don't, But you know what in keeping with -- in keeping with our modern era and being politically correct. So the women in the suburbs, so you have a regulation now that's a disaster. It allows low-income housing to be built right next to your American dream.","What ultimately it means is crime will come pouring. And you know what these anti for people and the radical left and it is the radical left. It is the radical left. The radical left, the next place they want to hit the suburbs. They say it all over, right? And what I did with the regulation my people came in.","He's great. Ben Carson, Dr. Ben Carson. He's great, but Ben came to me. So we can say I want to get rid of that regulation. It's a horrible regulation getting worse all the time and I've watched it for years, you've all watched it right, where they destroy these incredible communities and Ben said, well, we can really bring it down and make it much more palatable.","I said no, Ben, you know what? That's going to be more controversial terminated. You said, yes, sir, you terminate, we terminated it. You have no more regulation. Now if sleepy crazy crooked Joe gets in, I don't know he shouldn't be allowed to run if that were me. If that were me, they wouldn't allow me to run if that were me.","Can you imagine if Don Junior had the problems of Where's Hunter, right? Don Junior, oh my poor boy -- boy what that boy's been through, what that guy's been through. I don't know if [Inaudible is different, she sort of floats through life. She's pretty amazing. She's pretty amazing. And Eric, Eric has been great, but what they went after my kids and I restrict him from doing things.","I mean can you imagine the money? My kids could be dad, let's build a hotel in Saudi Arabia? I restrict intimacy, can't do anything, let's go build a couple of hotels and in name any place in the world. We'll have them, right and you know all the money that Biden's raising, he did three hundred and fifty million.","I would be Doug the greatest. But I'd make Doug look like a bad fundraiser. I would be the greatest fundraiser in history. All I have to do is call up the head of every Wall Street firm, head of every major company, head of every major energy company. Do me a favor, send me 10 million from my campaign. Yes, sir, they say the only thing is why did you ask for more sir?","I would -- I would be -- I would take in more money, but you know what? I don't want to do that because if I do that, I'm totally compromised. Because when they call me, you know, you're a loyal person and what happens is say, you know, you'll do things that are a lot more money. So when the press says and we're raising a lot of money, we're raising a lot of small money, a lot of 61, 62, You know, no Republicans ever done that.","But when I start calling, I would be -- I would be the greatest fundraiser in history. Don't forget, I'm not bad at that stuff anyway. And I'm President. So I call some guy the head of exile I call the head of exile. I don't know what you know, I'll use a cup. Hi, how you doing, how's energy coming? When are you doing the exploration?","Oh, you did a couple of permits, okay, But I called the head of Exxon, I see you know, I'd love to send me $25 million for the campaign. Absolutely sir. Why didn't you? Would you like some more and if I make the call now, people make the call, it's different, you know? But if I made the call, I will hit a home run every single call, I would raise a billion dollars in one day if I wanted to.","I don't want to do that. I don't want to do it. I put in a lot of money when I ran originally, I put in a lot of money into this campaign, you know my primary campaign and I'd never thought it was appreciate it. They don't even. They'd never give me credit for it, but I gave up my salary, you know, I gave up.","So the President is paid now, but nobody ever talks about, you know, every month this sleaze because they're sleaze vote stuff, if not all that guy's a good. But that he really -- you do have a couple of good guys, but not many, but every month they call the President giving up his check. I don't have to -- you know, I'm the only President they say, maybe I'm wrong, they'll say, oh, you know hundred years ago somebody else did.","I'm the only President that did not accept a salary, which surprised me. It's 450,000. The only reason I mentioned it is they never talk about it, they never talk, but what they do -- do is they call up every month. Did he give up his check and W Kelly, she here, Kelly are great. Where's Kelly Kelly? She's around Kelly Kelly wait, so she just recovered from covered.","Would you believe it stay away from me? Kelly? No, Kelly, is it true? They call all the time. Did he give up his check his salary check and she's always it? okay, They a write about that? If I ever didn't give it up, it would be headlines trump refused, these people are the worst, but is that true? Kelly said a couple of that is absolutely true, Mr.","President. And let me tell you this guys with your help, we can beat social media. We can beat the media because we have the greatest fighter. In the history of this country and President, Donald J. Trump, so great, she is so great. I didn't know she'd be that good, that was good. Sometimes they get people up and they bomb, you know, they bomb, you know, she's married to a professional, major league baseball player.","He got lucky. He got lucky. Thanks, Kelly. But it's true, it's true, but I'd be the greatest fundraiser of all time for the last forty-seven years, sleepy, Joe Biden shipped away, your jobs shut down. Your factories threw open your borders and ravage our cities while sacrificing American blood and treasure in these ridiculous endless foreign wars of countries that you've never even heard about right.","You never even heard the name so sad, they're all coming back. You know that Joe Biden is the servant of the globalists and the lobbyists and the wealthy donors, the people that I could be calling would I have fun. I would have fun. I'd like to come, maybe I should call and put the money in escrow and just give it back to him.","And the Washington vultures who got rich bleeding America dry, that's what happened including big pharma. In 2016 You voted to fire this corrupt and decrepit political establishment and you elected an outsider as President who is finally putting America first. It's about time, fifty-six percent. Did you see this fifth?","And where to put a pandemic okay. Because in China, we're in a pandemic, a poll just came out, Gallup 56 percent of the American people in this brand new poll just came out. Gallup poll say they are better off today than they were four years ago under Obama, Biden, administration and it's a record number.","Will you do me a favor one, just one favorite today. Will you please go out and elect Martha stand up for great, great pilot when we came in love with the helicopters. She said the way she could have been two hundred feet lower. I said that we would only had ten feet clearance. She said, I don't care, she was a great pilot.","The Warthog she flew the Warthogs on an incredible plane, get her elected. Will you please? A waste, we don't want to waste a lot of time off to get her elected, okay, please that other guy he's bad. I mean he's good if you don't like, does anybody not like your second amendment because he will vote to get rid of your second amendment.","You know that you know, I mean, I know the whole thing and the history and it's a sad deal that all of that stuff, but he's a radical leftist and he's going to vote to take away your guns and somehow Arizona and no guns don't seem To match up very well. He's going to take away and I'm much more blunt, I think than Martha.","She's a nicer person than I am. I say it very directly. He's going to vote to take away your guns now. I don't know that he'll be successful because hopefully, he's going to have to go through me, but what the hell do we need that therefore she will be a great Senator. And she has been a great Senator. She was appointed by Doug and Doug is one of the best governors in the country and he didn't close you down and you couldn't breathe like in Michigan.","You know the court, the Supreme Court overruled her in Michigan and you know, part of the problem she had, the only one that has freedom was her husband. He was allowed to go swimming, fishing, boating, everybody else's on shore. They see this guy boating and who was it, it was the husband of the governor of Michigan that didn't help their case by the way, but -- but no, I mean, the people in Michigan, I love them, were leading in the polls in Michigan.","But think of it, you know why? Because we have many car plants, they didn't have a car plant opening in 42 years. And then I came along now they've got so many of they don't know what the hell did do. We'll send some to Arizona, okay? And you already have them opening up in Arizona, no, but you know they've got to open up the states, they've got to let the kids go back to school.","Barron -- Barron Trump. Barron Trump had it all these young guys, Barron Trump had it, he's very young, he's 14 and he's very tall. He is very tall, but Barron had it and the doctor said our First Lady had it. I had buried at it sir Barron tested positive, I said oh, well, how's he going to do very good, sir.","No problem, I said good like 14 minutes later. How's buried? How's he doing doc? How's my boy doing, sir? He's cured what's that? You know, it took about 12 seconds. How's Baron doing doc? I want to be -- I want to make sure my Baron's okay. Sir, he's fine. Well, what do you mean? He's fine. No, he's all 100 percent.","Can you believe it because I hate to admit it, all of us people that are slightly older, their immune system is strong, very strong. So Baron had it, it came and went, he's immune, you know, that's the way it is. Those kids, those kids, I looked at Baron like he was Superman, I said Baron, you my man. I said How you feeling he didn't even know what he was talking about.","Actually, Joe Biden is always -- it has been a corrupt politician and as far as I'm concerned, the Biden family is a criminal enterprise. If you read, if you read, if you read this laptop, I tell what this is called the laptop from hell. The only laptop that was almost as good maybe worse was the laptop of Anthony Weiner.","Remember that ding, ding, ding, ding, he got hacked too, just like Sculley got hacked. Remember he said he got hacked, he was sending messages to very, very young women. Girls, girls choose me, girls, he was sending messages, a lot of them and he got hacked. They always say they got hacked Sculley, got hacked right, Sculley.","He was a Never Trump or he got hacked, you know, I've never known a person that said he got hacked, they got hacked, nobody gets hacked to get hacked. You need somebody with 197 IQ and he needs about 15 percent of your passwords doesn't happen. So Sculley got hacked and now on Thursday, I go up another day.","The real great one, another great one. Kristen Welker, she's a radical Democrat. Look at him, they're getting angry. She's a radical Democrat, she deleted her entire account. Everything is deleted, but I've known her. She's been screaming questions at me for a long time and she's no good. But I figure what the hell.","Yes, you're right. How did I do the other night against one that was worse? She was worse, Savannah, so I had Savannah Guthrie the other night. She was -- she was like a crazed lunatic. She was literally rising out of her chair. She's screaming questions and how about that? Great woman behind me. She kept going.","I love her, I don't know too much. I met her right after she's great, but I tell you she was definitely a Trump person. They made a big mistake. You know the mistake they made was they forgot to check your audience, the audience was great and how about the woman that came up and said, I love your smile, you're so handsome, you're so handsome, you're so handsome when you smile.","I love your smile, sir. Can I ask as you so nice and then what happened is NBC, which is the worst that's Comcast? I called Con a Because it got, you know, they spent a fortune on public relations and I talk about it, wipes out the whole Europe public relations con that Comcast they're dishonest people, okay, Totally dishonest.","So she said really, I mean look this woman lied to me. I know when somebody likes me, I know when they don't like me, it's very quick. It takes me like a fraction of a second. I love your smile, sir. You're so handsome when you smile yourself. Could I ask you okay? okay. Ready now they grab it is -- it is just not working out well, so they grab her and I did, you know I was long gone and they interview her after.","I do not like him, I did. They told her you can't do that, got to say bad things. I have no doubt because I watched you interviewed afterward, she hated my guts, she was going to like -- I don't like her, I'm going to vote for Biden, why? Because he said, geez, no, why are you voting for him? I have no idea.","So that's what happens. We're dealing with a corrupt crooked media, just remember that. And I'm glad I came along because there's no other human being on earth other than maybe Doug Doocy that could've handled the crap that I've had to handle, let's say what every other person, even a tough person would've been in a corner long ago with his thumb In his mouth saying, mommy mommy, take me home, right?","They would have said mommy, please. I can't take it, but me, I viewed it as a challenge. And what it really is, is we're exposing some real garbage. And you know these tech companies are very dangerous because they refuse to allow even the New York Post, which deserves tremendous credit. They caught Biden in a scandal, the likes of which we haven't seen.","I say the second-worst in the history of our country. The first worst was when they spied on the President of the United States and tried to take him down and they spied and they got caught. Let's see what happens. Let's see what happens. That's to be the worst this could -- this is the second, but this could be leading into the first.","I mean, you know this is -- this is -- this is a grave grave problem, but you're lucky, I'm your President, you're so lucky, you're so I always tell a great First Lady darling. You're so lucky I took you on this wonderful journey as we get hammered by these fake people, we get hammered every day and I say, darling, you're so lucky.","I took you on this journey, but they do love Michelle Obama. They love Michelle, you know, did you hear the new one? They came up to me sir. I have bad news. President Obama is going to start campaigning for sleep. Joe, I said is that good or bad news because don't forget he campaigned for Hillary harder than Hillary did right.","He said he will not get the nomination. I got the nomination, he actually said he will not run. I read he will not get the nomination, got the nominee, he will not be a President, he became the President, do she thought I was going to get him? No, he's got it. You know the funny thing about Obama, look they work together for a long time like I work with Mike Pence.","They worked together for a long time and he tried to talk him out of it because he knows he's not mentally fit to be President. We can't play games. You know, we can be nice and say, Oh, he's wonderful, he's not wonderful. You know, two days ago, he said it is very my much really great honor to be running as a Democrat for the United States Senate.","And he meant it with me, I'd be joking, maybe and they sell to Guy mentored, that's about the third time he said that too. That's a little bit see that's not like something that you know you pronounce a word wrong or something that's serious problems. And when he says that like it's great to be with you people today in the great state of Ohio and they say you're in Arizona.","Oh, I -- at Arizona, I love the people who are, you know, I always say he's done that eight times now where he's in. I've never done it. I've never done it when I do perhaps it's time to retire. You know, if you do that, it's disqualifying because it's so bad like you could be, you know, Winston Churchill was a great, great speaker.","You could do that. So we're in Arizona and if I said I love the people of Ohio and it's great to be with you today, right? The worst was when I think he said he was in Palm Beach and you know palm trees. And he said it's great to be with the people of Iowa, right, right? You know there's something wrong here.","Something going on right, but he said just three times recently, but the last two days ago that he's running for the U.S. Senate and I'm actually happy he's running for this cause. I mean, hey, look, he's the worst Presidential pick in the history of Presidential politics. I think and I say this and you know they always take that one little step.","Have you seen how dishonest they are? They'll take that one little section. I say if I lose to him, it'll be a disgrace. So they don't put the first part in. They don't put the end to it. They just -- President Trump thinks he's going to lose it because they take that one little sections out to be very, very careful with because they're so corrupt and so dishonest.","But it is true, he's probably the worst in the history of Presidential politics win, lose or draw, win, lose or draw. This man should not be your President. Number one, he's corrupt number two, he's not a smart man, never was number three. He's seen better days. So are you ready to -- let's get, isn't this better than reading this stupid teleprompter?","So if I don't sound like a typical Washington politician, it's because I'm not a politician if I don't always play by the rules of the Washington establishment. It's because I was elected to fight for you hotter than any President has ever fought before. We're not going to lose our nation to socialist, communist.","We're not going to be losing our nation to Kamala who's further left than Bernie, I'd rather Bernie than Kamala. And you have a woman President someday, but it's not going to be Kamala. You don't want that as your first. You don't want Kamala furthest left and she treated Biden so badly. There was nobody that you interposed them, but she was tanked.","She left, I don't know, that's the kind of thinking you've got -- that's the kind of thinking you have. You're supposed to be voting for. I guess I'm fighting so hard because I love my country so much and because I'm determined to ensure that the forgotten men and women of this country are never forgotten again.","That happened, so we're joined by a great group of warriors and I really would love just to come up for a second. You do have a great governor and a great friend of mine, Doug Ducey. Come on up. Doug and Senator Martha McSally come on.","Thank you. Look at that crowd. I wish these people would, hey, can you put the cameras back there, please? Will you turn one of your cameras back as far as the eye can see its people? Unbelievable, unbelievable. They never do it, you know, they never turn the camera. I used to think they couldn't. You know, physically it was like stuck, they couldn't do it, but they can't because whenever there's a little problem that thing goes like a pretzel, it's unbelievable, but they never want to show these crowds.","They never want to do it because they're fake. Listen, we have a Congressman who's a friend of mine, who's a warrior, Paul Gosar a warrior, thank you, Paul, a warrior, a warrior and a friend of ours whose incredible she is leading from what I'm hearing, Tiffany, I hear she's leading Congressional candidate, Tiffany shed, Tiffany.","You're leading in the poll, wow, that's a long way. She's incredible what a great career in that you're doing. This is so great. Thank you, Tiffany. Tiffany shed get out and vote for a friend of mine somebody that was great. She would have been if she didn't have three or four people running at the same time.","She would have been your Senator hate to say it, you would have been your Senator a friend that's so loyal and strong, but -- and a good person. Arizona GOP chair, Kelly Ward, she's worked so hard. She is some warrior and fighter and just yet they don't even understand it. Okay, I don't even understand you sometimes, Kelly, you don't -- She doesn't give up how are we doing?","Kelly? We're winning, we're winning, Yeah, good. Get out there fifteen days, Kelly, every. Don't sleep don't go to bed, don't sleep all right. And Sergeant Jimmy Jevons of the National Troopers Coalition. Jimmy, where's Jimmy? Jimmy? Thank you for everything. Jimmy. Thank you for everything and I was recently honored to receive the Coalition's endorsement.","And I want to thank you. You're really amazing. Thank you and a tough guy and a good guy. In addition, I was just named, I have to say this man of the year by law, enforcement's big magazine, it's called Blue magazine man of the year. I love Lord. So we're delighted to be joined by a legendary quarterback.","I used to watch this guy, you know he'd win with the brain as well as the body. Jim McMann two time All-American at Brigham Young and later a two-time Super Bowl champion with Jim, whereas I love that guy look at him, look at that guy, look at that guy. I'll tell you and I loved your coach too. I loved Mike Ditka and I love Singletary, You know, Singletary likes Trump, you know that, right?","You think Singletary is tough enough, how is he? Tough enough? Leggett reaches his own business. He's taking those pictures. That's him. Jim. You were a winter man and you are a winner. I made it, I'd say a lot of Ditka and say hello to Singletary and all those guys. What a great team right? I was a team of champions, you know you win with the muscle, but you got to win with this too.","You got to win with this too. We just -- we just gave out a Presidential battle to a great fighter. Dan, does everybody know our Dan right out of Iowa, huh? And how about Jim Jordan? Is he a great one, Jim Jordan, right? He was a great wrestler we had so many. We have so many people that are behind us. Anyway, great to be with you, Jim.","Thank you very much for coming. We appreciate it. Dan, Gable everybody, you know, Dan gamble, did you ever have Dan Gable? Hey, Jim, he was 182 wins and one loss. He won everything and he was an unbelievable coach in Iowa. Dan Gable and then think of it a career one. Eighty-two and one fact I asked who was the one, I guess he was pretty good, but he ended up beating him in the Olympics and then he went to the Olympics and he won the Olympic gold medal, Dan Gable.","Any wrestling person would know. And in Iowa, Dan Gamble is like a legend and he is all over the country and in the wrestling world the greatest ever and he goes to the Olympics and he never lost a point. And in the final, he had to wrestle the Russian who was supposed to be unbeatable, but he was supposed to be unbeatable too.","And he beat the Russian and never allowed a point. He went through the entire schedule and never allowed one point. Think about that. And he won the Olympic gold medal, and Dan Gable is now getting the Presidential Medal of Freedom. He's coming to the White House, so that's pretty cool. Thank you, Jack.","Under my administration, we built the greatest economy in the history of the world and now we're doing it again. You know it's make America great again, right. So now I go make America great again. Again, make a great again again and that's what we're doing. We're way ahead of schedule. My first three years we increase family income by over six thousand dollars, more than 5 times the gain.","Think of this five times, again we were actually more than that, more than 5 times again in all eight years under the last administration. Five times a game in a much shorter period of time, African-American unemployment and Hispanic American unemployment and Asian American on un-American employment. Think of that we all reached the lowest levels in the history of our country, African-American Asian American Hispanic America.","We lifted six-point, 6 million Americans out of poverty including more than 1 point, 5 million Hispanic Americans who are liking Trump a lot. I like you too. I don't know if you see what's happening with Hispanic Americans. We are leading them in the polls which never happened before. I've always liked Hispanics and they like me, this was not a there.","This was not supposed to be happening. But I love the Hispanic Americans and they're doing great. By the way, they're great business people. Our policies are lifting up all Americans of every income since the China virus. We've created a record eleven point, four million American jobs. Think of that, you know, we did, they just announced think of this, it sounds terrible in one way, but you were hearing numbers like 42 percent unemployment.","You know it's not everybody's fault except China. It came in and you're hearing it could be 40 to 38, whatever. So they just announced it 7.8 percent unemployment. We're going to be back to where we were very soon unless you put a fool into office who's going to raise your taxes and put back all the regulations where every company is going to leave.","Now think of it doesn't 7.8, you know one way I don't like to say it because we're down to 3.4, 3.5, but 7.8, if you would have heard that three, four or five months ago, you would have said impossible. And we'll be back to the same number and next year will be stronger than ever before you watch after the virus left, China, we experienced the smallest contraction of any major Western country and the fastest recovery by far of any country.","Think of that as President I've been delivering for the incredible Hispanic American community like never before. I'm fighting for school choice for safe neighborhoods for Hispanic owned small businesses. I have a couple of them. Some of where my friends with a restaurant owner doing so well, they've made a lot of money.","My restaurant, a couple of people didn't like that restaurant, I liked it and now they have lines around the block. Joe Biden would obliterate everything. Hispanic Americans have worked for wiping out your small businesses with lockdowns and regulations and devastating your families with massive tax hikes.","He wants to give you the big, big fat tax hikes. He will wage war on Catholic organizations. Banned charter schools, bankrupt Catholic schools. We've already taken care of the funding for Catholic Schools Fund, extreme late-term abortion, and let socialists run wild in our country. And that's why we're going to win a record share of the Hispanic vote.","There will never be a share of the Hispanic vote like this unless we decide to run again in four years. And then another run, we invested two 2.5 trillion dollars in the U.S. military. We have the best equipment of any country in the world. We've upgraded our nuclear to a level that it's never even been close to.","We have new rockets and missiles and ships and tanks. What we have is incredible. The F 35 fighter jet, the best in the world, stealth tankers, do tankers, new freighters. We have everything 2.5 trillion dollars all made in the USA. We are the envy of Russia. We are the envy of China. Nobody has the equipment, even the hydrosonic missiles that Obama messed up on.","We have hydrosonic missiles that go seven times faster than a normal missile. We have the best hydrosonic in the world. You know, they stole our plans during the Obama administration, another thing that happened. These are little things that happen that we don't -- That I won't tell anybody okay. We also pass for our veterans V.A. Choice in V.A. Accountability.","Everyone said that would have been impossible. And last year American warriors killed the founder and leader of ISIS al-Baghdadi. We killed al Baghdadi and we have a very special person with us today. Just days ago my administration brought two depraved, ISIS terrorists known as The Beatles from the United Kingdom.","These were two bad ones. These are people I would have liked to give to Jim and his team to work over to him, would've liked that. I think Jim would have been very happy to stand trial for killing of four American hostages, Peter carsick, Steven Sotloff, James Foley, and Kayla Mueller. As many of you know, Kayla came from right here in Prescott, Arizona, beautiful, beautiful girl, and we're deeply moved and she's been thought of all the time.","Her family, as you know, a mother and father came and they spoke beautifully at the Republican National Convention. But we're deeply moved to be joined by her incredible and loving family. Her dad, Carl? Her mom, Marsha, and the entire family, we will hold Kayla's precious memory in our hearts forever. Just special, please stand please, please.","You look younger since I last saw you. Yeah, look at you, you look very -- I want to thank you very much what an incredible story and you said if we were here, if we were here earlier instead of Obama, she would have been with us today. She would have been with us today and that's true, that's true. They could -- they could have done that, they didn't do it, they just talk, they talk all the time, they don't do it.","I want to thank you very much credible. Her memory will never ever be forgotten. I want a story. It is what a vicious story, what a horrible story. But he's dead. We also took out -- they've been looking for him for many years. He was the founder of ISIS and he was rebuilding it because we obliterated the ISIS one hundred percent of the ISIS caliphate and he was looking to build it again.","And we got him and you know the guys that got him on this story that not a lot of people now. I think it was Kayla's birthday, right? They used the birth date as the number and they took that number, that specific number that was their code name for taking out this horrible al Baghdadi right, great honor.","They don't do that often. They don't do that often, but they use her -- her birthday and then they took him out. They didn't play games and a dog on that one became more famous than I did. And that's good. That dog was a hell of a dog and still is. We also took out the mass murder of American troops at a lot of other people and a lot of other troops.","Soleimani, he is dead. Soleimani, another one, and I withdrew from the last administration's disastrous Iran nuclear deal. I recognize the true capital of Israel and open the American embassy in Jerusalem, every President talked about that for decades and decades and then they got to be President and they never did a damn thing about it.","I did it. I got it done. I even got it built for a tiny fraction of the cost. You know that sir. I also recognized Israeli sovereignty over the Golan Heights for 52 years. They were talking -- I got it done in about two hours and instead of endless war in the Middle East were forging peace in the Middle East.","Nations are joining one after another. The fact is I did more in forty-seven months than sleepy, Joe Biden did in forty-seven years except what he did for himself. A vote for Republican is a vote for Safe Communities, great jobs, and a limitless future for all Americans. And this is such an important state.","If we win this state, we win it all. This is such an important story and I happen to love this state. So in conclusion, over the next four years, we will make America into the manufacturing superpower of the world and we will end our reliance on China once and for all it's already started. We will hire more police increased penalties for assaults at law enforcement and we will ban deadly sanctuary cities.","We will uphold religious liberty free speech and the right to keep and bear arms. Second Amendment, we will strike down terrorists who threaten our citizens and we will keep America out of endless foreign wars coming home. They're all coming home. We will maintain America's unrivaled military might and we will ensure peace through strength and that's what we have.","We will end surprised medical billing require price transparency which is even more important. You will find that health care and its already signed. I did -- it goes into effect on January 1st. I said couldn't you have made it like a little back for that. They said statutorily, sir, but it's already signed and done.","Nobody can believe it further reduce the costs of prescription drugs favorite Nations. Drug companies don't like me too much and we will always protect patients with preexisting conditions. America will end the first woman on the moon and the United States will be the first station to land an astronaut on Mars and it's happening quickly.","And we now, again, with NASA, have by far the preeminent space center anywhere in the world, not even close, and it was closed. It was dead. We will stop the radical indoctrination of our students and restore patriotic education to our school. We will teach our children to love our country, honor our history, and always respect our great American flag.","We will live by the timeless words of our national motto In God We Trust for years. You had a President to apologize for America. Now you have a President who is standing up for America and standing up for the great people of Arizona. So get your friends, get your family, get your neighbors, get your co-workers, get your boss, get out and vote?","Get out there right away, right away, right, right now from Phoenix to Flagstaff, from Tombstone to Prescott, from Messiah to Yuma to Red Rock and Sedona all over the place. This is so beautiful. How good is this place? You got the most beautiful Sedona. We stand on the shoulders of red-blooded American patriots who poured out their heart, sweat and soul for our liberty and our freedom.","This great state was settled by some of the toughest men and strongest women ever to walk on the earth. Jim, are you from here originally because you're tough, you're so tough, you're close enough, he's flustered, he's so tough, Arizona's where Wyatt Earp and Doc Holliday became American legends Wyatt Earp right?","That's a good one. That's a good one to have. It's where the great American West became the American dream. And Arizona is the state where generations of pioneers and prospectors and miners and ranchers, cowboys and cattle hands, marshals and lawmen tamed the frontier braved, the blazing sun like I'm doing right now.","I'm gonna pay for this. I'm going to pay for this. I'm giving you the full show. I got a left here a half an hour ago. I'm giving you -- I sat down with when you see me tomorrow and I look like a lobster, remember you did and showed the entire world how the West was won. They helped make America into the greatest nation in the history of the world.","And the best is yet to come. It's coming proud citizens like you helped build this country and together we are taking back our country. We are returning power to you, the American people with your help, your devotion, and your drive. We are going to keep on working. We are going to keep on fighting and we are going to keep on winning, winning, winning.","We are one movement, one people, one family, and one glorious nation under God and together with the incredible people of Arizona. We have made America powerful again. We have made America wealthy again. We have made America strong again. We have made America proud again, we have made America safe again and we will make America great again. Thank you, Arizona, get out and vote."],"text":" Hello Prescott. Hello, Prescott. I'd better speak fast. This sun is hot, This sun is hot. So did anybody notice? I'm sure you did that we flew over, right over your -- we have the greatest pilots and the greatest equipment anywhere in the world. I said. I wonder if there'd be any danger. No, sir, don't words fly and then flying over. I noticed something red, I saw this crowd, and then I saw a crowd bigger than this over there trying to get in. Can you let him in, let him in let him come again, just let him in. I felt we could wait. Would you like to wait about an hour as they feel? Do you have speakers back there, please? All right, you know the fact is in every report, this stuff right, right. Sleepy, Joe Biden yesterday had seven people and then they say he's tied in the polls in Pennsylvania. I don't know there's something going on here. There's something funny going on. So you know the votes are coming in and they're very much inclined to be with us. I don't know if you see, you know early voting because our people like to go out like and vote, right? They like to vote, they like to vote and it's incredible. What's happening so the early votes are coming in and a lot of areas and they're starting to get a little bit nervous on the other side. In Michigan, we're leading the early vote, we're supposed to be a 20 percent, and then we catch him right in the final days like a racehorse. No, no, no, it's uh, it's gonna be very big. You don't have events like this and you come in second in Arizona. okay. You don't do that, you don't say I don't like -- I don't like say let's leave now. Goodbye, you twenty five-forty thousand, whatever the hell the number of people. Goodbye, everybody. Oh, we're in second place in Arizona. You know, I don't think so. Nowhere we're in first place in Arizona, but you know these fake people back here, the press the media, they're fake and same thing. Same thing happened last time, only worse it was crazy. Unless I may never did it before, so I believed him, and then what happened is we had the day and I was down in nine states that I had to win, right. I was down in all nine on Election Day and we won all nine, right? No, they said they said this will be a very poor day for Donald Trump that time Donald Trump. This is going to be a rough day for Donald Trump down in nine states into the evening and you saw them cry. Remember the guy with also John King, oh my God, he just won Wisconsin, he just won Michigan, he just won Arizona, he just won Pennsylvania. What's going on, not a -- we're not having a good day. They were not. This is going to be even better. I think. I mean, the only difference is that one big risk is they sent out tens of millions of these unsolicited ballots and we're trying to find out who did this send them to, when do they send them, where did they send them, who sends them back. Some of these governors say you don't need certain signature verification. Why would you need a thing like that? No signature verification. In some cases, you don't need a signature. Why would you need a thing like that now they found 50,000 in a river, they found 53,000 in a creek. They found many in a garbage. Can. They happened to be from the military, many of them they were in a garbage can. They found them and they all had the name Trump on that shotgun. They were military all in favor of Trump and they found him in a garbage can. I got to tell you, that's the only thing I'm concerned about. And we have law enforcement watching every one of them, but they have -- they have and you have to watch him to 15 days from now. We're going to win the state of Arizona and we're going to win four more years in the White. Everybody needs to get out and vote return your absentee ballot today or vote early in person as soon as you can. When is that starting the early, when does that start now now get out now, right? I like that better Mom, you know, you always get this but and your state is doing great. You have a great governor as you know and your state is doing great. With a pandemic pandemic, you're getting tired of the pandemic rather than tired of it. You turn on CNN, That's all they cover, covered, covered pandemic covered, covered, covered toes. You know why? They're trying to talk everybody out of voting. People aren't buying it, CNN, you dumb bastards. They're not -- I watch this guy's got lousy ratings, Fredo, you know, Fredo got horrible ratings. He's talking about the pandemic. That's all they talk about. You know, I don't know, he said he had it. I'm -- I'm not sure he had it. He went to the basement, it's the only time his ratings were up, people want to see what was going to happen. You'll probably get it again, even though in theory, you're not supposed to be able to -- well, I had it and they say you're not going to catch it again. And that's okay with me. Oh, were they happy when they heard? I had it right? Did you see it? Oh, I was -- they were dry. Well, we hope he gets better. We hope he gets better soon. And then I came out, I did a rally. They said this guy hasn't changed. Actually. I say I'm nuts. I don't know if this is a compliment, they said he looks better now than before he had it. What's -- What's that, who knows? If you haven't, you haven't -- you get better, but we have great therapeutics. We had -- I took something regeneration which we're making available to everybody free. But to me, it was a cure. It wasn't a pen, it really -- it wasn't a therapeutic. To me, it was a cure. I took it, I didn't feel so great. I will tell you that I don't like to admit that, but for a long time, I didn't feel too great. And when you're President, you have a lot of doctors checking you out, right. I told a story last night. We went by the way these rallies they're unbelievable and I like this better. Remember we're outside. They all want us to be outside. You know they were -- they're all wanting us to be outside and these are outdoor rallies and we could hold more people than we can in the arenas. These are the biggest rallies these are the biggest rallies ever had in history by a political candidate. They won't say, oh, it's great, it's great, but I took it and it was incredible credible. And I was out -- I took it and I felt like Superman The next morning I woke up. I -- I love you, Adam, with your vote. We will continue to cut your taxes and regulations to maintain your energy independence, strengthen our military. Support our great beliefs protect our Second Amendment, which is under defend our borders, arrest violent criminals, and confirm more judges to uphold the rule of law. We have a record number of judges who say that a record number of federal judges and we have a great one right now hopefully gets approved next week. Amy, under my leadership prosperity, will surge, patriotism will soar optimism will boom, the pandemic will soon end its rounding the corner. They hate it when I say, you know, they always like to say about Europe for this and that really, oh, really how they doing, how are they doing, I'll tell you what and we're working with them. We're sending them ventilators, we're sending them everything, but we're rounding the turn. We're going to have the vaccine, but with or without it just happening soon, by the way, would even happen sooner if we didn't have these characters. On the other side, the Democrats that are running all these failed cities. The Democrats are running your failed cities, you know that, right, and states, but if they weren't talking because they don't want it to be, you know they -- they don't want it to be successful. I really mean it. But ultimately it's going to all come together because it was coming together and then we got hit by the China plague. We were going to all be well, unified people were calling me that you would have never expected it was coming together because of success and then we got hit by the plague we closed up, which we did a great thing. We saved 2 million lives or more. 2 million lives, you did a great job, we never got credit for. We helped all of the states and the governors, some did a good job, some did a horrible job. I'll tell you who they are one day. Do I have the all-time great book? I have the real Booker. But like a lot of these other people, I don't like writing books while I'm running, I don't like writing books while we're in office because you don't do that. Normal life will rapidly return, that's what we want normal go take us back seven and next year will be the greatest economic year in the history of our country. That's what's going to happen and we're going to cut your taxes. This guy's going to raise your taxes by four times, think of it and now he's saying, well, maybe I won't take away the tax cuts because you said we're going to end the Trump tax cuts. They said, well, it's going to ultimately be eight thousand dollars a family. He said, well, maybe we won't end up. That doesn't sound so good. He has look, he's Gonzo folks, he's gone, he has no idea. And the people that are running that party are radical far-left maniacs and you can't let this -- this is the most important election in the history of our country. This is election that's a choice between a Trump recovery at the highest and -- or a Biden depression. You're going to have with what he's going to do with regulations, what he's going to do with taxes, every company that came in from Europe, from Asia, every company is going to leave as soon as I'll tell you what, even the thought of it as an example, Foxconn? Foxconn in Wisconsin, incredible company. It makes a lot of the Apple equipment stuff, right. The phones, the iPhones, iPads, incredible company, they don't like the Democrat governor. They don't want to spend the money. They want to come and spend a lot of money. They don't like the possibility that a sleepy, Joe could get in. They don't want to invest billions of dollars in having those policies, so they pull back. If Trump gets in, they will spend billions and billions and billions, not your state, but Wisconsin, probably your state to billions of dollars. But we speak to them. They're unhappy when they see this Democrat kind of leadership or even the chance that it is. So where do you see what Foxconn does in Wisconsin? OK Different place, but where do you see if we win, they will make an investment the likes of which our country has rarely seen before. But this is all a choice between getting a safe vaccine or really a lockdown. You know Biden wants to lock it down. He wants to listen to dr. Fouchier he wants to listen to Dr. Fouchier. And don't forget Dr. Fouchier what he said is No, no, don't close it to China. I said -- I'm sorry, Doctor, you're a wonderful man and I is a nice man. You're a wonderful man. I'm closing it. I saved thousands of lives. He admitted that two months later, two months later, and Dr. Fouchier said, don't put on masks, don't you see the thing? And now he's just put on masks and they say, you know, he's a wonderful guy and he is a wonderful guy. I like him. He just happens, have a very bad arm. He's a bad guy, but he's a good guy. He's a good guy. A lot of our people don't like him, I like him. You have to understand him, he's a promoter and it's a choice between the American dream or a totally socialist nightmare. That's what you'll have. You'll be a socialist country and I said our country will never be a socialist country. We're not going to let it happen. Joe Biden has made a corrupt bargain. By the way, he's made many corrupt bargains. If you've been really, you know, he's all shut down again. Can you believe it? He's going lead, you know, lead means lead means a politician, goes into I guess a garbage cans put the lid, they put the lid on it, right? I guess, I don't know, maybe it's something else it sounds, you know, there's an expression that kept saying Sir the vice, but our Vice President Pence is working his ass off until he's All over the place. He's great, did he do a good job against Kamala if that were a fight, they would have stopped it. Now Pence is great, but they put the lid on it every day you wake up. Where's my dinner, sir? He's lit it out, He's lit it up. What does that mean? That means he's going to stay in the basement all day, but I think today he's staying in the basement to talk to his lawyers. They got him called, I'll tell you something. I mean this suit, he is lucky that we have in our country and they don't appreciate a wonderful human being and the most fair attorney general of the United States because I know people that would have had him locked up five weeks ago. Bill Barr is a very nice man and a very fair man. And they have no idea because somebody else would have taken that thing and all that crap and corruption. He's been a corrupt politician for a long time this guy and in many ways, it doesn't make some of us happy. But in many ways, Bill Barr is a wonderful human being and a very fair person and he's not a person that wants to hurt people. Just remember that I say it and I say it once just remember it because I get angry too, but just remember he's a very fair man and in many ways and especially in that position, there's something very nice about it. Okay So what can I say, joe? Biden has made a corrupt bargain in exchange for his party's nomination. He has handed control of his whole group over to the socialists, the communists, the Marxists and the left-wing extremists. You know that you see a march in the streets in these Democrat-run cities. You don't see him in the Republican-run cities. They're in charge and they are calling the shots if elected Biden will delay the therapies. Look, I mean even the vaccines they're trying to say, oh, it's no good. If Trump has it, it's being done by Johnson and Johnson Pfizer. Then I don't even know who these people are right. If it comes out with Trump, How bad is that they are willing to demean a vaccine for political purposes. I saw it this morning. If it's No, no, I saw it this morning where a governor who's done a truly poor thousands, tens of thousands of people have died in this state. Andrew Cuomo, he's done a terrible job. 11,000 people died in nursing home. He have put him in the convention center that I built. He could have we open up twenty-eight hundred beds. We moved the big hospital ship. It was empty, could have put him there. He put him back in infected people back in with our elderly population knowing that our elderly population is susceptible. Andrew Cuomo, he killed thousands and thousands of people probably listened to his brother Fredo. You know, Fredo. Right now, it's a shame and you know it's just a shame, but I saw him. He was knocking the vaccine. If the vaccine comes out during the Trump administration, we're not going to use it something to do with me. It's Johnson and Johnson, it's Pfizer, it's about Derna. These are the greatest companies in the war has nothing to do with me. We need a vaccine and when it's ready, it should come out already. It could, in my opinion, except for politics, they just don't want it to come out before the election. But you know what I'm the one that did it. This thing wouldn't be here for two years and they're ready to come. But it's a shame, it's a shame when you try and demean something so important for politics. It's a shame. But they'd like to postpone the vaccine, prolong the pandemic, close, your schools shut down your country. We're not doing it, by the way, you have -- you have a great governor the way he did it. You have a great guy. He's here someplace. We'll get into it with Alex, where's that guy? I don't get up yet. You'll have huge. Don't get too much sunburn the governor and tell me who's gonna be this hot out here. Does anybody have a little sunblock? I'd love to use it right now. I'm always preaching to my kids sunblock and here I am like an idiot. But that's a. Massively raise your taxes by and he's going to raise your taxes. First time I've ever heard of a politician he wants, he's running on raising taxes, that's how crazy the world has become all my life. I see politicians, they want to cut your taxes. We're going to cut your taxes. The other guy says we're going to cut it more well. This is an easy one for me then because we're cut it. We gave you the greatest biggest tax cut in history. And he's going to give you the biggest tax cut in reverse because what he's going -- he's going to endorse, but he's going to give you the biggest tax increase in the history of our country. Now. Now think of it, think of it who the hell can win with that platform and if you listen to these people, this election is tied with three points up in your state. But I don't know, I think how can you be three points up when we have droughts like this and nobody shows up so he wants it. So we're cutting your taxes, he's increasing your taxes. Just those two things isn't that sort of the end of the election. Now we can make the case, you know, something is good, it will destroy your -- for one case, it will destroy the stock market which is ready to reach new historic. Can you imagine rounding the turn or the pandemic and we have the highest stock market we've ever had, think of this and some of our numbers are higher than they were housing and different things. Some of our numbers are higher than they were even before the pandemic. I mean, it's pretty amazing, you know why? Because we built such a strong foundation, if we didn't have that strong foundation, this would be a disaster he wants to bury you in regulations, outsource your jobs, dismantle your police departments, dissolve our borders. He doesn't want borders. The wall by the way is almost finished. And you have the strongest southern border you've ever had. He wants to confiscate your guns, get rid of your second amendment. He wants to ban American energy, no fracking, how about that for a year and a half? He says no fracking. Then he goes to Pennsylvania. We have a million jobs. The state is dependent on it and all of a sudden he says, Oh, but I guess we can fry. And the press doesn't call him because they are more corrupt than Biden himself. They want to wipe out your private health care plans. A lot of people have 180 million people have private health care and they love it. They're so happy and it's all going to disappear. You will be able to go to your local hospital ward and stand in line for six weeks when you have a cold or when you have something worse? This is what's going to happen. He wants to terminate your religious liberty, destroyed the suburbs. They're not destroyed. We ended the regulation. I ended it, you know that women of the suburbs, please raise your hands okay. Look at it. Look at that crowd. So women of the suburbs, look, here's a state where women of this up, the fake news has been saying the women of this show, they said this last time too. Women don't like Trump and then they saw then they saw 52 percent voted for Trump, right? I said why don't they like me that I like me they couldn't get. And then after we won, they said women, women came out for Trump. What happened? Women, I like women, I like them. So anyway, no. But listen, here's the story. They said suburban women, I used to call suburban housewives, I got killed all the time. I said I better go politically correct and I'll bet there's not. Is there one woman here that minds being called if you're married, at least a suburban housewife the only one she wants to, because he's single, no, the only one that minded those characters? A lot of people up there the press right, that's the only one. The rest of them don't, But you know what in keeping with -- in keeping with our modern era and being politically correct. So the women in the suburbs, so you have a regulation now that's a disaster. It allows low-income housing to be built right next to your American dream. What ultimately it means is crime will come pouring. And you know what these anti for people and the radical left and it is the radical left. It is the radical left. The radical left, the next place they want to hit the suburbs. They say it all over, right? And what I did with the regulation my people came in. He's great. Ben Carson, Dr. Ben Carson. He's great, but Ben came to me. So we can say I want to get rid of that regulation. It's a horrible regulation getting worse all the time and I've watched it for years, you've all watched it right, where they destroy these incredible communities and Ben said, well, we can really bring it down and make it much more palatable. I said no, Ben, you know what? That's going to be more controversial terminated. You said, yes, sir, you terminate, we terminated it. You have no more regulation. Now if sleepy crazy crooked Joe gets in, I don't know he shouldn't be allowed to run if that were me. If that were me, they wouldn't allow me to run if that were me. Can you imagine if Don Junior had the problems of Where's Hunter, right? Don Junior, oh my poor boy -- boy what that boy's been through, what that guy's been through. I don't know if [Inaudible is different, she sort of floats through life. She's pretty amazing. She's pretty amazing. And Eric, Eric has been great, but what they went after my kids and I restrict him from doing things. I mean can you imagine the money? My kids could be dad, let's build a hotel in Saudi Arabia? I restrict intimacy, can't do anything, let's go build a couple of hotels and in name any place in the world. We'll have them, right and you know all the money that Biden's raising, he did three hundred and fifty million. I would be Doug the greatest. But I'd make Doug look like a bad fundraiser. I would be the greatest fundraiser in history. All I have to do is call up the head of every Wall Street firm, head of every major company, head of every major energy company. Do me a favor, send me 10 million from my campaign. Yes, sir, they say the only thing is why did you ask for more sir? I would -- I would be -- I would take in more money, but you know what? I don't want to do that because if I do that, I'm totally compromised. Because when they call me, you know, you're a loyal person and what happens is say, you know, you'll do things that are a lot more money. So when the press says and we're raising a lot of money, we're raising a lot of small money, a lot of 61, 62, You know, no Republicans ever done that. But when I start calling, I would be -- I would be the greatest fundraiser in history. Don't forget, I'm not bad at that stuff anyway. And I'm President. So I call some guy the head of exile I call the head of exile. I don't know what you know, I'll use a cup. Hi, how you doing, how's energy coming? When are you doing the exploration? Oh, you did a couple of permits, okay, But I called the head of Exxon, I see you know, I'd love to send me $25 million for the campaign. Absolutely sir. Why didn't you? Would you like some more and if I make the call now, people make the call, it's different, you know? But if I made the call, I will hit a home run every single call, I would raise a billion dollars in one day if I wanted to. I don't want to do that. I don't want to do it. I put in a lot of money when I ran originally, I put in a lot of money into this campaign, you know my primary campaign and I'd never thought it was appreciate it. They don't even. They'd never give me credit for it, but I gave up my salary, you know, I gave up. So the President is paid now, but nobody ever talks about, you know, every month this sleaze because they're sleaze vote stuff, if not all that guy's a good. But that he really -- you do have a couple of good guys, but not many, but every month they call the President giving up his check. I don't have to -- you know, I'm the only President they say, maybe I'm wrong, they'll say, oh, you know hundred years ago somebody else did. I'm the only President that did not accept a salary, which surprised me. It's 450,000. The only reason I mentioned it is they never talk about it, they never talk, but what they do -- do is they call up every month. Did he give up his check and W Kelly, she here, Kelly are great. Where's Kelly Kelly? She's around Kelly Kelly wait, so she just recovered from covered. Would you believe it stay away from me? Kelly? No, Kelly, is it true? They call all the time. Did he give up his check his salary check and she's always it? okay, They a write about that? If I ever didn't give it up, it would be headlines trump refused, these people are the worst, but is that true? Kelly said a couple of that is absolutely true, Mr. President. And let me tell you this guys with your help, we can beat social media. We can beat the media because we have the greatest fighter. In the history of this country and President, Donald J. Trump, so great, she is so great. I didn't know she'd be that good, that was good. Sometimes they get people up and they bomb, you know, they bomb, you know, she's married to a professional, major league baseball player. He got lucky. He got lucky. Thanks, Kelly. But it's true, it's true, but I'd be the greatest fundraiser of all time for the last forty-seven years, sleepy, Joe Biden shipped away, your jobs shut down. Your factories threw open your borders and ravage our cities while sacrificing American blood and treasure in these ridiculous endless foreign wars of countries that you've never even heard about right. You never even heard the name so sad, they're all coming back. You know that Joe Biden is the servant of the globalists and the lobbyists and the wealthy donors, the people that I could be calling would I have fun. I would have fun. I'd like to come, maybe I should call and put the money in escrow and just give it back to him. And the Washington vultures who got rich bleeding America dry, that's what happened including big pharma. In 2016 You voted to fire this corrupt and decrepit political establishment and you elected an outsider as President who is finally putting America first. It's about time, fifty-six percent. Did you see this fifth? And where to put a pandemic okay. Because in China, we're in a pandemic, a poll just came out, Gallup 56 percent of the American people in this brand new poll just came out. Gallup poll say they are better off today than they were four years ago under Obama, Biden, administration and it's a record number. Will you do me a favor one, just one favorite today. Will you please go out and elect Martha stand up for great, great pilot when we came in love with the helicopters. She said the way she could have been two hundred feet lower. I said that we would only had ten feet clearance. She said, I don't care, she was a great pilot. The Warthog she flew the Warthogs on an incredible plane, get her elected. Will you please? A waste, we don't want to waste a lot of time off to get her elected, okay, please that other guy he's bad. I mean he's good if you don't like, does anybody not like your second amendment because he will vote to get rid of your second amendment. You know that you know, I mean, I know the whole thing and the history and it's a sad deal that all of that stuff, but he's a radical leftist and he's going to vote to take away your guns and somehow Arizona and no guns don't seem To match up very well. He's going to take away and I'm much more blunt, I think than Martha. She's a nicer person than I am. I say it very directly. He's going to vote to take away your guns now. I don't know that he'll be successful because hopefully, he's going to have to go through me, but what the hell do we need that therefore she will be a great Senator. And she has been a great Senator. She was appointed by Doug and Doug is one of the best governors in the country and he didn't close you down and you couldn't breathe like in Michigan. You know the court, the Supreme Court overruled her in Michigan and you know, part of the problem she had, the only one that has freedom was her husband. He was allowed to go swimming, fishing, boating, everybody else's on shore. They see this guy boating and who was it, it was the husband of the governor of Michigan that didn't help their case by the way, but -- but no, I mean, the people in Michigan, I love them, were leading in the polls in Michigan. But think of it, you know why? Because we have many car plants, they didn't have a car plant opening in 42 years. And then I came along now they've got so many of they don't know what the hell did do. We'll send some to Arizona, okay? And you already have them opening up in Arizona, no, but you know they've got to open up the states, they've got to let the kids go back to school. Barron -- Barron Trump. Barron Trump had it all these young guys, Barron Trump had it, he's very young, he's 14 and he's very tall. He is very tall, but Barron had it and the doctor said our First Lady had it. I had buried at it sir Barron tested positive, I said oh, well, how's he going to do very good, sir. No problem, I said good like 14 minutes later. How's buried? How's he doing doc? How's my boy doing, sir? He's cured what's that? You know, it took about 12 seconds. How's Baron doing doc? I want to be -- I want to make sure my Baron's okay. Sir, he's fine. Well, what do you mean? He's fine. No, he's all 100 percent. Can you believe it because I hate to admit it, all of us people that are slightly older, their immune system is strong, very strong. So Baron had it, it came and went, he's immune, you know, that's the way it is. Those kids, those kids, I looked at Baron like he was Superman, I said Baron, you my man. I said How you feeling he didn't even know what he was talking about. Actually, Joe Biden is always -- it has been a corrupt politician and as far as I'm concerned, the Biden family is a criminal enterprise. If you read, if you read, if you read this laptop, I tell what this is called the laptop from hell. The only laptop that was almost as good maybe worse was the laptop of Anthony Weiner. Remember that ding, ding, ding, ding, he got hacked too, just like Sculley got hacked. Remember he said he got hacked, he was sending messages to very, very young women. Girls, girls choose me, girls, he was sending messages, a lot of them and he got hacked. They always say they got hacked Sculley, got hacked right, Sculley. He was a Never Trump or he got hacked, you know, I've never known a person that said he got hacked, they got hacked, nobody gets hacked to get hacked. You need somebody with 197 IQ and he needs about 15 percent of your passwords doesn't happen. So Sculley got hacked and now on Thursday, I go up another day. The real great one, another great one. Kristen Welker, she's a radical Democrat. Look at him, they're getting angry. She's a radical Democrat, she deleted her entire account. Everything is deleted, but I've known her. She's been screaming questions at me for a long time and she's no good. But I figure what the hell. Yes, you're right. How did I do the other night against one that was worse? She was worse, Savannah, so I had Savannah Guthrie the other night. She was -- she was like a crazed lunatic. She was literally rising out of her chair. She's screaming questions and how about that? Great woman behind me. She kept going. I love her, I don't know too much. I met her right after she's great, but I tell you she was definitely a Trump person. They made a big mistake. You know the mistake they made was they forgot to check your audience, the audience was great and how about the woman that came up and said, I love your smile, you're so handsome, you're so handsome, you're so handsome when you smile. I love your smile, sir. Can I ask as you so nice and then what happened is NBC, which is the worst that's Comcast? I called Con a Because it got, you know, they spent a fortune on public relations and I talk about it, wipes out the whole Europe public relations con that Comcast they're dishonest people, okay, Totally dishonest. So she said really, I mean look this woman lied to me. I know when somebody likes me, I know when they don't like me, it's very quick. It takes me like a fraction of a second. I love your smile, sir. You're so handsome when you smile yourself. Could I ask you okay? okay. Ready now they grab it is -- it is just not working out well, so they grab her and I did, you know I was long gone and they interview her after. I do not like him, I did. They told her you can't do that, got to say bad things. I have no doubt because I watched you interviewed afterward, she hated my guts, she was going to like -- I don't like her, I'm going to vote for Biden, why? Because he said, geez, no, why are you voting for him? I have no idea. So that's what happens. We're dealing with a corrupt crooked media, just remember that. And I'm glad I came along because there's no other human being on earth other than maybe Doug Doocy that could've handled the crap that I've had to handle, let's say what every other person, even a tough person would've been in a corner long ago with his thumb In his mouth saying, mommy mommy, take me home, right? They would have said mommy, please. I can't take it, but me, I viewed it as a challenge. And what it really is, is we're exposing some real garbage. And you know these tech companies are very dangerous because they refuse to allow even the New York Post, which deserves tremendous credit. They caught Biden in a scandal, the likes of which we haven't seen. I say the second-worst in the history of our country. The first worst was when they spied on the President of the United States and tried to take him down and they spied and they got caught. Let's see what happens. Let's see what happens. That's to be the worst this could -- this is the second, but this could be leading into the first. I mean, you know this is -- this is -- this is a grave grave problem, but you're lucky, I'm your President, you're so lucky, you're so I always tell a great First Lady darling. You're so lucky I took you on this wonderful journey as we get hammered by these fake people, we get hammered every day and I say, darling, you're so lucky. I took you on this journey, but they do love Michelle Obama. They love Michelle, you know, did you hear the new one? They came up to me sir. I have bad news. President Obama is going to start campaigning for sleep. Joe, I said is that good or bad news because don't forget he campaigned for Hillary harder than Hillary did right. He said he will not get the nomination. I got the nomination, he actually said he will not run. I read he will not get the nomination, got the nominee, he will not be a President, he became the President, do she thought I was going to get him? No, he's got it. You know the funny thing about Obama, look they work together for a long time like I work with Mike Pence. They worked together for a long time and he tried to talk him out of it because he knows he's not mentally fit to be President. We can't play games. You know, we can be nice and say, Oh, he's wonderful, he's not wonderful. You know, two days ago, he said it is very my much really great honor to be running as a Democrat for the United States Senate. And he meant it with me, I'd be joking, maybe and they sell to Guy mentored, that's about the third time he said that too. That's a little bit see that's not like something that you know you pronounce a word wrong or something that's serious problems. And when he says that like it's great to be with you people today in the great state of Ohio and they say you're in Arizona. Oh, I -- at Arizona, I love the people who are, you know, I always say he's done that eight times now where he's in. I've never done it. I've never done it when I do perhaps it's time to retire. You know, if you do that, it's disqualifying because it's so bad like you could be, you know, Winston Churchill was a great, great speaker. You could do that. So we're in Arizona and if I said I love the people of Ohio and it's great to be with you today, right? The worst was when I think he said he was in Palm Beach and you know palm trees. And he said it's great to be with the people of Iowa, right, right? You know there's something wrong here. Something going on right, but he said just three times recently, but the last two days ago that he's running for the U.S. Senate and I'm actually happy he's running for this cause. I mean, hey, look, he's the worst Presidential pick in the history of Presidential politics. I think and I say this and you know they always take that one little step. Have you seen how dishonest they are? They'll take that one little section. I say if I lose to him, it'll be a disgrace. So they don't put the first part in. They don't put the end to it. They just -- President Trump thinks he's going to lose it because they take that one little sections out to be very, very careful with because they're so corrupt and so dishonest. But it is true, he's probably the worst in the history of Presidential politics win, lose or draw, win, lose or draw. This man should not be your President. Number one, he's corrupt number two, he's not a smart man, never was number three. He's seen better days. So are you ready to -- let's get, isn't this better than reading this stupid teleprompter? So if I don't sound like a typical Washington politician, it's because I'm not a politician if I don't always play by the rules of the Washington establishment. It's because I was elected to fight for you hotter than any President has ever fought before. We're not going to lose our nation to socialist, communist. We're not going to be losing our nation to Kamala who's further left than Bernie, I'd rather Bernie than Kamala. And you have a woman President someday, but it's not going to be Kamala. You don't want that as your first. You don't want Kamala furthest left and she treated Biden so badly. There was nobody that you interposed them, but she was tanked. She left, I don't know, that's the kind of thinking you've got -- that's the kind of thinking you have. You're supposed to be voting for. I guess I'm fighting so hard because I love my country so much and because I'm determined to ensure that the forgotten men and women of this country are never forgotten again. That happened, so we're joined by a great group of warriors and I really would love just to come up for a second. You do have a great governor and a great friend of mine, Doug Ducey. Come on up. Doug and Senator Martha McSally come on. Donald Trump will win the state of Arizona. Donald Trump will be returned to the White House. And I November 3rd, Martha McSally will join him in the United States Senate and they will give us conservative judges on the Supreme Court. They will support the cause of life and they will confirm Amy Coney Barret. Joe Biden is wrong for America. Joe Biden would pack the Supreme Court. Joe Biden would make Washington D.C. a state. Joe Biden's got to be sent back to the basement on November 3rd and on November 3rd we will return Donald J Trump and Mike Pence as President and Vice President the United States back to the White House. Thank you so much. Welcome back to Arizona President drum has given up on Arizona. You know, we have a choice. People are voting right now. We have a choice. We are on the verge of a great American comeback and it's going to be greater because we're bringing jobs home from China with. We're going to make sure we support our men and women in blue and our border patrol. We keep America strong and you know that other choice is a Joe Biden and my opponent Mark Kelly. Who would be -- who would be Chuck Schumer's 50 first votes to ram through their radical agenda to pack the courts to open our borders to pass the greed bad deal tax increases taken away our second. I mean, you know that Arizona is not going to let that happen and you know, in my race it's not just whether you like a fighter pilot or an astronaut. And I know you guys like a fighter pilot like mike Kelly brought a communist China communist banner to space with him and flew the American, the communist, the Chinese flag on his motorcycle. I fly the American flag like Mark Kelly, spokesman called police officers, worthless effing, pigs and he still works for him. I backed the blue, I got the blue with President, John, mike Kelly's organization, you know the radical gun-grabbing organization. They gave California and a grade for their gun control policies and they gave and they gave Arizona an F. I got an idea why don't we get Mike Kelly and F and tell him to go running California if he likes and. And Mike Kelly said that he would not vote for Amy Coney Barrett. I'm flying on Air Force One tonight with President John back to D.C. and we're not leaving until we put Judge Barrett on the bench. Arizona is ground Zero. The country is relying on us. This state will decide to send President Trump back for four more years. This day will decide the Senate majority and stopping the radical left in my race. This state will save the Supreme Court and save the country President shop in the country is relying on us, let's win in November. God bless you. Let's bring it back home. Thank you. Look at that crowd. I wish these people would, hey, can you put the cameras back there, please? Will you turn one of your cameras back as far as the eye can see its people? Unbelievable, unbelievable. They never do it, you know, they never turn the camera. I used to think they couldn't. You know, physically it was like stuck, they couldn't do it, but they can't because whenever there's a little problem that thing goes like a pretzel, it's unbelievable, but they never want to show these crowds. They never want to do it because they're fake. Listen, we have a Congressman who's a friend of mine, who's a warrior, Paul Gosar a warrior, thank you, Paul, a warrior, a warrior and a friend of ours whose incredible she is leading from what I'm hearing, Tiffany, I hear she's leading Congressional candidate, Tiffany shed, Tiffany. You're leading in the poll, wow, that's a long way. She's incredible what a great career in that you're doing. This is so great. Thank you, Tiffany. Tiffany shed get out and vote for a friend of mine somebody that was great. She would have been if she didn't have three or four people running at the same time. She would have been your Senator hate to say it, you would have been your Senator a friend that's so loyal and strong, but -- and a good person. Arizona GOP chair, Kelly Ward, she's worked so hard. She is some warrior and fighter and just yet they don't even understand it. Okay, I don't even understand you sometimes, Kelly, you don't -- She doesn't give up how are we doing? Kelly? We're winning, we're winning, Yeah, good. Get out there fifteen days, Kelly, every. Don't sleep don't go to bed, don't sleep all right. And Sergeant Jimmy Jevons of the National Troopers Coalition. Jimmy, where's Jimmy? Jimmy? Thank you for everything. Jimmy. Thank you for everything and I was recently honored to receive the Coalition's endorsement. And I want to thank you. You're really amazing. Thank you and a tough guy and a good guy. In addition, I was just named, I have to say this man of the year by law, enforcement's big magazine, it's called Blue magazine man of the year. I love Lord. So we're delighted to be joined by a legendary quarterback. I used to watch this guy, you know he'd win with the brain as well as the body. Jim McMann two time All-American at Brigham Young and later a two-time Super Bowl champion with Jim, whereas I love that guy look at him, look at that guy, look at that guy. I'll tell you and I loved your coach too. I loved Mike Ditka and I love Singletary, You know, Singletary likes Trump, you know that, right? You think Singletary is tough enough, how is he? Tough enough? Leggett reaches his own business. He's taking those pictures. That's him. Jim. You were a winter man and you are a winner. I made it, I'd say a lot of Ditka and say hello to Singletary and all those guys. What a great team right? I was a team of champions, you know you win with the muscle, but you got to win with this too. You got to win with this too. We just -- we just gave out a Presidential battle to a great fighter. Dan, does everybody know our Dan right out of Iowa, huh? And how about Jim Jordan? Is he a great one, Jim Jordan, right? He was a great wrestler we had so many. We have so many people that are behind us. Anyway, great to be with you, Jim. Thank you very much for coming. We appreciate it. Dan, Gable everybody, you know, Dan gamble, did you ever have Dan Gable? Hey, Jim, he was 182 wins and one loss. He won everything and he was an unbelievable coach in Iowa. Dan Gable and then think of it a career one. Eighty-two and one fact I asked who was the one, I guess he was pretty good, but he ended up beating him in the Olympics and then he went to the Olympics and he won the Olympic gold medal, Dan Gable. Any wrestling person would know. And in Iowa, Dan Gamble is like a legend and he is all over the country and in the wrestling world the greatest ever and he goes to the Olympics and he never lost a point. And in the final, he had to wrestle the Russian who was supposed to be unbeatable, but he was supposed to be unbeatable too. And he beat the Russian and never allowed a point. He went through the entire schedule and never allowed one point. Think about that. And he won the Olympic gold medal, and Dan Gable is now getting the Presidential Medal of Freedom. He's coming to the White House, so that's pretty cool. Thank you, Jack. Under my administration, we built the greatest economy in the history of the world and now we're doing it again. You know it's make America great again, right. So now I go make America great again. Again, make a great again again and that's what we're doing. We're way ahead of schedule. My first three years we increase family income by over six thousand dollars, more than 5 times the gain. Think of this five times, again we were actually more than that, more than 5 times again in all eight years under the last administration. Five times a game in a much shorter period of time, African-American unemployment and Hispanic American unemployment and Asian American on un-American employment. Think of that we all reached the lowest levels in the history of our country, African-American Asian American Hispanic America. We lifted six-point, 6 million Americans out of poverty including more than 1 point, 5 million Hispanic Americans who are liking Trump a lot. I like you too. I don't know if you see what's happening with Hispanic Americans. We are leading them in the polls which never happened before. I've always liked Hispanics and they like me, this was not a there. This was not supposed to be happening. But I love the Hispanic Americans and they're doing great. By the way, they're great business people. Our policies are lifting up all Americans of every income since the China virus. We've created a record eleven point, four million American jobs. Think of that, you know, we did, they just announced think of this, it sounds terrible in one way, but you were hearing numbers like 42 percent unemployment. You know it's not everybody's fault except China. It came in and you're hearing it could be 40 to 38, whatever. So they just announced it 7.8 percent unemployment. We're going to be back to where we were very soon unless you put a fool into office who's going to raise your taxes and put back all the regulations where every company is going to leave. Now think of it doesn't 7.8, you know one way I don't like to say it because we're down to 3.4, 3.5, but 7.8, if you would have heard that three, four or five months ago, you would have said impossible. And we'll be back to the same number and next year will be stronger than ever before you watch after the virus left, China, we experienced the smallest contraction of any major Western country and the fastest recovery by far of any country. Think of that as President I've been delivering for the incredible Hispanic American community like never before. I'm fighting for school choice for safe neighborhoods for Hispanic owned small businesses. I have a couple of them. Some of where my friends with a restaurant owner doing so well, they've made a lot of money. My restaurant, a couple of people didn't like that restaurant, I liked it and now they have lines around the block. Joe Biden would obliterate everything. Hispanic Americans have worked for wiping out your small businesses with lockdowns and regulations and devastating your families with massive tax hikes. He wants to give you the big, big fat tax hikes. He will wage war on Catholic organizations. Banned charter schools, bankrupt Catholic schools. We've already taken care of the funding for Catholic Schools Fund, extreme late-term abortion, and let socialists run wild in our country. And that's why we're going to win a record share of the Hispanic vote. There will never be a share of the Hispanic vote like this unless we decide to run again in four years. And then another run, we invested two 2.5 trillion dollars in the U.S. military. We have the best equipment of any country in the world. We've upgraded our nuclear to a level that it's never even been close to. We have new rockets and missiles and ships and tanks. What we have is incredible. The F 35 fighter jet, the best in the world, stealth tankers, do tankers, new freighters. We have everything 2.5 trillion dollars all made in the USA. We are the envy of Russia. We are the envy of China. Nobody has the equipment, even the hydrosonic missiles that Obama messed up on. We have hydrosonic missiles that go seven times faster than a normal missile. We have the best hydrosonic in the world. You know, they stole our plans during the Obama administration, another thing that happened. These are little things that happen that we don't -- That I won't tell anybody okay. We also pass for our veterans V.A. Choice in V.A. Accountability. Everyone said that would have been impossible. And last year American warriors killed the founder and leader of ISIS al-Baghdadi. We killed al Baghdadi and we have a very special person with us today. Just days ago my administration brought two depraved, ISIS terrorists known as The Beatles from the United Kingdom. These were two bad ones. These are people I would have liked to give to Jim and his team to work over to him, would've liked that. I think Jim would have been very happy to stand trial for killing of four American hostages, Peter carsick, Steven Sotloff, James Foley, and Kayla Mueller. As many of you know, Kayla came from right here in Prescott, Arizona, beautiful, beautiful girl, and we're deeply moved and she's been thought of all the time. Her family, as you know, a mother and father came and they spoke beautifully at the Republican National Convention. But we're deeply moved to be joined by her incredible and loving family. Her dad, Carl? Her mom, Marsha, and the entire family, we will hold Kayla's precious memory in our hearts forever. Just special, please stand please, please. You look younger since I last saw you. Yeah, look at you, you look very -- I want to thank you very much what an incredible story and you said if we were here, if we were here earlier instead of Obama, she would have been with us today. She would have been with us today and that's true, that's true. They could -- they could have done that, they didn't do it, they just talk, they talk all the time, they don't do it. I want to thank you very much credible. Her memory will never ever be forgotten. I want a story. It is what a vicious story, what a horrible story. But he's dead. We also took out -- they've been looking for him for many years. He was the founder of ISIS and he was rebuilding it because we obliterated the ISIS one hundred percent of the ISIS caliphate and he was looking to build it again. And we got him and you know the guys that got him on this story that not a lot of people now. I think it was Kayla's birthday, right? They used the birth date as the number and they took that number, that specific number that was their code name for taking out this horrible al Baghdadi right, great honor. They don't do that often. They don't do that often, but they use her -- her birthday and then they took him out. They didn't play games and a dog on that one became more famous than I did. And that's good. That dog was a hell of a dog and still is. We also took out the mass murder of American troops at a lot of other people and a lot of other troops. Soleimani, he is dead. Soleimani, another one, and I withdrew from the last administration's disastrous Iran nuclear deal. I recognize the true capital of Israel and open the American embassy in Jerusalem, every President talked about that for decades and decades and then they got to be President and they never did a damn thing about it. I did it. I got it done. I even got it built for a tiny fraction of the cost. You know that sir. I also recognized Israeli sovereignty over the Golan Heights for 52 years. They were talking -- I got it done in about two hours and instead of endless war in the Middle East were forging peace in the Middle East. Nations are joining one after another. The fact is I did more in forty-seven months than sleepy, Joe Biden did in forty-seven years except what he did for himself. A vote for Republican is a vote for Safe Communities, great jobs, and a limitless future for all Americans. And this is such an important state. If we win this state, we win it all. This is such an important story and I happen to love this state. So in conclusion, over the next four years, we will make America into the manufacturing superpower of the world and we will end our reliance on China once and for all it's already started. We will hire more police increased penalties for assaults at law enforcement and we will ban deadly sanctuary cities. We will uphold religious liberty free speech and the right to keep and bear arms. Second Amendment, we will strike down terrorists who threaten our citizens and we will keep America out of endless foreign wars coming home. They're all coming home. We will maintain America's unrivaled military might and we will ensure peace through strength and that's what we have. We will end surprised medical billing require price transparency which is even more important. You will find that health care and its already signed. I did -- it goes into effect on January 1st. I said couldn't you have made it like a little back for that. They said statutorily, sir, but it's already signed and done. Nobody can believe it further reduce the costs of prescription drugs favorite Nations. Drug companies don't like me too much and we will always protect patients with preexisting conditions. America will end the first woman on the moon and the United States will be the first station to land an astronaut on Mars and it's happening quickly. And we now, again, with NASA, have by far the preeminent space center anywhere in the world, not even close, and it was closed. It was dead. We will stop the radical indoctrination of our students and restore patriotic education to our school. We will teach our children to love our country, honor our history, and always respect our great American flag. We will live by the timeless words of our national motto In God We Trust for years. You had a President to apologize for America. Now you have a President who is standing up for America and standing up for the great people of Arizona. So get your friends, get your family, get your neighbors, get your co-workers, get your boss, get out and vote? Get out there right away, right away, right, right now from Phoenix to Flagstaff, from Tombstone to Prescott, from Messiah to Yuma to Red Rock and Sedona all over the place. This is so beautiful. How good is this place? You got the most beautiful Sedona. We stand on the shoulders of red-blooded American patriots who poured out their heart, sweat and soul for our liberty and our freedom. This great state was settled by some of the toughest men and strongest women ever to walk on the earth. Jim, are you from here originally because you're tough, you're so tough, you're close enough, he's flustered, he's so tough, Arizona's where Wyatt Earp and Doc Holliday became American legends Wyatt Earp right? That's a good one. That's a good one to have. It's where the great American West became the American dream. And Arizona is the state where generations of pioneers and prospectors and miners and ranchers, cowboys and cattle hands, marshals and lawmen tamed the frontier braved, the blazing sun like I'm doing right now. I'm gonna pay for this. I'm going to pay for this. I'm giving you the full show. I got a left here a half an hour ago. I'm giving you -- I sat down with when you see me tomorrow and I look like a lobster, remember you did and showed the entire world how the West was won. They helped make America into the greatest nation in the history of the world. And the best is yet to come. It's coming proud citizens like you helped build this country and together we are taking back our country. We are returning power to you, the American people with your help, your devotion, and your drive. We are going to keep on working. We are going to keep on fighting and we are going to keep on winning, winning, winning. We are one movement, one people, one family, and one glorious nation under God and together with the incredible people of Arizona. We have made America powerful again. We have made America wealthy again. We have made America strong again. We have made America proud again, we have made America safe again and we will make America great again. Thank you, Arizona, get out and vote."}