{"id":16,"author":"Donald Trump","title":"Speech: Donald Trump Holds a Campaign Rally in Jacksonville, Florida","date":"2020-09-24","link":"https://factba.se/transcript/donald-trump-speech-campaign-rally-jacksonville-florida-september-24-2020","paragraphs":["Hello Jacksonville, we love Jacksonville, I'm thrilled to be back in my home state of Florida with thousands of hardworking American Patriots. This is some proud. I just wish the cameras would show the crowd. They don't want to do that. They'd like to do that. You know it's harder for us to win, because we have a fake news back there, but but somehow we just keep on doing it is crazy is crazy.","This is some. You know it's interesting. When Biden comes to Florida have like 12 13 people. You know they do this and he has a hard time filling up the circles. Here we probably have 30000 people or so that's a lot of people. Well, I want to thank you forty days from now we're going to win Florida, we're going to win four more years in the White, and this is the most important election in the history of our country.","I believe that it is because we're dealing with people that are crazy, we're going to raise your taxes they're going to take away your Second Amendment. You know that your second amendment is not going anywhere with me. I can tell you. The Democrat Party has been completely taken over by socialists, Marxists and far left extremists.","They embrace the policies of Communist Cuban socialist Venezuela. They want to end the American dream for Hispanic Americans. We love Hispanic Americans, while you see they released a poll today. That said, Trump is doing really well with. What's going on with the Hispanic, it took you so long to figure out that I love you.","How long did it take no more of that stuff? Now that Hispanic Americans are great, and you know they did, they released a poll today and nobody's ever seen anything like it. The Republicans are beating the Democrats with Hispanic Americans speaking we're doing great we're doing great and they never like to show those polls.","Whenever you see they don't show too many polls, it's only because we're winning we're winning by a lot. We think we're winning by like a lot, but the only poll that counts is on November 3rd right. That's the only poll that counts so get out there. Don't let him bluff you whatever it is, get out there and vote.","The Republican Party is the party of jobs, safety and freedom, and we will ensure that America never becomes a socialist or communist I've added that recently less said socialist country. I said now a socialist or communist cut, because these people are crazy. Kamala you know Kamala is further left than Bernie.","I didn't know that she is the furthest left in the U.S. Senate. She was up at 15 percent when she started. You know that right that story. She went down to 40 and then she went to twelve that you went to eleven. She went to 9 and 8 6, 4. 2. 1., And then she left before I with the great state of Iowa. Well, I made it all possible for them at all, and I gave our farmers twenty eight billion dollars.","Thank you very much china. We took it out of China because they were targeting iowa and Nebraska a lot of our great states Wisconsin. We gave our farmers a lot of money. Some came down to farmers down in Florida. They don't know that we got a lot of farmers in Florida, but here's the choice facing every Florida vote, Joe Biden, will deliver a crippling shutdown he's actually thinking about.","Can you know we did that and we saved millions of lives? That's it we're doing good now and by the way your governor has done a great job. Florida is down. No doubt the china virus, its China, some people call it corona virus. That sounds like a beautiful place in Italy. Right now, it didn't come from. Italy came from China, but this guy stuck in here, shut it down to be scientists and shut it down, shut it down.","No we're not shutting anything down, we are doing so. Well, you look at our numbers. What do you see the third quarter? I shouldn't say it because back there, but when do you see how good the third quarter is going to be when it comes out just before the elections, I'm taking a risk? When I say it, you won't believe the numbers you say I tell you, you're going to see numbers nobody's going to believe those numbers we're hearing from 25 to 35 percent GDP.","Nobody's ever heard of that. Well, Iran has a 25 percent GDP too, but it's a negative GDP of 25. They just announced negative 25. They don't like me too much be careful, be careful, I'm delivering a safe vaccine and we're doing a record recovery. This recovery is a record they've, never seen anything like it, and next year is going to be, I think, the best economic year in the history of unless a very sleepy guy got in he decided to quadruple everybody's taxes.","Then you can forget. A. Sleepy guy, did you see he did it live this morning? Again, live live, you know it. A little is a little is when you put out word you're not going to be campaigning today, so he does a little all the time. I'm working my ass off. I'm in Texas, I'm in Ohio, I'm in North Carolina s., I'm in Michigan, I'm all over the place, miss Wisconsin back, but he puts a lid on so I left I didn't know what the hell I live once I've only been doing this for three and a Half years or so, but I'll, let you know you're not going to go out today, you're going to stay in your apartment or, let's put it this way in his basement so early in the morning, he's put a lid on.","That means nothing for that. I guess they do that for the press, the fake juice goes home and they say how great he is as a candidate. They go home and they say he's a great candidate, but he put another letter in many lists, so he did a lead today early in the morning that he won't be working today and I don't know I'm working so hard -- maybe he's right! Think of it, supposing he never campaigns and he wins.","You know how badly I'm going to feel. I'm working hard and you've got to work hard, and you know what I said today. We cannot have a low energy individual as our president. We can't and he's the lowest energy individual I've ever seen. I've ever seen so we'll see what happens but he's living up. Maybe he's going to be great at the debate.","Know he's been doing it for 47 years. Somebody said: Oh, he won't do well at the debate. I said I think you're wrong. He'll. Do fine he's going to do fine you'll, give him a big shot of something and he'll go out. There have a lot of energy ups. He'll, have energy he'll be like a superman for about 15 minutes Biden's plan will crush Florida.","My plan will crush the virus and we're doing it we're rounding third rounding. The third under my leadership, prosperity will surge normal life. I love normal life. We want to get back to normal life will fully resume the Florida, tourism and hospitality industries. Will reach record highs? It's what's going to happen, you say, and next year will be one of the greatest years we are going to have, I'm telling you mark it down and if I'm wrong you say I was wrong.","I say sorry about that, but we're going to have a great year, we're gon na have a great everything our country is doing great. Our military has never been stronger, take it out so many bad ones, and hopefully it so strong that we'll never have to use it. You understand that you want to make it so strong.","We've never had weapons like this. No, no country in the world ever possessed the power the weaponry. What we have is so incredible nobody's ever possessed it before. Not Russia, not China, not anybody we're the envy of the world hope to God. We never have to use them. That's all. I can tell you this election is about jobs and by the way, speaking of jobs, it's all made in the USA.","Everything we have. This election is also about law and Order. You know they said, Oh, don't say, law and order. That's true! That's too tough for term they say sir say law and order very likely and then say, and safety and liberty, and this -- and I said No, no, it's about law and order. We have to have Lord these Democrat run.","States are a disaster they're a disaster. You look at what's happening all over the country and many of them look at Portland. How bad is that I mean how bad is it, and I will say last night in Kentucky I spoke to the governor who's, a Democrat with a great title and he pulled out his National Guard and he's doing it good, and I give him credit.","I give him credit, but mostly they don't want to do that. I say: let us send the National Guard, I did it and remember Minnesota we're going to win Minnesota, so I did it in Minneapolis minnesota. They were having a hard time and took a little long. A little longer than we wanted, but we got the OK to get in.","We solve that problem in about 25 minutes. I think it took they form the line. That was the hard part. The easy part was just walking straight ahead. They never flinched. They were not socially distance, they were right next to each other. They had two hundred and fifty thousand dollar apiece uniforms. They had more stuff in their head, I'm trying to figure out what is it that computers and infrared goggles and everything and they walk forward with their canisters of tear gas and pepper spray, and it was remember the CNN reporter he went there.","He got hit in the knee with a can of blood yeah, that's right. He got hit, he said I'm down, I'm down, he was down still too bad. I felt badly for him, though you went down ali Velshi, you remember, he was standing and he was saying this is a friendly protest. It's wonderful to see the lovely people that are here.","You know he's ducking and behind him the entire city was burning down. You remember the entire city, why are they doing that? What's the purpose of it, I don't get it. I don't get it, but now he got hit on the knee with a canister of tear gas. They say it hurts and that's only going 52 miles an hour. A bullet goes about two thousand miles an hour, but they say it hurts, but they cleaned out that city in a half an hour.","They had no problem. Minneapolis, that's one of the reasons I'm going to win. Another reason would be Ilan, omar omar we're going to win because of Omar. That's a beauty, that's really she's great she's great. She loves our country very much. She has a total disrespect for our country and I think she has hatred for our country.","But I would say Omar is a big reason that we're going to win they're, not too fond of her in Minnesota, I'll, always fight for the right of all citizens to live in security and peace. We have law and Order. Joe Biden is weak as hell. He surrendered his party to flag burners rioters and anti police radicals.","The Democrat Party's war on police. You know a lot of people say cops. I never liked the word. You know my father sit down. Please come on we'll be here for a while. What we have nothing else, I have nothing else to do except run a country and the hardest part about running the country is dealing with crazy Democrats.","You know we're working on stimulus for people, because this is not their fault. It was China's fault that we can't get Nancy Pelosi to approve it. She wants to wait till after the election. I said people want their money they're going to have any impact from that standpoint. People want their money now. The Democrat Party's war on cops is putting the lives of innocent police officers in danger, but my father had great respect, always had great respect for law enforcement for the police and one time he said Dad.","The cops are out there. Look at that. They look great. He says never use the word. Cops, it's police, that's the kind of respect he had. He thought I don't want to. You know right. Look. I have a couple of pretty rough. Looking guy. No, it's true, so I always find it a little hard. You know I just left an impression as police.","He thought it was slang and I don't think they mind. I don't think how many we got a lot of them here. Does anybody mind that term cops who's out here? That's a police, man or woman policeman. Do they mind a lot of a lot of them? Do they mind that term cops? No, they just want respect and they just want to be allowed to do their job properly, as nobody can do it.","Do you agree with that? That's what I say all right now start calling the cops. You said wait a minute. I just respect us and let us do our job. Earlier. This month, two sheriff's deputies were ambushed at close range in Los Angeles, California. I called them both and they're. Ok, but they were hit, they were hit bad last night.","As you know, two police officers were shot in Louisville Kentucky every year. Dozens of courageous police officers lay lay down their lives for people that they never met, people that they don't know people they never saw in most cases right. They lay down their lives for people. They never met. They're, incredible law enforcement, let's give them a hand lee.","Thank you very much. That's all. I tell them all the time you know we have endorsements from all of them, but I tell them all the time you have no idea how much you love. You know they don't hear it because they watch the fake news at night and you don't get it. You don't get the truth. So that's a lot of guys a lot of people back there.","That's a lot of fakers back to loot, all those red lights. The red light means your own life. You know the problem with being on life. You make a little bit of a mistake and they say this was a horrible. That's enough! That's very dishonest! It's a shame really does hurt our country, it's so fake. They don't show the protesters, they don't show it.","You know when you think that, like cities are burning down and storefronts are being exploded, people are being killed, they would have you believe, there's nothing happening. It's the most incredible thing. I don't even understand why, no matter where your philosophy is no matter where you stand, why would you want to show the facts show what's happening and then we fix it.","The Republican cities don't have trouble the Republican states, they don't have trouble, you got it, you go to different states interval, they find it. You know some of these governors, friends of mine and their friends on both sides, but republican governors, red states. They look like how is a thing like this possible because they have law and order they have law and order.","For this I mean that's what it is for the entire summer Joe Biden was silent as his far left supporters, assaulted, police officers harassed innocent Americans and set fire to buildings. They were rioters, they were looters, they were anarchists, he called them. Peaceful protesters is that the peaceful protesters, Joe they're, not peaceful.","Now, maybe he believe he may believe it I mean honestly, they may set at peace scale I'll say that Piers. I think he believes it. I actually did it's the other ones that you have to worry about because they call the shots. Not him he's called for the ridiculous cutting of police funding abolishing cash bail.","If you can believe that and the closing of our prisons, they want to close the prison. That's a good idea even describe law enforcement as the enemy he said, law enforcement is the enemy. How do you know? I assume I'll, ask the fact this? Has he taken it back? I said because he's taking everything back, he's taken anti fracking back he's taken pretty much everything back, but remember it's the first thing.","They say that's what they stick with Biden's. Anti police crusade must stop. As president, I will always stand with the heroes of law enforcement and I was honored to receive the endorsement of 48 sheriffs right here in Florida three weeks ago and all over the country law enforcement from Texas, Arizona, Ohio, Oklahoma, Michigan, Wisconsin, Pennsylvania, New York's finest endorsed Me they've never endorsed a presidential, the National Troopers Coalition Chicago how about that chicago police.","They endorsed me chicago and all the major law enforcement organizations all across the they go back home to mommy. They say Mommy, I'm so so you know the incredible thing about that. I didn't hear anything except our crowd. You know they have no voice they're screaming at the top of their lungs, but their lungs are very small and I didn't hear all of a sudden.","You hear wow like this right here. It's true and people, if you wouldn't recognize him, we wouldn't even know they're here now tomorrow. The headline is so: you had one young protester. The headline will be tomorrow: Trump's rally broken up by protest, one very young girl, she's, a girl am, I allowed to say girl.","She looks like she's like 16 years old, how the hell does that happen. Two hundred and fifty generals and military leaders also hundreds and hundreds of military spouses have given their complete and total endorsement to our campaign to uphold the laws of our land and to uphold our Constitution as written on Saturday, I will be announcing my nominee to the United States, it's gon na, be a big deal, we're doing it on day, we're doing it at the White House.","The Rose Garden of the White House, unless it's raining, in which case we'll still do it, that's something that's beautiful, the White House so beautiful. We love the White House right outside the Oval Office and you know they don't want us to do it. The Democrats say you shouldn't, do it why we have a lot of time?","Let me ask you the one simple question: if it was them instead of us, do you think they do it? Hi thanks. This will be a very talented person. It will be a woman, I'm sorry man. It will be a woman all right ready who would rather see a man. Oh that's trouble. Try it again, who would rather see a man, that's not good, who would rather see a woman.","I think it would be. I really, I think, would take tremendous courage. I don't care how great the man is. Ladies and gentlemen, I'd like to tell you that jim Fitzgerald and then you would see a lot of very unhappy faces. My opponent refuses to release his lists of potential justices because they will be hand-picked by extremists.","Like Representative Alexandria, Ocasio, Porter, sometimes known as aOC plus three right as he and one of the three I think is Omar right, but they'll pick the person. So if Biden does that, if he puts an extremist into that position, he loses everything. That's like normal, and if he does the other way he loses the left, so he doesn't want to give it up.","I'd love to have him put up a list. I'd like to see what that I could see what that list would be. I could already tell you: the people on that list would not be good, it would not be pretty. You would not be happy. That would be the end if given power Biden and his supporters would pack the court, you know they're talking about back into court, because we have won races.","We have won I'll, tell you what so this will be my third and we're in great shape. You see that, do you see what's going on with the Republican Party, how unified the Republican Party is right now we're unified, it's a beautiful thing to say. Thank you Mitt! Thank you yet even Mitt's on board, even some or not it's a good thing to say having a unified party, of course, when they did the impeachment hopes we had one hundred and ninety seven to nothing in the House and fifty two and a half to a Half that was bit, but that's OK., I'm no longer angry at Mitt, because he's being very nice on the Supreme Court, he's good he's doing the right thing.","I just wanted to do the right thing, but they want to pack the court. You know that means they want to put out a lot of justices. These are things that are just horrible. I guess we could do that too right. We could do that, but remember it was Harry Reid that made this all possible. You know they're angry at us.","Listen Chuck crying Chuck, you know Brian Jenkins chuck. Every time you complain remember. It was Harry Reid, your person in charge. He had your job before it was Harry Reid, who made this all possible. Thank you very much Harry. I hope you're enjoying your. They blame us. Harry Reid, gave us the power nuclear option.","Thank you very very much. He wants to pack the court Supreme Court with radicals who will terminate the Second Amendment confiscate your firearms eliminate the right to self-defense strike under God from the Pledge of Allegiance at all other places, tear down crosses from public spaces and force taxpayers to fund extreme late Term abortion, these far left justices would release violent criminals.","Shield foreign terrorists impose sanctuary cities and declare the death penalty totally unconstitutional. It will be totally unconstitutional. They wanted declared unconstitutional for even the most depraved mass murderers, and it's a tough thing. It's a tough thing. They came to my office today and the death penalty for clemency.","I said What was the crime? The crime was so horrible that I won't tell you what it was, but it's been going on for 21 years or so the crime was so horrible that this person committed. That, I said, Look I just can't talk about. It was so it was so horrible and that's usually the case, usually the case like the Boston bomber and by the way they want to give votes to prisoners, people in prison.","They want to give us. So we immediately said: remember: Bernie, Crazy, Bernie Bernie is I'll. Tell you one thing about him: he's the greatest loser. I've ever seen. No, I mean that in a respectful way, because what they did to him with Hillary was bad, but this guy was even worse. Elizabeth Pocahontas Warren would have left the campaign one day before Super Tuesday bernie with her ideology, basically because she's a radical left and she was really fresh to him, but she was really fresh.","How bad was Elizabeth Warren to Joe Biden? There's only one person that was worse, who was worse kamala, I said you'll. Never. This shows you my great instinct, my great knowledge of politics. I said he will never bet Kamala, because no human being has been treated worse than anybody. Then Kamala. Remember she called him.","A racist she called him xenophobic. She called him all sorts of things. She called him things that were so bad. I can't say him I can't say, but she called him a lot of things. I said well she's out and then he picks her. She picks her. We always pick people going up not going down in the polls. You know if I were going to pick and by the way.","How good is Mike Pence? Is he grabbed he's a solid guy and he's a great guy and a great vice president, and he worked so hard he's all over the place. He's in Michigan is and he's everywhere. Where do you go today Mike? I went to Michigan North Carolina, South Carolina, I went to wisconsin and the guy. I tell you what he's an incredible guy and he's a great guy and he loves the people of this country.","He loves our country. You cannot do better than Mike Pence. You know, if you want to save America, you must get out and vote it. Just three and a half years we've secured our borders rebuilt the awesome power of the U.S. military obliterated ISIS caliphate, one hundred percent fix our disastrous trade deals and they were a disaster.","I read some of them. I said who agrees to this stupid people agree to it and brought jobs back home to America, and we brought them back. You had the greatest year. You've ever had last year, the greatest year, you've ever under 16 years of Presidents Obama and Bush household income rose only two thousand nine hundred and forty five dollars OK.","That's over a course of 16 years, close to 3000 right in three years and including energy. Because look at the saving, How are you doing at the gas pump? Not so bad right? Did you ever see that everything that was going down in three years, so that was less than three thousand over sixteen? In three years you went up ten thousand dollars, including energy.","We lifted 6.6 million people out of poverty, the largest poverty reduction in the first three years of any president in the history of our country. We built the greatest economy in the history of the world, not only here anywhere. We were beating everybody. You know for years I heard that China in 2019 was going to overtake us right that didn't happen and they released the plague.","But that didn't happen and it still is not happening with the plague because they got hit hard themselves. I wonder if they understood that they were going to get hit too, but the plague came here. They could have stopped it. They could have stopped it from going all over the world 188 countries all over the world, including Europe and the United States.","We've added a record 10.6 million jobs in the last four months, including 3.3 million jobs for Hispanic Americans, that's a record both when the plague arrived from China, we launched the largest national mobilization since World War 2. We pioneered lifesaving therapies, reducing the fatality rate 85 percent.","Since April you see what's happening. Europe has almost a 50 percent greater excess mortality rate than the United States, and now you see they're being hit very hard. The fact is, we're saying: well, I don't know if you've done as well as Europe, I said we did better than Europe and now Europe is exploding again.","Unfortunately, I don't want that to happen, but they don't want to talk about that, because that's not good for their narrative. Our early and aggressive action saved many millions of lives through Operation warp speed. We developed and distribute a vaccine. We will have a vaccine so soon you won't even believe it, although they're trying to do a little bit of a political hit.","Let's, let's today, it's just a little bit. You notice that let's delay the vaccine just a little bit, but we have three great companies and then others also johnson and Johnson right, pfizer, modena great companies, all of them great companies and they're right. There they're way advanced way, advance or in the final steps.","I took historic action to get critical relief for American workers through our paycheck protection program. We save 3.2 million Florida jobs, we're launching a historic effort to bring our medical supply chains back home where they belong. In 1996, Joe Biden voted to obliterate Puerto Rico's. Thriving pharmaceutical industry -- I am reversing that and we're going back so that Puerto Rico can get its pharmaceutical industry back and they're going to have it back.","That was Joe Biden that did that and then they'll vote because automatic that they vote for a Democrat. What's the purpose he's the one that did it he's the one look, what he did, how devastated look at what he did to our African-American community and people don't want to talk about it, but what he did was devastating devastating he's not good for he's, not good.","For anyone, let's face it last week, I also announced an additional 13 billion dollars that goes to disaster relief for Puerto Rico. They got hit hard. I hope they remember that that was given by Trump, not by the Democrats. Our hearts are also with the communities in the panhandle. I love the panhandle ron, we'll talk I'll, tell you you're a great governor and he's doing a great job.","He called up. He said the Panhandle said, Sir. They love you in the Pan. I think I'm at about 99.9 percent in the Panhandle, but we took care of we took care of the panhandle, remember hurricane Sally. That was not good, but we took care of it. Ron came into my office and say Sir. We need more money. I said how much he gave me a number.","You don't even want to believe. I said You got it Ron, don't come back Ron. He comes back about three days later, sir. We need more money, but that's I guess a the governor 20 good governor does right. That's what a good governor does. I approved a major disaster declaration for the state of Florida last night and we will be with you every step of the way every step you're there we're there so fast.","We sometimes you know. Other presidents took a long time to approve them. I approve them before these storms hit shore because we know what's going to happen, we took care of Florida on November 3rd Florida will decide whether we end the pandemic and return to record prosperity or whether we allow Joe Biden to kill the recovery delay.","The vaccine impose a four trillion dollar tax hike ban American energy, which he wants to do destroy the suburbs he's going to destroy the suburbs, give free health care to illegal aliens, which means millions and millions of people are going to pour into our country and indoctrinate Your children with poisonous anti American lies in that class in their school to combat the toxic left wing propaganda in our schools.","I announced something last week that was very popular, that we're launching a new pro-American lesson plan for students goal 1776. Commission we'll teach our children the truth about America, that we are the most exceptional nation on the face of the earth and you haven't seen anything Yet you see what I've also issued an executive order to prohibit the teaching of critical race theory and the federal government that hateful Marxist doctrine paints.","America, as a wicked nation, seeks to divide everyone by race, rewrites American history and teaches people to be ashamed of themselves and be ashamed of their country. That's not happening anymore. We fired so many of these wise guys. We had one getting three hundred and fifty thousand dollars a year teaching our military, this stuff -- and you said what happened we said: you're fired, get out, many people know it's just become: it's become a cancer, it's like a cancer, but many many people gone they're all Gone and if they're not let us know and we'll let them go, but we have to unite together as one proud American family.","That's what we are we're joined tonight by some incredible warriors: some incredible people, one of them that I'm most proud of is a man that came to this state and what a job he's done. Your great Governor Ron, DeSantis he's doing a great job ron, is doing a great job ron. How are we doing in the election?","How are we doing on November 3rd Ron? He says Good, we better do good. Well, he won a great primary that he beat a man that they said had a good future. I'm not thinking his future is looking to his future. I don't think it's too bad right now. Ron was great, tough and strong, and he didn't choke under pressure.","That's for sure, but much more important than Ron is the first lady of Florida, casey Jr., said the mayor of Jacksonville a really good guy. I got him to really he wanted to do it so bad. We wanted to have our Republican National Convention right here in Jacksonville, but the timing was a little bit bad.","We got hit a little bit with the Corvette, as they say we got hit a little bit with the China virus, but I'll tell you what lady Carrie was absolutely fantastic. Your mayor, Lenny Curry, all right. You ready some of the greatest toughest warriors you'll ever meet during the impeachment of say said: this is the big is vile, like crap about this, I'm the only guy in history that got impeached for an absolutely perfect conversation.","It was perfect. We sent it around. Everyone said what's wrong with this: we said it to the Justice Department. Please check this. Thank goodness we had people that were taking it down. Right, exact notes, great patriots, they took it down two of them and it was perfect. We said it to the Justice Department.","Please examine this conversation we'd like to know what you think they called back. They said, oK., Listen! What exactly are you looking for here? You know these guys are used to looking at killings and drug dealers and they're saying explain to us. What are you looking for? We don't see anything yet. This was the greatest hoax and today, by the way you see what happened they caught him.","They've got him cold, they got him cold, we'll talk about it and his said they caught him. They now find out that Trump was 100 percent. Truthful it was a hoax, they got a call that was just announced, dance Gambino just said it's the biggest the smartest thing on the Internet. They got him cold, we'll talk about it in a second, but these are warriors when I needed warriors.","I had a rEPRESENTATIVE MATT gates with what a great guy, what a guy big future. Thank you Matt. What a warrior! Thank you, but he's very shy on television right. I know this is great. Thank you. Matt ted, Yoho, Ted ted great job. Now you know a man that is in charge of all spying. He was so good that Matt and Ron and Ted and Mike Walters and a lot of people came to see me Mike another great one.","Thank you Mike is John Rutherford. Here was where what a good job John! Thank you thank you for the help. Thank you Joe, but Mike Walsh has been so great and candidate for Congress. Cat karma cat, so Cat was in the Oval Office yesterday right and I said How you doing sir. I'm up 42. I said forty two, what forty two points that was a big Trump district right, you're, not in any real trouble, that's for sure she's got.","I was there great. That was a great win. You had she'll be with us a long time, a long time I want to. I really appreciate it, and we also have some others that are running for different offices in the Republican Party and we love the Republican Party. They have been incredible, they have been incredible.","We also have some of our really unbelievable undercover operatives, and if you don't mind, I won't introduce them all right, I don't think we're going to introduce them. I want to so badly. I want to have him stand up, bring him up here. I want to hug him and kiss him which I'm not allowed to do because of social distancing, but somehow they may lose some effectiveness.","If I introduced him so they're in the crowd. I saw two of them and I won't bother, but they are great great champions of our country. Thank you, and also here is a woman who was so happy. She was tough. She was in charge of a great state Michigan and she kept asking me come back. You got to win, everyone said, you know, Republicans hadn't won Michigan in many decades and I felt I should because I was bringing back and I was doing so much for the business and jobs and bringing people back and recommending and telling them you're losing your business To Mexico, Canada and they gave me 12 years ago, they gave me the man of the year in Michigan, and I made this crazy speech that I said you're losing all your jobs to Mexico and all of a sudden, I'm running for office and a woman who Handled it was unbelievable, she'd say to me, sir.","Would you please come and make a speech? I said Who are you? My name is Rhonda McDaniel, I'm in charge of this was ron. She said My name is Ronnie McDaniel, I'm in charge of Michigan. I said I hear we don't have a chance, we should win Michigan, but I hear you're going to win it. If you come here so I went and made a speech that I went to and another speech and she'd call again and again I couldn't take it and then, as you look I'll do one more.","She wanted me to do one more. She said I'm telling you you got to win, do one more. This is two weeks left and I said All right: this is it so this is it. You know I've devoted a lot of time to Michigan, and everyone says you can't win by the way. Just got a poll with three points up in Michigan. She said, sir, that she used to call me, Mr.","Trump. I wasn't president yet she said, Sir, please just this one time this is it a three three weeks out. I said right this: is it can't do any more? I've got to go to a lot of states, that's it this is it sir? I promise so I did it then, the night before the election she said, Sir you're going to win Michigan, but you've got to make one more stop.","I said forget, and I made it on election day. I arrived at 12:15 in the now morning. That was now Election Day right. I started speaking at one o'clock in the morning on election day. My wife said: Are you crazy? We had thirty two thousand people and the reason I went you wanted us there, but we found out that crooked Hillary Clinton, Barack Hussein Obama and Mrs.","Obama and Bill Clinton, were traveling to Michigan unexpectedly because as Bill Clinton told them three months ago, you're going to Have trouble with Trump in Michigan? They don't want to listen to him. You know they said. Oh well, that's because he's a natural politician -- and he said you're going to have trouble in Wisconsin too and be careful of Minnesota.","This was Clinton. Remember they were laughing. They thought he was very funny, but they knew they were in trouble, so they flew that they had 500 people. I went there and I said we got a 1:00 in the morning with thirty two thousand people in Grand Rapids in Grand Rapids, and I said it's like this. I said we're not going to lose this state.","You can't lose when you have a cut, you can't lose. You know you can look at the crowd. I can look at this crowd. I can look at it as far as the eye can see. As far as the eye can see I'd leave here, I said we're not losing Florida. I can tell you that you can tell you can feel it. You can feel it. You have an instinct we're joined as well by a group of incredible supporters who have recently walked away from the Democrat Party.","They walked away from the Democrats they just registered as republicans. Thank you thank you and they're going to be voting for us. I just read a whole big group of people and I thank you and you're all over the place. Thank you. Thank you. I know it's called they're smart and they have common sense. We've spent the last four years, reversing the terrible damage Joe Biden inflicted over the last 47 years together we've taken on a corrupt and broken system.","That's been throwing everything at us from the very beginning and remember this, and I say it all the time I've done more in forty seven months than Joe Biden has done in 47 years, but today a trove of text messages was released from the FBI agents involved. In the Russia witch hunt, did you say you had to see this?","This is what I was talking about before the headline from The Federalist reads: Trump was right: explosive new FBI techs detail internal furor over handling of the crossfire hurricane investigation. That was the name we caught him. We had him before this, but this is like remember the insurance policy darling darling.","Oh, I love you so much she's going to win. Isn't she? Yes, one hundred million to one? That's, not good odds to me. They might not have been great, but there were a lot better than., 100 million to one listen. I love you so much, but if, for some reason she doesn't win, we have an insurance policy. That's what we've been living through their insurance policy.","You can't be any more obvious than that. These people are scum, they were trying to do a coup who would think and we caught them before -- that we caught them spying on our nation and they've gotten caught. Let's see what happens with them now, but this was a big day. This was a big day, never forget they are coming after me, because I am fighting for you a lot of truth that for decades our politicians spent trillions of dollars, rebuilding foreign nations, fighting foreign wars and defending foreign borders.","But now we are finally protecting our nation rebuilding our cities and we are bringing our jobs, our factories and our troops back home to the USA. Joe Biden championed every globalist betrayal of America for 47 years. He was a cheerleader for NAFTA. The worst trade deal ever made emptied out your factories and he was a cheerleader for China's entry into the World Trade Organization.","I took the toughest ever action to stand up to China's rampant theft of American jobs, and I proudly signed a historic executive order, making it official government policy to buy American and hire american. Why would you ever see this guy he's using my slogan he's using my slogans? I saw him the other day.","It's like Buy American. I said I've been saying that for five years right he's using my so he has no clue. I'm telling you got to come up with your own slogans slogan: we invested 2.5 trillion dollars in the U.S. military and launched the first new branch of U.S. armed forces. In nearly 75 years after the Air Force the Space Force, we passed V.A. Choice and V.A. Accountability.","Nobody thought that could happen. We have a 91 percent approval rating in the V.A. right. Ninety one percent approval rating highest in History, highest Average. You ever see. I don't want to say this to them, because I find events. Is there an unhappy vet someplace? Ninety one percent approval remember: we used to always watch every night.","You see things on the news about how badly the vets are treated. Now we have a 91 percent approval rating. My guys are doing a great job, and today I can announce that the V.A. is approving a new 46 billion dollar lease for a brand new veterans, health care clinic in north Jacksonville. We kill the founder and leader of ISIS al-Baghdadi.","We took out the world's number one terrorist all over the world number one. The mass murder of American troops and many others Qasem Soleimani is dead, come out. He deserved to be taken out. We withdrew from the last administration's disastrous Iran nuclear, the one hundred and fifty billion dollars. You know what he got for nothing, 1.8 billion in cash.","You got nothing nothing. I kept my promise recognize the true capital of Israel and open the American embassy in Jerusalem. I also recognize Israeli sovereignty over the Golan Heights and instead of endless war, we are forging peace in the Middle East. You saw what was happening. In fact, I was nominated for two Nobel Peace Prize this last week.","You know the still. You know, and I told our great first lady I said first lady, I was nominated for the Nobel Peace Prize. I'm going to come home early, I'm going to watch it on NBC News, which is one of the biggest scab jobs. I've ever seen, nBC, probably worse than CNN. NBC., But we're going to watch it we're going to watch the evening news so we'll watch second place.","Nbc has a second place. They spent all this money on PR and then I hit them hard, but they are bad. I said first lady, well, you see a Nobel Peace Prize. This will definitely be the biggest say Hi. Ladies and gentlemen, NBC. They start off with you. They said you had some heavy rain. They started off with something else, something else something else something else now.","The show's almost over said first lady, that left mentioning that Nobel Peace Prize. This is very embarrassing, but then it was OK, because, two days later I got nominated again. That was for Israel. I got nominated and I remember when oprah what remember when Obama got he said, Ladies and gentlemen, Barack Hussein Obama has just been nominated for the Nobel Peace Prize.","So what happened? So? What happened? I said. First lady. I just got nominated again this time for Kosovo, Serbia they're not killing each other anymore. I stopped it. It's totally different. The first was Israel right, bahrain, UAE. This one was Kosovo a totally different award. I don't know if that's ever happened before said first lady.","Let's give it another shot, we watch the news never even mentioned when Barack Obama got his Nobel Prize like immediately after he got elected, they asked him. Why did you get it? He had no clue, nobody knew nobody knew and it was a big story. Breaking news. We have breaking news that didn't have breaking news when I got it, but that's why we understand the press, we understand very well.","They affect the last administration made a pathetic one. Sided deal with the Castro dictatorship that betrayed the Cuban people and enriched the communist regime. My opponent stands with socialists and communists. I stand with the proud people of Cuba, Nicaragua, Venezuela, in their righteous struggle for freedom and you're, going to win it versus you're, going to win that very soon.","The last administration also negotiated the terrible Obama Biden Center's deal with Colombian drug cartels. They surrendered the narco terrorists they surrendered to them and they caused illicit drug production to soar. Under my administration, we worked with our colombian partners to launch a historic rival operation against the drug traffickers, and since April we have seized or disrupted two hundred twenty seven metric tons of poisonous narcotics.","Nobody has ever done anything like it. Joe Biden opposed the mission to take out Osama bin Laden, he opposed killing Soleimani. He voted for the Iraq war. He backed the disastrous Iran nuclear deal and he cheered for the rise of China as a positive development for our country. I don't think so. That was a disaster.","Now Biden put forward the most dangerous that extreme platform of any major party nominee in history. The bad news is, he doesn't even know what the hell it is. The Biden plan would destroy social Security and destroy protections for pre-existing conditions. It will drain your Medicare by giving free health care to illegal immigrants that will come over to this country by the millions when they see this and virtually all immigration enforcement and oppose totally open borders, he would terminate our travel bans on jihadist regions.","Remember I got that approved they kept saying: Oh, he lost, he lost, he lost and then I won in the Supreme Court. We have a travel ban, guess what an increased refugee admissions by over seven hundred percent opening the floodgates to radical Islamic terrorism. He wants to ban school choice and ban charter schools, which are absolutely imperative for our children.","In his second term, I will provide school choice to every parent in America. A vote for Republicans is a vote for safe communities, great jobs and a limitless future for all Americans and in conclusion, over the next four years, we will make America into the manufacturing superpower of the world and we will end our reliance on China once and for All we will make our medical supplies right here.","In the United States, we will hire more police, increase penalties for assaults or law enforcement and we will ban deadly sanctuary cities. We will defend the dignity of work and the sanctity of life. We will uphold religious liberty and free speech and the right to keep and bear arms. We will strike down terrorists who threaten our citizens and we will keep out of America of our great country.","We will stay away from those ridiculous, endless foreign wars, they never end endless foreign they're, all coming home, they're all coming home. We will maintain America's unrivaled military might and we will ensure peace through Strength and nobody has strength like we have strength, peace. We will end surprise.","Medical bills require price transparency and further reduce health insurance premiums and the cost of prescription drugs are going to be coming down by 30 40 50 60 70 percent favorite nation's favorite nation's laws we'll be paying as low as anybody in the world. God, favored nations, nobody had the guts to do it and they are spending a lot of money on ads against me right now, those that Big Pharma.","They are spending a lot of money. We will strongly protect Medicare and Social Security and we will always protect patients with preexisting conditions. America will land the first woman on the moon and the United States will be the first nation to land an astronaut on Mars. I had such a nice life before doing this, but no administration has ever done in the first three and a half years, not even close what we've done and that's very gratifying.","I want to tell you that and thank you very much. We will stop the radical indoctrination of our students and restore patriotic education to our schools. We will teach our children to love our country, honor our history and always respect our great American flag, and we will live by the timeless words of our national motto.","In God, We Trust for years you had a president who apologized for America. Now you have a president who is standing up for America and standing up for the great people of Florida. So get your friends get your family. Get your neighbors get your co-workers and get out and vote. We have to win this election most important election early voting has already begun, don't wait, vote it safe, go out and vote here, we're doing very well by the way.","That's what the word is we'll see. We'll see, but I hear we're doing very well from Tampa to Tallahassee from Orlando, to Miami from Pensacola to right here in Jacksonville, we stand on the shoulders of Florida, patriots who gave their blood sweat and tears for this beloved nation. We inherited the legacy of American heroes who cross the oceans blazed.","The trails settle the continent tame the wilderness dug out the Panama Canal laid down. The railroads raised up to skyscrapers, won two World Wars, defeated fascism and communism, and from here in this beautiful, beautiful state. This sun drenched state of Florida. We launched American astronauts to the moon, we made America into the single greatest nation in the history of the world and the best is yet to come.","You are proud citizens, like you, helped build this country and together we are taking back our country. We are returning the power to you, the American people. With your help, your devotion, your drive, we are going to keep on working, we are going to keep on fighting and we are going to keep on winning winning winning.","We are one movement, one people, one family and one glorious nation. Under God, and together with the incredible people of Florida, we will make America wealthy again. We will make America strong again. We will make america proud again. We will make America safe again and we will make america great again.","Thank you Florida. Thank you Florida"],"text":" Hello Jacksonville, we love Jacksonville, I'm thrilled to be back in my home state of Florida with thousands of hardworking American Patriots. This is some proud. I just wish the cameras would show the crowd. They don't want to do that. They'd like to do that. You know it's harder for us to win, because we have a fake news back there, but but somehow we just keep on doing it is crazy is crazy. This is some. You know it's interesting. When Biden comes to Florida have like 12 13 people. You know they do this and he has a hard time filling up the circles. Here we probably have 30000 people or so that's a lot of people. Well, I want to thank you forty days from now we're going to win Florida, we're going to win four more years in the White, and this is the most important election in the history of our country. I believe that it is because we're dealing with people that are crazy, we're going to raise your taxes they're going to take away your Second Amendment. You know that your second amendment is not going anywhere with me. I can tell you. The Democrat Party has been completely taken over by socialists, Marxists and far left extremists. They embrace the policies of Communist Cuban socialist Venezuela. They want to end the American dream for Hispanic Americans. We love Hispanic Americans, while you see they released a poll today. That said, Trump is doing really well with. What's going on with the Hispanic, it took you so long to figure out that I love you. How long did it take no more of that stuff? Now that Hispanic Americans are great, and you know they did, they released a poll today and nobody's ever seen anything like it. The Republicans are beating the Democrats with Hispanic Americans speaking we're doing great we're doing great and they never like to show those polls. Whenever you see they don't show too many polls, it's only because we're winning we're winning by a lot. We think we're winning by like a lot, but the only poll that counts is on November 3rd right. That's the only poll that counts so get out there. Don't let him bluff you whatever it is, get out there and vote. The Republican Party is the party of jobs, safety and freedom, and we will ensure that America never becomes a socialist or communist I've added that recently less said socialist country. I said now a socialist or communist cut, because these people are crazy. Kamala you know Kamala is further left than Bernie. I didn't know that she is the furthest left in the U.S. Senate. She was up at 15 percent when she started. You know that right that story. She went down to 40 and then she went to twelve that you went to eleven. She went to 9 and 8 6, 4. 2. 1., And then she left before I with the great state of Iowa. Well, I made it all possible for them at all, and I gave our farmers twenty eight billion dollars. Thank you very much china. We took it out of China because they were targeting iowa and Nebraska a lot of our great states Wisconsin. We gave our farmers a lot of money. Some came down to farmers down in Florida. They don't know that we got a lot of farmers in Florida, but here's the choice facing every Florida vote, Joe Biden, will deliver a crippling shutdown he's actually thinking about. Can you know we did that and we saved millions of lives? That's it we're doing good now and by the way your governor has done a great job. Florida is down. No doubt the china virus, its China, some people call it corona virus. That sounds like a beautiful place in Italy. Right now, it didn't come from. Italy came from China, but this guy stuck in here, shut it down to be scientists and shut it down, shut it down. No we're not shutting anything down, we are doing so. Well, you look at our numbers. What do you see the third quarter? I shouldn't say it because back there, but when do you see how good the third quarter is going to be when it comes out just before the elections, I'm taking a risk? When I say it, you won't believe the numbers you say I tell you, you're going to see numbers nobody's going to believe those numbers we're hearing from 25 to 35 percent GDP. Nobody's ever heard of that. Well, Iran has a 25 percent GDP too, but it's a negative GDP of 25. They just announced negative 25. They don't like me too much be careful, be careful, I'm delivering a safe vaccine and we're doing a record recovery. This recovery is a record they've, never seen anything like it, and next year is going to be, I think, the best economic year in the history of unless a very sleepy guy got in he decided to quadruple everybody's taxes. Then you can forget. A. Sleepy guy, did you see he did it live this morning? Again, live live, you know it. A little is a little is when you put out word you're not going to be campaigning today, so he does a little all the time. I'm working my ass off. I'm in Texas, I'm in Ohio, I'm in North Carolina s., I'm in Michigan, I'm all over the place, miss Wisconsin back, but he puts a lid on so I left I didn't know what the hell I live once I've only been doing this for three and a Half years or so, but I'll, let you know you're not going to go out today, you're going to stay in your apartment or, let's put it this way in his basement so early in the morning, he's put a lid on. That means nothing for that. I guess they do that for the press, the fake juice goes home and they say how great he is as a candidate. They go home and they say he's a great candidate, but he put another letter in many lists, so he did a lead today early in the morning that he won't be working today and I don't know I'm working so hard -- maybe he's right! Think of it, supposing he never campaigns and he wins. You know how badly I'm going to feel. I'm working hard and you've got to work hard, and you know what I said today. We cannot have a low energy individual as our president. We can't and he's the lowest energy individual I've ever seen. I've ever seen so we'll see what happens but he's living up. Maybe he's going to be great at the debate. Know he's been doing it for 47 years. Somebody said: Oh, he won't do well at the debate. I said I think you're wrong. He'll. Do fine he's going to do fine you'll, give him a big shot of something and he'll go out. There have a lot of energy ups. He'll, have energy he'll be like a superman for about 15 minutes Biden's plan will crush Florida. My plan will crush the virus and we're doing it we're rounding third rounding. The third under my leadership, prosperity will surge normal life. I love normal life. We want to get back to normal life will fully resume the Florida, tourism and hospitality industries. Will reach record highs? It's what's going to happen, you say, and next year will be one of the greatest years we are going to have, I'm telling you mark it down and if I'm wrong you say I was wrong. I say sorry about that, but we're going to have a great year, we're gon na have a great everything our country is doing great. Our military has never been stronger, take it out so many bad ones, and hopefully it so strong that we'll never have to use it. You understand that you want to make it so strong. We've never had weapons like this. No, no country in the world ever possessed the power the weaponry. What we have is so incredible nobody's ever possessed it before. Not Russia, not China, not anybody we're the envy of the world hope to God. We never have to use them. That's all. I can tell you this election is about jobs and by the way, speaking of jobs, it's all made in the USA. Everything we have. This election is also about law and Order. You know they said, Oh, don't say, law and order. That's true! That's too tough for term they say sir say law and order very likely and then say, and safety and liberty, and this -- and I said No, no, it's about law and order. We have to have Lord these Democrat run. States are a disaster they're a disaster. You look at what's happening all over the country and many of them look at Portland. How bad is that I mean how bad is it, and I will say last night in Kentucky I spoke to the governor who's, a Democrat with a great title and he pulled out his National Guard and he's doing it good, and I give him credit. I give him credit, but mostly they don't want to do that. I say: let us send the National Guard, I did it and remember Minnesota we're going to win Minnesota, so I did it in Minneapolis minnesota. They were having a hard time and took a little long. A little longer than we wanted, but we got the OK to get in. We solve that problem in about 25 minutes. I think it took they form the line. That was the hard part. The easy part was just walking straight ahead. They never flinched. They were not socially distance, they were right next to each other. They had two hundred and fifty thousand dollar apiece uniforms. They had more stuff in their head, I'm trying to figure out what is it that computers and infrared goggles and everything and they walk forward with their canisters of tear gas and pepper spray, and it was remember the CNN reporter he went there. He got hit in the knee with a can of blood yeah, that's right. He got hit, he said I'm down, I'm down, he was down still too bad. I felt badly for him, though you went down ali Velshi, you remember, he was standing and he was saying this is a friendly protest. It's wonderful to see the lovely people that are here. You know he's ducking and behind him the entire city was burning down. You remember the entire city, why are they doing that? What's the purpose of it, I don't get it. I don't get it, but now he got hit on the knee with a canister of tear gas. They say it hurts and that's only going 52 miles an hour. A bullet goes about two thousand miles an hour, but they say it hurts, but they cleaned out that city in a half an hour. They had no problem. Minneapolis, that's one of the reasons I'm going to win. Another reason would be Ilan, omar omar we're going to win because of Omar. That's a beauty, that's really she's great she's great. She loves our country very much. She has a total disrespect for our country and I think she has hatred for our country. But I would say Omar is a big reason that we're going to win they're, not too fond of her in Minnesota, I'll, always fight for the right of all citizens to live in security and peace. We have law and Order. Joe Biden is weak as hell. He surrendered his party to flag burners rioters and anti police radicals. The Democrat Party's war on police. You know a lot of people say cops. I never liked the word. You know my father sit down. Please come on we'll be here for a while. What we have nothing else, I have nothing else to do except run a country and the hardest part about running the country is dealing with crazy Democrats. You know we're working on stimulus for people, because this is not their fault. It was China's fault that we can't get Nancy Pelosi to approve it. She wants to wait till after the election. I said people want their money they're going to have any impact from that standpoint. People want their money now. The Democrat Party's war on cops is putting the lives of innocent police officers in danger, but my father had great respect, always had great respect for law enforcement for the police and one time he said Dad. The cops are out there. Look at that. They look great. He says never use the word. Cops, it's police, that's the kind of respect he had. He thought I don't want to. You know right. Look. I have a couple of pretty rough. Looking guy. No, it's true, so I always find it a little hard. You know I just left an impression as police. He thought it was slang and I don't think they mind. I don't think how many we got a lot of them here. Does anybody mind that term cops who's out here? That's a police, man or woman policeman. Do they mind a lot of a lot of them? Do they mind that term cops? No, they just want respect and they just want to be allowed to do their job properly, as nobody can do it. Do you agree with that? That's what I say all right now start calling the cops. You said wait a minute. I just respect us and let us do our job. Earlier. This month, two sheriff's deputies were ambushed at close range in Los Angeles, California. I called them both and they're. Ok, but they were hit, they were hit bad last night. As you know, two police officers were shot in Louisville Kentucky every year. Dozens of courageous police officers lay lay down their lives for people that they never met, people that they don't know people they never saw in most cases right. They lay down their lives for people. They never met. They're, incredible law enforcement, let's give them a hand lee. Thank you very much. That's all. I tell them all the time you know we have endorsements from all of them, but I tell them all the time you have no idea how much you love. You know they don't hear it because they watch the fake news at night and you don't get it. You don't get the truth. So that's a lot of guys a lot of people back there. That's a lot of fakers back to loot, all those red lights. The red light means your own life. You know the problem with being on life. You make a little bit of a mistake and they say this was a horrible. That's enough! That's very dishonest! It's a shame really does hurt our country, it's so fake. They don't show the protesters, they don't show it. You know when you think that, like cities are burning down and storefronts are being exploded, people are being killed, they would have you believe, there's nothing happening. It's the most incredible thing. I don't even understand why, no matter where your philosophy is no matter where you stand, why would you want to show the facts show what's happening and then we fix it. The Republican cities don't have trouble the Republican states, they don't have trouble, you got it, you go to different states interval, they find it. You know some of these governors, friends of mine and their friends on both sides, but republican governors, red states. They look like how is a thing like this possible because they have law and order they have law and order. For this I mean that's what it is for the entire summer Joe Biden was silent as his far left supporters, assaulted, police officers harassed innocent Americans and set fire to buildings. They were rioters, they were looters, they were anarchists, he called them. Peaceful protesters is that the peaceful protesters, Joe they're, not peaceful. Now, maybe he believe he may believe it I mean honestly, they may set at peace scale I'll say that Piers. I think he believes it. I actually did it's the other ones that you have to worry about because they call the shots. Not him he's called for the ridiculous cutting of police funding abolishing cash bail. If you can believe that and the closing of our prisons, they want to close the prison. That's a good idea even describe law enforcement as the enemy he said, law enforcement is the enemy. How do you know? I assume I'll, ask the fact this? Has he taken it back? I said because he's taking everything back, he's taken anti fracking back he's taken pretty much everything back, but remember it's the first thing. They say that's what they stick with Biden's. Anti police crusade must stop. As president, I will always stand with the heroes of law enforcement and I was honored to receive the endorsement of 48 sheriffs right here in Florida three weeks ago and all over the country law enforcement from Texas, Arizona, Ohio, Oklahoma, Michigan, Wisconsin, Pennsylvania, New York's finest endorsed Me they've never endorsed a presidential, the National Troopers Coalition Chicago how about that chicago police. They endorsed me chicago and all the major law enforcement organizations all across the they go back home to mommy. They say Mommy, I'm so so you know the incredible thing about that. I didn't hear anything except our crowd. You know they have no voice they're screaming at the top of their lungs, but their lungs are very small and I didn't hear all of a sudden. You hear wow like this right here. It's true and people, if you wouldn't recognize him, we wouldn't even know they're here now tomorrow. The headline is so: you had one young protester. The headline will be tomorrow: Trump's rally broken up by protest, one very young girl, she's, a girl am, I allowed to say girl. She looks like she's like 16 years old, how the hell does that happen. Two hundred and fifty generals and military leaders also hundreds and hundreds of military spouses have given their complete and total endorsement to our campaign to uphold the laws of our land and to uphold our Constitution as written on Saturday, I will be announcing my nominee to the United States, it's gon na, be a big deal, we're doing it on day, we're doing it at the White House. The Rose Garden of the White House, unless it's raining, in which case we'll still do it, that's something that's beautiful, the White House so beautiful. We love the White House right outside the Oval Office and you know they don't want us to do it. The Democrats say you shouldn't, do it why we have a lot of time? Let me ask you the one simple question: if it was them instead of us, do you think they do it? Hi thanks. This will be a very talented person. It will be a woman, I'm sorry man. It will be a woman all right ready who would rather see a man. Oh that's trouble. Try it again, who would rather see a man, that's not good, who would rather see a woman. I think it would be. I really, I think, would take tremendous courage. I don't care how great the man is. Ladies and gentlemen, I'd like to tell you that jim Fitzgerald and then you would see a lot of very unhappy faces. My opponent refuses to release his lists of potential justices because they will be hand-picked by extremists. Like Representative Alexandria, Ocasio, Porter, sometimes known as aOC plus three right as he and one of the three I think is Omar right, but they'll pick the person. So if Biden does that, if he puts an extremist into that position, he loses everything. That's like normal, and if he does the other way he loses the left, so he doesn't want to give it up. I'd love to have him put up a list. I'd like to see what that I could see what that list would be. I could already tell you: the people on that list would not be good, it would not be pretty. You would not be happy. That would be the end if given power Biden and his supporters would pack the court, you know they're talking about back into court, because we have won races. We have won I'll, tell you what so this will be my third and we're in great shape. You see that, do you see what's going on with the Republican Party, how unified the Republican Party is right now we're unified, it's a beautiful thing to say. Thank you Mitt! Thank you yet even Mitt's on board, even some or not it's a good thing to say having a unified party, of course, when they did the impeachment hopes we had one hundred and ninety seven to nothing in the House and fifty two and a half to a Half that was bit, but that's OK., I'm no longer angry at Mitt, because he's being very nice on the Supreme Court, he's good he's doing the right thing. I just wanted to do the right thing, but they want to pack the court. You know that means they want to put out a lot of justices. These are things that are just horrible. I guess we could do that too right. We could do that, but remember it was Harry Reid that made this all possible. You know they're angry at us. Listen Chuck crying Chuck, you know Brian Jenkins chuck. Every time you complain remember. It was Harry Reid, your person in charge. He had your job before it was Harry Reid, who made this all possible. Thank you very much Harry. I hope you're enjoying your. They blame us. Harry Reid, gave us the power nuclear option. Thank you very very much. He wants to pack the court Supreme Court with radicals who will terminate the Second Amendment confiscate your firearms eliminate the right to self-defense strike under God from the Pledge of Allegiance at all other places, tear down crosses from public spaces and force taxpayers to fund extreme late Term abortion, these far left justices would release violent criminals. Shield foreign terrorists impose sanctuary cities and declare the death penalty totally unconstitutional. It will be totally unconstitutional. They wanted declared unconstitutional for even the most depraved mass murderers, and it's a tough thing. It's a tough thing. They came to my office today and the death penalty for clemency. I said What was the crime? The crime was so horrible that I won't tell you what it was, but it's been going on for 21 years or so the crime was so horrible that this person committed. That, I said, Look I just can't talk about. It was so it was so horrible and that's usually the case, usually the case like the Boston bomber and by the way they want to give votes to prisoners, people in prison. They want to give us. So we immediately said: remember: Bernie, Crazy, Bernie Bernie is I'll. Tell you one thing about him: he's the greatest loser. I've ever seen. No, I mean that in a respectful way, because what they did to him with Hillary was bad, but this guy was even worse. Elizabeth Pocahontas Warren would have left the campaign one day before Super Tuesday bernie with her ideology, basically because she's a radical left and she was really fresh to him, but she was really fresh. How bad was Elizabeth Warren to Joe Biden? There's only one person that was worse, who was worse kamala, I said you'll. Never. This shows you my great instinct, my great knowledge of politics. I said he will never bet Kamala, because no human being has been treated worse than anybody. Then Kamala. Remember she called him. A racist she called him xenophobic. She called him all sorts of things. She called him things that were so bad. I can't say him I can't say, but she called him a lot of things. I said well she's out and then he picks her. She picks her. We always pick people going up not going down in the polls. You know if I were going to pick and by the way. How good is Mike Pence? Is he grabbed he's a solid guy and he's a great guy and a great vice president, and he worked so hard he's all over the place. He's in Michigan is and he's everywhere. Where do you go today Mike? I went to Michigan North Carolina, South Carolina, I went to wisconsin and the guy. I tell you what he's an incredible guy and he's a great guy and he loves the people of this country. He loves our country. You cannot do better than Mike Pence. You know, if you want to save America, you must get out and vote it. Just three and a half years we've secured our borders rebuilt the awesome power of the U.S. military obliterated ISIS caliphate, one hundred percent fix our disastrous trade deals and they were a disaster. I read some of them. I said who agrees to this stupid people agree to it and brought jobs back home to America, and we brought them back. You had the greatest year. You've ever had last year, the greatest year, you've ever under 16 years of Presidents Obama and Bush household income rose only two thousand nine hundred and forty five dollars OK. That's over a course of 16 years, close to 3000 right in three years and including energy. Because look at the saving, How are you doing at the gas pump? Not so bad right? Did you ever see that everything that was going down in three years, so that was less than three thousand over sixteen? In three years you went up ten thousand dollars, including energy. We lifted 6.6 million people out of poverty, the largest poverty reduction in the first three years of any president in the history of our country. We built the greatest economy in the history of the world, not only here anywhere. We were beating everybody. You know for years I heard that China in 2019 was going to overtake us right that didn't happen and they released the plague. But that didn't happen and it still is not happening with the plague because they got hit hard themselves. I wonder if they understood that they were going to get hit too, but the plague came here. They could have stopped it. They could have stopped it from going all over the world 188 countries all over the world, including Europe and the United States. We've added a record 10.6 million jobs in the last four months, including 3.3 million jobs for Hispanic Americans, that's a record both when the plague arrived from China, we launched the largest national mobilization since World War 2. We pioneered lifesaving therapies, reducing the fatality rate 85 percent. Since April you see what's happening. Europe has almost a 50 percent greater excess mortality rate than the United States, and now you see they're being hit very hard. The fact is, we're saying: well, I don't know if you've done as well as Europe, I said we did better than Europe and now Europe is exploding again. Unfortunately, I don't want that to happen, but they don't want to talk about that, because that's not good for their narrative. Our early and aggressive action saved many millions of lives through Operation warp speed. We developed and distribute a vaccine. We will have a vaccine so soon you won't even believe it, although they're trying to do a little bit of a political hit. Let's, let's today, it's just a little bit. You notice that let's delay the vaccine just a little bit, but we have three great companies and then others also johnson and Johnson right, pfizer, modena great companies, all of them great companies and they're right. There they're way advanced way, advance or in the final steps. I took historic action to get critical relief for American workers through our paycheck protection program. We save 3.2 million Florida jobs, we're launching a historic effort to bring our medical supply chains back home where they belong. In 1996, Joe Biden voted to obliterate Puerto Rico's. Thriving pharmaceutical industry -- I am reversing that and we're going back so that Puerto Rico can get its pharmaceutical industry back and they're going to have it back. That was Joe Biden that did that and then they'll vote because automatic that they vote for a Democrat. What's the purpose he's the one that did it he's the one look, what he did, how devastated look at what he did to our African-American community and people don't want to talk about it, but what he did was devastating devastating he's not good for he's, not good. For anyone, let's face it last week, I also announced an additional 13 billion dollars that goes to disaster relief for Puerto Rico. They got hit hard. I hope they remember that that was given by Trump, not by the Democrats. Our hearts are also with the communities in the panhandle. I love the panhandle ron, we'll talk I'll, tell you you're a great governor and he's doing a great job. He called up. He said the Panhandle said, Sir. They love you in the Pan. I think I'm at about 99.9 percent in the Panhandle, but we took care of we took care of the panhandle, remember hurricane Sally. That was not good, but we took care of it. Ron came into my office and say Sir. We need more money. I said how much he gave me a number. You don't even want to believe. I said You got it Ron, don't come back Ron. He comes back about three days later, sir. We need more money, but that's I guess a the governor 20 good governor does right. That's what a good governor does. I approved a major disaster declaration for the state of Florida last night and we will be with you every step of the way every step you're there we're there so fast. We sometimes you know. Other presidents took a long time to approve them. I approve them before these storms hit shore because we know what's going to happen, we took care of Florida on November 3rd Florida will decide whether we end the pandemic and return to record prosperity or whether we allow Joe Biden to kill the recovery delay. The vaccine impose a four trillion dollar tax hike ban American energy, which he wants to do destroy the suburbs he's going to destroy the suburbs, give free health care to illegal aliens, which means millions and millions of people are going to pour into our country and indoctrinate Your children with poisonous anti American lies in that class in their school to combat the toxic left wing propaganda in our schools. I announced something last week that was very popular, that we're launching a new pro-American lesson plan for students goal 1776. Commission we'll teach our children the truth about America, that we are the most exceptional nation on the face of the earth and you haven't seen anything Yet you see what I've also issued an executive order to prohibit the teaching of critical race theory and the federal government that hateful Marxist doctrine paints. America, as a wicked nation, seeks to divide everyone by race, rewrites American history and teaches people to be ashamed of themselves and be ashamed of their country. That's not happening anymore. We fired so many of these wise guys. We had one getting three hundred and fifty thousand dollars a year teaching our military, this stuff -- and you said what happened we said: you're fired, get out, many people know it's just become: it's become a cancer, it's like a cancer, but many many people gone they're all Gone and if they're not let us know and we'll let them go, but we have to unite together as one proud American family. That's what we are we're joined tonight by some incredible warriors: some incredible people, one of them that I'm most proud of is a man that came to this state and what a job he's done. Your great Governor Ron, DeSantis he's doing a great job ron, is doing a great job ron. How are we doing in the election? How are we doing on November 3rd Ron? He says Good, we better do good. Well, he won a great primary that he beat a man that they said had a good future. I'm not thinking his future is looking to his future. I don't think it's too bad right now. Ron was great, tough and strong, and he didn't choke under pressure. That's for sure, but much more important than Ron is the first lady of Florida, casey Jr., said the mayor of Jacksonville a really good guy. I got him to really he wanted to do it so bad. We wanted to have our Republican National Convention right here in Jacksonville, but the timing was a little bit bad. We got hit a little bit with the Corvette, as they say we got hit a little bit with the China virus, but I'll tell you what lady Carrie was absolutely fantastic. Your mayor, Lenny Curry, all right. You ready some of the greatest toughest warriors you'll ever meet during the impeachment of say said: this is the big is vile, like crap about this, I'm the only guy in history that got impeached for an absolutely perfect conversation. It was perfect. We sent it around. Everyone said what's wrong with this: we said it to the Justice Department. Please check this. Thank goodness we had people that were taking it down. Right, exact notes, great patriots, they took it down two of them and it was perfect. We said it to the Justice Department. Please examine this conversation we'd like to know what you think they called back. They said, oK., Listen! What exactly are you looking for here? You know these guys are used to looking at killings and drug dealers and they're saying explain to us. What are you looking for? We don't see anything yet. This was the greatest hoax and today, by the way you see what happened they caught him. They've got him cold, they got him cold, we'll talk about it and his said they caught him. They now find out that Trump was 100 percent. Truthful it was a hoax, they got a call that was just announced, dance Gambino just said it's the biggest the smartest thing on the Internet. They got him cold, we'll talk about it in a second, but these are warriors when I needed warriors. I had a rEPRESENTATIVE MATT gates with what a great guy, what a guy big future. Thank you Matt. What a warrior! Thank you, but he's very shy on television right. I know this is great. Thank you. Matt ted, Yoho, Ted ted great job. Now you know a man that is in charge of all spying. He was so good that Matt and Ron and Ted and Mike Walters and a lot of people came to see me Mike another great one. Thank you Mike is John Rutherford. Here was where what a good job John! Thank you thank you for the help. Thank you Joe, but Mike Walsh has been so great and candidate for Congress. Cat karma cat, so Cat was in the Oval Office yesterday right and I said How you doing sir. I'm up 42. I said forty two, what forty two points that was a big Trump district right, you're, not in any real trouble, that's for sure she's got. I was there great. That was a great win. You had she'll be with us a long time, a long time I want to. I really appreciate it, and we also have some others that are running for different offices in the Republican Party and we love the Republican Party. They have been incredible, they have been incredible. We also have some of our really unbelievable undercover operatives, and if you don't mind, I won't introduce them all right, I don't think we're going to introduce them. I want to so badly. I want to have him stand up, bring him up here. I want to hug him and kiss him which I'm not allowed to do because of social distancing, but somehow they may lose some effectiveness. If I introduced him so they're in the crowd. I saw two of them and I won't bother, but they are great great champions of our country. Thank you, and also here is a woman who was so happy. She was tough. She was in charge of a great state Michigan and she kept asking me come back. You got to win, everyone said, you know, Republicans hadn't won Michigan in many decades and I felt I should because I was bringing back and I was doing so much for the business and jobs and bringing people back and recommending and telling them you're losing your business To Mexico, Canada and they gave me 12 years ago, they gave me the man of the year in Michigan, and I made this crazy speech that I said you're losing all your jobs to Mexico and all of a sudden, I'm running for office and a woman who Handled it was unbelievable, she'd say to me, sir. Would you please come and make a speech? I said Who are you? My name is Rhonda McDaniel, I'm in charge of this was ron. She said My name is Ronnie McDaniel, I'm in charge of Michigan. I said I hear we don't have a chance, we should win Michigan, but I hear you're going to win it. If you come here so I went and made a speech that I went to and another speech and she'd call again and again I couldn't take it and then, as you look I'll do one more. She wanted me to do one more. She said I'm telling you you got to win, do one more. This is two weeks left and I said All right: this is it so this is it. You know I've devoted a lot of time to Michigan, and everyone says you can't win by the way. Just got a poll with three points up in Michigan. She said, sir, that she used to call me, Mr. Trump. I wasn't president yet she said, Sir, please just this one time this is it a three three weeks out. I said right this: is it can't do any more? I've got to go to a lot of states, that's it this is it sir? I promise so I did it then, the night before the election she said, Sir you're going to win Michigan, but you've got to make one more stop. I said forget, and I made it on election day. I arrived at 12:15 in the now morning. That was now Election Day right. I started speaking at one o'clock in the morning on election day. My wife said: Are you crazy? We had thirty two thousand people and the reason I went you wanted us there, but we found out that crooked Hillary Clinton, Barack Hussein Obama and Mrs. Obama and Bill Clinton, were traveling to Michigan unexpectedly because as Bill Clinton told them three months ago, you're going to Have trouble with Trump in Michigan? They don't want to listen to him. You know they said. Oh well, that's because he's a natural politician -- and he said you're going to have trouble in Wisconsin too and be careful of Minnesota. This was Clinton. Remember they were laughing. They thought he was very funny, but they knew they were in trouble, so they flew that they had 500 people. I went there and I said we got a 1:00 in the morning with thirty two thousand people in Grand Rapids in Grand Rapids, and I said it's like this. I said we're not going to lose this state. You can't lose when you have a cut, you can't lose. You know you can look at the crowd. I can look at this crowd. I can look at it as far as the eye can see. As far as the eye can see I'd leave here, I said we're not losing Florida. I can tell you that you can tell you can feel it. You can feel it. You have an instinct we're joined as well by a group of incredible supporters who have recently walked away from the Democrat Party. They walked away from the Democrats they just registered as republicans. Thank you thank you and they're going to be voting for us. I just read a whole big group of people and I thank you and you're all over the place. Thank you. Thank you. I know it's called they're smart and they have common sense. We've spent the last four years, reversing the terrible damage Joe Biden inflicted over the last 47 years together we've taken on a corrupt and broken system. That's been throwing everything at us from the very beginning and remember this, and I say it all the time I've done more in forty seven months than Joe Biden has done in 47 years, but today a trove of text messages was released from the FBI agents involved. In the Russia witch hunt, did you say you had to see this? This is what I was talking about before the headline from The Federalist reads: Trump was right: explosive new FBI techs detail internal furor over handling of the crossfire hurricane investigation. That was the name we caught him. We had him before this, but this is like remember the insurance policy darling darling. Oh, I love you so much she's going to win. Isn't she? Yes, one hundred million to one? That's, not good odds to me. They might not have been great, but there were a lot better than., 100 million to one listen. I love you so much, but if, for some reason she doesn't win, we have an insurance policy. That's what we've been living through their insurance policy. You can't be any more obvious than that. These people are scum, they were trying to do a coup who would think and we caught them before -- that we caught them spying on our nation and they've gotten caught. Let's see what happens with them now, but this was a big day. This was a big day, never forget they are coming after me, because I am fighting for you a lot of truth that for decades our politicians spent trillions of dollars, rebuilding foreign nations, fighting foreign wars and defending foreign borders. But now we are finally protecting our nation rebuilding our cities and we are bringing our jobs, our factories and our troops back home to the USA. Joe Biden championed every globalist betrayal of America for 47 years. He was a cheerleader for NAFTA. The worst trade deal ever made emptied out your factories and he was a cheerleader for China's entry into the World Trade Organization. I took the toughest ever action to stand up to China's rampant theft of American jobs, and I proudly signed a historic executive order, making it official government policy to buy American and hire american. Why would you ever see this guy he's using my slogan he's using my slogans? I saw him the other day. It's like Buy American. I said I've been saying that for five years right he's using my so he has no clue. I'm telling you got to come up with your own slogans slogan: we invested 2.5 trillion dollars in the U.S. military and launched the first new branch of U.S. armed forces. In nearly 75 years after the Air Force the Space Force, we passed V.A. Choice and V.A. Accountability. Nobody thought that could happen. We have a 91 percent approval rating in the V.A. right. Ninety one percent approval rating highest in History, highest Average. You ever see. I don't want to say this to them, because I find events. Is there an unhappy vet someplace? Ninety one percent approval remember: we used to always watch every night. You see things on the news about how badly the vets are treated. Now we have a 91 percent approval rating. My guys are doing a great job, and today I can announce that the V.A. is approving a new 46 billion dollar lease for a brand new veterans, health care clinic in north Jacksonville. We kill the founder and leader of ISIS al-Baghdadi. We took out the world's number one terrorist all over the world number one. The mass murder of American troops and many others Qasem Soleimani is dead, come out. He deserved to be taken out. We withdrew from the last administration's disastrous Iran nuclear, the one hundred and fifty billion dollars. You know what he got for nothing, 1.8 billion in cash. You got nothing nothing. I kept my promise recognize the true capital of Israel and open the American embassy in Jerusalem. I also recognize Israeli sovereignty over the Golan Heights and instead of endless war, we are forging peace in the Middle East. You saw what was happening. In fact, I was nominated for two Nobel Peace Prize this last week. You know the still. You know, and I told our great first lady I said first lady, I was nominated for the Nobel Peace Prize. I'm going to come home early, I'm going to watch it on NBC News, which is one of the biggest scab jobs. I've ever seen, nBC, probably worse than CNN. NBC., But we're going to watch it we're going to watch the evening news so we'll watch second place. Nbc has a second place. They spent all this money on PR and then I hit them hard, but they are bad. I said first lady, well, you see a Nobel Peace Prize. This will definitely be the biggest say Hi. Ladies and gentlemen, NBC. They start off with you. They said you had some heavy rain. They started off with something else, something else something else something else now. The show's almost over said first lady, that left mentioning that Nobel Peace Prize. This is very embarrassing, but then it was OK, because, two days later I got nominated again. That was for Israel. I got nominated and I remember when oprah what remember when Obama got he said, Ladies and gentlemen, Barack Hussein Obama has just been nominated for the Nobel Peace Prize. So what happened? So? What happened? I said. First lady. I just got nominated again this time for Kosovo, Serbia they're not killing each other anymore. I stopped it. It's totally different. The first was Israel right, bahrain, UAE. This one was Kosovo a totally different award. I don't know if that's ever happened before said first lady. Let's give it another shot, we watch the news never even mentioned when Barack Obama got his Nobel Prize like immediately after he got elected, they asked him. Why did you get it? He had no clue, nobody knew nobody knew and it was a big story. Breaking news. We have breaking news that didn't have breaking news when I got it, but that's why we understand the press, we understand very well. They affect the last administration made a pathetic one. Sided deal with the Castro dictatorship that betrayed the Cuban people and enriched the communist regime. My opponent stands with socialists and communists. I stand with the proud people of Cuba, Nicaragua, Venezuela, in their righteous struggle for freedom and you're, going to win it versus you're, going to win that very soon. The last administration also negotiated the terrible Obama Biden Center's deal with Colombian drug cartels. They surrendered the narco terrorists they surrendered to them and they caused illicit drug production to soar. Under my administration, we worked with our colombian partners to launch a historic rival operation against the drug traffickers, and since April we have seized or disrupted two hundred twenty seven metric tons of poisonous narcotics. Nobody has ever done anything like it. Joe Biden opposed the mission to take out Osama bin Laden, he opposed killing Soleimani. He voted for the Iraq war. He backed the disastrous Iran nuclear deal and he cheered for the rise of China as a positive development for our country. I don't think so. That was a disaster. Now Biden put forward the most dangerous that extreme platform of any major party nominee in history. The bad news is, he doesn't even know what the hell it is. The Biden plan would destroy social Security and destroy protections for pre-existing conditions. It will drain your Medicare by giving free health care to illegal immigrants that will come over to this country by the millions when they see this and virtually all immigration enforcement and oppose totally open borders, he would terminate our travel bans on jihadist regions. Remember I got that approved they kept saying: Oh, he lost, he lost, he lost and then I won in the Supreme Court. We have a travel ban, guess what an increased refugee admissions by over seven hundred percent opening the floodgates to radical Islamic terrorism. He wants to ban school choice and ban charter schools, which are absolutely imperative for our children. In his second term, I will provide school choice to every parent in America. A vote for Republicans is a vote for safe communities, great jobs and a limitless future for all Americans and in conclusion, over the next four years, we will make America into the manufacturing superpower of the world and we will end our reliance on China once and for All we will make our medical supplies right here. In the United States, we will hire more police, increase penalties for assaults or law enforcement and we will ban deadly sanctuary cities. We will defend the dignity of work and the sanctity of life. We will uphold religious liberty and free speech and the right to keep and bear arms. We will strike down terrorists who threaten our citizens and we will keep out of America of our great country. We will stay away from those ridiculous, endless foreign wars, they never end endless foreign they're, all coming home, they're all coming home. We will maintain America's unrivaled military might and we will ensure peace through Strength and nobody has strength like we have strength, peace. We will end surprise. Medical bills require price transparency and further reduce health insurance premiums and the cost of prescription drugs are going to be coming down by 30 40 50 60 70 percent favorite nation's favorite nation's laws we'll be paying as low as anybody in the world. God, favored nations, nobody had the guts to do it and they are spending a lot of money on ads against me right now, those that Big Pharma. They are spending a lot of money. We will strongly protect Medicare and Social Security and we will always protect patients with preexisting conditions. America will land the first woman on the moon and the United States will be the first nation to land an astronaut on Mars. I had such a nice life before doing this, but no administration has ever done in the first three and a half years, not even close what we've done and that's very gratifying. I want to tell you that and thank you very much. We will stop the radical indoctrination of our students and restore patriotic education to our schools. We will teach our children to love our country, honor our history and always respect our great American flag, and we will live by the timeless words of our national motto. In God, We Trust for years you had a president who apologized for America. Now you have a president who is standing up for America and standing up for the great people of Florida. So get your friends get your family. Get your neighbors get your co-workers and get out and vote. We have to win this election most important election early voting has already begun, don't wait, vote it safe, go out and vote here, we're doing very well by the way. That's what the word is we'll see. We'll see, but I hear we're doing very well from Tampa to Tallahassee from Orlando, to Miami from Pensacola to right here in Jacksonville, we stand on the shoulders of Florida, patriots who gave their blood sweat and tears for this beloved nation. We inherited the legacy of American heroes who cross the oceans blazed. The trails settle the continent tame the wilderness dug out the Panama Canal laid down. The railroads raised up to skyscrapers, won two World Wars, defeated fascism and communism, and from here in this beautiful, beautiful state. This sun drenched state of Florida. We launched American astronauts to the moon, we made America into the single greatest nation in the history of the world and the best is yet to come. You are proud citizens, like you, helped build this country and together we are taking back our country. We are returning the power to you, the American people. With your help, your devotion, your drive, we are going to keep on working, we are going to keep on fighting and we are going to keep on winning winning winning. We are one movement, one people, one family and one glorious nation. Under God, and together with the incredible people of Florida, we will make America wealthy again. We will make America strong again. We will make america proud again. We will make America safe again and we will make america great again. Thank you Florida. Thank you Florida"}