{"id":375,"author":"Donald Trump","title":"Speech: Donald Trump in St. Clairsville, OH","date":"2016-06-28","link":"https://factba.se/transcript/donald-trump-speech-st.-clairsville-oh-june-28-2016","paragraphs":["I want to thank everybody. You know, I worked in Cincinnati Ohio. I had a job with my father. It came and it was very successful very, very, early in my career. It gave me a lot of confidence. And if I didn't have that confidence, who knew? Maybe I wouldn't be here with you tonight. Believe me. So I love Ohio.","I love the state. I love the people. Jack Nicklaus is a great, great friend of mine. What are you great trip? I mean, is there a champion like Jack, right? Is there a champion? And we have, we have so many. You know, I wanted to talk to you about a few things. And then as you know, we had another suicide bombing.","Istanbul, Turkey. Many, many people killed. Many, many people injured. Folks, there's something going on that's really, really bad. All right? It's bad and we better get smart and we better get tough. We're not going to have much of a country left, OK. It's bad. Terrible. So, I just left West Virginia and I was with a group.","Whoah! I didn't expect that. That's pretty good. That's a big. Who's from West Virginia? Wow! Well you know, in the primaries, we won West Virginia by like 25 points. It was a wipeout. I think I just saw a poll that were 25 or 28 up, so I never, I mean never go back to West Virginia. What do I need? I mean give me a break.","No, I'll be back. I just left West Virginia. Some great people. Bob Murray and I left a lot of miners. And a lot of miners that Hillary Clinton said, she's going to put out of business with the mines. Not going to happen. These are amazing people. And it's not going to happen. Remember her statement a few months ago, right?","In fact, we're going to put a lot of coal miners and coal companies out of business, OK. Forget it. And she's talking about steel companies and she's talking about plenty of other companies too. Because ultimately, that's what is going to happen. So, I made a speech this morning in Pittsburgh. I'm all over the place, OK. I'm all over.","The Pittsburgh area, amazing people, amazing people. And it was a well-received speech. And I talked about some different things about what we're going to do if and when, when, when, when we get in there. And we're going to put our country back to work. We're going to get jobs for people that don't have jobs right now, of which there are many, many millions of people.","They don't have jobs. It's just like, unbelievable. What's happening? We're letting our jobs go to Mexico. We're letting our jobs go to many other places all over the world. China and so many other countries, not just China by the way, China is the No. 1 abuser, because they're the biggest. But everybody, everybody is treating our jobs and our politicians, they're just not treating us right, folks.","They don't respect us. And I will tell you this. If I win, they're going to respect our country again. Just remember that. Just remember that. Thank you, man. So I thought I'd say, because in the speech today, I will talk about different things. But in this speech today, I gave certain points. But before that, what I do is, I like to find out from an area like St. Clairsville.","How are you doing, right? Right? And by the way, I have to thank your congressman who is a great guy and doing an incredible job for you. Let's give him a little applause. He's done great. So, I checked and I said, Come on folks. What's going on over here, right? So the labor force, I have people that do this for me professionally.","They go to the right books. They get the right numbers. Unfortunately, rarely are the numbers good. And I've done these many times. You know, in the primaries, we had such great, a streak like nobody's had. We got the most number of votes in the history of the Republican primary system. Think of that. Almost 14 million votes.","And think of it. There were 17 people involved. So how do you -- how do you beat other people? They were running against two people in one. So, we had almost 17, we had 17 people and we had almost 14 million votes. We won 37 states. And there's really probably never been anything like that. And it's because of the people.","We have a movement going on, folks. And I'm the messenger. I'm nothing. Believe me, I'm nothing more. I'm doing a good job as the messenger, right? That's one point. I'm doing a good job. Im doing a good job as a messenger. Yeah, we have crowds. We have turnouts. And here we started a half hour early because look, the people are still pouring in. Look at those people.","I hope you haven't missed too much. But I said, let's start early. Do you agree? What the heck? They're all coming in. They're outside going, through the machines. You know the machine. So anyway, so I check this out. The labor force in Ohio today is smaller than it was in the year 2000. And the number of unemployed people is larger.","That's not so great, federal government. Ohio has lost one in three manufacturing jobs since Bill Clinton signed an agreement to put China into the World Trade Organization. Not good. He also signed NAFTA which was a total disaster, right? NAFTA -- NAFTA has done more to destroy your community than any other single Act.","It was signed by Bill Clinton plus one in three manufacturing jobs since Bill Clinton signed an agreement to put China into the World Trade Organization. Not good. He also signed NAFTA, which was a total disaster, right? NAFTA, NAFTA has done more to destroy your community than any other single act. It was signed by Bill Clinton.","And I assume Hillary was there watching over him, right? Somewhere pretty close. Hillary supported China's entry into the World Trade Organization and also ran up $1 trillion in trade deficits with China, when she was secretary of state. Not too good. Why would she? I mean, you think she looks presidential?","I don't. All the while, the government of China was paying Bill a lot of money to make speeches. Not, I mean, is that a conflict or what? St. Clairsville region, if you think it is, has lost half of its manufacturing jobs since Bill Clinton signed NAFTA in 1994, which Hillary also supported, right? So, by the way, NAFTA was one of the worst -- maybe the worst agreement in the history of this country in terms of trade, in terms of losing our manufacturing, OK? WTO was bad, NAFTA was a disaster.","Since 2000 median household income in Ohio has declined by $9,000. Since 2000 the number of people on food stamps in Ohio has nearly tripled. One in four children in Ohio is living in poverty, OK, living in poverty. Many people in Ohio have been severely victimized by illegal immigrants. You know that, right?","Well we're going to build the wall. Don't worry. We're going to build one. We're going to build a wall. Were going to build a wall. It's going to go up. It's going to go up so fast. It's going to be as beautiful as a wall can be. It's going to be a big wall. It's going to be a wall that works. Its going to be a wall that works.","See the height of that ceiling? We may top it by a little, but that is a pretty high ceiling. Once they get up there, they're not going to want to come down. That I can tell. For example, recently in Lake County, an illegal immigrant was indicted on 16 counts including murder and attempted rape. That illegal immigrant had been previously released through Obama's non-enforcement policies.","Went on a rampage. Went on a rampage, right? From 2013 to 2014, the number of drug-related overdose deaths in Ohio increased by nearly 20%. So, look folks, we need the wall. We need to stop illegal immigration. We will stop it. We're not going to have drugs pouring into our country and destroying our youth and others, by the way.","We're going to make our country strong again. We're going to make our country rich again. We're going to make our country great again. We're not going to let our jobs get taken away. I see Hillary Clinton the other day. I don't like Donald Trump's temperament. And I was thinking, you know, maybe I was thinking, maybe I should actually have a very nice temperament and I do. I do. I get along.","I have great relationships. I have, I get along great. But you know what, it's time in our country that we had somebody with a strong temperament. I hate to say it. Its time. It's really time. Its really time. We're watching crime after crime, problem after problem. We're watching all of this stuff that happens.","We don't have victories anymore. We don't win anymore. We used to win. You know, when I was young, I was going to school. I always used to hear the United States never lost. We never lost. We never lost. We never lost a war. I guess things didn't work out so great. There's always problems. But we didn't lose wars.","And since, like Vietnam, we don't win anymore. And we don't even fight to win. I said, Keep the oil. You going to leave like, don't, don't go into Iraq. But if you're going into Iraq, keep the oil when you leave. I said it. Keep the oil. They don't listen. And I said it loud. You all heard it. For years, I've been saying it. Well, you know, who's got the oil now?","Iran is going to have it. ISIS has it at least temporarily before they get blown away. Now if I get in they'll get blown away by me. And you know, a friend of mine has a son. And he's been over in Iraq long time actually, and a great person, great citizen of our country. A great patriot. And I spoke to him not so long ago, and I said, How do you feel?","He said, Mr. Trump, it's so discouraging when we're fighting enemy and even our so-called allies. And he doesn't even know if they're our allies. We're giving them this incredible equipment and a shot gets fired in the air, and they drop their rifles, they drop their guns, they leave their Humvees that are all armor plated, and they run for the hills.","And the enemy takes it over and we fight an enemy with better equipment than we have. Their equipment is newer and better than what we have. And it's very, very sad to see what's going on. But I will tell you, I want to get back to rebuilding the United States, rebuilding the infrastructure. But before we do that we have to take care of the ISIS situation.","And I'll tell you, they are spreading. They are spreading like wildfire. ISIS is spreading. ISIS is getting our youth, getting people from various countries, many countries. They use the Internet better than we do. They're converting people to join ISIS. And you know why? Because these young impressionable people, they see what's going on and they see the way ISIS is treating us. And they say, Wow isn't that wonderful?","That's who I want to be with. We have to, we have to do things where they don't feel so good about themselves anymore folks. All right? We don't feel, we have. You look at the, you look at what happens. You remember when I got in some trouble where I talked about waterboarding. They asked me a question. They started off, they asked Ted Cruz a question.","He rightfully didn't want to get into it and he was a little bit, you know like, Don't ask me what. Don't ask me about waterboarding. Well they asked me the question. I said, I'll answer that question. They said, What do you think about waterboarding? I said, I like it a lot. I don't think it's tough enough.","You know, you know we have an enemy that's chopping off people's heads. Christians in particular. Do you know, if you are a Christian and I have tremendous evangelical support, I think you all know that. But if you are a Christian, if you are a Christian from Syria, it was one of the hardest places in the world to come into the United States.","In other words, if you were a Christian from Syria, very likely going to be just horribly treated including the ultimate treatment which is having your head chopped off. It was one of the hardest things you could do was to get into the United States. If you were a Muslim from Syria, it was one of the easier places to come into the United States from.","And I'm not saying one or the other. I'm saying how unfair is that. How bad is that. So, we have people chopping off heads and drowning 30, 40, 50 people at a time in steel cages, right? Nobody's ever seen this before. This is like from the Middle Ages. This is, nobody's seen this. When you see a few years ago, it began, right, with a wonderful young man whose parents I know.","It began and nobody saw that. You know, you didn't, you people get shot, people get wounded, people get hurt. It's war, but nobody saw the chopping off of heads. And now you see 40 and 50 at a time on the beach, in the, in the orange uniforms. And you see things happening that you haven't seen it. It's like medieval times.","We're living in medieval times. We have to stop it. We have to be so strong. We have to fight so viciously and violently because we're dealing with violent people, vicious people. When I made this tape. And, and you know we have laws to uphold. We have laws. They don't have laws. You think they go back? Look, we have laws and the laws say you can't do this, you can't do that.","Can't do a lot, right? They also say you can do anything you want and the more vicious you are, the better. So, we can't do waterboarding, which is, it's not the nicest thing but it's peanuts compared to many alternatives, right? So, we can't do waterboarding, but they can do chopping off heads, drowning people in steel cage as they can do whatever they want to do. And you know, they eat dinner like us. Can you imagine them?","Sitting around the table or wherever they're reading their dinner talking about the Americans don't do waterboarding and yet we chop off heads. They probably think we're weak, we're stupid. We don't know what we're doing. We have no leadership. You know you have to fight fire with fire. We have people out there.","We have people out there who are so vicious and smart. So vicious and they really don't know what it is to be beaten. They probably don't even understand. It's probably 30, 35,000 people and they don't understand themselves. They're beating the United States of America and they're making things impossible.","They're knocking out airplanes and doing things that are incredible. They probably don't understand themselves. How they getting away with it? Well let me just tell you something. If I'm president they're not going to get away with it. They're not going to get away with it. Now, people like Hillary Clinton will say, Oh he's temperament.","I know at one point you're saying, I don't like his tone. Folks, folks I have a very nice tone. Look, I'm a nice person. I'm a nice person. And by the way, the migration. You see what's happening? They're not coming into our country anymore just so you understand. We're not allowing thousands and thousands of people are being brought into our country.","There's no documentation, there's no paperwork. Hillary Clinton wants to raise Obama's number by 550%. You know, it's very interesting because I was saying 500%. They said, Donald Trump is wrong. It's actually 550. They were correcting the media, by the way, the most dishonest human beings in the entire world.","You know, I had a poll the other day, from one of the most dishonest newspapers I've ever seen, The Washington Post. They -- listen, totally dishonest. They polled far more Democrats than Republicans. I mean, what kind of policies? And even people that were on the other side said, That's not a very good poll.","But you know, today in the Wall Street Journal, I think today when everybody's running I believe there was a one-point spread. Now think of this. I've spent no money and we're raising a lot of money. We're raising a lot of money. Doesn't mean we have to spend it now but we're raising a lot of money. People going to be very impressed.","But I've spent no money, literally none. I spent, I think nothing on it. Hilary I heard 68 million. I heard 78 million and I heard almost a hundred million. I heard these massive numbers, you know, in negative ads which are largely untrue. I'll give you an example. My son Eric Trump and Don Trump is here.","Wheres Don? Come on, get Don over here. Got to get, got to get our boys out here. Doing a good job.","Thank you, Don. Thank you. So, she's spending money like, like I've never seen before. And I figured with such spending it after the convention, which is going to be a tremendous success. The convention so many people want to speak. So, we're going to see something. I think we're going to have some. We're going to have a great time.","More importantly, we're going to say exactly what we're going to do. But what happened? So, I said, you know we have to support our children. Do we agree? Right? We all have great children. We have to support them. So, I bought something in Scotland, Turnberry, one of the great resorts of the world. And my son Eric Trump who you've seen on television, but he's worked very hard on getting it done and getting it. We rebuilt it on budget.","Remember that. On budget ahead of schedule. How good is that, right? Wouldn't that be nice? I could even say under budget. But I decided to use marble instead of linoleum, right? On budget and ahead of schedule by a lot. So, we had a grand opening and I said to myself, I have to go and support my son. I have to go see it even though I'm on the campaign trail.","And the fair press will say he's there for one day to support. Now I'm going to Europe, Scotland for one day. I left here. I spent one night and then I left the following day, right? Because I was there to cut the ribbon with my son. Because we owe that to our children and one of the things I tell fathers is, We gotta do, we gotta do. So, a couple of things, you know, they're talking about the pound and I give them an answer on the pound that ends up in a commercial.","Somebody asked me about the pound. I give my answer at the pound. Sounds like I care about the pound. No, I care about our country. But here's really what they did that was, that was amazing. I said to everybody, because I played very little golf over the last year. Believe me, very little unlike our president who's playing like a PGA Tour schedule.","I think he plays more golf than the players on the PGA Tour. OK, but I said to my people. I'm going to go. I'm going to support my son. I'm leaving. I do not want to play golf as much as I want to play Turnberry. I do not want to play golf. I do not want to hold a golf club because I do not want to see the dishonest media portray me as somebody that was going over to play golf, OK, in the middle of a campaign.","But I wanted to support my son, Eric. And by the way, he did an A+ job. It was great. So, I go over. We have a news conference. We do a ribbon cutting. I stop at another place for a little while. The next morning, the next day I leave. I literally spend one night. And you have not too many people do that.","You go to Europe, long flight. You come back. I was back on Saturday evening. That you know because at times a lot different. I think I left on Thursday, a Friday. I think I left on Friday. I got back on Saturday, some weird thing. But I was there for very -- so Hillary, you know, she got all this money from Wall Street.","So, she takes a course and you have to understand I didn't touch a club. I didn't hit. I didn't go play. I would have loved to, but I didn't. No time, but I didn't want the image of playing. So, she takes a commercial and she has me swinging. Not a bit swing, by the way. That was a good thing. They should have at least shown me with a bad swing.","But they. Did you see that commercial where I'm hitting a golf ball? Well, that was two years before that was taken at a different place. So, Don -- she's crooked. That's why we call her crooked Hillary. Thank you. Thank you. I didn't say it. Now think of it. So here I tell my people I do not want to touch a golf club.","I will not play and I'm in a commercial hitting a golf ball. But the picture was taken from two years before. It is such a disgrace. What goes on in the world of politics? The dishonesty, the deception. It is such a total disgrace. We're going to straighten it out folks. We're going to straighten it out.","And let me tell you, Hillary Clinton is owned by Wall Street. She's owned by many people. All of the money, like she wants to take these cameras. She spent tens of millions of dollars already. How about this? She spends millions and millions and millions of dollars already on me. Right? Because you know, everyone is pouring in because of, mostly because of influence, because they want influence.","With me they know they don't have too much influence. You know what, I'm doing well in the small donations. Where do you see the small donations? I'm doing great, donaldjtrump.com. The small donations. But, but Hillary is never going to bring your jobs back, folks. She's never going to bring your jobs. Self again.","Married to the man that signed NAFTA. One of the all-time worst, right? She's not bringing your jobs back. She doesn't even know about bringing jobs. And I'll be honest with you. She's so overrated. She's so totally overrated. If, if she wanted to bring your jobs back, she couldn't. If she wanted to, if she really tried and really, really wanted to. Forget the fact that she's bought and owned by so many different people.","If she really wanted to bring those jobs back. She's so overrated. She couldn't do it anyway. So, let me just tell you, I just did this at a big speech and I have to read it because I liked it. I think it's you know, seven steps. We like it. It's going to happen fast. If I win, if I win. When, where. Thank you.","But I'm going to withdraw the United States from the trans-Pacific partnership which has not yet been ratified. So, the trans-Pacific partnership is another disaster done and pushed by special interests who want to rape our country. Just a continuing rape of our country. That's what it is too. It's a harsh word.","It's a rape of our country. This is done by wealthy people that want to take advantage of us and that want to sign another partnership. So, Hillary Clinton not so long ago said, This is the gold standard of trade pacts, the gold standard. And she's down to saying this is the gold standard. In fact, I saw it on television this morning.","The gold standard. Then when I got involved and I started pointing out all the flaws. Especially the fact that monetary manipulation, currency manipulation, which is a primary tool that other countries use, especially China to destroy our companies and to take our business. OK. It's not properly addressed and practically not even discussed at all in this.","That's not the only reason. There are many reasons. No. 1, I want to make individual deals with individual countries. I don't need to have massive that you can't get out of. Six thousand pages, our people probably never even read it. And these other countries they know every word, every comma, every paragraph, every sentence.","And our people, I just know our people. I remember with Obamacare. Remember they went to all the congressmen. No, no remember we got to repeal it and replace it. Don't worry. Its a disaster. But do you remember when they talked to people about who read it? And it's massive. It's thousands of pages. Who read it? Nobody.","Nobody. It was that fraud that said he defrauded all the people. Do you remember the guy? Everybody forgot about him. The one that wrote it and then he had a moment of jolliness where he thought he was with friends or something. And he started saying, What a joke. But we have a trans-Pacific partnership that Hillary Clinton will sign, 100%, OK 100%. But because of me, just like I shamed her into using the term radical Islamic terrorism.","Remember she wouldn't use it because Obama wouldn't use it and she didn't want -- she does not want to do anything to defend him or offend him. If she offends Obama, too risky for her, OK. So, she doesn't want to do that. So, she'll use the term now because I shamed her into it. Well I shamed her into turning against these so-called gold standards.","It's not the gold standard. It's going to be worse than after folks. It's going to suck your jobs and your industry away what we have left of it. It's a disaster. So just remember that. She will sign it 100%. She wanted it. She considered the greatest. Then she said, Oh no I'm not going to sign it. But she'll sign it. She'll make a couple of little amendments that don't mean anything, and she'll sign it. And there goes the rest of our jobs.","I'm going to appoint the toughest and smartest trade negotiators to fight on behalf of the American workers. OK? They will do it. We have the best. We have the best in the world. We use political hacks to make the biggest deals ever, bigger than company deals. When you see IBM and all of these companies making deals, this stuff is much bigger.","And we have political hacks representing us. I'm going to direct the secretary of commerce immediately to identify every violation or trade agreement, every trade agreement that's been violated which is about all of them. I'm going to have them, every single trade agreement of a foreign country, is currently using and harming our workers.","What we're doing is we have trade agreements that truly are so one sided. That they are now harming and really hurting our workers. Then I'm going to direct, totally direct them to go after these to file complaints. You know, there is a way with the appropriate agencies and use every tool. And we have many of them, but we don't use them.","And the reason we don't use them? Special interests don't want you to use them under the American International law to end these abuses of these trade agreements. It'll end folks. Believe me. And it'll end fast. This is what Ohio's going to like a lot. I'm going to tell our NAFTA partners that I intend to immediately renegotiate the terms of that agreement to get a better deal for our workers.","And I don't mean just a little bit Better! I mean so much better that you will not even believe it, OK. Then I'm going to submit a notice under Article 2205 of the NAFTA agreement that American tends to withdraw from the deal if they don't come through for us. So, we'll withdraw if they don't make the deal for us. I'm going to instruct my Treasury Secretary who will be a very good one, I already have an idea who it's going to be, to label China a currency manipulator.","Now I've been saying this for years. Everybody knows that's what they're doing. We make better products than they do but we never get a chance to show it because they manipulate their currencies. They're grand chess masters, folks and we do nothing about it. I'm not even sure if our country knows what's going on. I'll be honest.","But the reason we do nothing is because of the special interest, the lobbyists. They have our people totally taken care of. Any country that devalues their currency in order to take advantage of the United States and its workers will be met very, very sharply. And that includes tariffs and taxes for their goods coming into the country, OK? Number six.","Got to do it. Why wouldn't we do it? Why wouldn't we do it? And I'm a free trader just so you understand. But we're being taken advantage of by everybody. Got to do it. Every time China, you know they go 7%, 8%, and it's like a disaster. You know we have with GDP, we have right now. Right now, zero. A little more than zero.","If China goes to 7%, it's like a national catastrophe. We're like the dummies. We're going to be up to a very high level and we're going to be up to that level fairly soon if I win. Believe me. I'm going to instruct the United States trade representatives to bring trade cases against China both in this country and at the World Trade Organization where you're allowed to do it. We never do it. We're being manhandled, and we never do anything.","Now it's not only China. It's everyone. China is the No. 1 abuser but it's everyone. China's unfair subsidy behavior, and that's what it is, it's a subsidy behavior, is prohibited by the terms of its entrance to the World Trade Organization. And I intend to enforce those rules the way they were intended to be enforced.","That's all. And by the way, China will like us better than they like us now. They'll respect us. And it's probable that we won't even have to do it because they know I'm not playing games. They know I'm not playing games. I probably won't even have to do it. Here's China rip so, so off, left and right. And what are they doing?","They're building a massive military fortress which they're not allowed to do in the middle of the South China Sea. So, they are making unbelievable deals with us. We have a trade deficit with China of almost $500 billion a year. How do we continue to do this? Not going to happen any longer, folks. Not going to happen any longer.","Number seven, number seven. If China does not stop its illegal activities, which is illegal, including its theft of American trade secrets, I will use every lawful presidential power to remedy trade disputes. Very simple not complicated. And they'll, you watch what happens. Including the application of tariffs consistent with Section 2, a one in three or one of the Trade Act of 1974. They're right there.","First to use. No big deal. And Section 232 of the Trade Expansion Act of 1962. Now when you hear the term trade expansion or Trade Expansion Act. Not expansion for us, it's expansion for these other countries that have taken advantage. Because when I come here I go throughout Ohio. I go throughout Pennsylvania.","I go throughout New York State. I go all throughout New England. There's no expansion. We're getting the hell beat out of us. And it's going to stop. And we're going to bring our jobs back to this country. We're going to make product again. We're going to lift our wages. You know, we haven't had middle income workers.","Haven't had a real wage increase in 18 years. Think of it. They're working longer. Anybody in this category? Anybody? You want a job? I'll give you a, I'll give you a 10% less. We haven't had, I mean seriously, we haven't had an effective increase in wages, in real wages in 18 years. Statistic. And people now having to work because of Obamacare to a certain extent, because of the economy.","And they have that phony number, the 5% number. It's a total phony because when you stop looking for a job, you're no longer unemployed. So, you come off the rolls, so they come up with these phony numbers. We have so much unemployment. And even the other side admits that the employment that we do have is not good jobs.","They're not good jobs. The good jobs are gone. A lot of them, they're gone. And they're going and going and going. I'll give you the example, you've heard me talk about it is, Carrier in Indiana. They fired 1,400 great people. I won the state of Indiana. Bobby Knight helped, the greatest. Bobby Knight, great coach.","But I won the state of Indiana and Kerry gets fired a little bit before. And there are 1,400 workers that were there. Some were there for 25, 30 years, 14 years, 18 years. They all followed me. They're great guys, great people. Some women, some men, great people and they moved to Mexico. They're moving Carrier to Mexico.","Now very simply, the United States is trying to figure out, they've been talking about this for what? Seven years, eight years, nine years because they're losing all these companies to Mexico and other places. They want to give them money. They want to give them low interest loans. They don't need the money.","How about the companies that took the low interest loans and left anyway because we had bad lawyers, right? They took the money. They said they didn't ever said we had to stay, OK. Not going to happen anymore folks. What we do is we say, I hope you enjoy your new plant in Mexico. Weather's warm but that's OK. Pretty warm up here too by the way.","It's only 100 degrees in this room. But let me just tell you, if I'm president, oh I have to do it. When, when? No, I like to be nice so. See if I say when, they'll say, Oh he's so conceited, he's so terrible. So, I like to say if. I sort of mean when, but I like to say if, because I'll get, you know, won't get fair treatment.","But listen, we will have one of my people that are very, very smart. You know, we have the greatest negotiators in the world. In the United States, we don't use it. We use political ax. And I always say I want to do it myself. I want to make the call myself. I'm not supposed to as president of the United States be calling up air conditioning companies, right?","I'm not supposed to be calling the president of Carrier air conditioning but it's so easy folks. It's -- it's so, it goes so quickly. Five minutes, three minutes, two minutes. And I'll say listen, if you leave, I wish you a lot of luck. But if you do leave and you're firing these 1,400 great people, you could go to Mexico.","But every single air conditioning unit that you make, when you sell it back into the United States and you think you got to pay no tax, it doesn't work that way anymore. We're not the stupid people anymore. You're going to pay a 35% tax for that unit. Comes back in to the United States, 35%. You're going to pay a nice big tax.","Now it took me about two seconds to think of that. I'd said for years, why don't they just say we're going to do that? And you know what's going to happen? No. 1, They're not going to move. Because all of a sudden, their numbers won't work. They're not going to move. Now they may move from Indiana but they have to stay in the United States because we're going to fight for people to stay in the United States.","OK. So they can move around. Hopefully they stay in Indiana but they can move around but they're not moving to other countries. And if they do, there's going to be a price to pay. And I'll tell you what's going to happen. Now with Hillary, some lobbyists or a special interest group will call her. And she knows it's so good.","But they'll call her and she'll leave it alone. Me? I don't owe to anybody, folks. I don't owe. I do the right thing. So I'll get a call the next day. Meeting me about, let's say my representatives, will get a call the next day and say, Please inform the president of the United States, President Trump, that we are staying in the United States.","Were staying. We're staying in the United States. And that's what's going to happen folks. It's so simple. You don't have to give low interest loans. You don't have to do all this nonsense. All you do is say, Folks, you leave the country and Ill give you another one. When China devalues their currency and they make it impossible for our companies to compete, all we do is say, Hey, congratulations! We're charging you whatever the value is you know there's a certain value that you attribute to that devaluation.","We're charging when you send your goods into the United States. Lots of luck. This is going to be a penalty. We're putting a tax and/or a tariff on your thing. And you know what's going to happen? They won't devalue so fast. Believe me. They won't devalue so fast. We are going to make our country so rich again.","We're going to save our Social Security. We're going to save our Medicare. Others want to cut. We're going to save so much. We're going to rebuild our military. You know, our military is totally depleted. I don't know. Did you see the other day there was a documentary about our jet fighters whos so old they don't have parts?","They don't make the parts anymore. They get the parts from the plane graveyard. They go to the graveyards and they take parts out of planes that have been long ago left to die. And they take them out of museums. They take parts out of planes that are in museums. Not going to happen anymore folks. We're going to rebuild our military.","It's going to create jobs. We're going to have the best jet fighters. We're going to have new beautiful equipment. We're going to take care of our veterans. We're going to take care of our veterans. And folks, we are going to have a border again. We we'll have a border. I mean you see what's happening. We're going to have a border.","I get along great. Mexico, take my hat off to them. If they can get away with it, I think it's great that bringing our companies. China, take my hat off. I'm not angry at Japan. I'm not angry at China. I'm not angry at Mexico. I'm angry at our leaders who are so stupid that they don't know what's going on. They don't know what is going on. Our country is being destroyed.","It's being destroyed. So, I just want to tell you this. And by the way, for the people of Ohio, Hillary Clinton effectively wants to abolish the Second Amendment. We are going to protect our Second Amendment. We, you know that. You see what's going on. We are going to protect, you know, the NRA gave me their endorsement, one of the earliest endorsements.","I think the earliest endorsement they ever gave. And Wayne and Kris and all the people at the NRA, my son Don and, and Eric, they're members, so am I a member. But I'll tell you what. They're good people. Wayne, Chris, the whole group, I've gotten to know them so well. They're great people. They want what's good for this country, first.","Believe me, first, they want what's good for the country. They're great people. So, we are going to start winning again. We're not winning at anything. We don't win with military. We don't win with healthcare. We don't win with education. And by the way, we're cutting Common Core and we're going to bring it back local.","Local, local, local education. But we're going to start winning again. We're going to win with our military. We're going to win for our veterans. Our veterans have been treated so badly. We're going to win for our miners, that I can tell you. Ill put the miners back to work. Got to put everybody back to work.","We're going to start winning again, folks. We're going to win so much. You're going to get so sick of it. You're going to say, I can't stand the winning. I will get a call from representatives from the great state of Ohio, saying, Mr. President, our people can no longer stand it. They can't take it. You're winning too much.","Please Mr. President, please stop winning. You're winning with jobs. You're winning with military. Please let's have a few losses like it used to be, where we could lose all the time. And I'll say, you know what I'll say? I'll say no, no, no. We're going to keep winning. We're going to win with everything.","We're going to win with our military. We're going to win with every single thing we do because we are going to make our country great again. And greater, greater, greater than ever before"],"text":" I want to thank everybody. You know, I worked in Cincinnati Ohio. I had a job with my father. It came and it was very successful very, very, early in my career. It gave me a lot of confidence. And if I didn't have that confidence, who knew? Maybe I wouldn't be here with you tonight. Believe me. So I love Ohio. I love the state. I love the people. Jack Nicklaus is a great, great friend of mine. What are you great trip? I mean, is there a champion like Jack, right? Is there a champion? And we have, we have so many. You know, I wanted to talk to you about a few things. And then as you know, we had another suicide bombing. Istanbul, Turkey. Many, many people killed. Many, many people injured. Folks, there's something going on that's really, really bad. All right? It's bad and we better get smart and we better get tough. We're not going to have much of a country left, OK. It's bad. Terrible. So, I just left West Virginia and I was with a group. Whoah! I didn't expect that. That's pretty good. That's a big. Who's from West Virginia? Wow! Well you know, in the primaries, we won West Virginia by like 25 points. It was a wipeout. I think I just saw a poll that were 25 or 28 up, so I never, I mean never go back to West Virginia. What do I need? I mean give me a break. No, I'll be back. I just left West Virginia. Some great people. Bob Murray and I left a lot of miners. And a lot of miners that Hillary Clinton said, she's going to put out of business with the mines. Not going to happen. These are amazing people. And it's not going to happen. Remember her statement a few months ago, right? In fact, we're going to put a lot of coal miners and coal companies out of business, OK. Forget it. And she's talking about steel companies and she's talking about plenty of other companies too. Because ultimately, that's what is going to happen. So, I made a speech this morning in Pittsburgh. I'm all over the place, OK. I'm all over. The Pittsburgh area, amazing people, amazing people. And it was a well-received speech. And I talked about some different things about what we're going to do if and when, when, when, when we get in there. And we're going to put our country back to work. We're going to get jobs for people that don't have jobs right now, of which there are many, many millions of people. They don't have jobs. It's just like, unbelievable. What's happening? We're letting our jobs go to Mexico. We're letting our jobs go to many other places all over the world. China and so many other countries, not just China by the way, China is the No. 1 abuser, because they're the biggest. But everybody, everybody is treating our jobs and our politicians, they're just not treating us right, folks. They don't respect us. And I will tell you this. If I win, they're going to respect our country again. Just remember that. Just remember that. Thank you, man. So I thought I'd say, because in the speech today, I will talk about different things. But in this speech today, I gave certain points. But before that, what I do is, I like to find out from an area like St. Clairsville. How are you doing, right? Right? And by the way, I have to thank your congressman who is a great guy and doing an incredible job for you. Let's give him a little applause. He's done great. So, I checked and I said, Come on folks. What's going on over here, right? So the labor force, I have people that do this for me professionally. They go to the right books. They get the right numbers. Unfortunately, rarely are the numbers good. And I've done these many times. You know, in the primaries, we had such great, a streak like nobody's had. We got the most number of votes in the history of the Republican primary system. Think of that. Almost 14 million votes. And think of it. There were 17 people involved. So how do you -- how do you beat other people? They were running against two people in one. So, we had almost 17, we had 17 people and we had almost 14 million votes. We won 37 states. And there's really probably never been anything like that. And it's because of the people. We have a movement going on, folks. And I'm the messenger. I'm nothing. Believe me, I'm nothing more. I'm doing a good job as the messenger, right? That's one point. I'm doing a good job. Im doing a good job as a messenger. Yeah, we have crowds. We have turnouts. And here we started a half hour early because look, the people are still pouring in. Look at those people. I hope you haven't missed too much. But I said, let's start early. Do you agree? What the heck? They're all coming in. They're outside going, through the machines. You know the machine. So anyway, so I check this out. The labor force in Ohio today is smaller than it was in the year 2000. And the number of unemployed people is larger. That's not so great, federal government. Ohio has lost one in three manufacturing jobs since Bill Clinton signed an agreement to put China into the World Trade Organization. Not good. He also signed NAFTA which was a total disaster, right? NAFTA -- NAFTA has done more to destroy your community than any other single Act. It was signed by Bill Clinton plus one in three manufacturing jobs since Bill Clinton signed an agreement to put China into the World Trade Organization. Not good. He also signed NAFTA, which was a total disaster, right? NAFTA, NAFTA has done more to destroy your community than any other single act. It was signed by Bill Clinton. And I assume Hillary was there watching over him, right? Somewhere pretty close. Hillary supported China's entry into the World Trade Organization and also ran up $1 trillion in trade deficits with China, when she was secretary of state. Not too good. Why would she? I mean, you think she looks presidential? I don't. All the while, the government of China was paying Bill a lot of money to make speeches. Not, I mean, is that a conflict or what? St. Clairsville region, if you think it is, has lost half of its manufacturing jobs since Bill Clinton signed NAFTA in 1994, which Hillary also supported, right? So, by the way, NAFTA was one of the worst -- maybe the worst agreement in the history of this country in terms of trade, in terms of losing our manufacturing, OK? WTO was bad, NAFTA was a disaster. Since 2000 median household income in Ohio has declined by $9,000. Since 2000 the number of people on food stamps in Ohio has nearly tripled. One in four children in Ohio is living in poverty, OK, living in poverty. Many people in Ohio have been severely victimized by illegal immigrants. You know that, right? Well we're going to build the wall. Don't worry. We're going to build one. We're going to build a wall. Were going to build a wall. It's going to go up. It's going to go up so fast. It's going to be as beautiful as a wall can be. It's going to be a big wall. It's going to be a wall that works. Its going to be a wall that works. See the height of that ceiling? We may top it by a little, but that is a pretty high ceiling. Once they get up there, they're not going to want to come down. That I can tell. For example, recently in Lake County, an illegal immigrant was indicted on 16 counts including murder and attempted rape. That illegal immigrant had been previously released through Obama's non-enforcement policies. Went on a rampage. Went on a rampage, right? From 2013 to 2014, the number of drug-related overdose deaths in Ohio increased by nearly 20%. So, look folks, we need the wall. We need to stop illegal immigration. We will stop it. We're not going to have drugs pouring into our country and destroying our youth and others, by the way. We're going to make our country strong again. We're going to make our country rich again. We're going to make our country great again. We're not going to let our jobs get taken away. I see Hillary Clinton the other day. I don't like Donald Trump's temperament. And I was thinking, you know, maybe I was thinking, maybe I should actually have a very nice temperament and I do. I do. I get along. I have great relationships. I have, I get along great. But you know what, it's time in our country that we had somebody with a strong temperament. I hate to say it. Its time. It's really time. Its really time. We're watching crime after crime, problem after problem. We're watching all of this stuff that happens. We don't have victories anymore. We don't win anymore. We used to win. You know, when I was young, I was going to school. I always used to hear the United States never lost. We never lost. We never lost. We never lost a war. I guess things didn't work out so great. There's always problems. But we didn't lose wars. And since, like Vietnam, we don't win anymore. And we don't even fight to win. I said, Keep the oil. You going to leave like, don't, don't go into Iraq. But if you're going into Iraq, keep the oil when you leave. I said it. Keep the oil. They don't listen. And I said it loud. You all heard it. For years, I've been saying it. Well, you know, who's got the oil now? Iran is going to have it. ISIS has it at least temporarily before they get blown away. Now if I get in they'll get blown away by me. And you know, a friend of mine has a son. And he's been over in Iraq long time actually, and a great person, great citizen of our country. A great patriot. And I spoke to him not so long ago, and I said, How do you feel? He said, Mr. Trump, it's so discouraging when we're fighting enemy and even our so-called allies. And he doesn't even know if they're our allies. We're giving them this incredible equipment and a shot gets fired in the air, and they drop their rifles, they drop their guns, they leave their Humvees that are all armor plated, and they run for the hills. And the enemy takes it over and we fight an enemy with better equipment than we have. Their equipment is newer and better than what we have. And it's very, very sad to see what's going on. But I will tell you, I want to get back to rebuilding the United States, rebuilding the infrastructure. But before we do that we have to take care of the ISIS situation. And I'll tell you, they are spreading. They are spreading like wildfire. ISIS is spreading. ISIS is getting our youth, getting people from various countries, many countries. They use the Internet better than we do. They're converting people to join ISIS. And you know why? Because these young impressionable people, they see what's going on and they see the way ISIS is treating us. And they say, Wow isn't that wonderful? That's who I want to be with. We have to, we have to do things where they don't feel so good about themselves anymore folks. All right? We don't feel, we have. You look at the, you look at what happens. You remember when I got in some trouble where I talked about waterboarding. They asked me a question. They started off, they asked Ted Cruz a question. He rightfully didn't want to get into it and he was a little bit, you know like, Don't ask me what. Don't ask me about waterboarding. Well they asked me the question. I said, I'll answer that question. They said, What do you think about waterboarding? I said, I like it a lot. I don't think it's tough enough. You know, you know we have an enemy that's chopping off people's heads. Christians in particular. Do you know, if you are a Christian and I have tremendous evangelical support, I think you all know that. But if you are a Christian, if you are a Christian from Syria, it was one of the hardest places in the world to come into the United States. In other words, if you were a Christian from Syria, very likely going to be just horribly treated including the ultimate treatment which is having your head chopped off. It was one of the hardest things you could do was to get into the United States. If you were a Muslim from Syria, it was one of the easier places to come into the United States from. And I'm not saying one or the other. I'm saying how unfair is that. How bad is that. So, we have people chopping off heads and drowning 30, 40, 50 people at a time in steel cages, right? Nobody's ever seen this before. This is like from the Middle Ages. This is, nobody's seen this. When you see a few years ago, it began, right, with a wonderful young man whose parents I know. It began and nobody saw that. You know, you didn't, you people get shot, people get wounded, people get hurt. It's war, but nobody saw the chopping off of heads. And now you see 40 and 50 at a time on the beach, in the, in the orange uniforms. And you see things happening that you haven't seen it. It's like medieval times. We're living in medieval times. We have to stop it. We have to be so strong. We have to fight so viciously and violently because we're dealing with violent people, vicious people. When I made this tape. And, and you know we have laws to uphold. We have laws. They don't have laws. You think they go back? Look, we have laws and the laws say you can't do this, you can't do that. Can't do a lot, right? They also say you can do anything you want and the more vicious you are, the better. So, we can't do waterboarding, which is, it's not the nicest thing but it's peanuts compared to many alternatives, right? So, we can't do waterboarding, but they can do chopping off heads, drowning people in steel cage as they can do whatever they want to do. And you know, they eat dinner like us. Can you imagine them? Sitting around the table or wherever they're reading their dinner talking about the Americans don't do waterboarding and yet we chop off heads. They probably think we're weak, we're stupid. We don't know what we're doing. We have no leadership. You know you have to fight fire with fire. We have people out there. We have people out there who are so vicious and smart. So vicious and they really don't know what it is to be beaten. They probably don't even understand. It's probably 30, 35,000 people and they don't understand themselves. They're beating the United States of America and they're making things impossible. They're knocking out airplanes and doing things that are incredible. They probably don't understand themselves. How they getting away with it? Well let me just tell you something. If I'm president they're not going to get away with it. They're not going to get away with it. Now, people like Hillary Clinton will say, Oh he's temperament. I know at one point you're saying, I don't like his tone. Folks, folks I have a very nice tone. Look, I'm a nice person. I'm a nice person. And by the way, the migration. You see what's happening? They're not coming into our country anymore just so you understand. We're not allowing thousands and thousands of people are being brought into our country. There's no documentation, there's no paperwork. Hillary Clinton wants to raise Obama's number by 550%. You know, it's very interesting because I was saying 500%. They said, Donald Trump is wrong. It's actually 550. They were correcting the media, by the way, the most dishonest human beings in the entire world. You know, I had a poll the other day, from one of the most dishonest newspapers I've ever seen, The Washington Post. They -- listen, totally dishonest. They polled far more Democrats than Republicans. I mean, what kind of policies? And even people that were on the other side said, That's not a very good poll. But you know, today in the Wall Street Journal, I think today when everybody's running I believe there was a one-point spread. Now think of this. I've spent no money and we're raising a lot of money. We're raising a lot of money. Doesn't mean we have to spend it now but we're raising a lot of money. People going to be very impressed. But I've spent no money, literally none. I spent, I think nothing on it. Hilary I heard 68 million. I heard 78 million and I heard almost a hundred million. I heard these massive numbers, you know, in negative ads which are largely untrue. I'll give you an example. My son Eric Trump and Don Trump is here. Wheres Don? Come on, get Don over here. Got to get, got to get our boys out here. Doing a good job. No pressure, right? No pressure. Well, yeah. Thank you, guys, very much. Just listening and getting the opportunity, the amazing opportunity to go all around the country following my father on this amazing journey. And it's, it's been incredible. It's really, it's no longer a campaign. It's a mandate from the people to do something different. It's a movement. And I want to thank you for all the incredible support that you guys have given him, for giving you guys a voice and that's what it is. He's finally giving the hardworking people of this country who have been left in the dust. The people who have been forgotten about by the Washington elites. He's giving you all a voice again because your voice matters. Your voice is what built this country. Your hard work and efforts are what made this country what it is. And we're going to make sure that you have the ability to have that voice again. So, thank you so much for letting me be a just a small part of this incredible mission because it is just that and we're going to make you proud. Thank you. Thank you, Don. Thank you. So, she's spending money like, like I've never seen before. And I figured with such spending it after the convention, which is going to be a tremendous success. The convention so many people want to speak. So, we're going to see something. I think we're going to have some. We're going to have a great time. More importantly, we're going to say exactly what we're going to do. But what happened? So, I said, you know we have to support our children. Do we agree? Right? We all have great children. We have to support them. So, I bought something in Scotland, Turnberry, one of the great resorts of the world. And my son Eric Trump who you've seen on television, but he's worked very hard on getting it done and getting it. We rebuilt it on budget. Remember that. On budget ahead of schedule. How good is that, right? Wouldn't that be nice? I could even say under budget. But I decided to use marble instead of linoleum, right? On budget and ahead of schedule by a lot. So, we had a grand opening and I said to myself, I have to go and support my son. I have to go see it even though I'm on the campaign trail. And the fair press will say he's there for one day to support. Now I'm going to Europe, Scotland for one day. I left here. I spent one night and then I left the following day, right? Because I was there to cut the ribbon with my son. Because we owe that to our children and one of the things I tell fathers is, We gotta do, we gotta do. So, a couple of things, you know, they're talking about the pound and I give them an answer on the pound that ends up in a commercial. Somebody asked me about the pound. I give my answer at the pound. Sounds like I care about the pound. No, I care about our country. But here's really what they did that was, that was amazing. I said to everybody, because I played very little golf over the last year. Believe me, very little unlike our president who's playing like a PGA Tour schedule. I think he plays more golf than the players on the PGA Tour. OK, but I said to my people. I'm going to go. I'm going to support my son. I'm leaving. I do not want to play golf as much as I want to play Turnberry. I do not want to play golf. I do not want to hold a golf club because I do not want to see the dishonest media portray me as somebody that was going over to play golf, OK, in the middle of a campaign. But I wanted to support my son, Eric. And by the way, he did an A+ job. It was great. So, I go over. We have a news conference. We do a ribbon cutting. I stop at another place for a little while. The next morning, the next day I leave. I literally spend one night. And you have not too many people do that. You go to Europe, long flight. You come back. I was back on Saturday evening. That you know because at times a lot different. I think I left on Thursday, a Friday. I think I left on Friday. I got back on Saturday, some weird thing. But I was there for very -- so Hillary, you know, she got all this money from Wall Street. So, she takes a course and you have to understand I didn't touch a club. I didn't hit. I didn't go play. I would have loved to, but I didn't. No time, but I didn't want the image of playing. So, she takes a commercial and she has me swinging. Not a bit swing, by the way. That was a good thing. They should have at least shown me with a bad swing. But they. Did you see that commercial where I'm hitting a golf ball? Well, that was two years before that was taken at a different place. So, Don -- she's crooked. That's why we call her crooked Hillary. Thank you. Thank you. I didn't say it. Now think of it. So here I tell my people I do not want to touch a golf club. I will not play and I'm in a commercial hitting a golf ball. But the picture was taken from two years before. It is such a disgrace. What goes on in the world of politics? The dishonesty, the deception. It is such a total disgrace. We're going to straighten it out folks. We're going to straighten it out. And let me tell you, Hillary Clinton is owned by Wall Street. She's owned by many people. All of the money, like she wants to take these cameras. She spent tens of millions of dollars already. How about this? She spends millions and millions and millions of dollars already on me. Right? Because you know, everyone is pouring in because of, mostly because of influence, because they want influence. With me they know they don't have too much influence. You know what, I'm doing well in the small donations. Where do you see the small donations? I'm doing great, donaldjtrump.com. The small donations. But, but Hillary is never going to bring your jobs back, folks. She's never going to bring your jobs. Self again. Married to the man that signed NAFTA. One of the all-time worst, right? She's not bringing your jobs back. She doesn't even know about bringing jobs. And I'll be honest with you. She's so overrated. She's so totally overrated. If, if she wanted to bring your jobs back, she couldn't. If she wanted to, if she really tried and really, really wanted to. Forget the fact that she's bought and owned by so many different people. If she really wanted to bring those jobs back. She's so overrated. She couldn't do it anyway. So, let me just tell you, I just did this at a big speech and I have to read it because I liked it. I think it's you know, seven steps. We like it. It's going to happen fast. If I win, if I win. When, where. Thank you. But I'm going to withdraw the United States from the trans-Pacific partnership which has not yet been ratified. So, the trans-Pacific partnership is another disaster done and pushed by special interests who want to rape our country. Just a continuing rape of our country. That's what it is too. It's a harsh word. It's a rape of our country. This is done by wealthy people that want to take advantage of us and that want to sign another partnership. So, Hillary Clinton not so long ago said, This is the gold standard of trade pacts, the gold standard. And she's down to saying this is the gold standard. In fact, I saw it on television this morning. The gold standard. Then when I got involved and I started pointing out all the flaws. Especially the fact that monetary manipulation, currency manipulation, which is a primary tool that other countries use, especially China to destroy our companies and to take our business. OK. It's not properly addressed and practically not even discussed at all in this. That's not the only reason. There are many reasons. No. 1, I want to make individual deals with individual countries. I don't need to have massive that you can't get out of. Six thousand pages, our people probably never even read it. And these other countries they know every word, every comma, every paragraph, every sentence. And our people, I just know our people. I remember with Obamacare. Remember they went to all the congressmen. No, no remember we got to repeal it and replace it. Don't worry. Its a disaster. But do you remember when they talked to people about who read it? And it's massive. It's thousands of pages. Who read it? Nobody. Nobody. It was that fraud that said he defrauded all the people. Do you remember the guy? Everybody forgot about him. The one that wrote it and then he had a moment of jolliness where he thought he was with friends or something. And he started saying, What a joke. But we have a trans-Pacific partnership that Hillary Clinton will sign, 100%, OK 100%. But because of me, just like I shamed her into using the term radical Islamic terrorism. Remember she wouldn't use it because Obama wouldn't use it and she didn't want -- she does not want to do anything to defend him or offend him. If she offends Obama, too risky for her, OK. So, she doesn't want to do that. So, she'll use the term now because I shamed her into it. Well I shamed her into turning against these so-called gold standards. It's not the gold standard. It's going to be worse than after folks. It's going to suck your jobs and your industry away what we have left of it. It's a disaster. So just remember that. She will sign it 100%. She wanted it. She considered the greatest. Then she said, Oh no I'm not going to sign it. But she'll sign it. She'll make a couple of little amendments that don't mean anything, and she'll sign it. And there goes the rest of our jobs. I'm going to appoint the toughest and smartest trade negotiators to fight on behalf of the American workers. OK? They will do it. We have the best. We have the best in the world. We use political hacks to make the biggest deals ever, bigger than company deals. When you see IBM and all of these companies making deals, this stuff is much bigger. And we have political hacks representing us. I'm going to direct the secretary of commerce immediately to identify every violation or trade agreement, every trade agreement that's been violated which is about all of them. I'm going to have them, every single trade agreement of a foreign country, is currently using and harming our workers. What we're doing is we have trade agreements that truly are so one sided. That they are now harming and really hurting our workers. Then I'm going to direct, totally direct them to go after these to file complaints. You know, there is a way with the appropriate agencies and use every tool. And we have many of them, but we don't use them. And the reason we don't use them? Special interests don't want you to use them under the American International law to end these abuses of these trade agreements. It'll end folks. Believe me. And it'll end fast. This is what Ohio's going to like a lot. I'm going to tell our NAFTA partners that I intend to immediately renegotiate the terms of that agreement to get a better deal for our workers. And I don't mean just a little bit Better! I mean so much better that you will not even believe it, OK. Then I'm going to submit a notice under Article 2205 of the NAFTA agreement that American tends to withdraw from the deal if they don't come through for us. So, we'll withdraw if they don't make the deal for us. I'm going to instruct my Treasury Secretary who will be a very good one, I already have an idea who it's going to be, to label China a currency manipulator. Now I've been saying this for years. Everybody knows that's what they're doing. We make better products than they do but we never get a chance to show it because they manipulate their currencies. They're grand chess masters, folks and we do nothing about it. I'm not even sure if our country knows what's going on. I'll be honest. But the reason we do nothing is because of the special interest, the lobbyists. They have our people totally taken care of. Any country that devalues their currency in order to take advantage of the United States and its workers will be met very, very sharply. And that includes tariffs and taxes for their goods coming into the country, OK? Number six. Got to do it. Why wouldn't we do it? Why wouldn't we do it? And I'm a free trader just so you understand. But we're being taken advantage of by everybody. Got to do it. Every time China, you know they go 7%, 8%, and it's like a disaster. You know we have with GDP, we have right now. Right now, zero. A little more than zero. If China goes to 7%, it's like a national catastrophe. We're like the dummies. We're going to be up to a very high level and we're going to be up to that level fairly soon if I win. Believe me. I'm going to instruct the United States trade representatives to bring trade cases against China both in this country and at the World Trade Organization where you're allowed to do it. We never do it. We're being manhandled, and we never do anything. Now it's not only China. It's everyone. China is the No. 1 abuser but it's everyone. China's unfair subsidy behavior, and that's what it is, it's a subsidy behavior, is prohibited by the terms of its entrance to the World Trade Organization. And I intend to enforce those rules the way they were intended to be enforced. That's all. And by the way, China will like us better than they like us now. They'll respect us. And it's probable that we won't even have to do it because they know I'm not playing games. They know I'm not playing games. I probably won't even have to do it. Here's China rip so, so off, left and right. And what are they doing? They're building a massive military fortress which they're not allowed to do in the middle of the South China Sea. So, they are making unbelievable deals with us. We have a trade deficit with China of almost $500 billion a year. How do we continue to do this? Not going to happen any longer, folks. Not going to happen any longer. Number seven, number seven. If China does not stop its illegal activities, which is illegal, including its theft of American trade secrets, I will use every lawful presidential power to remedy trade disputes. Very simple not complicated. And they'll, you watch what happens. Including the application of tariffs consistent with Section 2, a one in three or one of the Trade Act of 1974. They're right there. First to use. No big deal. And Section 232 of the Trade Expansion Act of 1962. Now when you hear the term trade expansion or Trade Expansion Act. Not expansion for us, it's expansion for these other countries that have taken advantage. Because when I come here I go throughout Ohio. I go throughout Pennsylvania. I go throughout New York State. I go all throughout New England. There's no expansion. We're getting the hell beat out of us. And it's going to stop. And we're going to bring our jobs back to this country. We're going to make product again. We're going to lift our wages. You know, we haven't had middle income workers. Haven't had a real wage increase in 18 years. Think of it. They're working longer. Anybody in this category? Anybody? You want a job? I'll give you a, I'll give you a 10% less. We haven't had, I mean seriously, we haven't had an effective increase in wages, in real wages in 18 years. Statistic. And people now having to work because of Obamacare to a certain extent, because of the economy. And they have that phony number, the 5% number. It's a total phony because when you stop looking for a job, you're no longer unemployed. So, you come off the rolls, so they come up with these phony numbers. We have so much unemployment. And even the other side admits that the employment that we do have is not good jobs. They're not good jobs. The good jobs are gone. A lot of them, they're gone. And they're going and going and going. I'll give you the example, you've heard me talk about it is, Carrier in Indiana. They fired 1,400 great people. I won the state of Indiana. Bobby Knight helped, the greatest. Bobby Knight, great coach. But I won the state of Indiana and Kerry gets fired a little bit before. And there are 1,400 workers that were there. Some were there for 25, 30 years, 14 years, 18 years. They all followed me. They're great guys, great people. Some women, some men, great people and they moved to Mexico. They're moving Carrier to Mexico. Now very simply, the United States is trying to figure out, they've been talking about this for what? Seven years, eight years, nine years because they're losing all these companies to Mexico and other places. They want to give them money. They want to give them low interest loans. They don't need the money. How about the companies that took the low interest loans and left anyway because we had bad lawyers, right? They took the money. They said they didn't ever said we had to stay, OK. Not going to happen anymore folks. What we do is we say, I hope you enjoy your new plant in Mexico. Weather's warm but that's OK. Pretty warm up here too by the way. It's only 100 degrees in this room. But let me just tell you, if I'm president, oh I have to do it. When, when? No, I like to be nice so. See if I say when, they'll say, Oh he's so conceited, he's so terrible. So, I like to say if. I sort of mean when, but I like to say if, because I'll get, you know, won't get fair treatment. But listen, we will have one of my people that are very, very smart. You know, we have the greatest negotiators in the world. In the United States, we don't use it. We use political ax. And I always say I want to do it myself. I want to make the call myself. I'm not supposed to as president of the United States be calling up air conditioning companies, right? I'm not supposed to be calling the president of Carrier air conditioning but it's so easy folks. It's -- it's so, it goes so quickly. Five minutes, three minutes, two minutes. And I'll say listen, if you leave, I wish you a lot of luck. But if you do leave and you're firing these 1,400 great people, you could go to Mexico. But every single air conditioning unit that you make, when you sell it back into the United States and you think you got to pay no tax, it doesn't work that way anymore. We're not the stupid people anymore. You're going to pay a 35% tax for that unit. Comes back in to the United States, 35%. You're going to pay a nice big tax. Now it took me about two seconds to think of that. I'd said for years, why don't they just say we're going to do that? And you know what's going to happen? No. 1, They're not going to move. Because all of a sudden, their numbers won't work. They're not going to move. Now they may move from Indiana but they have to stay in the United States because we're going to fight for people to stay in the United States. OK. So they can move around. Hopefully they stay in Indiana but they can move around but they're not moving to other countries. And if they do, there's going to be a price to pay. And I'll tell you what's going to happen. Now with Hillary, some lobbyists or a special interest group will call her. And she knows it's so good. But they'll call her and she'll leave it alone. Me? I don't owe to anybody, folks. I don't owe. I do the right thing. So I'll get a call the next day. Meeting me about, let's say my representatives, will get a call the next day and say, Please inform the president of the United States, President Trump, that we are staying in the United States. Were staying. We're staying in the United States. And that's what's going to happen folks. It's so simple. You don't have to give low interest loans. You don't have to do all this nonsense. All you do is say, Folks, you leave the country and Ill give you another one. When China devalues their currency and they make it impossible for our companies to compete, all we do is say, Hey, congratulations! We're charging you whatever the value is you know there's a certain value that you attribute to that devaluation. We're charging when you send your goods into the United States. Lots of luck. This is going to be a penalty. We're putting a tax and/or a tariff on your thing. And you know what's going to happen? They won't devalue so fast. Believe me. They won't devalue so fast. We are going to make our country so rich again. We're going to save our Social Security. We're going to save our Medicare. Others want to cut. We're going to save so much. We're going to rebuild our military. You know, our military is totally depleted. I don't know. Did you see the other day there was a documentary about our jet fighters whos so old they don't have parts? They don't make the parts anymore. They get the parts from the plane graveyard. They go to the graveyards and they take parts out of planes that have been long ago left to die. And they take them out of museums. They take parts out of planes that are in museums. Not going to happen anymore folks. We're going to rebuild our military. It's going to create jobs. We're going to have the best jet fighters. We're going to have new beautiful equipment. We're going to take care of our veterans. We're going to take care of our veterans. And folks, we are going to have a border again. We we'll have a border. I mean you see what's happening. We're going to have a border. I get along great. Mexico, take my hat off to them. If they can get away with it, I think it's great that bringing our companies. China, take my hat off. I'm not angry at Japan. I'm not angry at China. I'm not angry at Mexico. I'm angry at our leaders who are so stupid that they don't know what's going on. They don't know what is going on. Our country is being destroyed. It's being destroyed. So, I just want to tell you this. And by the way, for the people of Ohio, Hillary Clinton effectively wants to abolish the Second Amendment. We are going to protect our Second Amendment. We, you know that. You see what's going on. We are going to protect, you know, the NRA gave me their endorsement, one of the earliest endorsements. I think the earliest endorsement they ever gave. And Wayne and Kris and all the people at the NRA, my son Don and, and Eric, they're members, so am I a member. But I'll tell you what. They're good people. Wayne, Chris, the whole group, I've gotten to know them so well. They're great people. They want what's good for this country, first. Believe me, first, they want what's good for the country. They're great people. So, we are going to start winning again. We're not winning at anything. We don't win with military. We don't win with healthcare. We don't win with education. And by the way, we're cutting Common Core and we're going to bring it back local. Local, local, local education. But we're going to start winning again. We're going to win with our military. We're going to win for our veterans. Our veterans have been treated so badly. We're going to win for our miners, that I can tell you. Ill put the miners back to work. Got to put everybody back to work. We're going to start winning again, folks. We're going to win so much. You're going to get so sick of it. You're going to say, I can't stand the winning. I will get a call from representatives from the great state of Ohio, saying, Mr. President, our people can no longer stand it. They can't take it. You're winning too much. Please Mr. President, please stop winning. You're winning with jobs. You're winning with military. Please let's have a few losses like it used to be, where we could lose all the time. And I'll say, you know what I'll say? I'll say no, no, no. We're going to keep winning. We're going to win with everything. We're going to win with our military. We're going to win with every single thing we do because we are going to make our country great again. And greater, greater, greater than ever before"}