{"id":377,"author":"Donald Trump","title":"Speech: Donald Trump at His Golf Course in Turnberry, Scotland","date":"2016-06-24","link":"https://factba.se/transcript/donald-trump-speech-turnberry-sct-june-24-2016","paragraphs":["Good. Thank you very much I appreciate it. And this is an amazing honor. It's an amazing day, a very historic day for a lot of reasons. Not only in Turnberry. This is one of the big votes in the history of Europe, in Scotland and everywhere. And it was very exciting coming in and we were landing and we just heard the results.","I wish everybody a lot of luck. I think that it's purely historic. And what's happening is historic. So it's an honor to be with you. My mother was born in Scotland, in Stornoway. She loves Scotland. She would be here a lot.","She would come every year with my sister Maryanne and my sister Elizabeth. And they just loved it. Her loyalty to Scotland was incredible. She respected and loved the Queen. And she loved the ceremony and the pomp -- pomp and circumstance. And she was something special. And to think that we'd be here owning Turnberry one day would be incredible.","She would come to Turnberry with her friends and they'd have dinner at Turnberry.","She didn't play golf but they'd have dinner at Turnberry, so having taken this hotel and doing the job that we've done with it is just an honor that I was given the opportunity. We bought it about four and a half years ago. The town council has been incredible. The local politicians and all of the politicians, all throughout, have been absolutely incredible.","And they have proved virtually everything that we asked for. We asked for the right things but the approval process because it's so historic it had to go through many different layers.","But every single thing that we wanted they agreed that they thought it was good. And in some cases great. We've taken the lighthouse, which is a very, very important building in Florida. I've been in Scotland. We've taken that building and made it something really special. Inside the lighthouse right now is incredible suites.","It's from the halfway house. This is the 19th and it's called the halfway house. And at the bottom you have dining and golfers will stop and they will go and get something to eat and then they go to the 10th hole, 10 feet . And it was in this repair and all of the people from Limerick, Scotland, and all of the people that we had to go through were I just thank you.","Because it was a -- it was a long difficult process getting that improve but they really wanted to see it at the highest level.","And now it's really at a higher level than it ever was and when you see, I don't know if you will be able to see, but if you do you should try and get to see the suites because they are two of the most beautiful suites you'll ever see. And you know when the water's rough, today it's very calm. In fact, I've almost never seen it like this but sometimes, you know, waves add a little impression unto this piece of land that was standing and one of the most beautiful sights you'll ever see.","This whole didn't exist. The Royal and Ancient has been incredible. They've worked with us on design. They've wanted to do these changes for probably close to 50 years because it was so obvious and -- and we've made certain changes to the course. In addition to that, we've finally renovated the course brand new sprinkler system.","The highest level. Many of the holes have been jiggered maybe even longer and new do everything.","And yet it's the same trend. But the hole nine, 10, 11, and four have been changed and moved out into the ocean. This hole is an example from approximately this area you would hit over there. This is the part four and you hit over there and it was a much different thing.","Now you're hitting out over the ocean and just to the right of the lighthouse you have the green and a lot of people think this will be the greatest part three anywhere in the world. And then 10 becomes the par five that golf is known to members. I think you have a lot of the members of Turnberry right in the back.","The captain and a lot of the members, we appreciate your being here, and we have been No. 11, which is a spectacular home.","Also part three right on the cliffs and that hall was moved about 200 yards to the left. And Tom Watson saw me and he won the British Open many times, Peter, right? Many times, and he said five. He said, \"What a change.\" and he actually thought it was a very easy hole the way it was but he probably liked it because he would birdie it all the time.","But what we've done is -- is what -- what everybody's wanted to do for many, many decades.","I want to thank Martin Ebert, who has done an incredible job as the architect, and I called up -- I called up the Royal and Ancient, Peter Dawson, who is an amazing man and a great guy and a talented person, and loves the sport and loves Scotland. And frankly I said, \"Who should I use as the architect?\" And he gave me a big favor.","He recommended Martin. And so I want to thank you and I want to thank Peter Dawson, who is here with us now. Peter Dawson ended up doing well in these interviews and he has been just a great friend and I thank you for everything, Peter. Your recommendations have been incredible. Thank you very much. My son Eric was in charge of the job.","I wanted him to be -- you know, really come over here. And Ivanka and Don came with me to congratulate and he was really we gave him the responsibility of building the hotel as you know has always got it down to the steal and rebuild.","I think it's going to be one of the great hotels of the world. It already was but it was in somewhat dilapidated shape and we've -- we had a choice. We can fix it and paint it or we could do it the way we did it and we -- we went back to the original plans. We were able to get the plans from the original architects from many, many years ago, it's 1906, and we went back to those plans, which are magnificent rooms, very big.","They were cut in half and all sorts of things happened over the years and we have something that's very special. It is considered one of the most beautiful buildings in all of Dallas.","I think we can say that here. You know usually a building, when you have a building on a golf course that's not an asset. That's called a liability. This is one of the buildings where even though it's in the distance when you're in the 18th floor and you're looking down the fairway and you're looking at that building, it's considered one of the great beautiful and historic sites in golf.","As you know Jack Nicklaus won the Open Championship and Tom Watson and you know you have so many greats here but actually the greatest, I guess, they say one of the greatest challenges is not the single greatest tournament in the history of golf. It was the duel in the sun. Was that in 1977? With Tom Watson and Jack Nicklaus and that was just birdie, birdie, birdie.","Everybody else was, sort of, they were down the track, right? And he just kept going while I was there, Tom Watson chipped in from an area that you can even hit the green let alone get into the hole.","There was only one way to stop the shot, and I said we chipped it in, that's what he did. And Jack is an incredible sportsman and the way he walked off the course was one of the great scenes in all of golf and Jack Nicklaus is a -- is a friend of mine and a great champion, and great champions, whether it's Tom Watson or Greg Norman or Nick Price has had amazing winners at Turnberry.","And really, not only amazing wonders for the Open Championship but some of the best tournaments I've ever had. So we listened to the Royal and Ancient and we did what they wanted us to do.","In addition, they'd put in a tremendous miles of television cables and everything was underground so it was all ready to go from that standpoint and the town is so happy and so thrilled and the town council who's here and I want to thank you all very much for being here. They have been really terrific. So again in honor of my mother, Mary McLeod, and she was terrific person.","She came to the United States at the age of 19. She was a beautiful, beautiful woman and a very smart woman and she met my father and that was it.","They were married for a long time and they had a great marriage and really a great marriage. But in honor of my mother, Mary McLeod, and in honor of my children, Don was very instrumental in buying it. We had -- the owners were here, they were friends of mine from Dubai.","Great people but you know this wasn't their thing because they didn't know too much about golf and they actually felt why should we move a hole into the ocean when we already have a hole. And I said well it's not better together that's already there. So you know they didn't understand the golfing but it always did well.","You know Turnberry, because of its location, because of the fact that you're on the ocean, because it's one of the most spectacular properties in the world, it always did well.","But now since we opened, we actually opened a number of weeks ago the course and we haven't had an empty slot. Here you'll be happy because we haven't had one empty slot. It's from morning till night, it's packed. So it's a special location. I don't know it's just a location. Everybody comes here, whether it's in London or wherever they want to be. They all want to come to Turnberry.","And with that I just want to thank a few people. I have to thank Ralph, who -- The one thing the other owners did was the -- Where is Ralph?","Ralph, the one thing they said is they said, \"You have a man named Ralph?\" He was an assistant manager at that time and one of the owners was sort of a friend of mine said he's the most talented hotel person, . And they said, \"You should have him be the manager.\" and we did, we appointed him as the manager.","It's been nothing but great stuff and the hotel opened about two weeks ago and it's been -- it's been amazing.","Eric did such a good job. We've had very few complaints almost no complaints about the rooms. Usually when a hotel opens you have drains that aren't connected and pipes that aren't connected and water that's spewing through the rooms and all sorts of things. We haven't had anything. It's really -- They did done a great job the contractors have done a fantastic job and the hotel is built to the absolute highest standards of luxury.","And the force is built to the absolute highest standards of tournament golf and I think there'll be nothing like it in one of the reviews in, I think, Golf Digest in the United States.","They compared the 14 golf courses, and the 14 golf courses and it's where they played the open championship. And this writer said, \"Turnberry is No. 1 but because Trump owns it I make it at No. 3.\" And I said to myself, \"That's hatred. That's hatred.\" But I'm used to that with the press. That's something I considered it a compliment.","I immediately said that review to the royal in Egypt. I sent it to Mark. So I just want to thank everybody.","I want to ask perhaps Eric and Ivanka and Don to come forward and say a few words, and again Ivanka came and Eric said, \"Well, this must be important because Ivanka came, right?\" Because she -- she's something else. Well, my children have done a great job and I mean one of the very important reasons I'm here, not only because we own it and we're going to cherish it. We're going to take care of it. One of the great, great places, great resorts of the world, but also because I want to really support my children.","They work very hard to make this property what it is and what it's now become. The reviews of the course have been phenomenal not just like good. Even people that truly hate me are saying it's the best they've ever seen, which is always -- To me, Peter, that's always my greatest. When they hate you and they give it a 10, that means you've got to -- you did a good job, right?","But the reviews have been phenomenal and the view -- reviews of the hotel have been great. The hotel is -- I didn't even put a mortgage on, we have no debt, no financing, no anything, and I wanted to do that with Turnberry when I haven't any financing in Turnberry because it's so special. So I just did this out of cash flow and we just have absolutely zero-debt property, and I think it's something that's going to be a great tribute to Scotland and many other places and also a great tribute to the world of golf for many, many decades to come.","So is Eric in particular because you built it. Can I ask Eric and Ivanka and Don to come forward. Thank you all very much. Thank you for being here."],"text":" Good. Thank you very much I appreciate it. And this is an amazing honor. It's an amazing day, a very historic day for a lot of reasons. Not only in Turnberry. This is one of the big votes in the history of Europe, in Scotland and everywhere. And it was very exciting coming in and we were landing and we just heard the results. I wish everybody a lot of luck. I think that it's purely historic. And what's happening is historic. So it's an honor to be with you. My mother was born in Scotland, in Stornoway. She loves Scotland. She would be here a lot. She would come every year with my sister Maryanne and my sister Elizabeth. And they just loved it. Her loyalty to Scotland was incredible. She respected and loved the Queen. And she loved the ceremony and the pomp -- pomp and circumstance. And she was something special. And to think that we'd be here owning Turnberry one day would be incredible. She would come to Turnberry with her friends and they'd have dinner at Turnberry. She didn't play golf but they'd have dinner at Turnberry, so having taken this hotel and doing the job that we've done with it is just an honor that I was given the opportunity. We bought it about four and a half years ago. The town council has been incredible. The local politicians and all of the politicians, all throughout, have been absolutely incredible. And they have proved virtually everything that we asked for. We asked for the right things but the approval process because it's so historic it had to go through many different layers. But every single thing that we wanted they agreed that they thought it was good. And in some cases great. We've taken the lighthouse, which is a very, very important building in Florida. I've been in Scotland. We've taken that building and made it something really special. Inside the lighthouse right now is incredible suites. It's from the halfway house. This is the 19th and it's called the halfway house. And at the bottom you have dining and golfers will stop and they will go and get something to eat and then they go to the 10th hole, 10 feet . And it was in this repair and all of the people from Limerick, Scotland, and all of the people that we had to go through were I just thank you. Because it was a -- it was a long difficult process getting that improve but they really wanted to see it at the highest level. And now it's really at a higher level than it ever was and when you see, I don't know if you will be able to see, but if you do you should try and get to see the suites because they are two of the most beautiful suites you'll ever see. And you know when the water's rough, today it's very calm. In fact, I've almost never seen it like this but sometimes, you know, waves add a little impression unto this piece of land that was standing and one of the most beautiful sights you'll ever see. This whole didn't exist. The Royal and Ancient has been incredible. They've worked with us on design. They've wanted to do these changes for probably close to 50 years because it was so obvious and -- and we've made certain changes to the course. In addition to that, we've finally renovated the course brand new sprinkler system. The highest level. Many of the holes have been jiggered maybe even longer and new do everything. And yet it's the same trend. But the hole nine, 10, 11, and four have been changed and moved out into the ocean. This hole is an example from approximately this area you would hit over there. This is the part four and you hit over there and it was a much different thing. Now you're hitting out over the ocean and just to the right of the lighthouse you have the green and a lot of people think this will be the greatest part three anywhere in the world. And then 10 becomes the par five that golf is known to members. I think you have a lot of the members of Turnberry right in the back. The captain and a lot of the members, we appreciate your being here, and we have been No. 11, which is a spectacular home. Also part three right on the cliffs and that hall was moved about 200 yards to the left. And Tom Watson saw me and he won the British Open many times, Peter, right? Many times, and he said five. He said, \"What a change.\" and he actually thought it was a very easy hole the way it was but he probably liked it because he would birdie it all the time. But what we've done is -- is what -- what everybody's wanted to do for many, many decades. I want to thank Martin Ebert, who has done an incredible job as the architect, and I called up -- I called up the Royal and Ancient, Peter Dawson, who is an amazing man and a great guy and a talented person, and loves the sport and loves Scotland. And frankly I said, \"Who should I use as the architect?\" And he gave me a big favor. He recommended Martin. And so I want to thank you and I want to thank Peter Dawson, who is here with us now. Peter Dawson ended up doing well in these interviews and he has been just a great friend and I thank you for everything, Peter. Your recommendations have been incredible. Thank you very much. My son Eric was in charge of the job. I wanted him to be -- you know, really come over here. And Ivanka and Don came with me to congratulate and he was really we gave him the responsibility of building the hotel as you know has always got it down to the steal and rebuild. I think it's going to be one of the great hotels of the world. It already was but it was in somewhat dilapidated shape and we've -- we had a choice. We can fix it and paint it or we could do it the way we did it and we -- we went back to the original plans. We were able to get the plans from the original architects from many, many years ago, it's 1906, and we went back to those plans, which are magnificent rooms, very big. They were cut in half and all sorts of things happened over the years and we have something that's very special. It is considered one of the most beautiful buildings in all of Dallas. I think we can say that here. You know usually a building, when you have a building on a golf course that's not an asset. That's called a liability. This is one of the buildings where even though it's in the distance when you're in the 18th floor and you're looking down the fairway and you're looking at that building, it's considered one of the great beautiful and historic sites in golf. As you know Jack Nicklaus won the Open Championship and Tom Watson and you know you have so many greats here but actually the greatest, I guess, they say one of the greatest challenges is not the single greatest tournament in the history of golf. It was the duel in the sun. Was that in 1977? With Tom Watson and Jack Nicklaus and that was just birdie, birdie, birdie. Everybody else was, sort of, they were down the track, right? And he just kept going while I was there, Tom Watson chipped in from an area that you can even hit the green let alone get into the hole. There was only one way to stop the shot, and I said we chipped it in, that's what he did. And Jack is an incredible sportsman and the way he walked off the course was one of the great scenes in all of golf and Jack Nicklaus is a -- is a friend of mine and a great champion, and great champions, whether it's Tom Watson or Greg Norman or Nick Price has had amazing winners at Turnberry. And really, not only amazing wonders for the Open Championship but some of the best tournaments I've ever had. So we listened to the Royal and Ancient and we did what they wanted us to do. In addition, they'd put in a tremendous miles of television cables and everything was underground so it was all ready to go from that standpoint and the town is so happy and so thrilled and the town council who's here and I want to thank you all very much for being here. They have been really terrific. So again in honor of my mother, Mary McLeod, and she was terrific person. She came to the United States at the age of 19. She was a beautiful, beautiful woman and a very smart woman and she met my father and that was it. They were married for a long time and they had a great marriage and really a great marriage. But in honor of my mother, Mary McLeod, and in honor of my children, Don was very instrumental in buying it. We had -- the owners were here, they were friends of mine from Dubai. Great people but you know this wasn't their thing because they didn't know too much about golf and they actually felt why should we move a hole into the ocean when we already have a hole. And I said well it's not better together that's already there. So you know they didn't understand the golfing but it always did well. You know Turnberry, because of its location, because of the fact that you're on the ocean, because it's one of the most spectacular properties in the world, it always did well. But now since we opened, we actually opened a number of weeks ago the course and we haven't had an empty slot. Here you'll be happy because we haven't had one empty slot. It's from morning till night, it's packed. So it's a special location. I don't know it's just a location. Everybody comes here, whether it's in London or wherever they want to be. They all want to come to Turnberry. And with that I just want to thank a few people. I have to thank Ralph, who -- The one thing the other owners did was the -- Where is Ralph? Ralph, the one thing they said is they said, \"You have a man named Ralph?\" He was an assistant manager at that time and one of the owners was sort of a friend of mine said he's the most talented hotel person, . And they said, \"You should have him be the manager.\" and we did, we appointed him as the manager. It's been nothing but great stuff and the hotel opened about two weeks ago and it's been -- it's been amazing. Eric did such a good job. We've had very few complaints almost no complaints about the rooms. Usually when a hotel opens you have drains that aren't connected and pipes that aren't connected and water that's spewing through the rooms and all sorts of things. We haven't had anything. It's really -- They did done a great job the contractors have done a fantastic job and the hotel is built to the absolute highest standards of luxury. And the force is built to the absolute highest standards of tournament golf and I think there'll be nothing like it in one of the reviews in, I think, Golf Digest in the United States. They compared the 14 golf courses, and the 14 golf courses and it's where they played the open championship. And this writer said, \"Turnberry is No. 1 but because Trump owns it I make it at No. 3.\" And I said to myself, \"That's hatred. That's hatred.\" But I'm used to that with the press. That's something I considered it a compliment. I immediately said that review to the royal in Egypt. I sent it to Mark. So I just want to thank everybody. I want to ask perhaps Eric and Ivanka and Don to come forward and say a few words, and again Ivanka came and Eric said, \"Well, this must be important because Ivanka came, right?\" Because she -- she's something else. Well, my children have done a great job and I mean one of the very important reasons I'm here, not only because we own it and we're going to cherish it. We're going to take care of it. One of the great, great places, great resorts of the world, but also because I want to really support my children. They work very hard to make this property what it is and what it's now become. The reviews of the course have been phenomenal not just like good. Even people that truly hate me are saying it's the best they've ever seen, which is always -- To me, Peter, that's always my greatest. When they hate you and they give it a 10, that means you've got to -- you did a good job, right? But the reviews have been phenomenal and the view -- reviews of the hotel have been great. The hotel is -- I didn't even put a mortgage on, we have no debt, no financing, no anything, and I wanted to do that with Turnberry when I haven't any financing in Turnberry because it's so special. So I just did this out of cash flow and we just have absolutely zero-debt property, and I think it's something that's going to be a great tribute to Scotland and many other places and also a great tribute to the world of golf for many, many decades to come. So is Eric in particular because you built it. Can I ask Eric and Ivanka and Don to come forward. Thank you all very much. Thank you for being here."}