{"id":378,"author":"Donald Trump","title":"Speech: Donald Trump in Las Vegas, NV","date":"2016-06-18","link":"https://factba.se/transcript/donald-trump-speech-las-vegas-nv-june-18-2016","paragraphs":["Thank you very much. I love you people. I love Las Vegas. I love this state. And if you ever need a room, I have a very nice building right down the street. You know, hey. And I have to thank Mr. and Mrs. Phil Ruffin. The room is great. We've got people in every room he's got over here. His restaurants now are full.","This what took so long. And the worst thing we can do folks, because we're all together, right. This is a movement. The worst thing we can do is start a rally because if there's one empty seat the press will say, \"Oh, the room didn't fill up.Trump isn't --\" Outside, you have thousands of people trying to get in. And I hate to say it because I liked him and they worked very hard.","TSA lets him in and it's not working out so good. I'm not happy about it but I have to put up with it. But they have, you know, the machines and they didn't bring enough machines. And I don't know if the great Wayne Newton has that problem when he performs. But I love Wayne, I'll talk about Wayne in a sec.","But we have to be very careful of that. Because let's say I came out 10 or 15 minutes ago, even though there were thousands of people outside. All of the conference rooms have people that have closed circuit television. The whole hotel is packed. Phil you've never had anything like this and he owns it. So if I had like three empty seats they'd say, \"Oh, this is terrible.\" And they're still piling into this room.","But I think it's time we begin. Do we agree? Do we agree? OK. So we have amazing people here. Amazing friends are here. And it's been going really well. You know, I read about this an insurgent group, you know the same group that I beat, is insurgent. And there are a couple of guys they're trying to go to claim -- they're trying to get delegates.","I thought they already tried that. I mean, I could give you names but I won't because it's meaningless. First of all, it's illegal. Second of all, you can't do it. Third of all, we, not me, We got 14 almost 14 million votes. Fourteen million votes in the primary system. So that's more votes than ever received in the primaries in the history of the Republican Party.","OK. Thank you. We beat a lot of people. Sixteen people, there were total of 17 including myself, one after another, boom. boom, boom. It was a beautiful thing to behold. OK. A beautiful thing. It was a beautiful thing. Yeah. That's great. Just keep filling them in. That's right. Is it better that we're starting now?","We have to. They're not happy outside but what the heck are we going to do? So it was a beautiful thing to behold. But think of this, so we got almost 14 million votes. We won 36, 37 states which is -- others won none. People that won none are saying, \"Maybe we couldn't get something at the convention.\" Doesn't work that way folks.","You would have because we have, you know, one of the things the polls say, we have by far the most loyal followers. Right? By far. You know, other of the candidates -- Well, I mean, take a look at this today. They've never had anything like this. Where every room is full, every conference room, every restaurant is loaded with people.","I hope you put closed circuit in Phil, they're going to be so angry but I think you did. This guy doesn't hold back, believe me. But so when we get 37 states. When we get 37 states . We love our police. We love our police. Thank you, thank you officers. Thank you. Thank you. That's very nice, thank you.","By the way, how great are our police? OK. They don't get enough credit. They don't get enough credit.They don't. They take abuse. They don't get the credit they deserve. Believe me. So we won 37 states. We won 14 million. We beat Ronald Reagan, who we love. We beat Richard Nixon. We beat Dwight D. Eisenhower.","We beat everybody. We beat Bush. We beat the bushes, we beat the bushes. And by a lot. I don't mean we like edged it. I don't mean like, you know, I mean, by a lot. And now you have a couple of guys that were badly defeated. And they're trying to organize, maybe like a little bit of a delegate revolt, maybe.","Now, number one, you know Ryan's previous, you know what that is right? R.N.C.? Now he's a good guy and the Republican National Committee, they put out a state and you can't do it. It's not legal. You can't do it. You're not allowed to do it. How would you like to have a party where we started off with 17 or 18 people actually.","Including somebody that I won't mention because I'm not looking to embarrass anybody but it was actually 18 if you want to include somebody. OK. But how would you like to have a party Wayne. And he's married to a great lawyer so she'll understands this better than Wayne does. But Wayne has a much better voice right?","But how would you like to have a party, where myself and others, traveled the country and worked for a long time. Now was shorter than I thought because remember I was supposed to maybe be able to pull it out at the convention and we pulled it out two months before the convention. Do you remember?","Do you remember when they said, \"Twelve thirty seven.\" that's a delegates, \"Twelve hundred and thirty. He cannot reach that number. He can not reach that number.\" And I kept saying, \"What's the big deal?\" And one of the people, who probably hasn't quite given up yet, one of the people was trying to buy up all of the second ballot people.","Right? And I kept saying, \"Let him have them.\" because it's expensive to get them. And by the way, I spent less money than any other candidate and I ended up in first place. And they ended up, boom. So now I hear, after beating them fair and square, I mean I beat him fair and square. Actually a couple of the commentators, that are negative people actually, because most of them, but a couple of the commentators that are negative people said, \"Whether you like him or you don't. He beat them fair and square.\" And -- and then they said he didn't beat them by a little bit he beat them by a lot.","We beat them by a lot. All right. So how would you like to have a party where somebody goes out and beats them by a lot. And wins not only the vote, largest in the history of the party. Not only wins 37 states, and nobody else was even, you know, like remotely close. I mean, some of these guys have none.","How do you like to have that? A guy sets an all time record gets almost 14 million votes over a period of like nine months. He gets 37 states. He gets tremendous support. He has sold out arenas no matter where he goes. Like yesterday and in -- in Houston, people said they have never seen crowds like that.","One of the reporters, a very good reporter actually, from NBC, Haley, she just said, \"But are your crowds as big as they used to be?\" I said, \"They're bigger.\" They're bigger, they're actually bigger. No, they're bigger. You had to see Houston, Texas last night. We were in a bigger ring held about 5,000 people.","That's not a big one for us but that was the biggest one we could get on short notice. And on short notice, we had a line that went five abreast forever. And it's the biggest subject in all of Texas. They had helicopters over, they couldn't believe what they were seeing. They've never seen anything like it. And our crowds are bigger.","Our enthusiasm is more. A poll came out. O.A.N., a very good poll, very -- He's actually, they've -- it's a very good group of people. A poll, O.A.N. came out, where statistically even with crooked Hillary and she is crooked folks. Believe me, she is crooked. Hillary Clinton doesn't have -- I'll tell you what.","Hillary Clinton, and you can say it any way you want, but she doesn't have the integrity. She does have the integrity to be president. And perhaps equally important, she's got very, very bad judgment. You just look at what she's done. You just look. OK. So how would you like to be in a party where Trump wins.","Where Trump keeps winning. Where Trump has the biggest crowds. Where Trump gets, by the way, the highest ratings in the history of television. They had a story in Variety, I don't like to brag but we have to brag every once in a while. They had a story in Variety where a big headline, a big massive headline, and the story was that Trump makes massive profits for cable networks and networks, but massive.","And then it went on to say that they're setting records and viewership, they're setting records and advertising. They're making a fortune. What are we getting at them? We get nothing but maybe, but maybe, we're going to get the presidency and we're going to straighten out our country. OK. We're going to straighten out our country.","And we'll have Wayne at that inaugural ball. Wayne will be with me, Wayne. Bah, bah, bah. So -- so there's a little movement and -- and I just heard today where it's coming from it's coming from people that have been badly defeated. But wouldn't that be funny. OK. A guy got much less votes he got no states.","Ladies and gentlemen our nominee is. I don't think so. I mean forget about the legality because it's not legal. Forget about the fact that the Republican National Committee put out a statement last night saying it's all made up by the press folks, believe me, by these people right here.","It's all made up by the press. OK. It's all made up. It's -- it's it's a hoax, I'm telling you. These are the most dishonest people, not all of them, not all of them, but these are -- This is a story -- I watched CNN yesterday knowing it can't happen. \"Breaking news. There will be this and that at the convention.\" Who are they going to pick.","I -- I've beat everybody. But I don't mean beat, I beat the hell out of them. Right? Beat the hell out them. And we're going to beat Hillary. And it would be helpful if the Republicans could help us a little bit, you know. OK. Just a little bit. I mean, I have people that are so -- that I've done so much for that.","Frankly, we've done a great job for all of us. You know, the Republican Party has increased the voter turnout for the -- forget about me. I set the all time record, guess what, the Republican Party in the primaries has -- is up 70% right? I think it's even more 70 -- 70% from four years ago. 70% more people have voted in the primaries.","Is it because of me? Stand up, say it. A woman. I'm doing well with woman. Go ahead. Thank you. Believe me, I respect women more than Hillary respects women. I can tell you that. Thank you. They're screaming it's because of you Mr. Trump. It's because of you. And you know what? I never break. They happen to be 100% right.","All right. We -- you take a look at these states. A couple of the states were up 102% from last year. OK? From four years ago. 102% it's unheard of. In the whole world, people talk about it. I mean, some people would have said the Republican Party has stayed. It's not bad state. It's try -- you know, it's got a little boring maybe and maybe the ideas weren't right because I don't believe in the -- let it be boring if the ideas are right.","But the ideas weren't right. There wasn't strength on the border, our budgets are way out of whack. Look at this last budget that we approved, the omnibus budget. You know, Obama is a horrible negotiator. Iran -- Iran beats him, every country beats him. He draws the line in the sand, they beat him. Everybody beats him but he's a great negotiator when he has to negotiate against the Republicans.","And we got to stop. We got to stop. We got to stop. They have to focus on budgets not focus on me. And they view me as an outsider. I have to tell you a little secret, I shouldn't said it. You'll -- half of you will leave the room. Should I say it? I used to be the ultimate establishment person. I was a massive giver.","I gave a lot of money, to everybody. I even gave to Democrats. I mean, I'm in business. Right? I gave to Democrats, I gave to Repub -- but I gave a lot of money. The RGA, Republican Governors Association, hundreds of thousands of dollars. And I was like establishment. And then one day I said, \"You know, I'm going to run.\" And I announced.","And they said, \"What happened? That's no good.\" Because I'm not one of them. Because I'm going to do the right thing. I don't need this, folks. I don't need this. I don't need this. Phil Ruffin told me this morning, came over, we met. And he's done such an amazing job with this hotel and his wife is actually much more amazing than him.","Alexandra stand up please. Stand up. She's more amazing than Phil. Mr. and Mrs. Phil Ruffin. And he told me this morning he said -- and he's talking to a group of people and we're raising money for the Republican Party. And frankly, I like doing it. I went around -- yesterday I think, between yesterday and today, we raised 12 or $13 million for the Republican Party.","It's good. For the Republican party. And somebody said, \"Well, you're not raising money fast.\" I said, \"I don't know.\" You know, I get people. I'm raising money for the Republican Party and I'm not getting that kind of support. What they don't tell you though, is I actually have a lot of support. But they don't talk to the people that support.","Wayne Issa, who is a great guy, Congressman. So many of the Republicans are so supportive they don't want to talk about them. If somebody says something just a little bit off. Headline, blaring news, breaking news -- you know, they use the breaking news. Every time there's an event there's breaking news.","Then, when you have a real breaking news event, nobody takes it seriously. You have it on. Breaking news, Donald Trump got up today and tweeted, \"Good morning.\" Crazy. It's crazy. But they don't talk about that. But I will say -- Phil said to me this morning, and he said to a group, he said, \"You know, Donald Trump didn't need to do this.","He's made a fortune, he's done a great job, has a great family. An unbelievable.\" Phil, do I have an unbelievable business? Stand up, please. This guy's know better than I. Stand up. Stand up. Did I do a good job? Built an unbelievable business. And I built an unbelievable business, a great, great business.","Some of the greatest assets in the world. No matter where. Who's that guy? Is he a friend or foe? OK. Get him out of here please. Get him out. Get him out. Get him out. You could let -- could you let somebody else take his place, please? Thank you very much.","These are like love fest. You know, a friend of mine came over to me and he said -- very rich guy. Very success -- very successful guy. Not a great guy but who cares about that? We need these people to help us negotiate with China and with other countries. But he's a guy that, he's very successful and he was at an arena where I had 21,000 people.","And I was speaking and he said -- and he's got a lot of guts. Financial guts I call. You know, a different kind of guts. Like I have financial guts. When I see what our great military people do, I don't know that I'd have those kind of guts. Right? Right? These people are fantastic and we've got to take care of our military.","Take care of our vets. We have to replenish our military and we have to knock the hell out of ISIS. But then knock the hell out of ISIS. But -- but he came up to me, and he was with me at this arena, and he saw -- it was in Dallas. And 21,000 people, the Mavericks arena packed including the whole floor. And he said, \"Can I ask you a question?","How long have you prepared for this speech? How the hell did you get out there in front of that many people?\" I said, \"That's nothing. Because all the networks are covering it live just like they are right now.\" Said, \"How do you do it?\" Thank you darling. You're right. She gets it. You're right. And I said, honestly -- and he said, \"How do you do this?\" He says -- she -- she understands.","But he said, \"How do you do this? How do you speak in front of that many people?\" He said, \"He could never do it.\" I said, \"It's not hard. Because I'm telling you, there is such love in this room. There is such love in this room.\" I really mean it. I really, really mean it. There is such love in these arenas.","We had in Mobile Alabama, we had 35,000 people. We started in a hotel ballroom after about an hour the hotel call said, \"We can't handle it.\" We then moved to the convention center that holds 10,000 people. They told us after two hours they can't handle it. We moved to a football stadium in Mobile. We had the most unbelievable time, we're 35,000 people.","In Oklahoma, we have these massive crowd. We have massive crowds everywhere. And it's so easy to do what I'm doing because it's love. It really is love. I'm doing it for love, I'm doing it for this country. I want to -- we are so off track. We are so off track. So -- and I'll tell you something, the safest place -- thank you darling.","The safest place to be, in this country, is at a Trump rally. Remember that. Remember that. It's the safest place, to be. Oh good, all the seats have now filled out and there's still -- they just said there's 3,000 people outside. All the seats are now filled out. I'm telling you. I'm telling you. The press, if I had -- I'm telling you, we had to do that.","That's why I waited. Are you? Is it OK that I waited? Yes. OK. Now they're all filled out. Filled out all over this building. I don't know. This guy Ruffin must be making a fortune this morning. I don't know. So the safest place to be, seriously -- and our whole team is make America great again. But I've. -- I've revised it. It's make America great again.","It's make America safe, again. Safe, again. It's make America safe again. And it's also, we want to do it for everybody. Not just us. We want to do it for everybody. We want to help African-Americans where -- Who are -- You look at African-American. Thank you, thank you, thank you. Thank you.","Thank you. African-American youth has a 59% rate of unemployment. OK folks, 59. And we're letting people pour into our country. We have no idea who the hell they are, where they come from, there's no documentation, there's no paper. They come from hostile countries. They came -- they come from countries that are tremendous in terms of terrorism.","And we're going to have big problems if you think Orlando was the end of it. With this weak attitude and this pathetic president that we have. It wasn't folks. It wasn't, it wasn't. This is just the beginning. Unless we get smart and tough and vigilant. And unless we say, \"I'm sorry.\" You're coming from a region in the world whether it's -- And I can name them all.","Boys, I can name them all. But it's radical, Islamic, terrorism. It's a whole new thing. It's radical Islamic terrorism. And it's not guns. You know, I saw the president talk immediately about guns. It's not guns. It's terrorism. It's terrorism, it's not guns, it's terrorism. And I watched him the other day and he was -- And --and by the way, this wasn't just me saying it. He was more angry at Donald Trump than he was at the shooter, the maniac, who killed all of those young people.","He was more angry at Donald Trump and I wasn't the only one to say it. Plenty of people saw it that he wasn't the shooter. So we got to change our mindset here folks. We have to be really tough, really smart, really strong. You know, in the past we'd have a war and we'd be fighting Japan and they had uniforms.","We knew who we were fighting. And we'd be fighting Germany and we'd be fighting others. And we knew who our opponent was. We knew who the enemy was. Today, you don't know who the hell it is. And you are going to have -- you are going to have Problems the likes of which you've never seen unless Donald Trump becomes your president.","Believe me. Believe me. Thank you. Thank you. Now we're going to bring jobs into our country and that's going to solve a lot of problems. It's amazing how jobs can solve a lot of problems. Problems that we think we have, all of a somebo -- somebody gets a good job. And you don't have the problems.","But we're having our jobs ripped off and being sent to other countries. Ripped off by currency manipulation where they're lowering the value of their currency and then making it impossible for our companies to compete. We're being ripped off at every level. And we have leaders that are so stupid they have no idea what's happening.","I mean, look at the newspapers today, Apple. Good old Apple. I was waiting for this to happen. They've been having this stuff made in China and now China has turned against them. Now here's the bad news, by my saying that China is very smart, they're going to say, \"Oh boy, Trump's picked up this one will let Apple.\" I am doing such a service to Apple by even mentioning it because our word is being broadcast all over the world.","And Tim Cook should send us a lot of money for what I'm doing. But China is now ripping off Apple saying, \"You don't have the right to sell a certain product in China because somebody else has the right.\" And they are ripping them off big league. And right now, Apple, doesn't know what to do. But it always happens, but you watch.","Because of this, this will be a headline. Now China, they're smart. I deal with them. They're very smart. You can do great with them. I made a lot of money with China. The biggest bank in the world is my tenant. I sell condos like crazy to people from China. The Bank of America building in San Francisco, indirectly through China.","I mean, so much, so much stuff. I did great with China and I have great respect for China. I'm not knocking China and I'm not knocking Mexico and I'm not knocking Japan. I'm not knocking anybody. I think it's great what they do for themselves. But I am knocking our leadership is being grossly incompetent.","They don't know what the hell they're doing. They don't know what they're doing. And every time, and an -- an offer this China is just one of many. But China is the biggest and it's the biggest abuser. China's an abuser. They abuse our country. Every time they start doing badly, do you notice? They knock out their -- their currency a little bit lower.","A little bit low. They're not supposed to be doing that. That's sort of like cheating. You know, it's a way of cheating. Now, we do it very little because we don't know how to play. They like, grand masters. They like grand masters and we like checker players that don't know how to play. That's no. That's the difference.","But it won't be that way. Carl Icahn, guys like Ruffin, guys like so many of my people that have backed me, so many of the people that Phil knows. These are the best business people in the world. These are the best negotiators in the world. These are the best negotiators in the world. And you know what? You know what?","It's very interesting. We're going to put it up. I'm the best. Oh, I'm good. Good. But we have the best. We have the greatest business people, we have the greatest negotiators in the world, you know. We have the greatest. Andy Beal who's a big supporter. Andy Beal, Beal Bank in Texas. We have such unbelievable people that are supporting me. And they support me not cause they like me. Although, I guess that's a part of it. But they're supporting me cause they hear me. You ever see a corporate inversion?","We have companies that are leaving this country. Taxes are too high. And they have trillions of dollars outside of our country. They can't get it back. We can't get it back because we have no leader. You know, we have trillions of dollars right now outside of our country. I think it's 5 trillion. They say it's two and a half trillion and I think it's much more.","We can't bring it back. The Democrats want to bring it back. The Republicans want to bring it back. Every -- but who the hell doesn't want to bring it back? It's money that we aren't allowing to come back in because of bureaucracy -- it's actually not just taxes. The taxes are crazy. Only a maniac would bring it back and pay those.","It's crazy, too high. High -- we pay the highest taxes in the world. By the way, I have the biggest tax decrease of any candidate that's run for office and that's close to 20 people. And Hillary Clinton has the biggest tax increase and she doesn't even want to talk about it. In my opinion, her taxes have to be close to 60% to pay for what she's talking about.","And she got forced into a corner by crazy Bernie. One thing about Bernie, he doesn't give up. This guy doesn't give up. Right? Crazy Bernie. He -- he doesn't give up. You know. Crazy Bernie, he's crazy as a bedbug. But you know, he doesn't quit. He doesn't quit. Got to hand it to him. And I think Bernie should continue to go forward, folks.","He should continue to go forward. He should fight to the last end. Well, he's waiting for really, the FBI to do what everybody thinks they're going to do. I mean, I think that's. All right. I think, he's sort of saying, \"Look, huh. Let's hang in there.\" Because ultimately it's called, the FBI convention.","And then we'll be the only people and we will have done something like Trump did. I want to be like Trump. I want to be like Trump. But I think he's waiting for the FBI convention. We'll see. We'll see. We'll see if the right thing happens. Everybody knows what the right thing is. I've watched and read and seen and talked to great legal scholars.","Not one has said that she should be allowed to run for office. Every person, that we know of, that's done far less than what she's done, their lives have been destroyed. And the press doesn't cover it because the press is so one sided. CNN, as an example. It's called the Clinton News Network. Clinton News Network.","No. It's a joke. It's a joke. The Clinton News Network. So we'll see what happens. But Bernie is in there and Bernie is fighting. And I don't think you should give up. Does anybody think so? I don't think so. If he gives up, we'll say, \"Bernie you're a loser. You gave up.\" We get it. Now, but we'll see. I mean, he's got to have something in mind.","Did I personally think that's maybe what he has in mind. So we're going to do things for our country, that are going to be amazing. And they've resonated -- look, one year from Thursday, I ran. And everybody said, \"June 16th.\" One year. So it's one year and two days now. One year. One year. And a lot of people said, \"I watched Karl Rove.\" He said, \"Oh, he's not going to run.\" Oh, good.","I watched Krauthammer, no, he won't run. Krauthammer said, \"He won't run.\" He -- he won't run because this is the single greatest group of talent perhaps in the history of the Republican Party. Fact, a month before I said to my wife, \"Wow, I just.\" -- Don't forget, Krauthammer wanted us to go into Iraq and bomb the hell.","We've done a great job by doing that and I was against doing that, folks. So I was against it. These guys all wanted to bomb the hell out of Iraq. We've done a great job in doing that. We've totally destabilized the Middle East. What a mess we have? OK. What a total mess we have? And by the way, who takes over Iraq?","Iran. Not only do they make the Iran deal. I used to say, \"That's the greatest deal I've seen.\" They've got $150 billion back. They have the right to go wild with nuclear weapons eventually. They don't need to make them, they can buy them. But you know what? They make great. Now, I used to say that's one of the greatest deals I've ever seen.","I don't say that anymore. Greatest deal, is that for years and years and years, decades and decades they fought each other. And one won ten feet this way, ten feet that way, ten feet three or four years. Then they rest it. Then they go again, again, again. Saddam Hussein drops a little gas. Iran complains, you're not supposed to do that.","The world goes crazy. And then they rest. Then again. OK. This has gone on forever. Then we come in and obliterate one of the two. Obliterated. And now, what have we done? We have given Iran, Iraq. OK? As sure as you're sitting there -- I've been said this for a long time. But Iran is essentially controlling Iraq.","Iran is now, very shortly, could have just walk it. They don't have to fire or shot. And the people running Iraq, are so in the pocket of Iran. And why wouldn't they be? Because they figure we're gone. You know, we're gone. So Iran is going to take over Iraq. A lot of people don't know that Iraq has some of the largest oil reserves in the entire world.","A lot of people don't know that. So look what's happening, look what's happening to Iran. Look what we've done by sheer stupidity. So a lot of these papers they said, \"Bomb, bomb, bomb\" And I said -- although I -- what did I know? I was in business. Right? I didn't know. A lot of people weren't asking me. But I said, \"If you do that you're going to destabilize the Middle East.\" And hence you have the migration.","And hence you have people going all over the world. Look at the problems in Germany, look at the crime. I have friends in Germany that for years they'd say, \"The greatest country. The greatest country.\" They love Germany. Now, they're saying, \"We're leaving.\" They were leaving Germany. Look what they've done to different -- look at Brussels.","How beautiful a place was Brussels? And look at what's going on. Look at Paris. Look what's happening in Paris. And it's far worse than you people understand. It's far worse that people understand. In fact, today there was actually a story, that Paris is so, so, so out of control, so dangerous. Look at what's going on. And we have Hillary Clinton wanting to take in over 500% more than Obama.","Now think of it. Than Obama. Of people that will cause us problems like you will not believe. Not all of them. But look what one man did, one whack job. He's a wacko. Look, what one whack job did. One radical Islamic terrorist. And he pledged himself to ISIS. Here's a guy. He's shooting people and pledging himself to ISIS as he shooting.","OK? He's calling people and talking about ISIS. ISIS. Look what one man has done to this country. Look at what one man has done to the state to the great, great, great state of Florida that I love and Orlando amazing place. This is one man. We're letting in millions of people. It doesn't take large amounts.","This could be the great Trojan horse. We all know the story of the Trojan horse. But this could be the great story of the Trojan horse. All because we have leadership and weak people like Hillary. She's weak. She's weak. She -- Bernie Sanders said about Hillary Clinton that she can't be president because she has bad judgment.","OK? He said it. I didn't said. I would never say anything like that. And then, I hear her. I hear her saying -- you know reading right off always teleprompters. She goes, \"Donald Trump does not have the temperament to be president.\" And then the -- you know, the -- the people back. \"Oh, she gave a great speech.\" Oh, give me a break.","Gave a great speech. You think, she's the president? Take a look at her. You think she's the president? I don't think so. I don't think. Donald Trump does have the temper. And I'll tell you something, I started thinking about it. And I was going to say, \"I absolutely have a great temperament and I've done great things.\" Hey look, I went into television, had the apprentice, great hit.","One of the most successful reality show. OK? I did books, many bestsellers, many. The Art of the Deal is one of the biggest selling, certainly the biggest selling business book of all time, by far. So I did books. Tremendous success. Real estate, I've some of the greatest assets in the world. You look at my numbers very low debt, tremendous everything.","OK? I filed over a hundred and somewhat pages. But listen to this. OK. So listen. So we have -- we have a great study in contrasts. So I started thinking about temperament and I was going to say, \"I do have a good temperament. I do.\" And then I said to myself wait a minute. She's probably right about one thing.","I have a very tough temperament. She said, you know, but very controlled. But we need tough temperament today. We can't have this weakness. We can't have weakness. My temperament's tough. My temperament is very solid. I don't lose control. I -- I have been doing this for a long time, folks. You've been watching me for a long time.","You know in New York, I won in a massive landslide. Who knows me better than the people of New York? Nobody knows me better. Nobody. I won in a massive landslide and we had three people. Now in New York knows me better. I've been there for a long time. If I didn't have a good temperament, I couldn't have won New York.","They know me. Oh, do I get publicity? Do I get? They write about me every day, every hour. It's always been this way. I don't know why. I don't know why. They had their debate. So Fox and the debate had 24 million people it's actually even more than that. But 24 million people. The largest audience in the history of cable television.","Now, I don't think it was for Jeb. But maybe I'm wrong. OK? By the way, Jeb is working on the movement just so you understand. I love competition like that. I love it. So -- so look. Look. Low energy. I didn't say it. You did. OK. Now, Jeb is one of the people that's working.","And the other one should be obvious to you but we'll figure that out very easily. OK. Ready? So -- so when you look, and when you see, and when you see what we have to do, we have to get out there. We have 24 million people, they watch. We have 23. The next two weeks CNN puts on, a debate. Twenty three million people.","The largest audience in the history of cable television for CNN. Here CNN covers wars, covers everything. Right? She have the largest audience in the history of cable television and then a few weeks later, Oh yeah. They do say the debate with Hillary will be. It's going to blow everything away. Oh, I look forward to that debate.","Oh, do I look forward to that debate. I look so forward to that debate. But -- but think of this, so CNN, a few weeks later has another debate. And they get the largest audience they've ever had in the history of CNN. You know, it's pretty impressive. Right? And variety in the magazine say, \"The Trump debate drew record ratings.\" OK. Just like they said the profits.","But here's the thing about the debate. So the debates go on and a lot of people say what was the biggest surprise. Well, I didn't know myself as a debater because I never debated and I create jobs, I do deals, I do business, I do this stuff. Right? I don't debate. I guess my life is a debate but I don't debate professionally.","And I hear all these politicians they're debaters. We debate. Hillary Clinton supposedly is a debater. Give me a break. Will she be allowed to bring the teleprompter onto the debate stage? So. So -- so what happens is we start the debates and I never did it before.","And I'll say -- but think of that. I was in 11 debates and of the 11 debates, they go was 11, of the 11 debates, I was on center stage for every single debate. Meaning your No. 1. And of. And of the 11 debates of the 11 debates. Drudge, fantastic guy, Time magazine, Slate they do polls. I -- I think, I really helped the polling business.","Right? They talk about polls. I like polls. But only if I'm winning. I don't like them otherwise. And we're starting to catch up very rapidly so pretty soon. The polling companies are going to have their day in the sun. Pretty soon, I think. But here's the story. So of the a -- Of all of these debates, I think, there's seven of them they cover.","They have online polls. Hundreds of thousands of people vote. And on every single debate by every single poll I won every debate. Which is pretty good. Which is pretty good. You know. I don't know. I think it's pretty good. But we are going to do things that are going to be great. And a lot of people don't want me in because they don't want to see strong borders.","OK? They don't want to see strong. I want to see strong borders. They don't want to see me a job creating. They don't want to see what I'm going to do to help a -- the minorities. Because we have problems in this country. We -- I will do more for African-Americans than Barack Obama has ever, ever, ever done.","And believe me. He's done nothing. He's done nothing. He's done nothing but talk. He's done nothing but talk. And the Hispanics. So I employ thousands of Hispanics. Thank you. Where's Miriam? Where is Miriam? Where is she? Thank you. No, I employ thousands of Hispanics. Where's Miriam? She's shy. She doesn't want it -- she has been so amazing.","Where is? Thank you. Thank you. She goes around and says, \"Donald Trump is going to do more for Mexicans and Hispanics.\" And -- and I appreciate it. Thank you. Thank you. Thank you very much. I appreciate it. Thank you darling. So nice. Now, she's been amazing and she a -- she knows because I'm going to bring our jobs back, folks.","We -- we going to jobs back. Look at Carrier. They fired everybody. They're moving to Mexico. So many companies moving to Mexico. I mean, I have a list and it's a mile long. They're moving to Mexico firing everybody. Then they make the product not only in Mexico. They make the product. They sell it into the United States no tax no nothing.","And you know what happens? We're going to lose a lot more companies, folks. We'll going to lose a lot more companies. If I'm president, we're not going to lose anything. We're not going to lose any companies. We're not going to lose. And I say that strongly. Because you know what? These guys don't know. I've been watching this discussion because for seven or eight years we have been just it's been an onslaught.","And longer than that. In all fairness to Obama long before Obama. It was called NAFTA. It was signed by Bill Clinton. And it didn't affect Bill Clinton but it affected everybody that followed Bill Clinton. And believe me, folks. It has been a disaster for this country. When I won New York State and Pennsylvania, when I won Maryland and Connecticut and Rhode Island and when I won all of these states and then won Indiana.","Thank you Bobby Knight. Boy, did Bobby Knight help. Boy, did Bobby Knight. That was a Coach Knight, 900 wins. But when I won all of these states, I really got to know. Even New York said I knew it well. I knew there were tremendous problems upstate New York but I had no idea. When I toured those upstate areas of Albany and Rome, the real Rome, Rome New York.","OK? That's what I call that, the real Rome. But -- but Syracuse and you see building after building after building empty, falling down. It just a horrible sight, all over. You could buy them, folks. You could buy them for a dollar. And you know what? I'll give you a maybe some real estate advice. Go out and buy them.","And if I win, you're gonna make a hell of a lot of money. OK? Fact, Phil Ruffin will get up and leave before the speech is over. He's headed to upstate New York right now. No but it's true. It's true. Building after -- by the thousands, by the thousands. And I have statisticians at work for me. And before I used to speak when we were in the primary.","I'd say, \"Give me the information on upstate New York. Give me the information on Long Island. Give me the information on -- on all of these different places. Pennsylvania in particular.\" Look at West Virginia. What they've done to our coal miners? They've destroyed. Hillary Clinton said, \"I'll put the coal miners and the mines out of business.\" That was not a smart statement.","And then she had to go there for always like. And look at the numbers I've gotten in West Virginia and Pennsylvania. But I look because we're going to bring the coal industry back and we're going to bring every industry. We're going to bring our energy industry back. We're going to bring it back. We're going to bring it back.","You know, because of technology, folks. Because of technology we have learned things frankly. And we realize that we have wealth that we never knew we had. Over the last six or seven years there are many forms of technology that have given us an awareness that's unbelievable. What's happened is unbelievable.","So we're going to bring all these things back and we're going to start paying off our debt. And we're not going to let our companies see. Now, here's what we're going to do. So Carrier says they're leaving. I would call them and say very nicely, and you know, my wife gives me a very hard time. She said, \"Darling, your president.","You cannot call an air conditioning company.\" I said, \"That's OK. It's so much fun. It's like a two minute call.\" If I can say 1,400 jobs in two minutes let me do it. But I'd call. Meaning I'd call. Somebody calls, somebody calls. I got a call. Maybe I should do it. Right? And I say very simply, \"You just fired 1,400 people.","You're moving to Mexico. Enjoy it, enjoy it.\" I respect Mexico so much for taking all of our -- our businesses, so much of our business. But let me just tell you, here's the story, every air conditioning unit that you make, that you sell across are now very, very strong border. You will be paying a 35% tax of that unit if you leave.","If you leave. Now, our country has been working on this problem for years and they did all sorts of deals like zero interest loans and we'll give you money what. The -- that they don't need money. They don't want money. How about the deals where they gave him really cheap money and they left anyway? You know, I mean, it's like rape.","Try collecting. They don't need money, 100% they don't need. If I talk to them, for two minutes. Phil would you say two minutes or do I need three? I think in two. He says, \"One.\" Hey, it's Phil's. Phil said one minute. But in a quick conversation they will not going to move. And they're not going to be calling lobbyists because you know I spent 55 million on my own campaign of my money.","OK? Of my money. And by the way, if the Republican Party -- and I hope they all come together because I want them to come together. It's great. But if for any reason they get a little bit like they don't want to help out as much then I'll fund my own campaign. I'd love to do that. I'd love to do that. You know, right now I'm raising a lot of money for the Republican Party and a lot of beneficiaries to that.","And I like doing it. But we have to have help. We have to have help. They have to be at Scott -- you know, life is like a two way street. Right? It's a two way street. So they have to -- otherwise, I'll just keep that one what I'm doing. I'll just keep funding my own campaign. I'm OK with that. That's the easy way.","I mean, for me that's the easy way. But hopefully, I can continue to go the way we're going. This weekend we raised a lot of money. We've raised a lot of money for the Republican Party we'll keep doing it. Because we do have tremendous support within the party that I can tell you. We have tremendous support.","OK. So what's going to happen with Carrier. What's going to happen with any of. Is they going to say, \"Ah, we want to talk about this.\" Then they going to go hire a lobbyist. The lobbyists are going to call. I say, \"I'm not giving you guys anything.\" Now, if they call Hillary, 100%. They have a lobby. They have a lobbyist in Washington.","He's got Hillary Clinton step in his forehead. OK? It's 100%. With me? It doesn't work that way. OK? With me, it doesn't work that way. Within 24 hours, they will call, let's say, \"Sir, we've decided to stay in the United States. We'll stay in Indiana.\" Or they'll go someplace else but they're staying in the United States.","Now multiply that times thousands, times thousands and thousands of companies. That's what you're talking about. You're not talking about 100 companies or 10. You're talking about thousands of companies have left. Thousands of companies are being killed by monetary manipulation. OK? Thousands. We're not going to let this happen.","Remember this, China -- we have rebuilt China. They have taken so much. You know we owe China now $1.7 trillion. Think of it. They beat us at every front. They kicked the hell out of us and we owe them money. How about Japan? We owe Japan $1.6 trillion. Now, think of that one. They sell the cars, the big boats come in, the biggest ships you've ever seen.","I mean, if Wayne Newton could ever get his big audiences onto one of those ships, you would be very proud. I'm telling you Wayne. Wayne would you stand up again. Come out. Rick. I mean, we love this guy. We love Wayne. We love our. You know, it -- it's sort of like a weird experience because all of my life I've been watching Wayne Newton and now I'm performing for him.","What the hell is going on over here? And the problem is, I like him better than I like myself. So anyway. So. So all of this is going to come back. Now, you have people in both parties that don't like the things I'm saying. OK? You people in both parties. But you know because I have the smartest people.","A lot of people are saying that. That's even showing up. I have the most dedicated people. I have the best people. I have the best people. I have the best people. And they get it. But a lot of people. A lot of people don't like strong borders. They don't want the wall. We going to have the wall, folks. We going to have the wall.","We're gonna have the wall. And the wall is going to stop drug trafficking. It's going to help with the drug. You know, the drugs are pouring into our country and poisoning our youth and others beyond what anybody has any idea. If you look at New Hampshire which I want. I love New Hampshire because it was my first victory.","It's my first victory. I never ran for office. By the way, am I doing a good job? Am I doing a good? Right? I never did this before. But I love New Hampshire and the people of New Hampshire got together with me and they said their biggest problem is heroin. They said heroin. You know, it just doesn't work with the beautiful trees and streams and lakes.","I said, \"Heroin?\" And it turns out to be they have a tremendous. And they have it in Massachusetts and they have it in South Carolina and they have it in all of these places. All of these places. And it's pouring across. And three weeks ago, 16,500 Border Patrol agents endorsed Donald Trump. They've never ever endorsed a presidential candidate.","And I asked him and they told me, they said, \"Mr. Trump, you need the wall.\" And Sheriff Joe Arpaio, great guy, tough. Right? Sheriff Joe from Arizona. In fact, when I finish this I'm going to Arizona. I'll be in Arizona in a little while doing the same thing with big, big beautiful crowds. But Sheriff Joe endorsed Donald Trump.","Folks, we know what we're doing. OK? We know what we're doing. We are going to make this country so strong again. We're going to save your Social Security. We're going to save your Second Amendment which Hillary Clinton wants to abolish. Hillary Clinton wants to abolish your Second Amendment. And I got the endorsement of the National Rifle Association, the NRA.","One of the earliest endorsements they've ever given. And let me tell you, between Wayne and Chris and all of those people. These are great people. These are people and it gets lost. It gets lost in the debate. These are people that love our country. Just remember that. These are people that love our country.","And you know, I've said before, some people thought it was a harsh statement. But if in Paris, where 130 people died -- toughest gun laws in the world, by the way. There were no guns on the other side. These thugs walked in -- probably if they were, if they knew they were, they wouldn't have gone in there in the first place.","OK? They knew there were no guns. But toughest gun laws in the world, 130 people die. San Bernardino, 14 people die. Friends, they were friends. They killed the 14 people and so many so badly injured. By the way, Paris? The hospitals are still loaded with people so horrible. And what we had this weekend?","If there were a couple of folks, man, woman had a gun strapped right here, right here, right here. Or a gun strapped very nicely to the ankle and this no bed is no good sick, sick perverted horrible terrorist. Terrorist was in there starting the shooting. One of those people would have had those bullets going the other way, folks.","It would have been a whole different story. Would have been a whole different story. So we're going to make our nation rich again. We're a poor nation. We lose to everybody. We defend Japan. They don't pay us the right money and they will. They will. You know, the press says the second I said, \"No, no.\" In a deal, you always have to be prepared to walk.","They'll tell you that. You always have to be prepared. Not that you want to walk but you have to be prepared. So here's Hillary Clinton when she heard about what I said about Germany, \"He's not being loyal to our allies. We will always stay with our ally.\" Well now, they're never gonna to negotiate. Why would they negotiate?","Why? But we have all of these nations that we defend. South Korea, try buying a television outside of South Korea. Not easy. I buy thousands and thousands of television sets. Very tough to buy them outside of South Korea except for Sony which not doing so well lately. OK? From Japan. But let me just tell you, South Korea we defend.","Because there's a fortune. They pay something but not what they should be paying. Japan we defend. Billions and billions of dollars. A general gets up, \"Donald Trump is wrong.\" He was sent by Obama. Nice looking guy. General. He said, \"Doesn't he understand that Japan pays us 50% of the cost.\" So he said in Japan pays us 50% of the cost of their defense.","So the press call me up, \"Mr. Trump, they said that Japan pays 50% of the cost. Why do you? How do you respond? I said, \"Why don't they pay 100%?\" Right? Right? Right? Right? I mean, we're defending Japan. So we defend Germany. Germany. Think Germany is a rich nation. I want to tell you, it's a rich. And I about to tell you what?","Going to have problems with what she did but regardless. Rich nation. Now, we have Saudi Arabia. Saudi Arabia when the oil prices were high, was making $1 billion a day. We pay rent on our bases. We pay them rent. We defend Saudi Arabia. Now listen, Saudi Arabia I have a lot of friends from Saudi Arabia all that stuff.","Right? But you know what? This is a country that has nothing but money. They have nothing but money. Not strong defense. That if we weren't there, they would have been gone 25 years ago. OK? Twenty five years ago. You remember the incident with Iraq? When Iraq went into Kuwait and then they started looking at Saudi Arabia.","And the Saudis didn't do so well and then we had those Marines of ours with the stuff under their eyes and boy that was the end of that. Remember that? People forget. People forget these little stories, folks. So we defend Saudi Arabia. They don't pay us nearly what they should be paying. So essentially, we subsidize all of these countries.","South Korea with this guy, call him a maniac. Call him whatever you want. Every time he raises his hand or raises his head, we send our ships, our planes or this. We have 28,000 soldiers on the line between North and South Korea. They pay us peanuts. How stupid are we? How stupid are we? A country like Saudi Arabia wouldn't exist for a week.","You know, when Iran took over Yemen, they don't want Yemen. They want the border because it's a huge long border between Syria. They want the oil in Saudi Arabia. That's why they fight for Yemen. That's why they're in there fighting. Think of this, we're making a deal with Iran and we're fighting Iran in Yemen.","When you make the deal, aren't you supposed to sort or solve everything? And Kerry said he didn't want to bring it up because he didn't want to complicate the negotiation. This guy's an idiot. Now, think of it. Yemen, we're fighting them. They're on the other side we're on one side.","We don't know who side won because you know we're on the side of the rebels. We have no idea what the rebels are. Do you ever see all our rebels? Our rebels turned out to be worse than the guys who were there in the first place. We're on the side of the rebels and then the rebels turn out to be like the worst.","But we're fighting Iran. They're on the other side. And we're fighting, fighting and he's out there negotiating and he goes on a bicycle race. He breaks his leg at 73. And I tell people, I give you my word, I will never enter a bicycle race. I promise. During a major negotiation. I mean, the guy comes out.","He's got a whole thing with the outfit, the helmet, the all deal. Right? The helmet, I think he even had the stickers on it. Right? I said, \"What is this guy?\" He thinks he's in the Tour de France or something. What is he doing? We're in the middle of a very important negotiation that frankly he shouldn't have walked away from until we got our prisoners back.","And he should have never agreed to give back the $150 billion. But here's a guy in the middle of a negotiation breaks his leg and he's out of business. I mean, I can't tell you, folks. It is -- and I think the reason I have this tremendous support is because you know what? A lot of it's common sense. OK? A lot of it's common sense.","It's not even. It's not even like, you know, you could say it's a great business ready. A lot of it's common sense. 99% of the people in this room would do just as well. I mean, it's like simple stuff. We're being led by people that don't know what they're doing. Now here's what's going to happen, so we're going to start winning again.","We don't have strong borders, we're going have the wall, we're going to be respected again, we're going to win with our military, we're going to knock the hell out of ISIS. We have to do that, folks. That I have to tell you. Normally, I would say no. But it's gotten to a point and because of the power of weaponry we have to do that.","We really have no choice. So we've got to knock the hell out of them. But our military is totally depleted. You see our old Jets where we're taking parts from plane, airplane graveyards and museums? We have the planes in the museums and we're using them as our fighters and other countries have modern fighter jets.","This is the United States of America. Can you believe what's happening to us? So we're going to -- our military is depleted. Horribly depleted. Smaller than it's been in many, many years. And it's probably got to be bigger right now because I don't know if there's ever been much more of a threat than we have right now.","So we're going to build up our military with the equipment that we want. We're going to take care of our veterans because our veterans have been horribly, horribly treated. We're going to make great, great trade deals and we're going to bring jobs and money back into our country. We're going to create a border and borders generally that a strong and powerful.","We're going to get rid of Common Core and we're going to bring our education locally. We're going to repeal and replace that horror show called Obamacare. And we are going to save our Second Amendment. We are going to save it. So folks, you've heard it before and I say it all the time. We don't win anymore but we're going to win so much.","And I love it. And I'll say it in honor of the people of Las Vegas. In honor of Mr. and Mrs. Wayne Newton, in honor of Miriam and honor of Mr. and Mrs. Phil Ruffin and in honor of everybody in all -- wow look at this place. TSA finally came through for it. Look at the corners of those rooms. Look at the corners of those rooms.","What a beautiful sight. All over the building. So here's what's going to happen, we're going to start winning again. We're going to win with our military. We're going to win for our vets. We're going to win on education. We're going to win on trade. We're going to win, win, win. We're going to win so much.","And I'll be in the White House. And they'll say. They'll say, \"Mr. President. Mr. President, sir, we have a problem. Thousands of people from Las Vegas, from Nevada, from Texas where we just left, from all of the states by the thousands. They're calling sir. They can't stand winning so much. They're not used to winning.","They want you to take it easy.\" And I'll say, \"I'm sorry folks. I can't do that because we are going to make America great again. Greater than ever before.\" Thank you. Thank you very much everybody. Thank you. Thank you everybody. Thank you Wayne. Thank you. Thank you. Thank you Alexandra."],"text":" Thank you very much. I love you people. I love Las Vegas. I love this state. And if you ever need a room, I have a very nice building right down the street. You know, hey. And I have to thank Mr. and Mrs. Phil Ruffin. The room is great. We've got people in every room he's got over here. His restaurants now are full. This what took so long. And the worst thing we can do folks, because we're all together, right. This is a movement. The worst thing we can do is start a rally because if there's one empty seat the press will say, \"Oh, the room didn't fill up.Trump isn't --\" Outside, you have thousands of people trying to get in. And I hate to say it because I liked him and they worked very hard. TSA lets him in and it's not working out so good. I'm not happy about it but I have to put up with it. But they have, you know, the machines and they didn't bring enough machines. And I don't know if the great Wayne Newton has that problem when he performs. But I love Wayne, I'll talk about Wayne in a sec. But we have to be very careful of that. Because let's say I came out 10 or 15 minutes ago, even though there were thousands of people outside. All of the conference rooms have people that have closed circuit television. The whole hotel is packed. Phil you've never had anything like this and he owns it. So if I had like three empty seats they'd say, \"Oh, this is terrible.\" And they're still piling into this room. But I think it's time we begin. Do we agree? Do we agree? OK. So we have amazing people here. Amazing friends are here. And it's been going really well. You know, I read about this an insurgent group, you know the same group that I beat, is insurgent. And there are a couple of guys they're trying to go to claim -- they're trying to get delegates. I thought they already tried that. I mean, I could give you names but I won't because it's meaningless. First of all, it's illegal. Second of all, you can't do it. Third of all, we, not me, We got 14 almost 14 million votes. Fourteen million votes in the primary system. So that's more votes than ever received in the primaries in the history of the Republican Party. OK. Thank you. We beat a lot of people. Sixteen people, there were total of 17 including myself, one after another, boom. boom, boom. It was a beautiful thing to behold. OK. A beautiful thing. It was a beautiful thing. Yeah. That's great. Just keep filling them in. That's right. Is it better that we're starting now? We have to. They're not happy outside but what the heck are we going to do? So it was a beautiful thing to behold. But think of this, so we got almost 14 million votes. We won 36, 37 states which is -- others won none. People that won none are saying, \"Maybe we couldn't get something at the convention.\" Doesn't work that way folks. You would have because we have, you know, one of the things the polls say, we have by far the most loyal followers. Right? By far. You know, other of the candidates -- Well, I mean, take a look at this today. They've never had anything like this. Where every room is full, every conference room, every restaurant is loaded with people. I hope you put closed circuit in Phil, they're going to be so angry but I think you did. This guy doesn't hold back, believe me. But so when we get 37 states. When we get 37 states . We love our police. We love our police. Thank you, thank you officers. Thank you. Thank you. That's very nice, thank you. By the way, how great are our police? OK. They don't get enough credit. They don't get enough credit.They don't. They take abuse. They don't get the credit they deserve. Believe me. So we won 37 states. We won 14 million. We beat Ronald Reagan, who we love. We beat Richard Nixon. We beat Dwight D. Eisenhower. We beat everybody. We beat Bush. We beat the bushes, we beat the bushes. And by a lot. I don't mean we like edged it. I don't mean like, you know, I mean, by a lot. And now you have a couple of guys that were badly defeated. And they're trying to organize, maybe like a little bit of a delegate revolt, maybe. Now, number one, you know Ryan's previous, you know what that is right? R.N.C.? Now he's a good guy and the Republican National Committee, they put out a state and you can't do it. It's not legal. You can't do it. You're not allowed to do it. How would you like to have a party where we started off with 17 or 18 people actually. Including somebody that I won't mention because I'm not looking to embarrass anybody but it was actually 18 if you want to include somebody. OK. But how would you like to have a party Wayne. And he's married to a great lawyer so she'll understands this better than Wayne does. But Wayne has a much better voice right? But how would you like to have a party, where myself and others, traveled the country and worked for a long time. Now was shorter than I thought because remember I was supposed to maybe be able to pull it out at the convention and we pulled it out two months before the convention. Do you remember? Do you remember when they said, \"Twelve thirty seven.\" that's a delegates, \"Twelve hundred and thirty. He cannot reach that number. He can not reach that number.\" And I kept saying, \"What's the big deal?\" And one of the people, who probably hasn't quite given up yet, one of the people was trying to buy up all of the second ballot people. Right? And I kept saying, \"Let him have them.\" because it's expensive to get them. And by the way, I spent less money than any other candidate and I ended up in first place. And they ended up, boom. So now I hear, after beating them fair and square, I mean I beat him fair and square. Actually a couple of the commentators, that are negative people actually, because most of them, but a couple of the commentators that are negative people said, \"Whether you like him or you don't. He beat them fair and square.\" And -- and then they said he didn't beat them by a little bit he beat them by a lot. We beat them by a lot. All right. So how would you like to have a party where somebody goes out and beats them by a lot. And wins not only the vote, largest in the history of the party. Not only wins 37 states, and nobody else was even, you know, like remotely close. I mean, some of these guys have none. How do you like to have that? A guy sets an all time record gets almost 14 million votes over a period of like nine months. He gets 37 states. He gets tremendous support. He has sold out arenas no matter where he goes. Like yesterday and in -- in Houston, people said they have never seen crowds like that. One of the reporters, a very good reporter actually, from NBC, Haley, she just said, \"But are your crowds as big as they used to be?\" I said, \"They're bigger.\" They're bigger, they're actually bigger. No, they're bigger. You had to see Houston, Texas last night. We were in a bigger ring held about 5,000 people. That's not a big one for us but that was the biggest one we could get on short notice. And on short notice, we had a line that went five abreast forever. And it's the biggest subject in all of Texas. They had helicopters over, they couldn't believe what they were seeing. They've never seen anything like it. And our crowds are bigger. Our enthusiasm is more. A poll came out. O.A.N., a very good poll, very -- He's actually, they've -- it's a very good group of people. A poll, O.A.N. came out, where statistically even with crooked Hillary and she is crooked folks. Believe me, she is crooked. Hillary Clinton doesn't have -- I'll tell you what. Hillary Clinton, and you can say it any way you want, but she doesn't have the integrity. She does have the integrity to be president. And perhaps equally important, she's got very, very bad judgment. You just look at what she's done. You just look. OK. So how would you like to be in a party where Trump wins. Where Trump keeps winning. Where Trump has the biggest crowds. Where Trump gets, by the way, the highest ratings in the history of television. They had a story in Variety, I don't like to brag but we have to brag every once in a while. They had a story in Variety where a big headline, a big massive headline, and the story was that Trump makes massive profits for cable networks and networks, but massive. And then it went on to say that they're setting records and viewership, they're setting records and advertising. They're making a fortune. What are we getting at them? We get nothing but maybe, but maybe, we're going to get the presidency and we're going to straighten out our country. OK. We're going to straighten out our country. And we'll have Wayne at that inaugural ball. Wayne will be with me, Wayne. Bah, bah, bah. So -- so there's a little movement and -- and I just heard today where it's coming from it's coming from people that have been badly defeated. But wouldn't that be funny. OK. A guy got much less votes he got no states. Ladies and gentlemen our nominee is. I don't think so. I mean forget about the legality because it's not legal. Forget about the fact that the Republican National Committee put out a statement last night saying it's all made up by the press folks, believe me, by these people right here. It's all made up by the press. OK. It's all made up. It's -- it's it's a hoax, I'm telling you. These are the most dishonest people, not all of them, not all of them, but these are -- This is a story -- I watched CNN yesterday knowing it can't happen. \"Breaking news. There will be this and that at the convention.\" Who are they going to pick. I -- I've beat everybody. But I don't mean beat, I beat the hell out of them. Right? Beat the hell out them. And we're going to beat Hillary. And it would be helpful if the Republicans could help us a little bit, you know. OK. Just a little bit. I mean, I have people that are so -- that I've done so much for that. Frankly, we've done a great job for all of us. You know, the Republican Party has increased the voter turnout for the -- forget about me. I set the all time record, guess what, the Republican Party in the primaries has -- is up 70% right? I think it's even more 70 -- 70% from four years ago. 70% more people have voted in the primaries. Is it because of me? Stand up, say it. A woman. I'm doing well with woman. Go ahead. Thank you. Believe me, I respect women more than Hillary respects women. I can tell you that. Thank you. They're screaming it's because of you Mr. Trump. It's because of you. And you know what? I never break. They happen to be 100% right. All right. We -- you take a look at these states. A couple of the states were up 102% from last year. OK? From four years ago. 102% it's unheard of. In the whole world, people talk about it. I mean, some people would have said the Republican Party has stayed. It's not bad state. It's try -- you know, it's got a little boring maybe and maybe the ideas weren't right because I don't believe in the -- let it be boring if the ideas are right. But the ideas weren't right. There wasn't strength on the border, our budgets are way out of whack. Look at this last budget that we approved, the omnibus budget. You know, Obama is a horrible negotiator. Iran -- Iran beats him, every country beats him. He draws the line in the sand, they beat him. Everybody beats him but he's a great negotiator when he has to negotiate against the Republicans. And we got to stop. We got to stop. We got to stop. They have to focus on budgets not focus on me. And they view me as an outsider. I have to tell you a little secret, I shouldn't said it. You'll -- half of you will leave the room. Should I say it? I used to be the ultimate establishment person. I was a massive giver. I gave a lot of money, to everybody. I even gave to Democrats. I mean, I'm in business. Right? I gave to Democrats, I gave to Repub -- but I gave a lot of money. The RGA, Republican Governors Association, hundreds of thousands of dollars. And I was like establishment. And then one day I said, \"You know, I'm going to run.\" And I announced. And they said, \"What happened? That's no good.\" Because I'm not one of them. Because I'm going to do the right thing. I don't need this, folks. I don't need this. I don't need this. Phil Ruffin told me this morning, came over, we met. And he's done such an amazing job with this hotel and his wife is actually much more amazing than him. Alexandra stand up please. Stand up. She's more amazing than Phil. Mr. and Mrs. Phil Ruffin. And he told me this morning he said -- and he's talking to a group of people and we're raising money for the Republican Party. And frankly, I like doing it. I went around -- yesterday I think, between yesterday and today, we raised 12 or $13 million for the Republican Party. It's good. For the Republican party. And somebody said, \"Well, you're not raising money fast.\" I said, \"I don't know.\" You know, I get people. I'm raising money for the Republican Party and I'm not getting that kind of support. What they don't tell you though, is I actually have a lot of support. But they don't talk to the people that support. Wayne Issa, who is a great guy, Congressman. So many of the Republicans are so supportive they don't want to talk about them. If somebody says something just a little bit off. Headline, blaring news, breaking news -- you know, they use the breaking news. Every time there's an event there's breaking news. Then, when you have a real breaking news event, nobody takes it seriously. You have it on. Breaking news, Donald Trump got up today and tweeted, \"Good morning.\" Crazy. It's crazy. But they don't talk about that. But I will say -- Phil said to me this morning, and he said to a group, he said, \"You know, Donald Trump didn't need to do this. He's made a fortune, he's done a great job, has a great family. An unbelievable.\" Phil, do I have an unbelievable business? Stand up, please. This guy's know better than I. Stand up. Stand up. Did I do a good job? Built an unbelievable business. And I built an unbelievable business, a great, great business. Some of the greatest assets in the world. No matter where. Who's that guy? Is he a friend or foe? OK. Get him out of here please. Get him out. Get him out. Get him out. You could let -- could you let somebody else take his place, please? Thank you very much. These are like love fest. You know, a friend of mine came over to me and he said -- very rich guy. Very success -- very successful guy. Not a great guy but who cares about that? We need these people to help us negotiate with China and with other countries. But he's a guy that, he's very successful and he was at an arena where I had 21,000 people. And I was speaking and he said -- and he's got a lot of guts. Financial guts I call. You know, a different kind of guts. Like I have financial guts. When I see what our great military people do, I don't know that I'd have those kind of guts. Right? Right? These people are fantastic and we've got to take care of our military. Take care of our vets. We have to replenish our military and we have to knock the hell out of ISIS. But then knock the hell out of ISIS. But -- but he came up to me, and he was with me at this arena, and he saw -- it was in Dallas. And 21,000 people, the Mavericks arena packed including the whole floor. And he said, \"Can I ask you a question? How long have you prepared for this speech? How the hell did you get out there in front of that many people?\" I said, \"That's nothing. Because all the networks are covering it live just like they are right now.\" Said, \"How do you do it?\" Thank you darling. You're right. She gets it. You're right. And I said, honestly -- and he said, \"How do you do this?\" He says -- she -- she understands. But he said, \"How do you do this? How do you speak in front of that many people?\" He said, \"He could never do it.\" I said, \"It's not hard. Because I'm telling you, there is such love in this room. There is such love in this room.\" I really mean it. I really, really mean it. There is such love in these arenas. We had in Mobile Alabama, we had 35,000 people. We started in a hotel ballroom after about an hour the hotel call said, \"We can't handle it.\" We then moved to the convention center that holds 10,000 people. They told us after two hours they can't handle it. We moved to a football stadium in Mobile. We had the most unbelievable time, we're 35,000 people. In Oklahoma, we have these massive crowd. We have massive crowds everywhere. And it's so easy to do what I'm doing because it's love. It really is love. I'm doing it for love, I'm doing it for this country. I want to -- we are so off track. We are so off track. So -- and I'll tell you something, the safest place -- thank you darling. The safest place to be, in this country, is at a Trump rally. Remember that. Remember that. It's the safest place, to be. Oh good, all the seats have now filled out and there's still -- they just said there's 3,000 people outside. All the seats are now filled out. I'm telling you. I'm telling you. The press, if I had -- I'm telling you, we had to do that. That's why I waited. Are you? Is it OK that I waited? Yes. OK. Now they're all filled out. Filled out all over this building. I don't know. This guy Ruffin must be making a fortune this morning. I don't know. So the safest place to be, seriously -- and our whole team is make America great again. But I've. -- I've revised it. It's make America great again. It's make America safe, again. Safe, again. It's make America safe again. And it's also, we want to do it for everybody. Not just us. We want to do it for everybody. We want to help African-Americans where -- Who are -- You look at African-American. Thank you, thank you, thank you. Thank you. Thank you. African-American youth has a 59% rate of unemployment. OK folks, 59. And we're letting people pour into our country. We have no idea who the hell they are, where they come from, there's no documentation, there's no paper. They come from hostile countries. They came -- they come from countries that are tremendous in terms of terrorism. And we're going to have big problems if you think Orlando was the end of it. With this weak attitude and this pathetic president that we have. It wasn't folks. It wasn't, it wasn't. This is just the beginning. Unless we get smart and tough and vigilant. And unless we say, \"I'm sorry.\" You're coming from a region in the world whether it's -- And I can name them all. Boys, I can name them all. But it's radical, Islamic, terrorism. It's a whole new thing. It's radical Islamic terrorism. And it's not guns. You know, I saw the president talk immediately about guns. It's not guns. It's terrorism. It's terrorism, it's not guns, it's terrorism. And I watched him the other day and he was -- And --and by the way, this wasn't just me saying it. He was more angry at Donald Trump than he was at the shooter, the maniac, who killed all of those young people. He was more angry at Donald Trump and I wasn't the only one to say it. Plenty of people saw it that he wasn't the shooter. So we got to change our mindset here folks. We have to be really tough, really smart, really strong. You know, in the past we'd have a war and we'd be fighting Japan and they had uniforms. We knew who we were fighting. And we'd be fighting Germany and we'd be fighting others. And we knew who our opponent was. We knew who the enemy was. Today, you don't know who the hell it is. And you are going to have -- you are going to have Problems the likes of which you've never seen unless Donald Trump becomes your president. Believe me. Believe me. Thank you. Thank you. Now we're going to bring jobs into our country and that's going to solve a lot of problems. It's amazing how jobs can solve a lot of problems. Problems that we think we have, all of a somebo -- somebody gets a good job. And you don't have the problems. But we're having our jobs ripped off and being sent to other countries. Ripped off by currency manipulation where they're lowering the value of their currency and then making it impossible for our companies to compete. We're being ripped off at every level. And we have leaders that are so stupid they have no idea what's happening. I mean, look at the newspapers today, Apple. Good old Apple. I was waiting for this to happen. They've been having this stuff made in China and now China has turned against them. Now here's the bad news, by my saying that China is very smart, they're going to say, \"Oh boy, Trump's picked up this one will let Apple.\" I am doing such a service to Apple by even mentioning it because our word is being broadcast all over the world. And Tim Cook should send us a lot of money for what I'm doing. But China is now ripping off Apple saying, \"You don't have the right to sell a certain product in China because somebody else has the right.\" And they are ripping them off big league. And right now, Apple, doesn't know what to do. But it always happens, but you watch. Because of this, this will be a headline. Now China, they're smart. I deal with them. They're very smart. You can do great with them. I made a lot of money with China. The biggest bank in the world is my tenant. I sell condos like crazy to people from China. The Bank of America building in San Francisco, indirectly through China. I mean, so much, so much stuff. I did great with China and I have great respect for China. I'm not knocking China and I'm not knocking Mexico and I'm not knocking Japan. I'm not knocking anybody. I think it's great what they do for themselves. But I am knocking our leadership is being grossly incompetent. They don't know what the hell they're doing. They don't know what they're doing. And every time, and an -- an offer this China is just one of many. But China is the biggest and it's the biggest abuser. China's an abuser. They abuse our country. Every time they start doing badly, do you notice? They knock out their -- their currency a little bit lower. A little bit low. They're not supposed to be doing that. That's sort of like cheating. You know, it's a way of cheating. Now, we do it very little because we don't know how to play. They like, grand masters. They like grand masters and we like checker players that don't know how to play. That's no. That's the difference. But it won't be that way. Carl Icahn, guys like Ruffin, guys like so many of my people that have backed me, so many of the people that Phil knows. These are the best business people in the world. These are the best negotiators in the world. These are the best negotiators in the world. And you know what? You know what? It's very interesting. We're going to put it up. I'm the best. Oh, I'm good. Good. But we have the best. We have the greatest business people, we have the greatest negotiators in the world, you know. We have the greatest. Andy Beal who's a big supporter. Andy Beal, Beal Bank in Texas. We have such unbelievable people that are supporting me. And they support me not cause they like me. Although, I guess that's a part of it. But they're supporting me cause they hear me. You ever see a corporate inversion? We have companies that are leaving this country. Taxes are too high. And they have trillions of dollars outside of our country. They can't get it back. We can't get it back because we have no leader. You know, we have trillions of dollars right now outside of our country. I think it's 5 trillion. They say it's two and a half trillion and I think it's much more. We can't bring it back. The Democrats want to bring it back. The Republicans want to bring it back. Every -- but who the hell doesn't want to bring it back? It's money that we aren't allowing to come back in because of bureaucracy -- it's actually not just taxes. The taxes are crazy. Only a maniac would bring it back and pay those. It's crazy, too high. High -- we pay the highest taxes in the world. By the way, I have the biggest tax decrease of any candidate that's run for office and that's close to 20 people. And Hillary Clinton has the biggest tax increase and she doesn't even want to talk about it. In my opinion, her taxes have to be close to 60% to pay for what she's talking about. And she got forced into a corner by crazy Bernie. One thing about Bernie, he doesn't give up. This guy doesn't give up. Right? Crazy Bernie. He -- he doesn't give up. You know. Crazy Bernie, he's crazy as a bedbug. But you know, he doesn't quit. He doesn't quit. Got to hand it to him. And I think Bernie should continue to go forward, folks. He should continue to go forward. He should fight to the last end. Well, he's waiting for really, the FBI to do what everybody thinks they're going to do. I mean, I think that's. All right. I think, he's sort of saying, \"Look, huh. Let's hang in there.\" Because ultimately it's called, the FBI convention. And then we'll be the only people and we will have done something like Trump did. I want to be like Trump. I want to be like Trump. But I think he's waiting for the FBI convention. We'll see. We'll see. We'll see if the right thing happens. Everybody knows what the right thing is. I've watched and read and seen and talked to great legal scholars. Not one has said that she should be allowed to run for office. Every person, that we know of, that's done far less than what she's done, their lives have been destroyed. And the press doesn't cover it because the press is so one sided. CNN, as an example. It's called the Clinton News Network. Clinton News Network. No. It's a joke. It's a joke. The Clinton News Network. So we'll see what happens. But Bernie is in there and Bernie is fighting. And I don't think you should give up. Does anybody think so? I don't think so. If he gives up, we'll say, \"Bernie you're a loser. You gave up.\" We get it. Now, but we'll see. I mean, he's got to have something in mind. Did I personally think that's maybe what he has in mind. So we're going to do things for our country, that are going to be amazing. And they've resonated -- look, one year from Thursday, I ran. And everybody said, \"June 16th.\" One year. So it's one year and two days now. One year. One year. And a lot of people said, \"I watched Karl Rove.\" He said, \"Oh, he's not going to run.\" Oh, good. I watched Krauthammer, no, he won't run. Krauthammer said, \"He won't run.\" He -- he won't run because this is the single greatest group of talent perhaps in the history of the Republican Party. Fact, a month before I said to my wife, \"Wow, I just.\" -- Don't forget, Krauthammer wanted us to go into Iraq and bomb the hell. We've done a great job by doing that and I was against doing that, folks. So I was against it. These guys all wanted to bomb the hell out of Iraq. We've done a great job in doing that. We've totally destabilized the Middle East. What a mess we have? OK. What a total mess we have? And by the way, who takes over Iraq? Iran. Not only do they make the Iran deal. I used to say, \"That's the greatest deal I've seen.\" They've got $150 billion back. They have the right to go wild with nuclear weapons eventually. They don't need to make them, they can buy them. But you know what? They make great. Now, I used to say that's one of the greatest deals I've ever seen. I don't say that anymore. Greatest deal, is that for years and years and years, decades and decades they fought each other. And one won ten feet this way, ten feet that way, ten feet three or four years. Then they rest it. Then they go again, again, again. Saddam Hussein drops a little gas. Iran complains, you're not supposed to do that. The world goes crazy. And then they rest. Then again. OK. This has gone on forever. Then we come in and obliterate one of the two. Obliterated. And now, what have we done? We have given Iran, Iraq. OK? As sure as you're sitting there -- I've been said this for a long time. But Iran is essentially controlling Iraq. Iran is now, very shortly, could have just walk it. They don't have to fire or shot. And the people running Iraq, are so in the pocket of Iran. And why wouldn't they be? Because they figure we're gone. You know, we're gone. So Iran is going to take over Iraq. A lot of people don't know that Iraq has some of the largest oil reserves in the entire world. A lot of people don't know that. So look what's happening, look what's happening to Iran. Look what we've done by sheer stupidity. So a lot of these papers they said, \"Bomb, bomb, bomb\" And I said -- although I -- what did I know? I was in business. Right? I didn't know. A lot of people weren't asking me. But I said, \"If you do that you're going to destabilize the Middle East.\" And hence you have the migration. And hence you have people going all over the world. Look at the problems in Germany, look at the crime. I have friends in Germany that for years they'd say, \"The greatest country. The greatest country.\" They love Germany. Now, they're saying, \"We're leaving.\" They were leaving Germany. Look what they've done to different -- look at Brussels. How beautiful a place was Brussels? And look at what's going on. Look at Paris. Look what's happening in Paris. And it's far worse than you people understand. It's far worse that people understand. In fact, today there was actually a story, that Paris is so, so, so out of control, so dangerous. Look at what's going on. And we have Hillary Clinton wanting to take in over 500% more than Obama. Now think of it. Than Obama. Of people that will cause us problems like you will not believe. Not all of them. But look what one man did, one whack job. He's a wacko. Look, what one whack job did. One radical Islamic terrorist. And he pledged himself to ISIS. Here's a guy. He's shooting people and pledging himself to ISIS as he shooting. OK? He's calling people and talking about ISIS. ISIS. Look what one man has done to this country. Look at what one man has done to the state to the great, great, great state of Florida that I love and Orlando amazing place. This is one man. We're letting in millions of people. It doesn't take large amounts. This could be the great Trojan horse. We all know the story of the Trojan horse. But this could be the great story of the Trojan horse. All because we have leadership and weak people like Hillary. She's weak. She's weak. She -- Bernie Sanders said about Hillary Clinton that she can't be president because she has bad judgment. OK? He said it. I didn't said. I would never say anything like that. And then, I hear her. I hear her saying -- you know reading right off always teleprompters. She goes, \"Donald Trump does not have the temperament to be president.\" And then the -- you know, the -- the people back. \"Oh, she gave a great speech.\" Oh, give me a break. Gave a great speech. You think, she's the president? Take a look at her. You think she's the president? I don't think so. I don't think. Donald Trump does have the temper. And I'll tell you something, I started thinking about it. And I was going to say, \"I absolutely have a great temperament and I've done great things.\" Hey look, I went into television, had the apprentice, great hit. One of the most successful reality show. OK? I did books, many bestsellers, many. The Art of the Deal is one of the biggest selling, certainly the biggest selling business book of all time, by far. So I did books. Tremendous success. Real estate, I've some of the greatest assets in the world. You look at my numbers very low debt, tremendous everything. OK? I filed over a hundred and somewhat pages. But listen to this. OK. So listen. So we have -- we have a great study in contrasts. So I started thinking about temperament and I was going to say, \"I do have a good temperament. I do.\" And then I said to myself wait a minute. She's probably right about one thing. I have a very tough temperament. She said, you know, but very controlled. But we need tough temperament today. We can't have this weakness. We can't have weakness. My temperament's tough. My temperament is very solid. I don't lose control. I -- I have been doing this for a long time, folks. You've been watching me for a long time. You know in New York, I won in a massive landslide. Who knows me better than the people of New York? Nobody knows me better. Nobody. I won in a massive landslide and we had three people. Now in New York knows me better. I've been there for a long time. If I didn't have a good temperament, I couldn't have won New York. They know me. Oh, do I get publicity? Do I get? They write about me every day, every hour. It's always been this way. I don't know why. I don't know why. They had their debate. So Fox and the debate had 24 million people it's actually even more than that. But 24 million people. The largest audience in the history of cable television. Now, I don't think it was for Jeb. But maybe I'm wrong. OK? By the way, Jeb is working on the movement just so you understand. I love competition like that. I love it. So -- so look. Look. Low energy. I didn't say it. You did. OK. Now, Jeb is one of the people that's working. And the other one should be obvious to you but we'll figure that out very easily. OK. Ready? So -- so when you look, and when you see, and when you see what we have to do, we have to get out there. We have 24 million people, they watch. We have 23. The next two weeks CNN puts on, a debate. Twenty three million people. The largest audience in the history of cable television for CNN. Here CNN covers wars, covers everything. Right? She have the largest audience in the history of cable television and then a few weeks later, Oh yeah. They do say the debate with Hillary will be. It's going to blow everything away. Oh, I look forward to that debate. Oh, do I look forward to that debate. I look so forward to that debate. But -- but think of this, so CNN, a few weeks later has another debate. And they get the largest audience they've ever had in the history of CNN. You know, it's pretty impressive. Right? And variety in the magazine say, \"The Trump debate drew record ratings.\" OK. Just like they said the profits. But here's the thing about the debate. So the debates go on and a lot of people say what was the biggest surprise. Well, I didn't know myself as a debater because I never debated and I create jobs, I do deals, I do business, I do this stuff. Right? I don't debate. I guess my life is a debate but I don't debate professionally. And I hear all these politicians they're debaters. We debate. Hillary Clinton supposedly is a debater. Give me a break. Will she be allowed to bring the teleprompter onto the debate stage? So. So -- so what happens is we start the debates and I never did it before. And I'll say -- but think of that. I was in 11 debates and of the 11 debates, they go was 11, of the 11 debates, I was on center stage for every single debate. Meaning your No. 1. And of. And of the 11 debates of the 11 debates. Drudge, fantastic guy, Time magazine, Slate they do polls. I -- I think, I really helped the polling business. Right? They talk about polls. I like polls. But only if I'm winning. I don't like them otherwise. And we're starting to catch up very rapidly so pretty soon. The polling companies are going to have their day in the sun. Pretty soon, I think. But here's the story. So of the a -- Of all of these debates, I think, there's seven of them they cover. They have online polls. Hundreds of thousands of people vote. And on every single debate by every single poll I won every debate. Which is pretty good. Which is pretty good. You know. I don't know. I think it's pretty good. But we are going to do things that are going to be great. And a lot of people don't want me in because they don't want to see strong borders. OK? They don't want to see strong. I want to see strong borders. They don't want to see me a job creating. They don't want to see what I'm going to do to help a -- the minorities. Because we have problems in this country. We -- I will do more for African-Americans than Barack Obama has ever, ever, ever done. And believe me. He's done nothing. He's done nothing. He's done nothing but talk. He's done nothing but talk. And the Hispanics. So I employ thousands of Hispanics. Thank you. Where's Miriam? Where is Miriam? Where is she? Thank you. No, I employ thousands of Hispanics. Where's Miriam? She's shy. She doesn't want it -- she has been so amazing. Where is? Thank you. Thank you. She goes around and says, \"Donald Trump is going to do more for Mexicans and Hispanics.\" And -- and I appreciate it. Thank you. Thank you. Thank you very much. I appreciate it. Thank you darling. So nice. Now, she's been amazing and she a -- she knows because I'm going to bring our jobs back, folks. We -- we going to jobs back. Look at Carrier. They fired everybody. They're moving to Mexico. So many companies moving to Mexico. I mean, I have a list and it's a mile long. They're moving to Mexico firing everybody. Then they make the product not only in Mexico. They make the product. They sell it into the United States no tax no nothing. And you know what happens? We're going to lose a lot more companies, folks. We'll going to lose a lot more companies. If I'm president, we're not going to lose anything. We're not going to lose any companies. We're not going to lose. And I say that strongly. Because you know what? These guys don't know. I've been watching this discussion because for seven or eight years we have been just it's been an onslaught. And longer than that. In all fairness to Obama long before Obama. It was called NAFTA. It was signed by Bill Clinton. And it didn't affect Bill Clinton but it affected everybody that followed Bill Clinton. And believe me, folks. It has been a disaster for this country. When I won New York State and Pennsylvania, when I won Maryland and Connecticut and Rhode Island and when I won all of these states and then won Indiana. Thank you Bobby Knight. Boy, did Bobby Knight help. Boy, did Bobby Knight. That was a Coach Knight, 900 wins. But when I won all of these states, I really got to know. Even New York said I knew it well. I knew there were tremendous problems upstate New York but I had no idea. When I toured those upstate areas of Albany and Rome, the real Rome, Rome New York. OK? That's what I call that, the real Rome. But -- but Syracuse and you see building after building after building empty, falling down. It just a horrible sight, all over. You could buy them, folks. You could buy them for a dollar. And you know what? I'll give you a maybe some real estate advice. Go out and buy them. And if I win, you're gonna make a hell of a lot of money. OK? Fact, Phil Ruffin will get up and leave before the speech is over. He's headed to upstate New York right now. No but it's true. It's true. Building after -- by the thousands, by the thousands. And I have statisticians at work for me. And before I used to speak when we were in the primary. I'd say, \"Give me the information on upstate New York. Give me the information on Long Island. Give me the information on -- on all of these different places. Pennsylvania in particular.\" Look at West Virginia. What they've done to our coal miners? They've destroyed. Hillary Clinton said, \"I'll put the coal miners and the mines out of business.\" That was not a smart statement. And then she had to go there for always like. And look at the numbers I've gotten in West Virginia and Pennsylvania. But I look because we're going to bring the coal industry back and we're going to bring every industry. We're going to bring our energy industry back. We're going to bring it back. We're going to bring it back. You know, because of technology, folks. Because of technology we have learned things frankly. And we realize that we have wealth that we never knew we had. Over the last six or seven years there are many forms of technology that have given us an awareness that's unbelievable. What's happened is unbelievable. So we're going to bring all these things back and we're going to start paying off our debt. And we're not going to let our companies see. Now, here's what we're going to do. So Carrier says they're leaving. I would call them and say very nicely, and you know, my wife gives me a very hard time. She said, \"Darling, your president. You cannot call an air conditioning company.\" I said, \"That's OK. It's so much fun. It's like a two minute call.\" If I can say 1,400 jobs in two minutes let me do it. But I'd call. Meaning I'd call. Somebody calls, somebody calls. I got a call. Maybe I should do it. Right? And I say very simply, \"You just fired 1,400 people. You're moving to Mexico. Enjoy it, enjoy it.\" I respect Mexico so much for taking all of our -- our businesses, so much of our business. But let me just tell you, here's the story, every air conditioning unit that you make, that you sell across are now very, very strong border. You will be paying a 35% tax of that unit if you leave. If you leave. Now, our country has been working on this problem for years and they did all sorts of deals like zero interest loans and we'll give you money what. The -- that they don't need money. They don't want money. How about the deals where they gave him really cheap money and they left anyway? You know, I mean, it's like rape. Try collecting. They don't need money, 100% they don't need. If I talk to them, for two minutes. Phil would you say two minutes or do I need three? I think in two. He says, \"One.\" Hey, it's Phil's. Phil said one minute. But in a quick conversation they will not going to move. And they're not going to be calling lobbyists because you know I spent 55 million on my own campaign of my money. OK? Of my money. And by the way, if the Republican Party -- and I hope they all come together because I want them to come together. It's great. But if for any reason they get a little bit like they don't want to help out as much then I'll fund my own campaign. I'd love to do that. I'd love to do that. You know, right now I'm raising a lot of money for the Republican Party and a lot of beneficiaries to that. And I like doing it. But we have to have help. We have to have help. They have to be at Scott -- you know, life is like a two way street. Right? It's a two way street. So they have to -- otherwise, I'll just keep that one what I'm doing. I'll just keep funding my own campaign. I'm OK with that. That's the easy way. I mean, for me that's the easy way. But hopefully, I can continue to go the way we're going. This weekend we raised a lot of money. We've raised a lot of money for the Republican Party we'll keep doing it. Because we do have tremendous support within the party that I can tell you. We have tremendous support. OK. So what's going to happen with Carrier. What's going to happen with any of. Is they going to say, \"Ah, we want to talk about this.\" Then they going to go hire a lobbyist. The lobbyists are going to call. I say, \"I'm not giving you guys anything.\" Now, if they call Hillary, 100%. They have a lobby. They have a lobbyist in Washington. He's got Hillary Clinton step in his forehead. OK? It's 100%. With me? It doesn't work that way. OK? With me, it doesn't work that way. Within 24 hours, they will call, let's say, \"Sir, we've decided to stay in the United States. We'll stay in Indiana.\" Or they'll go someplace else but they're staying in the United States. Now multiply that times thousands, times thousands and thousands of companies. That's what you're talking about. You're not talking about 100 companies or 10. You're talking about thousands of companies have left. Thousands of companies are being killed by monetary manipulation. OK? Thousands. We're not going to let this happen. Remember this, China -- we have rebuilt China. They have taken so much. You know we owe China now $1.7 trillion. Think of it. They beat us at every front. They kicked the hell out of us and we owe them money. How about Japan? We owe Japan $1.6 trillion. Now, think of that one. They sell the cars, the big boats come in, the biggest ships you've ever seen. I mean, if Wayne Newton could ever get his big audiences onto one of those ships, you would be very proud. I'm telling you Wayne. Wayne would you stand up again. Come out. Rick. I mean, we love this guy. We love Wayne. We love our. You know, it -- it's sort of like a weird experience because all of my life I've been watching Wayne Newton and now I'm performing for him. What the hell is going on over here? And the problem is, I like him better than I like myself. So anyway. So. So all of this is going to come back. Now, you have people in both parties that don't like the things I'm saying. OK? You people in both parties. But you know because I have the smartest people. A lot of people are saying that. That's even showing up. I have the most dedicated people. I have the best people. I have the best people. I have the best people. And they get it. But a lot of people. A lot of people don't like strong borders. They don't want the wall. We going to have the wall, folks. We going to have the wall. We're gonna have the wall. And the wall is going to stop drug trafficking. It's going to help with the drug. You know, the drugs are pouring into our country and poisoning our youth and others beyond what anybody has any idea. If you look at New Hampshire which I want. I love New Hampshire because it was my first victory. It's my first victory. I never ran for office. By the way, am I doing a good job? Am I doing a good? Right? I never did this before. But I love New Hampshire and the people of New Hampshire got together with me and they said their biggest problem is heroin. They said heroin. You know, it just doesn't work with the beautiful trees and streams and lakes. I said, \"Heroin?\" And it turns out to be they have a tremendous. And they have it in Massachusetts and they have it in South Carolina and they have it in all of these places. All of these places. And it's pouring across. And three weeks ago, 16,500 Border Patrol agents endorsed Donald Trump. They've never ever endorsed a presidential candidate. And I asked him and they told me, they said, \"Mr. Trump, you need the wall.\" And Sheriff Joe Arpaio, great guy, tough. Right? Sheriff Joe from Arizona. In fact, when I finish this I'm going to Arizona. I'll be in Arizona in a little while doing the same thing with big, big beautiful crowds. But Sheriff Joe endorsed Donald Trump. Folks, we know what we're doing. OK? We know what we're doing. We are going to make this country so strong again. We're going to save your Social Security. We're going to save your Second Amendment which Hillary Clinton wants to abolish. Hillary Clinton wants to abolish your Second Amendment. And I got the endorsement of the National Rifle Association, the NRA. One of the earliest endorsements they've ever given. And let me tell you, between Wayne and Chris and all of those people. These are great people. These are people and it gets lost. It gets lost in the debate. These are people that love our country. Just remember that. These are people that love our country. And you know, I've said before, some people thought it was a harsh statement. But if in Paris, where 130 people died -- toughest gun laws in the world, by the way. There were no guns on the other side. These thugs walked in -- probably if they were, if they knew they were, they wouldn't have gone in there in the first place. OK? They knew there were no guns. But toughest gun laws in the world, 130 people die. San Bernardino, 14 people die. Friends, they were friends. They killed the 14 people and so many so badly injured. By the way, Paris? The hospitals are still loaded with people so horrible. And what we had this weekend? If there were a couple of folks, man, woman had a gun strapped right here, right here, right here. Or a gun strapped very nicely to the ankle and this no bed is no good sick, sick perverted horrible terrorist. Terrorist was in there starting the shooting. One of those people would have had those bullets going the other way, folks. It would have been a whole different story. Would have been a whole different story. So we're going to make our nation rich again. We're a poor nation. We lose to everybody. We defend Japan. They don't pay us the right money and they will. They will. You know, the press says the second I said, \"No, no.\" In a deal, you always have to be prepared to walk. They'll tell you that. You always have to be prepared. Not that you want to walk but you have to be prepared. So here's Hillary Clinton when she heard about what I said about Germany, \"He's not being loyal to our allies. We will always stay with our ally.\" Well now, they're never gonna to negotiate. Why would they negotiate? Why? But we have all of these nations that we defend. South Korea, try buying a television outside of South Korea. Not easy. I buy thousands and thousands of television sets. Very tough to buy them outside of South Korea except for Sony which not doing so well lately. OK? From Japan. But let me just tell you, South Korea we defend. Because there's a fortune. They pay something but not what they should be paying. Japan we defend. Billions and billions of dollars. A general gets up, \"Donald Trump is wrong.\" He was sent by Obama. Nice looking guy. General. He said, \"Doesn't he understand that Japan pays us 50% of the cost.\" So he said in Japan pays us 50% of the cost of their defense. So the press call me up, \"Mr. Trump, they said that Japan pays 50% of the cost. Why do you? How do you respond? I said, \"Why don't they pay 100%?\" Right? Right? Right? Right? I mean, we're defending Japan. So we defend Germany. Germany. Think Germany is a rich nation. I want to tell you, it's a rich. And I about to tell you what? Going to have problems with what she did but regardless. Rich nation. Now, we have Saudi Arabia. Saudi Arabia when the oil prices were high, was making $1 billion a day. We pay rent on our bases. We pay them rent. We defend Saudi Arabia. Now listen, Saudi Arabia I have a lot of friends from Saudi Arabia all that stuff. Right? But you know what? This is a country that has nothing but money. They have nothing but money. Not strong defense. That if we weren't there, they would have been gone 25 years ago. OK? Twenty five years ago. You remember the incident with Iraq? When Iraq went into Kuwait and then they started looking at Saudi Arabia. And the Saudis didn't do so well and then we had those Marines of ours with the stuff under their eyes and boy that was the end of that. Remember that? People forget. People forget these little stories, folks. So we defend Saudi Arabia. They don't pay us nearly what they should be paying. So essentially, we subsidize all of these countries. South Korea with this guy, call him a maniac. Call him whatever you want. Every time he raises his hand or raises his head, we send our ships, our planes or this. We have 28,000 soldiers on the line between North and South Korea. They pay us peanuts. How stupid are we? How stupid are we? A country like Saudi Arabia wouldn't exist for a week. You know, when Iran took over Yemen, they don't want Yemen. They want the border because it's a huge long border between Syria. They want the oil in Saudi Arabia. That's why they fight for Yemen. That's why they're in there fighting. Think of this, we're making a deal with Iran and we're fighting Iran in Yemen. When you make the deal, aren't you supposed to sort or solve everything? And Kerry said he didn't want to bring it up because he didn't want to complicate the negotiation. This guy's an idiot. Now, think of it. Yemen, we're fighting them. They're on the other side we're on one side. We don't know who side won because you know we're on the side of the rebels. We have no idea what the rebels are. Do you ever see all our rebels? Our rebels turned out to be worse than the guys who were there in the first place. We're on the side of the rebels and then the rebels turn out to be like the worst. But we're fighting Iran. They're on the other side. And we're fighting, fighting and he's out there negotiating and he goes on a bicycle race. He breaks his leg at 73. And I tell people, I give you my word, I will never enter a bicycle race. I promise. During a major negotiation. I mean, the guy comes out. He's got a whole thing with the outfit, the helmet, the all deal. Right? The helmet, I think he even had the stickers on it. Right? I said, \"What is this guy?\" He thinks he's in the Tour de France or something. What is he doing? We're in the middle of a very important negotiation that frankly he shouldn't have walked away from until we got our prisoners back. And he should have never agreed to give back the $150 billion. But here's a guy in the middle of a negotiation breaks his leg and he's out of business. I mean, I can't tell you, folks. It is -- and I think the reason I have this tremendous support is because you know what? A lot of it's common sense. OK? A lot of it's common sense. It's not even. It's not even like, you know, you could say it's a great business ready. A lot of it's common sense. 99% of the people in this room would do just as well. I mean, it's like simple stuff. We're being led by people that don't know what they're doing. Now here's what's going to happen, so we're going to start winning again. We don't have strong borders, we're going have the wall, we're going to be respected again, we're going to win with our military, we're going to knock the hell out of ISIS. We have to do that, folks. That I have to tell you. Normally, I would say no. But it's gotten to a point and because of the power of weaponry we have to do that. We really have no choice. So we've got to knock the hell out of them. But our military is totally depleted. You see our old Jets where we're taking parts from plane, airplane graveyards and museums? We have the planes in the museums and we're using them as our fighters and other countries have modern fighter jets. This is the United States of America. Can you believe what's happening to us? So we're going to -- our military is depleted. Horribly depleted. Smaller than it's been in many, many years. And it's probably got to be bigger right now because I don't know if there's ever been much more of a threat than we have right now. So we're going to build up our military with the equipment that we want. We're going to take care of our veterans because our veterans have been horribly, horribly treated. We're going to make great, great trade deals and we're going to bring jobs and money back into our country. We're going to create a border and borders generally that a strong and powerful. We're going to get rid of Common Core and we're going to bring our education locally. We're going to repeal and replace that horror show called Obamacare. And we are going to save our Second Amendment. We are going to save it. So folks, you've heard it before and I say it all the time. We don't win anymore but we're going to win so much. And I love it. And I'll say it in honor of the people of Las Vegas. In honor of Mr. and Mrs. Wayne Newton, in honor of Miriam and honor of Mr. and Mrs. Phil Ruffin and in honor of everybody in all -- wow look at this place. TSA finally came through for it. Look at the corners of those rooms. Look at the corners of those rooms. What a beautiful sight. All over the building. So here's what's going to happen, we're going to start winning again. We're going to win with our military. We're going to win for our vets. We're going to win on education. We're going to win on trade. We're going to win, win, win. We're going to win so much. And I'll be in the White House. And they'll say. They'll say, \"Mr. President. Mr. President, sir, we have a problem. Thousands of people from Las Vegas, from Nevada, from Texas where we just left, from all of the states by the thousands. They're calling sir. They can't stand winning so much. They're not used to winning. They want you to take it easy.\" And I'll say, \"I'm sorry folks. I can't do that because we are going to make America great again. Greater than ever before.\" Thank you. Thank you very much everybody. Thank you. Thank you everybody. Thank you Wayne. Thank you. Thank you. Thank you Alexandra."}