{"id":380,"author":"Donald Trump","title":"Speech: Donald Trump in Houston, TX","date":"2016-06-17","link":"https://factba.se/transcript/donald-trump-speech-houston-tx-june-17-2016","paragraphs":["We live all over the place. We live all over the place. Wow, what a group. Oh, thank you. Thank you. I love you. We love taxes. I love you. I love you, Texas. Man, thank you. Wow. Thank you, everybody. Somebody asked me how do you think you're going to do in Texas? I think we're going to do very well in Texas, right?","We're going to do very well. So I have to say this and you know, you have to see what's going on outside. There are lines that are two, two miles long. I don't know and I'm not just saying this, even the press for the first time, and they've seen 35,000 crowds with me but I think they're even impressed. And to be honest with you, I -- I mean, we're just coming in and you're talking about miles and miles and people.","And I wish the fire department and they're great, they were wonderful, but they broke the all-time record for this building by far. And I see like, you could squeeze a couple of people from outside, but I guess you know, that's the Fire Marshals, we have to go by our Fire Marshals. Would anybody like to leave so that some more people could come in? I don't think so. I don't think -- Well, I want to thank you.","This is a great honor. You think this is easy, right? You think -- so I get up this morning, I'm like one of the early birds, like a lot of you people. Everybody's an early bird in this group I think. But I got up and I was in Dallas and last night we made a speech in Dallas, and we had an amazing crowd there too, Gilley's. We had a packed house and we had thousands of people outside that they actually thought were protesters.","They weren't. They were people that couldn't get into the venue, thousands. And then and then we went to San Antonio and we raised -- oh, we have some San Antonio -- and we raised a lot of money over the last two days for the party. The party is doing very well. The party is -- the party is actually liking me. You know, I'm an outsider.","I'm an outsider. And historically, they don't love the outsiders. But I think they're starting to like me and maybe there'll be a few -- you know you don't hear about the tremendous numbers of people. And I'm even talking about the politicians that are totally supportive. If one person raises a little question, it's like oh, did you hear?","Let me tell you, folks, we have tremendous support. Tremendous. But the biggest support of all by far, right here. I'm the messenger right here. Right here. We have -- we have support like perhaps nobody's ever had when they've run for office, certainly, at this stage, I don't think anybody's ever seen anything like this.","Some of the pundits, actually some of the pundits that hate me, they hate me with a passion, like, which is great. I mean, I love that. Oh, I love that. Look at that Mexicans for Trump. Mexicans for Trump. I love it. I love it. I love that. Thank you. Thank you. That's cool, man. And you know why it's Mexicans for Trump?","Because I'm going to bring jobs back into our country, folks. I'm going to bring jobs back into our country. And Hillary doesn't have a clue. She doesn't know about jobs. Remember this. Remember this. Her husband signed NAFTA. True. Maybe the worst economic development transaction ever signed in the history of our country.","It cleaned out our manufacturing. I mean, I just won so many states and I got to see these states. I went all over the different states in Pennsylvania, New York, all over the place and I got to see what NAFTA, the havoc that it wreaked. And it's taken our jobs just like we're a bunch of babies like we're a bunch of babies, and move them to other places.","Honestly, move them all over Mexico. We have -- we have states where they say you know I have statisticians, right? The world's most boring job but yeah, we got to do it. Somebody's got to do it. And I get numbers where certain states lost 50% and 60% of their manufacturing jobs. And you'd go upstate, like upstate New York, and you see empty factories, empty buildings, buildings that you could buy for nothing.","Buildings that have been abandoned where they left because Bill Clinton signed NAFTA, and it didn't affect him so much because he was gone. But boy, did it affect the rest of these Presidents. Let me tell you and we're going to bring our jobs back. We're not going to be the stupid people anymore, folks. We're not going to be the stupid people.","So what we have and we'll build the wall, he says build the wall. We're going to build a wall. We have to. We have to. Look, we have no choice. We have no choice. So I just got -- three weeks ago, I got the endorsement of 16,500 Border Patrol agents, right? It's the first time -- the first time they've ever endorsed a Presidential candidate, OK? And they're great people.","And by the way, they're job is much easier now. Stand back. Don't talk. Don't do this. Stand back. Much easier job. They want to do their job. They see what's happening to our country. They love our country. They want to do the job. They're not allowed to do their job. So here's what's going to happen. And I asked them.","Such incredible people. I asked them I said just you know I got to be 100% sure, do we need the wall? You said yes but they said yes also. I don't know what I would have done supposing they said no, I'd say really? What am I going to do here? But I said do we need -- and they said, Mr. Trump, it is such an unbelievably important weapon for drugs pouring through.","I mean, we have drugs pouring into our country. When I won New Hampshire. I love New Hampshire, my first victory. You know we won 37, I think, I'm going to say, I have to say, I think because if it's like 36 or 35 even if it's 38 or 39, they'll correct me. But we won New Hampshire. And when I say we, we really won it. We won it. This is all about we. This is about we, we. I'll tell you, folks.","I didn't have to do this. I didn't have to do this. This is -- I love it. I love it. I love it. But I didn't have to do -- this is like work, folks. This is like hey, you know what? Yesterday was the one-year anniversary when I announced we're going to run. Yesterday. All right, great. The one year that was the one year from yesterday.","Somebody said you know it's June 16th. I said June 16th that's when I decided to do this and it's been a great experience. Thank you, darling. Thank you. I love you. I love you. I love everybody in this room. I love everyone in this room. And you know the amazing thing -- and we all love each other. It is. I'll tell you why.","You know, you see oh, wow, somebody was protesting. The safest place to be anywhere is that a Trump rally. Believe me. The safest place. The safest place. And no matter what you say, I mean, you just take a look. Now, if there's one protester that raises the hand, although I love it, you know the only way I get the show -- because nobody has crowds like we have.","And they'll admit that not Bernie and Bernie did pretty well with the crowd. He was second, by the way, a deep, deep second. He was way back. No, don't forget. We agree with Bernie on one thing, trade. He knows how bad our trade deals are. He gets it. He gets it and that's good. Now, we're trying to get Bernie's people because a lot of those Bernie people hate Hillary Clinton, crooked Hillary as we call it. And of course, Bernie hates Hillary Clinton.","We know that that's for sure. One thing you got to say, he doesn't give up. She's going -- is he still here? Is he still here? Who would have thought that I was going to win, what, eight weeks ago? It was supposed to be the opposite way, and here we have it from eight weeks ago, and she's still out there trying to say, can we get rid of Bernie?","Is there any way? And just like she can't close that deal, folks. She won't be able to make trade deals. She won't be able to take care of our military. Everybody's going to be ripping us off as a country, OK? The same exact way and the same way that you're looking at it. So look, here's what we have to do. When I came down.","Thank you. When I came down and I said, I actually said, Oh, I thought it was a protester. I said, friend or foe? And it was a friend and I was disappointed because if it's a friend, the cameras will never go there. So that's no good. Thank you. That's called, that's called an enthusiastic friend. But just so you understand, we've had things happen to our country.","I mean World Trade Center, if you look at what happened in California recently, San Bernardino, you look at that. It's a radicalization like nobody's ever seen before. It's more -- it's a radicalization. It's a hatred. It's a hatred. It's a deep-seated hatred. And President Obama is trying to make terrorism into guns and it's not guns, folks.","Has -- it is not guns. It is not guns. This is terrorism. And by the way, the NRA came out, National Rifle Asso -- I'll tell you what. They came out very strongly probably the earliest they've ever done it. So the National Rifle Association endorsed Trump and those people are fantastic people.","You know they take a lot of heat. They love this country. They love what it represents. They're protecting your Second Amendment and nobody will protect your Second Amendment like Donald John Trump. Nobody. Nobody. Nobody. And remember this, Hillary Clinton wants to abolish the Second Amendment, essentially.","She wants to abolish the Second Amendment. She wants to take your guns away and you see things like we saw over the weekend. Remember this, if you had some of those incredible young people that were so brutally killed over the weekend or people in Paris where you have the toughest gun laws in the world, in Paris and France.","In Paris, you have the toughest gun laws in the world, 130 killed. Wounded still in the hospital, devastated, they'll never be the same. Just horribly wounded. Same thing in San Bernardino. Same thing in our military base where we had five unbelievable soldiers, one of them was a world-class marksman. It was a gun-free zone.","You know a gun-free zone oftentimes means carnage because let's call them the enemy, which is what they are, and we should declare war on ISIS. We should declare war on ISIS. We should declare war on ISIS. War. It's war. It's war. And they're poisoning our -- And they are poisoning our youth through the Internet.","They're getting people to go over there. The press calls these people masterminds at the top level. They're not masterminds, folks. They're thugs. They're sick people. And we've got to put an end to it. And if we don't we're not going to have a country left anymore. We're not going to have a country. So, so we're going to get very tough.","Our military is depleted, badly depleted. You see that. Nobody better than our military people. Nobody better than our vets. Look at the way our vets are being taken cared of. We're going to take care of our vets, folks. Who's a vet? We're going to take care of our vets. They wait on line, these are great people, our greatest people.","They wait on line four, five, six, and seven days, and they die. They die waiting to see a doctor for a routine ailment, a routine ailment, and they're waiting five, six, seven days, and you see what's happening. You see what's happening. It's like Hillary. It's a corrupt enterprise, OK? It's a corrupt enterprise.","And we're going to straighten that out. We're going to make sure they get very quick and very good care. And if they can't see a doctor, we're going to have them go across the street to a hospital, to a private doctor, to a public hospital, who cares? And we're going to pay the bill. We're going to pay that bill.","And you know what? That's less expensive, by the way, that's less expensive than what we're doing right now. And you look at the number of deaths. So we're going to take care very much so we're going to take care of our veterans and that's -- and I'm the one for the first time in decades, our veterans are going to be treated like they should be treated.","They're going to be treated great. Wow. My friends, my friends. So I have in the front row and I just see some of the greatest people, some of the greatest people. These are people who lost loved ones. These are my friends. These are my friends. And they called me right after my announcement and they said, Thank you, Mr. Trump.","Nobody else has thought of them. These are people that lost loved ones to people that should not have been in the country. And I want to just thank you all. Sweetheart, thank you. Thank you, darling. Thank you. Thank you. Thank you. Look at this sign. Hold that up. Look at that sign. Wow. Whoa. Gays for Trump.","Gays for Trump. Well, look, Hillary Clinton, crooked Hillary takes tens of millions of dollars into her Foundation, Foundation. Takes tens of millions of dollars from countries that kill gays and that enslave women. And I will tell you, I am far better for women, I am far better for gays, and now she wants people from these countries to come into the United States and I was saying at a 500% greater clip than Obama and the press said I was wrong.","Guess what? It was 550%. It was more, 550% more than Obama coming in. And many of these countries, they want to kill gays and they enslave women. And Hillary Clinton wants them pouring in. You tell me, who's better for gays? Who is better? Tell me. Who is better for women? Who is better for women? And what happened to the LGBT community over the weekend?","To what happened there and remember this, remember this. Before we get off to the next subject which is going to be a very interesting subject for you, folks. But don't we feel bad for that 10, 15, 20. How many people are outside press, how many? Is it 10,000 or 20,000? Because I'll tell you what, I think is closer to 20,000, anyway, anyway, anyway, if we had -- If we had people where the bullets were going in the opposite direction, right smack between the eyes of this maniac, if some of those wonderful people had guns strapped right here, right to their waist or right to their ankle, and this son of a bitch comes out and starts shooting, and one of the people in that room happened to have it and goes boom, boom.","You know what? That would have been a beautiful, beautiful sight, folks. That would have been a beautiful, beautiful sight. So don't let them take your guns away. And believe me, you put me in there, we're going to save that Second Amendment, we're going to save you guns. They're not going to take away your bullets.","They're not going to shorten up your magazines. They're not going to do anything. We're going to preserve it. And we're going to cherish it. And that's what we have to do. Now, remember this. So we have a -- I love you. Look at this guy, he keeps shouting. He loves -- you love me, right? Hey, you know what?","He's a guy but I love him, OK? He's a guy but I love him. That's cool, man. All right. So look, we have a lot of things happening. One of the things is by circumstance, we lost a great justice, Scalia. And on the Supreme Court, we're going to have probably three picks. But it could be four, it could even be five.","It could be a record in the history of the Supreme Court for a four-year term. And if Hillary gets in there and puts these horrendous picks in the Supreme Court, folks, we are like Venezuela. You see what's happening to Venezuela, right? You see what's happening. We will be a large scale version of Venezuela.","And it's not going to be pretty. One of the reasons, I hope you are with me, and I know every -- Is there anybody in this room that's not going to vote for Trump? Just out of curiosity. Nobody. Wow. USA. USA. Amazing. Amazing. OK, so ready? So one of the most -- look defense is always the most important, right?","You know defense is always but I will pick great, smart, brilliant, conservative intellects, great judges, and what I've done is we went to the Federalist Society where they really -- and also with the Auspices of Heritage, which is a great group. And we picked 11 judges, we're going to probably put three or four more on there.","But we picked 11 great, great judges. And I said from this group or very similar to this group, we are going to pick judges for the United States Supreme Court, and you're going to be proud of those judges, and they're going to be terrific. Hopefully, very much in the mold of Judge Scalia. That's what we want to do, OK? So, so I just think it's so important.","The defense of our country. We have to build up our military. We have to take care of our vets. We have to do all these things but we have to pick great justices for the Supreme Court. And if we don't, we're not going to have a country anymore. We're not going to have a country. So it's so important. And a lot of people forget.","They say, oh well, this and that, so important. One of the most important thing. OK, so ready? We need borders, right? We need borders. We need borders. And he was saying just a little while ago, the wall, and we're going to have the wall, and we're going to have a wall, it's going to be such a beautiful wall.","It's gonna be so big. It's going to be so powerful. It's going to be as beautiful as a wall can be. I've got to make it beautiful because maybe someday they'll name the wall, the Trump Wall. Who the hell knows? Who the hell knows? But folks we have to have it. And the Border Patrol said, Mr. Trump, you need it. Look here's the story.","We need borders. We don't have borders right now. We need borders. We either have a country or we don't. We don't have borders, we don't have a country, all right? And people are pouring in and we need this. But we also need it for drugs. When I was up in New Hampshire, I was going to say, I spent a great deal of time there, and I got to know the people.","And it's a beautiful state. Incredible. The beautiful lakes and rivers and roadways and the trees and everything. And I'd sit with a group and I'd say, what's the big problem in New Hampshire? They said heroin. I said heroin? It doesn't work. I mean, it doesn't fit with everything, the beauty. And it turned out to be a massive, massive, massive problem for New Hampshire.","And then, I went to South Carolina, I went to Massachusetts, I went all over the place, no matter where I went, heroin, and drugs that pour across the Southern Border. And I said to the people of New Hampshire, my first victory, I love them. I love them. I said to the people of New Hampshire, look, if I get elected we're going to solve your problem.","We're going to try and get your youth, and it's not only youth, it's beyond youth. But we're going to try and get people help them. We're going to help them. We've got to make them better. We got to get them off it. It's not easy. We're going to work like hell to get them off this horrible stuff that's flowing in and it's cheaper than candy.","It's cheaper than candy because there's so much of it. It pours in because our leadership, our President doesn't have a damn clue what the hell he's doing and our youth are being poisoned. They're being poisoned. And the wall will be done and you know interestingly, when I was talking to certain politicians, they said you don't really build a wall.","I mean, you can't really build a wall. Well, we have 2,000 miles, we actually need 1,000 even less than that because we have a lot of natural barriers, right? Big, strong, wonderful, natural barriers. So we need 1,000 miles. The Great Wall of China is 13,000 miles long and it was built 2,000 years ago, folks, 2,000 years ago and they didn't have Caterpillar tractors just so you understand.","You know to the best of my knowledge they didn't have -- and we will not use Komatsu. We will use Caterpillar, OK? We will use Caterpillar. We're not using Komatsu. You know I used to tell the story and I could see what was happening. I don't know if you saw. Two days ago it was announced that our trade deficit, our trade deficit is the largest it's been in seven years, OK? Now think of that.","How sad. And here I am for years saying, our trade, our trade, our trade, and the arrogance. They don't listen. They don't listen to me. They have to listen to me, right? Because I'm representing a lot of people, folks. So we have the largest trade deficit we've had in many, many years. And that's why I mentioned the name Komatsu, right?","And a friend of mine -- this is two years ago now. I used to tell this story. I haven't told it but he's an excavator, a great excavator, big. And I see him and he's very sad, and I say why are you very sad? He's a rough guy, doesn't get too sad, but he gets sad. He's rough. Most excavators are pretty rough, right?","You know, these are not -- these are not babies. But let's say this, he's as sad as an excavator can be, right? But he said to me Donald, I just ordered Komatsus. I said really, why? He said because Japan has devalued their currency to such an extent -- and he always bought Caterpillar tractors, his whole life, he bought Caterpillar, and they couldn't compete, only for one reason because Japan has brilliantly devalued, devalued, devalued, and he went on made a very, very large order of Komatsu.","I say are they as good? He said no but they're very good. They're very good high-quality equipment but not as good. But good enough and quite good. And I said so what do you think? He said our country's in trouble. And I started telling this story two years ago and if you think about it, I really predicted exactly what was going to happen because look at what's going on. We're losing our jobs like crazy.","The reason I won Indiana was largely, well, it was because of Bobby Knight. I mean, Bobby Knight, you know, Bobby Knight and some other great folks. I want to tell you. And I think we would've won very big anyway, but boy did we win in a big landslide. But you know what? That was right in the time when everybody was talking about Carrier air conditioner moving to Mexico firing 1,400 people.","And those people were following me around that week in Indiana. They came from Indianapolis and Carrier had a big plant, and they said, we're closing it folks, and remember it was on all over television. We're closing it. We're moving to Mexico. Now, I don't blame Mexico. I don't blame Mexico and I don't blame China for ripping us off, and they are ripping us, big league, right?","Biggest trade deficits in the history of the world with China. We have rebuilt China. I don't hold it against them at all. Not all. I don't hold it against China. I don't hold it against Japan. I don't hold it against Mexico or Vietnam or India or any other country that's killing us on trade, that's taking our jobs.","I don't hold it against them. I hold it against our leaders for being grossly incompetent. They're incompetent and when they want to take our companies out of our country, there's going to be a price to be paid. There's going to be consequences. No more folks, no more, no more, no more empty factories that sit there and rot like all over Pennsylvania, all over New York state, all over Maryland.","I'm looking at these places, you wouldn't believe what you see, and you could see 20, 25 years ago thriving, thriving enterprises, and now they're rotted from the water and from the wind. So we're going to do things, folks, and we're going to be the smart people again. You know a lot of the Republicans have said to me, and they said you know, you are not conservative.","And the reason -- I imitate somebody, he said you are not a conservative because you don't believe in free trade. OK, who cares? Let me tell you. Folks, folks, let me tell you. Number one, I'm Republican. Number two, I happen to be -- I happen to be conservative, but, but more importantly, I was asked by one of the networks recently, so what is your status?","You know to be a conservative you're supposed to believe in free trade, goes across the border. But we don't have free trade. People think we do because they're stupid people. We don't have free trade. With China, with China, they dump their product all over the place, they're dumping steels, and ruining our steel mills.","They're ruining our steel mills. Obama's closing up our coal miners in our mines. So you got -- you got miners all over the place, and you know what? I went into West Virginia, we won West Virginia in a landslide because the miners know that I'm going to put the miners back to work. We're going to put the steelworkers back to work.","We're going to put them back to work. And we're going to put them back fast. But I don't blame these countries. What I do is I blame our inadequate leadership and it's almost hard to believe that this can be happening when you look at what's going on with our country. Now, here's what we're going to do. Let's take the clip -- and I could talk about Ford, I can talk about Carrier, I can talk about hundreds of different companies that are no longer here.","They're no longer here. And here's the story, folks. I believe in free trade, OK? That's official. But here's the problem with free trade. We need smart leaders to make free trade work. And we have leaders that are not smart. In fact, they're rather stupid, I must say. They're rather stupid. So I was asked on a program the other day, recently, they said do you believe in free trade?","I said yeah, I do. Do you believe in fair trade? Yeah, I do. I believe in trade. Well, what kind of trade do you like the best? I said here's my trade. I want to make great deals. That's what it is, for the people, for this country. I don't care if it's free trade, I don't care if it's fair. It doesn't make any difference.","I want my trade deal. I want to make good deals for you. And I have the greatest negotiators in the world. We have Carl Icahn. I've gotten endorsed by the big business leaders. They love Trump. What can I tell you? But I have such great endorsements. I have -- we have the greatest negotiators in the world in our country and we don't use them to make these deals that are bigger than any company's deals.","These are the biggest deals, deals with China, deals with Japan and Mexico. These are the biggest deals in the world, folks and we use political lightweights, political hacks that don't know what they're doing. And China looks at us and they can't believe how stupid we are. They can't believe they get away with it for years.","It's amazing that the country, not so well, but that the country functions. It's amazing. So we're going to change all of that and when we came down, remember, when I started this journey. When I started this journey, it was about illegal immigration and these are my friends right here and they've lost big league, big league, the biggest, they've lost the biggest.","All of my friends. Unbelievable people. They've lost the biggest. But when I came down it was about illegal immigration. And it was about trade. And it was about a strong military. But basically, it was about illegal immigration and trade and bringing our jobs back. Then we had Paris happen and we had other things happen whether it's San Bernardino or so many others.","And I started saying, well, we got to toughen up this country. We have to be very, very smart and very strong and very vigilant, and we have to get people when they see there are bombs all over the floor of an apartment. They have to report these people to the authorities and they have to report them fast.","They have to report them fast. No more games. You know, the leader of the Paris attack they couldn't find him. Do you remember? And it was almost a year. Do you know where he lived? Right next to where he was living for years. Everybody knew he was there. Nobody reported him. They found him through luck.","Nobody reported him. San Bernardino, they see all these bombs all over the floor. They say, oh well, you know not to normal that bombs all over your apartment floor, right? People saw it. This maniac over the weekend, look at his record, people saw what he was doing. First of all his wife knew. I think his father knew.","I think a lot of people knew. And they didn't report him and we have now 50 young people, we have 50 people dead. We have a tremendous number of people badly, horribly, gravely injured. They didn't report them. They knew he was going to go. They knew he was going to explode. Nobody reported him. Nobody. They have to report and I've been saying it for two weeks, big league.","And now all of a sudden people are saying report, they're saying report. OK, so here's one other thing, folks. We have a country that's bust, right? We have a country that's bust. We protect Japan. We protect Germany. We protect Saudi Arabia. We protect South Korea. We protect all these countries and they don't pay us what it costs.","They don't pay us. We're losing a fortune. We have to go to those countries which are wonderful countries. We have to say we need help. Now, Hillary said how dare Donald Trump say that. He wants to abandon Japan. I don't want to abandon Japan. Now, here's the problem with what she said. By her saying that you can never make a good deal because she's saying under no circumstances, folks, we have to be prepared to walk.","I don't want to walk. Hopefully, we're not going to walk. But if you don't say you're going to walk or if you're not prepared to walk, you're never going to get them to pay. We are losing billions and billions and billions of dollars protecting very strong financial behemoths. South Korea, how about Saudi Arabia?","Saudi Arabia was making $1 billion a day when the oil was high. Now, they're still making a fortune. If we weren't there, Saudi Arabia wouldn't be there for two weeks, OK? We protect Saudi Arabia. We pay rent, we pay rent on facilities that we have. We pay rent and we're protected. With Japan, with our Japan treaty, if the United States gets attacked they can watch the attack on Sony television and never do a thing.","If they get attacked, we have to use the full force of our armed forces to protect them, OK? Who makes these deals? Who makes these deals? Who makes these deals? So what I'm saying is this. I have to go. My favorite. So I get asked by a very good commentator, what do you think of NATO? Now in all fairness, I've been doing deals all my life, I do you know, I built this great company and all that stuff and I do deals.","Nobody talks about NATO. I mean in all fairness, I'd like to say I have great experience with NATO. But I do have a lot of common sense and I do have a lot of business instinct like some of my friends that are here. So the question is what do you think of NATO? So I say to myself, the first thing is nobody's ever asked me this before.","Second thing is well, I said this, I said number one, I believe it's obsolete. You know, set up many, many years ago about the Soviet Union. Soviet Union doesn't exist now it's Russia, but Russia's still a big threat. It's OK for Russia. The problem is, the problem is that our new threat is terrorism, and NATO wasn't really set up for terrorism.","They don't even have the right countries, all right? So I said it's obsolete because it doesn't take care and take into account terrorism. Number two, all of these countries, well, a lot of them don't pay. You know in the real estate business -- I have some friends that are in real estate here. They call it, they're delinquent, right?","They're delinquent. They didn't pay their rent. These people didn't pay. Now, we're protecting them, probably end up in third world war by protecting these countries. They don't even pay or they pay us a fraction or they pay us much less than they've agreed to pay us because nobody asked them for money. In the meantime, we have the highest taxes in the world, we have budget deficits that are through the roof, and by the way, speaking of that I'm lowering your taxes, lower than any other candidate by far, by far, and we're getting rid of these horrible, horrible regulations that are killing people, and killing small businesses.","We're getting rid of so many of them, so many of them. So I said, so I said it's obsolete they don't take care of terrorism and they're not paying up. They got to pay up and it turned out I was right on both counts but I'll never forget. The first three or four days, Donald Trump didn't know anything about NATO.","I said why? three or four days later, all of a sudden people that studied it very closely that never studied anything, like they have blinders on, right? They can't see the forest for the trees, right? You know the expression. They can't see the forest for the trees. All of a sudden, three or four days later, people are saying he's brilliant.","He's right. He's -- like Putin. Putin called me brilliant. I like it. They want me to disavow. Putin said Donald Trump is brilliant. Essentially, he'll be the next leader but Donald Trump is brilliant. And the people I was debating against they said, we would like you to disavow that statement. And I said do you think I'm going to disavow that statement?","Are you crazy? So with NATO. So I went three days -- and the press was just absolutely brutal, like, I didn't know what the hell I'm talking about, give me a break. Then three or four days later, the experts are starting to say, you know huh, Trump is sort of right. It's obsolete. These are people that study it eight hours a day.","They study it and they say you know, Trump can be right and he's right also, they're not paying up. They're not paying up. They owe us a lot of money, many of these countries. OK. Now, here's what happens. About seven days ago, front page of The Wall Street Journal. Big, big story, NATO to set up major terrorism unit General so and so to be the head of it. I said that's what I said.","Now, they don't give me credit for that. You know they had a little sentence, like, a little one-third sentence, Donald Trump wasn't happy about it. Oh, great. Great. Folks, our country has such incredible potential. We have such incredible potential. There are so many pockets of fat. There are so many pockets of stupidity.","We can bring our country back bigger and better and stronger than ever before. I'm telling you. Just on the military and I said this, I said again, you have to always be prepared to walk. But just in the military, I said look, we want to help Japan. We want to be a great ally to Japan. We'll always be friends with Japan.","But you know they got to help us. They sent -- Obama sent a General out and he said doesn't Donald Trump -- No, this is true. I promise. Doesn't Donald Trump know that Japan covers 50% of the cost of the military? I said why don't they cover 100% of the cost of the -- Why? Why? Why? Now you know, if he said 50%, the number is probably 25% or 20%, OK? Folks, we're like the country, and so true, that's being led by the dumb people.","It's not going to happen anymore, folks. It's America first. It's America first. It's America first. And we're going to get it going and we're going to get it going like it hasn't been going in many, many years. I really mean it. You know my theme, I see all these hats, Make America Great Again, white, red, camel, black, all of these hats.","But we're going to -- you know the theme is Make America Great Again. I honestly believe, it will be Make America Great Again, make America safe again, safe. And I really believe, I really, really believe that our country can be greater than ever before. I know the people. These are unbelievable -- you. These are unbelievable people.","And folks, we don't win anymore, right? We don't win anymore. We don't win. We don't win with anything. We don't win on trade. We don't win with the military. We're going to knock the hell out of ISIS, by the way, we have no choice. We have no choice. We have no choice but we're going to start winning again.","We're going to win so much you people are going to get sick of it. You're going to come up and they're going to call me from Texas, Mr. Trump, sir, you have thousands and thousands of calls from Texas. They're all your friends. They heard you speak one night. Mr. Trump, they're very upset. President Trump, they're very upset.","They're going to walk in and they're going to say, go ahead. What the hell difference -- they're going to walk in. They're going to say, President Trump, thousands and thousands of calls from Texas. They are so upset with you Mr. President. They can't stand the amount with which you're winning by everything is a win.","You're winning on trade. You're winning at the border. You're winning with your military. You're winning on healthcare. We're going to repeal that. It's horrible stuff, and replace it. Mr. President, sir. You're winning with Common Core. You're going to end it and bring education local. Mr. President, sir.","They can't believe you've saved the Second Amendment 100%, and Mr. President, the people of Texas do not want you to win so much. It's driving them crazy. And I'm going to say, tell the people of Texas that I love them. But we're going to continue to win. We're going to win so much. We're going to Make America Great Again. I love you. Thank you all. I love you. Thank you. Thank you."],"text":" We live all over the place. We live all over the place. Wow, what a group. Oh, thank you. Thank you. I love you. We love taxes. I love you. I love you, Texas. Man, thank you. Wow. Thank you, everybody. Somebody asked me how do you think you're going to do in Texas? I think we're going to do very well in Texas, right? We're going to do very well. So I have to say this and you know, you have to see what's going on outside. There are lines that are two, two miles long. I don't know and I'm not just saying this, even the press for the first time, and they've seen 35,000 crowds with me but I think they're even impressed. And to be honest with you, I -- I mean, we're just coming in and you're talking about miles and miles and people. And I wish the fire department and they're great, they were wonderful, but they broke the all-time record for this building by far. And I see like, you could squeeze a couple of people from outside, but I guess you know, that's the Fire Marshals, we have to go by our Fire Marshals. Would anybody like to leave so that some more people could come in? I don't think so. I don't think -- Well, I want to thank you. This is a great honor. You think this is easy, right? You think -- so I get up this morning, I'm like one of the early birds, like a lot of you people. Everybody's an early bird in this group I think. But I got up and I was in Dallas and last night we made a speech in Dallas, and we had an amazing crowd there too, Gilley's. We had a packed house and we had thousands of people outside that they actually thought were protesters. They weren't. They were people that couldn't get into the venue, thousands. And then and then we went to San Antonio and we raised -- oh, we have some San Antonio -- and we raised a lot of money over the last two days for the party. The party is doing very well. The party is -- the party is actually liking me. You know, I'm an outsider. I'm an outsider. And historically, they don't love the outsiders. But I think they're starting to like me and maybe there'll be a few -- you know you don't hear about the tremendous numbers of people. And I'm even talking about the politicians that are totally supportive. If one person raises a little question, it's like oh, did you hear? Let me tell you, folks, we have tremendous support. Tremendous. But the biggest support of all by far, right here. I'm the messenger right here. Right here. We have -- we have support like perhaps nobody's ever had when they've run for office, certainly, at this stage, I don't think anybody's ever seen anything like this. Some of the pundits, actually some of the pundits that hate me, they hate me with a passion, like, which is great. I mean, I love that. Oh, I love that. Look at that Mexicans for Trump. Mexicans for Trump. I love it. I love it. I love that. Thank you. Thank you. That's cool, man. And you know why it's Mexicans for Trump? Because I'm going to bring jobs back into our country, folks. I'm going to bring jobs back into our country. And Hillary doesn't have a clue. She doesn't know about jobs. Remember this. Remember this. Her husband signed NAFTA. True. Maybe the worst economic development transaction ever signed in the history of our country. It cleaned out our manufacturing. I mean, I just won so many states and I got to see these states. I went all over the different states in Pennsylvania, New York, all over the place and I got to see what NAFTA, the havoc that it wreaked. And it's taken our jobs just like we're a bunch of babies like we're a bunch of babies, and move them to other places. Honestly, move them all over Mexico. We have -- we have states where they say you know I have statisticians, right? The world's most boring job but yeah, we got to do it. Somebody's got to do it. And I get numbers where certain states lost 50% and 60% of their manufacturing jobs. And you'd go upstate, like upstate New York, and you see empty factories, empty buildings, buildings that you could buy for nothing. Buildings that have been abandoned where they left because Bill Clinton signed NAFTA, and it didn't affect him so much because he was gone. But boy, did it affect the rest of these Presidents. Let me tell you and we're going to bring our jobs back. We're not going to be the stupid people anymore, folks. We're not going to be the stupid people. So what we have and we'll build the wall, he says build the wall. We're going to build a wall. We have to. We have to. Look, we have no choice. We have no choice. So I just got -- three weeks ago, I got the endorsement of 16,500 Border Patrol agents, right? It's the first time -- the first time they've ever endorsed a Presidential candidate, OK? And they're great people. And by the way, they're job is much easier now. Stand back. Don't talk. Don't do this. Stand back. Much easier job. They want to do their job. They see what's happening to our country. They love our country. They want to do the job. They're not allowed to do their job. So here's what's going to happen. And I asked them. Such incredible people. I asked them I said just you know I got to be 100% sure, do we need the wall? You said yes but they said yes also. I don't know what I would have done supposing they said no, I'd say really? What am I going to do here? But I said do we need -- and they said, Mr. Trump, it is such an unbelievably important weapon for drugs pouring through. I mean, we have drugs pouring into our country. When I won New Hampshire. I love New Hampshire, my first victory. You know we won 37, I think, I'm going to say, I have to say, I think because if it's like 36 or 35 even if it's 38 or 39, they'll correct me. But we won New Hampshire. And when I say we, we really won it. We won it. This is all about we. This is about we, we. I'll tell you, folks. I didn't have to do this. I didn't have to do this. This is -- I love it. I love it. I love it. But I didn't have to do -- this is like work, folks. This is like hey, you know what? Yesterday was the one-year anniversary when I announced we're going to run. Yesterday. All right, great. The one year that was the one year from yesterday. Somebody said you know it's June 16th. I said June 16th that's when I decided to do this and it's been a great experience. Thank you, darling. Thank you. I love you. I love you. I love everybody in this room. I love everyone in this room. And you know the amazing thing -- and we all love each other. It is. I'll tell you why. You know, you see oh, wow, somebody was protesting. The safest place to be anywhere is that a Trump rally. Believe me. The safest place. The safest place. And no matter what you say, I mean, you just take a look. Now, if there's one protester that raises the hand, although I love it, you know the only way I get the show -- because nobody has crowds like we have. And they'll admit that not Bernie and Bernie did pretty well with the crowd. He was second, by the way, a deep, deep second. He was way back. No, don't forget. We agree with Bernie on one thing, trade. He knows how bad our trade deals are. He gets it. He gets it and that's good. Now, we're trying to get Bernie's people because a lot of those Bernie people hate Hillary Clinton, crooked Hillary as we call it. And of course, Bernie hates Hillary Clinton. We know that that's for sure. One thing you got to say, he doesn't give up. She's going -- is he still here? Is he still here? Who would have thought that I was going to win, what, eight weeks ago? It was supposed to be the opposite way, and here we have it from eight weeks ago, and she's still out there trying to say, can we get rid of Bernie? Is there any way? And just like she can't close that deal, folks. She won't be able to make trade deals. She won't be able to take care of our military. Everybody's going to be ripping us off as a country, OK? The same exact way and the same way that you're looking at it. So look, here's what we have to do. When I came down. Thank you. When I came down and I said, I actually said, Oh, I thought it was a protester. I said, friend or foe? And it was a friend and I was disappointed because if it's a friend, the cameras will never go there. So that's no good. Thank you. That's called, that's called an enthusiastic friend. But just so you understand, we've had things happen to our country. I mean World Trade Center, if you look at what happened in California recently, San Bernardino, you look at that. It's a radicalization like nobody's ever seen before. It's more -- it's a radicalization. It's a hatred. It's a hatred. It's a deep-seated hatred. And President Obama is trying to make terrorism into guns and it's not guns, folks. Has -- it is not guns. It is not guns. This is terrorism. And by the way, the NRA came out, National Rifle Asso -- I'll tell you what. They came out very strongly probably the earliest they've ever done it. So the National Rifle Association endorsed Trump and those people are fantastic people. You know they take a lot of heat. They love this country. They love what it represents. They're protecting your Second Amendment and nobody will protect your Second Amendment like Donald John Trump. Nobody. Nobody. Nobody. And remember this, Hillary Clinton wants to abolish the Second Amendment, essentially. She wants to abolish the Second Amendment. She wants to take your guns away and you see things like we saw over the weekend. Remember this, if you had some of those incredible young people that were so brutally killed over the weekend or people in Paris where you have the toughest gun laws in the world, in Paris and France. In Paris, you have the toughest gun laws in the world, 130 killed. Wounded still in the hospital, devastated, they'll never be the same. Just horribly wounded. Same thing in San Bernardino. Same thing in our military base where we had five unbelievable soldiers, one of them was a world-class marksman. It was a gun-free zone. You know a gun-free zone oftentimes means carnage because let's call them the enemy, which is what they are, and we should declare war on ISIS. We should declare war on ISIS. We should declare war on ISIS. War. It's war. It's war. And they're poisoning our -- And they are poisoning our youth through the Internet. They're getting people to go over there. The press calls these people masterminds at the top level. They're not masterminds, folks. They're thugs. They're sick people. And we've got to put an end to it. And if we don't we're not going to have a country left anymore. We're not going to have a country. So, so we're going to get very tough. Our military is depleted, badly depleted. You see that. Nobody better than our military people. Nobody better than our vets. Look at the way our vets are being taken cared of. We're going to take care of our vets, folks. Who's a vet? We're going to take care of our vets. They wait on line, these are great people, our greatest people. They wait on line four, five, six, and seven days, and they die. They die waiting to see a doctor for a routine ailment, a routine ailment, and they're waiting five, six, seven days, and you see what's happening. You see what's happening. It's like Hillary. It's a corrupt enterprise, OK? It's a corrupt enterprise. And we're going to straighten that out. We're going to make sure they get very quick and very good care. And if they can't see a doctor, we're going to have them go across the street to a hospital, to a private doctor, to a public hospital, who cares? And we're going to pay the bill. We're going to pay that bill. And you know what? That's less expensive, by the way, that's less expensive than what we're doing right now. And you look at the number of deaths. So we're going to take care very much so we're going to take care of our veterans and that's -- and I'm the one for the first time in decades, our veterans are going to be treated like they should be treated. They're going to be treated great. Wow. My friends, my friends. So I have in the front row and I just see some of the greatest people, some of the greatest people. These are people who lost loved ones. These are my friends. These are my friends. And they called me right after my announcement and they said, Thank you, Mr. Trump. Nobody else has thought of them. These are people that lost loved ones to people that should not have been in the country. And I want to just thank you all. Sweetheart, thank you. Thank you, darling. Thank you. Thank you. Thank you. Look at this sign. Hold that up. Look at that sign. Wow. Whoa. Gays for Trump. Gays for Trump. Well, look, Hillary Clinton, crooked Hillary takes tens of millions of dollars into her Foundation, Foundation. Takes tens of millions of dollars from countries that kill gays and that enslave women. And I will tell you, I am far better for women, I am far better for gays, and now she wants people from these countries to come into the United States and I was saying at a 500% greater clip than Obama and the press said I was wrong. Guess what? It was 550%. It was more, 550% more than Obama coming in. And many of these countries, they want to kill gays and they enslave women. And Hillary Clinton wants them pouring in. You tell me, who's better for gays? Who is better? Tell me. Who is better for women? Who is better for women? And what happened to the LGBT community over the weekend? To what happened there and remember this, remember this. Before we get off to the next subject which is going to be a very interesting subject for you, folks. But don't we feel bad for that 10, 15, 20. How many people are outside press, how many? Is it 10,000 or 20,000? Because I'll tell you what, I think is closer to 20,000, anyway, anyway, anyway, if we had -- If we had people where the bullets were going in the opposite direction, right smack between the eyes of this maniac, if some of those wonderful people had guns strapped right here, right to their waist or right to their ankle, and this son of a bitch comes out and starts shooting, and one of the people in that room happened to have it and goes boom, boom. You know what? That would have been a beautiful, beautiful sight, folks. That would have been a beautiful, beautiful sight. So don't let them take your guns away. And believe me, you put me in there, we're going to save that Second Amendment, we're going to save you guns. They're not going to take away your bullets. They're not going to shorten up your magazines. They're not going to do anything. We're going to preserve it. And we're going to cherish it. And that's what we have to do. Now, remember this. So we have a -- I love you. Look at this guy, he keeps shouting. He loves -- you love me, right? Hey, you know what? He's a guy but I love him, OK? He's a guy but I love him. That's cool, man. All right. So look, we have a lot of things happening. One of the things is by circumstance, we lost a great justice, Scalia. And on the Supreme Court, we're going to have probably three picks. But it could be four, it could even be five. It could be a record in the history of the Supreme Court for a four-year term. And if Hillary gets in there and puts these horrendous picks in the Supreme Court, folks, we are like Venezuela. You see what's happening to Venezuela, right? You see what's happening. We will be a large scale version of Venezuela. And it's not going to be pretty. One of the reasons, I hope you are with me, and I know every -- Is there anybody in this room that's not going to vote for Trump? Just out of curiosity. Nobody. Wow. USA. USA. Amazing. Amazing. OK, so ready? So one of the most -- look defense is always the most important, right? You know defense is always but I will pick great, smart, brilliant, conservative intellects, great judges, and what I've done is we went to the Federalist Society where they really -- and also with the Auspices of Heritage, which is a great group. And we picked 11 judges, we're going to probably put three or four more on there. But we picked 11 great, great judges. And I said from this group or very similar to this group, we are going to pick judges for the United States Supreme Court, and you're going to be proud of those judges, and they're going to be terrific. Hopefully, very much in the mold of Judge Scalia. That's what we want to do, OK? So, so I just think it's so important. The defense of our country. We have to build up our military. We have to take care of our vets. We have to do all these things but we have to pick great justices for the Supreme Court. And if we don't, we're not going to have a country anymore. We're not going to have a country. So it's so important. And a lot of people forget. They say, oh well, this and that, so important. One of the most important thing. OK, so ready? We need borders, right? We need borders. We need borders. And he was saying just a little while ago, the wall, and we're going to have the wall, and we're going to have a wall, it's going to be such a beautiful wall. It's gonna be so big. It's going to be so powerful. It's going to be as beautiful as a wall can be. I've got to make it beautiful because maybe someday they'll name the wall, the Trump Wall. Who the hell knows? Who the hell knows? But folks we have to have it. And the Border Patrol said, Mr. Trump, you need it. Look here's the story. We need borders. We don't have borders right now. We need borders. We either have a country or we don't. We don't have borders, we don't have a country, all right? And people are pouring in and we need this. But we also need it for drugs. When I was up in New Hampshire, I was going to say, I spent a great deal of time there, and I got to know the people. And it's a beautiful state. Incredible. The beautiful lakes and rivers and roadways and the trees and everything. And I'd sit with a group and I'd say, what's the big problem in New Hampshire? They said heroin. I said heroin? It doesn't work. I mean, it doesn't fit with everything, the beauty. And it turned out to be a massive, massive, massive problem for New Hampshire. And then, I went to South Carolina, I went to Massachusetts, I went all over the place, no matter where I went, heroin, and drugs that pour across the Southern Border. And I said to the people of New Hampshire, my first victory, I love them. I love them. I said to the people of New Hampshire, look, if I get elected we're going to solve your problem. We're going to try and get your youth, and it's not only youth, it's beyond youth. But we're going to try and get people help them. We're going to help them. We've got to make them better. We got to get them off it. It's not easy. We're going to work like hell to get them off this horrible stuff that's flowing in and it's cheaper than candy. It's cheaper than candy because there's so much of it. It pours in because our leadership, our President doesn't have a damn clue what the hell he's doing and our youth are being poisoned. They're being poisoned. And the wall will be done and you know interestingly, when I was talking to certain politicians, they said you don't really build a wall. I mean, you can't really build a wall. Well, we have 2,000 miles, we actually need 1,000 even less than that because we have a lot of natural barriers, right? Big, strong, wonderful, natural barriers. So we need 1,000 miles. The Great Wall of China is 13,000 miles long and it was built 2,000 years ago, folks, 2,000 years ago and they didn't have Caterpillar tractors just so you understand. You know to the best of my knowledge they didn't have -- and we will not use Komatsu. We will use Caterpillar, OK? We will use Caterpillar. We're not using Komatsu. You know I used to tell the story and I could see what was happening. I don't know if you saw. Two days ago it was announced that our trade deficit, our trade deficit is the largest it's been in seven years, OK? Now think of that. How sad. And here I am for years saying, our trade, our trade, our trade, and the arrogance. They don't listen. They don't listen to me. They have to listen to me, right? Because I'm representing a lot of people, folks. So we have the largest trade deficit we've had in many, many years. And that's why I mentioned the name Komatsu, right? And a friend of mine -- this is two years ago now. I used to tell this story. I haven't told it but he's an excavator, a great excavator, big. And I see him and he's very sad, and I say why are you very sad? He's a rough guy, doesn't get too sad, but he gets sad. He's rough. Most excavators are pretty rough, right? You know, these are not -- these are not babies. But let's say this, he's as sad as an excavator can be, right? But he said to me Donald, I just ordered Komatsus. I said really, why? He said because Japan has devalued their currency to such an extent -- and he always bought Caterpillar tractors, his whole life, he bought Caterpillar, and they couldn't compete, only for one reason because Japan has brilliantly devalued, devalued, devalued, and he went on made a very, very large order of Komatsu. I say are they as good? He said no but they're very good. They're very good high-quality equipment but not as good. But good enough and quite good. And I said so what do you think? He said our country's in trouble. And I started telling this story two years ago and if you think about it, I really predicted exactly what was going to happen because look at what's going on. We're losing our jobs like crazy. The reason I won Indiana was largely, well, it was because of Bobby Knight. I mean, Bobby Knight, you know, Bobby Knight and some other great folks. I want to tell you. And I think we would've won very big anyway, but boy did we win in a big landslide. But you know what? That was right in the time when everybody was talking about Carrier air conditioner moving to Mexico firing 1,400 people. And those people were following me around that week in Indiana. They came from Indianapolis and Carrier had a big plant, and they said, we're closing it folks, and remember it was on all over television. We're closing it. We're moving to Mexico. Now, I don't blame Mexico. I don't blame Mexico and I don't blame China for ripping us off, and they are ripping us, big league, right? Biggest trade deficits in the history of the world with China. We have rebuilt China. I don't hold it against them at all. Not all. I don't hold it against China. I don't hold it against Japan. I don't hold it against Mexico or Vietnam or India or any other country that's killing us on trade, that's taking our jobs. I don't hold it against them. I hold it against our leaders for being grossly incompetent. They're incompetent and when they want to take our companies out of our country, there's going to be a price to be paid. There's going to be consequences. No more folks, no more, no more, no more empty factories that sit there and rot like all over Pennsylvania, all over New York state, all over Maryland. I'm looking at these places, you wouldn't believe what you see, and you could see 20, 25 years ago thriving, thriving enterprises, and now they're rotted from the water and from the wind. So we're going to do things, folks, and we're going to be the smart people again. You know a lot of the Republicans have said to me, and they said you know, you are not conservative. And the reason -- I imitate somebody, he said you are not a conservative because you don't believe in free trade. OK, who cares? Let me tell you. Folks, folks, let me tell you. Number one, I'm Republican. Number two, I happen to be -- I happen to be conservative, but, but more importantly, I was asked by one of the networks recently, so what is your status? You know to be a conservative you're supposed to believe in free trade, goes across the border. But we don't have free trade. People think we do because they're stupid people. We don't have free trade. With China, with China, they dump their product all over the place, they're dumping steels, and ruining our steel mills. They're ruining our steel mills. Obama's closing up our coal miners in our mines. So you got -- you got miners all over the place, and you know what? I went into West Virginia, we won West Virginia in a landslide because the miners know that I'm going to put the miners back to work. We're going to put the steelworkers back to work. We're going to put them back to work. And we're going to put them back fast. But I don't blame these countries. What I do is I blame our inadequate leadership and it's almost hard to believe that this can be happening when you look at what's going on with our country. Now, here's what we're going to do. Let's take the clip -- and I could talk about Ford, I can talk about Carrier, I can talk about hundreds of different companies that are no longer here. They're no longer here. And here's the story, folks. I believe in free trade, OK? That's official. But here's the problem with free trade. We need smart leaders to make free trade work. And we have leaders that are not smart. In fact, they're rather stupid, I must say. They're rather stupid. So I was asked on a program the other day, recently, they said do you believe in free trade? I said yeah, I do. Do you believe in fair trade? Yeah, I do. I believe in trade. Well, what kind of trade do you like the best? I said here's my trade. I want to make great deals. That's what it is, for the people, for this country. I don't care if it's free trade, I don't care if it's fair. It doesn't make any difference. I want my trade deal. I want to make good deals for you. And I have the greatest negotiators in the world. We have Carl Icahn. I've gotten endorsed by the big business leaders. They love Trump. What can I tell you? But I have such great endorsements. I have -- we have the greatest negotiators in the world in our country and we don't use them to make these deals that are bigger than any company's deals. These are the biggest deals, deals with China, deals with Japan and Mexico. These are the biggest deals in the world, folks and we use political lightweights, political hacks that don't know what they're doing. And China looks at us and they can't believe how stupid we are. They can't believe they get away with it for years. It's amazing that the country, not so well, but that the country functions. It's amazing. So we're going to change all of that and when we came down, remember, when I started this journey. When I started this journey, it was about illegal immigration and these are my friends right here and they've lost big league, big league, the biggest, they've lost the biggest. All of my friends. Unbelievable people. They've lost the biggest. But when I came down it was about illegal immigration. And it was about trade. And it was about a strong military. But basically, it was about illegal immigration and trade and bringing our jobs back. Then we had Paris happen and we had other things happen whether it's San Bernardino or so many others. And I started saying, well, we got to toughen up this country. We have to be very, very smart and very strong and very vigilant, and we have to get people when they see there are bombs all over the floor of an apartment. They have to report these people to the authorities and they have to report them fast. They have to report them fast. No more games. You know, the leader of the Paris attack they couldn't find him. Do you remember? And it was almost a year. Do you know where he lived? Right next to where he was living for years. Everybody knew he was there. Nobody reported him. They found him through luck. Nobody reported him. San Bernardino, they see all these bombs all over the floor. They say, oh well, you know not to normal that bombs all over your apartment floor, right? People saw it. This maniac over the weekend, look at his record, people saw what he was doing. First of all his wife knew. I think his father knew. I think a lot of people knew. And they didn't report him and we have now 50 young people, we have 50 people dead. We have a tremendous number of people badly, horribly, gravely injured. They didn't report them. They knew he was going to go. They knew he was going to explode. Nobody reported him. Nobody. They have to report and I've been saying it for two weeks, big league. And now all of a sudden people are saying report, they're saying report. OK, so here's one other thing, folks. We have a country that's bust, right? We have a country that's bust. We protect Japan. We protect Germany. We protect Saudi Arabia. We protect South Korea. We protect all these countries and they don't pay us what it costs. They don't pay us. We're losing a fortune. We have to go to those countries which are wonderful countries. We have to say we need help. Now, Hillary said how dare Donald Trump say that. He wants to abandon Japan. I don't want to abandon Japan. Now, here's the problem with what she said. By her saying that you can never make a good deal because she's saying under no circumstances, folks, we have to be prepared to walk. I don't want to walk. Hopefully, we're not going to walk. But if you don't say you're going to walk or if you're not prepared to walk, you're never going to get them to pay. We are losing billions and billions and billions of dollars protecting very strong financial behemoths. South Korea, how about Saudi Arabia? Saudi Arabia was making $1 billion a day when the oil was high. Now, they're still making a fortune. If we weren't there, Saudi Arabia wouldn't be there for two weeks, OK? We protect Saudi Arabia. We pay rent, we pay rent on facilities that we have. We pay rent and we're protected. With Japan, with our Japan treaty, if the United States gets attacked they can watch the attack on Sony television and never do a thing. If they get attacked, we have to use the full force of our armed forces to protect them, OK? Who makes these deals? Who makes these deals? Who makes these deals? So what I'm saying is this. I have to go. My favorite. So I get asked by a very good commentator, what do you think of NATO? Now in all fairness, I've been doing deals all my life, I do you know, I built this great company and all that stuff and I do deals. Nobody talks about NATO. I mean in all fairness, I'd like to say I have great experience with NATO. But I do have a lot of common sense and I do have a lot of business instinct like some of my friends that are here. So the question is what do you think of NATO? So I say to myself, the first thing is nobody's ever asked me this before. Second thing is well, I said this, I said number one, I believe it's obsolete. You know, set up many, many years ago about the Soviet Union. Soviet Union doesn't exist now it's Russia, but Russia's still a big threat. It's OK for Russia. The problem is, the problem is that our new threat is terrorism, and NATO wasn't really set up for terrorism. They don't even have the right countries, all right? So I said it's obsolete because it doesn't take care and take into account terrorism. Number two, all of these countries, well, a lot of them don't pay. You know in the real estate business -- I have some friends that are in real estate here. They call it, they're delinquent, right? They're delinquent. They didn't pay their rent. These people didn't pay. Now, we're protecting them, probably end up in third world war by protecting these countries. They don't even pay or they pay us a fraction or they pay us much less than they've agreed to pay us because nobody asked them for money. In the meantime, we have the highest taxes in the world, we have budget deficits that are through the roof, and by the way, speaking of that I'm lowering your taxes, lower than any other candidate by far, by far, and we're getting rid of these horrible, horrible regulations that are killing people, and killing small businesses. We're getting rid of so many of them, so many of them. So I said, so I said it's obsolete they don't take care of terrorism and they're not paying up. They got to pay up and it turned out I was right on both counts but I'll never forget. The first three or four days, Donald Trump didn't know anything about NATO. I said why? three or four days later, all of a sudden people that studied it very closely that never studied anything, like they have blinders on, right? They can't see the forest for the trees, right? You know the expression. They can't see the forest for the trees. All of a sudden, three or four days later, people are saying he's brilliant. He's right. He's -- like Putin. Putin called me brilliant. I like it. They want me to disavow. Putin said Donald Trump is brilliant. Essentially, he'll be the next leader but Donald Trump is brilliant. And the people I was debating against they said, we would like you to disavow that statement. And I said do you think I'm going to disavow that statement? Are you crazy? So with NATO. So I went three days -- and the press was just absolutely brutal, like, I didn't know what the hell I'm talking about, give me a break. Then three or four days later, the experts are starting to say, you know huh, Trump is sort of right. It's obsolete. These are people that study it eight hours a day. They study it and they say you know, Trump can be right and he's right also, they're not paying up. They're not paying up. They owe us a lot of money, many of these countries. OK. Now, here's what happens. About seven days ago, front page of The Wall Street Journal. Big, big story, NATO to set up major terrorism unit General so and so to be the head of it. I said that's what I said. Now, they don't give me credit for that. You know they had a little sentence, like, a little one-third sentence, Donald Trump wasn't happy about it. Oh, great. Great. Folks, our country has such incredible potential. We have such incredible potential. There are so many pockets of fat. There are so many pockets of stupidity. We can bring our country back bigger and better and stronger than ever before. I'm telling you. Just on the military and I said this, I said again, you have to always be prepared to walk. But just in the military, I said look, we want to help Japan. We want to be a great ally to Japan. We'll always be friends with Japan. But you know they got to help us. They sent -- Obama sent a General out and he said doesn't Donald Trump -- No, this is true. I promise. Doesn't Donald Trump know that Japan covers 50% of the cost of the military? I said why don't they cover 100% of the cost of the -- Why? Why? Why? Now you know, if he said 50%, the number is probably 25% or 20%, OK? Folks, we're like the country, and so true, that's being led by the dumb people. It's not going to happen anymore, folks. It's America first. It's America first. It's America first. And we're going to get it going and we're going to get it going like it hasn't been going in many, many years. I really mean it. You know my theme, I see all these hats, Make America Great Again, white, red, camel, black, all of these hats. But we're going to -- you know the theme is Make America Great Again. I honestly believe, it will be Make America Great Again, make America safe again, safe. And I really believe, I really, really believe that our country can be greater than ever before. I know the people. These are unbelievable -- you. These are unbelievable people. And folks, we don't win anymore, right? We don't win anymore. We don't win. We don't win with anything. We don't win on trade. We don't win with the military. We're going to knock the hell out of ISIS, by the way, we have no choice. We have no choice. We have no choice but we're going to start winning again. We're going to win so much you people are going to get sick of it. You're going to come up and they're going to call me from Texas, Mr. Trump, sir, you have thousands and thousands of calls from Texas. They're all your friends. They heard you speak one night. Mr. Trump, they're very upset. President Trump, they're very upset. They're going to walk in and they're going to say, go ahead. What the hell difference -- they're going to walk in. They're going to say, President Trump, thousands and thousands of calls from Texas. They are so upset with you Mr. President. They can't stand the amount with which you're winning by everything is a win. You're winning on trade. You're winning at the border. You're winning with your military. You're winning on healthcare. We're going to repeal that. It's horrible stuff, and replace it. Mr. President, sir. You're winning with Common Core. You're going to end it and bring education local. Mr. President, sir. They can't believe you've saved the Second Amendment 100%, and Mr. President, the people of Texas do not want you to win so much. It's driving them crazy. And I'm going to say, tell the people of Texas that I love them. But we're going to continue to win. We're going to win so much. We're going to Make America Great Again. I love you. Thank you all. I love you. Thank you. Thank you."}