{"id":382,"author":"Donald Trump","title":"Speech: Donald Trump in Moon Twp., PA","date":"2016-06-11","link":"https://factba.se/transcript/donald-trump-speech-moon-twp.-pa-june-11-2016","paragraphs":["So I want to thank you. And you know, we're going to start talking about a lot of things. We're going to talk about jobs. We have to bring jobs back. We're going to Bring jobs back to our country. We don't have the same world right now as we had not so long ago. The world has changed. I see that in France.","They have the big soccer tournaments and they're afraid to have it because of radical Islamic terrorism. And they're afraid to have it. They don't know what they're going to do. Maybe they'll have it. The police are saying, we can handle it. And I'm saying to myself. Boy, has the world changed. And we have to be strong.","We have to be vigilant. We have to be smart. We have to be tough and cunning. And we can't let this crap happen. We can't. OK. We can't. We've got weak leaders, folks. We've got weak, ineffective leaders, whether it's on trade, whether it's on the military -- our military is in such a bad state. Everybody.","And I've seen it, and I can't believe it. Our jet fighters -- last week, they did documentaries. Our jet fighters. We're using parts from all planes in the graveyard. You know, the airplane graveyards. Were using parts, stripping those planes, using them on our jet fighters that are 18 to 20 years old. And this is the United States.","And you know what, folks, we're going to change, and we're going to change fast. I love Big Ben. do we love Big Ben? I just spoke to him. He's -- what a great guy. And he's with us 100%. What a great guy. And a champ. You know, he's a champion. Two Superbowls. Remember the one, he grabbed a foot. Grabbed that foot.","He was back there, he was falling on his back, and he grabbed a foot. And that would have been a bad day for this program if that happened right. So he's a good champion, he's a good friend of mine, and he's a great guy. He's a great guy. So I want to say hello to him and a lot of the folks that are friends of his that are friends of mine.","And I got to know him over the years. And you know some people have what's call a champion heart, right. Most people don't. I hate to say. But that's what we need. We need that in Washington. It's time. We have people that are incompetent. We have people that don't know what they're doing. They have no clue.","They have no clue. Everything's politically correct. I mean, you watch what you say. You say something a little bit off, you end up with the headlines. It's like a bunch of babies. Like a bunch of dumb babies. And believe me, folks, the world is laughing at us. They can't believe what's happening. You look at trade.","300 -- just take a look at what's going on. Countries all over the world taking advantage of us. Mexico, we have a trade deficit. $58 billion a year, and they're killing us at the border. China. Think of it it. China -- we'll build a wall. Don't worry about it. We'll build a wall. We'll build a wall. Were going to build that wall.","And by the way, the Mexican people are great, and the officials leading Mexico, they're taking advantage of stupid politicians that we have running our country. I don't blame anybody. I blame our politicians. I'm not blaming -- look at China. We have a trade deficit with China of $505 billion a year. All right.","505 billion. How the hell do you come out of that hole? And we can make great changes. And you know what, they're going to make great trade deals. When I deal on it, those deals are going to be great deals. They're going to be good for us. They're just fine to China. But right now, we have rebuilt China with our money, with our jobs, and they laugh at us. And why do they do that?","They have no respect for Obama whatsoever. They'll have even less respect for crooked Hillary. She's the worst. She's the worst. They don't respect her. They don't respect her. And what are they doing? So they're taking our jobs, they're taking our money, and they're going out in the South China Sea, and they're building out one of the big, great fortresses of the world right in the middle of the ocean, right in the middle of the South China Sea.","Massive airport hangar. Military I'm talking about. And guess what, folks, they're not supposed to be doing it, but they have no respect. So they take our money, they take our jobs. And they build these massive fortresses, right, that they're not supposed to be building. And I say to myself, wow, isn't that incredible.","And we have such power over China. Because we're the piggy bank that they're stealing from and destroying. And there are other countries, not just China. China is the biggest and the best abuser. Mexico's gonna be a smaller version of China. They already are. So many companies are leaving here and moving to Mexico.","You have many companies that left this area. I'm looking at your numbers. I mean Pittsburgh, you're are wiped out, folks, I hate to say it. You got wiped out. Your manufacturing is way down. Your steel is way down. I look at Pittsburgh, and you know, maybe I'm a little old fashioned, but I love steel. OK. I love steel.","And I love the miners. We're going to put the miners back to work, OK. We're going to put the miners back to work. Remember, Hillary, about a month and a half ago, she said, we're going to put the coal mines and the miners out of business. Isn't that smart? Isn't that wonderful? She's not winning Pennsylvania.","Let me tell you, folks. She's not winning Pennsylvania. She wants to put the coal miners out of business. You know what? Not going to happen. Not going to happen. I'm not allowed to use any bad words, by the way. If I use even little bad words, like I almost used the A word since -- but I almost used it. If I used it, they'd say, these people, the dishonest media.","The world's most dishonest people. If I use the A word, they'd say, oh, Trump used foul language. Horrible, horrible, horrible. If somebody else uses it, forget it. You know I was saying before, because we just came up from Virginia, we just came up last night, we were today in Florida. I mean, we're all over the place.","It's a beautiful scene. We were in Tampa. We're all over. And I'll tell you what, we have said this is a movement. This is a movement. This is a movement. And this isn't me just saying it, this is the cover of Time Magazine. Many, many covers over the last number of months. In fact, I hear we have another one coming up this week.","Who knows. Good, bad or indifferent, it's a cover. But you know, it is a moment. And a lot of the pundits, even pundits that absolutely hate me. Don't forget, they said he'll never run. He'll never run. And then they said, this is the finest group of Republicans ever, ever to run for office before I joined.","In fact, I said to my wife, listen, I'm hearing a lot about how great these people are, how can I possibly do this? But the country's going to hell, and we have to do something about it. And I don't see it happening. So I'm watching Fox, and Charles Krauthammer said, before I joined, said this is the single finest group of Republicans perhaps ever to run.","Now maybe he said since like World War 2, but that's fair enough. But perhaps ever to run for office. One of the finest groups. And I said to my family, I said, you know I just heard like these are the finest people ever to run. Then one by one. Boom. Boom. We started off with actually 18. Not 17. But that's okay.","When they thought 18 or 17, it depends on how you define a couple of them, right? But we start off with 18, and then 16. And then 15, and then 13, and then 11 in. And then nine. And then seven and six and five. And then that's where I've been, three. And then all of a sudden, it was over. And they say, What the hell happened?","What happened is Trump. It's trump. I was talking to one of the -- stance on free trade. I said I have no stance on free trade. Well, why do you have on trade? I said I want to make good deals. They said, what do you mean by that? Very simple. Free trade, not free trade. Fair trade. There's 90 different definitions.","I want to make good deals. I don't care what you call them. OK. I don't care what you call them. We're going to make great deals for our country that's going to put people back to work. I'm not going to have China dumping their steel all over the United States to ruin our plans and ruin our jobs. You know, they're dumping so much steel.","So much steel. And in the end, what it does is it destroys our capacities. And it's not cheaper. It's not going to be cheap. It's going to be much more expensive, ultimately. But they're dumping. They're stealing our intellectual property. $300 billion a year. We do nothing about it. We do nothing about it. And we have tremendous power.","We have a thing called the power of taxation. If they don't behave, we put a tax on the products that come in. By the way, we'll make a fortune if we do that. But Obama doesn't do it because he's not smart enough. He doesn't understand business. He believes, oh, we shouldn't tax. Except that they tax us when we go in there.","They tax us. And I'm not only talking about them. But they tax us. So it's like a one way street. They send their stuff in. We try and get it. I have friends who are in the manufacturing business. Great people, great manufacturers. Better than what they have in China. They call me up. They can't do business in China.","They can't get product in. And when they do get it it in, they have to pay like a massive tax. We got ripped off. You're right. He's right. He knows. We get ripped off. And I'll tell you what, folks. If in November you come and pull the red trigger, we're going to have so much fun together. We're going to have a lot of fun.","And honestly, it's not even going to be hard. So one of the greatest man, a great man, said to me, Donald, you're being too tough on China. You're being too tough on Mexico. You're being too tough -- no, no. He said. He meant it. This was a number of months ago. He said, you're being too tough on Japan. Japan sends us hundreds of thousands of cars.","Millions of cars. They come off the biggest ships you've ever seen. I was in Los Angeles recently. I'm watching. It looks like NASCAR. And by the way, Brian France. The big guy at NASCAR, endorse Trump. Isn't that nice? And Don King, big Don King. We all know Don king, right? Whether you like Don or not, he's a hell of a guy.","But Don King just endorsed Donald Trump. He loves Trump. And by the way, for a guy that really let us down. This poor Mitt Romney is sad. He's going to run. He's a sad case. He choked. You know what a choke artist is? Right? You know what a choke -- you know, when I guy misses the kick, you get rid of him.","You bring another one in, right? Because you don't want that thought going in his head too much. He choked. He should have been a failed guy. He was a failed president. He should have beaten a failed president. He went away the last month. Where was he? I even called his people. I said, get him on television.","Say what you like about Obama. He was on Jay Leno. He was on David Letterman. He was all over the place. And Romney was sitting at home, not doing anything. What the hell happened? I asked my people, what happened to him? Where is he? Oh, I think we're going to be OK. I think we're going to win. I said, get on television.","You got one month. And the guy choked like a dog. And then he's says, Donald trump may have racial tendencies. He called today. He's a trickle down racist. That's what I've never heard. A tricked. And a misogynist. He doesn't know what a misogynist is. He's a trickled down racist and a misogynist. Now I know why he lost.","I mean, you talk about communication. So the guy was on yesterday CNN. And I said to myself, it's absolutely pathetic. He lost. He choked. Like a dog, he choked. And now, it's time for somebody else. We're going to win, folks. We're going to win. We're not going to be choke-y. I don't choke. I don't choke.","I backed John McCain. Good guy. That was a tough race, because a lot of bad things were happening. I'm not sure if Abraham Lincoln could have won that. But I backed John McCain, big league. I backed Mitt Romney, and he choked and he lost. And I said, this, folks, we're going to do it ourselves, and we're going to win.","We're going to win. We're going to win, folks. We're not going to put up with this stuff. And we are going to win. You know, one of the great journalists actually called me. Happens to be a liberal, but that's OK. Everyone once in a while, that's OK. Do we hear. Who cares? You know we're going to make America great for everybody.","Not for conservatives. Not for Republicans. Not for Democrats. Not for liberal. We're going to make it great for everybody, folks. We're going to make it great. But he called me and he said, you know, you've done something that nobody else has ever done. I said, what's that? He said, what you have achieved in the world of politics has never been done before.","And honestly, Bill O'Reilly who's a very tough guy and very smart guy, said it's one of the greatest -- and it's the greatest, actually -- political phenomena that he's ever seen. Not bad, right? I mean, you know. And others. Even said that he hates me. This guy hates me. The level of hatred from some of these people is incredible.","And a lot of it's because they were wrong. You know they were wrong. They said, you'll never run. He's never going to run. You know, they say he paid a lot of money to be prognosticators, right? Donald Trump will never run. The next day, I announced I'm running. Then they say, well, Donald Trump has started to run, but he will never do very well because we have all of these great candidates.","So I decide to run, and I started off, you know, with -- you start off like everyone else. You start off with nothing. And then the first week, I went to 8. Well he has reached the ceiling. He'll always able to get 8, but he has reached the ceiling. Next week, the polls come out, he's at 14. Well you know, that's surprising, but 14 is his absolute ceiling.","There is no nothing he can do to go higher than 14. Then I go to 20. Then I go to 28. 32, 38, 48. 51. Then I go to 55. Then in New York, I get a 62. Then in california again, 78%. And you know what, something that nobody talks about because they don't want to. If I was a Democrat, they'd talk about it plenty.","In the history of the Republican party, right, you know. Abe Lincoln. We're talking about a long time. In the history of the Republican party, I've got the most votes. You got the most votes. I'm the messenger. I'm a good messenger. You have to say. You're doing a great job. I'm just the messenger. But in the history of the Republican party, Dwight D. Eisenhower, great guy.","We won the second World War, and I think other people had something do with it, in all fairness. But he's got a lot of credit for winning the second World War. He runs for president. I beat him. Richard Nixon. We beat Richard Nixon. Ronald Reagan, who we love, we beat Ronald Reagan. We beat Bush. We beat everybody.","In the history of the Republican party. We, we, we, all together. The movement, got the most votes of anybody in the history of the congress. But I don't mean by right. We've beaten them out. Oh, we edged them by a Couple of edge.No, no. By millions of votes. By millions and millions of votes. You know, it's amazing.","And the Republican party, I'm not going to take full credit for, but I'll take 99.9. The Republican party got more votes and had the biggest increase, about 70% increase, over what it was four years ago when we had that loser Mitt Romney representing us. 70% more people. And the people that support us -- you know, a lot of people, they weren't at the polls.","So 40 years, I see them. Men, women, they're at the polls. And I remember in South Carolina and New Hampshire. New Hampshire, I love -- I mean, these are the states where I did really well early, and it was an amazing thing. The feeling I have. By the way, I'm going to make a pretty good speech on Monday, so stay tuned.","Stay tuned. I'm going to do it in New Hampshire because that was the home of my first victory. I went to New Hampshire. Bush was favored to win. From that whole thing. No. Low energy. Low energy, folks. And he's not living up to his obligation, because when he signed the pledge, he said, I will do this. Meaning, I will endorse whoever it is. It was me. And he says, I won't do it. So what he's doing is, you know, very -- it's very dishonorable.","But Bush, he's favored to win, except when I won in a landslide. And we won in Massachusetts. Now it's nice that Tom Brady likes me. That helps, right? We got almost 50% of the vote. We got almost 50 percent of the vote with like eight or nine candidates in there. Now you know I never got credit for that, because when these pundits who hate me. I even did some of them, but most of them hate me. But when these pundits go out, right, they go out, and they say Donald Trump only got 34% percent of the vote.","They didn't say there were 15 candidates. Actually getting 35% of the vote with 15 people in the race is is better than when I got 78% in California. And just remember this, with California, they had a lot of names on the board. You know, it's not like it's totally over. They could vote for anybody they want, because all of the names or many of the names are on. So when you get all of these numbers, but all the time, I had to listen to this, because I think it's the largest deal in the history of elections, the 17 or 18 people that started.","So I was competing against all of these governors and senators and very capable people like Dr. Ben Carson, who's a great guy, by the way. Great guy. And I spent years in Philadelphia -- and Philadelphia is not Pittsburgh, right. I know that. But we love Philadelphia, too. Brotherly love. And we do love Pennsylvania, and that's where it all comes together.","But so I've been in this state, and I know this state very well. And this is a great, great state. So I win Pennsylvania big, big. And then I win Connecticut big. In fact, they just did a poll in Connecticut. Republicans are not supposed to even waste their time going to Connecticut. I love Connecticut. A poll just came in where I'm a few points behind, and people are saying that's incredible.","A poll just came down in Pennsylvania, by the way where we're leading. A poll just came out in Ohio where we're leading. A poll just came out in the great state of Florida, we're leading by two points, and we haven't even started campaigning yet. You know why we're leading? Because people are sick and tired of this stupidity that's going on with our country.","They're tired of it. They're tired of it. We're going to have a great country, and we're going to have a country that's unified. We're going to have a country -- I thought one thing about Obama. I thought that Obama would be a cheerleader for the country. That's the one thing. I never thought he was going to be the president in terms of greatness.","I thought he'd be a great unifier, a great cheerleader for the country. He is a great divider. The country has practically never been so divided as it is now. And we're going to bring everybody together, folks. White, black. We're going to bring everybody together. We're bringing our country together. The richer, the poorer, everybody.","And you know, one of the reasons we're going to bring it together, it's the old story. It's called jobs. Because I'm not going to let other countries take out jobs. Like Carrier, where they move their factory to Mexico, they fire everybody. And Ford where they take tremendous numbers of people out of their system, and they build these massive plants in Mexico.","And so many other countries. You know, it's funny. So many of these companies, they're ran and owned by friends of mine. So now I'm getting calls. They say, Don, please don't mention my company. Please don't mention my company, and I'm running out of companies. And I know so many of these guys. But you know, when people are friends, you don't mention their companies, right?","Should I, or not? Yeah. I won't. You gotta be loyal. By the way, there's no shortage, I can tell you. The list is is a mile long, of companies that are leaving. Look at this area. In ten years, you've lost 45, 50% of your manufacturing jobs. Whoever heard of a thing like that? I mean first of all NAFTA is like one of the worst things ever to happen to our country from an economic standpoint.","And who signed NAFTA? Bill Clinton. And a lot of people said, oh, we had pretty good economic times with Clinton. Well, we didn't have good times, if you remember. There were a lot of bad times. First of all, he was impeached. There was a big impeachment mess. It was a mess, just like it will be with Hillary.","With Hillary, it'll be worse. But remember this. I think called impeachment. Remember the turmoil in the holy -- but just think. We did OK. But the people that followed him because of that horrible thing he signed got killed because NAFTA stripped the jobs out of this country. I toured New York. I toured Connecticut.","I toured Pennsylvania. I toured all over the place. I was in Maryland. I look at places that were vibrant 20 years ago, with incredible factories, and those factories, you could buy them for $1. You can buy them for nothing. And actually, from a real estate standpoint, you should do it, because if I win, those factories are going to be put back to work again.","Believe me. Although they're in pretty bad shape, you'll probably just rip them down. But we're going to have our jobs back. OK. Not such a bad investment. I just saw this recently. It's in one of the papers, that cashing in. Illegal immigrants get $1,261 more welfare than American families. They got five -- think of this.","This is illegals. $ 5,692 versus $4,431. So they get more money than American families get. Where are we -- what are we doing? What are we doing? Now what are we doing? You know, they're all screaming, build the wall. It's not just the wall. But we are going to build the wall. You know, recently, the president of Mexico from a few years ago, Vicente Fox.","He was on television. You know what happened. And he threw around the F bomb. And he said, we will not finance or give the money to build the wall. But he said it differently, because he said we will not pay for that F bomb wall. The F bomb. He used the F on live television on CNN. I said, whoa, he's he's going to be -- oh it's gonna be so bad tomorrow.","Where do you see. it? Nobody wrote about it. Can you imagine if I used the F bomb. Would that be. That would be the electric chair, right? They'd give Trump the electric chair. OK. If I use the F bomb. So he said, we will not, under any circumstances -- always said he was going crazy, sitting in a chair.","I thought he's going to -- look, I won't say. But he was going crazy. But we will not pay for that f bomb law. And I said whoa, is he in trouble. But then I said to myself, hey, I'm happy. Because two years ago, he said we will never allow that wall to be built. So now, at least he knows it's going to be built.","And the reason. Look, the reason -- this is very important -- the reason that they're going to pay for it -- we're going to have a great relationship with Mexico. Much better than we have now. We're going to have good relations. When Sergeant Tamaricio -- remember Sergeant Tamaricio? He made a wrong turn.","He had a lot of difficulties. When Sergeant Tamaricio was there, they kept him in the worst prison. They treated him horribly. They should've let him go. He had difficulties. They should have let him go. And they didn't let him go. And I don't even know if anybody called. I'll tell you what, I would have been on the phone the first night.","I would've called the president of Mexico. I'll say, let him go. Let him go. I don't think Obama called. The guy was in there for a long time. And I helped him out and. And I helped him out, and Greta helped him out. I have to say, Greta. Greta Van Susteren helped him out. And I helped him out. But relationship, as you call him up, you say, do me a favor.","Guy made a mistake. Let him out. Because the people were going crazy. And how about this? Bergdahl. Right? Sergeant Bergdahl. Sergeant Bergdahl. Here's the way we deal, folks. We get Bergdahl, a total traitor, where probably five or six people were killed trying to find him. Probably -- definitely five, probably six, killed going out trying to get him back.","So we get Bergdahl, and they get five of their worst killers that they've been after and trying to get out of prison for nine years. So we get one, they get five. Those five now. I saw just the other night. They're back in the field trying to kill everybody, including us. Folks, folks, we got to be so much tougher and so much smarter.","I call them the five for one president. And how about the deal with Iran? We get nothing. We gave them a $150 billion, and it was only after that. Remember, they took our sailors, our 10 sailors. And they would kept them forever, except they wanted the money, it was due the following day, right? So stupid, they're not.","So they humiliated us. They humiliated the sailors. Then they let him go. And I remember after a few days, and Kerry said, we would like to thank Iran. They got $150 billion, all right? Who the hell would have kept him. So they would have kept him, believe me. And that should've never happen. We had hostages.","We should never have negotiated while those hostages were held. We should have said, gone into the room, say, release your hostages. If you don't release the hostages, the deal's out. Get up. Walk out. They're great negotiators, the Iranians, the Persians. They're great negotiators. Always have been. You know you're not supposed to generalize.","I'll generalize. OK. They've always been great negotiators. And we've got a guy who doesn't know what the hell he's doing. Secretary Kerry, President Obama. President Obama -- President Obama is incompetent, OK. He's incompetent. Remember that. He's incompetent. Now. Yeah, we have a president who doesn't -- just doesn't have it. He doesn't have it. So here's what's going to happen.","Here's what's going to happen. And what should happen then. You get up and you walk, the art of the deal. I mean, you know give me a break. We never walked once. You know did you ever see that negotiation. We would like to have the following the Americans. No. They go, No. Oh, OK. We'll agree with you. Everything was no, no, no. OK. We'll take it. We'll take it. Never walked, never left.","They should have said, we have to have our prisoners back. Look, folks, they don't help you. Good for us. Our people are angry. Good thing for us. You've got to release them. They will say no. They're going to say no, we're not going to do it. And then you say, sorry, we can't negotiate. You leave the room.","You get on the plane. You double up the sanctions. By the time you land in Washington, you're going to turn around the plane. The prisoners or hostages will be released 100%. Like 100 -- you know, I hate to say the art of the deal, because that's so simple, who would even write about it, right? Who would even have to write about it. And then you start to negotiate.","And the other thing, I negotiate two points. And then nuclear is very important. I love negotiating. But you have to get a good deal. Not a deal that's going to destroy Israel, which this deal will do. This deal is so destructive for Israel and our country, that how they could have allowed it to happen is incredible.","How they could have allowed it to happen. So I want two things. I want our prisoners back before we start. They would have been back three years ago. That was the longest negotiation. You know usually, a negotiation that takes that long is no good. That's No. 1. But you know, we sat there just for years just giving them everything they wanted.","How about this? They were dancing all over Iran at the deal before it was signed. Who the hell signs the deal when the whole country is saying how stupid you are getting this deal before you signed it. But they wanted to sign the deal. Horrible for our allies. Horrible for Israel. Very bad for us. We've created a real power.","The second thing I wouldn't have given them. I would have never given them the $150 billion back. Wouldn't have. And I would have done it -- you know, my father was a great guy. He was a builder in Brooklyn and Queens. And he said to me, I learned a lot. And I sit in his knee. And I learned by osmosis. He didn't really teach me. I just learned.","You know he'd be on the phone with a plumber or with a sheet rock guy or with a pipe fitter. And he said, no, no, you got to lower your price. Can't do it. Can't do it. You know, I grew up with that. It was like in your brain. And now, we're doing the old post office. We're way below budget, way ahead of schedule.","Everybody wanted it in Washington D.C. The old post office in Pennsylvania Avenue, right near the White House. I always said, if I don't make it folks, I'm still going to be living in Washington D.C. OK. And it's gonna be a great building. It's gonna be -- I think we're going to make it, right? I tell you what.","I'll tell you what. I'll tell you. I really think we are going to make it. And I think we're gonna make it big league. And we're going to turn our country around. By the way, the old post office. So the old post office, right now, is almost two years ahead of schedule. And I told my people, don't say two years, because it's not a believable number.","It's almost two years. But I say it's not. But just say it's a year ahead of schedule. Because two years, it almost sounds too much, but so I'll say it, we're 2 years. But we're a year ahead of schedule, and we're under budget. And the quality is much, higher. I think it's gonna be one of the great hotels of the world.","It's going to be Trump International hotel on Pennsylvania Avenue. And we're going to open in September. But I think we're going to have probably our opening ceremony toward the end of October. I don't want to have it too early. But think of this. We're under budget and ahead of schedule. Do you ever hear that from our government, right?","You ever hear that? Never hear that from our government. So a lot of things are happening. The run has been amazing. The crowds, the momentum, and the movement has been amazing. No matter where we go, we have 20,000, 25,000 people. In Mobile, Alabama, we have 35,000 people. We have by far the biggest grass.","Far bigger than Bernie Sanders. And by the way Bernie was second, I have to say, but it wasn't even close. But you know during this whole campaign, and I was saying, a number of weeks ago, I think weeks ago, we had a crowd 17,000. Bernie had three on the same night, different cities. So we had 17. And I had the folks at CNN, actually.","And they were saying, this is so-and-so from CNN, I'm at a Donald Trump rally, and everything's good. Ha Ha Ha. And you got to see the spirit in the room, people are going crazy. They're standing ovation. There were seats, but nobody was sitting down. The people were going crazy, and you listen, it sounds like there's 200 people standing there right.","And that's the end. And now, over to you. And then Bernie Sanders rally. So they didn't mention 17,000 people, right, or 18 -- whatever it was on. A lot. Now they go to Bernie's. We're at the Bernie Sanders rally. It's a massive crowd -- they have to have at least 3,000 people. It's unbelievable. Look at all the people.","So I have 17,000 people. And it's like falling asleep for the reporters. He has 3,000 people, and they're talking about the 3,000 people. Let me tell you, folks. As Republicans -- as Republicans, and the more conservative you get, the harder it gets. It is so unfair the dishonesty of the media, the dishonesty of those people back there.","But the beauty of it is. The beauty of it is that the people are really smart. They get it. I mean, they really understand what's going on. It's an incredible thing to see. They get it. That's why I love my party. You don't see any protesters. Are there any protesters? Because I love the protesters because the only time the cameras ever turn to show how massive these audiences are, the only time -- I mean, it's like an incredible thing.","It's when we have a protest -- do we have a protester anywhere, please. Sometimes, you know what I'm going to start doing? Taking friendly, putting them up in corners of a room and letting them protest. OK. That's the only time. I didn't think they could move the cameras. I thought they were maybe modern equipment, it's fixed.","And then about my third speech, we had a protester. Bad guy. Nasty. Loud. Started swinging at people. And when my people swung back, it was like, oh, my people are terrible. My people are terrible. But this was a loud guy. And then all of a sudden, it was like in a strange corner of the room, and those cameras that I didn't think could move, I thought they were fixed wing.","All of a sudden, they're bent like a pretzel. Everything -- they're getting the protester from every angle, every shot. Now there's tremendous dishonesty, folks. There's tremendous, tremendous dishonesty. But with all of that, with all of the stuff that goes on, and all of the phony reporting and dishonest reporting, the people are getting in. And that's why we're being covered like nobody, no place in the world.","What's going on is being covered like no place in the world. You know the Republican party was a little bit stayed. Was that a nice way of saying it? A little bit stayed. Stayed. You know how to spell stayed, right? And the Republican party was not exactly the most exciting place to be. And this year, we're up 70, and the Democrats are down 32 or 33 in the primaries.","OK we're up 70%. And they're down 32. Think of it. So what's happening is an incredible thing. I have to say this. I said to the leaders of the Republican Party. Folks, you've got to get tougher. You've got to be tougher. You've got to be strong. We've had a lot of losses. We've lost a lot of these presidential elections over the last long period of time.","You've got to get strong. You've got to get tough. You've got to be smart, or you're not going to have a lot of victories. And I'll be honest, I'm talking about for them. Because I think I'm going to win anyway. I really think I can win. I don't want to do it that way. Do you understand what I mean? I'm not even sure it's not better for me. But I'd like to see the Republican leadership get very strong, very sharp, very smart, and be cool.","You got to be cool. But we're winning either way. We are going to win either way. And we're going to set this country back on course. And we're not going to protect all of these nations where we're subsidizing the military protection of massive nations that are making fortunes of money and they are paying us a fraction of what it costs.","Can you imagine? As an example, Japan, great people. I love it. But we subsidize Japan, and yet, they're sending us cars. You know what we send them? Wheat. We send them beef. They send us millions of cars, and we send them beef. And they don't want the beef. Half the time, they want to send it back. They don't even want it because their farmers don't want it. You talk about a trade imbalance.","Take a look at the trade imbalance between the United States and Japan. One of the great trade imbalances anybody has ever seen. It's cars versus a piece of Kobe steak. You know why Kobe steak, because it gets back and forth so much, that by the time it finally gets in Japan, it's rotted. And that's why Kobe beef is right.","It's old, old, old beef that they charge a lot of money for. A pretty sad way. But let let me just tell you something. Let me just tell you. We've got to be smart. We can no longer subsidize all of them. We subsidize Germany. We subsidize Saudi Arabia. Saudi Arabia. Now before the oil went down -- they're still making a lot.","But before the moment, they were making a billion dollars a day. And we're subsidizing them. We have our military. We are paying the rent on military bases. We're paying rent. They're charging us rent. And we're over there to protect them. And honestly, I have many Saudi friends. Obviously, many German friends.","Obviously, I have a lot of people from Japan and other countries, South Korea. We have 28,000 soldiers on the line between North and South Korea. And every time potentially the madman raises his head or opens his mouth, we send our ships and our planes and we have everybody read. They gotta pay us something we don't get.","And if you can you imagine if these countries payed just a fair price for this, you're talking about a whole different United States. This isn't 40 years ago, and it's not 20 years ago. We are stone cold broke. We owe 19 trillion dollars. Nobody even knows what a trillion is. They don't know. I have a smart guy, made millions and millions and maybe billions of dollars on Wall Street.","I'd say define trillion for me quickly. He said, let's see, it's blah, blah, blah. You know how much money this is. We owe 19 trillion, going up to 21 trillion because of the omnibus budget, which was passed. Which by the way, allows Syrian refugees in. We have no idea where they are, who they are, where they come from.","Excuse me folks. They're coming to Pittsburgh. You just don't know it. OK. They're coming to Pittsburgh. You don't know. They're being put all over the country just like they want to be. And who knows? You know we talk about Trojan horse. We talk about Trojan horse. And maybe it's a Trojan horse. And maybe it's not.","But we have enough problems in this country. When you look at Paris. When you look at San Bernardino. When you look at all these different places. Couple of things I have to tell you. We're going to give you a massive tax decrease, and get this country back to work for business and for bidding. Hillary Clinton is going to raise your taxes very substantially, possibly to 55 or 60 percent.","That is going to be the end. She's going to raise your taxes. And you know what? She has no plan. She doesn't talk about it. She won't talk about it. She's got to raise them to at least 55 percent. I'm lowering taxes substantially for the middle class who are being run out of our country. And I'm lowering them for business.","Big league. Another thing. We're getting rid of Common Core. We're going to bring education local. Local education. We're repealing and replacing Obamacare. 100%. Disaster. Obamacare is a disaster. Hillary Clinton wants to abolish the Second Amendment. In other words, she wants to take your guns away, folks.","Now the NRA, National Rifle Association just endorsed me. I think it's the early endorsement they've ever given to a candidate. So we are going to stand totally strong. Totally strong. They want to abolish it. They literally want to take your guns away. You know, if in San Bernardino or in Paris. Paris is probably the toughest place in the world to have a gun.","So these thugs walk in, and they go boom, boom, boom, kill 130, hundreds in the hospital, still in the hospital. They'll never be the same. Just horrific injuries. And if we had a couple of like the folks here. Like this guy here with the Trump hat on. The blue Trump hat. Right there, the handsome man with a beautiful head of hair.","Look at the beautiful head of hair on that guy. What are you wearing a hat for? If we had a couple of people in San Bernardino, or let's say Paris, they were in there and they had a gun right around here or a gun strapped around their ankle, and the bullets were flying in the opposite direction also. No. 1, they probably wouldn't have even gone there if they knew there were guns.","OK. Remember that. Don't underestimate that. But No. 2, assuming they did, and they started playing games, the carnage is going to be one hell of a lot smaller than it ended up being. So we are going to protect our Second Amendment. Hillary Clinton wants to abolish your Second Amendment. And I'll tell you what.","On that issue alone, I think we win the election. I really do. I think we win the election. So a lot of things have happened. Our country doesn't win anymore. Our military, as we said, is depleted, but we're going to start taking care of it, and we're going to knock the hell out of ISIS. You're right. We're going to knock that.","We have no choice. I didn't want to go in Iraq. I said I didn't want to go from the beginning. I didn't want -- you're going to destabilize the Middle East. But you know what -- and that's exactly what happened. I've been a good prognosticator. You know, about a month ago, I was asked on CNN by Wolf Blitzer.","I was asked about NATO. Now I'm a business man. I'm not like asked about NATO too often. It's not like, oh, gee, I'm the old Timex, but I have a lot of common sense. And I know NATO, and I understand NATO. He said, what do you think about NATO? Something to that effect. And I said, well, let me tell you.","No. 1, it's obsolete, because it doesn't really cover properly terrorism. No. 2, you have countries in there, because I read this someplace, that aren't paying what they're supposed to pay, and some aren't paying practically at all. And we're protecting them. And if something happens to them, what do we do? Go into World War 3 over a country that's not even paying us. And the next day in the press, oh, that's terrible.","What a terrible answer. He doesn't like NATO. Oh bunch of phony people. And then about two weeks after I said it, some people -- you know, you can't see the forest through the trees, right? All of a sudden people that were experts in NATO were saying, you know, Trump had a point. It is obsolete. And we don't really cover terror.","And we don't need to have the right countries in there if you're talking terror, because it's a different kind of terror. And Trump's right. And you know what else? A lot of these countries aren't paying. They're not paying. They owe us 2% percent of GDP, or 3% of GDP. They're not paying. Because it's like in the real estate business, you know real state, we say they're delinquent.","They're not paying their bill. They're delinquent. They're not paying. We have to get somebody to ask for the money. They gotta pay. We were protecting, and they don't pay. And all of a sudden, people are saying, NATO was good. All right. That was the end of that. Then three days ago on the front page of The Wall Street Journal, NATO to open up massive terror operation.","And I don't even know that much about NATO. It's called instinct. It's called common sense. That's what you need. And they don't give me credit. They only said in the article, like a little half sentence. Donald Trump complained about it also. Great. Thank you very much. I appreciate. Because of me -- and they've taken like one of their top, top, top generals, and they put him in charge.","Good thing to do, by the way. Good thing to do. But I'm the one. If I didn't give that answer, and then the answer got a lot of heat, and then it got a lot of praise. But now, they open front page of The Wall Street Journal, whole big article. NATO to operate an open major terror group. Meaning, to oversee.","And one of their top people is put in charge. That's common sense, folks. That's common sense. Remember I said take the oil. I didn't want to be in Iraq. But I said when you leave, take the oil. But you know who's gonna get the oil. ISIS already has the oil. And Iran is going to get the oil. You think Iran made a good deal with that deal.","They made an even better deal because we practically handed them Iraq. For years, they would fight each other, right? They'd fight, fight, fight. Their military was almost identical. They go 10 feet this way, 10 feet that way. 10 feet. Then they take a break for two years. Then they fight. That's what they do, they fight.","We found that out. They go and they fight. And this went on for decades. Then we decapitate -- stupidly, we decapitate one of the militaries. And now Iran, as sure as you're standing here, Iran is taking over Iraq. We gave it to them. We handed them. They wanted to do it for forever. And we handed them. That's better than the Iran deal that our very incompetent Secretary of State signed with him.","So now Iran is going to end up with Iraq. They have Yemen, and they don't want Yemen. But they love the border to Saudi Arabia. And let me just tell you. I said Saudi Arabia doesn't pay us nearly enough. Boy, what I'd do. I say fellas, I saw that magnificent 777, Boeing 777. You guys never want to fly commercial, do you?","Because you know what, if we ever left Saudi Arabia, that thing would be gone so fast. So fast. And all you need is somebody that knows how to negotiate. They got to pay us for our services. They got to pay us. And if they pay us, we have a whole different country. If these people -- and we're not doing it as a threat, and you have to be prepared to walk.","It's possible we have to walk. And don't forget, we now have energy capacity that we're not even using because of all the restrictions and all of the problems. We now have -- so we don't need these countries that we've died for and spent trillions of dollars for. So they got to help us out. They got to help us out.","And just in closing I'll say this. Look, when I decided to -- I didn't need this. It's 140 degrees up here. That's the end of this suit. Soaking wet. Does anybody want my jacket? You don't want it. I don't need this, but I'm having a lot of fun. I'm getting to know the people in this country. We have unbelievable people.","This country, when I say Make America Great Again. It's gonna be Make America Great Again for everybody. And it's also gonna be we can make America -- I really believe this greater than ever before. You know when we had the debates, I didn't know anything about debating. And yet every single poll. Drudge, great guy.","Time Magazine -- every single poll had Trump winning every single debate. Every poll, every debate. I was on center stage, and I didn't know. I mean, Ted Cruz was this great student from Harvard and Princeton, and he was a debate champion. And they had me winning every debate. OK. I don't want to get into -- you know what?","I liked Ted Cruz. I just like -- he's got a side. Nice guy. I don't care if people endorse me, but I do want them, when they sign the pledge. They gotta sort of live up to what they say, because then I have -- I feel definitely. But we did great. But here's what happened. They go out. They go on Fox. They get 24 million people.","The largest in the history of cable, right? Then a few weeks later CNN goes on with the debate. The largest in the history of CNN. They cover wars. They cover big events. The debate. They have 23 million people on CNN, largest in the history of CNN with all they've covered, and with their long and very incredible history.","So they have the big -- two biggest events in the history of cable television. Now I'm not going to say it's because of me. But let's say if I was in, what would you have, two people watching. OK. So something's happening out there. It's a great thing. It's a beautiful thing to watch, I'm telling you. There's a movement going on that's incredible.","One of the pollsters say any number that Donald Trump gets, you can add something to it. Because a lot of time, it's a very embarrassing statement. You know it goes both ways. Sometimes you'll have this stiff who's a nice person. And everybody wants to say, yes, I'll vote for him. But then they get him to vote for somebody else.","With me, it's just the opposite. They say, when he goes into the boat, they won't tell us, because they don't want us to know that we're voting for Donald Trump. Somebody said, he's too tough. Hillary says, I don't like his temperament. She said, I don't like his tone. We have people chopping off the heads of Christians and anybody else who gets in the way in the Middle East.","We have people killing people at the border like you've never seen before. The crime is far greater than anybody knows. I was right about that, by the way. And we have all of these things happening. And she says, I don't like his tone. Well let me tell you a book was written by a Secret Service agent. And they talked about Hillary.","And they said, she's a horror show. She's got the worst temperament they've ever seen. She's a maniac. And if she was ever president, it would be a disaster. So folks, folks, true. True. So true. So folks, we don't win anymore -- but we're going to win. We're going to win with our military we're going to win a trade.","We're going to win at the border. We're going to win with health care. We're going to win with education we're going to save our second amendment. We are going to win again folks. We are going to win so much. I won't go through the whole exercise, which I love doing, and you love hearing. But you know what, I won't do it. I'm just telling you -- he says, do it, please.","I'm just telling you we are going to win so much, you're going to be so proud of your president, and you're going to be so proud -- much more importantly, you're going to be so proud of your country. We're going to win. We're going to reduce your taxes. We're going to save your Social Security. We're going to win at every single front.","I love you, Pittsburgh. Thank you very much, folks. Thank you. Thank you. Thank you."],"text":" So I want to thank you. And you know, we're going to start talking about a lot of things. We're going to talk about jobs. We have to bring jobs back. We're going to Bring jobs back to our country. We don't have the same world right now as we had not so long ago. The world has changed. I see that in France. They have the big soccer tournaments and they're afraid to have it because of radical Islamic terrorism. And they're afraid to have it. They don't know what they're going to do. Maybe they'll have it. The police are saying, we can handle it. And I'm saying to myself. Boy, has the world changed. And we have to be strong. We have to be vigilant. We have to be smart. We have to be tough and cunning. And we can't let this crap happen. We can't. OK. We can't. We've got weak leaders, folks. We've got weak, ineffective leaders, whether it's on trade, whether it's on the military -- our military is in such a bad state. Everybody. And I've seen it, and I can't believe it. Our jet fighters -- last week, they did documentaries. Our jet fighters. We're using parts from all planes in the graveyard. You know, the airplane graveyards. Were using parts, stripping those planes, using them on our jet fighters that are 18 to 20 years old. And this is the United States. And you know what, folks, we're going to change, and we're going to change fast. I love Big Ben. do we love Big Ben? I just spoke to him. He's -- what a great guy. And he's with us 100%. What a great guy. And a champ. You know, he's a champion. Two Superbowls. Remember the one, he grabbed a foot. Grabbed that foot. He was back there, he was falling on his back, and he grabbed a foot. And that would have been a bad day for this program if that happened right. So he's a good champion, he's a good friend of mine, and he's a great guy. He's a great guy. So I want to say hello to him and a lot of the folks that are friends of his that are friends of mine. And I got to know him over the years. And you know some people have what's call a champion heart, right. Most people don't. I hate to say. But that's what we need. We need that in Washington. It's time. We have people that are incompetent. We have people that don't know what they're doing. They have no clue. They have no clue. Everything's politically correct. I mean, you watch what you say. You say something a little bit off, you end up with the headlines. It's like a bunch of babies. Like a bunch of dumb babies. And believe me, folks, the world is laughing at us. They can't believe what's happening. You look at trade. 300 -- just take a look at what's going on. Countries all over the world taking advantage of us. Mexico, we have a trade deficit. $58 billion a year, and they're killing us at the border. China. Think of it it. China -- we'll build a wall. Don't worry about it. We'll build a wall. We'll build a wall. Were going to build that wall. And by the way, the Mexican people are great, and the officials leading Mexico, they're taking advantage of stupid politicians that we have running our country. I don't blame anybody. I blame our politicians. I'm not blaming -- look at China. We have a trade deficit with China of $505 billion a year. All right. 505 billion. How the hell do you come out of that hole? And we can make great changes. And you know what, they're going to make great trade deals. When I deal on it, those deals are going to be great deals. They're going to be good for us. They're just fine to China. But right now, we have rebuilt China with our money, with our jobs, and they laugh at us. And why do they do that? They have no respect for Obama whatsoever. They'll have even less respect for crooked Hillary. She's the worst. She's the worst. They don't respect her. They don't respect her. And what are they doing? So they're taking our jobs, they're taking our money, and they're going out in the South China Sea, and they're building out one of the big, great fortresses of the world right in the middle of the ocean, right in the middle of the South China Sea. Massive airport hangar. Military I'm talking about. And guess what, folks, they're not supposed to be doing it, but they have no respect. So they take our money, they take our jobs. And they build these massive fortresses, right, that they're not supposed to be building. And I say to myself, wow, isn't that incredible. And we have such power over China. Because we're the piggy bank that they're stealing from and destroying. And there are other countries, not just China. China is the biggest and the best abuser. Mexico's gonna be a smaller version of China. They already are. So many companies are leaving here and moving to Mexico. You have many companies that left this area. I'm looking at your numbers. I mean Pittsburgh, you're are wiped out, folks, I hate to say it. You got wiped out. Your manufacturing is way down. Your steel is way down. I look at Pittsburgh, and you know, maybe I'm a little old fashioned, but I love steel. OK. I love steel. And I love the miners. We're going to put the miners back to work, OK. We're going to put the miners back to work. Remember, Hillary, about a month and a half ago, she said, we're going to put the coal mines and the miners out of business. Isn't that smart? Isn't that wonderful? She's not winning Pennsylvania. Let me tell you, folks. She's not winning Pennsylvania. She wants to put the coal miners out of business. You know what? Not going to happen. Not going to happen. I'm not allowed to use any bad words, by the way. If I use even little bad words, like I almost used the A word since -- but I almost used it. If I used it, they'd say, these people, the dishonest media. The world's most dishonest people. If I use the A word, they'd say, oh, Trump used foul language. Horrible, horrible, horrible. If somebody else uses it, forget it. You know I was saying before, because we just came up from Virginia, we just came up last night, we were today in Florida. I mean, we're all over the place. It's a beautiful scene. We were in Tampa. We're all over. And I'll tell you what, we have said this is a movement. This is a movement. This is a movement. And this isn't me just saying it, this is the cover of Time Magazine. Many, many covers over the last number of months. In fact, I hear we have another one coming up this week. Who knows. Good, bad or indifferent, it's a cover. But you know, it is a moment. And a lot of the pundits, even pundits that absolutely hate me. Don't forget, they said he'll never run. He'll never run. And then they said, this is the finest group of Republicans ever, ever to run for office before I joined. In fact, I said to my wife, listen, I'm hearing a lot about how great these people are, how can I possibly do this? But the country's going to hell, and we have to do something about it. And I don't see it happening. So I'm watching Fox, and Charles Krauthammer said, before I joined, said this is the single finest group of Republicans perhaps ever to run. Now maybe he said since like World War 2, but that's fair enough. But perhaps ever to run for office. One of the finest groups. And I said to my family, I said, you know I just heard like these are the finest people ever to run. Then one by one. Boom. Boom. We started off with actually 18. Not 17. But that's okay. When they thought 18 or 17, it depends on how you define a couple of them, right? But we start off with 18, and then 16. And then 15, and then 13, and then 11 in. And then nine. And then seven and six and five. And then that's where I've been, three. And then all of a sudden, it was over. And they say, What the hell happened? What happened is Trump. It's trump. I was talking to one of the -- stance on free trade. I said I have no stance on free trade. Well, why do you have on trade? I said I want to make good deals. They said, what do you mean by that? Very simple. Free trade, not free trade. Fair trade. There's 90 different definitions. I want to make good deals. I don't care what you call them. OK. I don't care what you call them. We're going to make great deals for our country that's going to put people back to work. I'm not going to have China dumping their steel all over the United States to ruin our plans and ruin our jobs. You know, they're dumping so much steel. So much steel. And in the end, what it does is it destroys our capacities. And it's not cheaper. It's not going to be cheap. It's going to be much more expensive, ultimately. But they're dumping. They're stealing our intellectual property. $300 billion a year. We do nothing about it. We do nothing about it. And we have tremendous power. We have a thing called the power of taxation. If they don't behave, we put a tax on the products that come in. By the way, we'll make a fortune if we do that. But Obama doesn't do it because he's not smart enough. He doesn't understand business. He believes, oh, we shouldn't tax. Except that they tax us when we go in there. They tax us. And I'm not only talking about them. But they tax us. So it's like a one way street. They send their stuff in. We try and get it. I have friends who are in the manufacturing business. Great people, great manufacturers. Better than what they have in China. They call me up. They can't do business in China. They can't get product in. And when they do get it it in, they have to pay like a massive tax. We got ripped off. You're right. He's right. He knows. We get ripped off. And I'll tell you what, folks. If in November you come and pull the red trigger, we're going to have so much fun together. We're going to have a lot of fun. And honestly, it's not even going to be hard. So one of the greatest man, a great man, said to me, Donald, you're being too tough on China. You're being too tough on Mexico. You're being too tough -- no, no. He said. He meant it. This was a number of months ago. He said, you're being too tough on Japan. Japan sends us hundreds of thousands of cars. Millions of cars. They come off the biggest ships you've ever seen. I was in Los Angeles recently. I'm watching. It looks like NASCAR. And by the way, Brian France. The big guy at NASCAR, endorse Trump. Isn't that nice? And Don King, big Don King. We all know Don king, right? Whether you like Don or not, he's a hell of a guy. But Don King just endorsed Donald Trump. He loves Trump. And by the way, for a guy that really let us down. This poor Mitt Romney is sad. He's going to run. He's a sad case. He choked. You know what a choke artist is? Right? You know what a choke -- you know, when I guy misses the kick, you get rid of him. You bring another one in, right? Because you don't want that thought going in his head too much. He choked. He should have been a failed guy. He was a failed president. He should have beaten a failed president. He went away the last month. Where was he? I even called his people. I said, get him on television. Say what you like about Obama. He was on Jay Leno. He was on David Letterman. He was all over the place. And Romney was sitting at home, not doing anything. What the hell happened? I asked my people, what happened to him? Where is he? Oh, I think we're going to be OK. I think we're going to win. I said, get on television. You got one month. And the guy choked like a dog. And then he's says, Donald trump may have racial tendencies. He called today. He's a trickle down racist. That's what I've never heard. A tricked. And a misogynist. He doesn't know what a misogynist is. He's a trickled down racist and a misogynist. Now I know why he lost. I mean, you talk about communication. So the guy was on yesterday CNN. And I said to myself, it's absolutely pathetic. He lost. He choked. Like a dog, he choked. And now, it's time for somebody else. We're going to win, folks. We're going to win. We're not going to be choke-y. I don't choke. I don't choke. I backed John McCain. Good guy. That was a tough race, because a lot of bad things were happening. I'm not sure if Abraham Lincoln could have won that. But I backed John McCain, big league. I backed Mitt Romney, and he choked and he lost. And I said, this, folks, we're going to do it ourselves, and we're going to win. We're going to win. We're going to win, folks. We're not going to put up with this stuff. And we are going to win. You know, one of the great journalists actually called me. Happens to be a liberal, but that's OK. Everyone once in a while, that's OK. Do we hear. Who cares? You know we're going to make America great for everybody. Not for conservatives. Not for Republicans. Not for Democrats. Not for liberal. We're going to make it great for everybody, folks. We're going to make it great. But he called me and he said, you know, you've done something that nobody else has ever done. I said, what's that? He said, what you have achieved in the world of politics has never been done before. And honestly, Bill O'Reilly who's a very tough guy and very smart guy, said it's one of the greatest -- and it's the greatest, actually -- political phenomena that he's ever seen. Not bad, right? I mean, you know. And others. Even said that he hates me. This guy hates me. The level of hatred from some of these people is incredible. And a lot of it's because they were wrong. You know they were wrong. They said, you'll never run. He's never going to run. You know, they say he paid a lot of money to be prognosticators, right? Donald Trump will never run. The next day, I announced I'm running. Then they say, well, Donald Trump has started to run, but he will never do very well because we have all of these great candidates. So I decide to run, and I started off, you know, with -- you start off like everyone else. You start off with nothing. And then the first week, I went to 8. Well he has reached the ceiling. He'll always able to get 8, but he has reached the ceiling. Next week, the polls come out, he's at 14. Well you know, that's surprising, but 14 is his absolute ceiling. There is no nothing he can do to go higher than 14. Then I go to 20. Then I go to 28. 32, 38, 48. 51. Then I go to 55. Then in New York, I get a 62. Then in california again, 78%. And you know what, something that nobody talks about because they don't want to. If I was a Democrat, they'd talk about it plenty. In the history of the Republican party, right, you know. Abe Lincoln. We're talking about a long time. In the history of the Republican party, I've got the most votes. You got the most votes. I'm the messenger. I'm a good messenger. You have to say. You're doing a great job. I'm just the messenger. But in the history of the Republican party, Dwight D. Eisenhower, great guy. We won the second World War, and I think other people had something do with it, in all fairness. But he's got a lot of credit for winning the second World War. He runs for president. I beat him. Richard Nixon. We beat Richard Nixon. Ronald Reagan, who we love, we beat Ronald Reagan. We beat Bush. We beat everybody. In the history of the Republican party. We, we, we, all together. The movement, got the most votes of anybody in the history of the congress. But I don't mean by right. We've beaten them out. Oh, we edged them by a Couple of edge.No, no. By millions of votes. By millions and millions of votes. You know, it's amazing. And the Republican party, I'm not going to take full credit for, but I'll take 99.9. The Republican party got more votes and had the biggest increase, about 70% increase, over what it was four years ago when we had that loser Mitt Romney representing us. 70% more people. And the people that support us -- you know, a lot of people, they weren't at the polls. So 40 years, I see them. Men, women, they're at the polls. And I remember in South Carolina and New Hampshire. New Hampshire, I love -- I mean, these are the states where I did really well early, and it was an amazing thing. The feeling I have. By the way, I'm going to make a pretty good speech on Monday, so stay tuned. Stay tuned. I'm going to do it in New Hampshire because that was the home of my first victory. I went to New Hampshire. Bush was favored to win. From that whole thing. No. Low energy. Low energy, folks. And he's not living up to his obligation, because when he signed the pledge, he said, I will do this. Meaning, I will endorse whoever it is. It was me. And he says, I won't do it. So what he's doing is, you know, very -- it's very dishonorable. But Bush, he's favored to win, except when I won in a landslide. And we won in Massachusetts. Now it's nice that Tom Brady likes me. That helps, right? We got almost 50% of the vote. We got almost 50 percent of the vote with like eight or nine candidates in there. Now you know I never got credit for that, because when these pundits who hate me. I even did some of them, but most of them hate me. But when these pundits go out, right, they go out, and they say Donald Trump only got 34% percent of the vote. They didn't say there were 15 candidates. Actually getting 35% of the vote with 15 people in the race is is better than when I got 78% in California. And just remember this, with California, they had a lot of names on the board. You know, it's not like it's totally over. They could vote for anybody they want, because all of the names or many of the names are on. So when you get all of these numbers, but all the time, I had to listen to this, because I think it's the largest deal in the history of elections, the 17 or 18 people that started. So I was competing against all of these governors and senators and very capable people like Dr. Ben Carson, who's a great guy, by the way. Great guy. And I spent years in Philadelphia -- and Philadelphia is not Pittsburgh, right. I know that. But we love Philadelphia, too. Brotherly love. And we do love Pennsylvania, and that's where it all comes together. But so I've been in this state, and I know this state very well. And this is a great, great state. So I win Pennsylvania big, big. And then I win Connecticut big. In fact, they just did a poll in Connecticut. Republicans are not supposed to even waste their time going to Connecticut. I love Connecticut. A poll just came in where I'm a few points behind, and people are saying that's incredible. A poll just came down in Pennsylvania, by the way where we're leading. A poll just came out in Ohio where we're leading. A poll just came out in the great state of Florida, we're leading by two points, and we haven't even started campaigning yet. You know why we're leading? Because people are sick and tired of this stupidity that's going on with our country. They're tired of it. They're tired of it. We're going to have a great country, and we're going to have a country that's unified. We're going to have a country -- I thought one thing about Obama. I thought that Obama would be a cheerleader for the country. That's the one thing. I never thought he was going to be the president in terms of greatness. I thought he'd be a great unifier, a great cheerleader for the country. He is a great divider. The country has practically never been so divided as it is now. And we're going to bring everybody together, folks. White, black. We're going to bring everybody together. We're bringing our country together. The richer, the poorer, everybody. And you know, one of the reasons we're going to bring it together, it's the old story. It's called jobs. Because I'm not going to let other countries take out jobs. Like Carrier, where they move their factory to Mexico, they fire everybody. And Ford where they take tremendous numbers of people out of their system, and they build these massive plants in Mexico. And so many other countries. You know, it's funny. So many of these companies, they're ran and owned by friends of mine. So now I'm getting calls. They say, Don, please don't mention my company. Please don't mention my company, and I'm running out of companies. And I know so many of these guys. But you know, when people are friends, you don't mention their companies, right? Should I, or not? Yeah. I won't. You gotta be loyal. By the way, there's no shortage, I can tell you. The list is is a mile long, of companies that are leaving. Look at this area. In ten years, you've lost 45, 50% of your manufacturing jobs. Whoever heard of a thing like that? I mean first of all NAFTA is like one of the worst things ever to happen to our country from an economic standpoint. And who signed NAFTA? Bill Clinton. And a lot of people said, oh, we had pretty good economic times with Clinton. Well, we didn't have good times, if you remember. There were a lot of bad times. First of all, he was impeached. There was a big impeachment mess. It was a mess, just like it will be with Hillary. With Hillary, it'll be worse. But remember this. I think called impeachment. Remember the turmoil in the holy -- but just think. We did OK. But the people that followed him because of that horrible thing he signed got killed because NAFTA stripped the jobs out of this country. I toured New York. I toured Connecticut. I toured Pennsylvania. I toured all over the place. I was in Maryland. I look at places that were vibrant 20 years ago, with incredible factories, and those factories, you could buy them for $1. You can buy them for nothing. And actually, from a real estate standpoint, you should do it, because if I win, those factories are going to be put back to work again. Believe me. Although they're in pretty bad shape, you'll probably just rip them down. But we're going to have our jobs back. OK. Not such a bad investment. I just saw this recently. It's in one of the papers, that cashing in. Illegal immigrants get $1,261 more welfare than American families. They got five -- think of this. This is illegals. $ 5,692 versus $4,431. So they get more money than American families get. Where are we -- what are we doing? What are we doing? Now what are we doing? You know, they're all screaming, build the wall. It's not just the wall. But we are going to build the wall. You know, recently, the president of Mexico from a few years ago, Vicente Fox. He was on television. You know what happened. And he threw around the F bomb. And he said, we will not finance or give the money to build the wall. But he said it differently, because he said we will not pay for that F bomb wall. The F bomb. He used the F on live television on CNN. I said, whoa, he's he's going to be -- oh it's gonna be so bad tomorrow. Where do you see. it? Nobody wrote about it. Can you imagine if I used the F bomb. Would that be. That would be the electric chair, right? They'd give Trump the electric chair. OK. If I use the F bomb. So he said, we will not, under any circumstances -- always said he was going crazy, sitting in a chair. I thought he's going to -- look, I won't say. But he was going crazy. But we will not pay for that f bomb law. And I said whoa, is he in trouble. But then I said to myself, hey, I'm happy. Because two years ago, he said we will never allow that wall to be built. So now, at least he knows it's going to be built. And the reason. Look, the reason -- this is very important -- the reason that they're going to pay for it -- we're going to have a great relationship with Mexico. Much better than we have now. We're going to have good relations. When Sergeant Tamaricio -- remember Sergeant Tamaricio? He made a wrong turn. He had a lot of difficulties. When Sergeant Tamaricio was there, they kept him in the worst prison. They treated him horribly. They should've let him go. He had difficulties. They should have let him go. And they didn't let him go. And I don't even know if anybody called. I'll tell you what, I would have been on the phone the first night. I would've called the president of Mexico. I'll say, let him go. Let him go. I don't think Obama called. The guy was in there for a long time. And I helped him out and. And I helped him out, and Greta helped him out. I have to say, Greta. Greta Van Susteren helped him out. And I helped him out. But relationship, as you call him up, you say, do me a favor. Guy made a mistake. Let him out. Because the people were going crazy. And how about this? Bergdahl. Right? Sergeant Bergdahl. Sergeant Bergdahl. Here's the way we deal, folks. We get Bergdahl, a total traitor, where probably five or six people were killed trying to find him. Probably -- definitely five, probably six, killed going out trying to get him back. So we get Bergdahl, and they get five of their worst killers that they've been after and trying to get out of prison for nine years. So we get one, they get five. Those five now. I saw just the other night. They're back in the field trying to kill everybody, including us. Folks, folks, we got to be so much tougher and so much smarter. I call them the five for one president. And how about the deal with Iran? We get nothing. We gave them a $150 billion, and it was only after that. Remember, they took our sailors, our 10 sailors. And they would kept them forever, except they wanted the money, it was due the following day, right? So stupid, they're not. So they humiliated us. They humiliated the sailors. Then they let him go. And I remember after a few days, and Kerry said, we would like to thank Iran. They got $150 billion, all right? Who the hell would have kept him. So they would have kept him, believe me. And that should've never happen. We had hostages. We should never have negotiated while those hostages were held. We should have said, gone into the room, say, release your hostages. If you don't release the hostages, the deal's out. Get up. Walk out. They're great negotiators, the Iranians, the Persians. They're great negotiators. Always have been. You know you're not supposed to generalize. I'll generalize. OK. They've always been great negotiators. And we've got a guy who doesn't know what the hell he's doing. Secretary Kerry, President Obama. President Obama -- President Obama is incompetent, OK. He's incompetent. Remember that. He's incompetent. Now. Yeah, we have a president who doesn't -- just doesn't have it. He doesn't have it. So here's what's going to happen. Here's what's going to happen. And what should happen then. You get up and you walk, the art of the deal. I mean, you know give me a break. We never walked once. You know did you ever see that negotiation. We would like to have the following the Americans. No. They go, No. Oh, OK. We'll agree with you. Everything was no, no, no. OK. We'll take it. We'll take it. Never walked, never left. They should have said, we have to have our prisoners back. Look, folks, they don't help you. Good for us. Our people are angry. Good thing for us. You've got to release them. They will say no. They're going to say no, we're not going to do it. And then you say, sorry, we can't negotiate. You leave the room. You get on the plane. You double up the sanctions. By the time you land in Washington, you're going to turn around the plane. The prisoners or hostages will be released 100%. Like 100 -- you know, I hate to say the art of the deal, because that's so simple, who would even write about it, right? Who would even have to write about it. And then you start to negotiate. And the other thing, I negotiate two points. And then nuclear is very important. I love negotiating. But you have to get a good deal. Not a deal that's going to destroy Israel, which this deal will do. This deal is so destructive for Israel and our country, that how they could have allowed it to happen is incredible. How they could have allowed it to happen. So I want two things. I want our prisoners back before we start. They would have been back three years ago. That was the longest negotiation. You know usually, a negotiation that takes that long is no good. That's No. 1. But you know, we sat there just for years just giving them everything they wanted. How about this? They were dancing all over Iran at the deal before it was signed. Who the hell signs the deal when the whole country is saying how stupid you are getting this deal before you signed it. But they wanted to sign the deal. Horrible for our allies. Horrible for Israel. Very bad for us. We've created a real power. The second thing I wouldn't have given them. I would have never given them the $150 billion back. Wouldn't have. And I would have done it -- you know, my father was a great guy. He was a builder in Brooklyn and Queens. And he said to me, I learned a lot. And I sit in his knee. And I learned by osmosis. He didn't really teach me. I just learned. You know he'd be on the phone with a plumber or with a sheet rock guy or with a pipe fitter. And he said, no, no, you got to lower your price. Can't do it. Can't do it. You know, I grew up with that. It was like in your brain. And now, we're doing the old post office. We're way below budget, way ahead of schedule. Everybody wanted it in Washington D.C. The old post office in Pennsylvania Avenue, right near the White House. I always said, if I don't make it folks, I'm still going to be living in Washington D.C. OK. And it's gonna be a great building. It's gonna be -- I think we're going to make it, right? I tell you what. I'll tell you what. I'll tell you. I really think we are going to make it. And I think we're gonna make it big league. And we're going to turn our country around. By the way, the old post office. So the old post office, right now, is almost two years ahead of schedule. And I told my people, don't say two years, because it's not a believable number. It's almost two years. But I say it's not. But just say it's a year ahead of schedule. Because two years, it almost sounds too much, but so I'll say it, we're 2 years. But we're a year ahead of schedule, and we're under budget. And the quality is much, higher. I think it's gonna be one of the great hotels of the world. It's going to be Trump International hotel on Pennsylvania Avenue. And we're going to open in September. But I think we're going to have probably our opening ceremony toward the end of October. I don't want to have it too early. But think of this. We're under budget and ahead of schedule. Do you ever hear that from our government, right? You ever hear that? Never hear that from our government. So a lot of things are happening. The run has been amazing. The crowds, the momentum, and the movement has been amazing. No matter where we go, we have 20,000, 25,000 people. In Mobile, Alabama, we have 35,000 people. We have by far the biggest grass. Far bigger than Bernie Sanders. And by the way Bernie was second, I have to say, but it wasn't even close. But you know during this whole campaign, and I was saying, a number of weeks ago, I think weeks ago, we had a crowd 17,000. Bernie had three on the same night, different cities. So we had 17. And I had the folks at CNN, actually. And they were saying, this is so-and-so from CNN, I'm at a Donald Trump rally, and everything's good. Ha Ha Ha. And you got to see the spirit in the room, people are going crazy. They're standing ovation. There were seats, but nobody was sitting down. The people were going crazy, and you listen, it sounds like there's 200 people standing there right. And that's the end. And now, over to you. And then Bernie Sanders rally. So they didn't mention 17,000 people, right, or 18 -- whatever it was on. A lot. Now they go to Bernie's. We're at the Bernie Sanders rally. It's a massive crowd -- they have to have at least 3,000 people. It's unbelievable. Look at all the people. So I have 17,000 people. And it's like falling asleep for the reporters. He has 3,000 people, and they're talking about the 3,000 people. Let me tell you, folks. As Republicans -- as Republicans, and the more conservative you get, the harder it gets. It is so unfair the dishonesty of the media, the dishonesty of those people back there. But the beauty of it is. The beauty of it is that the people are really smart. They get it. I mean, they really understand what's going on. It's an incredible thing to see. They get it. That's why I love my party. You don't see any protesters. Are there any protesters? Because I love the protesters because the only time the cameras ever turn to show how massive these audiences are, the only time -- I mean, it's like an incredible thing. It's when we have a protest -- do we have a protester anywhere, please. Sometimes, you know what I'm going to start doing? Taking friendly, putting them up in corners of a room and letting them protest. OK. That's the only time. I didn't think they could move the cameras. I thought they were maybe modern equipment, it's fixed. And then about my third speech, we had a protester. Bad guy. Nasty. Loud. Started swinging at people. And when my people swung back, it was like, oh, my people are terrible. My people are terrible. But this was a loud guy. And then all of a sudden, it was like in a strange corner of the room, and those cameras that I didn't think could move, I thought they were fixed wing. All of a sudden, they're bent like a pretzel. Everything -- they're getting the protester from every angle, every shot. Now there's tremendous dishonesty, folks. There's tremendous, tremendous dishonesty. But with all of that, with all of the stuff that goes on, and all of the phony reporting and dishonest reporting, the people are getting in. And that's why we're being covered like nobody, no place in the world. What's going on is being covered like no place in the world. You know the Republican party was a little bit stayed. Was that a nice way of saying it? A little bit stayed. Stayed. You know how to spell stayed, right? And the Republican party was not exactly the most exciting place to be. And this year, we're up 70, and the Democrats are down 32 or 33 in the primaries. OK we're up 70%. And they're down 32. Think of it. So what's happening is an incredible thing. I have to say this. I said to the leaders of the Republican Party. Folks, you've got to get tougher. You've got to be tougher. You've got to be strong. We've had a lot of losses. We've lost a lot of these presidential elections over the last long period of time. You've got to get strong. You've got to get tough. You've got to be smart, or you're not going to have a lot of victories. And I'll be honest, I'm talking about for them. Because I think I'm going to win anyway. I really think I can win. I don't want to do it that way. Do you understand what I mean? I'm not even sure it's not better for me. But I'd like to see the Republican leadership get very strong, very sharp, very smart, and be cool. You got to be cool. But we're winning either way. We are going to win either way. And we're going to set this country back on course. And we're not going to protect all of these nations where we're subsidizing the military protection of massive nations that are making fortunes of money and they are paying us a fraction of what it costs. Can you imagine? As an example, Japan, great people. I love it. But we subsidize Japan, and yet, they're sending us cars. You know what we send them? Wheat. We send them beef. They send us millions of cars, and we send them beef. And they don't want the beef. Half the time, they want to send it back. They don't even want it because their farmers don't want it. You talk about a trade imbalance. Take a look at the trade imbalance between the United States and Japan. One of the great trade imbalances anybody has ever seen. It's cars versus a piece of Kobe steak. You know why Kobe steak, because it gets back and forth so much, that by the time it finally gets in Japan, it's rotted. And that's why Kobe beef is right. It's old, old, old beef that they charge a lot of money for. A pretty sad way. But let let me just tell you something. Let me just tell you. We've got to be smart. We can no longer subsidize all of them. We subsidize Germany. We subsidize Saudi Arabia. Saudi Arabia. Now before the oil went down -- they're still making a lot. But before the moment, they were making a billion dollars a day. And we're subsidizing them. We have our military. We are paying the rent on military bases. We're paying rent. They're charging us rent. And we're over there to protect them. And honestly, I have many Saudi friends. Obviously, many German friends. Obviously, I have a lot of people from Japan and other countries, South Korea. We have 28,000 soldiers on the line between North and South Korea. And every time potentially the madman raises his head or opens his mouth, we send our ships and our planes and we have everybody read. They gotta pay us something we don't get. And if you can you imagine if these countries payed just a fair price for this, you're talking about a whole different United States. This isn't 40 years ago, and it's not 20 years ago. We are stone cold broke. We owe 19 trillion dollars. Nobody even knows what a trillion is. They don't know. I have a smart guy, made millions and millions and maybe billions of dollars on Wall Street. I'd say define trillion for me quickly. He said, let's see, it's blah, blah, blah. You know how much money this is. We owe 19 trillion, going up to 21 trillion because of the omnibus budget, which was passed. Which by the way, allows Syrian refugees in. We have no idea where they are, who they are, where they come from. Excuse me folks. They're coming to Pittsburgh. You just don't know it. OK. They're coming to Pittsburgh. You don't know. They're being put all over the country just like they want to be. And who knows? You know we talk about Trojan horse. We talk about Trojan horse. And maybe it's a Trojan horse. And maybe it's not. But we have enough problems in this country. When you look at Paris. When you look at San Bernardino. When you look at all these different places. Couple of things I have to tell you. We're going to give you a massive tax decrease, and get this country back to work for business and for bidding. Hillary Clinton is going to raise your taxes very substantially, possibly to 55 or 60 percent. That is going to be the end. She's going to raise your taxes. And you know what? She has no plan. She doesn't talk about it. She won't talk about it. She's got to raise them to at least 55 percent. I'm lowering taxes substantially for the middle class who are being run out of our country. And I'm lowering them for business. Big league. Another thing. We're getting rid of Common Core. We're going to bring education local. Local education. We're repealing and replacing Obamacare. 100%. Disaster. Obamacare is a disaster. Hillary Clinton wants to abolish the Second Amendment. In other words, she wants to take your guns away, folks. Now the NRA, National Rifle Association just endorsed me. I think it's the early endorsement they've ever given to a candidate. So we are going to stand totally strong. Totally strong. They want to abolish it. They literally want to take your guns away. You know, if in San Bernardino or in Paris. Paris is probably the toughest place in the world to have a gun. So these thugs walk in, and they go boom, boom, boom, kill 130, hundreds in the hospital, still in the hospital. They'll never be the same. Just horrific injuries. And if we had a couple of like the folks here. Like this guy here with the Trump hat on. The blue Trump hat. Right there, the handsome man with a beautiful head of hair. Look at the beautiful head of hair on that guy. What are you wearing a hat for? If we had a couple of people in San Bernardino, or let's say Paris, they were in there and they had a gun right around here or a gun strapped around their ankle, and the bullets were flying in the opposite direction also. No. 1, they probably wouldn't have even gone there if they knew there were guns. OK. Remember that. Don't underestimate that. But No. 2, assuming they did, and they started playing games, the carnage is going to be one hell of a lot smaller than it ended up being. So we are going to protect our Second Amendment. Hillary Clinton wants to abolish your Second Amendment. And I'll tell you what. On that issue alone, I think we win the election. I really do. I think we win the election. So a lot of things have happened. Our country doesn't win anymore. Our military, as we said, is depleted, but we're going to start taking care of it, and we're going to knock the hell out of ISIS. You're right. We're going to knock that. We have no choice. I didn't want to go in Iraq. I said I didn't want to go from the beginning. I didn't want -- you're going to destabilize the Middle East. But you know what -- and that's exactly what happened. I've been a good prognosticator. You know, about a month ago, I was asked on CNN by Wolf Blitzer. I was asked about NATO. Now I'm a business man. I'm not like asked about NATO too often. It's not like, oh, gee, I'm the old Timex, but I have a lot of common sense. And I know NATO, and I understand NATO. He said, what do you think about NATO? Something to that effect. And I said, well, let me tell you. No. 1, it's obsolete, because it doesn't really cover properly terrorism. No. 2, you have countries in there, because I read this someplace, that aren't paying what they're supposed to pay, and some aren't paying practically at all. And we're protecting them. And if something happens to them, what do we do? Go into World War 3 over a country that's not even paying us. And the next day in the press, oh, that's terrible. What a terrible answer. He doesn't like NATO. Oh bunch of phony people. And then about two weeks after I said it, some people -- you know, you can't see the forest through the trees, right? All of a sudden people that were experts in NATO were saying, you know, Trump had a point. It is obsolete. And we don't really cover terror. And we don't need to have the right countries in there if you're talking terror, because it's a different kind of terror. And Trump's right. And you know what else? A lot of these countries aren't paying. They're not paying. They owe us 2% percent of GDP, or 3% of GDP. They're not paying. Because it's like in the real estate business, you know real state, we say they're delinquent. They're not paying their bill. They're delinquent. They're not paying. We have to get somebody to ask for the money. They gotta pay. We were protecting, and they don't pay. And all of a sudden, people are saying, NATO was good. All right. That was the end of that. Then three days ago on the front page of The Wall Street Journal, NATO to open up massive terror operation. And I don't even know that much about NATO. It's called instinct. It's called common sense. That's what you need. And they don't give me credit. They only said in the article, like a little half sentence. Donald Trump complained about it also. Great. Thank you very much. I appreciate. Because of me -- and they've taken like one of their top, top, top generals, and they put him in charge. Good thing to do, by the way. Good thing to do. But I'm the one. If I didn't give that answer, and then the answer got a lot of heat, and then it got a lot of praise. But now, they open front page of The Wall Street Journal, whole big article. NATO to operate an open major terror group. Meaning, to oversee. And one of their top people is put in charge. That's common sense, folks. That's common sense. Remember I said take the oil. I didn't want to be in Iraq. But I said when you leave, take the oil. But you know who's gonna get the oil. ISIS already has the oil. And Iran is going to get the oil. You think Iran made a good deal with that deal. They made an even better deal because we practically handed them Iraq. For years, they would fight each other, right? They'd fight, fight, fight. Their military was almost identical. They go 10 feet this way, 10 feet that way. 10 feet. Then they take a break for two years. Then they fight. That's what they do, they fight. We found that out. They go and they fight. And this went on for decades. Then we decapitate -- stupidly, we decapitate one of the militaries. And now Iran, as sure as you're standing here, Iran is taking over Iraq. We gave it to them. We handed them. They wanted to do it for forever. And we handed them. That's better than the Iran deal that our very incompetent Secretary of State signed with him. So now Iran is going to end up with Iraq. They have Yemen, and they don't want Yemen. But they love the border to Saudi Arabia. And let me just tell you. I said Saudi Arabia doesn't pay us nearly enough. Boy, what I'd do. I say fellas, I saw that magnificent 777, Boeing 777. You guys never want to fly commercial, do you? Because you know what, if we ever left Saudi Arabia, that thing would be gone so fast. So fast. And all you need is somebody that knows how to negotiate. They got to pay us for our services. They got to pay us. And if they pay us, we have a whole different country. If these people -- and we're not doing it as a threat, and you have to be prepared to walk. It's possible we have to walk. And don't forget, we now have energy capacity that we're not even using because of all the restrictions and all of the problems. We now have -- so we don't need these countries that we've died for and spent trillions of dollars for. So they got to help us out. They got to help us out. And just in closing I'll say this. Look, when I decided to -- I didn't need this. It's 140 degrees up here. That's the end of this suit. Soaking wet. Does anybody want my jacket? You don't want it. I don't need this, but I'm having a lot of fun. I'm getting to know the people in this country. We have unbelievable people. This country, when I say Make America Great Again. It's gonna be Make America Great Again for everybody. And it's also gonna be we can make America -- I really believe this greater than ever before. You know when we had the debates, I didn't know anything about debating. And yet every single poll. Drudge, great guy. Time Magazine -- every single poll had Trump winning every single debate. Every poll, every debate. I was on center stage, and I didn't know. I mean, Ted Cruz was this great student from Harvard and Princeton, and he was a debate champion. And they had me winning every debate. OK. I don't want to get into -- you know what? I liked Ted Cruz. I just like -- he's got a side. Nice guy. I don't care if people endorse me, but I do want them, when they sign the pledge. They gotta sort of live up to what they say, because then I have -- I feel definitely. But we did great. But here's what happened. They go out. They go on Fox. They get 24 million people. The largest in the history of cable, right? Then a few weeks later CNN goes on with the debate. The largest in the history of CNN. They cover wars. They cover big events. The debate. They have 23 million people on CNN, largest in the history of CNN with all they've covered, and with their long and very incredible history. So they have the big -- two biggest events in the history of cable television. Now I'm not going to say it's because of me. But let's say if I was in, what would you have, two people watching. OK. So something's happening out there. It's a great thing. It's a beautiful thing to watch, I'm telling you. There's a movement going on that's incredible. One of the pollsters say any number that Donald Trump gets, you can add something to it. Because a lot of time, it's a very embarrassing statement. You know it goes both ways. Sometimes you'll have this stiff who's a nice person. And everybody wants to say, yes, I'll vote for him. But then they get him to vote for somebody else. With me, it's just the opposite. They say, when he goes into the boat, they won't tell us, because they don't want us to know that we're voting for Donald Trump. Somebody said, he's too tough. Hillary says, I don't like his temperament. She said, I don't like his tone. We have people chopping off the heads of Christians and anybody else who gets in the way in the Middle East. We have people killing people at the border like you've never seen before. The crime is far greater than anybody knows. I was right about that, by the way. And we have all of these things happening. And she says, I don't like his tone. Well let me tell you a book was written by a Secret Service agent. And they talked about Hillary. And they said, she's a horror show. She's got the worst temperament they've ever seen. She's a maniac. And if she was ever president, it would be a disaster. So folks, folks, true. True. So true. So folks, we don't win anymore -- but we're going to win. We're going to win with our military we're going to win a trade. We're going to win at the border. We're going to win with health care. We're going to win with education we're going to save our second amendment. We are going to win again folks. We are going to win so much. I won't go through the whole exercise, which I love doing, and you love hearing. But you know what, I won't do it. I'm just telling you -- he says, do it, please. I'm just telling you we are going to win so much, you're going to be so proud of your president, and you're going to be so proud -- much more importantly, you're going to be so proud of your country. We're going to win. We're going to reduce your taxes. We're going to save your Social Security. We're going to win at every single front. I love you, Pittsburgh. Thank you very much, folks. Thank you. Thank you. Thank you."}