{"id":385,"author":"Donald Trump","title":"Speech: Donald Trump in San Jose, CA","date":"2016-06-02","link":"https://factba.se/transcript/donald-trump-speech-san-jose-ca-june-2-2016","paragraphs":["Thank you. Latinos for Trump. That's what I like. I love that. Latinos, we're doing well with Latinos. Nobody knows about it yet. We're bringing in so many jobs in. You watch what happens. The Hispanics, we love the Hispanics. Thank you, everybody. So, so I said to my people, what the hell are you doing?","Who's going to come tonight? You have San Francisco playing the game tonight. And look at this crowd. This is unbelievable. Well, we'll speak a little bit faster tonight so you go home to the game, OK? No, no, no. Let's take our time. Yeah, anyway. Well, thank you all very much. It's been an amazing period of time.","You know, you had the 1,237, right? 1,237 delegates and I promised everybody, I told everybody we were going to hit that number and now we're going to hit a number that's way, way above, way, way above. Remember, they all said, oh you have the convention and the convention is going to be a big deal. And I said, we're not going to the convention for that.","We're going to the convention as victors before the convention ever starts. So we're going to have a great time in Ohio. We're going to have a great time in Cleveland, Ohio. And I really appreciate this turnout. This is fantastic. I really do. So on Tuesday, you got a big vote coming up. I mean, honestly, we already won.","But in terms of mandate, in terms of going out there and really getting it. I hope you can go out, vote and, you know, we have a few states, right? It's the end. It's the end now. Here's what's important, in the history of the Republican Party, Dwight D. Eisenhower, Ronald Reagan, everybody, everybody. In history, we have the most votes ever cast for a Republican candidate.","Never happened before. And by millions, by millions, by millions of votes. And the amazing thing about that is, I think, we do even better in November because we're going to take a lot of people from the Democrats. You know, Bernie Sanders, Bernie Sanders, the system was rigged on him. I think we're going to get a lot of people from Bernie.","We'll see what happens. I mean, I watched Hillary today. It was pathetic. It was pathetic. It was so sad to watch. And you know, she's up there and supposed to be a foreign policy speech, it was a political space. Had nothing to do with foreign policy. She made a political speech tonight, folks, and it was a pretty pathetic deal.","But listen, on Tuesday, so we have California, we have Montana, we have New Jersey, we have New Mexico, we have South Dakota. So we have those states, and that's the end. And at the end of the night, we will be many, many, many millions of votes ahead, of the highest vote getter in history, and that tells you something.","Now, you're a hell of a crowd. You don't like basketball very much. You are a great crowd, man. Thank you. I love you. I love you. I love you, folks. I'm telling you. So. We, we are in a movement. They've never seen anything like it. Some people, many people, even people that hate me, the pundits, who are totally dishonest, by the way, but that's OK. Some of these pundits have even said, almost all of them that there's never been anything like this that's ever happened in the United States.","Never been. Amazing. Yesterday, we had an amazing crowd. We had these airport hangars packed with people. And a friend of mine said, I loved your speech yesterday. You know, it's on all the networks. It's all over the place. He said, were there any people there? I said, yeah, it could have been like 20,000 people.","I couldn't tell. They never showed the people. They never ever showed it. But who cares? Do we agree? Who cares? People are getting it. People are getting the idea. People are getting the idea. So what we have to do is this, we have a movement going on. We're on the cover of every newspaper every magazine, Time Magazine many times.","I just learned they're doing yet another cover on Trump. I love that. You know, Time magazine is a good magazine. You grow up reading Time Magazine. Whoever thought you'd be on the cover of Time Magazine, especially so much. And it's all about the movement. It's all about the fact that we're taking back our country.","And by the way, we're going to be very inclusive to everybody. We're going to be very inclusive to everybody. I know we have a lot of people, they're angry at what's happened. We have a lot of smart people that are making less money now than they did 18 years ago and they're working twice as hard, OK? We are going to bring our jobs back, folks.","We're going to bring back sanity to our country. Gonna bring those jobs back. And we're not going to let the jobs go so easy. You know, I talk all the time about Ford and Carrier and Nabisco, where they leave and they move their plants to Mexico and other places and there's no consequence. There's going to be a big consequence.","Let me give you an example, OK? It's so easy. For six years, I've been watching politicians saying, we have to stop the onslaught of people leaving -- of companies leaving our country. I've been watching this in amazement. I never thought I was going to be doing this. Have I done a good job, OK? Have I done a good job?","You know, it's funny before I get it. So I've been doing this now for 10 months and they had an article one of the magazines said, it was 10 months versus 200 and some odd hundred years of experience because we ran against 17 people. And if you add up all of their tenures, 200 and something years. So for ten months, with no experience, we are doing well, folks, I'll tell you.","But don't let the no experience fool you. I've been on the other side of the equation. I hate to tell you this. I was very much a part of the establishment. I was a big donor. And I was on the other side. But I know the system better than anybody else because I know how it works on both sides. I've been there so long.","I know so much about lobbyists and special interests or whatever the hell you want. And with me you're getting me -- I'm representing just you, just you. So in the primaries -- on the primaries, I spent $55 million of my money. And in fact, somebody said, I guess, for legal purposes, they put it down as a loan where I loan myself $55 million.","I will say to you tonight, I've been saying it all the time, I'm going to term it -- I don't even want it as a loan. I don't even know why. When somebody does it, they always put it down as a loan. I'm not paying myself back. We're wiping out that loan. I've mean for $55 million I turned down, I turned down and it always was intended to be that way.","Sometimes the lawyers do things you say, why are you doing that? They almost can't explain it. But it seems that many people do that. But we're terminating that. Millions and millions of dollars was offered to me and I said, no, I'm not interested in it. Now what we're doing is we're working with the Republican National Committee.","They have treated me fairly, by the way, or I guess I wouldn't be. Yeah, I think I would have been no matter what because frankly, we won by such landslides and no matter what they wanted to do, right? We won so big. No matter what they wanted to do. You know, I tell the story all the time about the prize fighters.","They go out and they fight in somebody's home territory and I know so many of the prize fighters. I have a lot of prize fights. I've always liked it. I've held many more Mike Tyson fights than anybody else. But I've had a lot of fights. And I'll say, why are you going to that community? A lot of money there, Mr. Trump.","A lot of money. But if you come to a judge's call, they're going to rule against you if it's a close fight. Not even if it's a close fight, they're gonna rule against you period. They said, there's only one way to solve that Mr. Trump, I got to knock him out. And that's what we did. That's what we did because it's a rigged system.","It wasn't meant for me to win. The system isn't set up like that. But we won in New Hampshire so big. I love New Hampshire. We're going to solve the -- you have a tremendous drug problem, heroin, in New Hampshire. We're going to solve that problem. We are gonna to solve the problem. It's coming in from the southern border.","We want to solve the drugs that are pouring in to our country. We're gonna solve it, OK? We're gonna solve it. But we won New Hampshire -- we're going to build that wall don't even think about it, don't even think about it. And who's going to pay for the wall? Who? 100% right, OK? 100%. You know, I was watching, coming in I have the television and I'm watching.","And one of the shows had a poll came out. And I like the poll because I'm doing very well and in some of the polls now, I'm beating Hillary Clinton and quite easily. We love that. We love it. Fox had a very good poll came out a couple of days ago. We're number one and we're right around. Believe me, folks, when you watch her today, she does not look presidential, that I can tell you.","She doesn't. This is not a president. Four more years of this stuff and I'll tell you, we're not going to have a country left, believe me. And if I win, believe me, make America great again and it's gonna to be greater than ever before. We have a chance to be greater than ever before. Greater than ever before.","But a poll came out and it said, do you think Trump is going to build the wall? These people just don't understand. Remember when I first announced, they said, you think Trump is serious? And the pundits would say, well, he's not going to run. And then if he runs -- so that I announce that he's running. But if he runs, he's only going to have fun for a couple of weeks, build up his brand, my brand.","I get killed. I had such a beautiful brand. I get killed with my brand with his stuff. You know why? If you get 55%, you have a landslide. That means at 45% of the people hate you. In the old days, I had 100% of the people that love me. Now, I have 55% of the people that love me. But really more than that, if you look at the last -- that's OK don't worry about it. He's very quiet.","Let him enjoy himself. I want him to enjoy. We need our protesters. I love -- no, no leave him alone. That's OK. That's all right. Now leave him alone. We got to be nice. Don't forget. Don't forget. The only one I hear are you people. I don't hear him, all right? All right. Don't hurt him. See, the way I say that, I've learned.","Don't hurt him. Don't hurt him, please. No, he's fine. I would have left him here because he was fine. But but here -- wow look at all the people that are forming back there. This is crazy. Man. It is true though. I said, where the hell -- these people are going to be at the game. I don't know how many people are at the game.","But this is better. Is this more fun than the basketball game? And you know what's more importantly, honestly, it's a lot more productive and I like basketball and all of that. This is about America first. This is about putting our country first. It's about showing people that we're not going to be listening to stupid people anymore, that we're not going to have people making deals like the Iran deal, like the Sergeant Bergdahl deal.","They get -- I mean, think of it, they get five of the people that they've wanted for eight years and we get Sergeant Bergdahl, a traitor, where five people were killed looking for him. These are the deals, the five for one -- I call him the five-for-one president. So we're not gonna do that stuff anymore, folks.","Those days are over. The days, the days of the Iran deal where they get $150 billion. We get nothing in that deal. Nothing, except laughed at and scorned. And then I watched Hillary Clinton, she started the foundation of that deal and now she's proud of it. But she's only proud of it for one reason. You know why?","Because Obama wants it. Anything Obama wants, she's going forward with. Because you know why? She doesn't want to go to jail. That's why, folks. That's why. Remember, Hillary Clinton used to hate Obama. She used to hate him. Bill Clinton hated him. Bill Clinton hated him. He called Bill Clinton a racist.","You remember that? Bill Clinton hated him and Hillary Clinton hated Obama. Now it's, yes, sir, Mr. President, sir. Yes, sir. What would you like? What would you like me to say here, sir? The only reason she's behaving like this and the only reason she's been dragged so far left, believe me, is she doesn't want to go to jail over the emails, OK? Believe me that's the only reason.","One simple reason. Because you know what, folks, I used to say, leave it up to the lawyers. I have watched so many lawyers on so many different networks, I have read so much about the e-mails. Folks, honestly, she's guilty as hell. She's guilty as hell. And the fact that they even -- and this is true. The fact that they even allow her to participate in this race is a disgrace to the United States.","It's a disgrace to our nation. It's a disgrace. So we'll see. We'll see what happens. I don't know. I've always had great confidence in the FBI. I must tell you. I have great respect. I know some FBI folks. I've always had great confidence in them. I can't believe that they would let this go. When you look at General Petraeus, he got the equivalent of two years.","He did nothing compared to her. You look at some of these other people, their lives have been destroyed. What she did is 20 times worse, what she did. And now her guys are taking the Fifth Amendment. The whole thing, it's a mess. And she keeps running like there's nothing -- no problem. I'm telling you, this is a great system we have.","We have a great country. We're gonna make it a lot greater, by the way. But we have a great -- we love our country. Look, we love our country. And I don't believe our country can let her get away with this crime. I don't believe it. So we'll see. And you know what, if they do let her get away with it, it will be a big topic of conversation on the campaign trail, I can tell you that, folks.","And then if I win, it's called the five-year statute of limitations, if I win. Now everything is going to be fair. But I'm sure the attorney general will take a very good look at it from a fair standpoint, OK? I'm sure. I think it's disgraceful. So we have a very important race. We're doing amazingly well.","Some of the pundits are saying the most phenomenal thing they've ever seen in government. Newt Gingrich said the other night, there's never been anything like this, and he's a historian, a great historian. There's never been anything like this in the history of our country. We go like this crowd, we have great crowds, right?","We always have great crowds. I mean, look at this place. This is amazing. Hey cameras, why didn't you take a look at this, please, if you would. They don't turn. They don't turn. The other night crazy Bernie, he's a crazy guy, but he's doing OK. He is nuts. He is a total nut job. But you know what? He's doing OK. And by the way, he does get the second biggest audience.","It's nothing like us. Not even close. And everybody knows it. But here's the difference. So the other night, they said, ladies and gentlemen, Donald Trump. Here's Donald Trump. I had like a tremendous -- I don't know, close to 20,000 people and this happens all the time. Ladies and gentlemen, Donald Trump is speaking now and he's just finishing up and ba, ba, ba. Then when everyone leaves, they usually have somebody standing there.","The place is empty. It looks like a garbage dump, all this, everything gone. And they'll say, Donald Trump just spoke and ba, ba, ba and then let's fall asleep, OK? Then they have Bernie Sanders. He had 3,000 people. Bernie Sanders had a tremendous crowd tonight of 3,000 people. Unbelievable crowd. And I'd have 20,000 and they don't mention it. Just like when I said to the cameras, turn around and show these people.","Even during this big game, in this territory, it's amazing to me. I mean, this is -- it's incredible. But honestly, even coming here, I said to my people, are you crazy to be having it at that location? It's a great honor. But look, we have to vote. We have to do a mandate. We have to win. And one of the biggest reasons we have to do this for: United States Supreme Court Justices.","I put a very big -- I put a very, very big list of great justices. That's OK. Will you behave? Where is he? Where is? Where? That's all right. Leave her. Let her stay. That's all right. She's got a little Bernie sign up. You know, it's given to her -- did Bernie give it to you himself? It's all right. Sad, actually.","No, that's OK. Let her stay. There's no problem. I don't mind. I don't mind. You know, they send him in with the little Bernie sign made in China. You know, it's a little Bernie sign. It's a pretty sad thing. I mean, unfortunately, I was talking about the system. So the Republican system was rigged, but we won by knockout.","The Bernie system is totally rig. They have superdelegates. Darling, there's no way he can win but keep your sign hanging high, OK? There's no way, which is a shame. Now Bernie and I do agree on one thing, we agree that the United States is getting ripped off like crazy on trade. So on that, I agree. That's why I think a lot of the people are going to come to me when this is all over.","The Bernie people are going to be voting for Trump because that's such a big thing. Our wealth is being drained out of us. It's being just taken like we're a bunch of dopes, like we're a bunch of dopes. This year, we have a trade deficit with China of $505 billion. We have a massive trade deficit with Vietnam, with Japan, with Mexico.","You can name any country, virtually any country we deal with, we have a trade deficit. It used to be the other way around when we were smart and strong, but we haven't been smart and strong for many, many decades and we're gonna change that around, folks. We're gonna change it around. We're going to change it. Now, we have to change it. We can't keep going like this.","We can't -- it's not like we have a choice. Oh gee, let's go like this for another 25 years. If we're gonna save our Social Security and I'm the only one that's gonna save it, believe me, without cuts. If we're going to save our Medicare, if we're going to save all of these things that we have to save, we have to bring our jobs back and we have to make sure that nobody is taking our jobs anymore, folks.","And we're gonna do that. We're gonna do it. So remember a couple of things. Hillary Clinton wants to abolish the Second Amendment. She wants to abolish it, abolish it. The NRA, National Rifle Association, last week endorsed Donald Trump. I believe, it's the earliest endorsement they've ever given to a presidential candidate.","And I give that credit to my sons. They've been members for a long time, so have I. But my sons are fantastic and they really -- and by the way, I have to say this, Wayne and Kris and all of the people, the people that I've met at the NRA. These are great people. They're great Americans. They love the people of this country.","They want the people of this country to be safe. These are great people. So I want to thank them for the endorsement, National Rifle Association. OK, so let me go back for a second. So I said that Carrier and Nabisco, Ford, all these -- they're all leaving. Here's what happens. Let's say, that a company like Carrier announces they're gonna to leave.","I'm going to say very simply and it's going to be very, very strong and very, very simple. Folks, if you leave here's the consequence. You're going to be taxed at the rate of 35% for every single air conditioning unit that you bring back into our country, OK? OK? Very soon. Now, I've been watching politicians in Washington for seven years trying to figure out how to stop companies from leaving.","They're all leaving. You know, I shouldn't do it because I'll ruin your night, but I have stats on San Jose. Not good. Not good. You're losing your manufacturing, one in three manufacturing jobs lost. Hillary ran up a $1 trillion trade deficit with China while she was secretary of state. So many different things.","Since Clinton, Bill Clinton signed NAFTA, probably the worst economic deal we've ever made in this country. Since then, California has lost one in four of its manufacturing jobs. I mean, I could go on except it's statistics, folks, done by my statistician. He thinks it's the most exciting job in the world.","I don't wanna depress you, OK? But it's just terrible. NAFTA was signed by Bill Clinton. It's probably. The worst economic deal made by our country, maybe ever. You look at New England, you look at upstate New York, you look at way out on the island in New York, the places have been wiped out. Pennsylvania, I love Pennsylvania.","We're going to win Pennsylvania, by the way. We won all of these. You know, in the primaries, they said, well, we'll stop him right after New York. So we had Pennsylvania landslide. We had Maryland landslide. We had Connecticut landslide. We had Rhode Island and Delaware, a landslide. Then they came to Indiana that was gonna be the firewall, remember, Indiana.","Bobby Knight. Bobby Knight. Bobby, 900 wins. And Bobby said, I want to endorse you man. I want to endorse you. You're the guy that can turn this country around. And Bobby Knight walked into an arena, we had 20,000 people and they gave him a hand for five minutes. I said, you know, this is one of the few endorsements I think that's going to work out very nicely.","And I won the state of Indiana in a landslide, in a landslide. And I think and I'm not even talking about landslide, but I think we can win the state of California and win it pretty substantially. Now, I've been told by all these geniuses, you know, all these brilliant guys, they all say, you can't win the state of California.","I think we can. Look at a crowd. I mean, look at this crowd. During the, during the Warriors game. Look at this. This is crazy. During the big basketball game. In fact, I'm thinking about leaving and watching them myself. Bye everybody. No, I mean, during the game. So here's the story, here's the story. I think we're going to run hard in California and I'm gonna run hard in New York too.","These are two states that no other Republican candidate would ever even try run, right? But I'm gonna run hard in California. You got to be with me. I think we can win California. And if we win California, the election is over, folks. It's over. We win. And then we will make America great again, believe me. It's over now.","Now with that being said, Hillary has raised a billion dollars and plans to raise more than a billion dollars and she will do negative ads all over the place. Now, here's the good news. When I won Florida in a landslide, won it in a massive landslide, I had more negative ads. In fact, I went to my people, I called up Ivanka.","Did anyone ever hear of Ivanka? I called up my wife, Melania. I said, I got a problem. There are so many negative ads. It's impossible. There's no way I can win. And then I ended up winning 66 out of 67 counties. It has never been done before and won in a massive landslide, Florida. And I said, do ads work anymore?","It's like -- so Hillary has earmarked over $100 million early on for negative ads against Donald Trump. And believe me, folks, their false ads, they are so false -- some of them aren't that false actually. Mostly. You know, it's a problem, when you do as much as I've done, I've done so many deals, I've built a great company, I filed my papers with the election group and when you know when you look at that, I mean, you look at those papers, believe me, they I built a great, great company.","Nobody likes to look. Hey, believe me, if it wasn't, you'd be reading about it. It would -- nobody wants to talk about it. It was like a feeding frenzy. I built a company that's worth more than $10 billion. I started off with a million dollar loan. I always hear how I started off with a $200 million gift.","And my sister called me, she said, really? How did that happen? $200 million. Believe me. So you are going to see something that's gonna be so spectacular with what we do here. I built a great company and you know what, in many ways, this is going to be easier. This is going to be easier because we have such unbelievable momentum going here with what we're doing.","We are gonna do things that nobody has ever seen before. We've already done that. When they are saying, Bill O'Reilly, in his life he said, this is the single greatest political phenomena he's ever witnessed. It's pretty good. It's pretty good. We are going to do things that you've never seen before and we're going to get along great with these countries.","You know, I watch Hillary's thing tonight, which was hard. It was like, it's like taking You ever hear Sleep all night. It's hard to stay awake when you know I'm not a big sleeper. I think she could make more money. If she made speeches and sold them for people that can't sleep. It was hard.","But she lies so much. She said, Donald Trump wants Japan to put in nuclear weapons. No, no, no, that's not what it is. In a deal, you always have to be prepared to walk. We have a lot of business people. We have four or five of them that I know that are friends of mine. Do you know I own a big chunk of the Bank of America building, right?","So I want you to make San Francisco good, but I own a big, big chunk of that building. And I will tell you, in a deal, you have to be prepared to walk. No, you can't go into a deal and say, I'm not walking. Now, crooked Hillary said, we will always stand by our partners. We will never leave. We will stand by our partners.","We never ever will leave. These are great allies. She said China is jealous of us. And she said, who else is jealous? She said, oh China and Russia are jealous of our relationships. They're not jealous. They think we're stupid. We give them free defense. They think we're stupid. She's saying that China and Russia are essentially envious or jealous of our partnership with all of these people that are taking our money.","So here's the story, here's what I say, remember this, and I have to tell you, the New York Times is a terrible newspaper. It's failing. But David Sanger, very good writer, did a very accurate story. The Washington Post is a totally dishonest newspaper, totally. I mean, they are the worst. But the New York Times, pretty bad.","Hey, how about the story they did a week ago about Donald Trump and women and then all the women came back and they said, that's not true. We love Donald Trump, right? Right? The story was a fraud. In fact, I saw the women, I said, oh, that's great news for me. They're gonna say good and then I read this stuff.","I said, man, I can't believe that she would say it or she would say it. So you had Carrie Prejean and she said, no way, I didn't say that. And you had Roanne and she said, there's no way. I have great respect for Donald Trump. He treated me great. He was a great guy. You had all these women. You had one woman said, I told her not to eat that piece of candy.","This is my -- I mean, I had a lot of friends call me up and they say, we're really disappointed in you man. Tell your wife. And this was a woman, OK, like 25 years ago. I put her in charge of construction of a building. She was fine, OK? Then she went to another company. She want to come back. She begged me to come back.","But I gave her a job remember, her name was Rest. I gave her a job. That no other woman had ever been in charge of building a massive skyscraper in New York. No, Trump Tower. I gave her the job. She went to another company thought probably she got $2 more only because she worked for me. She got $2 more. Then all of a sudden that didn't work out.","For many years, she's been writing me letters saying, you're the greatest, you're the greatest. I'd love to come back to work for you. You're the greatest. She even wrote me one letter saying that I'm not sexist. I said, what the hell does that have to do? She wrote me a letter or an e-mail. I love e-mails.","You can't erase e-mails. You can't erase them. I love them. Because I said to Rona, my executive assistant, I said Rona, didn't this Barbara write me emails wanting to come back? Well, I'll find out. She comes back two minutes later, she's got a whole pile of e-mail. By the way, Hillary Clinton is missing 30,000 e-mails.","They've been deleted. 30,000. 30,000 e-mails. And remember, I said, I was a counterpunch here? I am. After what she said about me today in her phony speech. That' was a phony speech. That was a Donald Trump hit job. I will say this, Hillary Clinton has to go to jail, OK? She has to go to jail. It was a phony hit job.","She's guilty as hell. So this woman. So Barbara is praising me that Donald Trump is great. Mr. Trump, I'd love to have a job. Could I go use a hotel. All this stuff. And then she writes a letter that I'm not sexist, OK? I never had anybody -- by the way, anybody that writes a letter without the words being mentioned that you're really good and you're not sexist.","Anybody puts out that letter then you know they're trouble, OK? Don't hire that person because you know they're trouble because that means it's right in their minds. Does that make sense to anybody? Out of nowhere. So this terrible person, I gave her a job, the opportunity of a lifetime. She took the job, I got it completed.","She was gone. Wanted to come back. I didn't take her. Remember this. Now, she writes a book and the book is great about me. She said great things about me. That was four or five years ago. All of a sudden, I see these sleazebags. This guy named, Barbaro, who is an absolute sleazebag. Terrible writer. He's a terrible writer.","He wrote the story on the women and he was very embarrassed, and they should do a retraction of the story or an apology. If they were real people, they would do an apology. But the other woman that was -- that didn't apologize was this woman. So I gave this woman the break of a lifetime, you talk about breaking the glass ceiling.","And she comes out and she said bad things. Now, about the worst thing she said was that I told her not to have a piece of candy, OK? But can you imagine -- but they never called me once to ask about these people. Because if they did, I would have given her 20 e-mails and they wouldn't have been able to write the story.","But they don't do that because these newspapers and the media are totally dishonest people, folks. Remember that. Totally dishonest. How about this. When I was making a speech in Iowa, I said, let's raise some money for the vets, right? I raised -- think of this. Let's raise some money from that. I raised -- I started saying, you know, before the event, I figured maybe we can raise a half a million or a million, well 2 million.","I don't know. Then all of a sudden, a lot of guys -- thank you, man. You're a vet? Thank you. You know what I'm going to say, right? Thank you. Great people. And we're going to take care of the vets, believe me. We're going to take care of their medical. We're going to take care of the vets. So I said, let's raise him.","I have no obligation. I was supposed to make a speech like this in Iowa. So I'm -- start the speech and during this speech, somewhere I said, let's raise some money for the vets. A friend of mine was there, Phil Ruffin, he gave $1 million. Another friend, Ike Perlmutter gave a million dollars. Great guy.","Another guy, Carl Icahn, great guy, gave a half a million dollars. Stuart Ross gave a million. I said, wow, we're doing well. And during the course, I said, let's see if we can do $3 million, $4 million $5 million, $6 million. It doesn't matter. Whatever the hell the number. And a lot of money came in. We distribute it. We distribute it. All of a sudden, I'm getting the worst publicity of my life.","So here's the final number, but the number could go up because there's more coming in. Because we have to vet a lot of these places. You know, you can't send him a check for $200,000 you don't even know who the hell you're sending it to. So you watch my press conference the other day. So the Washington Post, which is just a ploy for Amazon so that Amazon doesn't pay taxes, so that Amazon doesn't get accused of monopolistic practices because frankly, they're putting all the retailers out of business, OK? You want to know the truth.","And the politicians are afraid of them because the guy bought the Washington Post. But here's the story. So they start doing stories like, how much did he give? How much? Where's the money? When is it gonna be delivered? I said, I don't care. Whatever it is, it is. I wrote a check for $1 million, by the way, $1 million.","And I sent it -- and I was gonna give it to four or five companies, we couldn't vet them. I just said, it was too complicated. So I gave it to one company, if that's great, one group. We gave it to just a great group, the Marines. The Marines is great, a Marine base. OK, so listen to this. So here's the ad. I raised almost $6 million.","$5.6 million has been distributed. I give -- you know, it's not easy. I had a lot of people working on it. It's a lot of work. And you're raising it and you're giving and you're doing a lot of things. And you're calling in favors from friends. Frankly, they give you money for other things if you wanted to do it. So I raised almost $6 million, remember this, for the veterans, which we love.","I got nothing but bad publicity. I got nothing but bad publicity. And then a group forms outside, a small group, like a few people, 10 people, and they're veterans against Trump. And I said, how can they be against me I raised all this money. It turns out they were sent there by Hillary Clinton. It's -- honestly, folks, it's a disgrace.","So I'm so proud of it. Here's the good news, here's the good news. Want the good news? I have received so many tweets and e-mails and phone calls and everything, letters from the incredible veterans thanking me for what I did because they get it. They get it. And I didn't have to do it. I didn't have to do it. But you know, the bad part of that story -- I'm so glad I did it anyway and most people understand.","You know, there's one guy said, wait a minute, he raised all this money. What did he do wrong? And I gave it to great groups. Actually, one group said, I think like 30-some-odd groups, many, many groups. One group said, one of the groups he gave money to was not great. I said, sorry, folks. Unbelievable headline.","So look, here's the story and the bad part. Other people like me, well see what happened to me, where I got nothing but bad publicity. And they're going to say, I'm never gonna do that again. I'm never gonna do it. So you have guys that would be inclined to do it and they're already saying this. If rich guys are calling me saying, man, you shouldn't have done it. I was under no obligation whatsoever to do it. I just said, let's see, if we can raise some money for the vets.","That's how it started. We raised much more than I ever thought possible. And I got nothing but hits from the New York Times and the dirty Washington Post, which is -- it is a disgusting newspaper. You know what they have? This all Amazon money. They have 22 reporters on me doing stories, 22. I get calls every hour.","Hope, did anyone ever hear of Hope Hicks? Where is Hope Hicks? Hope she gets calls every half hour, hour. This is the Washington Post. We're doing a story on a deal Mr. Trump did in 1973. I said, man, that's a long time and I don't have a good memory. That's a long time ago. They want to do anything. They are a disgusting -- now they say, they're doing a book.","You know what they're doing? They're taking all of the bad stories and they're just putting it in, sealing it put and doing a book. These are dishonest people folks, let me tell you. But we're not finished because see, I don't care. Other guys wouldn't say this. A politician wouldn't say this. They'd say, oh, the Washington Post.","I don't care. I couldn't care less because the people understand. So for the vets, I am very happy I raised that money for you vets. I'm very happy. Even though it got me a lot of bad ink, I'm very happy. I'm very happy. So -- and I want to thank you. Thank you. You know somebody said, you have thick skin.","And I said, I really do. When I do something wrong and we all do things wrong, I guess, right? Not too often, but we do things wrong. When I do things wrong and the press writes badly about me, I can handle that. In fact, I congratulate them. I say, it's fine. When you do things that are good things and they try and make it look like it's bad that's when it's not fair and that's when you have to fight back.","You have to fight for your rights folks, remember that that. You have to fight for your rights. So here's the story. We're gonna build our military, bigger, better and stronger than ever before. And I was against the war in Iraq and Hillary Clinton was in for it. You know, now she's saying, Donald Trump, do you trust him with the nukes?","Let me tell you, my temperament is so much tougher and so much better than her temperament. And by the way, we need a tough temperament. And all of these countries, and remember this, all of these countries that are our allies. She talks about our allies. Our allies think we're very stupid people because we defend Japan and I'm OK with that.","But we can't defend him and lose a fortune and that's what's happening, right? We can't. We are not a rich country. We're a poor country. We're a country that owes $19 trillion, soon to be $21 trillion. We have Obamacare, which is a disaster. Did you see in Texas today? Blue Cross Blue Shield in Texas, Blue Cross Blue Shield Texas just announced they go through Obamacare that they're going to have to raise it up 60%, 60%. In other words, you're gonna have a 60% increase.","Blue Cross Blue Shield Texas. This is gonna happen all over. A lot of these numbers are going to do on November 1st. Obama is trying to make it so that instead of November 1st, it's going to be December after the election. We can't let him do that because I'll tell you what. Just on that point alone, they lose the election.","On guns alone, Hillary Clinton loses the election on the Second Amendment, the Second Amendment. So we're going to rebuild our military. Our military is very sadly depleted. You have to see the numbers, the number of ships we have compared to 15, 20 years ago. The number of soldiers, the number of everything, our equipment is old.","I saw on CNN, I thought it was amazing. CNN did a profile of our pilots and the planes, and they're talking to -- these pilots are great pilots, jet fighter pilots. These are great people, great people. And they show a plane that's like 70. I think it was an F18. It was like 17 or 18 years old and it looked it. And they said -- and these were active fighter planes with fantastic people at the helm fighting. And they said, no, the planes are very"],"text":" Thank you. Latinos for Trump. That's what I like. I love that. Latinos, we're doing well with Latinos. Nobody knows about it yet. We're bringing in so many jobs in. You watch what happens. The Hispanics, we love the Hispanics. Thank you, everybody. So, so I said to my people, what the hell are you doing? Who's going to come tonight? You have San Francisco playing the game tonight. And look at this crowd. This is unbelievable. Well, we'll speak a little bit faster tonight so you go home to the game, OK? No, no, no. Let's take our time. Yeah, anyway. Well, thank you all very much. It's been an amazing period of time. You know, you had the 1,237, right? 1,237 delegates and I promised everybody, I told everybody we were going to hit that number and now we're going to hit a number that's way, way above, way, way above. Remember, they all said, oh you have the convention and the convention is going to be a big deal. And I said, we're not going to the convention for that. We're going to the convention as victors before the convention ever starts. So we're going to have a great time in Ohio. We're going to have a great time in Cleveland, Ohio. And I really appreciate this turnout. This is fantastic. I really do. So on Tuesday, you got a big vote coming up. I mean, honestly, we already won. But in terms of mandate, in terms of going out there and really getting it. I hope you can go out, vote and, you know, we have a few states, right? It's the end. It's the end now. Here's what's important, in the history of the Republican Party, Dwight D. Eisenhower, Ronald Reagan, everybody, everybody. In history, we have the most votes ever cast for a Republican candidate. Never happened before. And by millions, by millions, by millions of votes. And the amazing thing about that is, I think, we do even better in November because we're going to take a lot of people from the Democrats. You know, Bernie Sanders, Bernie Sanders, the system was rigged on him. I think we're going to get a lot of people from Bernie. We'll see what happens. I mean, I watched Hillary today. It was pathetic. It was pathetic. It was so sad to watch. And you know, she's up there and supposed to be a foreign policy speech, it was a political space. Had nothing to do with foreign policy. She made a political speech tonight, folks, and it was a pretty pathetic deal. But listen, on Tuesday, so we have California, we have Montana, we have New Jersey, we have New Mexico, we have South Dakota. So we have those states, and that's the end. And at the end of the night, we will be many, many, many millions of votes ahead, of the highest vote getter in history, and that tells you something. Now, you're a hell of a crowd. You don't like basketball very much. You are a great crowd, man. Thank you. I love you. I love you. I love you, folks. I'm telling you. So. We, we are in a movement. They've never seen anything like it. Some people, many people, even people that hate me, the pundits, who are totally dishonest, by the way, but that's OK. Some of these pundits have even said, almost all of them that there's never been anything like this that's ever happened in the United States. Never been. Amazing. Yesterday, we had an amazing crowd. We had these airport hangars packed with people. And a friend of mine said, I loved your speech yesterday. You know, it's on all the networks. It's all over the place. He said, were there any people there? I said, yeah, it could have been like 20,000 people. I couldn't tell. They never showed the people. They never ever showed it. But who cares? Do we agree? Who cares? People are getting it. People are getting the idea. People are getting the idea. So what we have to do is this, we have a movement going on. We're on the cover of every newspaper every magazine, Time Magazine many times. I just learned they're doing yet another cover on Trump. I love that. You know, Time magazine is a good magazine. You grow up reading Time Magazine. Whoever thought you'd be on the cover of Time Magazine, especially so much. And it's all about the movement. It's all about the fact that we're taking back our country. And by the way, we're going to be very inclusive to everybody. We're going to be very inclusive to everybody. I know we have a lot of people, they're angry at what's happened. We have a lot of smart people that are making less money now than they did 18 years ago and they're working twice as hard, OK? We are going to bring our jobs back, folks. We're going to bring back sanity to our country. Gonna bring those jobs back. And we're not going to let the jobs go so easy. You know, I talk all the time about Ford and Carrier and Nabisco, where they leave and they move their plants to Mexico and other places and there's no consequence. There's going to be a big consequence. Let me give you an example, OK? It's so easy. For six years, I've been watching politicians saying, we have to stop the onslaught of people leaving -- of companies leaving our country. I've been watching this in amazement. I never thought I was going to be doing this. Have I done a good job, OK? Have I done a good job? You know, it's funny before I get it. So I've been doing this now for 10 months and they had an article one of the magazines said, it was 10 months versus 200 and some odd hundred years of experience because we ran against 17 people. And if you add up all of their tenures, 200 and something years. So for ten months, with no experience, we are doing well, folks, I'll tell you. But don't let the no experience fool you. I've been on the other side of the equation. I hate to tell you this. I was very much a part of the establishment. I was a big donor. And I was on the other side. But I know the system better than anybody else because I know how it works on both sides. I've been there so long. I know so much about lobbyists and special interests or whatever the hell you want. And with me you're getting me -- I'm representing just you, just you. So in the primaries -- on the primaries, I spent $55 million of my money. And in fact, somebody said, I guess, for legal purposes, they put it down as a loan where I loan myself $55 million. I will say to you tonight, I've been saying it all the time, I'm going to term it -- I don't even want it as a loan. I don't even know why. When somebody does it, they always put it down as a loan. I'm not paying myself back. We're wiping out that loan. I've mean for $55 million I turned down, I turned down and it always was intended to be that way. Sometimes the lawyers do things you say, why are you doing that? They almost can't explain it. But it seems that many people do that. But we're terminating that. Millions and millions of dollars was offered to me and I said, no, I'm not interested in it. Now what we're doing is we're working with the Republican National Committee. They have treated me fairly, by the way, or I guess I wouldn't be. Yeah, I think I would have been no matter what because frankly, we won by such landslides and no matter what they wanted to do, right? We won so big. No matter what they wanted to do. You know, I tell the story all the time about the prize fighters. They go out and they fight in somebody's home territory and I know so many of the prize fighters. I have a lot of prize fights. I've always liked it. I've held many more Mike Tyson fights than anybody else. But I've had a lot of fights. And I'll say, why are you going to that community? A lot of money there, Mr. Trump. A lot of money. But if you come to a judge's call, they're going to rule against you if it's a close fight. Not even if it's a close fight, they're gonna rule against you period. They said, there's only one way to solve that Mr. Trump, I got to knock him out. And that's what we did. That's what we did because it's a rigged system. It wasn't meant for me to win. The system isn't set up like that. But we won in New Hampshire so big. I love New Hampshire. We're going to solve the -- you have a tremendous drug problem, heroin, in New Hampshire. We're going to solve that problem. We are gonna to solve the problem. It's coming in from the southern border. We want to solve the drugs that are pouring in to our country. We're gonna solve it, OK? We're gonna solve it. But we won New Hampshire -- we're going to build that wall don't even think about it, don't even think about it. And who's going to pay for the wall? Who? 100% right, OK? 100%. You know, I was watching, coming in I have the television and I'm watching. And one of the shows had a poll came out. And I like the poll because I'm doing very well and in some of the polls now, I'm beating Hillary Clinton and quite easily. We love that. We love it. Fox had a very good poll came out a couple of days ago. We're number one and we're right around. Believe me, folks, when you watch her today, she does not look presidential, that I can tell you. She doesn't. This is not a president. Four more years of this stuff and I'll tell you, we're not going to have a country left, believe me. And if I win, believe me, make America great again and it's gonna to be greater than ever before. We have a chance to be greater than ever before. Greater than ever before. But a poll came out and it said, do you think Trump is going to build the wall? These people just don't understand. Remember when I first announced, they said, you think Trump is serious? And the pundits would say, well, he's not going to run. And then if he runs -- so that I announce that he's running. But if he runs, he's only going to have fun for a couple of weeks, build up his brand, my brand. I get killed. I had such a beautiful brand. I get killed with my brand with his stuff. You know why? If you get 55%, you have a landslide. That means at 45% of the people hate you. In the old days, I had 100% of the people that love me. Now, I have 55% of the people that love me. But really more than that, if you look at the last -- that's OK don't worry about it. He's very quiet. Let him enjoy himself. I want him to enjoy. We need our protesters. I love -- no, no leave him alone. That's OK. That's all right. Now leave him alone. We got to be nice. Don't forget. Don't forget. The only one I hear are you people. I don't hear him, all right? All right. Don't hurt him. See, the way I say that, I've learned. Don't hurt him. Don't hurt him, please. No, he's fine. I would have left him here because he was fine. But but here -- wow look at all the people that are forming back there. This is crazy. Man. It is true though. I said, where the hell -- these people are going to be at the game. I don't know how many people are at the game. But this is better. Is this more fun than the basketball game? And you know what's more importantly, honestly, it's a lot more productive and I like basketball and all of that. This is about America first. This is about putting our country first. It's about showing people that we're not going to be listening to stupid people anymore, that we're not going to have people making deals like the Iran deal, like the Sergeant Bergdahl deal. They get -- I mean, think of it, they get five of the people that they've wanted for eight years and we get Sergeant Bergdahl, a traitor, where five people were killed looking for him. These are the deals, the five for one -- I call him the five-for-one president. So we're not gonna do that stuff anymore, folks. Those days are over. The days, the days of the Iran deal where they get $150 billion. We get nothing in that deal. Nothing, except laughed at and scorned. And then I watched Hillary Clinton, she started the foundation of that deal and now she's proud of it. But she's only proud of it for one reason. You know why? Because Obama wants it. Anything Obama wants, she's going forward with. Because you know why? She doesn't want to go to jail. That's why, folks. That's why. Remember, Hillary Clinton used to hate Obama. She used to hate him. Bill Clinton hated him. Bill Clinton hated him. He called Bill Clinton a racist. You remember that? Bill Clinton hated him and Hillary Clinton hated Obama. Now it's, yes, sir, Mr. President, sir. Yes, sir. What would you like? What would you like me to say here, sir? The only reason she's behaving like this and the only reason she's been dragged so far left, believe me, is she doesn't want to go to jail over the emails, OK? Believe me that's the only reason. One simple reason. Because you know what, folks, I used to say, leave it up to the lawyers. I have watched so many lawyers on so many different networks, I have read so much about the e-mails. Folks, honestly, she's guilty as hell. She's guilty as hell. And the fact that they even -- and this is true. The fact that they even allow her to participate in this race is a disgrace to the United States. It's a disgrace to our nation. It's a disgrace. So we'll see. We'll see what happens. I don't know. I've always had great confidence in the FBI. I must tell you. I have great respect. I know some FBI folks. I've always had great confidence in them. I can't believe that they would let this go. When you look at General Petraeus, he got the equivalent of two years. He did nothing compared to her. You look at some of these other people, their lives have been destroyed. What she did is 20 times worse, what she did. And now her guys are taking the Fifth Amendment. The whole thing, it's a mess. And she keeps running like there's nothing -- no problem. I'm telling you, this is a great system we have. We have a great country. We're gonna make it a lot greater, by the way. But we have a great -- we love our country. Look, we love our country. And I don't believe our country can let her get away with this crime. I don't believe it. So we'll see. And you know what, if they do let her get away with it, it will be a big topic of conversation on the campaign trail, I can tell you that, folks. And then if I win, it's called the five-year statute of limitations, if I win. Now everything is going to be fair. But I'm sure the attorney general will take a very good look at it from a fair standpoint, OK? I'm sure. I think it's disgraceful. So we have a very important race. We're doing amazingly well. Some of the pundits are saying the most phenomenal thing they've ever seen in government. Newt Gingrich said the other night, there's never been anything like this, and he's a historian, a great historian. There's never been anything like this in the history of our country. We go like this crowd, we have great crowds, right? We always have great crowds. I mean, look at this place. This is amazing. Hey cameras, why didn't you take a look at this, please, if you would. They don't turn. They don't turn. The other night crazy Bernie, he's a crazy guy, but he's doing OK. He is nuts. He is a total nut job. But you know what? He's doing OK. And by the way, he does get the second biggest audience. It's nothing like us. Not even close. And everybody knows it. But here's the difference. So the other night, they said, ladies and gentlemen, Donald Trump. Here's Donald Trump. I had like a tremendous -- I don't know, close to 20,000 people and this happens all the time. Ladies and gentlemen, Donald Trump is speaking now and he's just finishing up and ba, ba, ba. Then when everyone leaves, they usually have somebody standing there. The place is empty. It looks like a garbage dump, all this, everything gone. And they'll say, Donald Trump just spoke and ba, ba, ba and then let's fall asleep, OK? Then they have Bernie Sanders. He had 3,000 people. Bernie Sanders had a tremendous crowd tonight of 3,000 people. Unbelievable crowd. And I'd have 20,000 and they don't mention it. Just like when I said to the cameras, turn around and show these people. Even during this big game, in this territory, it's amazing to me. I mean, this is -- it's incredible. But honestly, even coming here, I said to my people, are you crazy to be having it at that location? It's a great honor. But look, we have to vote. We have to do a mandate. We have to win. And one of the biggest reasons we have to do this for: United States Supreme Court Justices. I put a very big -- I put a very, very big list of great justices. That's OK. Will you behave? Where is he? Where is? Where? That's all right. Leave her. Let her stay. That's all right. She's got a little Bernie sign up. You know, it's given to her -- did Bernie give it to you himself? It's all right. Sad, actually. No, that's OK. Let her stay. There's no problem. I don't mind. I don't mind. You know, they send him in with the little Bernie sign made in China. You know, it's a little Bernie sign. It's a pretty sad thing. I mean, unfortunately, I was talking about the system. So the Republican system was rigged, but we won by knockout. The Bernie system is totally rig. They have superdelegates. Darling, there's no way he can win but keep your sign hanging high, OK? There's no way, which is a shame. Now Bernie and I do agree on one thing, we agree that the United States is getting ripped off like crazy on trade. So on that, I agree. That's why I think a lot of the people are going to come to me when this is all over. The Bernie people are going to be voting for Trump because that's such a big thing. Our wealth is being drained out of us. It's being just taken like we're a bunch of dopes, like we're a bunch of dopes. This year, we have a trade deficit with China of $505 billion. We have a massive trade deficit with Vietnam, with Japan, with Mexico. You can name any country, virtually any country we deal with, we have a trade deficit. It used to be the other way around when we were smart and strong, but we haven't been smart and strong for many, many decades and we're gonna change that around, folks. We're gonna change it around. We're going to change it. Now, we have to change it. We can't keep going like this. We can't -- it's not like we have a choice. Oh gee, let's go like this for another 25 years. If we're gonna save our Social Security and I'm the only one that's gonna save it, believe me, without cuts. If we're going to save our Medicare, if we're going to save all of these things that we have to save, we have to bring our jobs back and we have to make sure that nobody is taking our jobs anymore, folks. And we're gonna do that. We're gonna do it. So remember a couple of things. Hillary Clinton wants to abolish the Second Amendment. She wants to abolish it, abolish it. The NRA, National Rifle Association, last week endorsed Donald Trump. I believe, it's the earliest endorsement they've ever given to a presidential candidate. And I give that credit to my sons. They've been members for a long time, so have I. But my sons are fantastic and they really -- and by the way, I have to say this, Wayne and Kris and all of the people, the people that I've met at the NRA. These are great people. They're great Americans. They love the people of this country. They want the people of this country to be safe. These are great people. So I want to thank them for the endorsement, National Rifle Association. OK, so let me go back for a second. So I said that Carrier and Nabisco, Ford, all these -- they're all leaving. Here's what happens. Let's say, that a company like Carrier announces they're gonna to leave. I'm going to say very simply and it's going to be very, very strong and very, very simple. Folks, if you leave here's the consequence. You're going to be taxed at the rate of 35% for every single air conditioning unit that you bring back into our country, OK? OK? Very soon. Now, I've been watching politicians in Washington for seven years trying to figure out how to stop companies from leaving. They're all leaving. You know, I shouldn't do it because I'll ruin your night, but I have stats on San Jose. Not good. Not good. You're losing your manufacturing, one in three manufacturing jobs lost. Hillary ran up a $1 trillion trade deficit with China while she was secretary of state. So many different things. Since Clinton, Bill Clinton signed NAFTA, probably the worst economic deal we've ever made in this country. Since then, California has lost one in four of its manufacturing jobs. I mean, I could go on except it's statistics, folks, done by my statistician. He thinks it's the most exciting job in the world. I don't wanna depress you, OK? But it's just terrible. NAFTA was signed by Bill Clinton. It's probably. The worst economic deal made by our country, maybe ever. You look at New England, you look at upstate New York, you look at way out on the island in New York, the places have been wiped out. Pennsylvania, I love Pennsylvania. We're going to win Pennsylvania, by the way. We won all of these. You know, in the primaries, they said, well, we'll stop him right after New York. So we had Pennsylvania landslide. We had Maryland landslide. We had Connecticut landslide. We had Rhode Island and Delaware, a landslide. Then they came to Indiana that was gonna be the firewall, remember, Indiana. Bobby Knight. Bobby Knight. Bobby, 900 wins. And Bobby said, I want to endorse you man. I want to endorse you. You're the guy that can turn this country around. And Bobby Knight walked into an arena, we had 20,000 people and they gave him a hand for five minutes. I said, you know, this is one of the few endorsements I think that's going to work out very nicely. And I won the state of Indiana in a landslide, in a landslide. And I think and I'm not even talking about landslide, but I think we can win the state of California and win it pretty substantially. Now, I've been told by all these geniuses, you know, all these brilliant guys, they all say, you can't win the state of California. I think we can. Look at a crowd. I mean, look at this crowd. During the, during the Warriors game. Look at this. This is crazy. During the big basketball game. In fact, I'm thinking about leaving and watching them myself. Bye everybody. No, I mean, during the game. So here's the story, here's the story. I think we're going to run hard in California and I'm gonna run hard in New York too. These are two states that no other Republican candidate would ever even try run, right? But I'm gonna run hard in California. You got to be with me. I think we can win California. And if we win California, the election is over, folks. It's over. We win. And then we will make America great again, believe me. It's over now. Now with that being said, Hillary has raised a billion dollars and plans to raise more than a billion dollars and she will do negative ads all over the place. Now, here's the good news. When I won Florida in a landslide, won it in a massive landslide, I had more negative ads. In fact, I went to my people, I called up Ivanka. Did anyone ever hear of Ivanka? I called up my wife, Melania. I said, I got a problem. There are so many negative ads. It's impossible. There's no way I can win. And then I ended up winning 66 out of 67 counties. It has never been done before and won in a massive landslide, Florida. And I said, do ads work anymore? It's like -- so Hillary has earmarked over $100 million early on for negative ads against Donald Trump. And believe me, folks, their false ads, they are so false -- some of them aren't that false actually. Mostly. You know, it's a problem, when you do as much as I've done, I've done so many deals, I've built a great company, I filed my papers with the election group and when you know when you look at that, I mean, you look at those papers, believe me, they I built a great, great company. Nobody likes to look. Hey, believe me, if it wasn't, you'd be reading about it. It would -- nobody wants to talk about it. It was like a feeding frenzy. I built a company that's worth more than $10 billion. I started off with a million dollar loan. I always hear how I started off with a $200 million gift. And my sister called me, she said, really? How did that happen? $200 million. Believe me. So you are going to see something that's gonna be so spectacular with what we do here. I built a great company and you know what, in many ways, this is going to be easier. This is going to be easier because we have such unbelievable momentum going here with what we're doing. We are gonna do things that nobody has ever seen before. We've already done that. When they are saying, Bill O'Reilly, in his life he said, this is the single greatest political phenomena he's ever witnessed. It's pretty good. It's pretty good. We are going to do things that you've never seen before and we're going to get along great with these countries. You know, I watch Hillary's thing tonight, which was hard. It was like, it's like taking You ever hear Sleep all night. It's hard to stay awake when you know I'm not a big sleeper. I think she could make more money. If she made speeches and sold them for people that can't sleep. It was hard. But she lies so much. She said, Donald Trump wants Japan to put in nuclear weapons. No, no, no, that's not what it is. In a deal, you always have to be prepared to walk. We have a lot of business people. We have four or five of them that I know that are friends of mine. Do you know I own a big chunk of the Bank of America building, right? So I want you to make San Francisco good, but I own a big, big chunk of that building. And I will tell you, in a deal, you have to be prepared to walk. No, you can't go into a deal and say, I'm not walking. Now, crooked Hillary said, we will always stand by our partners. We will never leave. We will stand by our partners. We never ever will leave. These are great allies. She said China is jealous of us. And she said, who else is jealous? She said, oh China and Russia are jealous of our relationships. They're not jealous. They think we're stupid. We give them free defense. They think we're stupid. She's saying that China and Russia are essentially envious or jealous of our partnership with all of these people that are taking our money. So here's the story, here's what I say, remember this, and I have to tell you, the New York Times is a terrible newspaper. It's failing. But David Sanger, very good writer, did a very accurate story. The Washington Post is a totally dishonest newspaper, totally. I mean, they are the worst. But the New York Times, pretty bad. Hey, how about the story they did a week ago about Donald Trump and women and then all the women came back and they said, that's not true. We love Donald Trump, right? Right? The story was a fraud. In fact, I saw the women, I said, oh, that's great news for me. They're gonna say good and then I read this stuff. I said, man, I can't believe that she would say it or she would say it. So you had Carrie Prejean and she said, no way, I didn't say that. And you had Roanne and she said, there's no way. I have great respect for Donald Trump. He treated me great. He was a great guy. You had all these women. You had one woman said, I told her not to eat that piece of candy. This is my -- I mean, I had a lot of friends call me up and they say, we're really disappointed in you man. Tell your wife. And this was a woman, OK, like 25 years ago. I put her in charge of construction of a building. She was fine, OK? Then she went to another company. She want to come back. She begged me to come back. But I gave her a job remember, her name was Rest. I gave her a job. That no other woman had ever been in charge of building a massive skyscraper in New York. No, Trump Tower. I gave her the job. She went to another company thought probably she got $2 more only because she worked for me. She got $2 more. Then all of a sudden that didn't work out. For many years, she's been writing me letters saying, you're the greatest, you're the greatest. I'd love to come back to work for you. You're the greatest. She even wrote me one letter saying that I'm not sexist. I said, what the hell does that have to do? She wrote me a letter or an e-mail. I love e-mails. You can't erase e-mails. You can't erase them. I love them. Because I said to Rona, my executive assistant, I said Rona, didn't this Barbara write me emails wanting to come back? Well, I'll find out. She comes back two minutes later, she's got a whole pile of e-mail. By the way, Hillary Clinton is missing 30,000 e-mails. They've been deleted. 30,000. 30,000 e-mails. And remember, I said, I was a counterpunch here? I am. After what she said about me today in her phony speech. That' was a phony speech. That was a Donald Trump hit job. I will say this, Hillary Clinton has to go to jail, OK? She has to go to jail. It was a phony hit job. She's guilty as hell. So this woman. So Barbara is praising me that Donald Trump is great. Mr. Trump, I'd love to have a job. Could I go use a hotel. All this stuff. And then she writes a letter that I'm not sexist, OK? I never had anybody -- by the way, anybody that writes a letter without the words being mentioned that you're really good and you're not sexist. Anybody puts out that letter then you know they're trouble, OK? Don't hire that person because you know they're trouble because that means it's right in their minds. Does that make sense to anybody? Out of nowhere. So this terrible person, I gave her a job, the opportunity of a lifetime. She took the job, I got it completed. She was gone. Wanted to come back. I didn't take her. Remember this. Now, she writes a book and the book is great about me. She said great things about me. That was four or five years ago. All of a sudden, I see these sleazebags. This guy named, Barbaro, who is an absolute sleazebag. Terrible writer. He's a terrible writer. He wrote the story on the women and he was very embarrassed, and they should do a retraction of the story or an apology. If they were real people, they would do an apology. But the other woman that was -- that didn't apologize was this woman. So I gave this woman the break of a lifetime, you talk about breaking the glass ceiling. And she comes out and she said bad things. Now, about the worst thing she said was that I told her not to have a piece of candy, OK? But can you imagine -- but they never called me once to ask about these people. Because if they did, I would have given her 20 e-mails and they wouldn't have been able to write the story. But they don't do that because these newspapers and the media are totally dishonest people, folks. Remember that. Totally dishonest. How about this. When I was making a speech in Iowa, I said, let's raise some money for the vets, right? I raised -- think of this. Let's raise some money from that. I raised -- I started saying, you know, before the event, I figured maybe we can raise a half a million or a million, well 2 million. I don't know. Then all of a sudden, a lot of guys -- thank you, man. You're a vet? Thank you. You know what I'm going to say, right? Thank you. Great people. And we're going to take care of the vets, believe me. We're going to take care of their medical. We're going to take care of the vets. So I said, let's raise him. I have no obligation. I was supposed to make a speech like this in Iowa. So I'm -- start the speech and during this speech, somewhere I said, let's raise some money for the vets. A friend of mine was there, Phil Ruffin, he gave $1 million. Another friend, Ike Perlmutter gave a million dollars. Great guy. Another guy, Carl Icahn, great guy, gave a half a million dollars. Stuart Ross gave a million. I said, wow, we're doing well. And during the course, I said, let's see if we can do $3 million, $4 million $5 million, $6 million. It doesn't matter. Whatever the hell the number. And a lot of money came in. We distribute it. We distribute it. All of a sudden, I'm getting the worst publicity of my life. So here's the final number, but the number could go up because there's more coming in. Because we have to vet a lot of these places. You know, you can't send him a check for $200,000 you don't even know who the hell you're sending it to. So you watch my press conference the other day. So the Washington Post, which is just a ploy for Amazon so that Amazon doesn't pay taxes, so that Amazon doesn't get accused of monopolistic practices because frankly, they're putting all the retailers out of business, OK? You want to know the truth. And the politicians are afraid of them because the guy bought the Washington Post. But here's the story. So they start doing stories like, how much did he give? How much? Where's the money? When is it gonna be delivered? I said, I don't care. Whatever it is, it is. I wrote a check for $1 million, by the way, $1 million. And I sent it -- and I was gonna give it to four or five companies, we couldn't vet them. I just said, it was too complicated. So I gave it to one company, if that's great, one group. We gave it to just a great group, the Marines. The Marines is great, a Marine base. OK, so listen to this. So here's the ad. I raised almost $6 million. $5.6 million has been distributed. I give -- you know, it's not easy. I had a lot of people working on it. It's a lot of work. And you're raising it and you're giving and you're doing a lot of things. And you're calling in favors from friends. Frankly, they give you money for other things if you wanted to do it. So I raised almost $6 million, remember this, for the veterans, which we love. I got nothing but bad publicity. I got nothing but bad publicity. And then a group forms outside, a small group, like a few people, 10 people, and they're veterans against Trump. And I said, how can they be against me I raised all this money. It turns out they were sent there by Hillary Clinton. It's -- honestly, folks, it's a disgrace. So I'm so proud of it. Here's the good news, here's the good news. Want the good news? I have received so many tweets and e-mails and phone calls and everything, letters from the incredible veterans thanking me for what I did because they get it. They get it. And I didn't have to do it. I didn't have to do it. But you know, the bad part of that story -- I'm so glad I did it anyway and most people understand. You know, there's one guy said, wait a minute, he raised all this money. What did he do wrong? And I gave it to great groups. Actually, one group said, I think like 30-some-odd groups, many, many groups. One group said, one of the groups he gave money to was not great. I said, sorry, folks. Unbelievable headline. So look, here's the story and the bad part. Other people like me, well see what happened to me, where I got nothing but bad publicity. And they're going to say, I'm never gonna do that again. I'm never gonna do it. So you have guys that would be inclined to do it and they're already saying this. If rich guys are calling me saying, man, you shouldn't have done it. I was under no obligation whatsoever to do it. I just said, let's see, if we can raise some money for the vets. That's how it started. We raised much more than I ever thought possible. And I got nothing but hits from the New York Times and the dirty Washington Post, which is -- it is a disgusting newspaper. You know what they have? This all Amazon money. They have 22 reporters on me doing stories, 22. I get calls every hour. Hope, did anyone ever hear of Hope Hicks? Where is Hope Hicks? Hope she gets calls every half hour, hour. This is the Washington Post. We're doing a story on a deal Mr. Trump did in 1973. I said, man, that's a long time and I don't have a good memory. That's a long time ago. They want to do anything. They are a disgusting -- now they say, they're doing a book. You know what they're doing? They're taking all of the bad stories and they're just putting it in, sealing it put and doing a book. These are dishonest people folks, let me tell you. But we're not finished because see, I don't care. Other guys wouldn't say this. A politician wouldn't say this. They'd say, oh, the Washington Post. I don't care. I couldn't care less because the people understand. So for the vets, I am very happy I raised that money for you vets. I'm very happy. Even though it got me a lot of bad ink, I'm very happy. I'm very happy. So -- and I want to thank you. Thank you. You know somebody said, you have thick skin. And I said, I really do. When I do something wrong and we all do things wrong, I guess, right? Not too often, but we do things wrong. When I do things wrong and the press writes badly about me, I can handle that. In fact, I congratulate them. I say, it's fine. When you do things that are good things and they try and make it look like it's bad that's when it's not fair and that's when you have to fight back. You have to fight for your rights folks, remember that that. You have to fight for your rights. So here's the story. We're gonna build our military, bigger, better and stronger than ever before. And I was against the war in Iraq and Hillary Clinton was in for it. You know, now she's saying, Donald Trump, do you trust him with the nukes? Let me tell you, my temperament is so much tougher and so much better than her temperament. And by the way, we need a tough temperament. And all of these countries, and remember this, all of these countries that are our allies. She talks about our allies. Our allies think we're very stupid people because we defend Japan and I'm OK with that. But we can't defend him and lose a fortune and that's what's happening, right? We can't. We are not a rich country. We're a poor country. We're a country that owes $19 trillion, soon to be $21 trillion. We have Obamacare, which is a disaster. Did you see in Texas today? Blue Cross Blue Shield in Texas, Blue Cross Blue Shield Texas just announced they go through Obamacare that they're going to have to raise it up 60%, 60%. In other words, you're gonna have a 60% increase. Blue Cross Blue Shield Texas. This is gonna happen all over. A lot of these numbers are going to do on November 1st. Obama is trying to make it so that instead of November 1st, it's going to be December after the election. We can't let him do that because I'll tell you what. Just on that point alone, they lose the election. On guns alone, Hillary Clinton loses the election on the Second Amendment, the Second Amendment. So we're going to rebuild our military. Our military is very sadly depleted. You have to see the numbers, the number of ships we have compared to 15, 20 years ago. The number of soldiers, the number of everything, our equipment is old. I saw on CNN, I thought it was amazing. CNN did a profile of our pilots and the planes, and they're talking to -- these pilots are great pilots, jet fighter pilots. These are great people, great people. And they show a plane that's like 70. I think it was an F18. It was like 17 or 18 years old and it looked it. And they said -- and these were active fighter planes with fantastic people at the helm fighting. And they said, no, the planes are very "}