{"id":386,"author":"Donald Trump","title":"Speech: Donald Trump in Sacramento, CA","date":"2016-06-01","link":"https://factba.se/transcript/donald-trump-speech-sacramento-ca-june-1-2016","paragraphs":["Wow. What is going on? Look at -- what are those people doing so far over there? What are they doing over there? Thank you very much. Thank you very much. Thank you very much. Veterans, I love the veterans. Hey, did I have a hard time? So I raised almost $6 million for the veterans and the press was killing me. Unbelievable.","You know you do something like that and it takes your heart a little bit. You raise all of that money. I have so many veterans calling me and thanking me. These groups have called me and thanked me. But the press they always want to make it look as bad as possible. These are bad people, folks.","Just in case you haven't figured. They are bad, bad people. So we're going to have a good time. You know Sacramento which I know and I like, and we're going to do something because I'm going to make a real run in California, OK? Believe me. And, and only because we're running against Hillary. She's got to be weak.","Who do you think is going to win tomorrow Bernie or Hillary? I don't even know. I don't know. I'm not a fan of Bernie, I have to tell you. But possibly, it looks like you know she can't close them out. I had to close out 16 Governors and Senators and talented people. We had to close out 16. She cannot close out Bernie.","We're going to see. And by the way on June 7th, go out and vote. You know why? You got to vote. Even though I'll say the competition is ended, right? It's ended. But you got to go out and vote because we're looking for records. We've broken the all-time record in the history of the Republican Party. All time record and never been, I mean, think Ronald Reagan, Dwight Eisenhower, all of them.","We've broken it by millions and the more we get because we have a lot of great place, South Dakota. So do the best you can. And I know we're in a lot of live television now. So all those other states get out because it's really nice to have a mandate. We'll have a big beautiful mandate so that when we win, we win with strength, OK? So get out and vote.","And I'll tell you what. You know we have a movement going on, folks. They're writing about it all over. No matter where you go. Covers of Time Magazine many, many covers. I'm -- I love you too. Look at that. That's a guy that said that. That's a guy. Sounded like a tough cookie. Where are you? I like that guy.","But we're on the cover of every magazine, every magazine. I mean, literally every magazine. And oftentimes we're on the cover many, many times and I will tell you, the read -- there's one of them right there. They're holding it up. The reason is because we have a movement because we want to take our country back.","We want to Make America Great Again. We want to make America first. It's going to be first. Thank you. So by the way, do you like that airplane? It's good, right? Good. Made in America. Made in America. Boeing made in America. So very important, you see the way our country is running.","It's running badly. You go to the airports, you see the TSA, a friend of mine said he waited six hours and then by the time he got onto the plane. Guess what? The plane was gone. There was no getting on and it was not a good experience. But that's happening all over the country. And that's just one group.","Everything's run the same way as TSA is run. Our veterans, it's horrible what's happening to our veterans. Illegal immigrants are treated in many cases better than our veterans. It's a disgraceful thing. And we're going to take care of our veterans properly. Properly. You know Hillary Clinton said our veterans are being treated just fine if you can believe that one.","You remember that a few months ago and then the guy running the VA said waiting lines don't matter. They have long waiting lines at Disney. Do you believe that? So this, this is why we happen. Very importantly, in terms of this election. So we're going to come to California. Now, everybody said that for a Republican to run in California it's not going to happen.","But I'm sort of different. You know, I'm like different. You know last night -- so they say there's 11,000 people in the hangar. Last night, I watched as Bernie had a crowd of 3,000 people. That's not bad. That's not bad. But listen -- and the news media said Bernie Sanders had this massive crowd of 3,000 people, it was unbelievable, 3,000. You know what 3,000 people is? It's like a small audience.","It's like forget it. And when we have a crowd like this. Look at this. I mean these people are in the other side of the hangar. We love you just as much, right? Just as much. But 3,000 people and they made such a big deal out of it. We had one recently, where I was at 17,000, Bernie was at 7,000, and they said Donald Trump made a speech tonight -- different locations.","Donald Trump made a speech tonight it was blah, blah, blah, right? Then they said Bernie Sanders had a massive crowd of 7,000. I said man, I'll tell you, these guys, these guys are bad. So that's it. Now, look many things are going to happen. We're going to come in. We're going to work California hard. We're going to work the state of Washington hard.","We may even work Oregon hard because we've been really treated up there great. We're going to work a lot of states that you wouldn't work and we're going to work them hard. We're going to be here a lot. And I think, I think we have a chance. I think we have a good chance. We had 31,000 people two weeks ago right here.","We had 31,000 people two weeks ago. And by the way, what they covered, that was when the kid was stomping on the cop car. When they were burning the American flags, they had kids stomping on the car, remember? So they didn't like talking about it too much. Last week I got the endorsement of the National Rifle Association, NRA.","That was the earliest endorsement that I think they've ever given. And it was before the convention which never happens. Who's going to the convention? A lot of you go into the convention? We're going to have a lot of people. We're going to do a good job in Cleveland. And let me tell, oh, we're going to keep our guns, don't worry about it. You need them.","Remember this, Hillary Clinton, and this is 100%. Hillary Clinton who lies, I mean, she lies. You remember that I cited that she lies. She lies. She made a speech and she is making another one tomorrow. And they sent me a copy of the speech and it was such lies about my foreign policy. That they said I want Japan to nuke.","I want Japan to get nuclear weapons. Give me a break. See, they don't say it. I want Japan and Germany and Saudi Arabia and South Korea and many of the NATO state -- nations. They owe us tremendous. We're taking care of all these people and what I want them to do is pay up. Now remember this, in a nice way, and we'll have a great relationship.","But we're talking about billions and billions and billions of dollars. We're talking about danger. You know we have a treaty with Japan that if the United States gets attacked, think of this, if the United States gets attacked, they don't have to do anything. They can watch it on television. They'll watch it on television.","Made in Japan television. We don't make televisions anymore. So we can't say that but they'll watch it on a Sony television, right? If they get attacked we have to come to their aid. World War three or whatever the hell happens, right? So we love Japan. We love Germany. We love all these places. They've got to help us. They've got to take care -- we, we are not being compensated for what we're doing.","And what I do say is this to make the right deal, the art of the deal, to make the right deal, you have to be prepared to walk. A General recently got on television and he said Donald Trump -- he was told to do this by Obama who by the way doesn't have a clue. This is a President who doesn't have a clue.","And this President now is very intricate because he's going to start campaigning. Well, if he campaigns that means I'm allowed to hit him just like I hit Bill Clinton, I guess, right? If he doesn't I don't care. But if he campaigns and I think he wants to because he wants to keep this terrible agenda going where everybody is ripping us, where the world is ripping us off.","Oh, there's somebody. That's OK. Don't worry about him. Not, not much. All right, get him out. Get him out of here, folks. Get him out of here. Do we love these Trump rallies? Do we love them? All right. Get him out of here. Go ahead. Out. Out. There's a hell of a crowd I'll tell you.","I'll tell you this great. All right, you're getting him out? Where is he? Where is he? Huh? Go ahead get him out. Right. Get him out. OK. That's fine. He's not going to hurt anybody. You know what I always tell them. Be very gentle. Please don't hurt them. This way I don't get bad press, OK? Don't hurt him.","Don't hurt him. All right. So look we're going to change so many things in our country. We're going to make great trade deals. We're going to have a strong border and we're going to have a wall. And we are going to have a wall. And you know who is going to pay for the wall, who? And by the way, 100% not even a question.","We have a trade imbalance. We have a trade deficit right now with Mexico, $58 billion a year, not including all the drugs sending over here, which is probably triple. And we're going to have a wall and it's going to work. Last week I got the endorsement from the Border Patrol agent, 16,500. They need the wall.","They want the wall. They said to me, Mr. Trump, we need the wall. It's a tool. It's another tool. It's our most important tool but we need the wall. Look at that, Latinos for Trump. I love you people. I love you. Thank you. That's what I like. Latinos for Trump. So we're going to do a lot of things, folks.","We're going to do a lot of things. We're going to repeal Obamacare and replace it. It's a disaster. And you know Obamacare, the numbers, this is very good. But Obama is working hard to change it. The numbers are coming out right now. The numbers are scheduled to come out on November 1st. The increases are going to be so large that everybody is going to vote for Donald Trump.","It's a catastrophe. Now, Obama is trying to move it into December because if people see the kind of increases that you're talking about, could be 40% by the way, nobody's going to vote for anybody having to do with the Obama administration. So we are going to make sure that our people don't let them move that date November 1st. The Obamacare numbers are going to come out.","Wait till you see the kind of increases that you're going to have to pay. You're not going to believe it. On top of which it's no good. It doesn't work, OK? It doesn't work. So a couple of things, I have to do this because you know all about -- I do like details and I do like statisticians. I wouldn't want to be a statistician but when I look at Sacramento because I love Sacramento.","I have many friends -- who is not from Sacramento here? Oh, there are many people? That's a lot of people. Wow, that's a lot of people. That's good. They come from all over. So listen, this is on Sacramento. We've got it now. We got to have this. Since Bill Clinton signed an agreement to put China into the World Trade Organization.","You know about that catastrophe. Sacramento has lost nearly one in five manufacturing jobs. Great going. Listen to this, this one. Hillary Clinton when she was secretary of state, ran up $1 trillion in trade deficits with China, $1 trillion. Great job, Hillary. Hillary, a great job Hillary. You're doing a great job.","Crooked Hillary. Crooked, crooked Hillary. She is a crooked, she is a crooked person. See? I'm being nice. At the same time, Secretary Clinton was surrendering our jobs to China. The Chinese government and its supporters were funneling huge sums, I mean, huge sums of money to Bill Clinton so he gives speeches.","So she's giving China all these deals and China is paying him vast amounts of money to make speeches. Great job. Great job. I'm sure they never discussed it. I'm sure that nothing -- I'm sure it was just a coincidence. Folks, folks when are you going to get -- these are crooked people. These are crooked people.","They've been crooked from the beginning. They were crooked with Whitewater. They've been crooked from the beginning. You look at that foundation, it's pure theft and pure crookedness. Read the book. The book is unbelievable. In fact, now they just came out with a movie. It's coming out like, very soon, but read the book.","These are crooked people. We don't need another four years of Clinton. Believe me, we don't need it. Since Bill Clinton signed NAFTA. OK, people don't realize, Bill Clinton signed the single worst agreement ever made in terms of economic development. It wiped out states including your states. It's, it's taken so many manufacturing jobs out.","You know I won New York in a landslide. One of the reasons, I went up to Albany, I went up to all these places. The state's been wiped out. Companies, they moved down to Mexico. They moved to other places. It's a total disaster. Bill Clinton made that deal and it destroyed the manufacturing in our country.","You got to remember that though because to me NAFTA when I -- I wasn't sure, you know, somebody said he didn't sign the deal. I said I thought he did which -- Bill Clinton signed after the worst. Roughly one in five children in Sacramento lives in poverty. No good, folks. We're going to stop that. Great people, working hard, can't get jobs.","You know that 5% is -- it's a sham. It's a total sham. That was put there so that Presidents look better. Your real number is close to 20%, and if it wasn't, despite the fact you liked me on the military and the border and all that, we wouldn't have crowds like this every place I go. We wouldn't have crowds like this.","So since 2000, listen to this, this is not good. I just have to get the pain over with. But you know here's a story. Don't worry about it. We're going to make it better fast. We're going to bring your jobs back. We're going to make things so much better. We're not going to let these countries get away with what they're doing.","They're ripping you off. They're taking your jobs. By the way today in golf, anybody tell you what happened? They moved the World Golf Championship which used to be Cadillac, a great sponsor by the way, Cadillac and they wanted it longer. They moved the World Golf Championships from Miami to Mexico City.","Can you believe it? Can you believe it? So they move -- think of it. They move the PGA Tour, move the World Golf Championships from Miami where they're furious to Mexico City. Not good. But that's OK. Folks, it's all going to be settled. You vote for Donald Trump as President. If I become your president this stuff is all going to stop.","This stuff is all going to stop. I mean, you know the story with Carrier moving to Mexico, forward-moving to Mexico. Nabisco moving to Mexico. Everybody's moving to Mexico. You know why? Because our leaders are stupid people. I'm telling you. They're stupid, stupid people. Led by our President if you call them that.","OK, ready? Last year the Sacramento Bee, does anyone know what the hell the Sacramento Bee is? Because I do. They were actually very nice to me which is amazing actually. Last year the Sacramento Bee reported that nearly a third of California's households struggle each month just for basic needs.","They're struggling, a third of their households. Yet, despite the widespread financial hardship, Hillary Clinton wants a 500% increase in Syrian refugees. We have no idea. We have no idea. She wants that. She wants to abolish the Second Amendment. She doesn't know. Honestly, I'll tell you what.","I'll tell you what, folks. She doesn't know what the hell she's doing. It's going to be another four years of disaster. You're probably better off with Bernie, but that's not going to happen either. Last year, the FBI found that violent crime rose faster in Sacramento than in any other of America's 25 largest cities.","You should be ashamed of yourselves. Like the press should be ashamed of themselves, all right? Murder, rape, robbery, and assault all increased by substantial numbers. Unbelievable. Jerry Brown. Yeah, he's -- I know Jerry Brown. Hey, you know, I know Jerry Brown.","Who likes Jerry Brown? Anybody like Jerry Brown? Because he just endorsed Hillary. He said I want crooked Hillary. I want that crook to run my country. A Trump administration is going to make America work again. Got to get rid of the airport lines. We're going to rebuild our military.","We're going to invest in missile defense. We're going to have new roads, bridges, infrastructure, all of that stuff. But here's the thing. Look, look, we have so many things. I cut this article out recently from a paper. See that? This is from a newspaper. Now everything's Internet. They don't read these papers anymore which is great because most of them are not worth anything.","Listen, illegal immigrants get $1,261 more welfare than American families. It's $5,692 think of it. Illegal immigrants are getting $5,692 versus $4,000 -- $431. No good. No good. Can't do it. We don't have any money. We're a country that's bust. We can't do it, OK? Now let me just go over a couple of these points because we have to. Are you ready?","I have to. I wrote them down in the plane. I said look I want to write them down. Ready? Hillary is not a talented person. In fact, she's a person with absolutely no natural talent. All you have to do is watch her speak and do you ever notice even for a minor speech she has teleprompters. Do I have teleprompters here?","No. But she's got like these minor speeches and she's going, and I saw this a couple of times. See? You know four words. We're going to win in the North, South, East, and West. Bah, bah, bah, bah, bah, bah, bah. bah. Oh, boy. So insincere. Number one, and I'll copy Bernie because Bernie's good with this because of I say it, they say oh, he's too rough.","She's not qualified because she has bad judgment. Now, who said that? Bernie Sanders said it about Hillary. She's not qualified. So here are seven points and I walk down which I think are important and they talk about Hillary and her incompetence. She's one of the worst Secretaries of State in the history of our country.","Now she wants to be our President. Look, I'll be honest, she has no natural talent to be President. This is not a President. They talk about me, actually, a lot of people think I look extremely Presidential. You want to know the -- but, but, do you really believe that Hillary is Presidential? This is not Presidential material.","Her Libya invasion, the Libya invasion was disgusting. I mean, you know who has the oil? ISIS has the oil from Libya. We went in, we knocked the hell out of Libya. We did all of the things with Gadhafi and all, oh, we did great. She ends up with Benghazi. Remember the famous phone call at 3:00 in the morning.","She'll answer the call. Guess what? She was sleeping. She was sleeping like a baby. Don't wake me up. Of course, she took the calls from her slimy friends but she didn't take five to six hundred calls. They were calling and calling and she was sleeping and she did that phony commercial. Remember that? That phony commercial.","If the phone rings at 3 o'clock in the morning. Well, it did ring a lot of times and she was sleeping. Maybe it's no energy, low energy, right? She needed her sleep. She needed her sleep. So her Libya invasion, decisions on Syria, Iraq, and Iran have made the Middle East more dangerous than ever, ever before.","And you know that. She went to sleep when our Ambassador was murdered and we talked about that. But she went to sleep. She wants to ship all of our jobs overseas. Hillary Clinton wants to make trade agreements that will take care of the rest of her jobs that her husband didn't take care of with NAFTA. We're not going to let it happen, folks.","We're going to bring our jobs back. A big thing and a big thing for Sacramento. Another point, I said it before, she wants to abolish the Second Amendment. Never ever, ever going to happen. And she does and I believe me she'll say, I don't want to but -- you look at what she wants to do. She wants to abolish the Second Amendment.","Just believe me. She wants totally open borders. She wants a 500% increase in Syrian refugees. Now, remember this, folks, folks, we have no idea who the hell these people are. And we all have big hearts and let's build some safe zones in Syria. Let's get the Gulf states to pay for them because the Gulf states have a lot of money.","We'll get it done. We'll get the Gulf states to pay for it. I don't want to pay for them. We don't have any money. And then of course, you talk about bad judgment. Go ahead, thank you. So you talk, you talk about bad judgment. She broke federal law by putting her emails on a secret private server that foreign countries could easily get to and hack.","I mean folks, if anybody else but her did this they'd be in jail two years already. I mean honestly, she should not be allowed to run. It's a disgrace. It's a disgrace to the laws of our country. She should not be allowed to run. With that being said, I want to beat her. But she should not be allowed to run.","So look, we are going to make our country so strong again. We have to. We have no choice. We have to. We're going to bring back our jobs. So important, our jobs are a disaster. We're going to bring back our jobs and we're going to bring them back fast. So what happened? You know, I won all those states and then they said I won't say who because you know what?","Once you win, you don't have to talk about it. But a couple of guys, one in particular, said Indiana that's going to be the firewall, Indiana. Well, I had Bobby Knight, so once I had Bobby Knight, it was all right. Bobby Knight, boy, what a coach. 900 games he won, 900, three championships, last undefeated season.","He called me up probably five months before I was going to run, Bobby Knight. Great coach. Great guy. Tough guy. Is he too tough? Do you think he's too tough? No. We need toughness. Then he said, you know Mr. Trump, I don't know you, but you're the kind of guy I want to see run for President. This before I decided to do it. It's a big decision.","You know, it's not easy. Believe me. It's a big decision. I have to deal with that scumbag there that right all the bad stuff. Believe me, they write bad stuff. They write really bad stuff. Not all of them. Some are good but there are so many of them are such bad people. They're bad human beings and they're liars, OK? They're liars.","But Bobby Knight calls me up before I'm going to run he said, you should run. I said coach give me a number if I do, I'm going to call you. And I said to put it at the bottom of my desk. I had a pile of papers a mile high and a friend came in and he goes to. We won New York. We won Pennsylvania. We won Connecticut.","We won everything. And then a friend came in and he said, Donald if you could ever get Bobby Knight. I said I think I can. This is like a year later. And I said to him Bobby Knight called me like a year ago and he said I should run. Let me see if I can find -- I lift up this pile of papers and there's this number like sitting there.","That's better than having an iPhone, right? Is that -- that's the old fashioned way. And I said coach, coach, how are you doing? It's Donald Trump. He said I've been waiting for you to call. And that was the week before I went to Indiana. And man was he good. He was great. And we just -- we won in a landslide but we won New York, we won Pennsylvania, we won Connecticut, we won Rhode Island, and Delaware, Maryland and then we won -- they were the last ones when we -- I'll tell you a special place for me was New Hampshire because, in New Hampshire, I got to know the people really well.","That was my first victory. I wasn't supposed to win New Hampshire. Jeb Bush was supposed to win New Hampshire. But he was supposed -- you know sort of his territory. He was supposed to win and I got to know the people and I campaigned and I made speeches, but I really sat down with people, and people of New Hampshire and I said what's the problem up here?","Because they were, you know, they've got some problems. They said our problem is heroin. I said heroin? What are you talking about? He said our problem's heroin. Now, you look at the rivers and the trees and those beautiful roads, and it doesn't seem -- they have a tremendous heroin problem. You have and everybody has and it comes across the border.","That's why that wall is going to get built and that wall is going to be so powerful. It's going to be so powerful. And don't kid yourself. The wall -- you know ask Israel, do walls work? They work. Just ask Israel. Have no choice. Have no choice. Folks, we have no choice.","You know when I was in the debates, did I do a good job in the debates? You know I think so. I didn't know. I never debated professionally. All of a sudden I'm standing up there remember? There were 17 people, 17. They had what they called the Children's stage and the real stage. And every single debate, I was dead center, right?","And it used to bother me when we had an even number. I tell CNN and I would tell FOX. I'd say listen, I want to have odd numbers and they never knew what I was talking about because when you have an odd number you're in the center. When you have an even number you got two guys in the center, that's no good.","So -- but I was in the center for every debate. Every single poll, the online polls after the debates. Every single poll of every single debate they say I won. I didn't know. I never did this yet. Ted Cruz who was like a professional debater. You had all these people. I look so forward to debating crooked Hillary.","Oh, well, I look forward. You know Bernie wanted to debate me. I don't know if he did or not he didn't -- he wasn't trying too hard I'll tell you. Believe me, behind the scenes he wasn't trying hard. To the media he was, oh, I to debate him. Behind the scenes, I'm not sure he wanted it. But Bernie in all fairness, I said put up money to the networks.","Put up money for women's health issues in this case and they're very cheap. You know they want to make a lot of money but they're not so, they're not so fast with giving it away. But I would have liked it but then I said, and somebody told me this so look, the system is rigged. The guy is working hard but his system is rigged.","He can't win. You shouldn't be debating the guy that comes in number two. Does that make sense? Yeah? And the networks weren't coming through but it would be a good spectacle. We knock off Bernie and then we knock off Hillary, I don't know. The problem is he can't win. The system's all rigged up. It's all rigged up for Hillary.","So let's see what happens. But I look so forward to debate -- whoever the hell I have to debate. I don't care but I look so forward to those debates. So here's what we're going to do. We have a country that doesn't win anymore, right? We know that. We have a -- when was the last time. Seriously, think about it. When was the last time we had a victory in this country?","We don't have victories anymore. Did you see our GDP? It's like almost zero. If that happened in China they'd have a revolution. It's -- you know they get down to 7%, 8%, and they start devaluing their currency again which kills us because they take our jobs and they kill our companies when they do that.","And they're not supposed to do that and they're not supposed to be building fortresses in the South China Sea. They have no respect for our country. They have no respect for our President. They think he's a total lightweight and now he's going to be campaigning. And you know what? He shouldn't campaign. He should go out and do the job that he's supposed to be doing not campaigning.","So we don't win anymore. We don't win with jobs. We don't win with the economy. We don't win it all. But let me tell you, folks and I mean this so sincerely, we are going to win like we've never won before. I'm telling you. I'm telling you. We're going to bring our jobs back. We're not going to let Carrier go so easily to Mexico.","We're not going to let Ford build its plants in Mexico and other places. We're going to say, folks, you're not going to close plants in Michigan. I think I'm going to win Michigan. You know Michigan's another one. They're saying that a Democrat will win Michigan except for a problem. They just looked at a poll, Trump is winning in Michigan.","Because, because for two years I've been talking about how Michigan has been abused. That's why I won in Indiana. I won Indiana because for years, for years, I've been talking about what is happening with Indiana and certain companies. And then all of a sudden Carrier says they're leaving and they fire all those people, and those people used to attend my speeches like crazy.","So here's the story. We don't win anymore, we're going to start winning. We're going to win with our military. We're going to knock the hell out of ISIS remember that. We have no choice. We have no choice. We're going to win in our borders. We're going to build the wall. It's going to be a great wall. Someday maybe they'll call it Trump.","So I have to make it big and beautiful. I don't want a wall named after me but we are going to build a great wall. We are going to let our incredible border agents who endorsed me, Sheriff Joe Arpaio endorsed me too of Arizona. These are the people that know what they're doing. So we are going to build a wall and we're going to keep the drugs out of here, poisoning our youth, poisoning everybody.","We're going to keep them out. And by the way, we're going to have the wall but people are going to come pouring into our country but they're going to come in legally. We want them to come in. They're going to come in legally. We're going to have great healthcare. We're going to repeal and replace Obamacare.","We're going to have alternatives that are so much better and so much less. We're going to get rid of Common Core. We're going to have local education. Right? We are going to save our Second Amendment from assault from Hillary Clinton and all of these people that don't know what they're doing. You look at what's going on and you study what they're doing with your Second Amendment.","Believe me, we are going to save it. We are going to appoint great Supreme Court Justices, one of the most important thing. Because you know if they put in -- if somebody else gets in, you are maybe never going to see our country be great again. You're going to see such a difference. You're going to see such a difference and we're going to make trade deals the likes of which our country has never made.","We're going to bring our jobs back. We're going to bring wealth back to our country. We don't have wealth right now. We are poverty. We are like a third world nation. You look at our airports, you look at our roads, our bridges, our tunnels, we're like a third world nation. You go over to the Middle East, you go over to China, you go over to Japan.","You look at what they have and compared to what we have, not going to happen anymore folks. So here's the story. You elect me President and remember June 7th go out and vote. But most importantly, November, you got to go. But get out there on June 7th. That's our starter. That's our warm-up. We are going to start winning again.","We are going to win it every element that we have. We're going to win with our military. We're going to win on trade. We're going to win with healthcare. We're going to win with education. We're going to win with every single element. We're going to win at the border. We're going to win with the wall and Mexico will pay for that wall.","We're going to win at every single -- and my friends from Sacramento and I, I have a lot of them and there are a lot of them in the audience. I hate to call but they're going to represent you well and they're going to come and see me representing you. And they're going to say, Mr. President, we have to talk.","What? We're winning too much. We can't take it anymore. The people of Sacramento cannot take all of these victories, Mr. President. We don't want you to win so much. It's not fair to the rest of the world. Don't win Mr. President. I'm going to say, I'm sorry, folks. We're going to win, win, win. We're going to make our country great again.","We're going to make our country great again, greater than ever before. Ladies and gentlemen, America first, America first. Thank you very much. I love you Sacramento. Thank you. Thank you. Thank you."],"text":" Wow. What is going on? Look at -- what are those people doing so far over there? What are they doing over there? Thank you very much. Thank you very much. Thank you very much. Veterans, I love the veterans. Hey, did I have a hard time? So I raised almost $6 million for the veterans and the press was killing me. Unbelievable. You know you do something like that and it takes your heart a little bit. You raise all of that money. I have so many veterans calling me and thanking me. These groups have called me and thanked me. But the press they always want to make it look as bad as possible. These are bad people, folks. Just in case you haven't figured. They are bad, bad people. So we're going to have a good time. You know Sacramento which I know and I like, and we're going to do something because I'm going to make a real run in California, OK? Believe me. And, and only because we're running against Hillary. She's got to be weak. Who do you think is going to win tomorrow Bernie or Hillary? I don't even know. I don't know. I'm not a fan of Bernie, I have to tell you. But possibly, it looks like you know she can't close them out. I had to close out 16 Governors and Senators and talented people. We had to close out 16. She cannot close out Bernie. We're going to see. And by the way on June 7th, go out and vote. You know why? You got to vote. Even though I'll say the competition is ended, right? It's ended. But you got to go out and vote because we're looking for records. We've broken the all-time record in the history of the Republican Party. All time record and never been, I mean, think Ronald Reagan, Dwight Eisenhower, all of them. We've broken it by millions and the more we get because we have a lot of great place, South Dakota. So do the best you can. And I know we're in a lot of live television now. So all those other states get out because it's really nice to have a mandate. We'll have a big beautiful mandate so that when we win, we win with strength, OK? So get out and vote. And I'll tell you what. You know we have a movement going on, folks. They're writing about it all over. No matter where you go. Covers of Time Magazine many, many covers. I'm -- I love you too. Look at that. That's a guy that said that. That's a guy. Sounded like a tough cookie. Where are you? I like that guy. But we're on the cover of every magazine, every magazine. I mean, literally every magazine. And oftentimes we're on the cover many, many times and I will tell you, the read -- there's one of them right there. They're holding it up. The reason is because we have a movement because we want to take our country back. We want to Make America Great Again. We want to make America first. It's going to be first. Thank you. So by the way, do you like that airplane? It's good, right? Good. Made in America. Made in America. Boeing made in America. So very important, you see the way our country is running. It's running badly. You go to the airports, you see the TSA, a friend of mine said he waited six hours and then by the time he got onto the plane. Guess what? The plane was gone. There was no getting on and it was not a good experience. But that's happening all over the country. And that's just one group. Everything's run the same way as TSA is run. Our veterans, it's horrible what's happening to our veterans. Illegal immigrants are treated in many cases better than our veterans. It's a disgraceful thing. And we're going to take care of our veterans properly. Properly. You know Hillary Clinton said our veterans are being treated just fine if you can believe that one. You remember that a few months ago and then the guy running the VA said waiting lines don't matter. They have long waiting lines at Disney. Do you believe that? So this, this is why we happen. Very importantly, in terms of this election. So we're going to come to California. Now, everybody said that for a Republican to run in California it's not going to happen. But I'm sort of different. You know, I'm like different. You know last night -- so they say there's 11,000 people in the hangar. Last night, I watched as Bernie had a crowd of 3,000 people. That's not bad. That's not bad. But listen -- and the news media said Bernie Sanders had this massive crowd of 3,000 people, it was unbelievable, 3,000. You know what 3,000 people is? It's like a small audience. It's like forget it. And when we have a crowd like this. Look at this. I mean these people are in the other side of the hangar. We love you just as much, right? Just as much. But 3,000 people and they made such a big deal out of it. We had one recently, where I was at 17,000, Bernie was at 7,000, and they said Donald Trump made a speech tonight -- different locations. Donald Trump made a speech tonight it was blah, blah, blah, right? Then they said Bernie Sanders had a massive crowd of 7,000. I said man, I'll tell you, these guys, these guys are bad. So that's it. Now, look many things are going to happen. We're going to come in. We're going to work California hard. We're going to work the state of Washington hard. We may even work Oregon hard because we've been really treated up there great. We're going to work a lot of states that you wouldn't work and we're going to work them hard. We're going to be here a lot. And I think, I think we have a chance. I think we have a good chance. We had 31,000 people two weeks ago right here. We had 31,000 people two weeks ago. And by the way, what they covered, that was when the kid was stomping on the cop car. When they were burning the American flags, they had kids stomping on the car, remember? So they didn't like talking about it too much. Last week I got the endorsement of the National Rifle Association, NRA. That was the earliest endorsement that I think they've ever given. And it was before the convention which never happens. Who's going to the convention? A lot of you go into the convention? We're going to have a lot of people. We're going to do a good job in Cleveland. And let me tell, oh, we're going to keep our guns, don't worry about it. You need them. Remember this, Hillary Clinton, and this is 100%. Hillary Clinton who lies, I mean, she lies. You remember that I cited that she lies. She lies. She made a speech and she is making another one tomorrow. And they sent me a copy of the speech and it was such lies about my foreign policy. That they said I want Japan to nuke. I want Japan to get nuclear weapons. Give me a break. See, they don't say it. I want Japan and Germany and Saudi Arabia and South Korea and many of the NATO state -- nations. They owe us tremendous. We're taking care of all these people and what I want them to do is pay up. Now remember this, in a nice way, and we'll have a great relationship. But we're talking about billions and billions and billions of dollars. We're talking about danger. You know we have a treaty with Japan that if the United States gets attacked, think of this, if the United States gets attacked, they don't have to do anything. They can watch it on television. They'll watch it on television. Made in Japan television. We don't make televisions anymore. So we can't say that but they'll watch it on a Sony television, right? If they get attacked we have to come to their aid. World War three or whatever the hell happens, right? So we love Japan. We love Germany. We love all these places. They've got to help us. They've got to take care -- we, we are not being compensated for what we're doing. And what I do say is this to make the right deal, the art of the deal, to make the right deal, you have to be prepared to walk. A General recently got on television and he said Donald Trump -- he was told to do this by Obama who by the way doesn't have a clue. This is a President who doesn't have a clue. And this President now is very intricate because he's going to start campaigning. Well, if he campaigns that means I'm allowed to hit him just like I hit Bill Clinton, I guess, right? If he doesn't I don't care. But if he campaigns and I think he wants to because he wants to keep this terrible agenda going where everybody is ripping us, where the world is ripping us off. Oh, there's somebody. That's OK. Don't worry about him. Not, not much. All right, get him out. Get him out of here, folks. Get him out of here. Do we love these Trump rallies? Do we love them? All right. Get him out of here. Go ahead. Out. Out. There's a hell of a crowd I'll tell you. I'll tell you this great. All right, you're getting him out? Where is he? Where is he? Huh? Go ahead get him out. Right. Get him out. OK. That's fine. He's not going to hurt anybody. You know what I always tell them. Be very gentle. Please don't hurt them. This way I don't get bad press, OK? Don't hurt him. Don't hurt him. All right. So look we're going to change so many things in our country. We're going to make great trade deals. We're going to have a strong border and we're going to have a wall. And we are going to have a wall. And you know who is going to pay for the wall, who? And by the way, 100% not even a question. We have a trade imbalance. We have a trade deficit right now with Mexico, $58 billion a year, not including all the drugs sending over here, which is probably triple. And we're going to have a wall and it's going to work. Last week I got the endorsement from the Border Patrol agent, 16,500. They need the wall. They want the wall. They said to me, Mr. Trump, we need the wall. It's a tool. It's another tool. It's our most important tool but we need the wall. Look at that, Latinos for Trump. I love you people. I love you. Thank you. That's what I like. Latinos for Trump. So we're going to do a lot of things, folks. We're going to do a lot of things. We're going to repeal Obamacare and replace it. It's a disaster. And you know Obamacare, the numbers, this is very good. But Obama is working hard to change it. The numbers are coming out right now. The numbers are scheduled to come out on November 1st. The increases are going to be so large that everybody is going to vote for Donald Trump. It's a catastrophe. Now, Obama is trying to move it into December because if people see the kind of increases that you're talking about, could be 40% by the way, nobody's going to vote for anybody having to do with the Obama administration. So we are going to make sure that our people don't let them move that date November 1st. The Obamacare numbers are going to come out. Wait till you see the kind of increases that you're going to have to pay. You're not going to believe it. On top of which it's no good. It doesn't work, OK? It doesn't work. So a couple of things, I have to do this because you know all about -- I do like details and I do like statisticians. I wouldn't want to be a statistician but when I look at Sacramento because I love Sacramento. I have many friends -- who is not from Sacramento here? Oh, there are many people? That's a lot of people. Wow, that's a lot of people. That's good. They come from all over. So listen, this is on Sacramento. We've got it now. We got to have this. Since Bill Clinton signed an agreement to put China into the World Trade Organization. You know about that catastrophe. Sacramento has lost nearly one in five manufacturing jobs. Great going. Listen to this, this one. Hillary Clinton when she was secretary of state, ran up $1 trillion in trade deficits with China, $1 trillion. Great job, Hillary. Hillary, a great job Hillary. You're doing a great job. Crooked Hillary. Crooked, crooked Hillary. She is a crooked, she is a crooked person. See? I'm being nice. At the same time, Secretary Clinton was surrendering our jobs to China. The Chinese government and its supporters were funneling huge sums, I mean, huge sums of money to Bill Clinton so he gives speeches. So she's giving China all these deals and China is paying him vast amounts of money to make speeches. Great job. Great job. I'm sure they never discussed it. I'm sure that nothing -- I'm sure it was just a coincidence. Folks, folks when are you going to get -- these are crooked people. These are crooked people. They've been crooked from the beginning. They were crooked with Whitewater. They've been crooked from the beginning. You look at that foundation, it's pure theft and pure crookedness. Read the book. The book is unbelievable. In fact, now they just came out with a movie. It's coming out like, very soon, but read the book. These are crooked people. We don't need another four years of Clinton. Believe me, we don't need it. Since Bill Clinton signed NAFTA. OK, people don't realize, Bill Clinton signed the single worst agreement ever made in terms of economic development. It wiped out states including your states. It's, it's taken so many manufacturing jobs out. You know I won New York in a landslide. One of the reasons, I went up to Albany, I went up to all these places. The state's been wiped out. Companies, they moved down to Mexico. They moved to other places. It's a total disaster. Bill Clinton made that deal and it destroyed the manufacturing in our country. You got to remember that though because to me NAFTA when I -- I wasn't sure, you know, somebody said he didn't sign the deal. I said I thought he did which -- Bill Clinton signed after the worst. Roughly one in five children in Sacramento lives in poverty. No good, folks. We're going to stop that. Great people, working hard, can't get jobs. You know that 5% is -- it's a sham. It's a total sham. That was put there so that Presidents look better. Your real number is close to 20%, and if it wasn't, despite the fact you liked me on the military and the border and all that, we wouldn't have crowds like this every place I go. We wouldn't have crowds like this. So since 2000, listen to this, this is not good. I just have to get the pain over with. But you know here's a story. Don't worry about it. We're going to make it better fast. We're going to bring your jobs back. We're going to make things so much better. We're not going to let these countries get away with what they're doing. They're ripping you off. They're taking your jobs. By the way today in golf, anybody tell you what happened? They moved the World Golf Championship which used to be Cadillac, a great sponsor by the way, Cadillac and they wanted it longer. They moved the World Golf Championships from Miami to Mexico City. Can you believe it? Can you believe it? So they move -- think of it. They move the PGA Tour, move the World Golf Championships from Miami where they're furious to Mexico City. Not good. But that's OK. Folks, it's all going to be settled. You vote for Donald Trump as President. If I become your president this stuff is all going to stop. This stuff is all going to stop. I mean, you know the story with Carrier moving to Mexico, forward-moving to Mexico. Nabisco moving to Mexico. Everybody's moving to Mexico. You know why? Because our leaders are stupid people. I'm telling you. They're stupid, stupid people. Led by our President if you call them that. OK, ready? Last year the Sacramento Bee, does anyone know what the hell the Sacramento Bee is? Because I do. They were actually very nice to me which is amazing actually. Last year the Sacramento Bee reported that nearly a third of California's households struggle each month just for basic needs. They're struggling, a third of their households. Yet, despite the widespread financial hardship, Hillary Clinton wants a 500% increase in Syrian refugees. We have no idea. We have no idea. She wants that. She wants to abolish the Second Amendment. She doesn't know. Honestly, I'll tell you what. I'll tell you what, folks. She doesn't know what the hell she's doing. It's going to be another four years of disaster. You're probably better off with Bernie, but that's not going to happen either. Last year, the FBI found that violent crime rose faster in Sacramento than in any other of America's 25 largest cities. You should be ashamed of yourselves. Like the press should be ashamed of themselves, all right? Murder, rape, robbery, and assault all increased by substantial numbers. Unbelievable. Jerry Brown. Yeah, he's -- I know Jerry Brown. Hey, you know, I know Jerry Brown. Who likes Jerry Brown? Anybody like Jerry Brown? Because he just endorsed Hillary. He said I want crooked Hillary. I want that crook to run my country. A Trump administration is going to make America work again. Got to get rid of the airport lines. We're going to rebuild our military. We're going to invest in missile defense. We're going to have new roads, bridges, infrastructure, all of that stuff. But here's the thing. Look, look, we have so many things. I cut this article out recently from a paper. See that? This is from a newspaper. Now everything's Internet. They don't read these papers anymore which is great because most of them are not worth anything. Listen, illegal immigrants get $1,261 more welfare than American families. It's $5,692 think of it. Illegal immigrants are getting $5,692 versus $4,000 -- $431. No good. No good. Can't do it. We don't have any money. We're a country that's bust. We can't do it, OK? Now let me just go over a couple of these points because we have to. Are you ready? I have to. I wrote them down in the plane. I said look I want to write them down. Ready? Hillary is not a talented person. In fact, she's a person with absolutely no natural talent. All you have to do is watch her speak and do you ever notice even for a minor speech she has teleprompters. Do I have teleprompters here? No. But she's got like these minor speeches and she's going, and I saw this a couple of times. See? You know four words. We're going to win in the North, South, East, and West. Bah, bah, bah, bah, bah, bah, bah. bah. Oh, boy. So insincere. Number one, and I'll copy Bernie because Bernie's good with this because of I say it, they say oh, he's too rough. She's not qualified because she has bad judgment. Now, who said that? Bernie Sanders said it about Hillary. She's not qualified. So here are seven points and I walk down which I think are important and they talk about Hillary and her incompetence. She's one of the worst Secretaries of State in the history of our country. Now she wants to be our President. Look, I'll be honest, she has no natural talent to be President. This is not a President. They talk about me, actually, a lot of people think I look extremely Presidential. You want to know the -- but, but, do you really believe that Hillary is Presidential? This is not Presidential material. Her Libya invasion, the Libya invasion was disgusting. I mean, you know who has the oil? ISIS has the oil from Libya. We went in, we knocked the hell out of Libya. We did all of the things with Gadhafi and all, oh, we did great. She ends up with Benghazi. Remember the famous phone call at 3:00 in the morning. She'll answer the call. Guess what? She was sleeping. She was sleeping like a baby. Don't wake me up. Of course, she took the calls from her slimy friends but she didn't take five to six hundred calls. They were calling and calling and she was sleeping and she did that phony commercial. Remember that? That phony commercial. If the phone rings at 3 o'clock in the morning. Well, it did ring a lot of times and she was sleeping. Maybe it's no energy, low energy, right? She needed her sleep. She needed her sleep. So her Libya invasion, decisions on Syria, Iraq, and Iran have made the Middle East more dangerous than ever, ever before. And you know that. She went to sleep when our Ambassador was murdered and we talked about that. But she went to sleep. She wants to ship all of our jobs overseas. Hillary Clinton wants to make trade agreements that will take care of the rest of her jobs that her husband didn't take care of with NAFTA. We're not going to let it happen, folks. We're going to bring our jobs back. A big thing and a big thing for Sacramento. Another point, I said it before, she wants to abolish the Second Amendment. Never ever, ever going to happen. And she does and I believe me she'll say, I don't want to but -- you look at what she wants to do. She wants to abolish the Second Amendment. Just believe me. She wants totally open borders. She wants a 500% increase in Syrian refugees. Now, remember this, folks, folks, we have no idea who the hell these people are. And we all have big hearts and let's build some safe zones in Syria. Let's get the Gulf states to pay for them because the Gulf states have a lot of money. We'll get it done. We'll get the Gulf states to pay for it. I don't want to pay for them. We don't have any money. And then of course, you talk about bad judgment. Go ahead, thank you. So you talk, you talk about bad judgment. She broke federal law by putting her emails on a secret private server that foreign countries could easily get to and hack. I mean folks, if anybody else but her did this they'd be in jail two years already. I mean honestly, she should not be allowed to run. It's a disgrace. It's a disgrace to the laws of our country. She should not be allowed to run. With that being said, I want to beat her. But she should not be allowed to run. So look, we are going to make our country so strong again. We have to. We have no choice. We have to. We're going to bring back our jobs. So important, our jobs are a disaster. We're going to bring back our jobs and we're going to bring them back fast. So what happened? You know, I won all those states and then they said I won't say who because you know what? Once you win, you don't have to talk about it. But a couple of guys, one in particular, said Indiana that's going to be the firewall, Indiana. Well, I had Bobby Knight, so once I had Bobby Knight, it was all right. Bobby Knight, boy, what a coach. 900 games he won, 900, three championships, last undefeated season. He called me up probably five months before I was going to run, Bobby Knight. Great coach. Great guy. Tough guy. Is he too tough? Do you think he's too tough? No. We need toughness. Then he said, you know Mr. Trump, I don't know you, but you're the kind of guy I want to see run for President. This before I decided to do it. It's a big decision. You know, it's not easy. Believe me. It's a big decision. I have to deal with that scumbag there that right all the bad stuff. Believe me, they write bad stuff. They write really bad stuff. Not all of them. Some are good but there are so many of them are such bad people. They're bad human beings and they're liars, OK? They're liars. But Bobby Knight calls me up before I'm going to run he said, you should run. I said coach give me a number if I do, I'm going to call you. And I said to put it at the bottom of my desk. I had a pile of papers a mile high and a friend came in and he goes to. We won New York. We won Pennsylvania. We won Connecticut. We won everything. And then a friend came in and he said, Donald if you could ever get Bobby Knight. I said I think I can. This is like a year later. And I said to him Bobby Knight called me like a year ago and he said I should run. Let me see if I can find -- I lift up this pile of papers and there's this number like sitting there. That's better than having an iPhone, right? Is that -- that's the old fashioned way. And I said coach, coach, how are you doing? It's Donald Trump. He said I've been waiting for you to call. And that was the week before I went to Indiana. And man was he good. He was great. And we just -- we won in a landslide but we won New York, we won Pennsylvania, we won Connecticut, we won Rhode Island, and Delaware, Maryland and then we won -- they were the last ones when we -- I'll tell you a special place for me was New Hampshire because, in New Hampshire, I got to know the people really well. That was my first victory. I wasn't supposed to win New Hampshire. Jeb Bush was supposed to win New Hampshire. But he was supposed -- you know sort of his territory. He was supposed to win and I got to know the people and I campaigned and I made speeches, but I really sat down with people, and people of New Hampshire and I said what's the problem up here? Because they were, you know, they've got some problems. They said our problem is heroin. I said heroin? What are you talking about? He said our problem's heroin. Now, you look at the rivers and the trees and those beautiful roads, and it doesn't seem -- they have a tremendous heroin problem. You have and everybody has and it comes across the border. That's why that wall is going to get built and that wall is going to be so powerful. It's going to be so powerful. And don't kid yourself. The wall -- you know ask Israel, do walls work? They work. Just ask Israel. Have no choice. Have no choice. Folks, we have no choice. You know when I was in the debates, did I do a good job in the debates? You know I think so. I didn't know. I never debated professionally. All of a sudden I'm standing up there remember? There were 17 people, 17. They had what they called the Children's stage and the real stage. And every single debate, I was dead center, right? And it used to bother me when we had an even number. I tell CNN and I would tell FOX. I'd say listen, I want to have odd numbers and they never knew what I was talking about because when you have an odd number you're in the center. When you have an even number you got two guys in the center, that's no good. So -- but I was in the center for every debate. Every single poll, the online polls after the debates. Every single poll of every single debate they say I won. I didn't know. I never did this yet. Ted Cruz who was like a professional debater. You had all these people. I look so forward to debating crooked Hillary. Oh, well, I look forward. You know Bernie wanted to debate me. I don't know if he did or not he didn't -- he wasn't trying too hard I'll tell you. Believe me, behind the scenes he wasn't trying hard. To the media he was, oh, I to debate him. Behind the scenes, I'm not sure he wanted it. But Bernie in all fairness, I said put up money to the networks. Put up money for women's health issues in this case and they're very cheap. You know they want to make a lot of money but they're not so, they're not so fast with giving it away. But I would have liked it but then I said, and somebody told me this so look, the system is rigged. The guy is working hard but his system is rigged. He can't win. You shouldn't be debating the guy that comes in number two. Does that make sense? Yeah? And the networks weren't coming through but it would be a good spectacle. We knock off Bernie and then we knock off Hillary, I don't know. The problem is he can't win. The system's all rigged up. It's all rigged up for Hillary. So let's see what happens. But I look so forward to debate -- whoever the hell I have to debate. I don't care but I look so forward to those debates. So here's what we're going to do. We have a country that doesn't win anymore, right? We know that. We have a -- when was the last time. Seriously, think about it. When was the last time we had a victory in this country? We don't have victories anymore. Did you see our GDP? It's like almost zero. If that happened in China they'd have a revolution. It's -- you know they get down to 7%, 8%, and they start devaluing their currency again which kills us because they take our jobs and they kill our companies when they do that. And they're not supposed to do that and they're not supposed to be building fortresses in the South China Sea. They have no respect for our country. They have no respect for our President. They think he's a total lightweight and now he's going to be campaigning. And you know what? He shouldn't campaign. He should go out and do the job that he's supposed to be doing not campaigning. So we don't win anymore. We don't win with jobs. We don't win with the economy. We don't win it all. But let me tell you, folks and I mean this so sincerely, we are going to win like we've never won before. I'm telling you. I'm telling you. We're going to bring our jobs back. We're not going to let Carrier go so easily to Mexico. We're not going to let Ford build its plants in Mexico and other places. We're going to say, folks, you're not going to close plants in Michigan. I think I'm going to win Michigan. You know Michigan's another one. They're saying that a Democrat will win Michigan except for a problem. They just looked at a poll, Trump is winning in Michigan. Because, because for two years I've been talking about how Michigan has been abused. That's why I won in Indiana. I won Indiana because for years, for years, I've been talking about what is happening with Indiana and certain companies. And then all of a sudden Carrier says they're leaving and they fire all those people, and those people used to attend my speeches like crazy. So here's the story. We don't win anymore, we're going to start winning. We're going to win with our military. We're going to knock the hell out of ISIS remember that. We have no choice. We have no choice. We're going to win in our borders. We're going to build the wall. It's going to be a great wall. Someday maybe they'll call it Trump. So I have to make it big and beautiful. I don't want a wall named after me but we are going to build a great wall. We are going to let our incredible border agents who endorsed me, Sheriff Joe Arpaio endorsed me too of Arizona. These are the people that know what they're doing. So we are going to build a wall and we're going to keep the drugs out of here, poisoning our youth, poisoning everybody. We're going to keep them out. And by the way, we're going to have the wall but people are going to come pouring into our country but they're going to come in legally. We want them to come in. They're going to come in legally. We're going to have great healthcare. We're going to repeal and replace Obamacare. We're going to have alternatives that are so much better and so much less. We're going to get rid of Common Core. We're going to have local education. Right? We are going to save our Second Amendment from assault from Hillary Clinton and all of these people that don't know what they're doing. You look at what's going on and you study what they're doing with your Second Amendment. Believe me, we are going to save it. We are going to appoint great Supreme Court Justices, one of the most important thing. Because you know if they put in -- if somebody else gets in, you are maybe never going to see our country be great again. You're going to see such a difference. You're going to see such a difference and we're going to make trade deals the likes of which our country has never made. We're going to bring our jobs back. We're going to bring wealth back to our country. We don't have wealth right now. We are poverty. We are like a third world nation. You look at our airports, you look at our roads, our bridges, our tunnels, we're like a third world nation. You go over to the Middle East, you go over to China, you go over to Japan. You look at what they have and compared to what we have, not going to happen anymore folks. So here's the story. You elect me President and remember June 7th go out and vote. But most importantly, November, you got to go. But get out there on June 7th. That's our starter. That's our warm-up. We are going to start winning again. We are going to win it every element that we have. We're going to win with our military. We're going to win on trade. We're going to win with healthcare. We're going to win with education. We're going to win with every single element. We're going to win at the border. We're going to win with the wall and Mexico will pay for that wall. We're going to win at every single -- and my friends from Sacramento and I, I have a lot of them and there are a lot of them in the audience. I hate to call but they're going to represent you well and they're going to come and see me representing you. And they're going to say, Mr. President, we have to talk. What? We're winning too much. We can't take it anymore. The people of Sacramento cannot take all of these victories, Mr. President. We don't want you to win so much. It's not fair to the rest of the world. Don't win Mr. President. I'm going to say, I'm sorry, folks. We're going to win, win, win. We're going to make our country great again. We're going to make our country great again, greater than ever before. Ladies and gentlemen, America first, America first. Thank you very much. I love you Sacramento. Thank you. Thank you. Thank you."}