{"id":388,"author":"Donald Trump","title":"Speech: Donald Trump in Williston, ND","date":"2016-05-26","link":"https://factba.se/transcript/donald-trump-speech-williston-nd-may-26-2016","paragraphs":["A lot of people. Boy, oh boy. Thank you very much. Thank you very much. So you know, this is really going to be a speech on energy. But I have to start off because we love our farmers and we love -- right? Do we love our farmers? And we love agriculture. So for the farmers out here, you do an awfully good job and I've heard that for many years in North Dakota.","So, hello. Now you can fall asleep while we talk about energy, OK? You know, the farmers are great. The miners are great. The miners have been so badly treated and we're gonna treat them really well. You're gonna see. You're gonna see. So before we start, I really want to thank Harold Hamm. He's been a friend of mine for a long time.","He's an amazing man in the world of business. Yeah, sit down. He's been an amazing success story, an amazing guy and I've learned a lot about energy from Harold. So Harold -- and I've never seen you so happy. When he got up here, he became like -- I'm glad I didn't have to run against you, Harold. And the congressman, right from the beginning, he was with us. One of the few.","He was with us. And the governor is in the audience. Where is the governor? Governor, thank you very much, and your lovely wife. Thank you, Governor. Thank you very much, and your entire staff. I appreciate you being here. I also want to thank the delegates because I was coming out of my building this morning, and there was a big newsflash that Donald Trump had won the nomination.","And I said, what happened? I thought I had to wait a couple of more weeks. And they said, no. The delegates from your state, right here, you, North Dakota. Where are you? Where are you? Where are my delegates? Stand up please. So, I guess, you would call them unbound but now they're bound. So North Dakota brought us -- you brought us over the line folks and I will always remember that.","I will always remember that. And to my unbound, who are now bound, I think you're bound. You promise you bound everybody? Yes they probably. So thank you very much. This is a great honor and this was a little bit sooner. We were supposed to be watching Hillary Clinton. And guess what? We're watching Hillary Clinton.","That's the way it worked. Crooked Hillary. But -- Crooked Hillary. And that report yesterday. That was a report. All right let's talk about energy, OK? I'm delighted to be in North Dakota, a state where really you're at the forefront of a new energy revolution. Oil and natural gas production is up significantly in the last decade.","Our oil imports have literally, frankly, been cut in half. That's something that nobody thought was going to be happening really for a very, very long time. But all of this occurred in spite of a massive new bureaucratic and political barriers. President Obama has done everything he can to get in the way of American energy for whatever reason.","He's made life much more difficult for North Dakota as costly regulation and I mean serious regulation makes it harder and harder to turn a profit. If Crooked Hillary Clinton is in charge things will get much worse. Believe me. You've seen it. All you have to do is follow her career. She will shut down energy production across this country.","And by the way, she'll also unrelated abolish the Second Amendment and we're not gonna let that happen. That I can tell you. That I can tell. And I appreciate -- Last week, I got the endorsement of the NRA and these are great people, and I appreciate that endorsement very much. Millions of jobs and trillions of dollars of wealth will be destroyed as a result.","That's why this choice and this is a very important choice, November going to be so, so crucial. And here's what it comes down to. Wealth, serious wealth for people, for workers, for everybody versus poverty. North Dakota shows how energy exploration creates shared prosperity, better schools, more funding for infrastructure, which we really need throughout our country.","Higher wages, lower unemployment. Things we've been missing for a long time. It's a choice between sharing in this great energy wealth or sharing in the poverty promised by Hillary Clinton. You don't have to take my word for it. Just listen to Hillary in her own words. She's declared war on the American worker.","Here's what Hillary Clinton said earlier this year. We are going to put a lot of coal miners and coal companies out of work. By the way, her timing wasn't so good. The following week, she went to West Virginia. She didn't do too well there. But I love the people of West Virginia. We did and I love the people of Pennsylvania.","They don't like her too much. I can tell you. And if Hillary can shut down the mines, she can really shut down our whole country and your business will be permanently, in many cases, permanently ruined. So let me tell you how President Obama undermined our crisis and our middle class. The President stated that it was his intent to eliminate oil and natural gas production in America, if you can believe this.","His policy is death by a thousand cuts through an onslaught of regulations. For instance, the Environmental Protection Agency's use of totalitarian taxes forces energy operators in North Dakota into paying unprecedented multi-billion dollar fines before a penalty is even confirmed, which is actually rather hard to believe.","Government misconduct goes on and on. The Department of Justice filed a lawsuit against seven North Dakota oil companies for the death of 28 birds. While the administration fast tracked wind projects that kill more than a million birds a year, far more than a million birds. I have to tell you, far more. The U.S. Fish and Wildlife Service abuses Endangered Species Act to restrict oil and gas exploration.","Adding to the pain, President Obama now proposes a $10 per barrel tax on American produced oil in the middle of a downturn, and you've had a downturn. But we did hit $50 today. I will take credit for that. Harold, I want 10%. I want 10%, Harold, at least 10%. At the same time -- I love you too. Thank you.","At the same time, President Obama lifts economic sanctions on Iran. He imposes economic sanctions on America. He's allowed this country to hit the lowest oil rig count since 1999, producing thousands of layoffs, thousands. America's incredible energy potential remains untapped. It's totally self-inflicted.","It's a wound and it's a wound that we have to heal. Under my presidency, we'll accomplish a complete American energy independence. Complete. Complete. And lots of jobs, lots of jobs. Imagine a world in which our foes and the oil cartels can no longer use energy as a weapon. Wouldn't that be nice? Be very nice.","It's gonna happen if we win. Oh, we're gonna win. We are gonna win. But President Obama has done everything he can to keep us dependent, and this is so important, on others. He wants us to be dependent on others. It's different thinking. It's from a whole different school. Let me list some of the good energy projects that he's killed.","He rejected the Keystone Excel pipeline despite the fact that it would have created 42,000 jobs. His own State Department concluded that it would be the safest pipeline ever built in the United States, and it would have no significant impact on the environment. Yet, even as he rejected this, and this is really something because we have that great relationship with Canada.","So he rejected the America Canada pipeline. He made a deal that allows Iran, boy, does he make bad deals with Iran, to transport more oil through his pipeline than would have ever flowed through Keystone, with no environmental review whatsoever. What are we doing? President Obama has done everything he can to kill the coal industry.","That we all know. You just ask the people of Pennsylvania, ask the people of West Virginia. Look at what's happened there. It's horrible. Here are a few of President Obama's decrees, regulations that shut down hundreds of coal-fired power plants and blocked the construction of new ones. How stupid is that?","A prohibition against coal production on federal land. Draconian climate rules that unless stopped would effectively bypass Congress to impose job killing cap and trade, a disaster. President Obama has aggressively blocked oil production of oil and natural -- you just take a look. Every single move he's make is to block the production of oil and natural gas.","He's taken huge percentages of the Alaska petroleum. And you take the reserve, he's taken it off the table. He's taken it completely off the table. Oil and natural gas production on federal lands is down 10%, which is pretty hard to believe. 87% of available land in the outer continental shelf has been put off limits, totally.","Atlantic lease sales were closed down too despite the fact that they would create, listen to this, 280,000 jobs and $23.5 billion in economic activity. President Obama entered the United States into the Paris climate accords unilaterally and without the permission of Congress. This agreement gives foreign bureaucrats control over how much our energy and how much we use right here in America.","So foreign bureaucrats are gonna be controlling what we're using and what we are doing on our land, in our country. No way. No way. These actions have denied millions of Americans access to the energy wealth sitting right under our feet. Wealth we didn't even know we had five years ago and ten years ago.","This is your treasure and you, the American people are entitled to share in the riches. President Obama's anti-energy and this is really anti-energy orders have also weakened our security by keeping us reliant on foreign sources of energy. Not gonna be for long, folks. Not gonna be for long if I get it. Every dollar of energy we don't explore here is a dollar of energy that makes someone else rich and really rich, in some cases.","I wonder if they are campaign contributors. What do you think? You think? They probably gave to the Clinton Foundation. I guess, right? Just seems, just seems like that's what happened. If president -- thank you, darling. I love you too. If President Obama wanted to weaken America, he couldn't have done a better job.","As bad as President Obama is, Hillary Clinton will be worse. She'll escalate the war against the American worker like never before and against American energy, and she'll unleash the EPA to control every aspect of our lives and every aspect of energy. They'll make it impossible for the worker, for the owners.","They'll make it impossible for everyone. She declared that we've got to move away from coal and all of the other fossil fuels. That's a quote. We've got to move away from coal quote and all of the other fossil fuels, locking away trillions in American wealth. In March, Hillary Clinton said, by the time we get through all of my conditions, I guarantee I do not think there will be many places in America where fracking will continue to take place.","What are we doing? Why are we even thinking? What are we doing? Let's just vote around. I don't know if she's gonna get to run anyway. What I'm saying, you know? I sort of like to run against here but. Can you imagine that? She wants to close down a primary source. Keep in mind, shale energy production could add 2 million jobs in seven years.","Yet, while Hillary Clinton doesn't want American energy, she is strongly in favor of foreign energy. Here's what she told China as Secretary of State. American exports and Chinese experts will work to develop China's natural gas resources. Working with China, what about working with us? Everyone is working with China.","They don't work with us. We're gonna work with us and we'll worry about China later, folks, OK? It's unbelievable. Imagine what it would mean for China if China unleashed its own natural gas resources so you're not dependent on foreign oil. Hillary Clinton has her priorities totally wrong. But we are gonna turn everything around.","We are going to make it right. Believe me. We're going to make it right. And quickly, very quickly. A Trump administration will develop an American first energy plant. America first, folks, America first. Make America great again. America First. Make America great again. First, energy plan. And I tell you here is how we're gonna do it and here is how this plan will make America wealthy again.","American energy dominance will be declared a strategic economic and foreign policy goal of the United States. It's about time. America has 1.5 times as much oil as the combined proven resource, listen to this, as the combined proven resources of all OPEC countries. Think of that. We have more natural gas than Russia, Iran, Qatar, Saudi Arabia combined.","We have three times more coal than Russia. Our total untapped oil and gas reserves on federal lands equal an estimated $50 trillion. Think of that. We're loaded. We didn't even know it. We're loaded. We had no idea how rich we were. We're richer than all of them. We're richer than all of them, folks. And we want to cherish that wealth, by the way, and preserve that wealth and take care of that wealth.","We will become and stay totally independent of any need to import energy from the OPEC cartel or any nations hostile to our interests. Anybody hostile to our interests, believe me, we don't deal with them. We'll handle them just fine. Just fine. And by the way, there are plenty of them out there that are hostile to our interests.","At the same time, we'll work with our Gulf allies to develop a positive energy relationship as part of our anti-terrorism strategy. We'll work with them because we have to knock out terrorism. And by the way, we have to knock the hell out of ISIS. We're gonna knock the hell out of ISIS. We'll use the -- Boy, that does -- I tell you what, people feel so strongly about that when you see what's happening to our country.","When you have General Patton and general -- all of our great generals and they're just right now spinning because they can't believe what's going on. They can't believe. That's gonna turn around so fast folks. Your heads will spin. We will use the revenues from energy production to rebuild our roads. It's about time.","Our schools bridges and public infrastructure. Our infrastructure is crumbling. Our infrastructure is a disaster. We have to rebuild our country. We have to rebuild our country and we have to rebuild it properly and fast. We've spent almost $5 trillion in the Middle East and we've gotten nothing for it. We're in worse shape than we were 15 years ago.","We've got to rebuild our country. Cheaper energy will also boost American agriculture. We'll get the bureaucracy out of the way of innovation so that we can pursue all forms of energy. This includes renewable energies and the technologies of the future. It does include nuclear and wind and solar. But not to the exclusion of other forms of energy and other forms of energy that right now are working much better.","The government should not pick winners and losers. Instead, it should remove obstacles to exploration. Any market has its ups and downs, but lifting these draconian barriers will ensure that we are no longer at the mercy of global markets. We never want to be there again. A Trump administration will focus on real environmental challenges, not the phony ones that we've been looking at. We'll reject Clinton's poverty expansion agenda that enriches our friends.","I mean, totally enriches our friends. Just take a look at who her friends are and makes everyone else very, very poor. We'll solve real environmental problems in our communities like the need for clean and safe drinking water. And you look at some of our communities and they don't have clean and safe drinking water at all.","President Obama actually tried to cut the funding for our drinking water infrastructure even as he pushed to increase funding for his EPA bureaucrats. American workers will be the ones building this new infrastructure, not people from other countries. They're not gonna be building our infrastructure. Not even a little bit.","Here is my 100-day action plan. We're going to rescind all the job-destroying Obama executive actions, including the Climate Action Plan and the waters of the United States rule, OK? Remember that. We're going to save the coal industry. We're gonna save that coal industry. Believe me. We're gonna save it. I love those people.","These are great people and they love that -- they love that job. In West Virginia, I have to say, I said to some of the miners because they voted so overwhelmingly and they endorsed me by so much. I said, would you ever think of leaving and going someplace else and doing something else? They said, Mr. Trump, we love coal.","This is what we do. This is what we want to do. They love it and we're gonna bring it back and we're gonna help those people because that's what they want to do. And it's unfair what's happened to them remember that. Very unfair. So we're going to save the coal industry and other industries threatened by Clinton's extremist agenda and it is indeed an extremist agenda, perhaps even worse than Obama.","I'm going to ask Trans Canada to renew its permit application for the Keystone pipeline. And by the way, I might also be asking for a big piece of the profits from that so that the American people can get some more money out of it. Does that make sense? Why not? Why not? We're making it possible. Let's take a piece of the action for you, folks.","You know, lower your taxes a little bit more. It wouldn't be so bad. Without us, I can't do it. So it sounds like it makes a lot of sense to me. We're going to lift moratoriums on energy production in federal areas. We're going to revoke policies that impose unwarranted restrictions on new drilling technologies.","These technologies create millions of jobs with a smaller footprint than ever before. We're going to cancel the Paris climate agreement and stop. Unbelievable. And stop all payments of the United States tax dollars to U.N. global warming programs. We've got big problems, folks. We can't be sending our money all over the world.","It's not 40 years ago. It's not 20 years ago. We've got a lot of problems. We're gonna cherish our dollar. We're gonna take care of our dollar and we're gonna keep our money and we're gonna keep our jobs here. And we're going to bring jobs back. OK? Remember that. Any regulation that's outdated, unnecessary, bad for workers or contrary to the national interest will be scrapped and scrapped completely.","We will also eliminate duplication, provide regulatory certainty, which is very important, and trust local officials and local residents, like yourselves. Any future regulation will go through a simple test. Is this regulation good for the American worker? If it doesn't pass this test, this rule will not be, under any circumstances, approved.","Policy decisions will be public and very, very transparent. They won't be made on Hillary's private e-mail account, which is turning out to be a total disaster. By the way, a disaster for our country beyond Hillary. A disaster for our country that you do such a thing. We're going to do all of this while taking proper regard for rational environmental concerns.","We're going to conserve our beautiful natural habitats, reserve and so important. We're gonna take care of those habitats. We're gonna take care of our reserves and we're gonna take such great care of our resources. Our resource is so vital. We're gonna take care of those resources. In a Trump administration, political activists with extreme agendas will no longer write the rules because that's what's happening now.","Instead, we will work with conservationists whose only agenda is protecting nature. That's fine. From an environmental standpoint, my priorities are very simple: Clean air and clean water. Right? My America first energy plan will do for American people what Hillary Clinton will never do. She will never be able to do this, and I'm not just talking about this industry.","She will never create real jobs and real wage growth. She can't do it. She doesn't know how to do it. Her husband signed NAFTA, one of the worst jobs, one of the worst things ever signed in the history of our country for economic development. They don't know how to do it and I think actually, they don't even want to do it. According to the Institute for Energy Research, lifting the restrictions on American energy will create a flood of new jobs.","Almost a $700 billion increase. Think of that. A $700 billion increase in economic output over the next 30 years, more than a $30 billion increase in annual wages over the next seven years. Some of the people that are my biggest supporters, they haven't had a real wage increase in 18 years, OK? 18 years.","Think of it. And they work two jobs. They're working harder. They're getting older, they're working harder. It's supposed to be the other way around. It's not gonna be that way anymore, folks. Over the next four decades, more than $20 trillion in additional economic activity and $6 trillion in new tax revenue going to be generated.","The oil and natural gas industry supports 10 million high-paying American jobs and create another 400,000 new jobs per year. This exploration will also create a resurgence in American manufacturing, manufacturing. It's so good to hear them because I've been going around, folks, I've been going around and we won New York and we won all these states.","No matter where you go, manufacturing down 50%, down 55%. I go down, I see Syracuse, New York, I see Rome, New York. That's the Rome, by the way, Rome, New York. I see all of these different places. You're at the Bethpage, you go out to -- then you go to Pennsylvania, you go to all of these different places and you see what was once vibrant beautiful working places, factories, they're all falling apart.","We lost 45%, 55%, 60% of our manufacturing jobs all over the place. It's one of the reasons I won by such large margins because we're not gonna take it anymore. We're not gonna take it anymore. They're moving. They're leaving. They're taking our jobs. They're taking our companies. We're not gonna let that happen anymore.","We're dramatically reducing both our trade deficit and our budget deficit. Compare this future to Hillary Clinton's Venezuela-style politics of poverty, and that's what it is. That's what it's gonna end up being. That's where we're going. That's the direction we're heading. If you think about it, not one idea of Clinton has and actually can create a single net job or create a single new dollar to put in workers' pockets.","In fact, every idea Hillary has will make jobs disappear. She doesn't have a clue. Remember, it was NAFTA, which was signed by her husband, that destroyed this big parts of this country. So Hillary Clinton's agenda is job destruction. My agenda is job creation. We're gonna create so many jobs. And if companies want to leave our country and fire all their workers and go to another country, there will be a problem for those companies.","There will be consequences. There will be consequences. And when they hear about the consequences, you know, what they're gonna do? They're gonna say, Mr. President, we have decided not to move. OK? That's what's gonna happen. It's as simple as that. Clinton wants to tax and regulate our workers to the point of extinction.","True. She wants terrible trade deals and she wants to continue terrible trade deals, like NAFTA, signed by her husband, that will empty our manufacturing businesses even more so than they already are. During her time as Secretary of State, which was a disaster, she surrendered to China, allowing them to steal hundreds of billions of dollars in our intellectual property.","Everybody knows this. We do nothing about it. She let them devalue their currency and they had more than a trillion dollars to our trade deficit. Then there was Libya. Secretary Clinton's reckless Libya invasion handed the country over to ISIS, which now controls the oil in Libya. Very, very pure sweet beautiful oil.","Among the best in the world, ISIS has the oil from Libya. How do you like that, folks? Not so smart, right? The Middle East that Clinton inherited was far less dangerous than the Middle East she left with us today. Her reckless decisions in Iraq, Libya, Iran, Egypt and Syria have made the Middle East more unstable than ever, ever, ever before.","The Hillary Clinton foreign policy legacy is absolute total chaos. Clinton also wants totally open borders in America. Which would further plunge our workers into poverty. Hillary's open borders agenda means a young single mom living in poverty would have to compete for a job or a raise. Against millions of low-wage workers rushing into our country.","And we will have absolutely no idea who they are, where they come from, are they dangerous, are they good, are they bad. We know nothing about these people. My agenda will be accomplished through a series of reforms that put always America first. Energy reform -- thank you. Thank you. Energy reform that creates trillions of new dollars in wealth.","Immigration reform that produces and protects our borders. We are going to have such strong borders and by the way, we want people to come into our country but they're gonna come into our country legally, legally, legally. And we are going to defend our workers. We are going to defend our workers. Tax reform that brings millions of new jobs to America.","Regulation reform that eliminates stupid rules that send our jobs overseas. Really created by people that don't even have a clue. And if they do have a clue then they're doing some very, very bad things to our country. Welfare reform that requires employees to recruit from the unemployment office, not the immigration office.","We want to create jobs for our people. Very importantly, trade reform that brings back our manufacturing jobs and stands up to countries that cheat and I mean cheat, cheat like dogs. They cheat. They're cheating us so badly and it's a disgrace and we have people that don't know what's going on in Washington.","We have people that truly do not know what's going on. There's one more thing we must do to make America wealthy again. You have to be wealthy in order to be great. I'm sorry to say it. Build the wall. We'll build the wall. We'll build the wall. Believe me. We're gonna build the wall. I was going to leave that one out for the energy speech.","But you know what, it never fails. We will build the wall. Who is gonna pay for the wall? Mexico. 100%, by the way. 100%. I was just testing you. I wanted to see whether or not you were on your toes. OK. We have to make our communities safe again. Violent crime is rising in our major cities across the country.","This is totally unacceptable. Every parent has the right to raise their kids in safety. When we put political correctness before justice, we hurt those who have the least. I mean, that's what's happening. We're really hurting the people that have the least. It undermines their schools, slashes the value of their homes and drives away their jobs.","Crime is a stealth tax. It's a stealth tax on the poor. It's a horrible thing, and it's going up, up, up. Look at the papers today. Look at the statistics. Look at what's happening with homicides in our country. It's going only in one direction. To those living in fear, I say, help is coming. It's coming soon.","A Trump Administration will return law and order to America. Security is not something that should only -- and this is so important. That should only be enjoyed by the very rich and the very powerful. It has to be enjoyed by all. By way of contrast, I was endorsed and I told you this by National Rifle and I see what's happening and I understand what's happening and I know it so well.","These are people that want good things to happen. So Hillary get rid of the guns. Trump, we're gonna endorse and we're gonna preserve and we are gonna cherish, cherish, cherish our Second Amendment, OK? My reform agenda is going to bring wealth and security to the poorest communities in this country. We have to do that.","We have to do that. Do you know African-American youth has a 59% rate of unemployment? We have to do it. What does Hillary have to offer the poor, but more of the same. In Chicago, for instance, 1/4 of young Hispanics and 1/3 of young African-Americans are literally hopelessly unemployed. Hopelessly unemployed.","My message today is to all the people trapped in poverty and it's this, politicians, like Hillary Clinton, have failed you and they failed you badly. It's all talk. It's no action. They have failed. They've used you, they've stolen your votes for decades and they've given you nothing. I will give you everything.","I will give you what you've been looking for 30, 40, 50 years. They have given you nothing. And you need something new. I'm the only one who is going to deliver it. I know the politicians. I know what's happening. I know these people. I am the only one who will deliver. We are going to put America back to work.","We're going to put people before government. Very important. We're going to rebuild our inner cities. We're going to make you and your family safe, secure and prosperous. The choice in November is a choice between a Clinton agenda that puts donors first or an agenda that puts America first, my agenda. America first always.","It's a choice between a Clinton government of, by and for the powerful and a return to government of, by and for the people. Thank you. Thank you. Thank you. It is a choice between certain decline, absolutely certain decline or a revival of America's great promise. The people in charge of our government say things can't change.","They just feel that. Things can't change. I've seen it for so many months now. I've been doing this for 10 months. Am I doing a good job, by the way, for you? I'm very proud of this. I spent about $55 million of my own money. But look at this, I spent less than anybody else. And I have the best -- I won, right?","It's one of those things. So I spent less. I beat him by a lot. Isn't that what you want for your president for at least a little while? Thank you. They want you to keep trusting the same people who betrayed you many times before. I'm here to tell you that if you keep supporting those who've let you down, then you will keep getting let down for the rest of your lives.","I'm prepared to kick the special interests out of Washington D.C., and to hand their seat of power over to you. I will do that too. I actually look forward to doing that and it's about time. Together, we will put the American people first again. It's been a long time. We will make our communities wealthy again.","We will make our cities safe again. We will make our country strong again. Ladies and gentlemen, we will make America great again. Thank you."],"text":" A lot of people. Boy, oh boy. Thank you very much. Thank you very much. So you know, this is really going to be a speech on energy. But I have to start off because we love our farmers and we love -- right? Do we love our farmers? And we love agriculture. So for the farmers out here, you do an awfully good job and I've heard that for many years in North Dakota. So, hello. Now you can fall asleep while we talk about energy, OK? You know, the farmers are great. The miners are great. The miners have been so badly treated and we're gonna treat them really well. You're gonna see. You're gonna see. So before we start, I really want to thank Harold Hamm. He's been a friend of mine for a long time. He's an amazing man in the world of business. Yeah, sit down. He's been an amazing success story, an amazing guy and I've learned a lot about energy from Harold. So Harold -- and I've never seen you so happy. When he got up here, he became like -- I'm glad I didn't have to run against you, Harold. And the congressman, right from the beginning, he was with us. One of the few. He was with us. And the governor is in the audience. Where is the governor? Governor, thank you very much, and your lovely wife. Thank you, Governor. Thank you very much, and your entire staff. I appreciate you being here. I also want to thank the delegates because I was coming out of my building this morning, and there was a big newsflash that Donald Trump had won the nomination. And I said, what happened? I thought I had to wait a couple of more weeks. And they said, no. The delegates from your state, right here, you, North Dakota. Where are you? Where are you? Where are my delegates? Stand up please. So, I guess, you would call them unbound but now they're bound. So North Dakota brought us -- you brought us over the line folks and I will always remember that. I will always remember that. And to my unbound, who are now bound, I think you're bound. You promise you bound everybody? Yes they probably. So thank you very much. This is a great honor and this was a little bit sooner. We were supposed to be watching Hillary Clinton. And guess what? We're watching Hillary Clinton. That's the way it worked. Crooked Hillary. But -- Crooked Hillary. And that report yesterday. That was a report. All right let's talk about energy, OK? I'm delighted to be in North Dakota, a state where really you're at the forefront of a new energy revolution. Oil and natural gas production is up significantly in the last decade. Our oil imports have literally, frankly, been cut in half. That's something that nobody thought was going to be happening really for a very, very long time. But all of this occurred in spite of a massive new bureaucratic and political barriers. President Obama has done everything he can to get in the way of American energy for whatever reason. He's made life much more difficult for North Dakota as costly regulation and I mean serious regulation makes it harder and harder to turn a profit. If Crooked Hillary Clinton is in charge things will get much worse. Believe me. You've seen it. All you have to do is follow her career. She will shut down energy production across this country. And by the way, she'll also unrelated abolish the Second Amendment and we're not gonna let that happen. That I can tell you. That I can tell. And I appreciate -- Last week, I got the endorsement of the NRA and these are great people, and I appreciate that endorsement very much. Millions of jobs and trillions of dollars of wealth will be destroyed as a result. That's why this choice and this is a very important choice, November going to be so, so crucial. And here's what it comes down to. Wealth, serious wealth for people, for workers, for everybody versus poverty. North Dakota shows how energy exploration creates shared prosperity, better schools, more funding for infrastructure, which we really need throughout our country. Higher wages, lower unemployment. Things we've been missing for a long time. It's a choice between sharing in this great energy wealth or sharing in the poverty promised by Hillary Clinton. You don't have to take my word for it. Just listen to Hillary in her own words. She's declared war on the American worker. Here's what Hillary Clinton said earlier this year. We are going to put a lot of coal miners and coal companies out of work. By the way, her timing wasn't so good. The following week, she went to West Virginia. She didn't do too well there. But I love the people of West Virginia. We did and I love the people of Pennsylvania. They don't like her too much. I can tell you. And if Hillary can shut down the mines, she can really shut down our whole country and your business will be permanently, in many cases, permanently ruined. So let me tell you how President Obama undermined our crisis and our middle class. The President stated that it was his intent to eliminate oil and natural gas production in America, if you can believe this. His policy is death by a thousand cuts through an onslaught of regulations. For instance, the Environmental Protection Agency's use of totalitarian taxes forces energy operators in North Dakota into paying unprecedented multi-billion dollar fines before a penalty is even confirmed, which is actually rather hard to believe. Government misconduct goes on and on. The Department of Justice filed a lawsuit against seven North Dakota oil companies for the death of 28 birds. While the administration fast tracked wind projects that kill more than a million birds a year, far more than a million birds. I have to tell you, far more. The U.S. Fish and Wildlife Service abuses Endangered Species Act to restrict oil and gas exploration. Adding to the pain, President Obama now proposes a $10 per barrel tax on American produced oil in the middle of a downturn, and you've had a downturn. But we did hit $50 today. I will take credit for that. Harold, I want 10%. I want 10%, Harold, at least 10%. At the same time -- I love you too. Thank you. At the same time, President Obama lifts economic sanctions on Iran. He imposes economic sanctions on America. He's allowed this country to hit the lowest oil rig count since 1999, producing thousands of layoffs, thousands. America's incredible energy potential remains untapped. It's totally self-inflicted. It's a wound and it's a wound that we have to heal. Under my presidency, we'll accomplish a complete American energy independence. Complete. Complete. And lots of jobs, lots of jobs. Imagine a world in which our foes and the oil cartels can no longer use energy as a weapon. Wouldn't that be nice? Be very nice. It's gonna happen if we win. Oh, we're gonna win. We are gonna win. But President Obama has done everything he can to keep us dependent, and this is so important, on others. He wants us to be dependent on others. It's different thinking. It's from a whole different school. Let me list some of the good energy projects that he's killed. He rejected the Keystone Excel pipeline despite the fact that it would have created 42,000 jobs. His own State Department concluded that it would be the safest pipeline ever built in the United States, and it would have no significant impact on the environment. Yet, even as he rejected this, and this is really something because we have that great relationship with Canada. So he rejected the America Canada pipeline. He made a deal that allows Iran, boy, does he make bad deals with Iran, to transport more oil through his pipeline than would have ever flowed through Keystone, with no environmental review whatsoever. What are we doing? President Obama has done everything he can to kill the coal industry. That we all know. You just ask the people of Pennsylvania, ask the people of West Virginia. Look at what's happened there. It's horrible. Here are a few of President Obama's decrees, regulations that shut down hundreds of coal-fired power plants and blocked the construction of new ones. How stupid is that? A prohibition against coal production on federal land. Draconian climate rules that unless stopped would effectively bypass Congress to impose job killing cap and trade, a disaster. President Obama has aggressively blocked oil production of oil and natural -- you just take a look. Every single move he's make is to block the production of oil and natural gas. He's taken huge percentages of the Alaska petroleum. And you take the reserve, he's taken it off the table. He's taken it completely off the table. Oil and natural gas production on federal lands is down 10%, which is pretty hard to believe. 87% of available land in the outer continental shelf has been put off limits, totally. Atlantic lease sales were closed down too despite the fact that they would create, listen to this, 280,000 jobs and $23.5 billion in economic activity. President Obama entered the United States into the Paris climate accords unilaterally and without the permission of Congress. This agreement gives foreign bureaucrats control over how much our energy and how much we use right here in America. So foreign bureaucrats are gonna be controlling what we're using and what we are doing on our land, in our country. No way. No way. These actions have denied millions of Americans access to the energy wealth sitting right under our feet. Wealth we didn't even know we had five years ago and ten years ago. This is your treasure and you, the American people are entitled to share in the riches. President Obama's anti-energy and this is really anti-energy orders have also weakened our security by keeping us reliant on foreign sources of energy. Not gonna be for long, folks. Not gonna be for long if I get it. Every dollar of energy we don't explore here is a dollar of energy that makes someone else rich and really rich, in some cases. I wonder if they are campaign contributors. What do you think? You think? They probably gave to the Clinton Foundation. I guess, right? Just seems, just seems like that's what happened. If president -- thank you, darling. I love you too. If President Obama wanted to weaken America, he couldn't have done a better job. As bad as President Obama is, Hillary Clinton will be worse. She'll escalate the war against the American worker like never before and against American energy, and she'll unleash the EPA to control every aspect of our lives and every aspect of energy. They'll make it impossible for the worker, for the owners. They'll make it impossible for everyone. She declared that we've got to move away from coal and all of the other fossil fuels. That's a quote. We've got to move away from coal quote and all of the other fossil fuels, locking away trillions in American wealth. In March, Hillary Clinton said, by the time we get through all of my conditions, I guarantee I do not think there will be many places in America where fracking will continue to take place. What are we doing? Why are we even thinking? What are we doing? Let's just vote around. I don't know if she's gonna get to run anyway. What I'm saying, you know? I sort of like to run against here but. Can you imagine that? She wants to close down a primary source. Keep in mind, shale energy production could add 2 million jobs in seven years. Yet, while Hillary Clinton doesn't want American energy, she is strongly in favor of foreign energy. Here's what she told China as Secretary of State. American exports and Chinese experts will work to develop China's natural gas resources. Working with China, what about working with us? Everyone is working with China. They don't work with us. We're gonna work with us and we'll worry about China later, folks, OK? It's unbelievable. Imagine what it would mean for China if China unleashed its own natural gas resources so you're not dependent on foreign oil. Hillary Clinton has her priorities totally wrong. But we are gonna turn everything around. We are going to make it right. Believe me. We're going to make it right. And quickly, very quickly. A Trump administration will develop an American first energy plant. America first, folks, America first. Make America great again. America First. Make America great again. First, energy plan. And I tell you here is how we're gonna do it and here is how this plan will make America wealthy again. American energy dominance will be declared a strategic economic and foreign policy goal of the United States. It's about time. America has 1.5 times as much oil as the combined proven resource, listen to this, as the combined proven resources of all OPEC countries. Think of that. We have more natural gas than Russia, Iran, Qatar, Saudi Arabia combined. We have three times more coal than Russia. Our total untapped oil and gas reserves on federal lands equal an estimated $50 trillion. Think of that. We're loaded. We didn't even know it. We're loaded. We had no idea how rich we were. We're richer than all of them. We're richer than all of them, folks. And we want to cherish that wealth, by the way, and preserve that wealth and take care of that wealth. We will become and stay totally independent of any need to import energy from the OPEC cartel or any nations hostile to our interests. Anybody hostile to our interests, believe me, we don't deal with them. We'll handle them just fine. Just fine. And by the way, there are plenty of them out there that are hostile to our interests. At the same time, we'll work with our Gulf allies to develop a positive energy relationship as part of our anti-terrorism strategy. We'll work with them because we have to knock out terrorism. And by the way, we have to knock the hell out of ISIS. We're gonna knock the hell out of ISIS. We'll use the -- Boy, that does -- I tell you what, people feel so strongly about that when you see what's happening to our country. When you have General Patton and general -- all of our great generals and they're just right now spinning because they can't believe what's going on. They can't believe. That's gonna turn around so fast folks. Your heads will spin. We will use the revenues from energy production to rebuild our roads. It's about time. Our schools bridges and public infrastructure. Our infrastructure is crumbling. Our infrastructure is a disaster. We have to rebuild our country. We have to rebuild our country and we have to rebuild it properly and fast. We've spent almost $5 trillion in the Middle East and we've gotten nothing for it. We're in worse shape than we were 15 years ago. We've got to rebuild our country. Cheaper energy will also boost American agriculture. We'll get the bureaucracy out of the way of innovation so that we can pursue all forms of energy. This includes renewable energies and the technologies of the future. It does include nuclear and wind and solar. But not to the exclusion of other forms of energy and other forms of energy that right now are working much better. The government should not pick winners and losers. Instead, it should remove obstacles to exploration. Any market has its ups and downs, but lifting these draconian barriers will ensure that we are no longer at the mercy of global markets. We never want to be there again. A Trump administration will focus on real environmental challenges, not the phony ones that we've been looking at. We'll reject Clinton's poverty expansion agenda that enriches our friends. I mean, totally enriches our friends. Just take a look at who her friends are and makes everyone else very, very poor. We'll solve real environmental problems in our communities like the need for clean and safe drinking water. And you look at some of our communities and they don't have clean and safe drinking water at all. President Obama actually tried to cut the funding for our drinking water infrastructure even as he pushed to increase funding for his EPA bureaucrats. American workers will be the ones building this new infrastructure, not people from other countries. They're not gonna be building our infrastructure. Not even a little bit. Here is my 100-day action plan. We're going to rescind all the job-destroying Obama executive actions, including the Climate Action Plan and the waters of the United States rule, OK? Remember that. We're going to save the coal industry. We're gonna save that coal industry. Believe me. We're gonna save it. I love those people. These are great people and they love that -- they love that job. In West Virginia, I have to say, I said to some of the miners because they voted so overwhelmingly and they endorsed me by so much. I said, would you ever think of leaving and going someplace else and doing something else? They said, Mr. Trump, we love coal. This is what we do. This is what we want to do. They love it and we're gonna bring it back and we're gonna help those people because that's what they want to do. And it's unfair what's happened to them remember that. Very unfair. So we're going to save the coal industry and other industries threatened by Clinton's extremist agenda and it is indeed an extremist agenda, perhaps even worse than Obama. I'm going to ask Trans Canada to renew its permit application for the Keystone pipeline. And by the way, I might also be asking for a big piece of the profits from that so that the American people can get some more money out of it. Does that make sense? Why not? Why not? We're making it possible. Let's take a piece of the action for you, folks. You know, lower your taxes a little bit more. It wouldn't be so bad. Without us, I can't do it. So it sounds like it makes a lot of sense to me. We're going to lift moratoriums on energy production in federal areas. We're going to revoke policies that impose unwarranted restrictions on new drilling technologies. These technologies create millions of jobs with a smaller footprint than ever before. We're going to cancel the Paris climate agreement and stop. Unbelievable. And stop all payments of the United States tax dollars to U.N. global warming programs. We've got big problems, folks. We can't be sending our money all over the world. It's not 40 years ago. It's not 20 years ago. We've got a lot of problems. We're gonna cherish our dollar. We're gonna take care of our dollar and we're gonna keep our money and we're gonna keep our jobs here. And we're going to bring jobs back. OK? Remember that. Any regulation that's outdated, unnecessary, bad for workers or contrary to the national interest will be scrapped and scrapped completely. We will also eliminate duplication, provide regulatory certainty, which is very important, and trust local officials and local residents, like yourselves. Any future regulation will go through a simple test. Is this regulation good for the American worker? If it doesn't pass this test, this rule will not be, under any circumstances, approved. Policy decisions will be public and very, very transparent. They won't be made on Hillary's private e-mail account, which is turning out to be a total disaster. By the way, a disaster for our country beyond Hillary. A disaster for our country that you do such a thing. We're going to do all of this while taking proper regard for rational environmental concerns. We're going to conserve our beautiful natural habitats, reserve and so important. We're gonna take care of those habitats. We're gonna take care of our reserves and we're gonna take such great care of our resources. Our resource is so vital. We're gonna take care of those resources. In a Trump administration, political activists with extreme agendas will no longer write the rules because that's what's happening now. Instead, we will work with conservationists whose only agenda is protecting nature. That's fine. From an environmental standpoint, my priorities are very simple: Clean air and clean water. Right? My America first energy plan will do for American people what Hillary Clinton will never do. She will never be able to do this, and I'm not just talking about this industry. She will never create real jobs and real wage growth. She can't do it. She doesn't know how to do it. Her husband signed NAFTA, one of the worst jobs, one of the worst things ever signed in the history of our country for economic development. They don't know how to do it and I think actually, they don't even want to do it. According to the Institute for Energy Research, lifting the restrictions on American energy will create a flood of new jobs. Almost a $700 billion increase. Think of that. A $700 billion increase in economic output over the next 30 years, more than a $30 billion increase in annual wages over the next seven years. Some of the people that are my biggest supporters, they haven't had a real wage increase in 18 years, OK? 18 years. Think of it. And they work two jobs. They're working harder. They're getting older, they're working harder. It's supposed to be the other way around. It's not gonna be that way anymore, folks. Over the next four decades, more than $20 trillion in additional economic activity and $6 trillion in new tax revenue going to be generated. The oil and natural gas industry supports 10 million high-paying American jobs and create another 400,000 new jobs per year. This exploration will also create a resurgence in American manufacturing, manufacturing. It's so good to hear them because I've been going around, folks, I've been going around and we won New York and we won all these states. No matter where you go, manufacturing down 50%, down 55%. I go down, I see Syracuse, New York, I see Rome, New York. That's the Rome, by the way, Rome, New York. I see all of these different places. You're at the Bethpage, you go out to -- then you go to Pennsylvania, you go to all of these different places and you see what was once vibrant beautiful working places, factories, they're all falling apart. We lost 45%, 55%, 60% of our manufacturing jobs all over the place. It's one of the reasons I won by such large margins because we're not gonna take it anymore. We're not gonna take it anymore. They're moving. They're leaving. They're taking our jobs. They're taking our companies. We're not gonna let that happen anymore. We're dramatically reducing both our trade deficit and our budget deficit. Compare this future to Hillary Clinton's Venezuela-style politics of poverty, and that's what it is. That's what it's gonna end up being. That's where we're going. That's the direction we're heading. If you think about it, not one idea of Clinton has and actually can create a single net job or create a single new dollar to put in workers' pockets. In fact, every idea Hillary has will make jobs disappear. She doesn't have a clue. Remember, it was NAFTA, which was signed by her husband, that destroyed this big parts of this country. So Hillary Clinton's agenda is job destruction. My agenda is job creation. We're gonna create so many jobs. And if companies want to leave our country and fire all their workers and go to another country, there will be a problem for those companies. There will be consequences. There will be consequences. And when they hear about the consequences, you know, what they're gonna do? They're gonna say, Mr. President, we have decided not to move. OK? That's what's gonna happen. It's as simple as that. Clinton wants to tax and regulate our workers to the point of extinction. True. She wants terrible trade deals and she wants to continue terrible trade deals, like NAFTA, signed by her husband, that will empty our manufacturing businesses even more so than they already are. During her time as Secretary of State, which was a disaster, she surrendered to China, allowing them to steal hundreds of billions of dollars in our intellectual property. Everybody knows this. We do nothing about it. She let them devalue their currency and they had more than a trillion dollars to our trade deficit. Then there was Libya. Secretary Clinton's reckless Libya invasion handed the country over to ISIS, which now controls the oil in Libya. Very, very pure sweet beautiful oil. Among the best in the world, ISIS has the oil from Libya. How do you like that, folks? Not so smart, right? The Middle East that Clinton inherited was far less dangerous than the Middle East she left with us today. Her reckless decisions in Iraq, Libya, Iran, Egypt and Syria have made the Middle East more unstable than ever, ever, ever before. The Hillary Clinton foreign policy legacy is absolute total chaos. Clinton also wants totally open borders in America. Which would further plunge our workers into poverty. Hillary's open borders agenda means a young single mom living in poverty would have to compete for a job or a raise. Against millions of low-wage workers rushing into our country. And we will have absolutely no idea who they are, where they come from, are they dangerous, are they good, are they bad. We know nothing about these people. My agenda will be accomplished through a series of reforms that put always America first. Energy reform -- thank you. Thank you. Energy reform that creates trillions of new dollars in wealth. Immigration reform that produces and protects our borders. We are going to have such strong borders and by the way, we want people to come into our country but they're gonna come into our country legally, legally, legally. And we are going to defend our workers. We are going to defend our workers. Tax reform that brings millions of new jobs to America. Regulation reform that eliminates stupid rules that send our jobs overseas. Really created by people that don't even have a clue. And if they do have a clue then they're doing some very, very bad things to our country. Welfare reform that requires employees to recruit from the unemployment office, not the immigration office. We want to create jobs for our people. Very importantly, trade reform that brings back our manufacturing jobs and stands up to countries that cheat and I mean cheat, cheat like dogs. They cheat. They're cheating us so badly and it's a disgrace and we have people that don't know what's going on in Washington. We have people that truly do not know what's going on. There's one more thing we must do to make America wealthy again. You have to be wealthy in order to be great. I'm sorry to say it. Build the wall. We'll build the wall. We'll build the wall. Believe me. We're gonna build the wall. I was going to leave that one out for the energy speech. But you know what, it never fails. We will build the wall. Who is gonna pay for the wall? Mexico. 100%, by the way. 100%. I was just testing you. I wanted to see whether or not you were on your toes. OK. We have to make our communities safe again. Violent crime is rising in our major cities across the country. This is totally unacceptable. Every parent has the right to raise their kids in safety. When we put political correctness before justice, we hurt those who have the least. I mean, that's what's happening. We're really hurting the people that have the least. It undermines their schools, slashes the value of their homes and drives away their jobs. Crime is a stealth tax. It's a stealth tax on the poor. It's a horrible thing, and it's going up, up, up. Look at the papers today. Look at the statistics. Look at what's happening with homicides in our country. It's going only in one direction. To those living in fear, I say, help is coming. It's coming soon. A Trump Administration will return law and order to America. Security is not something that should only -- and this is so important. That should only be enjoyed by the very rich and the very powerful. It has to be enjoyed by all. By way of contrast, I was endorsed and I told you this by National Rifle and I see what's happening and I understand what's happening and I know it so well. These are people that want good things to happen. So Hillary get rid of the guns. Trump, we're gonna endorse and we're gonna preserve and we are gonna cherish, cherish, cherish our Second Amendment, OK? My reform agenda is going to bring wealth and security to the poorest communities in this country. We have to do that. We have to do that. Do you know African-American youth has a 59% rate of unemployment? We have to do it. What does Hillary have to offer the poor, but more of the same. In Chicago, for instance, 1/4 of young Hispanics and 1/3 of young African-Americans are literally hopelessly unemployed. Hopelessly unemployed. My message today is to all the people trapped in poverty and it's this, politicians, like Hillary Clinton, have failed you and they failed you badly. It's all talk. It's no action. They have failed. They've used you, they've stolen your votes for decades and they've given you nothing. I will give you everything. I will give you what you've been looking for 30, 40, 50 years. They have given you nothing. And you need something new. I'm the only one who is going to deliver it. I know the politicians. I know what's happening. I know these people. I am the only one who will deliver. We are going to put America back to work. We're going to put people before government. Very important. We're going to rebuild our inner cities. We're going to make you and your family safe, secure and prosperous. The choice in November is a choice between a Clinton agenda that puts donors first or an agenda that puts America first, my agenda. America first always. It's a choice between a Clinton government of, by and for the powerful and a return to government of, by and for the people. Thank you. Thank you. Thank you. It is a choice between certain decline, absolutely certain decline or a revival of America's great promise. The people in charge of our government say things can't change. They just feel that. Things can't change. I've seen it for so many months now. I've been doing this for 10 months. Am I doing a good job, by the way, for you? I'm very proud of this. I spent about $55 million of my own money. But look at this, I spent less than anybody else. And I have the best -- I won, right? It's one of those things. So I spent less. I beat him by a lot. Isn't that what you want for your president for at least a little while? Thank you. They want you to keep trusting the same people who betrayed you many times before. I'm here to tell you that if you keep supporting those who've let you down, then you will keep getting let down for the rest of your lives. I'm prepared to kick the special interests out of Washington D.C., and to hand their seat of power over to you. I will do that too. I actually look forward to doing that and it's about time. Together, we will put the American people first again. It's been a long time. We will make our communities wealthy again. We will make our cities safe again. We will make our country strong again. Ladies and gentlemen, we will make America great again. Thank you."}