{"id":390,"author":"Donald Trump","title":"Speech: Donald Trump Delivers a Campaign Speech in Lawrence Township, NJ","date":"2016-05-19","link":"https://factba.se/transcript/donald-trump-speech-lawrence-township-nj-may-19-2016","paragraphs":["Thank you very much. Boy. Thank you. So nice. Boy oh boy. So you know Chris paid off his entire campaign debt tonight. Right? His entire debt. And Chris, you can't even give them a table and a seat. That's terrible. But he's a great guy and he's a great Governor, and I will tell you -- thank you I love you too.","Look at these guys. Look at these guys. You know, I wanted to know a little bit because he's been my friend a long time, he's done a great job and all that. But I said let's be specific because we want to be specific. So I said give me some information and I -- boy do I look -- oh, do I look forward to debating Hillary.","Well that'd be fun. Oh I look forward to that. So I said let's be specific. So, you know, Governor Christie, your governor, balanced the budget six times without raising taxes. Not easy to do. Enacted a $2.3 billion dollar job creating tax cuts. I mean that's a lot of stuff. 2.3 billion. Not easy in New Jersey, that I can tell you.","He shrank the State Government by 6,500 jobs. Governor Christie, listen to this, bipartisan. There's no such thing as bipartisan anymore. It's a beautiful thing actually, Economic Opportunity Act will ultimately create 27,000 jobs, 22,000 in the construction industry. A lot of my friends are here tonight.","We're all in the construction industry. Governor Christie contributed more to the pension system than any other governor in New Jersey state history right. Governor Christie brought the insolvent -- and this was important, the insolvent New Jersey Unemployment Insurance Trust Fund back to solvency. And I will tell you, it was done in at least two years ahead of schedule.","So that's a pretty good track record and that's just a few of the things, all right? That's just a few. So we've had an interesting time. And you know it all started -- and Christie was out there and I was out there. And I have to say one of the more interesting parts was I was watching the debate because I had one debate that I really enjoyed -- because I was watching and I like Marco very much.","But Marco was over here, Chris was over here and I was standing there and I watched it happen. No, I watched it happen and it was -- I mean, he looked like Perry Mason that evening. That was a rough evening for Marco. And Marco will admit it. That was a rough rough evening. So, this began -- there's nothing like New Jersey.","There's nothing. There's nothing like New Jersey. Oh, wise guys, so many wise guys. I'll tell you what, you can make it in New Jersey, you can do just about anything you want in life. Great people. And by the way, on June 7th, will you do me a favor? Go out and vote please, OK? Just go out and vote. And boy are we going to go out in November, that I know.","But go out on June 6 -- June 7 folks. So -- On June 16th -- that's right. We're going to build that wall. We're going to build that wall. The wall is going to be built. We want the wall. You know, Hillary, you talk about Bernie Sanders. Bernie -- crooked Hillary.","I love this crowd, these are great. So -- my people. This is my people. But Bernie Sanders said that Hillary really isn't, essentially, not fit to be president. She's not qualified to be president. You know why? He said because she suffers from bad judgment. So today she made this statement -- you know she won't use the term radical Islamic terrorism.","You understand that. She won't use it. She refuses. You know why she won't? Because her President won't use it, that's why. And by the way, is she being nice to him? You know, she used to be -- she couldn't stand him and the husband couldn't stand him. Bill couldn't stand him and she couldn't stand him. I wonder why she's being so nice?","Can you figure it out? She's being so nice. Being so nice. She didn't like him one little bit. Now anything he said, my President said, my President said. But if you think about it and if you look at it, he said unqualified and he said that she suffers from bad judgment. And she does. So today we had a terrible tragedy and she came up and she said that Donald Trump talked about radical Islamic terrorism, which she doesn't want to use, she used a different term.","Because he doesn't want to use that term. She refuses to use that term and I'm saying to myself -- and it's a terrible thing and he, essentially, shouldn't be running for office. He doesn't have the right to run for office. And I'm saying to myself, what just happened about 12 hours ago? A plane got blown out of the sky.","And if anything, if anybody thinks it wasn't blown out of the sky, you're 100% wrong folks. OK? You're 100% wrong. And it's getting worse and you know, today, I was watching one of the networks and they had this great guy from the FBI on and he was talking about what happened with the plane. It was like, amazing, and I didn't know.","I never met him, I never saw him before on television. And he's going back and forth about how bad it is and how bad it's getting, and how we're losing control, and how we don't have a president that knows what he's doing. And then at the end he said, let me just tell you something -- Now, I don't know this man.","He said, the person that knows what's going on, the person that understands what's happening is a guy named Donald Trump. What -- it's true. It was a great. It was a great honor. Thank you. Thank you. No, that was a great honor. You know you're sitting home, you're watching television, you have this man -- who's a real expert.","He's an expert on exactly this and an expert on terrorism, and he says that. And that really, to me, is a great compliment. So on June 16th I came down that escalator, that beautiful escalator in Trump Tower. Trump Tower -- this is very nice but it doesn't remind me of this place. And it was a big day and I just said we have to do it. There's so many things that we can do to make America great again and we're never going to do them.","And if Hillary Clinton gets in, I don't know if our country can ever recover. You know yesterday I named a large number of judges, and I'll be adding to that number, who are really highly, highly respected judges. They come out of Heritage. They come out of -- different groups have recommended very, very strongly.","They've really recommended strongly. These are great judges. We'll be adding some additional ones, Chris. And it's outstanding. One of the most important things, always security first, right? Always security. But one of the most important things we'll be doing, whoever the next President is, is naming judges.","Now it's probably naming the justices of the United States Supreme Court because they're going to take us in a certain direction. It's either going to be down the tubes or it's going to be through -- through the roof. I'll tell you, through the roof. And the judges, the justices, and some of them are currently judges.","I guess almost all of are currently judges, but the justices of the United States Supreme Court, the next three -- it'll be three. It could be five by the way. Probably going to be three, most likely three, four and it could even be five. That is a massive number of justices who -- so whoever wins -- and it looks like it's going to be Hillary because it looks to me -- what's happening?","She's got totally embroiled in this. You talk about bad judgment. How bad a judgment is the email scandal? How bad? For what reason did she do that? Now, I know the reason. I know the reason, and it's always the same with her and it's always the same with them -- but I know -- she's liar.","No, I've used that one already. People like it. I can't use it. I'd like to use it again but I have to -- no, we'll go crooked Hillary, OK? But crooked may be more accurate actually. But she's probably going to get out because, I mean you know they keep letting her -- what she has done is so much worse than what anybody else running ever, ever has done.","What anybody else -- you look at all these people, General Petraeus, you look at these people, they've done a tiny fraction of what she's done and their lives have been destroyed, their lives have been ruined. What she has done -- what she has done, for her to be able to continue to run, is an absolute disgrace, in my opinion, to this country.","A disgrace. And on top of that, you know it's an amazing thing, every time I turn it on, I watch the race, Bernie Sanders wins. Bernie Sanders wins. He keeps winning and then they have the round table. Well, Hillary Clinton will win. I mean it's like -- it's a rigged -- it's a rigged deal. You notice the way I started talking, using the word rigged right, about four months ago.","Nobody used the word rigged, now everybody's calling it rigged. They copy my -- I want to go out, I want to have that phrase coined. But I use the word rigged four or five months ago. The Republican deal was rigged. 100%. Now, what did I do? You had to win by massive numbers. And boy did we get massive numbers we. We did well.","You know I had, by far, the most delegates. And I came into New York and everybody said, well New York and everything else, but the people in New York they love me, they know me. It's nice when the people -- and you know me as well as they know me. I mean, you know how many employees? Right now I have -- I am paying so many people, I have so many employees in New Jersey, I hate to think about it. I have to be honest, OK? I am taking care of more education and more salaries and more health care than anybody probably, Kristin, almost anybody in New Jersey, right?","But honestly I'm happy to do it. I'm happy we have great people. New Jersey, let me tell you, New Jersey is a great state. It's a state where we have truly, truly great people. Truly great people. So I came into New York and we didn't win by a little bit. We won in a massive landslide. We won everything.","And the nice part is, they know me the best. You know, supposing you go into a community and they know you and you don't do well, that's not a good sign. They know me so well, they have seen me for so many years. They're probably sick of me but they said I'm still voting for Trump. And what happened? So I got 62% and we just knocked them and it was great.","OK, now I go into Pennsylvania. Great place. Connecticut. We're going to do great in Pennsylvania. We have our chairman over here from Pennsylvania. She's here someplace. But we go into Pennsylvania, Connecticut, Maryland, Delaware and Rhode Island. We win every single subsection of every single state. We won every county of every state and we won every state by massive numbers.","And don't forget, I got 66 and 67%. Don't forget, I have three people running. When these guys on television, the most dishonest human beings, these people right here. Look at all the cameras. No, they're the worst. Donald Trump -- I watched -- I watched Krauthammer. We got like seven or eight people, nine people running, OK? Donald Trump did not get 50%. How do you get 50%? Sometimes I have -- you know we started off with 17 people.","And actually, after about two or three weeks, because I won New Hampshire, which was amazing. We're going to take care of those people in New Hampshire. They have a drug problem that you wouldn't believe. They have heroin pouring over the border. We're going to seal up that border, we're going to build a wall.","We're going to have real protection. Believe me. We're going to do it for everybody, but we're really doing it. The people of New Hampshire are -- I mean, it's incredible. It's incredible. What happened -- what happened is and what's happening here in New Jersey, the drugs are pouring across, illegal immigration, illegal immigrants are coming.","We are going to stop it. We're going to build that wall. It's going to be a real wall, and we're going to have people come into our country but they're going to come into our country legally, OK? Legally. So -- so I went through, the next week I win New York in a landslide. I win then I win the five states, and then I'm watching and I'm hearing that I got you know something a little bit less, and actually every one of them was off but I should have done better.","And I said, what? You have all these people. And then I go to Indiana, that was gonna be the firewall and I went there and we won Indiana so big and everybody just -- you know what they did? Chris knows. They gave up. They gave up. That was the end. And we had a little help. It was a man named Bobby Knight, OK? Bobby Knight.","Bobby. We love Bobby. And we had Lou Holtz and we had Digger and we had a lot of people. We had a great coach from Purdue. We had a lot of great people that really supported. But when Bobby Knight, who won 900 games, three championships, he had the last undefeated team in basketball, in college basketball.","Which is a hell of a statement. And he almost had two undefeated teams. He had won the year before which lost one game. But he was a great coach. Loved and is a great coach. He looks better than ever. But he came out for Trump and I want to tell you that state went crazy. So that was good. If there was ever an endorsement, that was good.","We won Indiana in a landslide. Everyone gave up and now we're going through and we're doing great. And we're just about like 50 -- 50 short and we're going to do great and we're going to have an amazing convention. And we're going to take care of trade. We're going to make great trade deals. We're going to stop with this nonsense.","We are going to make great trade deals. You know, with China, we have a trade deficit with China of $505 billion a year. Think of it. How -- how stupid can we be? Obama does nothing about it, Hillary knows nothing about it. She has absolutely no idea and she's taken care of by all the people that are putting up her money anyway.","She's taken care of. So even if she did, she wouldn't know what to do because she'll say, I can't do that, I can't hurt these people, they gave me millions of dollars. Let me just tell you, we are going to make the great trade deals out of absolute disgusting -- the worst ever negotiated by any country ever in the world.","That's how bad they are. They're taking our jobs, they're taking our money, they're taking everything. I really -- I'll tell you what, to me, the most interesting was. Because I love New York, I know New York. But I actually really toured this state like I never did before. I went up to Albany and I went up to Syracuse and I went up to Rome, that's Rome New York.","That's the real Rome, right? I went up to Rome and I went out to the island, to Bethpage and Suffolk, John Laval and Joe and all these guys. And -- and we did so great. But I looked at factories and I looked at buildings that were absolutely terrible to look at. They were crumbling -- and you could see, 20 years ago, 25 years ago you could see vibrance.","And today you could buy them for two dollars. I mean I looked at places and then I went to Pennsylvania and I looked at places -- and by the way, in Pennsylvania a week before, we have Hillary saying that she's going to put the miners and the coal mines out of business, OK? And I said, when I won New York -- it was interesting.","I said, we're going to put the miners back to work. I don't even know why I said it. And a few weeks later I went to West Virginia. You want to see good numbers? I really had good numbers in West Virginia. And I didn't say it for that reason, but we're going to put people back to work. We're going to take our jobs back and we're going to use our power, including our power of taxation.","When a company moves to Mexico and they think they're going to drop out, like Carrier, like Ford, like Nabisco. They think they're going to take our people, fire all of our people, move to Mexico, make their air conditioners and sell them right across the border. No tax no nothing. Guess what folks? Not going to work that way anymore.","Not going to work that way anymore. Now, I'm a free trader but I'm only a free trader if we make good deals. You can't be a free trader if everybody else -- you know these very conservative ideologues who say, well Donald Trump is not a free trader. How about Jeb Bush? Donald Trump is not a conservative.","Who cares? Don't care. I am a conservative but who cares? So somebody asked me yesterday, tell me, well are you a free trader? I said, yeah, I'm a free trader. But here's what I am. Here's the story. You want it defined? Actually, with Sean Hannity last night. Here's my trade -- nice guy right? Do we love Sean?","Good man. Here's my trade. Here's my trade deal. Here's -- they said, what about it? I said, here's what we're going to do. My trade deal is very simple. Here's what it is. I am going to make great deals for our country. That's my trade deal. Very simple. We don't make great deals for our country. You can call it free trade.","You can call it 15. You can do -- whatever you want to call it. We're going to make great deals for our country. Might be free, might not be free. I can tell you this. When carrier and Ford and Nabisco, leaving Chicago with their big plant, they're moving to Mexico. I'm not eating Oreos anymore you know that.","But neither is Chris. You're not eating Oreos anymore. No more Oreos. For either of us, Chris. Don't feel bad. For either of us. But I'll tell you what folks. There's got to be consequences. When they move, there's got to be consequences. Now I've watched, for six years, as the United States government, on a federal basis, United States government worked very hard on document -- they want to loan money to companies.","They want to give them low interest loans. You know, some companies actually took the money and then they moved anyway. I mean, who does these agreements? But they want to -- they want to come up with ideas. So here's my idea -- it's not an idea. It's so simple. And they worked on it for six years, in the meantime you look at New York, you look at New Jersey by the way, you look at different parts of this country.","What NAFTA has done to us. Signed by Bill Clinton by the way. Signed by Bill Clinton. It's the worst trade deal, in my opinion, in the history -- certainly of the history of this country. One of the worst ever, and it's going to be repealed, believe me. It's going to be changed. It's going to be repealed or totally renegotiated.","Probably repealed. Probably repealed. Probably. So here's what we're doing. So carrier moves, right? And we'll say, hi Carrier, how you doing? How's every -- I got to make the call myself. Chris, am I allowed? As president of the United States, am I allowed to call the president of an air conditioning company?","May I? He said, only one time. It'll only take one call. Because my wife would say, don't do that you're the President. But it's so much fun for me. So I'll call -- I'll call the head of Carrier and Ford and these others, and I'll say, let me just tell you something. You've let go of thousands of people and you've left, in this case Indiana and Chicago, and all of the different places, right?","And Michigan, which -- I'm going to win Michigan. We're going to win Illinois. We're going to win Indiana. We're going to win these states because I've been talking about it for years. These other guys they start talking about it and believe me, it's not going to work for them. Not going to work out so well.","But we're going to win Michigan big. You watch what happens. But I'm going to say to him, you want to move your plant, enjoy Mexico. It's a wonderful place, beautiful weather. I hope you like 120 degrees. It's wonderful. But here's what you're gonna do. Every unit you make, that you sell into the United States, you're going to pay a 35% tax, OK? 35, very simple.","Very simple. Now here's what's going to happen. Now some conservatives would say, that's not free market. I mean we're losing our shirts folks. We're losing our jobs. We don't have a choice. So here's what's gonna do. If I saw Carrier before they move. In other words, I want to get in there quickly because I'm going to call them fast, they haven't moved yet.","But before they moved, I'd say, you move, enjoy yourself. You're going to pay a 35% tax. They're not moving. They're not going to move. It's very simple. They're not moving. Now, if it's too late, they move, I'm charging somebody. I'm charging these companies some tax because you know what? We're getting killed.","We're losing all of our jobs. We're losing everything. So at least the United States is going to make a hell of a lot of money. And what do you think? And these dummies say, oh, well that's a trade war. Trade war? We're losing 500 billion in trade with China. Who the hell cares if there's a trade war? Trade war?","It's crazy. Think of it. 500 billion and they're telling me about a trade war. And you're not going to have a trade war. Two things are going to happen. China devalues their currency. That's how they're killing us, OK? They devalue their currency. They're behaving very, very badly. And on top of that they're building fortresses in the South China Sea and they're doing things.","Let me tell you something. China will behave and China will be our friend and we'll do better with China under me. And we're going to also do better economically with me. They're going to respect our country again. I was told just yesterday, by a very important person, that China's very concerned about Donald Trump being elected.","Because you know why? Because they're going to have to pay up. They're going to have to do something. They're going to have to do. So -- and I will say, look, look, a lot of you don't know the world of economics and you shouldn't even bother. Just do me a favor, leave it to me I have so much fun with it. But don't -- just go and enjoy your life.","But China is killing us, and so are other countries, with devaluation of the currency. And they're making it impossible for our companies to compete and they doing it more than ever and worse than ever. About nine months ago they did a devaluation that they weren't supposed to do. It was the biggest devaluation in 20 years, OK? The biggest devaluation in two decades.","Not going to happen anymore folks. They make it impossible for us. It's not going to happen anymore. And when companies move, different situation, and they want to move to a different place or they want to move, in particular, to Mexico which is becoming a mini version of China. We're going to be friendly with Mexico.","And I love the Mexican people. I employ thousands and thousands of Hispanics and I'm doing great in the polls. And by the way the Hispanics love me. You know why? They're here legally. The Hispanics that are here legally, they don't want their houses taken away. They don't want their jobs taken away. That's why I'm doing well with the Hispanics now.","And we're doing great with the African-Americans because they know I'm going to create jobs. I'm going to bring back jobs. We are not going to be the stupid country anymore. We're, right now -- we're -- folks, believe me, we are viewed as the stupid country. We're like a big, big sloppy bully that gets punched in the face and goes down.","You ever see a bully get knocked out? It's -- it's a terrible thing. Unless you're doing the punching, then it's OK. OK? But just so you understand, we're going to change things. OK. So we're going to make great trade deals. We're going to have tremendous borders. And we want people to come in, they're coming in legally.","We're going to have the wall. We need the wall for the drugs. Just recently, two weeks ago, 16,500 border patrol agents endorsed me. And I called them and I said to them, frankly, because these are great people. They are told to stand back. These are great people. They -- they want to endorse me because they want to do the job.","They're fantastic people and they can do a great job. But I said to them -- when they endorsed I said, I have to ask you one question. Do we need the wall? You know what their answer was? Mr. Trump, we absolutely need the wall. They told me. I just wanted to be sure. I said -- because I said to him, I want to build a wall.","You have to tell me, who knows better than the border patrol? I mean, that's what they do. They walk the border. They said, Mr. Trump, you absolutely -- it's another tool and there are other things, but you absolutely have to have the wall Mr. Trump. But it's got to be a real wall, not a little toy wall.","They put up these little walls. So we're going build -- see that ceiling? That ceiling is peanuts folks, OK? That ceiling is peanuts. We are going to build a wall. If they ever get up, they're saying, oh man, how do I get down from this wall? And we're going to make it beautiful and we're going to make it big and we're going to make it powerful.","And we're going to rebuild our military because our military is being decimated. Did anybody see the big piece that was on television all last week? Where our fighter jets are going to junkyards to buy planes. This is our -- this is the United States, right? They saw it. Where our fighter pilots and fighter planes, they're going to junkyards, where they have the junkyards for the old broken down planes, and they're stripping the planes apart and putting them on our 20 year old fighter planes.","And we're like a third world country. And what we do is we're ordering planes and other countries are ordering planes that are modern, clean, beautiful. And we got stuff where we're putting junk back on our planes and we're putting our pilots in there. And they're taking planes and they're stripping other planes that are on the runway because they can't get the planes to work.","So they're using, essentially, 60% of our -- and I'm saying, is this the United States? Is this our country? So we're going -- Obama doesn't care. He can't care. He can't care. He can't care. So what we're going to do -- our military is being depleted at a time where we need our military, probably, more than ever before, right?","We are going to have a military that's going to be so big and so strong and so powerful that nobody is going to mess with us. Just remember, nobody. Nobody. And as part of that. And to me very important, we are going to take care of our vets because our vets are being treated badly. We're going to repeal and replace Obamacare.","Obamacare is a disaster. We're going to terminate Common Core and we're going to have local education for your children. We're going to preserve the Second Amendment, which is under siege. And we are going to make America first. You know, there's an expression. We don't make America first. That's why we have all these bad deals.","We have these negotiators -- first of all they're political hacks. They shouldn't have the job. We're going to use our -- we have the greatest business people in the world. We're going to use the greatest business minds. When we negotiate with China and all these countries that rip us off, we're going to use the greatest business people in the world.","You're going to see a difference like you've never seen before. And when we defend all these countries in NATO -- I'm all for NATO. But you know what? We have a lot of the countries in NATO, they're not paying us. They're supposed to be paying us. They're not living up to their deal. You know, in the old days when I used to collect rent in Brooklyn, we'd say -- I'd say, yeah dad, they're delinquent.","You know the word is delinquent. They're back -- they owe us a lot of rent. OK. They owe us money. They're delinquent. So we're going to say, you got to pay. So we're defending them, they're not paying or they're paying a fraction of what they're supposed to be paying. Do you know the kind of money we're talking about?","Now, we defend Japan. Most people don't even know. We defend Japan. We defend Germany. We defend Saudi Arabia. Saudi Arabia, before the oil -- you know, before the drop in oil -- and don't worry about it, they're making a lot. They were making one billion dollars a day. Would you like that for New Jersey, Chris?","A billion a day. We get practically nothing folks. And they wouldn't be there. And I have so many friends, they're Saudis, they buy my apartments. You wouldn't believe it, OK? I love -- they're great. They're all great. We cannot be fooled any longer. We cannot be taken advantage of any longer. We are going to make our country rich again and strong again.","We're going to be able to afford Social Security and Medicare again. I'm the only one that says that. We're not going to be led down the tubes by an incompetent person like Hillary Clinton. Because you look at what she's done. You look at what she's done. You look at her deal with Libya. Just take a look at Libya.","It is a catastrophe. By the way, you had the Benghazi, you had -- think of what -- think of Libya. Do you know they have some of the finest oil in the world? You know who's got the oil? ISIS has the oil. ISIS. This was her deal. And so many other mistakes. So many other mistakes. And I have a whole list but I'm not going to do that because we're having too much fun.","Let me just tell you folks. I've gone all over the country. I've seen millions of people at my events. If you add them up, millions. We have the biggest crowds by far. Far bigger than Bernie. Far bigger than anybody. We have the biggest crowds. He is second. And I think what happens -- I believe that his people, a large percentage of his people, vote for Trump.","You watch. You watch what's going to happen. Because the one thing he's right on is trade. I mean he's got that right, except he can't do anything about it. We both have the same view. We're getting ripped off on trade. The difference is I'm going to make him great deals as opposed to just saying we're getting ripped off.","That's all he can do. So here's what we do folks. We're going to make our country absolutely great again. We're going to start winning. We don't win anymore. We don't win anymore. We're going to win on our military. We're going to win for our vets. We're going to win on health care, and on Common Core, we're terminating.","We're going to win with our education. We're going to win at every single level. We're going to win with that trade. We're going to win with the border and we're going to win so much. You guys, we're all friends, right? You're going to call me and you're going to have Chris Christie call me, maybe Mary Pat would even be better because I think maybe she'd be better, and you're going to say, Donald, the people of New Jersey cannot stand you winning so much for our country.","They can't stand it. Could you stop winning so much? It's driving them crazy. And I'm going to say, Mary Pat, I won't do that. We are going to win, win, win. We are going to make America great again. Greater than ever before. And we're going to have a lot of fun. And we are going to be respected as a country again.","So I want to thank everybody I love you all. I love New Jersey. June 7. June 7. Thank you everybody. Thank you. Thank you. Thank you everybody."],"text":" Thank you very much. Boy. Thank you. So nice. Boy oh boy. So you know Chris paid off his entire campaign debt tonight. Right? His entire debt. And Chris, you can't even give them a table and a seat. That's terrible. But he's a great guy and he's a great Governor, and I will tell you -- thank you I love you too. Look at these guys. Look at these guys. You know, I wanted to know a little bit because he's been my friend a long time, he's done a great job and all that. But I said let's be specific because we want to be specific. So I said give me some information and I -- boy do I look -- oh, do I look forward to debating Hillary. Well that'd be fun. Oh I look forward to that. So I said let's be specific. So, you know, Governor Christie, your governor, balanced the budget six times without raising taxes. Not easy to do. Enacted a $2.3 billion dollar job creating tax cuts. I mean that's a lot of stuff. 2.3 billion. Not easy in New Jersey, that I can tell you. He shrank the State Government by 6,500 jobs. Governor Christie, listen to this, bipartisan. There's no such thing as bipartisan anymore. It's a beautiful thing actually, Economic Opportunity Act will ultimately create 27,000 jobs, 22,000 in the construction industry. A lot of my friends are here tonight. We're all in the construction industry. Governor Christie contributed more to the pension system than any other governor in New Jersey state history right. Governor Christie brought the insolvent -- and this was important, the insolvent New Jersey Unemployment Insurance Trust Fund back to solvency. And I will tell you, it was done in at least two years ahead of schedule. So that's a pretty good track record and that's just a few of the things, all right? That's just a few. So we've had an interesting time. And you know it all started -- and Christie was out there and I was out there. And I have to say one of the more interesting parts was I was watching the debate because I had one debate that I really enjoyed -- because I was watching and I like Marco very much. But Marco was over here, Chris was over here and I was standing there and I watched it happen. No, I watched it happen and it was -- I mean, he looked like Perry Mason that evening. That was a rough evening for Marco. And Marco will admit it. That was a rough rough evening. So, this began -- there's nothing like New Jersey. There's nothing. There's nothing like New Jersey. Oh, wise guys, so many wise guys. I'll tell you what, you can make it in New Jersey, you can do just about anything you want in life. Great people. And by the way, on June 7th, will you do me a favor? Go out and vote please, OK? Just go out and vote. And boy are we going to go out in November, that I know. But go out on June 6 -- June 7 folks. So -- On June 16th -- that's right. We're going to build that wall. We're going to build that wall. The wall is going to be built. We want the wall. You know, Hillary, you talk about Bernie Sanders. Bernie -- crooked Hillary. I love this crowd, these are great. So -- my people. This is my people. But Bernie Sanders said that Hillary really isn't, essentially, not fit to be president. She's not qualified to be president. You know why? He said because she suffers from bad judgment. So today she made this statement -- you know she won't use the term radical Islamic terrorism. You understand that. She won't use it. She refuses. You know why she won't? Because her President won't use it, that's why. And by the way, is she being nice to him? You know, she used to be -- she couldn't stand him and the husband couldn't stand him. Bill couldn't stand him and she couldn't stand him. I wonder why she's being so nice? Can you figure it out? She's being so nice. Being so nice. She didn't like him one little bit. Now anything he said, my President said, my President said. But if you think about it and if you look at it, he said unqualified and he said that she suffers from bad judgment. And she does. So today we had a terrible tragedy and she came up and she said that Donald Trump talked about radical Islamic terrorism, which she doesn't want to use, she used a different term. Because he doesn't want to use that term. She refuses to use that term and I'm saying to myself -- and it's a terrible thing and he, essentially, shouldn't be running for office. He doesn't have the right to run for office. And I'm saying to myself, what just happened about 12 hours ago? A plane got blown out of the sky. And if anything, if anybody thinks it wasn't blown out of the sky, you're 100% wrong folks. OK? You're 100% wrong. And it's getting worse and you know, today, I was watching one of the networks and they had this great guy from the FBI on and he was talking about what happened with the plane. It was like, amazing, and I didn't know. I never met him, I never saw him before on television. And he's going back and forth about how bad it is and how bad it's getting, and how we're losing control, and how we don't have a president that knows what he's doing. And then at the end he said, let me just tell you something -- Now, I don't know this man. He said, the person that knows what's going on, the person that understands what's happening is a guy named Donald Trump. What -- it's true. It was a great. It was a great honor. Thank you. Thank you. No, that was a great honor. You know you're sitting home, you're watching television, you have this man -- who's a real expert. He's an expert on exactly this and an expert on terrorism, and he says that. And that really, to me, is a great compliment. So on June 16th I came down that escalator, that beautiful escalator in Trump Tower. Trump Tower -- this is very nice but it doesn't remind me of this place. And it was a big day and I just said we have to do it. There's so many things that we can do to make America great again and we're never going to do them. And if Hillary Clinton gets in, I don't know if our country can ever recover. You know yesterday I named a large number of judges, and I'll be adding to that number, who are really highly, highly respected judges. They come out of Heritage. They come out of -- different groups have recommended very, very strongly. They've really recommended strongly. These are great judges. We'll be adding some additional ones, Chris. And it's outstanding. One of the most important things, always security first, right? Always security. But one of the most important things we'll be doing, whoever the next President is, is naming judges. Now it's probably naming the justices of the United States Supreme Court because they're going to take us in a certain direction. It's either going to be down the tubes or it's going to be through -- through the roof. I'll tell you, through the roof. And the judges, the justices, and some of them are currently judges. I guess almost all of are currently judges, but the justices of the United States Supreme Court, the next three -- it'll be three. It could be five by the way. Probably going to be three, most likely three, four and it could even be five. That is a massive number of justices who -- so whoever wins -- and it looks like it's going to be Hillary because it looks to me -- what's happening? She's got totally embroiled in this. You talk about bad judgment. How bad a judgment is the email scandal? How bad? For what reason did she do that? Now, I know the reason. I know the reason, and it's always the same with her and it's always the same with them -- but I know -- she's liar. No, I've used that one already. People like it. I can't use it. I'd like to use it again but I have to -- no, we'll go crooked Hillary, OK? But crooked may be more accurate actually. But she's probably going to get out because, I mean you know they keep letting her -- what she has done is so much worse than what anybody else running ever, ever has done. What anybody else -- you look at all these people, General Petraeus, you look at these people, they've done a tiny fraction of what she's done and their lives have been destroyed, their lives have been ruined. What she has done -- what she has done, for her to be able to continue to run, is an absolute disgrace, in my opinion, to this country. A disgrace. And on top of that, you know it's an amazing thing, every time I turn it on, I watch the race, Bernie Sanders wins. Bernie Sanders wins. He keeps winning and then they have the round table. Well, Hillary Clinton will win. I mean it's like -- it's a rigged -- it's a rigged deal. You notice the way I started talking, using the word rigged right, about four months ago. Nobody used the word rigged, now everybody's calling it rigged. They copy my -- I want to go out, I want to have that phrase coined. But I use the word rigged four or five months ago. The Republican deal was rigged. 100%. Now, what did I do? You had to win by massive numbers. And boy did we get massive numbers we. We did well. You know I had, by far, the most delegates. And I came into New York and everybody said, well New York and everything else, but the people in New York they love me, they know me. It's nice when the people -- and you know me as well as they know me. I mean, you know how many employees? Right now I have -- I am paying so many people, I have so many employees in New Jersey, I hate to think about it. I have to be honest, OK? I am taking care of more education and more salaries and more health care than anybody probably, Kristin, almost anybody in New Jersey, right? But honestly I'm happy to do it. I'm happy we have great people. New Jersey, let me tell you, New Jersey is a great state. It's a state where we have truly, truly great people. Truly great people. So I came into New York and we didn't win by a little bit. We won in a massive landslide. We won everything. And the nice part is, they know me the best. You know, supposing you go into a community and they know you and you don't do well, that's not a good sign. They know me so well, they have seen me for so many years. They're probably sick of me but they said I'm still voting for Trump. And what happened? So I got 62% and we just knocked them and it was great. OK, now I go into Pennsylvania. Great place. Connecticut. We're going to do great in Pennsylvania. We have our chairman over here from Pennsylvania. She's here someplace. But we go into Pennsylvania, Connecticut, Maryland, Delaware and Rhode Island. We win every single subsection of every single state. We won every county of every state and we won every state by massive numbers. And don't forget, I got 66 and 67%. Don't forget, I have three people running. When these guys on television, the most dishonest human beings, these people right here. Look at all the cameras. No, they're the worst. Donald Trump -- I watched -- I watched Krauthammer. We got like seven or eight people, nine people running, OK? Donald Trump did not get 50%. How do you get 50%? Sometimes I have -- you know we started off with 17 people. And actually, after about two or three weeks, because I won New Hampshire, which was amazing. We're going to take care of those people in New Hampshire. They have a drug problem that you wouldn't believe. They have heroin pouring over the border. We're going to seal up that border, we're going to build a wall. We're going to have real protection. Believe me. We're going to do it for everybody, but we're really doing it. The people of New Hampshire are -- I mean, it's incredible. It's incredible. What happened -- what happened is and what's happening here in New Jersey, the drugs are pouring across, illegal immigration, illegal immigrants are coming. We are going to stop it. We're going to build that wall. It's going to be a real wall, and we're going to have people come into our country but they're going to come into our country legally, OK? Legally. So -- so I went through, the next week I win New York in a landslide. I win then I win the five states, and then I'm watching and I'm hearing that I got you know something a little bit less, and actually every one of them was off but I should have done better. And I said, what? You have all these people. And then I go to Indiana, that was gonna be the firewall and I went there and we won Indiana so big and everybody just -- you know what they did? Chris knows. They gave up. They gave up. That was the end. And we had a little help. It was a man named Bobby Knight, OK? Bobby Knight. Bobby. We love Bobby. And we had Lou Holtz and we had Digger and we had a lot of people. We had a great coach from Purdue. We had a lot of great people that really supported. But when Bobby Knight, who won 900 games, three championships, he had the last undefeated team in basketball, in college basketball. Which is a hell of a statement. And he almost had two undefeated teams. He had won the year before which lost one game. But he was a great coach. Loved and is a great coach. He looks better than ever. But he came out for Trump and I want to tell you that state went crazy. So that was good. If there was ever an endorsement, that was good. We won Indiana in a landslide. Everyone gave up and now we're going through and we're doing great. And we're just about like 50 -- 50 short and we're going to do great and we're going to have an amazing convention. And we're going to take care of trade. We're going to make great trade deals. We're going to stop with this nonsense. We are going to make great trade deals. You know, with China, we have a trade deficit with China of $505 billion a year. Think of it. How -- how stupid can we be? Obama does nothing about it, Hillary knows nothing about it. She has absolutely no idea and she's taken care of by all the people that are putting up her money anyway. She's taken care of. So even if she did, she wouldn't know what to do because she'll say, I can't do that, I can't hurt these people, they gave me millions of dollars. Let me just tell you, we are going to make the great trade deals out of absolute disgusting -- the worst ever negotiated by any country ever in the world. That's how bad they are. They're taking our jobs, they're taking our money, they're taking everything. I really -- I'll tell you what, to me, the most interesting was. Because I love New York, I know New York. But I actually really toured this state like I never did before. I went up to Albany and I went up to Syracuse and I went up to Rome, that's Rome New York. That's the real Rome, right? I went up to Rome and I went out to the island, to Bethpage and Suffolk, John Laval and Joe and all these guys. And -- and we did so great. But I looked at factories and I looked at buildings that were absolutely terrible to look at. They were crumbling -- and you could see, 20 years ago, 25 years ago you could see vibrance. And today you could buy them for two dollars. I mean I looked at places and then I went to Pennsylvania and I looked at places -- and by the way, in Pennsylvania a week before, we have Hillary saying that she's going to put the miners and the coal mines out of business, OK? And I said, when I won New York -- it was interesting. I said, we're going to put the miners back to work. I don't even know why I said it. And a few weeks later I went to West Virginia. You want to see good numbers? I really had good numbers in West Virginia. And I didn't say it for that reason, but we're going to put people back to work. We're going to take our jobs back and we're going to use our power, including our power of taxation. When a company moves to Mexico and they think they're going to drop out, like Carrier, like Ford, like Nabisco. They think they're going to take our people, fire all of our people, move to Mexico, make their air conditioners and sell them right across the border. No tax no nothing. Guess what folks? Not going to work that way anymore. Not going to work that way anymore. Now, I'm a free trader but I'm only a free trader if we make good deals. You can't be a free trader if everybody else -- you know these very conservative ideologues who say, well Donald Trump is not a free trader. How about Jeb Bush? Donald Trump is not a conservative. Who cares? Don't care. I am a conservative but who cares? So somebody asked me yesterday, tell me, well are you a free trader? I said, yeah, I'm a free trader. But here's what I am. Here's the story. You want it defined? Actually, with Sean Hannity last night. Here's my trade -- nice guy right? Do we love Sean? Good man. Here's my trade. Here's my trade deal. Here's -- they said, what about it? I said, here's what we're going to do. My trade deal is very simple. Here's what it is. I am going to make great deals for our country. That's my trade deal. Very simple. We don't make great deals for our country. You can call it free trade. You can call it 15. You can do -- whatever you want to call it. We're going to make great deals for our country. Might be free, might not be free. I can tell you this. When carrier and Ford and Nabisco, leaving Chicago with their big plant, they're moving to Mexico. I'm not eating Oreos anymore you know that. But neither is Chris. You're not eating Oreos anymore. No more Oreos. For either of us, Chris. Don't feel bad. For either of us. But I'll tell you what folks. There's got to be consequences. When they move, there's got to be consequences. Now I've watched, for six years, as the United States government, on a federal basis, United States government worked very hard on document -- they want to loan money to companies. They want to give them low interest loans. You know, some companies actually took the money and then they moved anyway. I mean, who does these agreements? But they want to -- they want to come up with ideas. So here's my idea -- it's not an idea. It's so simple. And they worked on it for six years, in the meantime you look at New York, you look at New Jersey by the way, you look at different parts of this country. What NAFTA has done to us. Signed by Bill Clinton by the way. Signed by Bill Clinton. It's the worst trade deal, in my opinion, in the history -- certainly of the history of this country. One of the worst ever, and it's going to be repealed, believe me. It's going to be changed. It's going to be repealed or totally renegotiated. Probably repealed. Probably repealed. Probably. So here's what we're doing. So carrier moves, right? And we'll say, hi Carrier, how you doing? How's every -- I got to make the call myself. Chris, am I allowed? As president of the United States, am I allowed to call the president of an air conditioning company? May I? He said, only one time. It'll only take one call. Because my wife would say, don't do that you're the President. But it's so much fun for me. So I'll call -- I'll call the head of Carrier and Ford and these others, and I'll say, let me just tell you something. You've let go of thousands of people and you've left, in this case Indiana and Chicago, and all of the different places, right? And Michigan, which -- I'm going to win Michigan. We're going to win Illinois. We're going to win Indiana. We're going to win these states because I've been talking about it for years. These other guys they start talking about it and believe me, it's not going to work for them. Not going to work out so well. But we're going to win Michigan big. You watch what happens. But I'm going to say to him, you want to move your plant, enjoy Mexico. It's a wonderful place, beautiful weather. I hope you like 120 degrees. It's wonderful. But here's what you're gonna do. Every unit you make, that you sell into the United States, you're going to pay a 35% tax, OK? 35, very simple. Very simple. Now here's what's going to happen. Now some conservatives would say, that's not free market. I mean we're losing our shirts folks. We're losing our jobs. We don't have a choice. So here's what's gonna do. If I saw Carrier before they move. In other words, I want to get in there quickly because I'm going to call them fast, they haven't moved yet. But before they moved, I'd say, you move, enjoy yourself. You're going to pay a 35% tax. They're not moving. They're not going to move. It's very simple. They're not moving. Now, if it's too late, they move, I'm charging somebody. I'm charging these companies some tax because you know what? We're getting killed. We're losing all of our jobs. We're losing everything. So at least the United States is going to make a hell of a lot of money. And what do you think? And these dummies say, oh, well that's a trade war. Trade war? We're losing 500 billion in trade with China. Who the hell cares if there's a trade war? Trade war? It's crazy. Think of it. 500 billion and they're telling me about a trade war. And you're not going to have a trade war. Two things are going to happen. China devalues their currency. That's how they're killing us, OK? They devalue their currency. They're behaving very, very badly. And on top of that they're building fortresses in the South China Sea and they're doing things. Let me tell you something. China will behave and China will be our friend and we'll do better with China under me. And we're going to also do better economically with me. They're going to respect our country again. I was told just yesterday, by a very important person, that China's very concerned about Donald Trump being elected. Because you know why? Because they're going to have to pay up. They're going to have to do something. They're going to have to do. So -- and I will say, look, look, a lot of you don't know the world of economics and you shouldn't even bother. Just do me a favor, leave it to me I have so much fun with it. But don't -- just go and enjoy your life. But China is killing us, and so are other countries, with devaluation of the currency. And they're making it impossible for our companies to compete and they doing it more than ever and worse than ever. About nine months ago they did a devaluation that they weren't supposed to do. It was the biggest devaluation in 20 years, OK? The biggest devaluation in two decades. Not going to happen anymore folks. They make it impossible for us. It's not going to happen anymore. And when companies move, different situation, and they want to move to a different place or they want to move, in particular, to Mexico which is becoming a mini version of China. We're going to be friendly with Mexico. And I love the Mexican people. I employ thousands and thousands of Hispanics and I'm doing great in the polls. And by the way the Hispanics love me. You know why? They're here legally. The Hispanics that are here legally, they don't want their houses taken away. They don't want their jobs taken away. That's why I'm doing well with the Hispanics now. And we're doing great with the African-Americans because they know I'm going to create jobs. I'm going to bring back jobs. We are not going to be the stupid country anymore. We're, right now -- we're -- folks, believe me, we are viewed as the stupid country. We're like a big, big sloppy bully that gets punched in the face and goes down. You ever see a bully get knocked out? It's -- it's a terrible thing. Unless you're doing the punching, then it's OK. OK? But just so you understand, we're going to change things. OK. So we're going to make great trade deals. We're going to have tremendous borders. And we want people to come in, they're coming in legally. We're going to have the wall. We need the wall for the drugs. Just recently, two weeks ago, 16,500 border patrol agents endorsed me. And I called them and I said to them, frankly, because these are great people. They are told to stand back. These are great people. They -- they want to endorse me because they want to do the job. They're fantastic people and they can do a great job. But I said to them -- when they endorsed I said, I have to ask you one question. Do we need the wall? You know what their answer was? Mr. Trump, we absolutely need the wall. They told me. I just wanted to be sure. I said -- because I said to him, I want to build a wall. You have to tell me, who knows better than the border patrol? I mean, that's what they do. They walk the border. They said, Mr. Trump, you absolutely -- it's another tool and there are other things, but you absolutely have to have the wall Mr. Trump. But it's got to be a real wall, not a little toy wall. They put up these little walls. So we're going build -- see that ceiling? That ceiling is peanuts folks, OK? That ceiling is peanuts. We are going to build a wall. If they ever get up, they're saying, oh man, how do I get down from this wall? And we're going to make it beautiful and we're going to make it big and we're going to make it powerful. And we're going to rebuild our military because our military is being decimated. Did anybody see the big piece that was on television all last week? Where our fighter jets are going to junkyards to buy planes. This is our -- this is the United States, right? They saw it. Where our fighter pilots and fighter planes, they're going to junkyards, where they have the junkyards for the old broken down planes, and they're stripping the planes apart and putting them on our 20 year old fighter planes. And we're like a third world country. And what we do is we're ordering planes and other countries are ordering planes that are modern, clean, beautiful. And we got stuff where we're putting junk back on our planes and we're putting our pilots in there. And they're taking planes and they're stripping other planes that are on the runway because they can't get the planes to work. So they're using, essentially, 60% of our -- and I'm saying, is this the United States? Is this our country? So we're going -- Obama doesn't care. He can't care. He can't care. He can't care. So what we're going to do -- our military is being depleted at a time where we need our military, probably, more than ever before, right? We are going to have a military that's going to be so big and so strong and so powerful that nobody is going to mess with us. Just remember, nobody. Nobody. And as part of that. And to me very important, we are going to take care of our vets because our vets are being treated badly. We're going to repeal and replace Obamacare. Obamacare is a disaster. We're going to terminate Common Core and we're going to have local education for your children. We're going to preserve the Second Amendment, which is under siege. And we are going to make America first. You know, there's an expression. We don't make America first. That's why we have all these bad deals. We have these negotiators -- first of all they're political hacks. They shouldn't have the job. We're going to use our -- we have the greatest business people in the world. We're going to use the greatest business minds. When we negotiate with China and all these countries that rip us off, we're going to use the greatest business people in the world. You're going to see a difference like you've never seen before. And when we defend all these countries in NATO -- I'm all for NATO. But you know what? We have a lot of the countries in NATO, they're not paying us. They're supposed to be paying us. They're not living up to their deal. You know, in the old days when I used to collect rent in Brooklyn, we'd say -- I'd say, yeah dad, they're delinquent. You know the word is delinquent. They're back -- they owe us a lot of rent. OK. They owe us money. They're delinquent. So we're going to say, you got to pay. So we're defending them, they're not paying or they're paying a fraction of what they're supposed to be paying. Do you know the kind of money we're talking about? Now, we defend Japan. Most people don't even know. We defend Japan. We defend Germany. We defend Saudi Arabia. Saudi Arabia, before the oil -- you know, before the drop in oil -- and don't worry about it, they're making a lot. They were making one billion dollars a day. Would you like that for New Jersey, Chris? A billion a day. We get practically nothing folks. And they wouldn't be there. And I have so many friends, they're Saudis, they buy my apartments. You wouldn't believe it, OK? I love -- they're great. They're all great. We cannot be fooled any longer. We cannot be taken advantage of any longer. We are going to make our country rich again and strong again. We're going to be able to afford Social Security and Medicare again. I'm the only one that says that. We're not going to be led down the tubes by an incompetent person like Hillary Clinton. Because you look at what she's done. You look at what she's done. You look at her deal with Libya. Just take a look at Libya. It is a catastrophe. By the way, you had the Benghazi, you had -- think of what -- think of Libya. Do you know they have some of the finest oil in the world? You know who's got the oil? ISIS has the oil. ISIS. This was her deal. And so many other mistakes. So many other mistakes. And I have a whole list but I'm not going to do that because we're having too much fun. Let me just tell you folks. I've gone all over the country. I've seen millions of people at my events. If you add them up, millions. We have the biggest crowds by far. Far bigger than Bernie. Far bigger than anybody. We have the biggest crowds. He is second. And I think what happens -- I believe that his people, a large percentage of his people, vote for Trump. You watch. You watch what's going to happen. Because the one thing he's right on is trade. I mean he's got that right, except he can't do anything about it. We both have the same view. We're getting ripped off on trade. The difference is I'm going to make him great deals as opposed to just saying we're getting ripped off. That's all he can do. So here's what we do folks. We're going to make our country absolutely great again. We're going to start winning. We don't win anymore. We don't win anymore. We're going to win on our military. We're going to win for our vets. We're going to win on health care, and on Common Core, we're terminating. We're going to win with our education. We're going to win at every single level. We're going to win with that trade. We're going to win with the border and we're going to win so much. You guys, we're all friends, right? You're going to call me and you're going to have Chris Christie call me, maybe Mary Pat would even be better because I think maybe she'd be better, and you're going to say, Donald, the people of New Jersey cannot stand you winning so much for our country. They can't stand it. Could you stop winning so much? It's driving them crazy. And I'm going to say, Mary Pat, I won't do that. We are going to win, win, win. We are going to make America great again. Greater than ever before. And we're going to have a lot of fun. And we are going to be respected as a country again. So I want to thank everybody I love you all. I love New Jersey. June 7. June 7. Thank you everybody. Thank you. Thank you. Thank you everybody."}