{"id":391,"author":"Donald Trump","title":"Speech: Donald Trump Delivers a Campaign Speech in South Bend, IN","date":"2016-05-02","link":"https://factba.se/transcript/donald-trump-speech-south-bend-in-may-2-2016","paragraphs":["Wow. This is so, so amazing. I just want to thank you all. So you know we have three rooms like this. And I like this guy. He's a nice guy. I really like him and he's a professional. But the press, they don't get it, folks. So I'm listening to Fox on the way over, and I heard Greta. She said, yeah, they have thousands and thousands of people there.","And you know, I don't know if you know it, but we have two other rooms like this outside. You people have the best location. You have the best location. But we love the people in the other two rooms, right? So there are supposed to be 3,000 to 4,000 people in this room. 2,000 and 2,000 in other two rooms.","So we have anywhere from 6,000 to 8,000. They don't even know. And Greta said they have thousands. And Carl Cameron, who is a nice guy. He said, no, they only have 1,500 people here. Let me tell you. Let me tell you. Start counting about Carl because we got a lot of people here, Carl. and I'm not referring to Carl.","I'm just saying the press is so damn dishonest. They are so unbelievably dishonest. So we have two rooms like this and I have a guy saying 1,500 people. This is not -- this is thousands and thousands of people. And by the way, outside, they have thousands of people that couldn't get into any of the three rooms.","So that's his story. What can I tell you. I like to set it straight, right? I want to thank you all for coming. This has been an amazing experience. I know so many people in Indiana. I think we're really doing well. That doesn't mean you don't go vote. You have to go vote tomorrow. But I think we're really doing well.","You know, we've caught Ted Cruz in so many lies. We call him lying Ted. He's lying. This guy lies. He's lying Ted. He's lying Ted. Almost worse than the press, almost And I don't know if you heard because the press won't tell you this. But a new poll just came out a few hours ago, the Rasmussen poll, and I'm beating Hillary Clinton and that's good.","That's good. We're beating her. And I haven't even started yet. You know, we started with 17 people. And they're all senators and, you know, accomplished people. The senators, governors, tremendous people like Dr. Ben Carson, whos is a great guy, who really did well. And he endorsed me. He's a great guy.","And Chris Christie, great guy, who endorsed me and a lot of people. A lot of people are endorsing. A lot of people. But Jerry Falwell Jr. just came. And Jerry Falwell Jr. from Liberty University endorsed me. So many ministers and pastors, and that's why we're winning the evangelical vote and we have been very consistently.","We're winning everything. You know -- I don't know if you saw it, but we -- in New York, they did exit polls. We won with women. We won with men. But especially the women made me feel good. The women. We didn't only win with women. We really win with women so -- and we won with highly educated and less than highly educated and the rich and the poor.","And we won with everything. We won. And then we then we went to fight. So that was in New York where we got almost every delegate, 95. We got almost all of them. And then we went to five states, great states. We went to Connecticut, right? We went to Maryland. We went to Pennsylvania, Delaware, Rhode Island.","We won every single one of them in a landslide and we won every group. It's been amazing. And now the biggie is going to be Indiana because if we win in Indiana, it's over with, folks. It's over with. And then we focus on Hillary Clinton. We focus on it. We then focus on Hillary and that's going to be fun.","But remember, we began with 17 and one by one by one, they went off. A governor, a senator, a senator, a governor. They didn't know what the hell happened. But they went out. So now we're down to two and they're hanging by their fingernails. You know, they're up there like this. They're hanging. They're hanging.","But it's been unbelievable. I've been here a lot. I have many friends here and they're amazing people. I have met such amazing people. And we've had such incredible crowds. That's why I had to call him. But we had such incredible crowds right up to the end. Look at this room as an example, right into the corners of this big room people and all over and all over.","Hello, corner. So it's been an incredible experience. We are going to make America great again. It's going to be America first America first. But we are going to make America. Look at all those hats, whites, reds. We have everything. But we love you. You know, the truth is, at the Trump rallies, it's the safest place you can be because we look out for each other and we look out for everybody.","We had won in Costa Mesa California recently 31,000 people. It was unbelievable. And then you read -- you don't read about that. You read about they had some problems outside now. Now, people were burning the American flag. I don't want them burning the American flag. I don't want them burning. Not the people inside.","People outside. They're agitators. Many of them are professionals. They're bad people. You don't see that at all. Look, look at this place, you don't see it. We've gone through days. You don't see it. California was unbelievable. A new poll just came out in California where I think I'm leading. 55 to like 20, OK? But I do love that Clinton poll and the other one had me tied, that was last week.","But now, we're going up. And by the way, with Hillary Clinton, in a state called Indiana, which we love, that just came out too. That's the Wall Street Journal, I guess, NBC poll. Trump is leading Hillary 48 to 41. We're starting to make -- we're really doing it. And you know the only thing that Cruz could say, you know with his Shakespearean and everything, uh, uh. I can't watch.","I love these guys today. They're online. Did you see them? They were all over the news. We want Trump, lying Ted, that's right. Lying Ted. He lies like nobody can lie. But lying Ted, but they were all lying. And they had these guys debating and they were just they know, they get it. They said, you're lying.","You're lying. And so many of the things he said. You know, he said the other day, like Mike Tyson, he was very nice. He said on the Internet that I'm supporting Donald Trump. That was it. And I heard all of a sudden, I am campaigning with Mike Tyson as my vice president. And yet Cruz, and who would you rather have, himself and Carly or Donald Trump and Mike Tyson?","Say, where did that come? No, I said where did it come. First of all, I'm honored that he endorsed me. But where did it come from? That he said Donald Trump wants to raise your taxes 40%. Now, just so you understand. I have a tax policy and we have a tax plan put in. And I'm giving by far, the biggest tax reduction of anybody running, by far, especially for the middle class and especially for business.","We're the highest taxed nation in the world. And the fact is that the one criticism of my tax plan is that I'm giving so much. In other words, my plan is much higher. And yet, you listen to this lying guy, saying Donald Trump wants to raise your taxes 40%. These politicians are really bad. I've been in business.","I've never -- I've only done this for nine months and I think I'm doing a good job. Do you agree we're doing a good job? I've done this for nine months and all my life I've been in business. I've competed against business people and done well. I started off with a million dollar loan and I built a net worth over $10 billion, with the greatest assets, with the greatest assets, very low debt, tremendous cash flow.","And I only say for one reason because I don't care. I'm not saying it braggadocios. I'm saying that's the kind of thinking we need in our country. We got to bring our country back. We have to bring our country back. The world is ripping us off whether it's China or Mexico or Japan or Vietnam now. It's a new one just killing us. So many.","I could name any country. If you name any country, they're beating us. We don't win anymore and we're going to start to win big league, big league. Let me just show you what I do. Let me just show you. So I just had to mention that though and the taxes. So I'm giving you the biggest -- and I hit this guy and I'm saying, oh, would I like to be standing next to him so I could tell the truth.","I've never heard -- he also said -- now you've been watching me for a long time. Repeal and replace Obamacare, right? So Cruz gets up today. Cruz gets up, lying Ted. He goes, Donald Trump loves, you know, with a big flourish. I mean, honestly, I don't even think he's a good debater. I've beaten him in every -- according to every single online poll, at every single debate, I've beaten him and I don't debate.","I mean, my whole life is a debate but I don't debate. But this guy -- so I talk about Obamacare every spin -- every speech. We're going to repeal it. It's a disaster and replace it with something great. I don't know if you see your premiums are going up so much, right? The premiums are going up 25%, 35%, 45%, 55%. Your deductibles are so high that you're never gonna be able to use it unless you're like close to death.","It's a disaster. So every speech I say, we're going to repeal and replace Obamacare. And I hear this guy, Cruz, today, lying Ted. He goes, Donald Trump loves Obamacare. He wants to take Obamacare to the next level. He loves it. I'm saying he's such a liar. And you know, I was given a little bit of shelter when during one of the debates Marco Rubio called him a liar.","You are really a liar. So here's a senator calling a senator a liar. So now I feel much better about calling the guy lier. But I've never seen a guy lie like that. I've never seen -- he even said, Donald Trump will not build the wall. He said he's not gonna build the wall, not build the wall, OK? We're going to build the wall.","Can you imagine? No, no, can you imagine? We're gonna build the wall. Don't even worry about it. We'll talk about the wall. Don't even -- and I'll tell you, we're gonna build the wall, we're gonna stop drugs from pouring in and poisoning our youth and other people. We are building the wall. But I got this guy, Cruz, lying Ted.","Donald Trump has said he is not going to build the wall. I think he's crazy. I -- honestly, I think he's crazy. Lying Ted does not have the temperament to be doing this. He is choking like a dog because he's losing so badly. We have to put him away tomorrow, folks. We got to get out and vote. We've got to get out and vote.","We got to get out and vote. So -- thank you darling. Oh. I love her too. Ready? So this is very depressing. It happens all the time. Every place I've gone to, New York state landslide. But I go to different communities and I say to my statisticians, not the most exciting job to be a statistician, but they love it, right?","It's their. But I say, give me the statistics on certain areas: Albany, New York, Poughkeepsie, this that. OK. I go through New York, it's horrible. What's happening? The jobs are down 50%. Manufacturing is gone. I mean, it's horrible what's happening in New York State. I go to Pennsylvania. You look at the steel industry -- by the way, look at the steel industry here it's being killed.","The steel industry here is being killed. The coal industry is being killed, your industries, your manufacturing. So I said, do me a favor, go up to South Bend. I love South Bend you know why. What school do I love, right? I mean, I have so many friends that love me. They'd like to be right now with me in South Bend for a certain reason.","Ready? So South Bend reason -- listen to this. South Bend -- and don't be depressed because we're gonna fix it. And no politician can fix it because they're all bought and controlled by special interests. Remember that. So you know a friend of mine who is very smart, very smart guy. He said to me, you know, Donald, I don't understand.","These politicians are really stupid. I said, no, they're not stupid. They're all given so much money for their PACs and for their -- by special interests, by their contributors, by their donors and some are stupid. Many are stupid. Frankly, many don't know what they're doing. Some of these guys that negotiate with China and Mexico and all these big countries where we just die with it with these horrible trade deals.","Some of them aren't good. You know, they're political hacks. But I'll tell you what. They're not actually stupid. They're making deals because their special interest groups, their lobbyists, their donors tell them that that's what they want. When I see Carrier air conditioning leaving Indiana for Mexico, there's people that want that to happen.","And I've been talking about it since they first tell that. beach I've been talking about that. I know I'd be in Indiana. The coach were great to endorse me, and we've had so many great endorsements. We've had. And Bobby Knight just called -- and Bobby Knight is gonna actually be here tomorrow all day.","And I'll tell you, but Bobby Knight was so cool. Because a year ago before I was going to run, you know, I announced like nine or 10 months ago, on June 16th, big day. Not easy to do this. It takes guts to do this stuff. Believe me, folks. I sort of had a nice life. I had a nice company, nice family. Now I call back.","I say I'll be home in four days. But I'll tell you what, Bobby Knight called a year ago and he heard I was thinking about running. I never met Bobby Knight. I knew Bobby Knight, winner, smart, tough, which is what we need in our country. And Bobby called up and then first I had to make sure it was him, right?","You know, told he call back. They do all sorts of things. But Bobby called up and he said, I hope you're gonna run. I said, you know what, Coach, I'm thinking about it seriously. It's a big commitment. We got to make America great again. I watch what's happening. He said, Donald, you've got to run. I said, Coach, I'll tell you what.","Do me a favor give me a number. Let me see what I do. And I'm going to call you. Now what happens is then a couple of months later I announced I'm running. And I come down and we're talking about trade. We're talking about the border. We're talking about all these things that would have never brought up. It would have literally these things never would have even been brought up if I didn't talk about them.","I'm telling you. They weren't -- in fact, when I talked about illegal immigration, it was like for two weeks I was getting just absolutely killed in the press by the dishonest media. By the media that said we have 1,500 people here tonight when we have 6,000, you know. So dishonest. Carl don't be ashamed of yourself.","But but you know what, you know what? I had to do it. And we brought up illegal immigration and we brought up trade. And then you had Paris and then I started talking about the Muslim problem, which is a problem whether you like it or you don't. And nobody else talked about it. And we talk about radical Islamic terrorism.","And we have a president that doesn't want to use the term because he doesn't know what the hell he's doing or maybe he does know what he's doing one or the other. Maybe he does know what he's doing. But in so many ways, he doesn't. But so Bobby calls and I put his number, and then I'm running. And now, all of a sudden, Indiana because usually it's late.","But now, Indiana is becoming very important. And I say, I say -- no, so important in terms of the race. Usually, by this time, it's over and you know it doesn't matter. But this time, you folks belong where you belong. It's called important DeVille, right? I love it. I have so many friends here. So what happens is we're getting ready to thinking about Indiana.","Then we have the big victory last week. We have the huge victory in New York. We get every -- I mean Cruz got almost no votes in New York. He's got to do so -- he would be beaten so badly by Hillary Clinton. He can't win. So these guys do terribly. And then the following week, I get -- win all five in a landslide.","Win them all in a landslide, right? And we're going to win the whole thing. We're gonna beat her in a landslide. All right? Gonna beat her. So one of political guy said to me like two weeks ago. He said, you know, we're going to Indiana and I've spent a lot of time here over the last two weeks. And they said, we're going to Indiana.","I mean if you could get Bobby Knight, would that be possible? I said, possible. I have his phone number on my desk. I said, what a great idea. So I call him up and here's how smart. He goes, I've been waiting for your call. Do you believe that? And then he said, when can we meet? And he's been so incredible.","And he said some things that were really true. He said, for the people of Indiana -- he said, Donald Trump is gonna be a great president. I will. I mean, I'm going to work so hard to be great for you people. I'm gonna work so hard. We're gonna bring jobs back. We're not gonna let Carrier come in and just go to Mexico and there's got to be consequences.","When people want to lay off 1,400 people, go to Mexico and then sell their product back to us, have no tax, have no consequence. Not gonna happen, folks. And that's not only Carrier, that's many of them because we're losing our manufacturing, we're losing our country between what's happening there, what's happening with China, $500 billion trade deficit with China.","$58 billion with Mexico. Trade deficit. A tremendous trade, a deficit tremendous -- astronomical trade deficit with Japan. Everybody. We have a trade deficit with everybody. You could call out a country and I'll tell -- An now they want to make a new deal, Trans-Pacific Partnership, which will be as bad as NAFTA or worse and NAFTA was terrible.","And who approved NAFTA? Kasich. Kasich approved NAFTA when he was a congressman. One of the deciding votes. So here's what happens. So Bobby said and he talk -- I'll tell you what. When he went into that arena and it was a big arena. That was incredible. And he went in and people are screaming and they're crying and they love Bobby.","You know, hey look, he won 900 games, he won three world championships, college championships. Think of it. He won the Olympics. He won the Pan-Am Games. He has the only -- I don't know if you know. I didn't even realize this. I said, how come it hasn't been broken yet? But he has the last undefeated season and he almost had two in a row.","He had one where he lost one game, the one before it. I mean there's a guy, who is a winner. He said, for the people of Indiana, it's an important week because you can absolutely -- you know, if we win. It's over. And then I can focus -- then I don't have to worry about lying Ted Cruz and I don't care if he endorses me or doesn't. I couldn't care less.","But I don't have to worry about lying Ted Cruz. We don't have to worry about Kasich, who's 1 and 44 and that's his home state. And that's because I didn't go that final two days. I stayed in Florida because I wanted to win Florida. And I was given a faulty -- you know, they gave me what's called a dirty poll.","Somebody came out with a pole where I was much closer than I thought in Florida. So I stayed there instead of going to Ohio. If I would have spent two more days in Ohio, we would have won. But I didn't. It's OK. But he's 1 for 44, 45, 46 something, including various other places. So I'm saying, here we have 1 for 44. Now, in the popular vote, I'm millions of votes ahead of Cruz.","Millions. But you know, it's a rigged system. It's totally rigged. This delegate stuff is -- it's dishonest. It's meant for the bosses to be able to keep the special interests happy and the people that give them money so that Mexico and other places where you have big interest, it's -- I'll tell you what.","This system is so sick. In Louisiana, I win Louisiana. I wasn't supposed to. I went there. I campaigned for three days. Massive speeches. We had an airplane hangar bigger than this room, it was packed. I go, I win Louisiana. I say, oh, that was great. Then two three weeks later, they going over the numbers.","It says Trump won Louisiana and I got like hardly any delegates. I said, where are my? I won. What are you talking here. Don't forget, it's only been nine months, folks. I'm figuring it out very fast. And I said, this is got to be a crooked system. You mean, I can win and the guy that comes in third place or fourth place ends up getting more delegates than me? What kind of a system.","And then you learn -- no think of it. No, no, it's a dirty system. I'll tell you what I'm proud of. For 40 or 50 years, however long this has been going on with this crazy delegate system. Nobody has ever complained. Nobody has ever talked about it. You know, I've always heard delegate, delegate. I only realized and then you had in Colorado where they did a poll and it showed Trump was going to win the poll, right?","And they said, we don't want to go and vote. So let's take the vote away from the people and let the bosses pick it. And the bosses are always going to pick a senator, who's under control and takes all these campaign contributions, who borrows money from Goldman Sachs. You know, Cruz borrowed money from Goldman Sachs and Citibank a million dollars at a rate that you would be proud to have, folks.","Nobody in this room would be able to get that low rate. And he forgot to disclose it on his financial disclosure form. He forgot. He forgot. Lying Ted. He said, I forgot. He was -- until 18 months ago, he was a citizen of Canada. He forgot to tell you that. Oh, I didn't know that. Oh, this guy. I mean, give me a break.","But Bobby said and it was so incredible. Bobby Knight said to the people at one of the speeches because he went around with me the day. He said, it will be so great because Donald Trump is going to be a great president, and I appreciated him saying. And the people of Indiana if they vote for him, they're going to put him over the top and we can focus on Hillary Clinton.","It's so good. Nobody could say it like that. Nobody could say it. So I appreciate -- Lou Holtz just called in and Lou Holtz just endorsed us, right? A really good guy. Just put it out. It's all, it's all over the Internet. But Lou Holtz is a really good guy. So we have we have everybody. I mean, we have so many great endorsements.","You know, what was very important to me? 16,500 Border Patrol people endorsed me last week. They've never done it before. And of course, Sheriff Joe, you talk about borders, Sheriff Joe from Arizona endorsed me. That stuff, border stuff. But the 16,500 people have never endorsed a presidential candidate before and they endorsed me. So it was a great honor.","Because we need borders. We need to have a country back. We can't have people walking across our borders. And we have to either have a country or we don't have a country. And you can't have a country if you don't have borders. And on top of that, we have drugs pouring across. You know, when I won New Hampshire, that was my first state that I won.","And when you win something, you have a special feeling. And I won New Hampshire in a landslide. I wasn't supposed to. Jeb was supposed to, Jeb Bush. He raised $168 million in a PAC, super PAC. $168 million. He was favorite to win New Hampshire and I won it in a landslide, OK? So what are you gonna do? I have a much higher level of energy.","What can I say. But no, Jeb Bush -- and I wouldn't say that because you know, once the race is over, I love all these people. When you defeat somebody, we're supposed to love them. Never lose. And I wouldn't say -- but the other day, he was on television saying bad stuff. Although, he did say it was a phenomena.","And he did say he's a gifted politician. I don't understand that. I'm not gifted. But I think when he said he's a very gifted politician. You know, what I think? I think he meant that not as a compliment actually. Being a politician itself, right, is not so great. But I beat Jeb Bush. And think of this, I spent the least amount of money.","He spent the most. I came in first. He came in last year or close. Other people have spent far more money than me. And so far, I've spent, of the major candidates, I've spent the least amount of money, by far, and I'm number one in a landslide, right? Now, now, if you look at education, 30 countries, we're last.","We're like 30th. We're last. So we're last in education. If you look at cost per pupil, we're first. So we -- and by the way, there is no second. Because we spend so much more per pupil that they don't even talk about number two. It's ridiculous. So wouldn't you like -- I mean, think of this. So they have -- we're number -- And by the way, it's Norway, Denmark, Sweden, China, Japan, the five.","When number 30th, OK? But we're first in terms of spending per pupil Now -- and that's bad. That's bad. That's real bad. Now with me, I spent the least and I have the best result. Isn't that what you want for your president, folks? And here's the other thing, I'm self funding. So I'm not controlled by all these people that control Cruz, that control Hillary, Crooked, Crooked Crooked Hillary.","You know, the other day they were talking about crooked Hillary and myself, right? And they said, they said one of her people and one of Obama's people. And they said, who do you think Hillary wants to run against? And the guy said, let me tell you, the one she doesn't want to run against is Donald Trump.","She doesn't know where it's coming. She said a guy like Cruz is cookie cutter. You know, every year it will make Barry Goldwater look like he had a successful campaign. He said, with Trump, they don't know what's gonna happen. They don't know where it's gonna come from. And I'm going to win states like New York, good chance, a state which no Republican would ever campaign in because they have no chance.","You saw it, I won by, two weeks ago, landslide, landslide against two people, against two people. And the dishonest media -- you know when they say about like four or five weeks ago or 10 weeks ago, would have like 12 people. And I'd win a state. I win South Carolina. I win Nevada. I win the South. I won Alabama, Arkansas, Kentucky.","I won them all. I won I won them all. I won Missouri. I won them all. Then I won Florida in a landslide. And they say, he didn't win 50%. I have like 12 people against me. You can't win 50%. I mean, if I'm Abraham Lincoln, I can't get 50%. I got -- they have 17 people. It's the biggest number of people ever to run that anybody can remember ever.","And yet, I'll get like 36 and 38 and 42 and I'd have these characters on television who don't have the brains they were born with, folks, OK? And they're dishonest, OK? And they're dishonest. But they'll say, you now I this victory where I beat everybody by a lot, he did not hit 50%. We got 14 people. Even now, I have three people.","So we have three people. It's hard to break 50% when you have three people. And yet, in New York, I got almost 62%, right? In Pennsylvania, in Pennsylvania, I won every single county. Nobody remembers it ever happening before. In Delaware, the same thing. In Maryland, in every one of them, in Connecticut, I won the rich areas.","I won Greenwich, Connecticut. I won the poor areas. Nobody has ever seen it before. And yet, I'll hear. Oh, perhaps, he should have gotten what -- actually, they didn't really say that. I must be high. Even the bad guy said they were landslides. OK. But they'd always say, always say when we had all these people running, he didn't get 50%. And Jeb would say, oh, he's not a true conservative.","Let me tell you. I am a conservative. They would say, they would say that I'm not conservative because of trade. And on trade, in terms of the definition, I believe in free market. But you can only have free market when you have smart people representing you. And we have dummies representing us. We have real dummies and we have people that are controlled by special interests.","So when you have that, you can throw the free trade out the window, folks, because you see what free trade has gotten. You see what globalization, where we go all over the world to lose money with everybody we deal with because our politicians are corrupt and crooked and they're totally taken care of by campaign contributions.","And by the way, who would know better than me? Do I know the system better than anybody in the world, OK? Anybody in the world. So we have a rigged deal and here's what's gonna happen. So important that tomorrow you get out and you vote. Tomorrow, you got to get out and vote because we have a movement going on. Bill O'Reilly from Fox, who's a tough cookie.","I always sort of say, man, that was tough. These interviews with him, but I like it. But Bill O'Reilly is tough. He said, in his entire life, his entire life, this is the single biggest political phenomena that he has ever witnessed. You. What's happened, the biggest, the biggest. And then I stand here in these packed halls with thousands and thousands, I got to listen to Carl Cameron give us a phony account, OK? But think of it, bill O'Reilly said the single biggest political event, I think that was the word he used, event of his lifetime.","That's a big statement. That's a big statement. That's a guy who's been around. He's a smart guy. But that's a big statement. But many people have said it. We've been -- and it's us. It's all of us together. I'm a messenger. You're tired of making less money than you did 18 years ago and you're working twice as hard.","You're tired of it. I understand that. I understand that. You're tired of seeing Carrier leave your state, go to Mexico, build a plant, put their equipment and sell it like nothing happened. And by the way, the air conditioner is going to cost the same because they have to compete with Crane and all the other companies.","I buy from all of them. I'm not buying from Carrier anymore, by the way. I'm not buying but. But they have to compete with all the other companies. It's gonna be the same. They're going to make more. And you know what, what does it do for us? Think of it. What does it do? So I'm a free trader, but free trade isn't working and we don't have the people that can do free trade because we don't have the smart people.","Now, they want to do -- you know, NAFTA destroyed our -- destroyed large sections of our country. By the way, you take a look at your manufacturing here. It's way -- I mean, look at the numbers, they're like a disaster. NAFTA has been a disaster, right? Disaster. What it's done to New England, what it's done to New York State, what it's done here, what it's done everywhere.","Bill Clinton signed it. Bill Clinton. It was a Clinton deal. Bill Clinton signed it. It's been horrible. Now they want to pass Trans-Pacific Partnership, OK? That will be worse than NAFTA. And we're going to stop him from doing it. We're not going to let them continue. You know, the document, the document is 6,000 pages long.","And I guarantee you every one of those countries that's involved, every single one of them have read every word, every comma, every sentence, every paragraph. And our guys have never even read it. I'll guarantee you that. 6,000 pages, folks. And all it is is another way for other countries to suck the blood out of the United States and we're not gonna let it happen.","And lying Ted Cruz is in favor of it and lying Ted Cruz fought because the single biggest advantage that these companies have is monetary manipulation, where they make it impossible for our companies to compete with them. So our companies end up leaving. It's monetary, it's devaluation of their currency, especially China, which isn't in the TPP.","But they will be because if it works out as well as people think where they rip us off, China will join later on through the backdoor, OK? And they're watching it. I guarantee you. They have top people studying that. They're going to come in through the back door at a later date. But Cruz actually was responsible for making sure that there's no language having to do with devaluation, and that's the biggest thing that they do to beat us. And Cruz and he won't talk about it but he's the one responsible and the senators all know it. I mean if you look at Jeff Sessions.","His all-time most respected senator, the one he most respects senator is Jeff Sessions. And he talked about him all at the beginning. Jeff Sessions is from Alabama. He's a fantastic guy. He endorsed Donald Trump. He endorsed Trump. That was a great endorse. We've had so many. We've had so many. But Jeff Sessions.","But he doesn't want to do anything about Trans-Pacific Partnership. He doesn't want to do anything about the manipulation, about devaluation of currency. And without that folks, we are going to -- you think NAFTA was bad. This will make NAFTA look like a baby. So we got to get in there fast. We've got to knock it out.","And I don't mind making agreements, but we shouldn't make agreements with 12 countries. We should make agreements with one on one, one on one, one one one. And you know what, if they don't treat us right, we pull the agreement. We have this thing where we're all bound up. We've got all -- you've got to see this chart.","This is a chart from hell. Nobody even knows. And I'm telling you, those guys are studying it and we -- nobody from our group has even read the damn agreement, OK? And it's gonna be a disaster and it goes on for many years. I want one on one. If somebody treats us well, we make a trade agreement and I'll have the best negotiators in the world make a fair agreement, OK? I don't want to be tied up. If country A does this and if country C does that, then country D will be able to come to -- Nobody knows what the hell is going on. And the bad countries, countries that haven't treated as well benefit because they get the benefit of what the good countries are getting.","So everybody is taking advantage. It's a disaster. We go one on one with countries. And if they treat us well, we take care of them. And if they treat us badly, we can't get out of this thing. It's like a spider's web. So just remember it. And Cruz wants it. And so thus Kasich, by the way. Cruz wants it. So we're not gonna let it happen, OK. So when I came down the escalator with my wife and -- on June 16th, not long ago, and I brought up all of these things and I thought really at the time it was going to be trade and it was going to be immigration, illegal immigration and we gave a speech.","And pretty much right at the beginning, we went up from -- you know, actually, we went up from -- they wouldn't poll me because they never thought I was gonna run. The press. They never thought I was gonna run. So we went up right almost from the beginning and within a few weeks we were number one, OK? People agreed with what I was saying.","And we've been number one ever since. Every single -- we have been number one ever since. And importantly, I never debated before. I was at center stage for every single debate and I won every single debate according to every poll. Drudge, who's an amazing guy, Drudge and Time magazine and Slate. Every single had been number one that I won every debate.","I never did it before. And you know, Cruz, I heard he was a good debater. I think he's a terrible debater. If -- it's good if you want to hear Shakespeare. You know, I don't wanna hear Shakespeare. See, what -- when he when he debates in high school and college, nobody interrupted him. With me, I interrupted him and he got all lost and what nobody ever did this to me before.","It's called the real world, right folks? It's called the real world. So we won every debate. But importantly, right from the beginning, just about I went to number one and all these characters back there. Well, now he's reached his ceiling. You know, I started off like at six or five or something. And they said, well, he's got five.","That was higher than most, but he's got five. But now he's plateaued. Oh, OK. Next week, I went to like 11. Well, he's at 11. But that's the highest he'll go. He's got a group of about 11% that love him, right? You know, this has been going on for weeks. Then it gets to 14. Then it went to 18. Then went 24. And they kept saying he's plateaued.","I know he's plateaued. You know, these morons like Karl Rove. The guy is a moron. He still thinks -- No, no. No, no. Karl Rove, he still thinks Romney won. Didn't Romney win? I thought Romney. Romney got wiped out. He should have won that election. That was an election that should have been won and I backed him.","And I backed John McCain, a tough one to win because the economy crashed. But I backed McCain. He didn't win. I backed Romney should have won, didn't win. I said this time, we're going to do it ourselves, folks. We're gonna win. We're gonna win. We're gonna win. So a lot of things happened. So I talked about trade.","I talked about illegal immigration. Then you had the killing of Caden in San Francisco, shot in the back by somebody that should have never been allowed in this country. And you had Jamil in California. Jamil, young boy, father became a great friend of mine. That was in San Francisco. Then his father became in Los Angeles area, California and he was killed.","His father is a great guy. His son was taken from illegal immigrant shot through the face three or four times for doing nothing. We're gonna build the wall. And then you had, and then you had the incredible veteran, 65-year-old woman raped, sodomized and killed in California. And this is all over the country.","And folks, we're not gonna take it anymore. We're not gonna take it anymore. We're not taking it anymore. And then polls are coming out where Trump is definitely the best on the border and best on everything. And I mean best on everything, except they didn't like my personality. Who cares about my personality.","I think I'm a nicer person than these people. The only thing I didn't do well on was personality. And by the way, the women's vote -- women, nobody respects women more than I do. I will tell you that. And women are looking for security in our country. And they know what I'm gonna do the best job. Look at Hillary with her call, remember the ad? Who is gonna be awake at 3:00 o'clock in the morning?","Well when they called her on Benghazi, she was sleeping folks. She was sleeping. OK? She was sleeping. Who is gonna be awake? She wasn't awake. So all of a sudden the polls start showing great, and we've been doing amazing. But then you had a thing called Paris, where Paris 130 people killed. Hundreds of people laying in the hospital right now, injured so badly.","Their lives are destroyed. You had people that went in and just boom, boom. Toughest gun laws in the world, Paris and France. Toughest in the world. Bom. Bom. Bom. Just stayed there shooting people, killing people, hurting people, permanently forever. I mean, people are so badly injured, hundreds of them.","Then you had in San Bernardino, you had a radicalized couple come out. They worked for people. They were given a baby shower by the same people they killed a short time later. Bom. Bom. No guns on the other side. Let me tell you. If you had guns on the other side whether it's Paris or San Bernardino or some of the military people that were killed, we have gun free zone, it would have been a whole different story.","It would have been a whole different story, folks. And in fact, it may never have even happened because if these people found out -- if they found out that there were guns in the room, they probably wouldn't have even gotten there, OK? So might have been a completely different scene. So we'll protect our Second Amendment and we're gonna really protect our Second Amendment, OK? And we're going to take care of it and cherish it. Because you know, they're chipping away, they're chipping away at the Second Amendment.","We're not gonna let it happen. So the story is that we're going to take care of our people. We're going to make them We're gonna negotiate deals with people. We want other countries to do well, but it's gonna be America first. We can't do it any other way. When we have $19 trillion, when we have $19 trillion in debt going to $21 trillion because of that horrible budget that was made four months ago, the omnibus budget.","The omnibus, which by the way, funds Obamacare, which funds Syrians coming in that we have no idea where they come from or who they are and they're coming here, which funds illegal immigration and immigrants, illegal immigrants coming in and lots of other things. You know, I always say that Obama is a horrible negotiator except when it comes to negotiating with the Republicans and Congress.","He gets everything it wants. And what happens? And we send these people on and I'm a fan of the Tea Party, which has been maligned over the years, OK? It's just been maligned, but I'm a fan. We send these people and they go and we're gonna get rid of Obamacare. We're good at this. We're going to that. Then they get elected, right?","They go and they look at these beautiful halls and these beautiful ceilings and the marble and the statues and something happens they become lost. And he looks at his wife and he goes, Alice, we finally arrived. And then they vote for everything. That's not happening with me. That's not happening with me, folks.","Not gonna happen. So it's been such an honor and I'm going to try seeing the other two rooms. Maybe I'll bring Carl Cameron with me. But I'm going to try and stop by. But let let me just tell you, it has been such an honor. But hopefully, folks, tomorrow and you'll get every friend you have that can vote, every friend you can have, everybody.","Because here's what's gonna happen, you're going to remember this evening -- thank you. I love you. I love you. Thank you. You gotta remember this evening, and we had a good time with a bad subject. The bad subject country is doing terribly. You know the real job number is 20% or more. It's not 5%. That was put in to make politicians look good.","If you stop looking for a job, you're looking, looking, looking. And you stop looking, they consider you statistically employed, OK? And you have millions of people out there that can't get jobs. We're gonna bring our jobs back to our country and we're not gonna let people leave so easily anymore. So you're gonna remember this night.","But more importantly, you're gonna remember the vote that you cast tomorrow. And you're going to say when you look back in five years, in 20 years and hopefully 50 years, some of the young people -- we have somebody young people. I think I have younger people, I think I've got younger people than Bernie.","By the way, Bernie, Bernie, in all fairness, his system is rigged also only the Republicans rig it in a much more sophisticated way without the superdelegate thing. But Bernie, you know, he wins, he wins, he wins, he wins and you watch these guys, he can't win. But here's what you do, here's what you do. You got a vote.","And we got to keep this movement going. We will make America so great and may be greater than ever before. If we have to suffer though and Cruz will lose in the biggest landslide in history. And Kasich, when he gets hit with a negative ad, I've had 60,000 negative -- it was just reported. 60,000 negative ads.","Cruz has had none. Kasich has had none. When they get hit with their first negative ad, they're over. With me, I think we're immune to it and the ads were wrong. They're totally phony ads. But here's the story, folks. You got to look back in years from now and you got to say it was the single greatest vote I've ever cast.","And here's why. Because our country, our country is going to start winning again. We're gonna win with our military. It's being depleted. We're gonna build up our military and make it stronger, bigger, better than ever before. And we're gonna knock the hell out of ISIS just so you understand. We have no choice.","We have no choice. As part of that, we're gonna take care of our great veterans. Our veterans have been left behind. Very unfair. We're gonna win on education. We're getting rid of Common Core. We're bringing education local. We're gonna win on education. We're gonna repeal Obamacare and we're gonna come up with something that's so much better and less expensive.","We're going to save and protect and cherish our Second Amendment. We're gonna build the wall. We're gonna have Mexico pay for the wall and we're gonna have strong borders and we're going to have people come into our country, but they're going to come in legally, legally. And we are going to make unbelievably good trade deals.","No more stupid deals where our businesses and our money get sucked out of our country. We're going to make great trade deals, done by the greatest people. We have the greatest negotiators in the world right here in this country and we're going to use them. We're not going to use political hacks that don't know what they're doing.","And probably who the hell knows, they're bought off and that's why they're making such bad deals. We're gonna make the greatest trade deals. And you're going to look back and you're going to say, you know what? That's when we started winning again when Trump took over and we're gonna win. We're gonna keep winning.","We're gonna win so much you're going to beg me. Mr. President, please, please. It's too much winning. We can't take it. And I'm gonna say, I don't care. We're gonna keep winning because we're going to make America great again. I love you. Thank you, Indiana. I love you. I love you."],"text":" Wow. This is so, so amazing. I just want to thank you all. So you know we have three rooms like this. And I like this guy. He's a nice guy. I really like him and he's a professional. But the press, they don't get it, folks. So I'm listening to Fox on the way over, and I heard Greta. She said, yeah, they have thousands and thousands of people there. And you know, I don't know if you know it, but we have two other rooms like this outside. You people have the best location. You have the best location. But we love the people in the other two rooms, right? So there are supposed to be 3,000 to 4,000 people in this room. 2,000 and 2,000 in other two rooms. So we have anywhere from 6,000 to 8,000. They don't even know. And Greta said they have thousands. And Carl Cameron, who is a nice guy. He said, no, they only have 1,500 people here. Let me tell you. Let me tell you. Start counting about Carl because we got a lot of people here, Carl. and I'm not referring to Carl. I'm just saying the press is so damn dishonest. They are so unbelievably dishonest. So we have two rooms like this and I have a guy saying 1,500 people. This is not -- this is thousands and thousands of people. And by the way, outside, they have thousands of people that couldn't get into any of the three rooms. So that's his story. What can I tell you. I like to set it straight, right? I want to thank you all for coming. This has been an amazing experience. I know so many people in Indiana. I think we're really doing well. That doesn't mean you don't go vote. You have to go vote tomorrow. But I think we're really doing well. You know, we've caught Ted Cruz in so many lies. We call him lying Ted. He's lying. This guy lies. He's lying Ted. He's lying Ted. Almost worse than the press, almost And I don't know if you heard because the press won't tell you this. But a new poll just came out a few hours ago, the Rasmussen poll, and I'm beating Hillary Clinton and that's good. That's good. We're beating her. And I haven't even started yet. You know, we started with 17 people. And they're all senators and, you know, accomplished people. The senators, governors, tremendous people like Dr. Ben Carson, whos is a great guy, who really did well. And he endorsed me. He's a great guy. And Chris Christie, great guy, who endorsed me and a lot of people. A lot of people are endorsing. A lot of people. But Jerry Falwell Jr. just came. And Jerry Falwell Jr. from Liberty University endorsed me. So many ministers and pastors, and that's why we're winning the evangelical vote and we have been very consistently. We're winning everything. You know -- I don't know if you saw it, but we -- in New York, they did exit polls. We won with women. We won with men. But especially the women made me feel good. The women. We didn't only win with women. We really win with women so -- and we won with highly educated and less than highly educated and the rich and the poor. And we won with everything. We won. And then we then we went to fight. So that was in New York where we got almost every delegate, 95. We got almost all of them. And then we went to five states, great states. We went to Connecticut, right? We went to Maryland. We went to Pennsylvania, Delaware, Rhode Island. We won every single one of them in a landslide and we won every group. It's been amazing. And now the biggie is going to be Indiana because if we win in Indiana, it's over with, folks. It's over with. And then we focus on Hillary Clinton. We focus on it. We then focus on Hillary and that's going to be fun. But remember, we began with 17 and one by one by one, they went off. A governor, a senator, a senator, a governor. They didn't know what the hell happened. But they went out. So now we're down to two and they're hanging by their fingernails. You know, they're up there like this. They're hanging. They're hanging. But it's been unbelievable. I've been here a lot. I have many friends here and they're amazing people. I have met such amazing people. And we've had such incredible crowds. That's why I had to call him. But we had such incredible crowds right up to the end. Look at this room as an example, right into the corners of this big room people and all over and all over. Hello, corner. So it's been an incredible experience. We are going to make America great again. It's going to be America first America first. But we are going to make America. Look at all those hats, whites, reds. We have everything. But we love you. You know, the truth is, at the Trump rallies, it's the safest place you can be because we look out for each other and we look out for everybody. We had won in Costa Mesa California recently 31,000 people. It was unbelievable. And then you read -- you don't read about that. You read about they had some problems outside now. Now, people were burning the American flag. I don't want them burning the American flag. I don't want them burning. Not the people inside. People outside. They're agitators. Many of them are professionals. They're bad people. You don't see that at all. Look, look at this place, you don't see it. We've gone through days. You don't see it. California was unbelievable. A new poll just came out in California where I think I'm leading. 55 to like 20, OK? But I do love that Clinton poll and the other one had me tied, that was last week. But now, we're going up. And by the way, with Hillary Clinton, in a state called Indiana, which we love, that just came out too. That's the Wall Street Journal, I guess, NBC poll. Trump is leading Hillary 48 to 41. We're starting to make -- we're really doing it. And you know the only thing that Cruz could say, you know with his Shakespearean and everything, uh, uh. I can't watch. I love these guys today. They're online. Did you see them? They were all over the news. We want Trump, lying Ted, that's right. Lying Ted. He lies like nobody can lie. But lying Ted, but they were all lying. And they had these guys debating and they were just they know, they get it. They said, you're lying. You're lying. And so many of the things he said. You know, he said the other day, like Mike Tyson, he was very nice. He said on the Internet that I'm supporting Donald Trump. That was it. And I heard all of a sudden, I am campaigning with Mike Tyson as my vice president. And yet Cruz, and who would you rather have, himself and Carly or Donald Trump and Mike Tyson? Say, where did that come? No, I said where did it come. First of all, I'm honored that he endorsed me. But where did it come from? That he said Donald Trump wants to raise your taxes 40%. Now, just so you understand. I have a tax policy and we have a tax plan put in. And I'm giving by far, the biggest tax reduction of anybody running, by far, especially for the middle class and especially for business. We're the highest taxed nation in the world. And the fact is that the one criticism of my tax plan is that I'm giving so much. In other words, my plan is much higher. And yet, you listen to this lying guy, saying Donald Trump wants to raise your taxes 40%. These politicians are really bad. I've been in business. I've never -- I've only done this for nine months and I think I'm doing a good job. Do you agree we're doing a good job? I've done this for nine months and all my life I've been in business. I've competed against business people and done well. I started off with a million dollar loan and I built a net worth over $10 billion, with the greatest assets, with the greatest assets, very low debt, tremendous cash flow. And I only say for one reason because I don't care. I'm not saying it braggadocios. I'm saying that's the kind of thinking we need in our country. We got to bring our country back. We have to bring our country back. The world is ripping us off whether it's China or Mexico or Japan or Vietnam now. It's a new one just killing us. So many. I could name any country. If you name any country, they're beating us. We don't win anymore and we're going to start to win big league, big league. Let me just show you what I do. Let me just show you. So I just had to mention that though and the taxes. So I'm giving you the biggest -- and I hit this guy and I'm saying, oh, would I like to be standing next to him so I could tell the truth. I've never heard -- he also said -- now you've been watching me for a long time. Repeal and replace Obamacare, right? So Cruz gets up today. Cruz gets up, lying Ted. He goes, Donald Trump loves, you know, with a big flourish. I mean, honestly, I don't even think he's a good debater. I've beaten him in every -- according to every single online poll, at every single debate, I've beaten him and I don't debate. I mean, my whole life is a debate but I don't debate. But this guy -- so I talk about Obamacare every spin -- every speech. We're going to repeal it. It's a disaster and replace it with something great. I don't know if you see your premiums are going up so much, right? The premiums are going up 25%, 35%, 45%, 55%. Your deductibles are so high that you're never gonna be able to use it unless you're like close to death. It's a disaster. So every speech I say, we're going to repeal and replace Obamacare. And I hear this guy, Cruz, today, lying Ted. He goes, Donald Trump loves Obamacare. He wants to take Obamacare to the next level. He loves it. I'm saying he's such a liar. And you know, I was given a little bit of shelter when during one of the debates Marco Rubio called him a liar. You are really a liar. So here's a senator calling a senator a liar. So now I feel much better about calling the guy lier. But I've never seen a guy lie like that. I've never seen -- he even said, Donald Trump will not build the wall. He said he's not gonna build the wall, not build the wall, OK? We're going to build the wall. Can you imagine? No, no, can you imagine? We're gonna build the wall. Don't even worry about it. We'll talk about the wall. Don't even -- and I'll tell you, we're gonna build the wall, we're gonna stop drugs from pouring in and poisoning our youth and other people. We are building the wall. But I got this guy, Cruz, lying Ted. Donald Trump has said he is not going to build the wall. I think he's crazy. I -- honestly, I think he's crazy. Lying Ted does not have the temperament to be doing this. He is choking like a dog because he's losing so badly. We have to put him away tomorrow, folks. We got to get out and vote. We've got to get out and vote. We got to get out and vote. So -- thank you darling. Oh. I love her too. Ready? So this is very depressing. It happens all the time. Every place I've gone to, New York state landslide. But I go to different communities and I say to my statisticians, not the most exciting job to be a statistician, but they love it, right? It's their. But I say, give me the statistics on certain areas: Albany, New York, Poughkeepsie, this that. OK. I go through New York, it's horrible. What's happening? The jobs are down 50%. Manufacturing is gone. I mean, it's horrible what's happening in New York State. I go to Pennsylvania. You look at the steel industry -- by the way, look at the steel industry here it's being killed. The steel industry here is being killed. The coal industry is being killed, your industries, your manufacturing. So I said, do me a favor, go up to South Bend. I love South Bend you know why. What school do I love, right? I mean, I have so many friends that love me. They'd like to be right now with me in South Bend for a certain reason. Ready? So South Bend reason -- listen to this. South Bend -- and don't be depressed because we're gonna fix it. And no politician can fix it because they're all bought and controlled by special interests. Remember that. So you know a friend of mine who is very smart, very smart guy. He said to me, you know, Donald, I don't understand. These politicians are really stupid. I said, no, they're not stupid. They're all given so much money for their PACs and for their -- by special interests, by their contributors, by their donors and some are stupid. Many are stupid. Frankly, many don't know what they're doing. Some of these guys that negotiate with China and Mexico and all these big countries where we just die with it with these horrible trade deals. Some of them aren't good. You know, they're political hacks. But I'll tell you what. They're not actually stupid. They're making deals because their special interest groups, their lobbyists, their donors tell them that that's what they want. When I see Carrier air conditioning leaving Indiana for Mexico, there's people that want that to happen. And I've been talking about it since they first tell that. beach I've been talking about that. I know I'd be in Indiana. The coach were great to endorse me, and we've had so many great endorsements. We've had. And Bobby Knight just called -- and Bobby Knight is gonna actually be here tomorrow all day. And I'll tell you, but Bobby Knight was so cool. Because a year ago before I was going to run, you know, I announced like nine or 10 months ago, on June 16th, big day. Not easy to do this. It takes guts to do this stuff. Believe me, folks. I sort of had a nice life. I had a nice company, nice family. Now I call back. I say I'll be home in four days. But I'll tell you what, Bobby Knight called a year ago and he heard I was thinking about running. I never met Bobby Knight. I knew Bobby Knight, winner, smart, tough, which is what we need in our country. And Bobby called up and then first I had to make sure it was him, right? You know, told he call back. They do all sorts of things. But Bobby called up and he said, I hope you're gonna run. I said, you know what, Coach, I'm thinking about it seriously. It's a big commitment. We got to make America great again. I watch what's happening. He said, Donald, you've got to run. I said, Coach, I'll tell you what. Do me a favor give me a number. Let me see what I do. And I'm going to call you. Now what happens is then a couple of months later I announced I'm running. And I come down and we're talking about trade. We're talking about the border. We're talking about all these things that would have never brought up. It would have literally these things never would have even been brought up if I didn't talk about them. I'm telling you. They weren't -- in fact, when I talked about illegal immigration, it was like for two weeks I was getting just absolutely killed in the press by the dishonest media. By the media that said we have 1,500 people here tonight when we have 6,000, you know. So dishonest. Carl don't be ashamed of yourself. But but you know what, you know what? I had to do it. And we brought up illegal immigration and we brought up trade. And then you had Paris and then I started talking about the Muslim problem, which is a problem whether you like it or you don't. And nobody else talked about it. And we talk about radical Islamic terrorism. And we have a president that doesn't want to use the term because he doesn't know what the hell he's doing or maybe he does know what he's doing one or the other. Maybe he does know what he's doing. But in so many ways, he doesn't. But so Bobby calls and I put his number, and then I'm running. And now, all of a sudden, Indiana because usually it's late. But now, Indiana is becoming very important. And I say, I say -- no, so important in terms of the race. Usually, by this time, it's over and you know it doesn't matter. But this time, you folks belong where you belong. It's called important DeVille, right? I love it. I have so many friends here. So what happens is we're getting ready to thinking about Indiana. Then we have the big victory last week. We have the huge victory in New York. We get every -- I mean Cruz got almost no votes in New York. He's got to do so -- he would be beaten so badly by Hillary Clinton. He can't win. So these guys do terribly. And then the following week, I get -- win all five in a landslide. Win them all in a landslide, right? And we're going to win the whole thing. We're gonna beat her in a landslide. All right? Gonna beat her. So one of political guy said to me like two weeks ago. He said, you know, we're going to Indiana and I've spent a lot of time here over the last two weeks. And they said, we're going to Indiana. I mean if you could get Bobby Knight, would that be possible? I said, possible. I have his phone number on my desk. I said, what a great idea. So I call him up and here's how smart. He goes, I've been waiting for your call. Do you believe that? And then he said, when can we meet? And he's been so incredible. And he said some things that were really true. He said, for the people of Indiana -- he said, Donald Trump is gonna be a great president. I will. I mean, I'm going to work so hard to be great for you people. I'm gonna work so hard. We're gonna bring jobs back. We're not gonna let Carrier come in and just go to Mexico and there's got to be consequences. When people want to lay off 1,400 people, go to Mexico and then sell their product back to us, have no tax, have no consequence. Not gonna happen, folks. And that's not only Carrier, that's many of them because we're losing our manufacturing, we're losing our country between what's happening there, what's happening with China, $500 billion trade deficit with China. $58 billion with Mexico. Trade deficit. A tremendous trade, a deficit tremendous -- astronomical trade deficit with Japan. Everybody. We have a trade deficit with everybody. You could call out a country and I'll tell -- An now they want to make a new deal, Trans-Pacific Partnership, which will be as bad as NAFTA or worse and NAFTA was terrible. And who approved NAFTA? Kasich. Kasich approved NAFTA when he was a congressman. One of the deciding votes. So here's what happens. So Bobby said and he talk -- I'll tell you what. When he went into that arena and it was a big arena. That was incredible. And he went in and people are screaming and they're crying and they love Bobby. You know, hey look, he won 900 games, he won three world championships, college championships. Think of it. He won the Olympics. He won the Pan-Am Games. He has the only -- I don't know if you know. I didn't even realize this. I said, how come it hasn't been broken yet? But he has the last undefeated season and he almost had two in a row. He had one where he lost one game, the one before it. I mean there's a guy, who is a winner. He said, for the people of Indiana, it's an important week because you can absolutely -- you know, if we win. It's over. And then I can focus -- then I don't have to worry about lying Ted Cruz and I don't care if he endorses me or doesn't. I couldn't care less. But I don't have to worry about lying Ted Cruz. We don't have to worry about Kasich, who's 1 and 44 and that's his home state. And that's because I didn't go that final two days. I stayed in Florida because I wanted to win Florida. And I was given a faulty -- you know, they gave me what's called a dirty poll. Somebody came out with a pole where I was much closer than I thought in Florida. So I stayed there instead of going to Ohio. If I would have spent two more days in Ohio, we would have won. But I didn't. It's OK. But he's 1 for 44, 45, 46 something, including various other places. So I'm saying, here we have 1 for 44. Now, in the popular vote, I'm millions of votes ahead of Cruz. Millions. But you know, it's a rigged system. It's totally rigged. This delegate stuff is -- it's dishonest. It's meant for the bosses to be able to keep the special interests happy and the people that give them money so that Mexico and other places where you have big interest, it's -- I'll tell you what. This system is so sick. In Louisiana, I win Louisiana. I wasn't supposed to. I went there. I campaigned for three days. Massive speeches. We had an airplane hangar bigger than this room, it was packed. I go, I win Louisiana. I say, oh, that was great. Then two three weeks later, they going over the numbers. It says Trump won Louisiana and I got like hardly any delegates. I said, where are my? I won. What are you talking here. Don't forget, it's only been nine months, folks. I'm figuring it out very fast. And I said, this is got to be a crooked system. You mean, I can win and the guy that comes in third place or fourth place ends up getting more delegates than me? What kind of a system. And then you learn -- no think of it. No, no, it's a dirty system. I'll tell you what I'm proud of. For 40 or 50 years, however long this has been going on with this crazy delegate system. Nobody has ever complained. Nobody has ever talked about it. You know, I've always heard delegate, delegate. I only realized and then you had in Colorado where they did a poll and it showed Trump was going to win the poll, right? And they said, we don't want to go and vote. So let's take the vote away from the people and let the bosses pick it. And the bosses are always going to pick a senator, who's under control and takes all these campaign contributions, who borrows money from Goldman Sachs. You know, Cruz borrowed money from Goldman Sachs and Citibank a million dollars at a rate that you would be proud to have, folks. Nobody in this room would be able to get that low rate. And he forgot to disclose it on his financial disclosure form. He forgot. He forgot. Lying Ted. He said, I forgot. He was -- until 18 months ago, he was a citizen of Canada. He forgot to tell you that. Oh, I didn't know that. Oh, this guy. I mean, give me a break. But Bobby said and it was so incredible. Bobby Knight said to the people at one of the speeches because he went around with me the day. He said, it will be so great because Donald Trump is going to be a great president, and I appreciated him saying. And the people of Indiana if they vote for him, they're going to put him over the top and we can focus on Hillary Clinton. It's so good. Nobody could say it like that. Nobody could say it. So I appreciate -- Lou Holtz just called in and Lou Holtz just endorsed us, right? A really good guy. Just put it out. It's all, it's all over the Internet. But Lou Holtz is a really good guy. So we have we have everybody. I mean, we have so many great endorsements. You know, what was very important to me? 16,500 Border Patrol people endorsed me last week. They've never done it before. And of course, Sheriff Joe, you talk about borders, Sheriff Joe from Arizona endorsed me. That stuff, border stuff. But the 16,500 people have never endorsed a presidential candidate before and they endorsed me. So it was a great honor. Because we need borders. We need to have a country back. We can't have people walking across our borders. And we have to either have a country or we don't have a country. And you can't have a country if you don't have borders. And on top of that, we have drugs pouring across. You know, when I won New Hampshire, that was my first state that I won. And when you win something, you have a special feeling. And I won New Hampshire in a landslide. I wasn't supposed to. Jeb was supposed to, Jeb Bush. He raised $168 million in a PAC, super PAC. $168 million. He was favorite to win New Hampshire and I won it in a landslide, OK? So what are you gonna do? I have a much higher level of energy. What can I say. But no, Jeb Bush -- and I wouldn't say that because you know, once the race is over, I love all these people. When you defeat somebody, we're supposed to love them. Never lose. And I wouldn't say -- but the other day, he was on television saying bad stuff. Although, he did say it was a phenomena. And he did say he's a gifted politician. I don't understand that. I'm not gifted. But I think when he said he's a very gifted politician. You know, what I think? I think he meant that not as a compliment actually. Being a politician itself, right, is not so great. But I beat Jeb Bush. And think of this, I spent the least amount of money. He spent the most. I came in first. He came in last year or close. Other people have spent far more money than me. And so far, I've spent, of the major candidates, I've spent the least amount of money, by far, and I'm number one in a landslide, right? Now, now, if you look at education, 30 countries, we're last. We're like 30th. We're last. So we're last in education. If you look at cost per pupil, we're first. So we -- and by the way, there is no second. Because we spend so much more per pupil that they don't even talk about number two. It's ridiculous. So wouldn't you like -- I mean, think of this. So they have -- we're number -- And by the way, it's Norway, Denmark, Sweden, China, Japan, the five. When number 30th, OK? But we're first in terms of spending per pupil Now -- and that's bad. That's bad. That's real bad. Now with me, I spent the least and I have the best result. Isn't that what you want for your president, folks? And here's the other thing, I'm self funding. So I'm not controlled by all these people that control Cruz, that control Hillary, Crooked, Crooked Crooked Hillary. You know, the other day they were talking about crooked Hillary and myself, right? And they said, they said one of her people and one of Obama's people. And they said, who do you think Hillary wants to run against? And the guy said, let me tell you, the one she doesn't want to run against is Donald Trump. She doesn't know where it's coming. She said a guy like Cruz is cookie cutter. You know, every year it will make Barry Goldwater look like he had a successful campaign. He said, with Trump, they don't know what's gonna happen. They don't know where it's gonna come from. And I'm going to win states like New York, good chance, a state which no Republican would ever campaign in because they have no chance. You saw it, I won by, two weeks ago, landslide, landslide against two people, against two people. And the dishonest media -- you know when they say about like four or five weeks ago or 10 weeks ago, would have like 12 people. And I'd win a state. I win South Carolina. I win Nevada. I win the South. I won Alabama, Arkansas, Kentucky. I won them all. I won I won them all. I won Missouri. I won them all. Then I won Florida in a landslide. And they say, he didn't win 50%. I have like 12 people against me. You can't win 50%. I mean, if I'm Abraham Lincoln, I can't get 50%. I got -- they have 17 people. It's the biggest number of people ever to run that anybody can remember ever. And yet, I'll get like 36 and 38 and 42 and I'd have these characters on television who don't have the brains they were born with, folks, OK? And they're dishonest, OK? And they're dishonest. But they'll say, you now I this victory where I beat everybody by a lot, he did not hit 50%. We got 14 people. Even now, I have three people. So we have three people. It's hard to break 50% when you have three people. And yet, in New York, I got almost 62%, right? In Pennsylvania, in Pennsylvania, I won every single county. Nobody remembers it ever happening before. In Delaware, the same thing. In Maryland, in every one of them, in Connecticut, I won the rich areas. I won Greenwich, Connecticut. I won the poor areas. Nobody has ever seen it before. And yet, I'll hear. Oh, perhaps, he should have gotten what -- actually, they didn't really say that. I must be high. Even the bad guy said they were landslides. OK. But they'd always say, always say when we had all these people running, he didn't get 50%. And Jeb would say, oh, he's not a true conservative. Let me tell you. I am a conservative. They would say, they would say that I'm not conservative because of trade. And on trade, in terms of the definition, I believe in free market. But you can only have free market when you have smart people representing you. And we have dummies representing us. We have real dummies and we have people that are controlled by special interests. So when you have that, you can throw the free trade out the window, folks, because you see what free trade has gotten. You see what globalization, where we go all over the world to lose money with everybody we deal with because our politicians are corrupt and crooked and they're totally taken care of by campaign contributions. And by the way, who would know better than me? Do I know the system better than anybody in the world, OK? Anybody in the world. So we have a rigged deal and here's what's gonna happen. So important that tomorrow you get out and you vote. Tomorrow, you got to get out and vote because we have a movement going on. Bill O'Reilly from Fox, who's a tough cookie. I always sort of say, man, that was tough. These interviews with him, but I like it. But Bill O'Reilly is tough. He said, in his entire life, his entire life, this is the single biggest political phenomena that he has ever witnessed. You. What's happened, the biggest, the biggest. And then I stand here in these packed halls with thousands and thousands, I got to listen to Carl Cameron give us a phony account, OK? But think of it, bill O'Reilly said the single biggest political event, I think that was the word he used, event of his lifetime. That's a big statement. That's a big statement. That's a guy who's been around. He's a smart guy. But that's a big statement. But many people have said it. We've been -- and it's us. It's all of us together. I'm a messenger. You're tired of making less money than you did 18 years ago and you're working twice as hard. You're tired of it. I understand that. I understand that. You're tired of seeing Carrier leave your state, go to Mexico, build a plant, put their equipment and sell it like nothing happened. And by the way, the air conditioner is going to cost the same because they have to compete with Crane and all the other companies. I buy from all of them. I'm not buying from Carrier anymore, by the way. I'm not buying but. But they have to compete with all the other companies. It's gonna be the same. They're going to make more. And you know what, what does it do for us? Think of it. What does it do? So I'm a free trader, but free trade isn't working and we don't have the people that can do free trade because we don't have the smart people. Now, they want to do -- you know, NAFTA destroyed our -- destroyed large sections of our country. By the way, you take a look at your manufacturing here. It's way -- I mean, look at the numbers, they're like a disaster. NAFTA has been a disaster, right? Disaster. What it's done to New England, what it's done to New York State, what it's done here, what it's done everywhere. Bill Clinton signed it. Bill Clinton. It was a Clinton deal. Bill Clinton signed it. It's been horrible. Now they want to pass Trans-Pacific Partnership, OK? That will be worse than NAFTA. And we're going to stop him from doing it. We're not going to let them continue. You know, the document, the document is 6,000 pages long. And I guarantee you every one of those countries that's involved, every single one of them have read every word, every comma, every sentence, every paragraph. And our guys have never even read it. I'll guarantee you that. 6,000 pages, folks. And all it is is another way for other countries to suck the blood out of the United States and we're not gonna let it happen. And lying Ted Cruz is in favor of it and lying Ted Cruz fought because the single biggest advantage that these companies have is monetary manipulation, where they make it impossible for our companies to compete with them. So our companies end up leaving. It's monetary, it's devaluation of their currency, especially China, which isn't in the TPP. But they will be because if it works out as well as people think where they rip us off, China will join later on through the backdoor, OK? And they're watching it. I guarantee you. They have top people studying that. They're going to come in through the back door at a later date. But Cruz actually was responsible for making sure that there's no language having to do with devaluation, and that's the biggest thing that they do to beat us. And Cruz and he won't talk about it but he's the one responsible and the senators all know it. I mean if you look at Jeff Sessions. His all-time most respected senator, the one he most respects senator is Jeff Sessions. And he talked about him all at the beginning. Jeff Sessions is from Alabama. He's a fantastic guy. He endorsed Donald Trump. He endorsed Trump. That was a great endorse. We've had so many. We've had so many. But Jeff Sessions. But he doesn't want to do anything about Trans-Pacific Partnership. He doesn't want to do anything about the manipulation, about devaluation of currency. And without that folks, we are going to -- you think NAFTA was bad. This will make NAFTA look like a baby. So we got to get in there fast. We've got to knock it out. And I don't mind making agreements, but we shouldn't make agreements with 12 countries. We should make agreements with one on one, one on one, one one one. And you know what, if they don't treat us right, we pull the agreement. We have this thing where we're all bound up. We've got all -- you've got to see this chart. This is a chart from hell. Nobody even knows. And I'm telling you, those guys are studying it and we -- nobody from our group has even read the damn agreement, OK? And it's gonna be a disaster and it goes on for many years. I want one on one. If somebody treats us well, we make a trade agreement and I'll have the best negotiators in the world make a fair agreement, OK? I don't want to be tied up. If country A does this and if country C does that, then country D will be able to come to -- Nobody knows what the hell is going on. And the bad countries, countries that haven't treated as well benefit because they get the benefit of what the good countries are getting. So everybody is taking advantage. It's a disaster. We go one on one with countries. And if they treat us well, we take care of them. And if they treat us badly, we can't get out of this thing. It's like a spider's web. So just remember it. And Cruz wants it. And so thus Kasich, by the way. Cruz wants it. So we're not gonna let it happen, OK. So when I came down the escalator with my wife and -- on June 16th, not long ago, and I brought up all of these things and I thought really at the time it was going to be trade and it was going to be immigration, illegal immigration and we gave a speech. And pretty much right at the beginning, we went up from -- you know, actually, we went up from -- they wouldn't poll me because they never thought I was gonna run. The press. They never thought I was gonna run. So we went up right almost from the beginning and within a few weeks we were number one, OK? People agreed with what I was saying. And we've been number one ever since. Every single -- we have been number one ever since. And importantly, I never debated before. I was at center stage for every single debate and I won every single debate according to every poll. Drudge, who's an amazing guy, Drudge and Time magazine and Slate. Every single had been number one that I won every debate. I never did it before. And you know, Cruz, I heard he was a good debater. I think he's a terrible debater. If -- it's good if you want to hear Shakespeare. You know, I don't wanna hear Shakespeare. See, what -- when he when he debates in high school and college, nobody interrupted him. With me, I interrupted him and he got all lost and what nobody ever did this to me before. It's called the real world, right folks? It's called the real world. So we won every debate. But importantly, right from the beginning, just about I went to number one and all these characters back there. Well, now he's reached his ceiling. You know, I started off like at six or five or something. And they said, well, he's got five. That was higher than most, but he's got five. But now he's plateaued. Oh, OK. Next week, I went to like 11. Well, he's at 11. But that's the highest he'll go. He's got a group of about 11% that love him, right? You know, this has been going on for weeks. Then it gets to 14. Then it went to 18. Then went 24. And they kept saying he's plateaued. I know he's plateaued. You know, these morons like Karl Rove. The guy is a moron. He still thinks -- No, no. No, no. Karl Rove, he still thinks Romney won. Didn't Romney win? I thought Romney. Romney got wiped out. He should have won that election. That was an election that should have been won and I backed him. And I backed John McCain, a tough one to win because the economy crashed. But I backed McCain. He didn't win. I backed Romney should have won, didn't win. I said this time, we're going to do it ourselves, folks. We're gonna win. We're gonna win. We're gonna win. So a lot of things happened. So I talked about trade. I talked about illegal immigration. Then you had the killing of Caden in San Francisco, shot in the back by somebody that should have never been allowed in this country. And you had Jamil in California. Jamil, young boy, father became a great friend of mine. That was in San Francisco. Then his father became in Los Angeles area, California and he was killed. His father is a great guy. His son was taken from illegal immigrant shot through the face three or four times for doing nothing. We're gonna build the wall. And then you had, and then you had the incredible veteran, 65-year-old woman raped, sodomized and killed in California. And this is all over the country. And folks, we're not gonna take it anymore. We're not gonna take it anymore. We're not taking it anymore. And then polls are coming out where Trump is definitely the best on the border and best on everything. And I mean best on everything, except they didn't like my personality. Who cares about my personality. I think I'm a nicer person than these people. The only thing I didn't do well on was personality. And by the way, the women's vote -- women, nobody respects women more than I do. I will tell you that. And women are looking for security in our country. And they know what I'm gonna do the best job. Look at Hillary with her call, remember the ad? Who is gonna be awake at 3:00 o'clock in the morning? Well when they called her on Benghazi, she was sleeping folks. She was sleeping. OK? She was sleeping. Who is gonna be awake? She wasn't awake. So all of a sudden the polls start showing great, and we've been doing amazing. But then you had a thing called Paris, where Paris 130 people killed. Hundreds of people laying in the hospital right now, injured so badly. Their lives are destroyed. You had people that went in and just boom, boom. Toughest gun laws in the world, Paris and France. Toughest in the world. Bom. Bom. Bom. Just stayed there shooting people, killing people, hurting people, permanently forever. I mean, people are so badly injured, hundreds of them. Then you had in San Bernardino, you had a radicalized couple come out. They worked for people. They were given a baby shower by the same people they killed a short time later. Bom. Bom. No guns on the other side. Let me tell you. If you had guns on the other side whether it's Paris or San Bernardino or some of the military people that were killed, we have gun free zone, it would have been a whole different story. It would have been a whole different story, folks. And in fact, it may never have even happened because if these people found out -- if they found out that there were guns in the room, they probably wouldn't have even gotten there, OK? So might have been a completely different scene. So we'll protect our Second Amendment and we're gonna really protect our Second Amendment, OK? And we're going to take care of it and cherish it. Because you know, they're chipping away, they're chipping away at the Second Amendment. We're not gonna let it happen. So the story is that we're going to take care of our people. We're going to make them We're gonna negotiate deals with people. We want other countries to do well, but it's gonna be America first. We can't do it any other way. When we have $19 trillion, when we have $19 trillion in debt going to $21 trillion because of that horrible budget that was made four months ago, the omnibus budget. The omnibus, which by the way, funds Obamacare, which funds Syrians coming in that we have no idea where they come from or who they are and they're coming here, which funds illegal immigration and immigrants, illegal immigrants coming in and lots of other things. You know, I always say that Obama is a horrible negotiator except when it comes to negotiating with the Republicans and Congress. He gets everything it wants. And what happens? And we send these people on and I'm a fan of the Tea Party, which has been maligned over the years, OK? It's just been maligned, but I'm a fan. We send these people and they go and we're gonna get rid of Obamacare. We're good at this. We're going to that. Then they get elected, right? They go and they look at these beautiful halls and these beautiful ceilings and the marble and the statues and something happens they become lost. And he looks at his wife and he goes, Alice, we finally arrived. And then they vote for everything. That's not happening with me. That's not happening with me, folks. Not gonna happen. So it's been such an honor and I'm going to try seeing the other two rooms. Maybe I'll bring Carl Cameron with me. But I'm going to try and stop by. But let let me just tell you, it has been such an honor. But hopefully, folks, tomorrow and you'll get every friend you have that can vote, every friend you can have, everybody. Because here's what's gonna happen, you're going to remember this evening -- thank you. I love you. I love you. Thank you. You gotta remember this evening, and we had a good time with a bad subject. The bad subject country is doing terribly. You know the real job number is 20% or more. It's not 5%. That was put in to make politicians look good. If you stop looking for a job, you're looking, looking, looking. And you stop looking, they consider you statistically employed, OK? And you have millions of people out there that can't get jobs. We're gonna bring our jobs back to our country and we're not gonna let people leave so easily anymore. So you're gonna remember this night. But more importantly, you're gonna remember the vote that you cast tomorrow. And you're going to say when you look back in five years, in 20 years and hopefully 50 years, some of the young people -- we have somebody young people. I think I have younger people, I think I've got younger people than Bernie. By the way, Bernie, Bernie, in all fairness, his system is rigged also only the Republicans rig it in a much more sophisticated way without the superdelegate thing. But Bernie, you know, he wins, he wins, he wins, he wins and you watch these guys, he can't win. But here's what you do, here's what you do. You got a vote. And we got to keep this movement going. We will make America so great and may be greater than ever before. If we have to suffer though and Cruz will lose in the biggest landslide in history. And Kasich, when he gets hit with a negative ad, I've had 60,000 negative -- it was just reported. 60,000 negative ads. Cruz has had none. Kasich has had none. When they get hit with their first negative ad, they're over. With me, I think we're immune to it and the ads were wrong. They're totally phony ads. But here's the story, folks. You got to look back in years from now and you got to say it was the single greatest vote I've ever cast. And here's why. Because our country, our country is going to start winning again. We're gonna win with our military. It's being depleted. We're gonna build up our military and make it stronger, bigger, better than ever before. And we're gonna knock the hell out of ISIS just so you understand. We have no choice. We have no choice. As part of that, we're gonna take care of our great veterans. Our veterans have been left behind. Very unfair. We're gonna win on education. We're getting rid of Common Core. We're bringing education local. We're gonna win on education. We're gonna repeal Obamacare and we're gonna come up with something that's so much better and less expensive. We're going to save and protect and cherish our Second Amendment. We're gonna build the wall. We're gonna have Mexico pay for the wall and we're gonna have strong borders and we're going to have people come into our country, but they're going to come in legally, legally. And we are going to make unbelievably good trade deals. No more stupid deals where our businesses and our money get sucked out of our country. We're going to make great trade deals, done by the greatest people. We have the greatest negotiators in the world right here in this country and we're going to use them. We're not going to use political hacks that don't know what they're doing. And probably who the hell knows, they're bought off and that's why they're making such bad deals. We're gonna make the greatest trade deals. And you're going to look back and you're going to say, you know what? That's when we started winning again when Trump took over and we're gonna win. We're gonna keep winning. We're gonna win so much you're going to beg me. Mr. President, please, please. It's too much winning. We can't take it. And I'm gonna say, I don't care. We're gonna keep winning because we're going to make America great again. I love you. Thank you, Indiana. I love you. I love you."}