{"id":392,"author":"Donald Trump","title":"Speech: Donald Trump in Burlingame, CA","date":"2016-04-29","link":"https://factba.se/transcript/donald-trump-speech-burlingame-ca-april-29-2016","paragraphs":["So nice. That was not the easiest entrance I've ever made. My wife called, she said there are helicopters following you and we did and then we went under a fence and through a fence and oh boy, I felt like I was crossing the border, actually, right? It's cool. I was crossing the border. But I got here. They said, \"Mr. Trump, would be really much easier, sir, if you just didn't speak today and just left and go back immediately to Indiana.\" and they said, \"You know, we can't let these people down.\" Right?","Do we agree? We can't do it. Oh, but I appreciate it. But it was fun. It was a little different that was a different kind of a thing. So here's the Washington Post today: The time has come to admit that Republican voters want Donald Trump as their nominee. You see that? Chris, good writer, good writer. That's pretty good.","So you know where we're making amazing progress all over. It's -- it's been incredible last night as you know we had 31,000 people. It was -- And by the way, no protesters inside. There's a protester this morning but there were no protesters inside. But we have 31,000 people and it was just like rockin and everybody loved it. Was anybody there last night?","It was -- It was so incredible. We're pretty far away but I'll tell you what, it was -- it was just an incredible evening. So what's happened is we started this journey on June 16th and it was all about trade because we make the worst trade deals probably ever in the history of any country. And then it got down to other things that I talked about.","I talked about illegal immigration, which was a very important subject and has been. And because of the fact that I brought it up, now people are talking about it now. They don't talk about it the way I do. We got last week, as you know, the Border Patrol of 16,500 agents -- Border Patrol agents who are phenomenal people, who want to do their jobs, they are told to stand back, stand back.","They're standing there, these great looking people, strong and shape, all of the best equipment, and they're told to stand back. Just let everybody come right through the border and they endorsed me, 16,500. They've never endorsed a presidential candidate. And then Sheriff Joe, as you know, from Arizona endorsed Trump.","And he knows he knows what he's doing. He really knows. But we have had so many incredible endorsements and now they're coming and I'll tell you, over the last two weeks, and it took place really even before that. But people see what's happening because we have far more votes than anybody else far more delegates than anybody else and we're going to hit that number, I think, quite easily.","Because, you know, I watch and I watch the very dishonest media and they say, \"Oh Cruz, is getting de -- \" he's not getting delegates. He's -- he's getting delegates. He's getting second, third, fourth, fifth round. He's not going to be there because we're going to win it in the first round. We don't even compete for him.","I mean, we're so far. As of today we have 1,001. We just broke the thousand mark. OK. And we did fight hard actually in Pennsylvania, because in Pennsylvania I won in a landslide. We got, I guess, over 60% of the vote. And that's pretty hard when you have three people running. You know, when you get 60% with two people, you win in a landslide.","Right? That's called a landslide. When you have three people and you get practically 60% and then in the other states, you know, we had five and we did unbelievable numbers up to 66%. And it's been amazing. We had Rhode Island, and we had Delaware, and Connecticut, and Maryland, Pennsylvania, and we did great.","But Pennsylvania had a little thing that if you win you get 17. So I got the 17, and the rest, you have to fight for. I said, \"What kind of a deal is this?\" In other words, you have to take him out to dinner and there's a wonderful hotel. I'm sure your lunch is good but they don't take a beer. They take him to very fancy restaurants they bring them to hotels, perhaps they put them on yachts and take them for a cruise.","They basically have to bribe the delegates. And it's not the right system. You know we have a system where it's like democracy where it's supposed to be voting and it's terrible. And fortunately, we have a great Republican leader in -- in Pennsylvania. He's -- he's a really fair guy and and really, really something.","And there's also a moral clause that you know what -- and I've heard this for a couple of years with the delegates in Pennsylvania, if you win there is a moral obligation that you're supposed to vote for the one who wins, which sort of makes sense, right? And you know I refuse to say in this room because I say it outside and I get standing ovations.","But this is a room I won't do it. But it's a rigged system. It's a rigged system. OK. It's a horrible, horrible, disgusting system. And you know, I see this Bernie Sanders, I'm not a fan of Bernie Sanders, by the way, but I see that he's, you know, wins a lot, wins a lot. He never has a chance of winning.","He's had a streak where he won about 10 in a row and every time you'd watch the pundits he'd say, \"Oh, yeah win.\" he's done. You know, he's way behind because they have a thing called superdelegates. Well ours is more sophisticated because you don't know how badly rigged it is. OK. With a superdelegate it's obvious, you know they had to all these superdelegates.","And by the way, do I look forward to beating her. Do we look forward to winning? Do we look forward to winning? I mean, if she, you know, if she's allowed to -- if she's allowed to run that's a big question. We'll see Bill. I personally think she's being protected by the Democrats and she'll be allowed to run.","But we'll see what happens. So what we've done is we've really, I mean, we won New York with 60 almost 62% of the vote, which was unprecedented and got almost 100% of the delegates. Ninety five delegates we got them almost all. And then the next week we had the five and we won them all in landslides and actually a lying Ted, you know, do we -- I think we have a couple of fans, but lying Ted did not do too well in New York, folks.","You know he ran. He's hovering around the 10% mark. You got to do better than that if you're going to collect all these delegates on the second ballot. How would you like to be in a position where you're in we're in Cleveland and we're having the whole deal and it's going fine, and for some reason -- and don't worry about it, we get it, I think we have it easily, but for some reason it goes to a second ballot and somebody on the second ballot because they wine and dine delegates who has five million less votes?","Because by the time we finish, and we're scheduled to do very well in California, I guess you've seen it but really well, really well. Last fall -- I so -- I'm at 49%, which is great. And there's a lot of like 20s and a 19 or something. But we're doing well. I don't want even say it because you got to go out of work especially by people sitting in this section.","They've got to work. Why don't we just pretend we're tired. OK. And that is the problem and I've seen it. I've always -- all my life I've dealt with politicians and somebody will come into my office, the best politicians that come into my office and they sit down and I say, \"How are you doing?\" \"I'm tired.\" And they always says, \"I'm tired.\" And then he'll win by 25 points.","But he says he has to motivate himself by saying he's tired even sometimes says, \"I'm losing Donald but I'm going to win.\" But we have picked up so many votes over the last period of time. And in fact, I was just watching the networks today and they have a chart that, I think it's already happened, but in the history of primaries, Republican primaries, I've gotten the most votes in the history of the Republican Party.","Right? And we haven't even hit some of the big we haven't even hit some of the big states yet, which is sort of an amazing thing. So. So we're really on a path that's incredible. And yesterday, I thought Ted did something which was really quite good. It was record setting. It's never happened before in the history of politics.","He has no path to victory. It's impossible for him to win with the votes. The only way he can possibly win is if things go terribly wrong and he goes through the back door and he bought all of these delegates and I will never use the word bribe, I would never use a word like bribe. So if he bribe the delegates, ut I don't call bribe.","But -- And then think of this, think of you're the RNC and Ryan, who's a good man, by the way. And Jim is a good man. Did Jim do a good job? Where's Jim? Where is Jim? He did such a great job. You know, he called me, he said, \"Mr Trump, would you do me a favor would you take maybe 10, 15 pictures?\" I said, \"Absolutely, Jim.\" So I'm just coming through dirt and mud and under fences.","So you all walk through the lobby, I go under fences, I'm coming through. I'm looking at myself I'm trying to get all the dust and everything off. And the 20 people that he told me about, turned out to be about what six, 700 people, my hand, I'm shaking hands, taking pictures, shaking hands. So that's why he's a great leader.","Right, Jim? Get going. I -- I hope they paid a lot of money, Jim. But no, in the history of the Republican Party, there's never been anything like this. And then what Ted did -- And yesterday in Indiana, which is an incredible place with incredible people, Bobby Knight, the great Bobby Knight, endorsed me. How -- how good is that?","And he's gonna be with me all Sunday and Monday and we're -- we are having a good time. He's some guy, he's a winner. You know that's what we need now. We need winners. We have to win. A country is a winner anymore. And we have to win. We have to win. But Cruz did something that I've never seen because he picked a vice-presidential person.","Carly. He picked Carly, who -- and I like Carly. But you know when she left she had no votes. Was she one? Jim, was she one or was she zero? But she had no votes. And you know what, maybe it's a good move. Who knows? I'll let you know in about a month. All right. I don't think so. But the worst move was making a deal with Kasich.","So they make this deal. I get a call two days ago from a number of people and we have to do a PR statements, it's 11:45 in the evening. They said, \"Oh, Mr. Trump, what happened?\" They merged, two, Kasich and Cruz. I said, \"They did?\" I said, \"That's a good thing.\" It shows total weakness. It shows illegal collusion you know in business you get put in jail.","Politics, you can do anything you want. Right? I said but it shows such ineptitude and such weakness. And what's the deal? The deal is that Cruz will take Indiana and Kasich and now he's sitting there eating, you know, he's eating. Doing a news conference and piling pancakes into his mouth. I never saw anything like it. My son said, my little boy, Barron.","He said, \"Daddy that that's disgusting.\" I never saw a man eat like that. I've never seen a man eat while he's doing a news conference. Did you ever see him do a news conference without eating. So these two guys formed an alliance because -- think of it, I've been doing this for nine months. I'm so honored and you have these two politicians they've been doing it sort of all their lives, right.","I mean, Kasich approved NAFTA, which by the way, emptied out your state. I hate to tell you. Emptied out every state. But Kasich and Cruz is fine with the Chinese money manipulation. He's going to allow that to happen. Can't do that because that's how they're killing us. Devaluation of their money and their currency is killing, absolutely killing, this country.","Not only China but many other places. You can't allow it. He wants to allow it. So there are a lot of things going on. Now you -- why -- You want to know why he wants to allow it? Just ask the donors, ask the special interests, ask the people, because believe me, I've seen deals that are made and these deals are -- The -- The politicians are very smart, you'd be amazed, but a lot of people ask me, \"How come they do these things?\" And it's largely because of the donors and the special interests.","And I'm still funding my campaign so that's a big, big difference. OK. Nobody's gonna tell me what to do. But they form this alliance and already, like the next morning, it's formed. Everyone is talking. Big deal. They formed. They formed it to be the guy that's been a politician for nine months. OK. Me. And after it's formed, it's all done, and Kasich announces, \"No.\" I want people in Indiana to vote for me. That wasn't supposed to be the deal they were supposed to vote for Cruz here and in Oregon, which by the way, a poll just came in, I'm killing everybody in Oregon.","I'm killing it, which is an amazing place. But in a couple of other places that's Kasich. So you know, they're work in the system. That's what I said it's rigged, right, rigged. So they work in the system and about 10 hours goes by and Kasich announces, essentially he's not doing the deal and then Cruz today said, \"No, it's no good.\" These are politicians, folks, they can't make a deal.","How are they going to deal with China? How are they going to do it? So. So we have now a big -- I think a big moment coming up in Indiana and we feel very good about it. We'll see. I mean because I think -- I think that deal with such a disaster. As soon as I heard it I said, \"That's the end of them. Both of them.\" And Kasich has won -- he's won for 48 or 42. Doesn't matter when you at the -- whether it's 40, I guess it's 42. But he's -- that includes Ireland's but he's one for forty two.","And if you think about it, Dr. Ben Carson, who's an incredible guy, who endorsed me, by the way, was doing much better. Ben was doing much better than Kasich and if you think about it, Chris Christie was doing better. Marco Rubio, has more delegates right now, and he left a month ago. And he still has more delegates and others, others.","These people could have hung in for a much longer period of time and who knows. I mean, you know based on this theory it's a little like a spoiled child, \"I don't care mom, I'm staying here. I'm not leaving.\" No. It's -- it's like ridiculous what's going on. So bottom line is he is staying in, which some people say is good for me. I actually would rather have him get out.","But Cruz will then have to get out also because he doesn't have, you know, doesn't have the votes. So it's coming to an end. I think it's going to come to an end very soon and really and I speak to the people in this room because there has to be unity in our party. There has to be unity in our party. And if they're not it's going to be -- If there's -- if there's not unity.","And I mean, really, good solidarity, unity, relationship, friendship. We have people like Jim, where they do such a good job all over the country, we have some great people, but there should be and there has to be unity. Now with that being said, would I win, can I win without it? I think so, to be honest.","I think so, because they're going to vote for me. They're not voting for, you know, Jeb Bush didn't support you. Big deal. Like I care. OK. No. I heard him on television yesterday. Low energy, very low energy. But I -- No, I heard him on te -- I wouldn't say this but I saw him on one of the shows yesterday.","I did not consider him a conservative. Folks, I'm a conservative but at this point who cares we got to straighten out the country. I mean, give me a break. And a couple of the shows were saying that today. I mean, look, I am a conservative I'm very conservative on a lot of things and I'm actually very conservative on trade.","A lot of the conservatives, you know, the geniuses that -- that they have absolutely, you know, they have high IQ and no brain power. They sit back and they say free trade, I say free trade too, I love free trade. The problem is our leaders are not smart people or our leaders are taken care of by the special interests, their lobbyists, you know, all the people with the money, the campaign people and we're not making good deals.","And when you have China with a 500-billion-dollar-a year trade deficit and when you have Mexico with a trade deficit of $58 billion, I say by the way, we'll build a wall. The wall is going to cost $10 billion. It's really easy to figure when we have a trade deficit with Mexico of $58 billion, it's really, really easy to figure that out.","And when I get off the debate stage a couple of months ago, one of the folks came up they said, \"You're not really going to build a wall.\" I said, \"Actually, it's real easy.\" And I always talk about, you know, I always build a wall. I always talk about China, 2,000 years ago they built a wall that's 13,000 miles long.","We have a wall. Well we actually need is 2,000 miles, but we actually only need because of natural barriers. We only need a thousand miles. So they -- 2,000 years ago they could do 13,000 today we can't do a thousand. So he says, \"You can't build a wall.\" It's so easy. Oh, I can just see that beautiful pre-cast plank.","Well good solid foundations. Nice and high. Make the ceiling look like a little low ceiling, boy. If anybody gets up there they're going to say, \"Man, how do we get down?\" See the way they go over our little fences. These guys are amazing. They climb over it like it's not even there. They go through it over it. They go. Not gonna happen with this one with what we're going to do, but we have to do it. And by the way, we want people to come into our country but they have to come in legally, folks, otherwise we don't have a country.","We don't have a country. So -- So we have to get together as a party because it's a tougher road, the presidency for the Republicans. I don't know if people talk about this but it really is, it's a tougher road for a Republican than it is for a Democrat. The road is tougher. It's -- it's not as easy. And you really have to pick somebody that knows what's happening.","That's really, really good. I accept the position. Now I'm on it. And I'll bring things into play that nobody else is going to bring. As an example, New York is big. I want it with landslide numbers I beat everybody by what? Thirty-eight points or something like that, the second place and much more than that.","Let's see if Cruz got like 12 and if I got 62. Does that mean I beat him by like 50 points? And then he's going to run and represent us because he got those delegates to go on this second, give me a break. So here's the thing, here's the thing. We bring new york into play now. Now, in New York no Republican, if I -- except for me. No Republican will go to New York to campaign.","OK. No Republican will go to Michigan to campaign. Republicans will never beat Hillary in Florida. I will. You saw I won Florida in a landslide. I'll win Pennsylvania. Most Republicans will never win Penn -- probably, I don't think any Republican can win Pennsylvania. So I'm going -- And this is, you know, they covered this and now by the way the polls are coming out where I'm leading or even with Hillary, you know, hey, I had it -- and I wrote this.","Look. I had this -- listen to this. Fifty five thousand negative ads as if two months ago now it's up to exactly 60,000 negative ads. And then I watched like Kasich goes, \"He does great again.\" He didn't have one ad. Give him about four ads and he goes down . OK. OK. Same thing with Cruz but now the polls are coming out where I'm even.","You saw them, they're all down. Even one has me up but even I don't want to even be up right now. It's just going to be I just look so forward to doing it. You know I started -- I started with 17 people, right, 17, who were actually 18 if you include Gilmore. Did anybody get that? So let's say there were 18. I mean, they were.","So we had 18 people we had 17 people that I had to beat one by one, And when I first came in they said, \"You know the geniuses back here, brilliant guys they get paid for knowing nothing.\" So -- So what happens, they'd say, Krauthammer, \"He won't run.\" How about this Karl Rove. Is he the dumbest human being on earth?","He still thinks Romney won the election. I'm telling you. Romney won. Remember him? No, no, Romney won. He's 5 million votes behind. He's gonna make a comeback. But we're up to 98%. No, no, Romney won. These are the people. You got to go -- You got to go a different way, folks, because these people are leading you right into the middle of a very bad bad desert and we're going to win.","But the truth is we're going to win in a way that nobody's seen before. We're going to win so strong we're going to be so strong we're gonna be so smart. Again, ideally we're gonna be together. I think I will win even if we're not together. I mean, there are some people I honestly don't want their endorsement, I just don't want it. You know I've watched all my life as a politician.","They just -- just kill each other, right? I must say the worst things about each other. They say things that you could never say and recover and one loses, one wins, and then they say at the end, right. You know . Well, I want to congratulate Jimmy Renick, a brilliant campaign and I won -- I will be behind him 100%. He's a great person a great man.","And I said to myself, they were saying the worst things. Well, things get said. Here's the difference like -- like with Ted Cruz, he's a wonderful guy. I don't want to. I mean, if he wants to address me, that's fine but I don't care. Does that make sense to you? A guy like Bush. I watched him yesterday on television.","Li -- You know, knocking me. Does he want to endorse me? Who knows? I don't care. It's not gonna have any impact on whether or not we beat Hillary Clinton. It's gonna going to have any impact. But most of the party has to come together and the smart people in the party have to come together and we have smart people.","We have really smart people. So we're going to hopefully close this thing out fairly soon. I think that you know now that we cracked the 1,000 number, which is great, right? No, it's great. You know, it's interesting though. I'm up by 400 or so delegates. I'll be up by more than 500 when it's over and we'll be up by five million votes.","OK. And we're gonna break this -- this coming week we break the all time record and we'll break the all time record by probably four million votes. I mean, it's nobody's ever seen anything like this it's a movement. It's a great movement. Many, many people have come onto the Republican side. Many, many people.","It's something that they're talking about all over the world. I've been on the cover of Time magazine numerous times this year all because of the move -- Not me. It's because of the movement and what's going to happen is going to be so special. We have to come together. We have to pick our nominee. We have to go out and do what we have to do. And I'm telling you, you are going to have an unbelievably good result in November.","I started with 17 people, governors, senators, people of accomplishment, some people of great accomplishment and every week bom, bom, bom. And believe me, I knocked them off. I knocked them off. And every week, boom, we're down to 16, we're down to 14, we're down to 12, we're down to 11. And then I'd get eleven people and I'd win a state and I'd have 37% of the vote with 11 people and these morons would say, \"But he didn't break 50.\" How the hell do you break 50 when you have 11 people and they're governors and senators?","And now I'm breaking 50 by -- I mean -- You know what? I probably would have had 80 if you gave me the most popular guy out of the 11 or 14 that are left. Give me the most popular person and I probably would have at 80 20. But you can't do it when you have that many people. So now even though we have three we're into the 60s that's that's sort of an amazing number.","But I just want to tell you, you people have been fantastic. On June 7th, you have a big, big day because the world is going to be watching. The world is watching pretty much every Tuesday but -- and this next Tuesday in Indiana, where I'm going now, it's gonna be a biggie. But I will tell you -- and those people are incredible people and they want to see, really, they want to see something that's going to be -- they want to see victory.","They want to see Bobby Knight. You know they want to see victory. And that's why we're so great getting his endorsement because I love people that win and we're going to start winning again. We don't win anymore. And by the way I can add something the Republican Party in a presidential sense doesn't win anymore.","You pick your standard cookie cutters. I can tell you already, just give me the name of the person and I'll tell you exactly what state she's going to win and what state she's going to lose. I'm different because I'm going to win states that nobody else can. And when I can focus on Hillary, as I say, Crooked Hillary, when I focus on Hillary, she'll go down easier than any of the people we just beat.","So I just want to thank everybody. I know they're waiting, they're going to take me under a fence through a field. Oh, you have no idea of the route they have planned for me to get out of here. But I love you, folks. And Jim I want to thank you and Joel and everybody. I want to thank you all. Thank you, folks. Go out. Remember June 7. Thank you, everybody. Thank you."],"text":" So nice. That was not the easiest entrance I've ever made. My wife called, she said there are helicopters following you and we did and then we went under a fence and through a fence and oh boy, I felt like I was crossing the border, actually, right? It's cool. I was crossing the border. But I got here. They said, \"Mr. Trump, would be really much easier, sir, if you just didn't speak today and just left and go back immediately to Indiana.\" and they said, \"You know, we can't let these people down.\" Right? Do we agree? We can't do it. Oh, but I appreciate it. But it was fun. It was a little different that was a different kind of a thing. So here's the Washington Post today: The time has come to admit that Republican voters want Donald Trump as their nominee. You see that? Chris, good writer, good writer. That's pretty good. So you know where we're making amazing progress all over. It's -- it's been incredible last night as you know we had 31,000 people. It was -- And by the way, no protesters inside. There's a protester this morning but there were no protesters inside. But we have 31,000 people and it was just like rockin and everybody loved it. Was anybody there last night? It was -- It was so incredible. We're pretty far away but I'll tell you what, it was -- it was just an incredible evening. So what's happened is we started this journey on June 16th and it was all about trade because we make the worst trade deals probably ever in the history of any country. And then it got down to other things that I talked about. I talked about illegal immigration, which was a very important subject and has been. And because of the fact that I brought it up, now people are talking about it now. They don't talk about it the way I do. We got last week, as you know, the Border Patrol of 16,500 agents -- Border Patrol agents who are phenomenal people, who want to do their jobs, they are told to stand back, stand back. They're standing there, these great looking people, strong and shape, all of the best equipment, and they're told to stand back. Just let everybody come right through the border and they endorsed me, 16,500. They've never endorsed a presidential candidate. And then Sheriff Joe, as you know, from Arizona endorsed Trump. And he knows he knows what he's doing. He really knows. But we have had so many incredible endorsements and now they're coming and I'll tell you, over the last two weeks, and it took place really even before that. But people see what's happening because we have far more votes than anybody else far more delegates than anybody else and we're going to hit that number, I think, quite easily. Because, you know, I watch and I watch the very dishonest media and they say, \"Oh Cruz, is getting de -- \" he's not getting delegates. He's -- he's getting delegates. He's getting second, third, fourth, fifth round. He's not going to be there because we're going to win it in the first round. We don't even compete for him. I mean, we're so far. As of today we have 1,001. We just broke the thousand mark. OK. And we did fight hard actually in Pennsylvania, because in Pennsylvania I won in a landslide. We got, I guess, over 60% of the vote. And that's pretty hard when you have three people running. You know, when you get 60% with two people, you win in a landslide. Right? That's called a landslide. When you have three people and you get practically 60% and then in the other states, you know, we had five and we did unbelievable numbers up to 66%. And it's been amazing. We had Rhode Island, and we had Delaware, and Connecticut, and Maryland, Pennsylvania, and we did great. But Pennsylvania had a little thing that if you win you get 17. So I got the 17, and the rest, you have to fight for. I said, \"What kind of a deal is this?\" In other words, you have to take him out to dinner and there's a wonderful hotel. I'm sure your lunch is good but they don't take a beer. They take him to very fancy restaurants they bring them to hotels, perhaps they put them on yachts and take them for a cruise. They basically have to bribe the delegates. And it's not the right system. You know we have a system where it's like democracy where it's supposed to be voting and it's terrible. And fortunately, we have a great Republican leader in -- in Pennsylvania. He's -- he's a really fair guy and and really, really something. And there's also a moral clause that you know what -- and I've heard this for a couple of years with the delegates in Pennsylvania, if you win there is a moral obligation that you're supposed to vote for the one who wins, which sort of makes sense, right? And you know I refuse to say in this room because I say it outside and I get standing ovations. But this is a room I won't do it. But it's a rigged system. It's a rigged system. OK. It's a horrible, horrible, disgusting system. And you know, I see this Bernie Sanders, I'm not a fan of Bernie Sanders, by the way, but I see that he's, you know, wins a lot, wins a lot. He never has a chance of winning. He's had a streak where he won about 10 in a row and every time you'd watch the pundits he'd say, \"Oh, yeah win.\" he's done. You know, he's way behind because they have a thing called superdelegates. Well ours is more sophisticated because you don't know how badly rigged it is. OK. With a superdelegate it's obvious, you know they had to all these superdelegates. And by the way, do I look forward to beating her. Do we look forward to winning? Do we look forward to winning? I mean, if she, you know, if she's allowed to -- if she's allowed to run that's a big question. We'll see Bill. I personally think she's being protected by the Democrats and she'll be allowed to run. But we'll see what happens. So what we've done is we've really, I mean, we won New York with 60 almost 62% of the vote, which was unprecedented and got almost 100% of the delegates. Ninety five delegates we got them almost all. And then the next week we had the five and we won them all in landslides and actually a lying Ted, you know, do we -- I think we have a couple of fans, but lying Ted did not do too well in New York, folks. You know he ran. He's hovering around the 10% mark. You got to do better than that if you're going to collect all these delegates on the second ballot. How would you like to be in a position where you're in we're in Cleveland and we're having the whole deal and it's going fine, and for some reason -- and don't worry about it, we get it, I think we have it easily, but for some reason it goes to a second ballot and somebody on the second ballot because they wine and dine delegates who has five million less votes? Because by the time we finish, and we're scheduled to do very well in California, I guess you've seen it but really well, really well. Last fall -- I so -- I'm at 49%, which is great. And there's a lot of like 20s and a 19 or something. But we're doing well. I don't want even say it because you got to go out of work especially by people sitting in this section. They've got to work. Why don't we just pretend we're tired. OK. And that is the problem and I've seen it. I've always -- all my life I've dealt with politicians and somebody will come into my office, the best politicians that come into my office and they sit down and I say, \"How are you doing?\" \"I'm tired.\" And they always says, \"I'm tired.\" And then he'll win by 25 points. But he says he has to motivate himself by saying he's tired even sometimes says, \"I'm losing Donald but I'm going to win.\" But we have picked up so many votes over the last period of time. And in fact, I was just watching the networks today and they have a chart that, I think it's already happened, but in the history of primaries, Republican primaries, I've gotten the most votes in the history of the Republican Party. Right? And we haven't even hit some of the big we haven't even hit some of the big states yet, which is sort of an amazing thing. So. So we're really on a path that's incredible. And yesterday, I thought Ted did something which was really quite good. It was record setting. It's never happened before in the history of politics. He has no path to victory. It's impossible for him to win with the votes. The only way he can possibly win is if things go terribly wrong and he goes through the back door and he bought all of these delegates and I will never use the word bribe, I would never use a word like bribe. So if he bribe the delegates, ut I don't call bribe. But -- And then think of this, think of you're the RNC and Ryan, who's a good man, by the way. And Jim is a good man. Did Jim do a good job? Where's Jim? Where is Jim? He did such a great job. You know, he called me, he said, \"Mr Trump, would you do me a favor would you take maybe 10, 15 pictures?\" I said, \"Absolutely, Jim.\" So I'm just coming through dirt and mud and under fences. So you all walk through the lobby, I go under fences, I'm coming through. I'm looking at myself I'm trying to get all the dust and everything off. And the 20 people that he told me about, turned out to be about what six, 700 people, my hand, I'm shaking hands, taking pictures, shaking hands. So that's why he's a great leader. Right, Jim? Get going. I -- I hope they paid a lot of money, Jim. But no, in the history of the Republican Party, there's never been anything like this. And then what Ted did -- And yesterday in Indiana, which is an incredible place with incredible people, Bobby Knight, the great Bobby Knight, endorsed me. How -- how good is that? And he's gonna be with me all Sunday and Monday and we're -- we are having a good time. He's some guy, he's a winner. You know that's what we need now. We need winners. We have to win. A country is a winner anymore. And we have to win. We have to win. But Cruz did something that I've never seen because he picked a vice-presidential person. Carly. He picked Carly, who -- and I like Carly. But you know when she left she had no votes. Was she one? Jim, was she one or was she zero? But she had no votes. And you know what, maybe it's a good move. Who knows? I'll let you know in about a month. All right. I don't think so. But the worst move was making a deal with Kasich. So they make this deal. I get a call two days ago from a number of people and we have to do a PR statements, it's 11:45 in the evening. They said, \"Oh, Mr. Trump, what happened?\" They merged, two, Kasich and Cruz. I said, \"They did?\" I said, \"That's a good thing.\" It shows total weakness. It shows illegal collusion you know in business you get put in jail. Politics, you can do anything you want. Right? I said but it shows such ineptitude and such weakness. And what's the deal? The deal is that Cruz will take Indiana and Kasich and now he's sitting there eating, you know, he's eating. Doing a news conference and piling pancakes into his mouth. I never saw anything like it. My son said, my little boy, Barron. He said, \"Daddy that that's disgusting.\" I never saw a man eat like that. I've never seen a man eat while he's doing a news conference. Did you ever see him do a news conference without eating. So these two guys formed an alliance because -- think of it, I've been doing this for nine months. I'm so honored and you have these two politicians they've been doing it sort of all their lives, right. I mean, Kasich approved NAFTA, which by the way, emptied out your state. I hate to tell you. Emptied out every state. But Kasich and Cruz is fine with the Chinese money manipulation. He's going to allow that to happen. Can't do that because that's how they're killing us. Devaluation of their money and their currency is killing, absolutely killing, this country. Not only China but many other places. You can't allow it. He wants to allow it. So there are a lot of things going on. Now you -- why -- You want to know why he wants to allow it? Just ask the donors, ask the special interests, ask the people, because believe me, I've seen deals that are made and these deals are -- The -- The politicians are very smart, you'd be amazed, but a lot of people ask me, \"How come they do these things?\" And it's largely because of the donors and the special interests. And I'm still funding my campaign so that's a big, big difference. OK. Nobody's gonna tell me what to do. But they form this alliance and already, like the next morning, it's formed. Everyone is talking. Big deal. They formed. They formed it to be the guy that's been a politician for nine months. OK. Me. And after it's formed, it's all done, and Kasich announces, \"No.\" I want people in Indiana to vote for me. That wasn't supposed to be the deal they were supposed to vote for Cruz here and in Oregon, which by the way, a poll just came in, I'm killing everybody in Oregon. I'm killing it, which is an amazing place. But in a couple of other places that's Kasich. So you know, they're work in the system. That's what I said it's rigged, right, rigged. So they work in the system and about 10 hours goes by and Kasich announces, essentially he's not doing the deal and then Cruz today said, \"No, it's no good.\" These are politicians, folks, they can't make a deal. How are they going to deal with China? How are they going to do it? So. So we have now a big -- I think a big moment coming up in Indiana and we feel very good about it. We'll see. I mean because I think -- I think that deal with such a disaster. As soon as I heard it I said, \"That's the end of them. Both of them.\" And Kasich has won -- he's won for 48 or 42. Doesn't matter when you at the -- whether it's 40, I guess it's 42. But he's -- that includes Ireland's but he's one for forty two. And if you think about it, Dr. Ben Carson, who's an incredible guy, who endorsed me, by the way, was doing much better. Ben was doing much better than Kasich and if you think about it, Chris Christie was doing better. Marco Rubio, has more delegates right now, and he left a month ago. And he still has more delegates and others, others. These people could have hung in for a much longer period of time and who knows. I mean, you know based on this theory it's a little like a spoiled child, \"I don't care mom, I'm staying here. I'm not leaving.\" No. It's -- it's like ridiculous what's going on. So bottom line is he is staying in, which some people say is good for me. I actually would rather have him get out. But Cruz will then have to get out also because he doesn't have, you know, doesn't have the votes. So it's coming to an end. I think it's going to come to an end very soon and really and I speak to the people in this room because there has to be unity in our party. There has to be unity in our party. And if they're not it's going to be -- If there's -- if there's not unity. And I mean, really, good solidarity, unity, relationship, friendship. We have people like Jim, where they do such a good job all over the country, we have some great people, but there should be and there has to be unity. Now with that being said, would I win, can I win without it? I think so, to be honest. I think so, because they're going to vote for me. They're not voting for, you know, Jeb Bush didn't support you. Big deal. Like I care. OK. No. I heard him on television yesterday. Low energy, very low energy. But I -- No, I heard him on te -- I wouldn't say this but I saw him on one of the shows yesterday. I did not consider him a conservative. Folks, I'm a conservative but at this point who cares we got to straighten out the country. I mean, give me a break. And a couple of the shows were saying that today. I mean, look, I am a conservative I'm very conservative on a lot of things and I'm actually very conservative on trade. A lot of the conservatives, you know, the geniuses that -- that they have absolutely, you know, they have high IQ and no brain power. They sit back and they say free trade, I say free trade too, I love free trade. The problem is our leaders are not smart people or our leaders are taken care of by the special interests, their lobbyists, you know, all the people with the money, the campaign people and we're not making good deals. And when you have China with a 500-billion-dollar-a year trade deficit and when you have Mexico with a trade deficit of $58 billion, I say by the way, we'll build a wall. The wall is going to cost $10 billion. It's really easy to figure when we have a trade deficit with Mexico of $58 billion, it's really, really easy to figure that out. And when I get off the debate stage a couple of months ago, one of the folks came up they said, \"You're not really going to build a wall.\" I said, \"Actually, it's real easy.\" And I always talk about, you know, I always build a wall. I always talk about China, 2,000 years ago they built a wall that's 13,000 miles long. We have a wall. Well we actually need is 2,000 miles, but we actually only need because of natural barriers. We only need a thousand miles. So they -- 2,000 years ago they could do 13,000 today we can't do a thousand. So he says, \"You can't build a wall.\" It's so easy. Oh, I can just see that beautiful pre-cast plank. Well good solid foundations. Nice and high. Make the ceiling look like a little low ceiling, boy. If anybody gets up there they're going to say, \"Man, how do we get down?\" See the way they go over our little fences. These guys are amazing. They climb over it like it's not even there. They go through it over it. They go. Not gonna happen with this one with what we're going to do, but we have to do it. And by the way, we want people to come into our country but they have to come in legally, folks, otherwise we don't have a country. We don't have a country. So -- So we have to get together as a party because it's a tougher road, the presidency for the Republicans. I don't know if people talk about this but it really is, it's a tougher road for a Republican than it is for a Democrat. The road is tougher. It's -- it's not as easy. And you really have to pick somebody that knows what's happening. That's really, really good. I accept the position. Now I'm on it. And I'll bring things into play that nobody else is going to bring. As an example, New York is big. I want it with landslide numbers I beat everybody by what? Thirty-eight points or something like that, the second place and much more than that. Let's see if Cruz got like 12 and if I got 62. Does that mean I beat him by like 50 points? And then he's going to run and represent us because he got those delegates to go on this second, give me a break. So here's the thing, here's the thing. We bring new york into play now. Now, in New York no Republican, if I -- except for me. No Republican will go to New York to campaign. OK. No Republican will go to Michigan to campaign. Republicans will never beat Hillary in Florida. I will. You saw I won Florida in a landslide. I'll win Pennsylvania. Most Republicans will never win Penn -- probably, I don't think any Republican can win Pennsylvania. So I'm going -- And this is, you know, they covered this and now by the way the polls are coming out where I'm leading or even with Hillary, you know, hey, I had it -- and I wrote this. Look. I had this -- listen to this. Fifty five thousand negative ads as if two months ago now it's up to exactly 60,000 negative ads. And then I watched like Kasich goes, \"He does great again.\" He didn't have one ad. Give him about four ads and he goes down . OK. OK. Same thing with Cruz but now the polls are coming out where I'm even. You saw them, they're all down. Even one has me up but even I don't want to even be up right now. It's just going to be I just look so forward to doing it. You know I started -- I started with 17 people, right, 17, who were actually 18 if you include Gilmore. Did anybody get that? So let's say there were 18. I mean, they were. So we had 18 people we had 17 people that I had to beat one by one, And when I first came in they said, \"You know the geniuses back here, brilliant guys they get paid for knowing nothing.\" So -- So what happens, they'd say, Krauthammer, \"He won't run.\" How about this Karl Rove. Is he the dumbest human being on earth? He still thinks Romney won the election. I'm telling you. Romney won. Remember him? No, no, Romney won. He's 5 million votes behind. He's gonna make a comeback. But we're up to 98%. No, no, Romney won. These are the people. You got to go -- You got to go a different way, folks, because these people are leading you right into the middle of a very bad bad desert and we're going to win. But the truth is we're going to win in a way that nobody's seen before. We're going to win so strong we're going to be so strong we're gonna be so smart. Again, ideally we're gonna be together. I think I will win even if we're not together. I mean, there are some people I honestly don't want their endorsement, I just don't want it. You know I've watched all my life as a politician. They just -- just kill each other, right? I must say the worst things about each other. They say things that you could never say and recover and one loses, one wins, and then they say at the end, right. You know . Well, I want to congratulate Jimmy Renick, a brilliant campaign and I won -- I will be behind him 100%. He's a great person a great man. And I said to myself, they were saying the worst things. Well, things get said. Here's the difference like -- like with Ted Cruz, he's a wonderful guy. I don't want to. I mean, if he wants to address me, that's fine but I don't care. Does that make sense to you? A guy like Bush. I watched him yesterday on television. Li -- You know, knocking me. Does he want to endorse me? Who knows? I don't care. It's not gonna have any impact on whether or not we beat Hillary Clinton. It's gonna going to have any impact. But most of the party has to come together and the smart people in the party have to come together and we have smart people. We have really smart people. So we're going to hopefully close this thing out fairly soon. I think that you know now that we cracked the 1,000 number, which is great, right? No, it's great. You know, it's interesting though. I'm up by 400 or so delegates. I'll be up by more than 500 when it's over and we'll be up by five million votes. OK. And we're gonna break this -- this coming week we break the all time record and we'll break the all time record by probably four million votes. I mean, it's nobody's ever seen anything like this it's a movement. It's a great movement. Many, many people have come onto the Republican side. Many, many people. It's something that they're talking about all over the world. I've been on the cover of Time magazine numerous times this year all because of the move -- Not me. It's because of the movement and what's going to happen is going to be so special. We have to come together. We have to pick our nominee. We have to go out and do what we have to do. And I'm telling you, you are going to have an unbelievably good result in November. I started with 17 people, governors, senators, people of accomplishment, some people of great accomplishment and every week bom, bom, bom. And believe me, I knocked them off. I knocked them off. And every week, boom, we're down to 16, we're down to 14, we're down to 12, we're down to 11. And then I'd get eleven people and I'd win a state and I'd have 37% of the vote with 11 people and these morons would say, \"But he didn't break 50.\" How the hell do you break 50 when you have 11 people and they're governors and senators? And now I'm breaking 50 by -- I mean -- You know what? I probably would have had 80 if you gave me the most popular guy out of the 11 or 14 that are left. Give me the most popular person and I probably would have at 80 20. But you can't do it when you have that many people. So now even though we have three we're into the 60s that's that's sort of an amazing number. But I just want to tell you, you people have been fantastic. On June 7th, you have a big, big day because the world is going to be watching. The world is watching pretty much every Tuesday but -- and this next Tuesday in Indiana, where I'm going now, it's gonna be a biggie. But I will tell you -- and those people are incredible people and they want to see, really, they want to see something that's going to be -- they want to see victory. They want to see Bobby Knight. You know they want to see victory. And that's why we're so great getting his endorsement because I love people that win and we're going to start winning again. We don't win anymore. And by the way I can add something the Republican Party in a presidential sense doesn't win anymore. You pick your standard cookie cutters. I can tell you already, just give me the name of the person and I'll tell you exactly what state she's going to win and what state she's going to lose. I'm different because I'm going to win states that nobody else can. And when I can focus on Hillary, as I say, Crooked Hillary, when I focus on Hillary, she'll go down easier than any of the people we just beat. So I just want to thank everybody. I know they're waiting, they're going to take me under a fence through a field. Oh, you have no idea of the route they have planned for me to get out of here. But I love you, folks. And Jim I want to thank you and Joel and everybody. I want to thank you all. Thank you, folks. Go out. Remember June 7. Thank you, everybody. Thank you."}