{"id":395,"author":"Donald Trump","title":"Speech: Donald Trump Delivers a Speech in Wilkes-Barre, PA","date":"2016-04-25","link":"https://factba.se/transcript/donald-trump-speech-wilkes-barre-pa-april-25-2016","paragraphs":["Hello up there. Unbelievable. So, we have a lot to talk about. This is my last stop. Tomorrow's so important. You're going to go out and vote. Who's going to vote for Trump? We're going to make that the best vote you've ever cast. I promise you. I promise. Believe me. America First folks. Make America great again, but America first, OK? Remember that.","So just a couple of things -- and my son Eric is here. You know Eric, he's great. Good boy. And in this area he said, dad, make sure you mention natural gas, that we're 100% behind in, and we are. One -- natural gas and coal, and coal. We're 100%. We're going to bring things back and we're going to bring them back like they've never been before.","We're going to take our jobs back. We're bringing our manufacturing back. We're going to take it from all of these countries that, for years, have been ripping us off because we have politicians that don't know what they're doing. So we're going to take it back. So, you know, the whole deal -- you know, this whole thing is crazy.","We're leading by millions of votes, we're leading by hundreds of delegates, and it's a rigged system. But I said, you know, let it be rigged. I talk about the boxers. I have a boxer, he's a fantastic guy. Sort of a friend of mine, he's a world champion, and he goes into a very unfriendly territory. I said, what are you doing?","If you have a good match, you're going to end up losing on a decision with bad judges. He said, Mr. Trump, the only way I have to do it, I have to knock this guy out. I have to knock him on his ass. And he did and he picked up a big paycheck. So what we're doing is we're going to win on the first ballot.","We only care about the first ballot. And you know, it's sort of interesting, because if you look at these two guys, one is one for 41. You know, I won many, many states. Millions of votes ahead, many states, many delegates. The other one, he's like a total disaster. He goes to New York last week, he doesn't even register.","He's so low he got no delegates. Folks they ought to both drop out of the race, so we ought to unify the Republican Party. And a great poll just came out. You saw it on the top of Drudge. A great poll that has me even with Hillary Clinton. That's nothing. I haven't even started with crooked Hillary yet. We haven't even started.","Amazing. Amazing. Oh that crooked Hillary. The same old stuff. Years and years of watching it. It's always the same but she's not bringing back jobs, she doesn't know the first thing about it. She's going to open up the borders. And I don't know if you saw reports today, more people are pouring across our southern border than practically ever before.","It's out of control. It's out of control. We don't know who these people are. We don't know where the hell they come from and they're pouring across, and the Border Patrol, who are amazing people -- just so you know, last week, the Border Patrol endorsed Donald Trump. 16,500 people. They've never done it before.","Never done it before. Amazing -- they're amazing people. They're amazing people. And Sheriff Joe endorsed. You know Sheriff Joe from Arizona. So we're going to do a great job, but they're setting records. People are coming across. We don't know where they are. And then you have, coming from the migration, thousands and thousands of people and they're coming here.","Nobody even knows where they're going. They put them all over the country. Nobody knows. Are they ISIS? It could be the great Trojan Horse. Nobody knows. We'll build a wall. Don't worry about it, man. We'll build a wall. That wall is going to get built. This place is unbelievable. This place is unbelievable.","All right. So look, so I go to the statisticians and I ask him a few -- I have to. You know have all these people work for me they've got to do something, right? The sad part, all over the country -- last week it was New York State, which I won in a record setting number nobody could even believe it. And you know what's nice?","These are people that know me the best. I mean, New York. I went to school in Pennsylvania. My daughter currently is going to school in Pennsylvania. Tiffany. My son went to school in Pennsylvania. Eric went to school in Pennsylvania. They also -- they also went to the Hill School, which is a great school, with those people.","They love the Hill School. Ivanka went to school in Pennsylvania. I went to school in Pennsylvania. I guess I'm a product of Pennsylvania. I love Pennsylvania. But you know, I'll tell you what -- but I had to do this. So I went to the statisticians and they talked about your area. I said, give me some stuff in the area.","So it's been hit hardest -- among the communities in America, it's been really hit hard. Then they talk about the Scranton region, lost half of its manufacturing jobs since 1990. Our region here lost 6,000 manufacturing jobs since the recession in 2007. That's a lot of jobs. And you know where they're going.","They're going to China, they're going to Mexico, they're going to Japan, they're going to Vietnam. The state of Pennsylvania has lost more than 35% of its manufacturing jobs since 2001. Now, 2001, that was the year that Congress voted -- brilliant Congress, really brilliant people we have, right? Except for my two favorite congressmen who are here tonight, you know that.","The two greatest guy -- where are they? Lou and Tom. Lou and Tom. Where are they? Get them up here if they can -- I don't think they -- they're so high up. See, they want everybody else to have a better seat than them. If Lou and Tom can ever make it down, we better get up here. But what -- what great guys, and right from the beginning, right from the beginning.","All right. So look, 35% manufacturing jobs. Congress voted, brilliantly, to let China into the World Trade Organization, and that's when things started really going bad. Wonderful move. Lying Ted Cruz supports Chinese currency cheating. And one in 42. Can you believe? The guy's one for 42 and he continues to run.","Kasich, he was the big vote on NAFTA, which destroyed Pennsylvania and destroyed virtually every state. You look at what happened up in New England, all over the place. I was in New York state last week. I was all over, Syracuse -- places I know very well. And I went to Albany, and I went to Poughkeepsie, and I went to Bethpage, and I went to Suffolk County, and all over New York State, we have empty manufacturing plants, empty factories, all been siphoned off going to other countries.","The jobs are -- horrible, what's happened. We're not going to let that happen anymore folks. Believe me, we know how to stop it. And I really know how to stop it. So there are your statistics. Not a pretty picture. To hell with it. To hell with it. We've got enough. Look at this though, more than 10,000 people laid off.","Now here's something I don't like. Foreign born population in Pennsylvania has surged to one million, reducing wages and reducing jobs. Not good folks, not good, right? All right, we're going to change it. We're going to change it. So we had some big news today. You had lying Ted announce that he can't win by himself.","He cannot do it. You know he's a choker. He cannot do it. So he said, let me form a partnership, which I call -- what do we call it? Go ahead. Go ahead. What do we call it? Let me form -- it's called collusion folks. It's called collusion. So I wrote up something. But here's a guy, couldn't fight by himself.","He was saying how well he did. Look he's lying Ted. He holds the Bible high and then he lies. He puts it down. Lying Ted. Not worth it. We got lying Ted, we got crooked Hillary. There's no way we don't win this whole thing and turn our country around, OK? Lying -- so I get a call last night, about 11:30, and like you we work, you know?","It's OK. Call me at 11:00, call me at 12:00, call me at 1:00. I'm a worker, you're workers too. And I said -- I dictated something over the phone. And I said, isn't sad that two grown politicians have to collude against one person who's only been a politician for 10 months, which is right. But, you know, I'm like a smart person, I know what to do. These politicians are all bought off with campaign contributions and super PACs and all of this, and some of them are very dumb, to be honest with you, OK? Some of them don't have a clue.","I mean, how can you allow what's happened to our country to go on? You've either got to be grossly incompetent, which many are, or you've got to be under the control of the lobbyists and the special interests, which most of them are. Now, I'm self-funding, so it's a big difference folks. I don't care. I'm gonna do what's right for you.","I do what's right for you. So I've been in this field for 10 months. In order to try and stop a person from getting the Republican nomination when we should be bringing everybody together. It's time. And I will tell you, I've been watching these dishonest people, some of the world's most dishonest people, the media.","And you know what? They're not going to show this stadium, right Tom? They're not going to show this stadium. Show it Tom. Go ahead, Tom, show it. They're not going to show it. I'll go home and my wife will say, darling, were there many people there tonight? I said, you didn't see it? Because it's all on television.","Look at all the lights. They'll say, were there many people and she'll say where there -- I said, you didn't see it. They never, ever show the crowds. We have the biggest crowds by far. And you know what? We have the greatest people by far. So I went on. Senator Cruz has done very poorly, especially with getting votes.","He can't get votes. And after his New York performance, which was a total disaster, he was in a free fall. And you know he reacts very badly under pressure, he chokes under pressure. Boy, does he choke like a dog. Also, approximately 80% -- which is true. Might be high -- approximately 80% of the Republican Party, right now -- because I actually think that 20% is high, is against him.","And against Kasich, it's even worse. Now, Kasich, he's only got, yeah, one state out of 41. So he's one for 41, and I'll tell you something. I had a dirty poll given to me. Florida and Ohio were being done at the same time, right? And I was winning Florida by a lot. Even though I was running against, actually a good guy, Marco Rubio.","By this time Bush had dropped out. And you know, we're set up, because when they heard that Trump was running, they changed it. Because, let me tell you, we have a rigged system, we have a corrupt system. This whole thing with the delegates is ridiculous, and you have to go out and you have to get your beautiful delegate card and you have to vote for your delegates.","The delegate. It's crazy. You know, it'd be nice if you could just go out and vote. We can win this state. I mean, we're way up in the polls. Don't let that fool you, go out tomorrow and vote. Don't let it fool you. But here's the story -- and they just said, Mr. Trump, when you go up there, can you please tell them to take their card, vote for the Trump delegates.","I said, that's not like a cool thing to say during a speech. Vote for the Trump delegates. OK? Now I've done my job. You know, it'd be nice if you could just vote and just be done with it but the system is so complicated. Now we have a great head of the Republican Party, so we're very lucky, and we have some great people and we have some amazing delegates, and they're going to do a great job.","But here's the story, here's the story -- thank you, I love you too. Look at this guy. All right. And you know, the Kasich thing is interesting, because here's a guy that just says, I'm going to stay. Like a stubborn -- like if you have a child who's a spoiled brat where they go, I don't care daddy. Get out of the room daddy, I don't care.","This is like a spoiled guy. If you look at it, Ben Carson, who's endorsed me, did much better. I mean, he was tough. And Ben Carson -- Dr. Ben Carson, great. He did better. Chris Christie, who endorsed me, did better. Marco Rubio did much better. I mean, you look at Marco Rubio, he has more delegates right now than Kasich has and he's been in the race for a shorter period of time.","It's just a guy that said, I don't care I'm staying. And then you see him eating in the morning -- you ever see -- I have never seen. He's stuffing pancakes in his mouth like this. And I'm always telling my boy, take small bites Barron. Little tiny bites. And yesterday he said, daddy who is that guy on television?","That's disgusting. Did you ever see? Then they talk about presidential. Oh, I see, he's president -- he puts pancakes this big in his mouth and he's shoving them in. This is not a presidential person. Look, look -- but Marco Rubio has more delegates. But you have many. I mean, Jeb Bush could have stayed.","A lot of people could have just said, I don't care. They have no path to victory folks and I'm going to win on the first ballot. I don't care about what's going on with the second -- you know they-- the press, I don't care. I don't care. It's a crooked system. So how would you like to have this, Trump wins by four or five million votes.","You see California? I'm at 49%. We're going out to Indiana, and the people of Indiana are smart, and the people of Indiana know that I've been speaking about, for four months, the horrible treatment that Carrier air conditioning gave to the people that worked for him and to the people of Indianapolis, Indiana, when they said, you're all fired.","Every one of you are fired, we're moving to Mexico. I've been talking about this long before I realized how important Indiana would be to this process, and the people in Indiana are smart. And I'll tell you what, I have one of the great endorsements of all time coming up in Indiana. I refuse to say it's Bobby Knight, but it's Bobby Knight.","Great winner. No, he's a great champ. He's a great champion. That's great -- that's what I call a great endorsement. Tough, smart, knows how to win. That's what our country needs. That's why he's endorsing me. But that's what our country needs. All right. So others have done much better. Now, collusion. So what they did, they're both losing campaigns.","They're failing campaigns, they're no good. They're done. You know, if you add up Cruz's and Kasich's votes, all of the votes, I'm beating them by a lot. If you add up the -- if you add up -- this is -- people going to be surprised to hear this. If you add up their delegates -- again, it's a rigged system, but if you add up the delegates of Cruz and Kasich, I'm beating them by a lot.","Any -- by a lot. But to show you how corrupt the system is and how dishonest the system is, let's say I go up -- you know, the 1,237. Got to get 1,237. So I think we're going to beat it, I think we're going to do it fairly easily, I think we're going to get it. Who knows? But if you don't -- how about if we don't? We're going to do it, but how about if we don't? And these guys have been going out and buying dinners and hotels, and you know, all this stuff and they're buying up all these delegates.","So how do you like to have somebody win on the second ballot that has three or four million votes less than Trump, that has four or five hundred delegates less than Trump, OK? No, but think of that. So we're going to pick a guy that ended up getting like, what was it? 10 or 12% in New York, that got no delegates.","The other guy, Kasich, got practically nothing in New York, they ran them both out of town. Two tremendously failed candidates last week. They're going to pick somebody like that, and you know, give me a break, not going to happen. So -- so here, how about picking Kasich? He'll be -- that time he'll be one for 50. Ladies and gentlemen, our new nominee, a man that's been running for over one year.","Yes, he won one state out of 50, and he happened to be in that state. But he's going to take it. Now let me tell you, the new poll came out, that has me tied with Hillary Clinton. But that's nothing because I haven't hit her yet. You know, somebody said, from the media -- they said from the media, because we're always -- and I always say, maybe -- you know, I'm know, I'm a smart person, I could change the presidential so easy.","That would be so -- that would be much easier than doing what I'm doing right now, because I could talk nice and calm, and everybody would fall asleep after 10 minutes. Then you'd see them start leaving the upper decks. Look at that, the corner of the upper decks. Why didn't you show that media? Hey media, why didn't you show it? You dishonest media.","The corners of the upper decks. Now they're not -- look, they don't move the cameras. They don't move the cameras. They don't move. They never move the cameras. They never move the cameras unless there's a phony protester around. Where -- do we have any protesters? I'd like to put a couple of protesters right up there where they can see.","And think of it, 6,000 people not able to get in, standing outside. So, here's the story, we're going to win big tomorrow. You're going to go vote, you're going to vote for the delegates, you're going to do all the things you have to do. It's crazy. But we just got poll numbers from Rhode Island. I just got back from Rhode Island.","Plus, I made two speeches today. We had two rallies in different parts of Pennsylvania. Yesterday, we had an unbelievable rally in Maryland, an airport hangar that was so big and so packed that people were flowing out into the runway areas. I mean, what's going on is a movement folks. We've been under cover -- and it's we. I'm the messenger.","I'm a good messenger but I'm just -- it's about you. We've been on the cover of Time magazine many, many times in the last short period of time. In fact, I'm going to be at a dinner tomorrow night for Time magazine, the world -- the -- I guess the world's most -- 100 most important, something like that. You know what?","Who cares? What I care about, I care about winning this nomination, beating crookery -- beating crooked Hillary Clinton and doing a great job for our nation, and we're going to do it. We are going to do it. You had to see though, Rhode Island, today. You know what happened? They didn't put me down for Rhode Island.","I said, what are you talking -- well your poll numbers are so high there Mr. Trump, you're over 60%. I said, oh, I get it. Because I'm doing so well, I'm not going to take care of the people of Rhode Island. Doesn't work that way. So I had a little slot, we flew up to Rhode Island, we gave them like a 10-hour notice.","The place was packed. And these are great people. We flew down to Delaware two days ago. Unbelievable people. We went to Maryland a couple of times. Packed, packed, packed. I've been all over Pennsylvania, right? All over. I've been all over. It's been unbelievable. I'll tell you, it's been unbelievable.","It's been so great. So I hear we're doing great all over the place. But you know, a little bit about Rhode Island. So Rhode Island, you want to take care of people that are with you. I don't want to hear, you're doing great therefore you don't have to go there. No, no. If I'm doing great and if those people like me, that's why we want to go, right?","Don't you think? So we're going to do good. So tomorrow's a big big day. So, here's the story, the end. Because of me everyone now sees that the Republican primary system is totally rigged and broken. When two candidates who have no path to victory -- they have no path. They're mathematically out. They ought to quit so we can all get together, we can all unify and we can all go against crooked Hillary Clinton and beat her.","Really, really beat her big league. She'll be a terrible President, I will tell you, if she wins. I mean, even Kasich, what he's been saying about her. She's got bad judgment he said. And they said, don't say that anymore. Don't say that, that's terrible. He said, she's not qualified. Now that's a little -- I mean, who's not qualified?","Everybody's -- we're all qualified, right? But then he said, OK, I'll take that back. We didn't forget that. Not qualified. But what she said -- what he said was amazing, that she has got bad judgment, and she has got bad judgment. Even on the e-mails. That's called -- it's criminal but it's really bad judgment folks, really bad judgment.","And you look at Syria, and you look at Libya, and you look at all of the problems in the Middle East, and you look at what the hell has happened to the world. And then you look at President Obama, with one of the worst deals ever made -- with one of the worst deals ever made, the Iran deal. We give them $150 billion.","We get nothing. We get nothing. Those days are gone. And by the way we should have had our prisoners back before we started negotiating folks. You don't negotiate like that. So we have two candidates running. They have no path to victory. One approved NAFTA and was really a very final vote, which has destroyed us. The other one loves TPP, Trans-Pacific Partnership, which is a catastrophe for this country, which will make NAFTA look like baby stuff.","We can't let it get approved. And Cruz doesn't want to do anything about China's manipulation of their currency. He had the opportunity. He blew it. Here is a senator who has done nothing in the United States Senate. No legislation. Nothing important. He's been a bad senator. Doesn't get along with anybody.","Has practically no endorsements. The man he respects most is Senator Jeff Sessions from Alabama, a great man and a great senator. There's only one problem. Jeff Sessions, two weeks ago, endorsed Donald Trump. Problem. So we're going to unify the party. So let's go. When I came down the escalator not so long ago, June 16th, with my wife, I looked down at Trump Tower and I saw the largest group of cameras and paparazzi and reporters.","It looked like, literally, the Academy Awards. I say it. And I said, I didn't love doing this. I mean, I'm doing it because, honestly, we really can, not only make America great again -- I really believe we can make America greater than ever before. I really -- or I wouldn't be doing it. I wouldn't be doing it. And I stood up and I made a speech.","And as you know, I brought up illegal immigration, I brought up trade, I brought up some other things but the primary thing was trade. Illegal immigration. We're going to rebuild our military, make it us stronger, bigger, better. The cheapest thing we can do. Nobody, ever, will mess with us because they just toy with us right now.","They toy with us. And a lot of people, I heard it today, they said, well Trump is definitely the toughest one running but he may have a quick hand, a quick trigger. I've got the slowest trigger of anybody but nobody is going to play games with me. But I've got the slowest trigger. I'm the one that said, as a civilian -- I wasn't a politician but I said, at the beginning, don't go into Iraq, you're going to destabilize the entire Middle East, and that's exactly what happened.","If our -- if our presidents and if our politicians went on vacation 15 years ago, we'd be a lot better off in the Middle East than we are right now. What we have right now is a big, fat, ugly mess, all right? A big mess. And they were the ones that pulled the trigger. And then I heard a certain Senator, Lindsey Graham, he said, I don't know why Donald Trump doesn't listen to me. I've been fighting this war for many years.","That's right. I want to fight it for about two weeks folks. Not many years. Because we have to get back to our country. We have to rebuild America. We have to rebuild the United States. Our infrastructure is going to hell. We'll build three schools in different places in the Middle East. They get blown up, we rebuild it. They get blown up again and again and again, we -- but if we want to build a school in Pennsylvania, the government said, we have no money, right?","No good. We've spent over four trillion dollars in the Middle East. We are in worse shape now than we were 15 years ago. And then when Obama got out, instead of doing it in a certain way and leaving some troops behind and protecting a little bit of whatever, if you call it one. Let's not even call it one.","He took everybody out and he announced the date that he was leaving, and now you have a mess. And in comes ISIS, they take the oil. And I've been saying, for years, keep the oil, keep the oil. Don't let him have the oil. I didn't want to go in the first place, but I said, if you're to go out, take the oil.","Because if you don't take the oil, Iran is going to get the oil and ISIS is going to get the oil. So who has the oil? Iran and ISIS, and Iraq. Which, by the way, for years and years, would fight with Iran. But they were the same military strength, right? So they'd fight for three, four years. Boom, boom, they go home and rest.","Then they'd fight for three, four years. Boom, boom, then Saddam Hussein would hit somebody with gas, people would be complaining. Then the others would hit gas, they go -- they move 10 feet, 10 feet. What did we do? We went in and destroyed, destroyed the military capability of one of the two nations. And now Iran is taking over Iraq as sure as you're standing here.","And is -- actually you people are all standing too, even though you have seats, which is a great honor. Thank you. It's always nice when people have seats and they still want to stand to hear Trump. Don't you agree? Always nice. It's always nice. I appreciate it. So we're going to change our focus. We're going to be so great on the military and on foreign policy, and we're going to do things right.","You know, we protect many many nations and we're not reimbursed properly for the protection. Many of these nations are very wealthy nations. We protect Germany. We protect Japan. Love Germany. Love Japan. Many friends. We protect South Korea. Great, great -- from the madmen next door. We have 28,000 soldiers on the line.","Very dangerous position to be in. They're making a fortune -- you order tele -- I ordered 4,000 television sets -- I order thousands a year for different projects. Thousands. Where do they come from? They come from South Korea. That's fine. They are money making behemoths. They don't take care of us. We protect Saudi Arabia.","Saudi Arabia, I have many friends in Saudi Arabia, they buy my apartments. You wouldn't believe how they buy my apartments, OK? Many, many friends. But we protect Saudi Arabia. Before the oil went down, they were making one billion dollars a day. If we didn't protect them, they wouldn't be there for two weeks, but we protect them.","We don't know what we're doing. And then we have a President that flies to Saudi Arabia last week and he gets off the plane, and there's nobody to greet him. And the same thing happened in Cuba. He goes to Cuba and instead of having one of the Castros or both of them greeting him at the plane, there's no high official waiting to greet the President of the United States coming out of Air Force One.","Which, by the way, they will tell you, the dishonest media, but they will tell you, that has to be a record. In the history, the great, great history of Air Force One, how many times do you think it landed at an airport of hundreds and hundreds of countries where the top people in that country weren't there to greet the President of the United States?","It happened to our President. It happened to our President twice in four weeks. Nobody. I'll tell you what, if I were the President and I flew into Saudi Arabia and the King or whoever, the top, isn't there to greet me, I say, hey pilot come here for a second. How much fuel do we have? We've got plenty sir, it's Air Force One.","I say, get back at those controls pilot and let's get out of here, right? That's what I do. Let's get out of here. I would be out of there so fast. If they show the President of the United States -- thank you. Thank you. If they show the President of the United States so little respect, it's called, sorry folks, see you some other time.","I mean, I remember a case not so long ago, everybody forgot it. The Olympics. Remember when the -- the President flew to Europe to make a pitch. Now, this the President the United States. He made a pitch for the Olympics to come to the United States. And I think that's great, I like it. But if you're the President, you don't go over there, make a pitch and then not win, right?","Too big a position. If you're the President, you got to know the answer before you go over. So you call and say, listen, I'm the president and I'm going to go there, but between us, are we going to win? And they'll tell you, they'll say, no sir, you're going to come in fourth. I say, thank you very much, I appreciate it, but I'll -- you know, I'm not going to go, right?","They don't do that. We're dealing with babies here folks. We're dealing with babies. So we have the President of the United States go over to make a pitch for the Olympics and he gets rejected. We didn't come in first or second or third. I think we came in like fourth. Who does that? Who does that? Are we dealing with babies?","When you're the President of the United States and you want to get the Olympics to come to this country, and you go over there and you don't know the answer beforehand, you're incompetent. You're incompetent. Totally incompetent. So here's the story. Tomorrow's a big day and we're going to do great things.","And as I said, I'm self-funding my campaign. And you know the nice part, of the major candidates, I put in far less than any other candidate and we're winning in a landslide by every single category. And on television, one of the very smart pundits said, why would Trump change? You know, I'm like a smart guy, went to the best school, one of the hardest schools in the world to get into, like -- I'm smart, where a lot of us are smart.","By the way, we have -- the smartest and most loyal people are in these rooms. The Trump people are the smartest and they're, by far, the most loyal. By far. They are, by far, by far, the most loyal. So here's the story, here's the story. I have to tell you this. I have to. Here's the story. So they're talking about presidential, and this one pundit says, let me ask you a question, 17 people started and Trump was there, and we all said Trump's never going to run.","Trump's never going to this, Trump's ever gonna sign Form A, which basically is signing your life away. Trump's a private company, he's never going to real -- he's never going to reveal his finances. So I announce that I'm running. I then signed my life away. I signed Form A. I then put in my financials early.","I had the biggest law firms in Washington and the biggest accounting firms in Washington working round the clock because I didn't want to be even an hour late. And I could have had 45-day extensions all over the place. But I wanted to show my financials because I built a great company. I built a company, some of the greatest assets in the world.","I built a company with a tremendous cash flow, with very little debt, and I put it in. Federal Elections, I put it in, almost 100 pages. The biggest report ever put it into Federal Elections. I started off with a million dollars. You know, you hear all these crazy numbers. Believe me, started off with a million dollars.","My company's now worth more than $10 billion, and importantly, I tell you that it's not in a braggadocious manner. I tell you that because this is the kind of thinking, at least for a little while, that our country needs. We got to put our country back on track. If we're protecting the 28 countries of NATO, and if they're delinquent and they're not paying us because they have no respect for us, and if NATO is obsolete and has to be rejiggered, and if we have to do something about terror, which NATO doesn't really cover, it was many years ago -- you're talking about 68 or so years ago, we got to change things.","And when somebody at one of the networks asked me, what do you think of NATO? Now, in all fairness, I'm a very good business person. But, you know what, NATO's never been high on my list but I understand that. I said, number one, it's obsolete. And guys that looked at it, that study it every day of their lives, at first they said, no it's not.","Then about three days later they're saying, Trump's got a point. Because they're so close to it they don't even see it. Then I said, we have put up so much money to protect other countries, they've got to start paying for this protection. And they don't pay because probably nobody asks them for the money.","And they don't pay because, honestly, they think we're stupid. So we're protecting these countries that aren't paying their fair share. They're not carrying their own baggage. And one of the early things I do is I say, folks -- and many of these countries are very wealthy. I say, folks you've got to pay us. They'll say OK. I said, no, no, no, no. You've got to also pay us for all those back years when you didn't pay us. It's called delinquency, right?","Got to pay us. You've got to pay us. And we don't mind, we'll help you out and we'll protect but you've got to pay. We are no longer the stupid country, we're now the genius, brilliant country. OK? So you got to pay us. And you know the funny thing? I'll get a along better with these countries than we do right now and they'll be paying up because they're going to respect the United States again.","They don't respect us, OK? Now, a couple of things. A couple of things then we're going to go home, then we're going to get a good night's rest and then tomorrow you're going to vote and get all your friends, OK? A couple of things. So the commentator said, you know I hear Trump maybe is thinking about pivoting to more presidential.","The only thing is, that I don't understand, he had 16 opponents. Senators, governors. All these people. Top of the line. Nah, some of them not so good. 16. He had guys like Dr. Ben Carson, who's a phenomenal guy. A lot of people, right? He's a phenomenal guy. Wait a minute. So he goes through one, he wins.","He goes through another, beats a governor, beats a senator, beats a governor, beats a senator. Now he beats a senator and now he beats three senators in a row, and I'm about to beat a senator who doesn't even have a clue, Ted Cruz. And I'm about to beat a governor who's one for 42. OK? So this person, who's a very smart pundit, said, you know, if I'm Trump, I don't think I want to change.","And there's a lot of truth to that. But wait till you see what we do with this country. We're going to unify -- not only are we going to unify the Republican Party but we have a tremendously divided country. White and black. Everything we have, young and old. Everybody is at odds. You look at the African-American population in this country.","Youth. African-American youth has a 59% rate of unemployment 59%. You look at African-American people, it's substantially higher. There is tremendous division because Obama is a tremendous divider. He divides. And he's done nothing for African-American people. I will tell you that. And I'm going to win the African-American vote and I'm going to win the Hispanic vote.","And every poll, you look at the poll in Nevada, the poll -- big Hispanic population. I won the state of Nevada very easily, in a landslide. Cruz was supposed to win. I win all these states. He can't win when people have to vote. He can't win. So here's the story. I win it and they do an exit poll of the Hispanics, and who wins the exit poll by a lot?","Donald Trump, OK? You know why? So I'm going to win the Hispanics, I'm going to win the African-Americans. You know why? Because I'm bringing jobs back to our country and I'm not letting the jobs that are here go without consequence. If somebody wants to take their factory, like Carrier did in Indiana, and they want to move to Mexico, we're going to tell them very nicely, enjoy Mexico, enjoy the heat.","Just enjoy it. I hope you build a wonderful plant. But every single time you make an air conditioning unit -- and I buy from carrier but I'm not buying anymore. Every time you make an air conditioning unit and you want to send it across are now very, very strong border, with a wall, with our incredible -- with our incredible Border Patrol watching, and allowed to watch.","Every time you make a unit and you send it across, we're going to charge you a 35% tax. I hope you enjoy your stay in Mexico, OK? And I'll tell you what's going to happen. They're not moving folks. They're not moving. They're not moving. I believe in free trade but you can only have free trade when you have smart, cunning, streetwise leadership.","We don't have that. We have incompetent leadership, and therefore we have to play tough and we have to play smart. With China, we have a $500 billion trade deficit. It's crazy. And you know what? If any of you do business with China, you're going to find it's almost impossible to get your product in. And if you do get your product in, they charge you a tariff or a tax.","With them, they send this stuff over, no good. Not going to happen. I want Apple products to be made in the United States. And you watch, it's going to happen. You watch. Now I have a tax plan that cuts taxes more than anybody else's plan, simplifies and cuts, simplifies and cuts. But remember this -- but forgetting even about that.","We can do such --you know, for five years and even for seven years, these all-talk, no-action politicians in Washington have been working so hard to try and devise a plan to keep the countries in our -- in our country, where they take the companies and they keep them. Corporate inversion. They don't even know what the word is. It's corporate inversion.","Trillions of dollars outside, companies want to bring it back in. We can't even get an agreement, and everybody agrees, Republicans and Democrats. Here's what we're going to do. We're going to make it very hard on people that want to leave our country and they want to fire all our people. There are going to be consequences.","And if you look at some of the plans the government has, they make -- well, maybe we can give them low interest loans. Not going to do it. Maybe we could -- let me tell you what does it. Good old fashioned tax. A good old fashioned tax. The consequences -- you're going to fire your people from Indiana, you're going to fire these 1,400 people that did a phenomenal job for 30 years and 20 years and 14 and 15. I met many of them.","That's not going to happen. If you want to do it, go. But when you come over -- and I'm telling you nobody's leaving. Try looking at their projections. Their projections won't work. Now, remember the one thing that nobody will say in terms of the pundits, when they say well the product will cost more. In some cases it'll cost more.","But I say, please say the second part. They never write it. We'll also have a lot more jobs, OK? We're going to have a lot more jobs. And that's the key. That's the key. We're going to have jobs. We're going to have jobs making products for ourselves. We're going to have jobs making products that we export to other countries.","And you know what? We're going to get along great with China. We're going to get along great. But we're not going to have a $505 billion deficit anymore. And when China wants to build a massive military fortress in the South China Sea, which they're not supposed to be doing, they're going to respect us if it's me because we have tremendous power, and it's called economic power.","But we have people that don't know how to use it. We will be beloved by some of these countries. You look at Japan. Millions of cars come in. And we send them practically nothing and they want practically nothing. They don't want our product. So it's all going to change folks. So here's the story. You're going to remember this evening.","We had a good time. I had no idea your arena was so beautiful but that's OK. In a packed arena, with thousands of people trying to get in, we had a great time. But more importantly, tomorrow, you're going to have a phenomenal time and you're going to represent the great state of Pennsylvania, which I love and I know very well.","I know very well. And you're going to say -- when you look back in five years and 15 years and 25 years, and hopefully in 50 years from now, you're going to say, that was the single greatest vote I ever cast, for president Donald Trump. Because we're going to go on and we're going to beat crooked Hillary and we're going to win the White House.","And we're going to have such victories but what you're gonna say is, you know it's amazing, when Donald Trump -- when President Trump -- and by the way, you're gonna have such love and respect for your President but I don't care. I don't care. What I really care -- you're gonna have great, new respect for your country again.","Great, great respect. Great respect. And you're going to say, when President Trump took over, our country started winning again. We won with our military. We knocked the hell out of ISIS and then we go back and we want to take care of our country. But we won with our military. We've rebuilt it. We've made it so strong.","We've made it so good. By the way, maybe the cheapest investment we can make folks. Maybe the cheapest investment we can make. We're going to take care of our great veterans who have been absolutely forgotten about. We're going to win with education. We're getting rid of Common Core and we're bringing education back, locally.","We are going to terminate Obamacare and replace it with something far, far better. We are going to protect our Second Amendment, which is under siege. We are going to have strong, powerful, magnificent borders. We are going to build a great wall and Mexico is going to pay for the wall. And we're going to make great trade deals, not with political hacks that get the job because they give campaign contributions.","We've got the most brilliant business people in the world in our country. We're going to be using our best people, our best negotiators. They've been calling me by the dozen. They don't want money. They want to make America great again. They're proud of our country. We're going to use our best people and we're going to bring back our jobs.","And we're going to -- we are going to do great with trade. We are going to do great with trade. So folks go out tomorrow. Get a great night's sleep. Go out nice and early. Vote. And I promise you, 100%, we will make America great again. We will make it better than ever before. I love you Pennsylvania. I love you. Thank you. Thank you.Dd0ZG06ZZf8"],"text":" Hello up there. Unbelievable. So, we have a lot to talk about. This is my last stop. Tomorrow's so important. You're going to go out and vote. Who's going to vote for Trump? We're going to make that the best vote you've ever cast. I promise you. I promise. Believe me. America First folks. Make America great again, but America first, OK? Remember that. So just a couple of things -- and my son Eric is here. You know Eric, he's great. Good boy. And in this area he said, dad, make sure you mention natural gas, that we're 100% behind in, and we are. One -- natural gas and coal, and coal. We're 100%. We're going to bring things back and we're going to bring them back like they've never been before. We're going to take our jobs back. We're bringing our manufacturing back. We're going to take it from all of these countries that, for years, have been ripping us off because we have politicians that don't know what they're doing. So we're going to take it back. So, you know, the whole deal -- you know, this whole thing is crazy. We're leading by millions of votes, we're leading by hundreds of delegates, and it's a rigged system. But I said, you know, let it be rigged. I talk about the boxers. I have a boxer, he's a fantastic guy. Sort of a friend of mine, he's a world champion, and he goes into a very unfriendly territory. I said, what are you doing? If you have a good match, you're going to end up losing on a decision with bad judges. He said, Mr. Trump, the only way I have to do it, I have to knock this guy out. I have to knock him on his ass. And he did and he picked up a big paycheck. So what we're doing is we're going to win on the first ballot. We only care about the first ballot. And you know, it's sort of interesting, because if you look at these two guys, one is one for 41. You know, I won many, many states. Millions of votes ahead, many states, many delegates. The other one, he's like a total disaster. He goes to New York last week, he doesn't even register. He's so low he got no delegates. Folks they ought to both drop out of the race, so we ought to unify the Republican Party. And a great poll just came out. You saw it on the top of Drudge. A great poll that has me even with Hillary Clinton. That's nothing. I haven't even started with crooked Hillary yet. We haven't even started. Amazing. Amazing. Oh that crooked Hillary. The same old stuff. Years and years of watching it. It's always the same but she's not bringing back jobs, she doesn't know the first thing about it. She's going to open up the borders. And I don't know if you saw reports today, more people are pouring across our southern border than practically ever before. It's out of control. It's out of control. We don't know who these people are. We don't know where the hell they come from and they're pouring across, and the Border Patrol, who are amazing people -- just so you know, last week, the Border Patrol endorsed Donald Trump. 16,500 people. They've never done it before. Never done it before. Amazing -- they're amazing people. They're amazing people. And Sheriff Joe endorsed. You know Sheriff Joe from Arizona. So we're going to do a great job, but they're setting records. People are coming across. We don't know where they are. And then you have, coming from the migration, thousands and thousands of people and they're coming here. Nobody even knows where they're going. They put them all over the country. Nobody knows. Are they ISIS? It could be the great Trojan Horse. Nobody knows. We'll build a wall. Don't worry about it, man. We'll build a wall. That wall is going to get built. This place is unbelievable. This place is unbelievable. All right. So look, so I go to the statisticians and I ask him a few -- I have to. You know have all these people work for me they've got to do something, right? The sad part, all over the country -- last week it was New York State, which I won in a record setting number nobody could even believe it. And you know what's nice? These are people that know me the best. I mean, New York. I went to school in Pennsylvania. My daughter currently is going to school in Pennsylvania. Tiffany. My son went to school in Pennsylvania. Eric went to school in Pennsylvania. They also -- they also went to the Hill School, which is a great school, with those people. They love the Hill School. Ivanka went to school in Pennsylvania. I went to school in Pennsylvania. I guess I'm a product of Pennsylvania. I love Pennsylvania. But you know, I'll tell you what -- but I had to do this. So I went to the statisticians and they talked about your area. I said, give me some stuff in the area. So it's been hit hardest -- among the communities in America, it's been really hit hard. Then they talk about the Scranton region, lost half of its manufacturing jobs since 1990. Our region here lost 6,000 manufacturing jobs since the recession in 2007. That's a lot of jobs. And you know where they're going. They're going to China, they're going to Mexico, they're going to Japan, they're going to Vietnam. The state of Pennsylvania has lost more than 35% of its manufacturing jobs since 2001. Now, 2001, that was the year that Congress voted -- brilliant Congress, really brilliant people we have, right? Except for my two favorite congressmen who are here tonight, you know that. The two greatest guy -- where are they? Lou and Tom. Lou and Tom. Where are they? Get them up here if they can -- I don't think they -- they're so high up. See, they want everybody else to have a better seat than them. If Lou and Tom can ever make it down, we better get up here. But what -- what great guys, and right from the beginning, right from the beginning. All right. So look, 35% manufacturing jobs. Congress voted, brilliantly, to let China into the World Trade Organization, and that's when things started really going bad. Wonderful move. Lying Ted Cruz supports Chinese currency cheating. And one in 42. Can you believe? The guy's one for 42 and he continues to run. Kasich, he was the big vote on NAFTA, which destroyed Pennsylvania and destroyed virtually every state. You look at what happened up in New England, all over the place. I was in New York state last week. I was all over, Syracuse -- places I know very well. And I went to Albany, and I went to Poughkeepsie, and I went to Bethpage, and I went to Suffolk County, and all over New York State, we have empty manufacturing plants, empty factories, all been siphoned off going to other countries. The jobs are -- horrible, what's happened. We're not going to let that happen anymore folks. Believe me, we know how to stop it. And I really know how to stop it. So there are your statistics. Not a pretty picture. To hell with it. To hell with it. We've got enough. Look at this though, more than 10,000 people laid off. Now here's something I don't like. Foreign born population in Pennsylvania has surged to one million, reducing wages and reducing jobs. Not good folks, not good, right? All right, we're going to change it. We're going to change it. So we had some big news today. You had lying Ted announce that he can't win by himself. He cannot do it. You know he's a choker. He cannot do it. So he said, let me form a partnership, which I call -- what do we call it? Go ahead. Go ahead. What do we call it? Let me form -- it's called collusion folks. It's called collusion. So I wrote up something. But here's a guy, couldn't fight by himself. He was saying how well he did. Look he's lying Ted. He holds the Bible high and then he lies. He puts it down. Lying Ted. Not worth it. We got lying Ted, we got crooked Hillary. There's no way we don't win this whole thing and turn our country around, OK? Lying -- so I get a call last night, about 11:30, and like you we work, you know? It's OK. Call me at 11:00, call me at 12:00, call me at 1:00. I'm a worker, you're workers too. And I said -- I dictated something over the phone. And I said, isn't sad that two grown politicians have to collude against one person who's only been a politician for 10 months, which is right. But, you know, I'm like a smart person, I know what to do. These politicians are all bought off with campaign contributions and super PACs and all of this, and some of them are very dumb, to be honest with you, OK? Some of them don't have a clue. I mean, how can you allow what's happened to our country to go on? You've either got to be grossly incompetent, which many are, or you've got to be under the control of the lobbyists and the special interests, which most of them are. Now, I'm self-funding, so it's a big difference folks. I don't care. I'm gonna do what's right for you. I do what's right for you. So I've been in this field for 10 months. In order to try and stop a person from getting the Republican nomination when we should be bringing everybody together. It's time. And I will tell you, I've been watching these dishonest people, some of the world's most dishonest people, the media. And you know what? They're not going to show this stadium, right Tom? They're not going to show this stadium. Show it Tom. Go ahead, Tom, show it. They're not going to show it. I'll go home and my wife will say, darling, were there many people there tonight? I said, you didn't see it? Because it's all on television. Look at all the lights. They'll say, were there many people and she'll say where there -- I said, you didn't see it. They never, ever show the crowds. We have the biggest crowds by far. And you know what? We have the greatest people by far. So I went on. Senator Cruz has done very poorly, especially with getting votes. He can't get votes. And after his New York performance, which was a total disaster, he was in a free fall. And you know he reacts very badly under pressure, he chokes under pressure. Boy, does he choke like a dog. Also, approximately 80% -- which is true. Might be high -- approximately 80% of the Republican Party, right now -- because I actually think that 20% is high, is against him. And against Kasich, it's even worse. Now, Kasich, he's only got, yeah, one state out of 41. So he's one for 41, and I'll tell you something. I had a dirty poll given to me. Florida and Ohio were being done at the same time, right? And I was winning Florida by a lot. Even though I was running against, actually a good guy, Marco Rubio. By this time Bush had dropped out. And you know, we're set up, because when they heard that Trump was running, they changed it. Because, let me tell you, we have a rigged system, we have a corrupt system. This whole thing with the delegates is ridiculous, and you have to go out and you have to get your beautiful delegate card and you have to vote for your delegates. The delegate. It's crazy. You know, it'd be nice if you could just go out and vote. We can win this state. I mean, we're way up in the polls. Don't let that fool you, go out tomorrow and vote. Don't let it fool you. But here's the story -- and they just said, Mr. Trump, when you go up there, can you please tell them to take their card, vote for the Trump delegates. I said, that's not like a cool thing to say during a speech. Vote for the Trump delegates. OK? Now I've done my job. You know, it'd be nice if you could just vote and just be done with it but the system is so complicated. Now we have a great head of the Republican Party, so we're very lucky, and we have some great people and we have some amazing delegates, and they're going to do a great job. But here's the story, here's the story -- thank you, I love you too. Look at this guy. All right. And you know, the Kasich thing is interesting, because here's a guy that just says, I'm going to stay. Like a stubborn -- like if you have a child who's a spoiled brat where they go, I don't care daddy. Get out of the room daddy, I don't care. This is like a spoiled guy. If you look at it, Ben Carson, who's endorsed me, did much better. I mean, he was tough. And Ben Carson -- Dr. Ben Carson, great. He did better. Chris Christie, who endorsed me, did better. Marco Rubio did much better. I mean, you look at Marco Rubio, he has more delegates right now than Kasich has and he's been in the race for a shorter period of time. It's just a guy that said, I don't care I'm staying. And then you see him eating in the morning -- you ever see -- I have never seen. He's stuffing pancakes in his mouth like this. And I'm always telling my boy, take small bites Barron. Little tiny bites. And yesterday he said, daddy who is that guy on television? That's disgusting. Did you ever see? Then they talk about presidential. Oh, I see, he's president -- he puts pancakes this big in his mouth and he's shoving them in. This is not a presidential person. Look, look -- but Marco Rubio has more delegates. But you have many. I mean, Jeb Bush could have stayed. A lot of people could have just said, I don't care. They have no path to victory folks and I'm going to win on the first ballot. I don't care about what's going on with the second -- you know they-- the press, I don't care. I don't care. It's a crooked system. So how would you like to have this, Trump wins by four or five million votes. You see California? I'm at 49%. We're going out to Indiana, and the people of Indiana are smart, and the people of Indiana know that I've been speaking about, for four months, the horrible treatment that Carrier air conditioning gave to the people that worked for him and to the people of Indianapolis, Indiana, when they said, you're all fired. Every one of you are fired, we're moving to Mexico. I've been talking about this long before I realized how important Indiana would be to this process, and the people in Indiana are smart. And I'll tell you what, I have one of the great endorsements of all time coming up in Indiana. I refuse to say it's Bobby Knight, but it's Bobby Knight. Great winner. No, he's a great champ. He's a great champion. That's great -- that's what I call a great endorsement. Tough, smart, knows how to win. That's what our country needs. That's why he's endorsing me. But that's what our country needs. All right. So others have done much better. Now, collusion. So what they did, they're both losing campaigns. They're failing campaigns, they're no good. They're done. You know, if you add up Cruz's and Kasich's votes, all of the votes, I'm beating them by a lot. If you add up the -- if you add up -- this is -- people going to be surprised to hear this. If you add up their delegates -- again, it's a rigged system, but if you add up the delegates of Cruz and Kasich, I'm beating them by a lot. Any -- by a lot. But to show you how corrupt the system is and how dishonest the system is, let's say I go up -- you know, the 1,237. Got to get 1,237. So I think we're going to beat it, I think we're going to do it fairly easily, I think we're going to get it. Who knows? But if you don't -- how about if we don't? We're going to do it, but how about if we don't? And these guys have been going out and buying dinners and hotels, and you know, all this stuff and they're buying up all these delegates. So how do you like to have somebody win on the second ballot that has three or four million votes less than Trump, that has four or five hundred delegates less than Trump, OK? No, but think of that. So we're going to pick a guy that ended up getting like, what was it? 10 or 12% in New York, that got no delegates. The other guy, Kasich, got practically nothing in New York, they ran them both out of town. Two tremendously failed candidates last week. They're going to pick somebody like that, and you know, give me a break, not going to happen. So -- so here, how about picking Kasich? He'll be -- that time he'll be one for 50. Ladies and gentlemen, our new nominee, a man that's been running for over one year. Yes, he won one state out of 50, and he happened to be in that state. But he's going to take it. Now let me tell you, the new poll came out, that has me tied with Hillary Clinton. But that's nothing because I haven't hit her yet. You know, somebody said, from the media -- they said from the media, because we're always -- and I always say, maybe -- you know, I'm know, I'm a smart person, I could change the presidential so easy. That would be so -- that would be much easier than doing what I'm doing right now, because I could talk nice and calm, and everybody would fall asleep after 10 minutes. Then you'd see them start leaving the upper decks. Look at that, the corner of the upper decks. Why didn't you show that media? Hey media, why didn't you show it? You dishonest media. The corners of the upper decks. Now they're not -- look, they don't move the cameras. They don't move the cameras. They don't move. They never move the cameras. They never move the cameras unless there's a phony protester around. Where -- do we have any protesters? I'd like to put a couple of protesters right up there where they can see. And think of it, 6,000 people not able to get in, standing outside. So, here's the story, we're going to win big tomorrow. You're going to go vote, you're going to vote for the delegates, you're going to do all the things you have to do. It's crazy. But we just got poll numbers from Rhode Island. I just got back from Rhode Island. Plus, I made two speeches today. We had two rallies in different parts of Pennsylvania. Yesterday, we had an unbelievable rally in Maryland, an airport hangar that was so big and so packed that people were flowing out into the runway areas. I mean, what's going on is a movement folks. We've been under cover -- and it's we. I'm the messenger. I'm a good messenger but I'm just -- it's about you. We've been on the cover of Time magazine many, many times in the last short period of time. In fact, I'm going to be at a dinner tomorrow night for Time magazine, the world -- the -- I guess the world's most -- 100 most important, something like that. You know what? Who cares? What I care about, I care about winning this nomination, beating crookery -- beating crooked Hillary Clinton and doing a great job for our nation, and we're going to do it. We are going to do it. You had to see though, Rhode Island, today. You know what happened? They didn't put me down for Rhode Island. I said, what are you talking -- well your poll numbers are so high there Mr. Trump, you're over 60%. I said, oh, I get it. Because I'm doing so well, I'm not going to take care of the people of Rhode Island. Doesn't work that way. So I had a little slot, we flew up to Rhode Island, we gave them like a 10-hour notice. The place was packed. And these are great people. We flew down to Delaware two days ago. Unbelievable people. We went to Maryland a couple of times. Packed, packed, packed. I've been all over Pennsylvania, right? All over. I've been all over. It's been unbelievable. I'll tell you, it's been unbelievable. It's been so great. So I hear we're doing great all over the place. But you know, a little bit about Rhode Island. So Rhode Island, you want to take care of people that are with you. I don't want to hear, you're doing great therefore you don't have to go there. No, no. If I'm doing great and if those people like me, that's why we want to go, right? Don't you think? So we're going to do good. So tomorrow's a big big day. So, here's the story, the end. Because of me everyone now sees that the Republican primary system is totally rigged and broken. When two candidates who have no path to victory -- they have no path. They're mathematically out. They ought to quit so we can all get together, we can all unify and we can all go against crooked Hillary Clinton and beat her. Really, really beat her big league. She'll be a terrible President, I will tell you, if she wins. I mean, even Kasich, what he's been saying about her. She's got bad judgment he said. And they said, don't say that anymore. Don't say that, that's terrible. He said, she's not qualified. Now that's a little -- I mean, who's not qualified? Everybody's -- we're all qualified, right? But then he said, OK, I'll take that back. We didn't forget that. Not qualified. But what she said -- what he said was amazing, that she has got bad judgment, and she has got bad judgment. Even on the e-mails. That's called -- it's criminal but it's really bad judgment folks, really bad judgment. And you look at Syria, and you look at Libya, and you look at all of the problems in the Middle East, and you look at what the hell has happened to the world. And then you look at President Obama, with one of the worst deals ever made -- with one of the worst deals ever made, the Iran deal. We give them $150 billion. We get nothing. We get nothing. Those days are gone. And by the way we should have had our prisoners back before we started negotiating folks. You don't negotiate like that. So we have two candidates running. They have no path to victory. One approved NAFTA and was really a very final vote, which has destroyed us. The other one loves TPP, Trans-Pacific Partnership, which is a catastrophe for this country, which will make NAFTA look like baby stuff. We can't let it get approved. And Cruz doesn't want to do anything about China's manipulation of their currency. He had the opportunity. He blew it. Here is a senator who has done nothing in the United States Senate. No legislation. Nothing important. He's been a bad senator. Doesn't get along with anybody. Has practically no endorsements. The man he respects most is Senator Jeff Sessions from Alabama, a great man and a great senator. There's only one problem. Jeff Sessions, two weeks ago, endorsed Donald Trump. Problem. So we're going to unify the party. So let's go. When I came down the escalator not so long ago, June 16th, with my wife, I looked down at Trump Tower and I saw the largest group of cameras and paparazzi and reporters. It looked like, literally, the Academy Awards. I say it. And I said, I didn't love doing this. I mean, I'm doing it because, honestly, we really can, not only make America great again -- I really believe we can make America greater than ever before. I really -- or I wouldn't be doing it. I wouldn't be doing it. And I stood up and I made a speech. And as you know, I brought up illegal immigration, I brought up trade, I brought up some other things but the primary thing was trade. Illegal immigration. We're going to rebuild our military, make it us stronger, bigger, better. The cheapest thing we can do. Nobody, ever, will mess with us because they just toy with us right now. They toy with us. And a lot of people, I heard it today, they said, well Trump is definitely the toughest one running but he may have a quick hand, a quick trigger. I've got the slowest trigger of anybody but nobody is going to play games with me. But I've got the slowest trigger. I'm the one that said, as a civilian -- I wasn't a politician but I said, at the beginning, don't go into Iraq, you're going to destabilize the entire Middle East, and that's exactly what happened. If our -- if our presidents and if our politicians went on vacation 15 years ago, we'd be a lot better off in the Middle East than we are right now. What we have right now is a big, fat, ugly mess, all right? A big mess. And they were the ones that pulled the trigger. And then I heard a certain Senator, Lindsey Graham, he said, I don't know why Donald Trump doesn't listen to me. I've been fighting this war for many years. That's right. I want to fight it for about two weeks folks. Not many years. Because we have to get back to our country. We have to rebuild America. We have to rebuild the United States. Our infrastructure is going to hell. We'll build three schools in different places in the Middle East. They get blown up, we rebuild it. They get blown up again and again and again, we -- but if we want to build a school in Pennsylvania, the government said, we have no money, right? No good. We've spent over four trillion dollars in the Middle East. We are in worse shape now than we were 15 years ago. And then when Obama got out, instead of doing it in a certain way and leaving some troops behind and protecting a little bit of whatever, if you call it one. Let's not even call it one. He took everybody out and he announced the date that he was leaving, and now you have a mess. And in comes ISIS, they take the oil. And I've been saying, for years, keep the oil, keep the oil. Don't let him have the oil. I didn't want to go in the first place, but I said, if you're to go out, take the oil. Because if you don't take the oil, Iran is going to get the oil and ISIS is going to get the oil. So who has the oil? Iran and ISIS, and Iraq. Which, by the way, for years and years, would fight with Iran. But they were the same military strength, right? So they'd fight for three, four years. Boom, boom, they go home and rest. Then they'd fight for three, four years. Boom, boom, then Saddam Hussein would hit somebody with gas, people would be complaining. Then the others would hit gas, they go -- they move 10 feet, 10 feet. What did we do? We went in and destroyed, destroyed the military capability of one of the two nations. And now Iran is taking over Iraq as sure as you're standing here. And is -- actually you people are all standing too, even though you have seats, which is a great honor. Thank you. It's always nice when people have seats and they still want to stand to hear Trump. Don't you agree? Always nice. It's always nice. I appreciate it. So we're going to change our focus. We're going to be so great on the military and on foreign policy, and we're going to do things right. You know, we protect many many nations and we're not reimbursed properly for the protection. Many of these nations are very wealthy nations. We protect Germany. We protect Japan. Love Germany. Love Japan. Many friends. We protect South Korea. Great, great -- from the madmen next door. We have 28,000 soldiers on the line. Very dangerous position to be in. They're making a fortune -- you order tele -- I ordered 4,000 television sets -- I order thousands a year for different projects. Thousands. Where do they come from? They come from South Korea. That's fine. They are money making behemoths. They don't take care of us. We protect Saudi Arabia. Saudi Arabia, I have many friends in Saudi Arabia, they buy my apartments. You wouldn't believe how they buy my apartments, OK? Many, many friends. But we protect Saudi Arabia. Before the oil went down, they were making one billion dollars a day. If we didn't protect them, they wouldn't be there for two weeks, but we protect them. We don't know what we're doing. And then we have a President that flies to Saudi Arabia last week and he gets off the plane, and there's nobody to greet him. And the same thing happened in Cuba. He goes to Cuba and instead of having one of the Castros or both of them greeting him at the plane, there's no high official waiting to greet the President of the United States coming out of Air Force One. Which, by the way, they will tell you, the dishonest media, but they will tell you, that has to be a record. In the history, the great, great history of Air Force One, how many times do you think it landed at an airport of hundreds and hundreds of countries where the top people in that country weren't there to greet the President of the United States? It happened to our President. It happened to our President twice in four weeks. Nobody. I'll tell you what, if I were the President and I flew into Saudi Arabia and the King or whoever, the top, isn't there to greet me, I say, hey pilot come here for a second. How much fuel do we have? We've got plenty sir, it's Air Force One. I say, get back at those controls pilot and let's get out of here, right? That's what I do. Let's get out of here. I would be out of there so fast. If they show the President of the United States -- thank you. Thank you. If they show the President of the United States so little respect, it's called, sorry folks, see you some other time. I mean, I remember a case not so long ago, everybody forgot it. The Olympics. Remember when the -- the President flew to Europe to make a pitch. Now, this the President the United States. He made a pitch for the Olympics to come to the United States. And I think that's great, I like it. But if you're the President, you don't go over there, make a pitch and then not win, right? Too big a position. If you're the President, you got to know the answer before you go over. So you call and say, listen, I'm the president and I'm going to go there, but between us, are we going to win? And they'll tell you, they'll say, no sir, you're going to come in fourth. I say, thank you very much, I appreciate it, but I'll -- you know, I'm not going to go, right? They don't do that. We're dealing with babies here folks. We're dealing with babies. So we have the President of the United States go over to make a pitch for the Olympics and he gets rejected. We didn't come in first or second or third. I think we came in like fourth. Who does that? Who does that? Are we dealing with babies? When you're the President of the United States and you want to get the Olympics to come to this country, and you go over there and you don't know the answer beforehand, you're incompetent. You're incompetent. Totally incompetent. So here's the story. Tomorrow's a big day and we're going to do great things. And as I said, I'm self-funding my campaign. And you know the nice part, of the major candidates, I put in far less than any other candidate and we're winning in a landslide by every single category. And on television, one of the very smart pundits said, why would Trump change? You know, I'm like a smart guy, went to the best school, one of the hardest schools in the world to get into, like -- I'm smart, where a lot of us are smart. By the way, we have -- the smartest and most loyal people are in these rooms. The Trump people are the smartest and they're, by far, the most loyal. By far. They are, by far, by far, the most loyal. So here's the story, here's the story. I have to tell you this. I have to. Here's the story. So they're talking about presidential, and this one pundit says, let me ask you a question, 17 people started and Trump was there, and we all said Trump's never going to run. Trump's never going to this, Trump's ever gonna sign Form A, which basically is signing your life away. Trump's a private company, he's never going to real -- he's never going to reveal his finances. So I announce that I'm running. I then signed my life away. I signed Form A. I then put in my financials early. I had the biggest law firms in Washington and the biggest accounting firms in Washington working round the clock because I didn't want to be even an hour late. And I could have had 45-day extensions all over the place. But I wanted to show my financials because I built a great company. I built a company, some of the greatest assets in the world. I built a company with a tremendous cash flow, with very little debt, and I put it in. Federal Elections, I put it in, almost 100 pages. The biggest report ever put it into Federal Elections. I started off with a million dollars. You know, you hear all these crazy numbers. Believe me, started off with a million dollars. My company's now worth more than $10 billion, and importantly, I tell you that it's not in a braggadocious manner. I tell you that because this is the kind of thinking, at least for a little while, that our country needs. We got to put our country back on track. If we're protecting the 28 countries of NATO, and if they're delinquent and they're not paying us because they have no respect for us, and if NATO is obsolete and has to be rejiggered, and if we have to do something about terror, which NATO doesn't really cover, it was many years ago -- you're talking about 68 or so years ago, we got to change things. And when somebody at one of the networks asked me, what do you think of NATO? Now, in all fairness, I'm a very good business person. But, you know what, NATO's never been high on my list but I understand that. I said, number one, it's obsolete. And guys that looked at it, that study it every day of their lives, at first they said, no it's not. Then about three days later they're saying, Trump's got a point. Because they're so close to it they don't even see it. Then I said, we have put up so much money to protect other countries, they've got to start paying for this protection. And they don't pay because probably nobody asks them for the money. And they don't pay because, honestly, they think we're stupid. So we're protecting these countries that aren't paying their fair share. They're not carrying their own baggage. And one of the early things I do is I say, folks -- and many of these countries are very wealthy. I say, folks you've got to pay us. They'll say OK. I said, no, no, no, no. You've got to also pay us for all those back years when you didn't pay us. It's called delinquency, right? Got to pay us. You've got to pay us. And we don't mind, we'll help you out and we'll protect but you've got to pay. We are no longer the stupid country, we're now the genius, brilliant country. OK? So you got to pay us. And you know the funny thing? I'll get a along better with these countries than we do right now and they'll be paying up because they're going to respect the United States again. They don't respect us, OK? Now, a couple of things. A couple of things then we're going to go home, then we're going to get a good night's rest and then tomorrow you're going to vote and get all your friends, OK? A couple of things. So the commentator said, you know I hear Trump maybe is thinking about pivoting to more presidential. The only thing is, that I don't understand, he had 16 opponents. Senators, governors. All these people. Top of the line. Nah, some of them not so good. 16. He had guys like Dr. Ben Carson, who's a phenomenal guy. A lot of people, right? He's a phenomenal guy. Wait a minute. So he goes through one, he wins. He goes through another, beats a governor, beats a senator, beats a governor, beats a senator. Now he beats a senator and now he beats three senators in a row, and I'm about to beat a senator who doesn't even have a clue, Ted Cruz. And I'm about to beat a governor who's one for 42. OK? So this person, who's a very smart pundit, said, you know, if I'm Trump, I don't think I want to change. And there's a lot of truth to that. But wait till you see what we do with this country. We're going to unify -- not only are we going to unify the Republican Party but we have a tremendously divided country. White and black. Everything we have, young and old. Everybody is at odds. You look at the African-American population in this country. Youth. African-American youth has a 59% rate of unemployment 59%. You look at African-American people, it's substantially higher. There is tremendous division because Obama is a tremendous divider. He divides. And he's done nothing for African-American people. I will tell you that. And I'm going to win the African-American vote and I'm going to win the Hispanic vote. And every poll, you look at the poll in Nevada, the poll -- big Hispanic population. I won the state of Nevada very easily, in a landslide. Cruz was supposed to win. I win all these states. He can't win when people have to vote. He can't win. So here's the story. I win it and they do an exit poll of the Hispanics, and who wins the exit poll by a lot? Donald Trump, OK? You know why? So I'm going to win the Hispanics, I'm going to win the African-Americans. You know why? Because I'm bringing jobs back to our country and I'm not letting the jobs that are here go without consequence. If somebody wants to take their factory, like Carrier did in Indiana, and they want to move to Mexico, we're going to tell them very nicely, enjoy Mexico, enjoy the heat. Just enjoy it. I hope you build a wonderful plant. But every single time you make an air conditioning unit -- and I buy from carrier but I'm not buying anymore. Every time you make an air conditioning unit and you want to send it across are now very, very strong border, with a wall, with our incredible -- with our incredible Border Patrol watching, and allowed to watch. Every time you make a unit and you send it across, we're going to charge you a 35% tax. I hope you enjoy your stay in Mexico, OK? And I'll tell you what's going to happen. They're not moving folks. They're not moving. They're not moving. I believe in free trade but you can only have free trade when you have smart, cunning, streetwise leadership. We don't have that. We have incompetent leadership, and therefore we have to play tough and we have to play smart. With China, we have a $500 billion trade deficit. It's crazy. And you know what? If any of you do business with China, you're going to find it's almost impossible to get your product in. And if you do get your product in, they charge you a tariff or a tax. With them, they send this stuff over, no good. Not going to happen. I want Apple products to be made in the United States. And you watch, it's going to happen. You watch. Now I have a tax plan that cuts taxes more than anybody else's plan, simplifies and cuts, simplifies and cuts. But remember this -- but forgetting even about that. We can do such --you know, for five years and even for seven years, these all-talk, no-action politicians in Washington have been working so hard to try and devise a plan to keep the countries in our -- in our country, where they take the companies and they keep them. Corporate inversion. They don't even know what the word is. It's corporate inversion. Trillions of dollars outside, companies want to bring it back in. We can't even get an agreement, and everybody agrees, Republicans and Democrats. Here's what we're going to do. We're going to make it very hard on people that want to leave our country and they want to fire all our people. There are going to be consequences. And if you look at some of the plans the government has, they make -- well, maybe we can give them low interest loans. Not going to do it. Maybe we could -- let me tell you what does it. Good old fashioned tax. A good old fashioned tax. The consequences -- you're going to fire your people from Indiana, you're going to fire these 1,400 people that did a phenomenal job for 30 years and 20 years and 14 and 15. I met many of them. That's not going to happen. If you want to do it, go. But when you come over -- and I'm telling you nobody's leaving. Try looking at their projections. Their projections won't work. Now, remember the one thing that nobody will say in terms of the pundits, when they say well the product will cost more. In some cases it'll cost more. But I say, please say the second part. They never write it. We'll also have a lot more jobs, OK? We're going to have a lot more jobs. And that's the key. That's the key. We're going to have jobs. We're going to have jobs making products for ourselves. We're going to have jobs making products that we export to other countries. And you know what? We're going to get along great with China. We're going to get along great. But we're not going to have a $505 billion deficit anymore. And when China wants to build a massive military fortress in the South China Sea, which they're not supposed to be doing, they're going to respect us if it's me because we have tremendous power, and it's called economic power. But we have people that don't know how to use it. We will be beloved by some of these countries. You look at Japan. Millions of cars come in. And we send them practically nothing and they want practically nothing. They don't want our product. So it's all going to change folks. So here's the story. You're going to remember this evening. We had a good time. I had no idea your arena was so beautiful but that's OK. In a packed arena, with thousands of people trying to get in, we had a great time. But more importantly, tomorrow, you're going to have a phenomenal time and you're going to represent the great state of Pennsylvania, which I love and I know very well. I know very well. And you're going to say -- when you look back in five years and 15 years and 25 years, and hopefully in 50 years from now, you're going to say, that was the single greatest vote I ever cast, for president Donald Trump. Because we're going to go on and we're going to beat crooked Hillary and we're going to win the White House. And we're going to have such victories but what you're gonna say is, you know it's amazing, when Donald Trump -- when President Trump -- and by the way, you're gonna have such love and respect for your President but I don't care. I don't care. What I really care -- you're gonna have great, new respect for your country again. Great, great respect. Great respect. And you're going to say, when President Trump took over, our country started winning again. We won with our military. We knocked the hell out of ISIS and then we go back and we want to take care of our country. But we won with our military. We've rebuilt it. We've made it so strong. We've made it so good. By the way, maybe the cheapest investment we can make folks. Maybe the cheapest investment we can make. We're going to take care of our great veterans who have been absolutely forgotten about. We're going to win with education. We're getting rid of Common Core and we're bringing education back, locally. We are going to terminate Obamacare and replace it with something far, far better. We are going to protect our Second Amendment, which is under siege. We are going to have strong, powerful, magnificent borders. We are going to build a great wall and Mexico is going to pay for the wall. And we're going to make great trade deals, not with political hacks that get the job because they give campaign contributions. We've got the most brilliant business people in the world in our country. We're going to be using our best people, our best negotiators. They've been calling me by the dozen. They don't want money. They want to make America great again. They're proud of our country. We're going to use our best people and we're going to bring back our jobs. And we're going to -- we are going to do great with trade. We are going to do great with trade. So folks go out tomorrow. Get a great night's sleep. Go out nice and early. Vote. And I promise you, 100%, we will make America great again. We will make it better than ever before. I love you Pennsylvania. I love you. Thank you. Thank you.Dd0ZG06ZZf8"}