{"id":396,"author":"Donald Trump","title":"Speech: Donald Trump in Warwick, RI","date":"2016-04-25","link":"https://factba.se/transcript/donald-trump-speech-warwick-ri-april-25-2016","paragraphs":["Thank you very much everybody. What an honor. You know we set this thing up like twelve hours ago. This is amazing. And you know what, they have thousands of people out there. The most incredible people and they can't. We got to get a bigger tent, get a bigger tent. Well, I want to thank you. First of all let's start by saying leave Tom Brady alone.","Leave him alone. Leave him alone. He's a great guy. It's enough. It's enough. All right. All right. Thank you very much. You know this started like 12 hours ago we said, I have to do this because we're going over we're doing great in Pennsylvania. We're doing great in Maryland that was in Maryland. Yesterday we had 17,000 people and a massive crowd and they were great.","What a rally, in fact I heard somebody today say, Nobody. Oh thank you. Thank you very much. That's very nice. Get him out. Get him out of here. Get him out. Who are these people? Where do they come from? Where do they come from? Get them out of here please. Right there. So this started this day. Yeah. Don't hurt him.","Don't hurt him. We have to be very gentle. Were going to be very gentle. All right? Where did these people come from? You know, in New York we had some protesters and they're all paid for but we had some protesters and we had these people. That nice people, they had a couple of hundred. And the press, the media, most dishonest people in the world, the most.","These are the most -- these people are probably more dishonest than lying Ted Cruz. That's a lot. But you know the press went up to him and they said to one woman, young woman, Why are you here? Do you like Donald Trump? Actually I do. She's holding a sign. It was manufactured, made in China and she's holding the sign.","Do you like Donald Trump? Why are you here? And they go, Thank you. and they go, No, I do like him quite a bit. Well why are you here? I don't know. Then they went to another one. What do you think of Donald Trump? I love him and he's holding this sign. Trump equals hate, I'm not equal hate, I equal love.","Believe me we are going to change things around. And that's going to be good for everybody. That's going to be good for everybody. So what happened is we're in Maryland and in Pennsylvania we went to Delaware and we're all over. And I said, What about Rhode Island? This was yesterday. What about Rhode Island?","And these professionals get paid a lot of money. They said, Oh no, that's OK. You're so popular up in Rhode Island. That's OK. Get him out. These are just professional agitators, folks. They're put in. It's the first time we've had it in many, many sessions but they put in there. They're just nothing but trouble.","They are nothing but trouble. I actually, I actually believe that they do not love our country. I'll be honest with you. I really believe that. They dont love our country. So he said, What about Rhode Island? Oh that's OK, Mr. Trump. You're doing so well in Rhode Island. You don't have to bother, I said, I'm bothering.","Set it up, set it up and that was yesterday morning. And I'll tell you what, my team in Rhode Island has been so amazing and I just want to thank everybody. The team -- the team has been -- the team has been so great and I want to thank them. Folks, folks, don't even think about it. It will be built. Don't even think about it. Don't waste your breath.","It will be built. Believe me, believe me. It will be built, that it'll go up fast and it'll be big and it'll be high and strong and it's going to help stop the drugs from pouring into Rhode Island where you have a big problem and everywhere else including New Hampshire which was my first big victory and one woman came up to me said, Mr. Trump we have a terrible, terrible heroin problem in New Hampshire.","And I look and I see. It's like this. I look I see the beautiful trees the beautiful roadways the beautiful everything the lakes. I said, What do you mean heroin? She said it's our single biggest problem. And then I realized it was. As I got to know New Hampshire and I said, If I win, we're going to stop this problem from poisoning our youth, fast.","And it's all coming from the same place folks. OK. We're going to get it stopped. We're going to get it stopped. So I wanted to talk about a couple of things that I do this and you know it's almost like I just -- we just won New York big, big, big league. Oh did you see the news today? Did you see where they band together?","Where they collude? You know it's collusion. You know, if you collude in business, if you collude in business or if you collude in the stock market, they put you in jail. But in politics, because it's a rigged system, because it's a corrupt enterprise, in politics you're allowed to collude. So they colluded and actually I was happy because it shows how weak they are.","It shows how pathetic they are. You know, I tweeted today @realDonaldTrump. By tweet, and that you know, solves it. Don't worry, I'll give it up after Im president. We wont tweet anymore. I know, not presidential. But let me tell you and I said, It takes two longtime politicians, right? to beat except they're way behind.","If you add up both votes and if you add up the both delegates they're way behind me so it doesn't matter. But it takes two guys, long time politicians to try and get together, to try and beat Trump. And yet they're way behind. And I said to myself, that's pretty bad. That's pretty bad. And here's the key.","I've only been doing this for 10 months. I haven't even been doing it very long. So I wanted to talk to you about one thing then we'll get back to the other and we'll get back to it. But I loved it when I heard it. I heard it last night at 11:30. I was called and they said, Sir, Kasich, We call him one for 41. I thought it was 38. He's won one race in 41 states.","One, OK, states and islands. So I call him now, I have a new nickname for him, One for 41. Very soon it's going to be one for 46 or 7. So, he's going nowhere. And he keeps talking about how he does with Hillary Clinton. He hasn't had one negative ad yet. When they put in the first negative ad about him he's going to collapse like a rock.","Well you what, why do you see this? Boom bomb. You'll see. You'll see. I will beat Hillary Clinton, crooked Hillary. I will beat her so badly, so badly and lying Ted Cruz cannot beat her. He cant beat her. Hey look. He got like no votes in New York. If you can't get any votes in New York its over, folks. He can beat her.","You look at his numbers in New Jersey. You look at his numbers all over the country. Lying Ted Cruz will lose so badly to crooked Hillary. It'll be one of the great defeats ever. And Kasich will also, as soon as they start putting up the negative ads -- Get him out, get him out. Are you glad I came up to Rhode Island?","And by the way I just saw coming up a new poll came. We're actually over 60 and I just found out. Listen to this. Listen, if we get 68 which was never meant to get because you know the whole system is so crazy. But if we get 68, we win everything, we win all the delegates. There's no shenanigans. And normally you wouldn't mention it but we're so close.","So if you can, you got to get out tomorrow to vote, all right? I will not let you down. Believe me I'm self-funding my campaign. These guys are all taking their money from special interests. Let me tell you, the politicians will never do the job because they're bought and paid for, folks. Just remember it. Just remember they're never going to do the job.","They're never going to do the job. In many cases they're incompetent. In some cases they're outright stupid and in many, many cases they're controlled. They're competent but they're controlled by the people that give them campaign financing and probably lots of other things. OK, so we are going to do the job.","We're going to bring jobs back to Rhode Island. You look at what's happened. Look, and I'll be honest. I've been doing this for eight or nine days. I'm going around New York State, I talk to Albany, Syracuse, Poughkeepsie, Bethpage, I've been all over the place and all of which, I could use the same stats.","The jobs have been ripped out of our country, folks. And if you look at a guy like Cruz who wants TPP, Trans-Pacific Partnership, that's going to be -- that is going to be worse. You watch, worse than NAFTA. Now you look at Kasich, I don't think he knows what you know. Did you see him? He has a news conference all the time when he's eating.","I have never seen a human being eat in such a disgusting fashion. I'm always telling my young son Barron. I'm saying, and I always do with my kids, all of them. I'd say, Children, small little bites, small. This guy takes a pancake and he's shoving in his mouth. It's disgusting. Do you want that for your president?","I don't think so. I don't think so. It's just honestly, it's disgusting. And then one of the things he said, You know they make a deal. Politicians they're no good for deals. So they make a deal at 11:30 last night. The deal is done. And this morning they talked to Kasich. And he goes, You know, I'm going to Indiana.","We're leading in Indiana. We have tremendous support in Indiana. It's a great place. Same thing happened by the way. Jobs are being sucked out of there by Mexico and they're all moving to Mexico and other places. China is taking up business. But you know I look at it and I see Kasich. You know what he approved?","NAFTA. He was one of the big pushers of NAFTA which destroyed New England, destroyed Rhode Island and destroyed big sections of our country because NAFTA was a disaster. Now he wants Trans-Pacific Partnership which is a group of countries that's going to do a number on our country like you've never seen before.","You can't let that happen. Now Cruz, Cruz doesn't want to stop China from devaluing its currency and monetary manipulation. The single greatest tool that various countries are using to hurt the United States and our companies, OK? And if you want to let people go ahead and devalue and if you want to let people get away with that.","And Cruz is the leader of the pack. He is bad for this country and it's bad for jobs and business. All right, bad. Now. It's sort of funny I watched Cruz this morning and he's all mixed up because he's losing so badly and when he's under pressure, he is like a basket case. So he's stuttering and he's stammering and I watch him and he's saying Oh I want jobs and I want the economy and I want this and I want that all stuff that I've been saying for years.","And he just started saying it. He doesn't know anything about the economy. He doesn't know anything about jobs. He was a failed senator. He couldn't get anything passed. Nothing. Look at his legislation. He got nothing passed and now he wants to be all he is, is a guy that will go down and stand and filibuster for a day or two.","And the other senators look when she get off the floor, Jim guy's a pain in the ass. When's he getting off the floor. You know, the senator that he most respects in the world is Senator Jeff Sessions of Alabama. Great stuff. And look at his early speeches. Everything was Jeff Sessions said and Jeff Sessions only one problem -- Jeff Sessions, Senator Jeff Sessions came out just recently and he endorsed Donald Trump, OK? Little interesting.","So, I think the fact that they colluded, I think the fact that they got together the two of these guys. Number one, it shows that they are just getting killed. You know, I laugh especially with Cruz because look, Kasich is going nowhere. Again, remember Kasich. You know I have a new nickname for him, One for 41. It was One for 38. But then they actually said, No, it's actually 41 states and I would have won Ohio if I had two more days to campaign there.","I came very close. Would've won Ohio but I had to stay in Florida and I won Florida in a big, big landslide. But you know the story. We were given a dirty poll and I was leading Florida by a lot and then all of a sudden two days, I was going up to Ohio. I was going all over Ohio. Then I got a dirty poll, I believe from NBC.","OK, I would say that and they were partners with the Wall Street Journal. So, who knows if it was dirty or not? But all of a sudden, I dropped from leading like 16 or 17. I went down to six. I said in Florida, I said, I have to stay here. I can't take a chance. This is bad. Then we had the election. I won in a landslide.","I wish I could have gone two days up to Ohio. We would have won. He would be 0 for 44. And what is he doing? What is he doing, really. He's just a stubborn guy. That's all he is. He's a stubborn guy. He's like, if you have a child you're just, I want it, Mommy. I don't care, Mommy. I want a daddy. I don't care.","I want it. That's all he is. Because let me tell you something, Chris Christie. Chris Christie who endorsed me was doing much better than Kasich. Think of this, Ben Carson, Dr. Ben Carson, Mendez guy, who endorsed me was doing much better than Kasich. Marco Rubio, a very good guy. I have to tell you, he, Marco Rubio who is -- has many more delegates right now than Kasich and he's been running a much -- he did much better than Kasich and you had numerous other people that were doing better than Kasich or would have if they said I'm not getting out.","I don't care. I don't care. You ever see it? He's eating today stuffing it. I never saw bites this big. He's pushing it in with his. I never saw a guy eat like this. I told my son he was watching he said, Daddy look. I said, Don't watch. Little bites, little bites. and he's up there. And honestly it shows such total weakness and it's pathetic when two long time insider politicians establishment guys whether you like it or not have to collude, have to get together to try and beat a guy that really speaks what the people want.","We want our jobs back. We want our military strong. We want our borders because otherwise we don't have a country and we're going to have the wall. But we want our borders back. We want to end the Common Core. We're going to end it and bring education locally. We're going to repeal and replace the horrible Obamacare which is a disaster.","We're going to save our Second Amendment which is under siege, under siege. And that's what we want, folks. You know, no great secrets. We want to make great trade deals. We can't have trade deals with China. This year has a trade. You look at the imbalance between China, Japan, Mexico and us. It's like we're a bunch of babies, like we're a bunch of stupid, stupid babies but we're not the babies.","Our leadership has no clue. They don't know what they're doing. They don't know what they're doing. And it can be ended so easily. It can be ended so easily. We have trade deficit, a trade deficit with China, $505 billion. This has been going on for years with Mexico, $58 billion. That's why they pay for the wall.","Number one, they used to say, Oh, they won't build a wall. Even the guys on stage when I debated, by the way, I've been center stage for every single debate, I beat everybody according to the polls. According to the debate polls, I beat every single person in the debate, every single debate. According to Drudge, who's a phenomenal guy, by the way, according to Drudge, according to Time magazine, according to Slate, according to everyone, they have like six , seven of them every time there's a debate.","You know, I think because of me, now they have a poll for everything. You know Im poll-oriented, OK. But every single debate that I heard, this guy Cruz, you know, he's getting killed, hes getting killed. I mean he got so badly beaten last week and he's getting killed generally. In fact I have to tell you, I don't think he's going to come in second anyway.","He's now in third place. But I heard Cruz say this, I wanted to beat Donald Trump. Donald Trump is afraid to debate me. He's afraid. You know with a hand. Oh yeah, yay! So dramatic, so dramatic. You know the truth? I heard he was a good debater in college and you know what? He might be but in college they don't interrupt you every 15 words like I do with him, OK. But you know what he's saying?","We want to debate Donald Trump. He's afraid to debate. You know the flourish and everything. And here's what happened. We do need Trump. Thank you honey. Thank you. Thank you. Thank you. Thank you Rhode Island. Thank you. Hey, now I'm glad I came up to Rhode Island, right? But I had a friend, I have to tell you this before we get back to his debate because I don't think he's a good debater.","If you want to know the truth. But let me just tell you. So I have friends in Rhode Island. So they were calling me though they would say, When are you coming up? Well I don't know. I guess you know I have schedulers. They call up. So I'm all over Pennsylvania, all over every place, Maryland, all over. Went to Delaware it was an amazing trip.","I went everywhere and he said, Well, when you're coming up? he said, I love Rhode Island I got to come. I said, Well, we're not scheduled. This was two days ago. I said, What you mean you know schedule. Well it's not that big a state. I said, But it's my people. These are great people. I don't care. I don't care.","I don't care. Now Cruz was coming up. You know what happened, Cruz was coming up and he canceled. Remember that he canceled. He was coming up two days ago. He canceled his trip to Rhode Island. So, I not only didn't cancel, I said, I don't care what your scheduler says. I don't care. Oh you look at that beautiful baby.","I love to hear babies cry a little bit. It's fine. It's good. But let me just tell you. I said, I don't care what our schedule is. I couldn't care less. We're going to run out. So they put it in. Now, I got to make two or three of these suckers. So let's see how I feel. Now is the end of the day. It won't be good because we're going right now.","Pennsylvania, same thing we have massive crowds, massive rallies. Same thing. And honestly, I want to thank all of those people because when the car drove up, you people are all in here, nice and comfortable but when the car drove up there were thousands of people on the road with Trump signs and We loved Trump.","I just get the word out get the word and I am so happy that I came. I have so many friends up here. One of the most beautiful places on earth. But we're going to straighten it out. We're going to bring your jobs back. We're gonna get rid of your cocaine problems and your other problems. We're going to get rid of them.","They're poisoning our youth. They're poisoning. So on the debate I saw -- I saw Cruz going. I want a debate. I want a debate. First of all, honestly you know when you're like 35 points up, debating is never a great thing even if you do kill him in the debates, right? You know normally speaking when you have a lead of 31 -- 31 points which is unheard of actually.","You don't say, Oh let's debate. Let's debate. But I won every single debate. We debated 11 times. Every single debate and by the way, he wasn't even coming in second and third most of the time. So now he goes, Donald Trump won't debate. Honestly folks, let's not waste our time. You know what we're going to be doing.","And I also say this, How many times can you have the same people asking the same questions to the candidates? I mean you know at some point you get So here's the story. Here's the story. We are going to bring jobs back to this country and Rhode Island. This guy. We are going to make great trade deals. The smartest people, Carl Icahn, the greatest business people in the world have endorsed me. We used political hacks to make the biggest deals in the world.","You know, big trade deals are far bigger than any company. No company deals are like little deals, no matter how big they are. Trade deals are really massive deals. We use political hacks, people with political connections, people that probably sell us out because they probably have interests in companies, because sometimes you wonder how could they make such bad deals?","They must be selling us out. They can't be that stupid. Anyway, we got the smartest. I know the smartest. I know the best. I know the best negotiators. I know the ones that are overrated. I know the ones you never heard of that are better than all of them. But we get to use our best people. You know when China comes into debate, when Mexico, which kills us at the border and kills us on trade, when Mexico comes in and they want to negotiate a trade deal, they're using guys that are sharp.","They're using killers with a lot of street smarts. When China comes in, all killers. They use killers. They used -- and they come in waves. They don't send one guy, You know let's sit down and talk. You'll have 15, 20 guys. So if a guy makes a mistake and then another one, they catch it. They catch it and we'll have a guy sitting there who's a political hack.","No more folks, we're going to have the smartest in the world. We're going to bring our jobs back. We're not going to let devaluation happen. We're not going to let them continue to devalue their currency so that we're all a bunch of dopes. We're not going to let it happen anymore. Thank you. Thank you. And I tell the story because I'm going to Indiana right after the election tomorrow.","We're going there. Which is a great state where I have a lot of a lot of support. I'm going to get Bobby Knight. I hope. I would love to get Bobby Knight, the great basketball coach from Indiana but you know what? You know what? He's an amazing guy. But you know what? I'm going to Indiana. They have a company in Indiana called Carrier by Carrier air conditioners.","I'm not buying anymore. They just announced they fired 1,400 people rather viciously and they announced they're moving from Indianapolis. They're moving from Indianapolis to Mexico. Now, when these countries do this, you know our politicians, our incompetent politicians, have been talking about this problem now for seven years, seven years.","Exactly, so they talk about it for seven years. They haven't done anything. They're talking about we have to create incentives, we have to do that. By the way, I'm lowering taxes more than any other candidate everyone is going to be happy. Were the highest tax nation. But even that, even that, such is not enough.","So what happens is, they say, Well we're going to give incentives. They've been talking for years. We're going to do this with nice complicated stuff that nobody's going to understand. Nobody cares. Here's what's going to happen when a company moves out from our land. They moved from Rhode Island. They moved from Indiana.","They moved from Pennsylvania which is getting hit hard, really hard, the steel industry, the coal industry. And by the way, the coal industry in West Virginia and Pennsylvania in Ohio, it's devastated. And you know who is using our coal? China is using our coal, folks. All right? China. We're going to open up our industries again.","We're going to get rid of these ridiculous rules and regulation. We want clean air. We want clean water. Very important, OK. But we're going to open up our industry. We're going to bring back our steel industry. We're getting dumped. And you know nobody ever says it's what they say. They say, Well, the steel will cost more.","They don't say though. And I always say, Make sure you say this. Make sure you say, Yes though the product may cost more. For instance, I want Apple to build their product in the United States, OK. That's going to be a big sign. They'll say well it'll cost more. Yes, but we'll also have thousands and thousands and thousands of more jobs.","So that's good. Make sure you say that. The media never reports the second part of the equation, OK. They never. So and nobody knows this stuff better than me. So here's what happens, when Carrier moves to Mexico, when Ford moves to Mexico, when Nabisco leaves Chicago and they move their big, big monster plant to Mexico.","Here's what happens. We tell the folks, listen, if you move to Mexico, we wish you a lot of luck. It's hot. Its this. Enjoy yourself. But you know what? And the Mexicans are great people. Thousands worked for me. They're phenomenal people. They're great but their leaders are too smart for our leaders. That's the problem because I believe in free trade but only when we have the right people.","So here's what happened. There have to be consequence. We're going to build a wall. There have to be consequence. So here's what I do. I tell and I'd like I want to do it myself. It's so easy. I love doing it. I don't take vacations like Obama. His whole life, the guy takes a six-month vacation twice a year.","It's terrible. So here's what we do. Here's what we do. You know he flies that Boeing 747 if he wants to play a round of golf. He flies it to Hawaii. Then he flies it back and then he says, The carbon footprint is being destroyed. I mean, give me a break. So here's the story. Folks, here's the story. There have to be consequences.","When Carrier leaves, Nabisco hundreds and hundreds of Ford. The consequence is this. Now ideally you do it before they build their plant. But you tell them, It's fine, if you leave. I just want you to know that if you leave Rhode Island, if you leave Indiana, if you leave Pennsylvania, if you leave Maryland where they're being hit very hard.","If you leave any of these states, Delaware, gets hit hard. You leave any of these. What you leave anywhere in a country that's fine. We wish you luck. Except here's the problem. Every time you build a unit whether it's a car or an air conditioning unit. Whatever it may be, that they make and they sell and you think you're going to come across our border which will now be very strong borders.","By the way, 1,600. Think of this actually. Sixteen thousand five hundred border patrol people endorsed me two weeks ago. They've never done that before. They've never endorsed. They never endorsed. Sixteen thousand five hundred, Sheriff Joe Arpaio from Arizona, the toughest on the border. Sheriff Joe, a great guy.","He endorsed me. Now you know when Sheriff Joe endorses but you know whos the tough one on the borders. And we're not going to be. We're going to be fair. We're not going to be tough. We're going to be fair. We're going to be smart and we want people to come into our country. But they have to come in legally.","They have to come in legally and they'll come in legally. We want that, OK. So here's what happens. We tell these companies before they leave, You can have a 35% tax every time you take a vehicle, every time you make a unit. And you know what's going to happen? They're going to call me and I didn't take their money so I couldn't care less.","All these other guys, Cruz and Kasich. I mean look at Kasich. Kasich is going around begging people for money. He's like a beggar. He's begging. He's going around. Please, can I have money? I want to continue onward. Even though I'm one for 43, I think it is. Please, please. I'm going to win because folks we're going to get it. I'm Oh, I'm not playing for the second, the third, the fourth.","You know, you hear all this crap about delegates. It's a fixed system. It's a rigged system. It's disgusting. But we're like, listen to this. We're like the boxer. He goes into unfriendly territory. The champ, I say, Champ what are you doing? What do you do and why you're going there? He said, You are going to lose.","If he goes , its not going through a vote. We're going to knock him out, knock out his first ballot, OK. We're going to go in the first ballot. That's what we count on. So that's what we count on. So Cruz has all of these bloodsuckers going around, trying to get second ballot, fourth, night ballot.","Honestly now OK. Assuming it ever did get to the second or third ballot. How do you let a guy run? I'm just saying you know Cruz to quit the system is crooked and it's rigged. But let's just hope it's not going to we're going to make it in the first ballot based on everything we see. But let's assume it goes to the second.","So how do you give a guy who's millions of votes behind Trump, who's five or six hundred delegates behind Trump because if I don't make it it's beat by like a little tiny bit. Right. I will make it. But how do you give a guy in the second third or fourth ballot the nomination when he failed in New York where everybody laughed at him where he can't get any votes where he's expected to come in third in virtually every contest this on Tuesday and some of those contests Kasich has actually given up. How do you give it to him and you can't give it to Kasich because you can't give it to a guy that by that time we'll be one in 50 or something.","OK. He'll be one in 50. Ladies and gentlemen our new nominee is John Kasich. He's won one state out of out of 50 and he's going to be. How do you do that? How do you do that? How do you do them? So you can't give it to Kasich. Remember he doesn't have one negative ad against him. As soon as they put the first ad out, he will collapse like a rock.","Believe me, just remember that. So how do you give it to these people? So here's the story folks. Here's the story. It's so important. We have a movement going on. Bill O'Reilly the other night who's a tough guy but a smart guy and other people have said. And Bill said and he's not friends -- he's tough.","A lot of people say, Don't do, he's too tough. But I don't mind doing because he's tough but he's fair but he said the other night, in his lifetime, what has happened to Donald Trump politically some most important event that he has ever witnessed in his lifetime. Now he's not talking about me. He's talking about you.","I mean look at this crowd. Look at this crowd. Look at this crowd. Thank you. Look at this crowd. And then add the probably four or five times the number of people in this room. You guys are good at real estate. Anybody in the room? You're very good. You know about real estate? But then you add all the thousands of people that are out there, running after the car with love in their hearts.","We have love in our hearts. This is why we're on the cover of Time magazine many, many times, many, many times over the last short period of time because they're talking about a movement. The likes of which and they say it, Our country has never seen before. Think of this, the Republican Party was getting very stale.","Let's face it, Romney failed. Romney failed, unfortunately but he failed and it didn't work. And here's what's happened to the Republican Party. In the world, the Republican Party has gone from sort of staid and stale and going nowhere in terms of presidential to being the hottest party right now, anywhere in the world.","We're up almost 70%, 70%. People -- people have said like in Nevada, they had lines where it used to be, you know, you'd look at the voting booths and people, they worked there for years and you'd see like two people in this massive room that have a good seat in Nevada which we won also. We won South Carolina, we won the South.","Cruz was supposed to win the South. He's got a bad organization but honestly, he's got -- he's a bad messenger. I'm a much better messenger, I believe. He's got a bad messenger and he's a bad message. But look, remember he was going to win South Carolina? He had weakened the border. Nikki Haley, she's very weak on borders and he thought that was a good thing.","It turned out I had the lieutenant governor that was much better and I won in a landslide. I won the evangelicals, I won the women, I won every single group. Then we went -- we went to Nevada. I won Nevada in a landslide and by the way, the polls, going off the exit polls. They did exit polls of Hispanics.","I won the Hispanics. We're going to win the Hispanics. And we're going to win the African-Americans because I'm going to bring jobs back to this country. We need jobs. We're going to win. Why do you think Hillary Clinton is going to bring jobs back? Hillary Clinton will not bring jobs back. That I can tell you.","Hillary Clinton, Hillary Clinton doesn't have a clue when it comes to what we're talking about. And by the way she's controlled by all of the people that don't want the jobs to come back, OK. She has control and she's controlled by the open border people folks. She wants open borders. She wants people to flood in. You know what they just did in the state of Virginia?","Two hundred thousand people that were in prison for horrible crimes, for horrible crimes are being given the right to vote for the first time. That's crooked politics because Virginia is a very close state. I would win Virginia. I have a lot of employees a tremendous amount of property in Virginia. They're giving 200,000 people that have been convicted of heinous crimes, horrible crimes, the worst crimes the right to vote because you know what they know they're going to vote Democrat.","They're going to vote Democrat. And that could be the swing. That's how disgusting and dishonest our political system is, all right? It's dishonest, OK. You ready? So here's the story folks. You're going to go and you're going to vote and you're going to remember this very warm morning at this tent that should have been bigger but they ran out of. No, no they ran out of land.","The hotel man told me, where's my hotel man? He's a great guy. Where the hell is he? He owns a hotel. Where is he? He's like central casting for ownership of a hotel. He said, Mr. Trump, I've owned this hotel for many years. This is by far the biggest crowd we've ever had. We've never had anything. No, no. Oh, by the way, my son Eric.","Come here, Come here, Come here, Come here.","My children. I mean they'll always be children to me. I don't care, right? But my children have been so amazing. Yvonne aka Don Eric Tiffany Barron will be. He's a little on the young side right now. But we've had we've had a great time. So here's what's going to happen. I want to thank Eric because now we're going over to Pennsylvania to get -- he's going to spend the day.","But here's what's going to happen. You're going to remember this afternoon. You're going to remember the fun we had even though the subject is bad. The subject is how we're doing. And I didn't even want to read it because it's too depressing. But I didn't read it. But listen, listen according to the United States Bureau of Labor Statistics, Rhode Island has lost 60% of its manufacturing jobs since 1990. The Warwick region of the state.","We love Warwick, right? Has lost. Has lost. Yes, I know but don't let this happen. Forty four percent of its manufacturing jobs since 2001, that's when China joined the World Trade Organization. Oh, isn't that a surprise, right? There are 20,000 fewer people in the workforce in Rhode Island today than in 2006. That's pretty close, right?","The number of people on food stamps has increased 150%. Now here's one I don't like. Syrian refugees are now being resettled in Rhode Island. We don't know where they're from. We don't know where they're from. They have no documentation. We all have hearts and we can build safe zones in Syria. We'll get the Gulf states to put up the money.","We're not putting up the money but I'll get that done. But you know what? We can't let this happen. But you have a lot of them resettling in Rhode Island. Just enjoy -- you lock your doors folks, OK. Lock your door. Oh it's a big problem. We don't know anything about them. We don't know where they come from, who they are.","There's no documentation. We have our incompetent government people letting them in by the thousands. And who knows, who knows maybe it's ISIS. You see what happens with two people that became radicalized in California where they shot and killed all their co-workers, OK. Not with me folks, it's not happening with me. OK, so here is what's -- here's what's going to happen.","We don't -- we don't win. Our country doesn't win anymore. We don't win with our military, we can't beat ISIS. We're going to knock the hell out of them, folks because we're going to build a bigger and better things. We don't win for our vets because our vets are not being properly taken care of. And they will be if I'm elected president but we're going to start winning again.","We're going to win with our military. We're going to win for our vets. We're going to win in education. We're going to have our local education that's going to be a beautiful thing to watch. We're going to win with health care. We're going to win it the borders and we're going to win with trade. We're going to win so much.","Actually some of you may get tired of winning. You may say, Please, please, we can't take it anymore, Mr. President. Please, please don't win anymore Mr. President. And you know what I'm going to say, I'm sorry we're going to keep winning. We're going to make up for lost time. And we are going to make America great again. Thank you everybody. Thank you. Thank you."],"text":" Thank you very much everybody. What an honor. You know we set this thing up like twelve hours ago. This is amazing. And you know what, they have thousands of people out there. The most incredible people and they can't. We got to get a bigger tent, get a bigger tent. Well, I want to thank you. First of all let's start by saying leave Tom Brady alone. Leave him alone. Leave him alone. He's a great guy. It's enough. It's enough. All right. All right. Thank you very much. You know this started like 12 hours ago we said, I have to do this because we're going over we're doing great in Pennsylvania. We're doing great in Maryland that was in Maryland. Yesterday we had 17,000 people and a massive crowd and they were great. What a rally, in fact I heard somebody today say, Nobody. Oh thank you. Thank you very much. That's very nice. Get him out. Get him out of here. Get him out. Who are these people? Where do they come from? Where do they come from? Get them out of here please. Right there. So this started this day. Yeah. Don't hurt him. Don't hurt him. We have to be very gentle. Were going to be very gentle. All right? Where did these people come from? You know, in New York we had some protesters and they're all paid for but we had some protesters and we had these people. That nice people, they had a couple of hundred. And the press, the media, most dishonest people in the world, the most. These are the most -- these people are probably more dishonest than lying Ted Cruz. That's a lot. But you know the press went up to him and they said to one woman, young woman, Why are you here? Do you like Donald Trump? Actually I do. She's holding a sign. It was manufactured, made in China and she's holding the sign. Do you like Donald Trump? Why are you here? And they go, Thank you. and they go, No, I do like him quite a bit. Well why are you here? I don't know. Then they went to another one. What do you think of Donald Trump? I love him and he's holding this sign. Trump equals hate, I'm not equal hate, I equal love. Believe me we are going to change things around. And that's going to be good for everybody. That's going to be good for everybody. So what happened is we're in Maryland and in Pennsylvania we went to Delaware and we're all over. And I said, What about Rhode Island? This was yesterday. What about Rhode Island? And these professionals get paid a lot of money. They said, Oh no, that's OK. You're so popular up in Rhode Island. That's OK. Get him out. These are just professional agitators, folks. They're put in. It's the first time we've had it in many, many sessions but they put in there. They're just nothing but trouble. They are nothing but trouble. I actually, I actually believe that they do not love our country. I'll be honest with you. I really believe that. They dont love our country. So he said, What about Rhode Island? Oh that's OK, Mr. Trump. You're doing so well in Rhode Island. You don't have to bother, I said, I'm bothering. Set it up, set it up and that was yesterday morning. And I'll tell you what, my team in Rhode Island has been so amazing and I just want to thank everybody. The team -- the team has been -- the team has been so great and I want to thank them. Folks, folks, don't even think about it. It will be built. Don't even think about it. Don't waste your breath. It will be built. Believe me, believe me. It will be built, that it'll go up fast and it'll be big and it'll be high and strong and it's going to help stop the drugs from pouring into Rhode Island where you have a big problem and everywhere else including New Hampshire which was my first big victory and one woman came up to me said, Mr. Trump we have a terrible, terrible heroin problem in New Hampshire. And I look and I see. It's like this. I look I see the beautiful trees the beautiful roadways the beautiful everything the lakes. I said, What do you mean heroin? She said it's our single biggest problem. And then I realized it was. As I got to know New Hampshire and I said, If I win, we're going to stop this problem from poisoning our youth, fast. And it's all coming from the same place folks. OK. We're going to get it stopped. We're going to get it stopped. So I wanted to talk about a couple of things that I do this and you know it's almost like I just -- we just won New York big, big, big league. Oh did you see the news today? Did you see where they band together? Where they collude? You know it's collusion. You know, if you collude in business, if you collude in business or if you collude in the stock market, they put you in jail. But in politics, because it's a rigged system, because it's a corrupt enterprise, in politics you're allowed to collude. So they colluded and actually I was happy because it shows how weak they are. It shows how pathetic they are. You know, I tweeted today @realDonaldTrump. By tweet, and that you know, solves it. Don't worry, I'll give it up after Im president. We wont tweet anymore. I know, not presidential. But let me tell you and I said, It takes two longtime politicians, right? to beat except they're way behind. If you add up both votes and if you add up the both delegates they're way behind me so it doesn't matter. But it takes two guys, long time politicians to try and get together, to try and beat Trump. And yet they're way behind. And I said to myself, that's pretty bad. That's pretty bad. And here's the key. I've only been doing this for 10 months. I haven't even been doing it very long. So I wanted to talk to you about one thing then we'll get back to the other and we'll get back to it. But I loved it when I heard it. I heard it last night at 11:30. I was called and they said, Sir, Kasich, We call him one for 41. I thought it was 38. He's won one race in 41 states. One, OK, states and islands. So I call him now, I have a new nickname for him, One for 41. Very soon it's going to be one for 46 or 7. So, he's going nowhere. And he keeps talking about how he does with Hillary Clinton. He hasn't had one negative ad yet. When they put in the first negative ad about him he's going to collapse like a rock. Well you what, why do you see this? Boom bomb. You'll see. You'll see. I will beat Hillary Clinton, crooked Hillary. I will beat her so badly, so badly and lying Ted Cruz cannot beat her. He cant beat her. Hey look. He got like no votes in New York. If you can't get any votes in New York its over, folks. He can beat her. You look at his numbers in New Jersey. You look at his numbers all over the country. Lying Ted Cruz will lose so badly to crooked Hillary. It'll be one of the great defeats ever. And Kasich will also, as soon as they start putting up the negative ads -- Get him out, get him out. Are you glad I came up to Rhode Island? And by the way I just saw coming up a new poll came. We're actually over 60 and I just found out. Listen to this. Listen, if we get 68 which was never meant to get because you know the whole system is so crazy. But if we get 68, we win everything, we win all the delegates. There's no shenanigans. And normally you wouldn't mention it but we're so close. So if you can, you got to get out tomorrow to vote, all right? I will not let you down. Believe me I'm self-funding my campaign. These guys are all taking their money from special interests. Let me tell you, the politicians will never do the job because they're bought and paid for, folks. Just remember it. Just remember they're never going to do the job. They're never going to do the job. In many cases they're incompetent. In some cases they're outright stupid and in many, many cases they're controlled. They're competent but they're controlled by the people that give them campaign financing and probably lots of other things. OK, so we are going to do the job. We're going to bring jobs back to Rhode Island. You look at what's happened. Look, and I'll be honest. I've been doing this for eight or nine days. I'm going around New York State, I talk to Albany, Syracuse, Poughkeepsie, Bethpage, I've been all over the place and all of which, I could use the same stats. The jobs have been ripped out of our country, folks. And if you look at a guy like Cruz who wants TPP, Trans-Pacific Partnership, that's going to be -- that is going to be worse. You watch, worse than NAFTA. Now you look at Kasich, I don't think he knows what you know. Did you see him? He has a news conference all the time when he's eating. I have never seen a human being eat in such a disgusting fashion. I'm always telling my young son Barron. I'm saying, and I always do with my kids, all of them. I'd say, Children, small little bites, small. This guy takes a pancake and he's shoving in his mouth. It's disgusting. Do you want that for your president? I don't think so. I don't think so. It's just honestly, it's disgusting. And then one of the things he said, You know they make a deal. Politicians they're no good for deals. So they make a deal at 11:30 last night. The deal is done. And this morning they talked to Kasich. And he goes, You know, I'm going to Indiana. We're leading in Indiana. We have tremendous support in Indiana. It's a great place. Same thing happened by the way. Jobs are being sucked out of there by Mexico and they're all moving to Mexico and other places. China is taking up business. But you know I look at it and I see Kasich. You know what he approved? NAFTA. He was one of the big pushers of NAFTA which destroyed New England, destroyed Rhode Island and destroyed big sections of our country because NAFTA was a disaster. Now he wants Trans-Pacific Partnership which is a group of countries that's going to do a number on our country like you've never seen before. You can't let that happen. Now Cruz, Cruz doesn't want to stop China from devaluing its currency and monetary manipulation. The single greatest tool that various countries are using to hurt the United States and our companies, OK? And if you want to let people go ahead and devalue and if you want to let people get away with that. And Cruz is the leader of the pack. He is bad for this country and it's bad for jobs and business. All right, bad. Now. It's sort of funny I watched Cruz this morning and he's all mixed up because he's losing so badly and when he's under pressure, he is like a basket case. So he's stuttering and he's stammering and I watch him and he's saying Oh I want jobs and I want the economy and I want this and I want that all stuff that I've been saying for years. And he just started saying it. He doesn't know anything about the economy. He doesn't know anything about jobs. He was a failed senator. He couldn't get anything passed. Nothing. Look at his legislation. He got nothing passed and now he wants to be all he is, is a guy that will go down and stand and filibuster for a day or two. And the other senators look when she get off the floor, Jim guy's a pain in the ass. When's he getting off the floor. You know, the senator that he most respects in the world is Senator Jeff Sessions of Alabama. Great stuff. And look at his early speeches. Everything was Jeff Sessions said and Jeff Sessions only one problem -- Jeff Sessions, Senator Jeff Sessions came out just recently and he endorsed Donald Trump, OK? Little interesting. So, I think the fact that they colluded, I think the fact that they got together the two of these guys. Number one, it shows that they are just getting killed. You know, I laugh especially with Cruz because look, Kasich is going nowhere. Again, remember Kasich. You know I have a new nickname for him, One for 41. It was One for 38. But then they actually said, No, it's actually 41 states and I would have won Ohio if I had two more days to campaign there. I came very close. Would've won Ohio but I had to stay in Florida and I won Florida in a big, big landslide. But you know the story. We were given a dirty poll and I was leading Florida by a lot and then all of a sudden two days, I was going up to Ohio. I was going all over Ohio. Then I got a dirty poll, I believe from NBC. OK, I would say that and they were partners with the Wall Street Journal. So, who knows if it was dirty or not? But all of a sudden, I dropped from leading like 16 or 17. I went down to six. I said in Florida, I said, I have to stay here. I can't take a chance. This is bad. Then we had the election. I won in a landslide. I wish I could have gone two days up to Ohio. We would have won. He would be 0 for 44. And what is he doing? What is he doing, really. He's just a stubborn guy. That's all he is. He's a stubborn guy. He's like, if you have a child you're just, I want it, Mommy. I don't care, Mommy. I want a daddy. I don't care. I want it. That's all he is. Because let me tell you something, Chris Christie. Chris Christie who endorsed me was doing much better than Kasich. Think of this, Ben Carson, Dr. Ben Carson, Mendez guy, who endorsed me was doing much better than Kasich. Marco Rubio, a very good guy. I have to tell you, he, Marco Rubio who is -- has many more delegates right now than Kasich and he's been running a much -- he did much better than Kasich and you had numerous other people that were doing better than Kasich or would have if they said I'm not getting out. I don't care. I don't care. You ever see it? He's eating today stuffing it. I never saw bites this big. He's pushing it in with his. I never saw a guy eat like this. I told my son he was watching he said, Daddy look. I said, Don't watch. Little bites, little bites. and he's up there. And honestly it shows such total weakness and it's pathetic when two long time insider politicians establishment guys whether you like it or not have to collude, have to get together to try and beat a guy that really speaks what the people want. We want our jobs back. We want our military strong. We want our borders because otherwise we don't have a country and we're going to have the wall. But we want our borders back. We want to end the Common Core. We're going to end it and bring education locally. We're going to repeal and replace the horrible Obamacare which is a disaster. We're going to save our Second Amendment which is under siege, under siege. And that's what we want, folks. You know, no great secrets. We want to make great trade deals. We can't have trade deals with China. This year has a trade. You look at the imbalance between China, Japan, Mexico and us. It's like we're a bunch of babies, like we're a bunch of stupid, stupid babies but we're not the babies. Our leadership has no clue. They don't know what they're doing. They don't know what they're doing. And it can be ended so easily. It can be ended so easily. We have trade deficit, a trade deficit with China, $505 billion. This has been going on for years with Mexico, $58 billion. That's why they pay for the wall. Number one, they used to say, Oh, they won't build a wall. Even the guys on stage when I debated, by the way, I've been center stage for every single debate, I beat everybody according to the polls. According to the debate polls, I beat every single person in the debate, every single debate. According to Drudge, who's a phenomenal guy, by the way, according to Drudge, according to Time magazine, according to Slate, according to everyone, they have like six , seven of them every time there's a debate. You know, I think because of me, now they have a poll for everything. You know Im poll-oriented, OK. But every single debate that I heard, this guy Cruz, you know, he's getting killed, hes getting killed. I mean he got so badly beaten last week and he's getting killed generally. In fact I have to tell you, I don't think he's going to come in second anyway. He's now in third place. But I heard Cruz say this, I wanted to beat Donald Trump. Donald Trump is afraid to debate me. He's afraid. You know with a hand. Oh yeah, yay! So dramatic, so dramatic. You know the truth? I heard he was a good debater in college and you know what? He might be but in college they don't interrupt you every 15 words like I do with him, OK. But you know what he's saying? We want to debate Donald Trump. He's afraid to debate. You know the flourish and everything. And here's what happened. We do need Trump. Thank you honey. Thank you. Thank you. Thank you. Thank you Rhode Island. Thank you. Hey, now I'm glad I came up to Rhode Island, right? But I had a friend, I have to tell you this before we get back to his debate because I don't think he's a good debater. If you want to know the truth. But let me just tell you. So I have friends in Rhode Island. So they were calling me though they would say, When are you coming up? Well I don't know. I guess you know I have schedulers. They call up. So I'm all over Pennsylvania, all over every place, Maryland, all over. Went to Delaware it was an amazing trip. I went everywhere and he said, Well, when you're coming up? he said, I love Rhode Island I got to come. I said, Well, we're not scheduled. This was two days ago. I said, What you mean you know schedule. Well it's not that big a state. I said, But it's my people. These are great people. I don't care. I don't care. I don't care. Now Cruz was coming up. You know what happened, Cruz was coming up and he canceled. Remember that he canceled. He was coming up two days ago. He canceled his trip to Rhode Island. So, I not only didn't cancel, I said, I don't care what your scheduler says. I don't care. Oh you look at that beautiful baby. I love to hear babies cry a little bit. It's fine. It's good. But let me just tell you. I said, I don't care what our schedule is. I couldn't care less. We're going to run out. So they put it in. Now, I got to make two or three of these suckers. So let's see how I feel. Now is the end of the day. It won't be good because we're going right now. Pennsylvania, same thing we have massive crowds, massive rallies. Same thing. And honestly, I want to thank all of those people because when the car drove up, you people are all in here, nice and comfortable but when the car drove up there were thousands of people on the road with Trump signs and We loved Trump. I just get the word out get the word and I am so happy that I came. I have so many friends up here. One of the most beautiful places on earth. But we're going to straighten it out. We're going to bring your jobs back. We're gonna get rid of your cocaine problems and your other problems. We're going to get rid of them. They're poisoning our youth. They're poisoning. So on the debate I saw -- I saw Cruz going. I want a debate. I want a debate. First of all, honestly you know when you're like 35 points up, debating is never a great thing even if you do kill him in the debates, right? You know normally speaking when you have a lead of 31 -- 31 points which is unheard of actually. You don't say, Oh let's debate. Let's debate. But I won every single debate. We debated 11 times. Every single debate and by the way, he wasn't even coming in second and third most of the time. So now he goes, Donald Trump won't debate. Honestly folks, let's not waste our time. You know what we're going to be doing. And I also say this, How many times can you have the same people asking the same questions to the candidates? I mean you know at some point you get So here's the story. Here's the story. We are going to bring jobs back to this country and Rhode Island. This guy. We are going to make great trade deals. The smartest people, Carl Icahn, the greatest business people in the world have endorsed me. We used political hacks to make the biggest deals in the world. You know, big trade deals are far bigger than any company. No company deals are like little deals, no matter how big they are. Trade deals are really massive deals. We use political hacks, people with political connections, people that probably sell us out because they probably have interests in companies, because sometimes you wonder how could they make such bad deals? They must be selling us out. They can't be that stupid. Anyway, we got the smartest. I know the smartest. I know the best. I know the best negotiators. I know the ones that are overrated. I know the ones you never heard of that are better than all of them. But we get to use our best people. You know when China comes into debate, when Mexico, which kills us at the border and kills us on trade, when Mexico comes in and they want to negotiate a trade deal, they're using guys that are sharp. They're using killers with a lot of street smarts. When China comes in, all killers. They use killers. They used -- and they come in waves. They don't send one guy, You know let's sit down and talk. You'll have 15, 20 guys. So if a guy makes a mistake and then another one, they catch it. They catch it and we'll have a guy sitting there who's a political hack. No more folks, we're going to have the smartest in the world. We're going to bring our jobs back. We're not going to let devaluation happen. We're not going to let them continue to devalue their currency so that we're all a bunch of dopes. We're not going to let it happen anymore. Thank you. Thank you. And I tell the story because I'm going to Indiana right after the election tomorrow. We're going there. Which is a great state where I have a lot of a lot of support. I'm going to get Bobby Knight. I hope. I would love to get Bobby Knight, the great basketball coach from Indiana but you know what? You know what? He's an amazing guy. But you know what? I'm going to Indiana. They have a company in Indiana called Carrier by Carrier air conditioners. I'm not buying anymore. They just announced they fired 1,400 people rather viciously and they announced they're moving from Indianapolis. They're moving from Indianapolis to Mexico. Now, when these countries do this, you know our politicians, our incompetent politicians, have been talking about this problem now for seven years, seven years. Exactly, so they talk about it for seven years. They haven't done anything. They're talking about we have to create incentives, we have to do that. By the way, I'm lowering taxes more than any other candidate everyone is going to be happy. Were the highest tax nation. But even that, even that, such is not enough. So what happens is, they say, Well we're going to give incentives. They've been talking for years. We're going to do this with nice complicated stuff that nobody's going to understand. Nobody cares. Here's what's going to happen when a company moves out from our land. They moved from Rhode Island. They moved from Indiana. They moved from Pennsylvania which is getting hit hard, really hard, the steel industry, the coal industry. And by the way, the coal industry in West Virginia and Pennsylvania in Ohio, it's devastated. And you know who is using our coal? China is using our coal, folks. All right? China. We're going to open up our industries again. We're going to get rid of these ridiculous rules and regulation. We want clean air. We want clean water. Very important, OK. But we're going to open up our industry. We're going to bring back our steel industry. We're getting dumped. And you know nobody ever says it's what they say. They say, Well, the steel will cost more. They don't say though. And I always say, Make sure you say this. Make sure you say, Yes though the product may cost more. For instance, I want Apple to build their product in the United States, OK. That's going to be a big sign. They'll say well it'll cost more. Yes, but we'll also have thousands and thousands and thousands of more jobs. So that's good. Make sure you say that. The media never reports the second part of the equation, OK. They never. So and nobody knows this stuff better than me. So here's what happens, when Carrier moves to Mexico, when Ford moves to Mexico, when Nabisco leaves Chicago and they move their big, big monster plant to Mexico. Here's what happens. We tell the folks, listen, if you move to Mexico, we wish you a lot of luck. It's hot. Its this. Enjoy yourself. But you know what? And the Mexicans are great people. Thousands worked for me. They're phenomenal people. They're great but their leaders are too smart for our leaders. That's the problem because I believe in free trade but only when we have the right people. So here's what happened. There have to be consequence. We're going to build a wall. There have to be consequence. So here's what I do. I tell and I'd like I want to do it myself. It's so easy. I love doing it. I don't take vacations like Obama. His whole life, the guy takes a six-month vacation twice a year. It's terrible. So here's what we do. Here's what we do. You know he flies that Boeing 747 if he wants to play a round of golf. He flies it to Hawaii. Then he flies it back and then he says, The carbon footprint is being destroyed. I mean, give me a break. So here's the story. Folks, here's the story. There have to be consequences. When Carrier leaves, Nabisco hundreds and hundreds of Ford. The consequence is this. Now ideally you do it before they build their plant. But you tell them, It's fine, if you leave. I just want you to know that if you leave Rhode Island, if you leave Indiana, if you leave Pennsylvania, if you leave Maryland where they're being hit very hard. If you leave any of these states, Delaware, gets hit hard. You leave any of these. What you leave anywhere in a country that's fine. We wish you luck. Except here's the problem. Every time you build a unit whether it's a car or an air conditioning unit. Whatever it may be, that they make and they sell and you think you're going to come across our border which will now be very strong borders. By the way, 1,600. Think of this actually. Sixteen thousand five hundred border patrol people endorsed me two weeks ago. They've never done that before. They've never endorsed. They never endorsed. Sixteen thousand five hundred, Sheriff Joe Arpaio from Arizona, the toughest on the border. Sheriff Joe, a great guy. He endorsed me. Now you know when Sheriff Joe endorses but you know whos the tough one on the borders. And we're not going to be. We're going to be fair. We're not going to be tough. We're going to be fair. We're going to be smart and we want people to come into our country. But they have to come in legally. They have to come in legally and they'll come in legally. We want that, OK. So here's what happens. We tell these companies before they leave, You can have a 35% tax every time you take a vehicle, every time you make a unit. And you know what's going to happen? They're going to call me and I didn't take their money so I couldn't care less. All these other guys, Cruz and Kasich. I mean look at Kasich. Kasich is going around begging people for money. He's like a beggar. He's begging. He's going around. Please, can I have money? I want to continue onward. Even though I'm one for 43, I think it is. Please, please. I'm going to win because folks we're going to get it. I'm Oh, I'm not playing for the second, the third, the fourth. You know, you hear all this crap about delegates. It's a fixed system. It's a rigged system. It's disgusting. But we're like, listen to this. We're like the boxer. He goes into unfriendly territory. The champ, I say, Champ what are you doing? What do you do and why you're going there? He said, You are going to lose. If he goes , its not going through a vote. We're going to knock him out, knock out his first ballot, OK. We're going to go in the first ballot. That's what we count on. So that's what we count on. So Cruz has all of these bloodsuckers going around, trying to get second ballot, fourth, night ballot. Honestly now OK. Assuming it ever did get to the second or third ballot. How do you let a guy run? I'm just saying you know Cruz to quit the system is crooked and it's rigged. But let's just hope it's not going to we're going to make it in the first ballot based on everything we see. But let's assume it goes to the second. So how do you give a guy who's millions of votes behind Trump, who's five or six hundred delegates behind Trump because if I don't make it it's beat by like a little tiny bit. Right. I will make it. But how do you give a guy in the second third or fourth ballot the nomination when he failed in New York where everybody laughed at him where he can't get any votes where he's expected to come in third in virtually every contest this on Tuesday and some of those contests Kasich has actually given up. How do you give it to him and you can't give it to Kasich because you can't give it to a guy that by that time we'll be one in 50 or something. OK. He'll be one in 50. Ladies and gentlemen our new nominee is John Kasich. He's won one state out of out of 50 and he's going to be. How do you do that? How do you do that? How do you do them? So you can't give it to Kasich. Remember he doesn't have one negative ad against him. As soon as they put the first ad out, he will collapse like a rock. Believe me, just remember that. So how do you give it to these people? So here's the story folks. Here's the story. It's so important. We have a movement going on. Bill O'Reilly the other night who's a tough guy but a smart guy and other people have said. And Bill said and he's not friends -- he's tough. A lot of people say, Don't do, he's too tough. But I don't mind doing because he's tough but he's fair but he said the other night, in his lifetime, what has happened to Donald Trump politically some most important event that he has ever witnessed in his lifetime. Now he's not talking about me. He's talking about you. I mean look at this crowd. Look at this crowd. Look at this crowd. Thank you. Look at this crowd. And then add the probably four or five times the number of people in this room. You guys are good at real estate. Anybody in the room? You're very good. You know about real estate? But then you add all the thousands of people that are out there, running after the car with love in their hearts. We have love in our hearts. This is why we're on the cover of Time magazine many, many times, many, many times over the last short period of time because they're talking about a movement. The likes of which and they say it, Our country has never seen before. Think of this, the Republican Party was getting very stale. Let's face it, Romney failed. Romney failed, unfortunately but he failed and it didn't work. And here's what's happened to the Republican Party. In the world, the Republican Party has gone from sort of staid and stale and going nowhere in terms of presidential to being the hottest party right now, anywhere in the world. We're up almost 70%, 70%. People -- people have said like in Nevada, they had lines where it used to be, you know, you'd look at the voting booths and people, they worked there for years and you'd see like two people in this massive room that have a good seat in Nevada which we won also. We won South Carolina, we won the South. Cruz was supposed to win the South. He's got a bad organization but honestly, he's got -- he's a bad messenger. I'm a much better messenger, I believe. He's got a bad messenger and he's a bad message. But look, remember he was going to win South Carolina? He had weakened the border. Nikki Haley, she's very weak on borders and he thought that was a good thing. It turned out I had the lieutenant governor that was much better and I won in a landslide. I won the evangelicals, I won the women, I won every single group. Then we went -- we went to Nevada. I won Nevada in a landslide and by the way, the polls, going off the exit polls. They did exit polls of Hispanics. I won the Hispanics. We're going to win the Hispanics. And we're going to win the African-Americans because I'm going to bring jobs back to this country. We need jobs. We're going to win. Why do you think Hillary Clinton is going to bring jobs back? Hillary Clinton will not bring jobs back. That I can tell you. Hillary Clinton, Hillary Clinton doesn't have a clue when it comes to what we're talking about. And by the way she's controlled by all of the people that don't want the jobs to come back, OK. She has control and she's controlled by the open border people folks. She wants open borders. She wants people to flood in. You know what they just did in the state of Virginia? Two hundred thousand people that were in prison for horrible crimes, for horrible crimes are being given the right to vote for the first time. That's crooked politics because Virginia is a very close state. I would win Virginia. I have a lot of employees a tremendous amount of property in Virginia. They're giving 200,000 people that have been convicted of heinous crimes, horrible crimes, the worst crimes the right to vote because you know what they know they're going to vote Democrat. They're going to vote Democrat. And that could be the swing. That's how disgusting and dishonest our political system is, all right? It's dishonest, OK. You ready? So here's the story folks. You're going to go and you're going to vote and you're going to remember this very warm morning at this tent that should have been bigger but they ran out of. No, no they ran out of land. The hotel man told me, where's my hotel man? He's a great guy. Where the hell is he? He owns a hotel. Where is he? He's like central casting for ownership of a hotel. He said, Mr. Trump, I've owned this hotel for many years. This is by far the biggest crowd we've ever had. We've never had anything. No, no. Oh, by the way, my son Eric. Come here, Come here, Come here, Come here. Are we not proud of this man? He has been such an amazing father. He's just honored to be here today. We love you Rhode Island. My children. I mean they'll always be children to me. I don't care, right? But my children have been so amazing. Yvonne aka Don Eric Tiffany Barron will be. He's a little on the young side right now. But we've had we've had a great time. So here's what's going to happen. I want to thank Eric because now we're going over to Pennsylvania to get -- he's going to spend the day. But here's what's going to happen. You're going to remember this afternoon. You're going to remember the fun we had even though the subject is bad. The subject is how we're doing. And I didn't even want to read it because it's too depressing. But I didn't read it. But listen, listen according to the United States Bureau of Labor Statistics, Rhode Island has lost 60% of its manufacturing jobs since 1990. The Warwick region of the state. We love Warwick, right? Has lost. Has lost. Yes, I know but don't let this happen. Forty four percent of its manufacturing jobs since 2001, that's when China joined the World Trade Organization. Oh, isn't that a surprise, right? There are 20,000 fewer people in the workforce in Rhode Island today than in 2006. That's pretty close, right? The number of people on food stamps has increased 150%. Now here's one I don't like. Syrian refugees are now being resettled in Rhode Island. We don't know where they're from. We don't know where they're from. They have no documentation. We all have hearts and we can build safe zones in Syria. We'll get the Gulf states to put up the money. We're not putting up the money but I'll get that done. But you know what? We can't let this happen. But you have a lot of them resettling in Rhode Island. Just enjoy -- you lock your doors folks, OK. Lock your door. Oh it's a big problem. We don't know anything about them. We don't know where they come from, who they are. There's no documentation. We have our incompetent government people letting them in by the thousands. And who knows, who knows maybe it's ISIS. You see what happens with two people that became radicalized in California where they shot and killed all their co-workers, OK. Not with me folks, it's not happening with me. OK, so here is what's -- here's what's going to happen. We don't -- we don't win. Our country doesn't win anymore. We don't win with our military, we can't beat ISIS. We're going to knock the hell out of them, folks because we're going to build a bigger and better things. We don't win for our vets because our vets are not being properly taken care of. And they will be if I'm elected president but we're going to start winning again. We're going to win with our military. We're going to win for our vets. We're going to win in education. We're going to have our local education that's going to be a beautiful thing to watch. We're going to win with health care. We're going to win it the borders and we're going to win with trade. We're going to win so much. Actually some of you may get tired of winning. You may say, Please, please, we can't take it anymore, Mr. President. Please, please don't win anymore Mr. President. And you know what I'm going to say, I'm sorry we're going to keep winning. We're going to make up for lost time. And we are going to make America great again. Thank you everybody. Thank you. Thank you."}