{"id":397,"author":"Donald Trump","title":"Speech: Donald Trump in Bridgeport, CT","date":"2016-04-23","link":"https://factba.se/transcript/donald-trump-speech-bridgeport-ct-april-23-2016","paragraphs":["A little bit different but you know, your losing your job. That's the problem. Right? The manufacturing is leaving. We will take care of it, hang in there, folks. We will stop it. If moving to foreign countries, we're going to stop it. They're ripping us off like nobody has ever ripped off a country. Don't worry about it, hang in folks.","I'm looking at these numbers. You know, before I leave -- and honestly, they're all pretty similar. A bridge one night. I think maybe you're a little bit worse. We could change it. Bridgeport region of Connecticut, I always say, \"Give me the stats. On Bridgeport or wherever I'm coming.\" And you know, as well that tremendous victory.","Tremendous. You know, they're all saying, \"Oh, it would be impossible for me to get over 50.\" Don't forget, 50% when you have three people running their talk. And these characters in the media, the world's most dishonest people they are the worst. I want New Hampshire, I want South Carolina, I want all these things.","And you have these pundits who are not -- not smart people, by the way. Not smart people. And just say -- and I had like 17 people total. So at the beginning, we have like 16 and 14 and 12. And I'd win and they'd say, \"Donald Trump, did not get 50%.\" How do you get 50%? When you have all these people. Right?","And even now, we have three. I call it two but I really call it a half because I think we're in the half. We're in the half of . Lying Ted Cruz has absolutely nowhere . Liar. Lying Ted Cruz, get ready, he's got no , it's over. Because statistically he can't win anymore.","New York -- you know what's nice? When a place like New York that knows me better than at your home. Right? It's like, if I had lived in Bridgeport and somebody did a nasty story. The people that know me best than the New York people, they voted the record 62%. Almost 63%. And -- and you know, they all said -- they all said, \"Wow, he has to get 50%.\" They thought they knew you couldn't get because you have three people running.","And then what was funny, I had one way through it. I think 14 people and I did very well. I won one of the states and I won. And then I hear the pundits, \"He didn't get over 50.\" And I have senators and governors and people like Ben Carson was phenomenal, by the way. He endorsed me. But they know really smart guy and really smart people.","And you have 15, 16, 17 and then you went and they said, \"He didn't get 50%.\" And people don't think, they said, \"Ah, that's too bad. Too bad.\" I mean, who can get it, 50? So now, in New York, they didn't think I was going to get 50%. We got almost 62%. And we won almost all of the delegates, 95 delegates.","We won almost every delegate. So I mean, it was great. So what's happening is that, not that Cruz, he has no pathway to victory other than being a short seller. He has no pathway to victory. And Kasich has no -- he's -- he's won for 38 and he's running. That's right. Why are you running? I don't know. I'm just running.","You know, what's interesting, folks? A lot of people -- a lot of people get better than Kasich. And you know, they said, \"Well, it's not fair. You can't.\" I mean, Marco Rubio did better. And Chris Christie did better. And a lot of -- Chris Christie, Brady endorsed me as you know. And Christopher and others did that.","And -- and but you know, Kasich he's going to keep going. He's going to keep running. So keep running then. Thank you. I appreciate it. I appre -- I love this people. I wanted to do a big job up here, a long time ago. And the great Winston they said, \"No. That wouldn't been a good job.\" We were getting a lot of jobs but they're real geniuses.","Real geniuses. They said, \"No.\" And you know what? they said they're dying right now like it was 20 years ago. So but you know what's nice -- you know what's nice? You know it's nice? They save me a lot of time but I would have done a great job. You know they're wasting our time. But they're making it interesting.","Right? What is more fun than a Trump rally? It's not even one o'clock, you people could be out having fun watching a baseball game, playing golf, playing tennis. And you're here with Trump. Isn't this fun? The biggest crowd that they've ever had in the history of all arena or the school.","And this is the same thing, the biggest crowd. They have many, many people outside. You let them in, you want to give up your seats then. All right. Nobody's going to give up their seat. Or we set our record here. We said it right. And you know what? These people want change not Obama change. People want real more change.","We're tired of being ripped off. We're of seeing jobs go overseas in other countries and to Mexico. We're tired of seeing the stupidity that we run our country. It's gross. It's stupid and it's so -- Will not going to happen anymore. Will not going to happen. We're having a good time?","I look on Television, you were lining up at -- it's seven o'clock in the morning and you're lining up. Seven o'clock in the morning and you're lining up in Bridgeport. I said, \"What's going on?\" They said, \"Oh, this is a Donald Trump rally as for women.\" I'm not going to be there for another many hours.","But that happened. Honestly, I have used it every place we go to. And you know, it's covered on the cover of Time Magazine. It's a movement ,folks. Because we're not going to take this stuff anymore what's going on with our government. We're not going to take it anymore.","With the highest tax nation in the world, and by the way, we are cutting our taxes far more than anybody else. OK? With the highest tax nation in the world, every single country that does business with us they rip us off left and right like we're bunch of dummies. And you know what? It's all going to change.","We're going to make great trade deals. We're going to bring jobs back. We're not going to make our jobs go away. We're taking our jobs back. So listen to this. I mean, come on. How do you let this happen? So Bridgeport, the Bridgeport region has lost -- Folks, how do you let this happen?","You know why? Because our government is no good at the top. That's why. OK? It's no good at the top. These are jobs that are going to other countries. Can we stop them? It's so simple. And you know what happens? When they leave here and they open in Mexico, we call, we call and we say, \"Folks, you can't go to there.","You can't do it, really.\" Bridgeport, you see what's happening in Indiana where they're leaving? Carrier air condition leaves, goes to Mexico. Makes air conditions, sells them in this country and we don't tax them. Unless we tax them they're not leaving anymore, folks. They're not going to be leaving anymore.","Listen to this, will build the wall. We're building the wall. You better believe me. You better believe me. We're building the wall. Now, who's paying for the wall? Right? By the way, 100%. We have a trade deficit with Mexico of $58 billion a year.","The walls is going to cost $10 billion. We need a thousand miles. China, 13,000 miles built 2,000 years ago, the Great Wall of China. And you have these guys unsafe with me, \"Tell me, you really can't build the wall. Can you?\" Could you believe this? We'll call that . Who's in construction here?","We will build that wall up so fast your head will spin, right? We'll have real wall, see the ceiling height? That's a little bit low, the wall is going to be bigger. Like I'm always saying, if they get up there, which they won't, they ain't coming down very fast. They'll going to be saying, \"Man, this is look pretty high.\" You see them right now, they go up, they jump down.","I said jump. OK. But folks, how can you let this happen? How can you let this happen? The Bridgeport regions was 60% of those manufacturing jobs since 1990. That's a lot. Can you imagine? And I want to build a great job Peter. We would have a lot of jobs. So. That's government.","That's government. I mean, that's government. It's -- like politicians, all talk no action. You'll never get it done. Believe me. Bridgeport lost more than 40% of his manufacturing jobs since 2001. When just what? When China joined the World Trade Organization.","Listen to this, lying Ted Cruz supports Chinese currency manipulation, devaluation. This is the biggest dealer on top. The devaluation is how they get us. And they don't want to have that in the TPP, Trans-Pacific Partnership. Partnership. You know, they're talking about lately, this is wonderful, the economy.","Let me tell you, NASCAR was a disaster. TPP is going to be wasted. We can't let it happen, folks. Because that'll drag the rest of the jobs away. We can't let that happen. And about president, the first day, boom, it's over. You know, their time the president confess, it's over. You know what it is? Five thousand pages.","With all of these countries that are looking to do numbers on this 5,000 pages that none of our people even read. I don't believe they read it. And these other countries, they know every word, every comma, every sentence, every paragraph. We don't even. I don't even think our people read it. You know, the Obamacare is you know, thousands of pages.","They talk about whether repeal it or replace it, a 100%. The Obamacare, you know, when we went through the Congress, practically, nobody even read it and it's a disaster, by the way. Isn't it? The premiums have gone up 25, 35, 45%, 55%. It's a total disaster. It's going to die of it's own way.","They should have never approved it in the last budget. You know, our last budget three months ago, the omnibus. They call it the omnibus word. You know, they say the omnibus. It should never happened. It allows for Obamacare funding. OK. You couldn't survive without it. You know, how many times we could have killed Obamacare?","Of all these people go to Washington and they all say, \"We're going to stop Obamacare. We're going to create borders. We're going to do this.\" And then they get to Washington and they walk through those gorgeous buildings with their wives or their husbands and they say, \"Look darling, we finally made it.\" And they become totally different people.","You know, they get elected. We all, not only in Bridgeport, they get elected. And then they go if something happens down there. They become weak, they become ineffective. I'll tell you what happens to people they gave a money totally control them. And they wanted the result.","Right? I'm self funding my campaign, folks. I'm going to tell you. Connecticut crossroads, this is city Bridgeport as a motto, which translates to, by industry we drive. But you got to know industry. You got to change your motto. Let's change it to, if we elect Trump, we will thrive. OK? If you elect Hillary now -- you know, when I'm used to Hillary.","She doesn't have the strength. She doesn't have the stamina. You ever see these guys from China? They come in looking to kill. Right? These are the traders. They come in and we have political hacks negotiating with them. They come in, in waves. You know, it's always 10 people. I mean, a lot of money against China.","Big jobs in California, in New York. I have the largest bank in the world as my tenant and one of my buildings in Manhattan it's a Chinese bank. I sell condos to China. China is fine. And you know what else? Mexico is great. The problem -- and I'm not angry with them. I'm angry at our leaders for being so stupid, for being so incompetent.","That they allow this happen. So without reading in about Bridgeport losing 60%, 60 of its manufacturing jobs. OK? And you know where they're going? They're going to different countries. So clubs out. Also Connecticut, most General Electric, that we can't they're all friends. That what you have to help yourself.","You know, when you go from state to state -- I don't know. Honestly, because I live in Connecticut, I love Connecticut. I have friends in Connecticut. You can't lose General Electric. Can you lose that? I mean, they're moving -- they're moving to -- they're moving to Massachusetts. And I love Massachusetts and I happen to love Tom Brady, the great quarterback, . Hey, how good is Tom Brady, right?","I think I got a great You know what? Tom Grady likes me and the people of Massachusetts found out that Tom Brady likes Trump and Belichick likes Trump and all this stuff. I won by almost 50% with all these people. With all these people. So I came ask Massachusetts. But how the hell do you live Massachusetts?","Take General Electric away from Connecticut. You can't do that. Now, where I can help you is I can help you when companies are moving from Connecticut to other parts of the world. That's not going to happen. OK? There, I can help you. General Electric, you should be ashamed of yourselves. But there I can help you.","Guess, that's the bad one a little . I hated seeing that, I mean, I thought it was sort of amazing. Now, General Electric plant, you hadn't talk about that. Sorry. That's too late. Those you have to fight your own way. You know, the country, the country, the country I'm going to solve that problem so fast.","You know, for years our politicians have been talking about the problem where we're losing to Mexico and China and Japan and every country. India, Vietnam, there's a new hot one. They're taking our businesses. You know, somewhere . So we're taking candy from a baby. You give me that peace of candy.","Right? That's the way they take our business. Millions of millions of jobs, thousands upon thousands. It ends. If I win it ends. And these politicians won You know, if you love crooked Hillary Clinton, she's all controlled by her lobbyists, she's all controlled by her donors. Hey I -- I can lose my business when I give to everybody.","I give to everybody. I know, she gave better than anybody, folks. But I saw what's happening to our country. Our country is going to hell. We're losing jobs, our military can't beat ISIS, our vets aren't being taken care of, Obamacare is a disaster. Our Second Amendment is under siege. Educationally we're doing horribly while waiting in the Common Core and what we're . The top 30 countries, the daily cast.","So we're No. 30 in education. So we're last, we're No. 30. You have Norway, Denmark, Sweden, China, Japan. They have all this, they're the best. And we're No. 30, at the 30. All right. So here's the problem with 30 and 30, in terms of cost per pupil. Tell me who's No. 1? By so much that there is no No. 2. It's not like, \"Oh gee, we just edged out Norway.\" I know in New York they send pupil to Norway to check out their educational system.","Because they want to find why is Norway better than New York. But I'm sending you, hey look, let him work. OK. Let him work. Let him work. But we're No. 1 in terms of cost and we're at the bottom of the heat. Now, it's a little like me. I spent at least, in terms of running for president. That's my money.","I spent a lot of money. I spent 40 million box for . At least 40 million. I spent the least and I'm winning by a lot. Right? Other people -- other people have spent the most and they got knocked down bad. Bad. Now you tell me who do you want to have as a president?","Right? So a couple of more slides then I can just -- otherwise you know, I have the statue , I have the statue mission. He's a great guy. I feel so badly when I recover of this statue. So let's see, factories would close the door I would replace. There's something, you know. Medium household income in Connecticut has declined $6,000 since 2000 and they're working hard.","You know, one of the people said, \"Are you hyper?\" I'm gonna it, i'm not hyper. We're -- we're really tired of it. OK. We're tired of it. We're tired of the incompetent people representing us. We're tired of -- because with of those people we are under -- I will honor this country. And it's like this, every place is totally packed, totally sold out as many people as you have seen work hard as before.","It was -- it was the biggest birthday ever had. I mean, every crowd. These other guys come in. The guy like Cruz comes in and -- and you know, they have like 3, 400 people. They were in a conference room or some place. No, it's true. And Kasich the same thing, they have a couple of hundred people within about 20 minutes they're falling asleep.","It's true. And Cruz you know, open the rhetoric, \"I will la -- I will.\" Well he's a liar. Well he got another one. You know, I have a great -- I have a great staff. I have a great staff. One of whom comes from Connecticut. But I have fantastic people.","And I have all these people, connecting people. Right? Like I mean, they're great people. And it's so unfair. So with the Republicans down and Washington not far. Actually far. They want him, you know, they want to have like nice meeting, beautiful sunshine. They're wonderful. And they had a meeting and he said, \"Yes, Donald Trump knows he's really smart and he will, you know, be different when he's in private, of which of course we are.\" Everybody is. When I was speaking, who's not different though when you're in private room?","So he's different here than he is there. Of course, we all are, right? I think. And we're different when we're talking about our policy speech and opposed to speech. Where I'm with people, my friends, I call this my friends, you know, you have the most loyal group of people. Every poll shows that they had people on the other day, \"We'll never leave Trump.\" they said.","You know, one of them looked dishonest media people. The most, world's most dishonest people. What would it take to get you with people out of Trump? I'll hug that -- I'll hug that television set. What would it get? I was watching. Should have tender for friends behind you.","What would it get for you to drop Donald Trump and go to another channel? Listen to this, listen, stop talking, we're never dropping. There's nothing you can do. That's right. That's right. I'll tell you what? And the other people, you're going to see, the other people.","If they like seeds in the wrong direction they can drop. OK, they drop. We have the most loyal people on the cover of Time magazine. It's all over the place. We have . I don't have to be doing this thing. You don't have to be doing on a Saturday afternoon.","There's so many things. And you look, and it's such an honor to have houses, look at all these people up there. I mean, look. How is it up there? Don't forget you're doing much better than the people standing outside. You got to remember that. But it's been amazing. So Paul is down and he said, \"Yeah, Donald and Donald would be a good member of the four, you know.","Right now, we're fighting the party because it's a racist. OK? It's racist.\" So -- so you know, over a period times my wife would say, \"Be more presidential.\" Ivanka would say, \"Be more presidential.\" And I started thinking and I said, \"I can't.\" You know, being presidential is easy. Much easier than what I have to do. Here, I have to rant and rave.","I have to keep you people going. Otherwise, you can fall asleep on me, right? If I was presidential, first of all, I have a teleprompter. You ever see crooked Hillary Clinton? She walks in, \"Good afternoon. How are you?\" You see crooked Hilary Clinton. When people start yawning, leaving, the whole thing is a disaster.","And she'll be a disaster as president. But here's -- here's the thing, look, so he said -- he said that -- and Donald was obviously -- hey look, you know, a smart guy. Went to the best school, the best everything. I'm like, \"Really smart.\" I'm so smart. I don't want to even tell people, you'll all drop me. They said, \"It's no good.\" But we have smart people.","We have, like the most incredible people that found their self. Paul was saying -- Paul was saying that, \"Well, you got a different view and if he's in a room, he's different than we spent in .\" Everybody is, right? So lying Ted Cruz, right? He said, \"He's insane.\" You know, with that horrible slurs.","You know, the hand. Don't forget with the Bible. Right? He walks in, Bible held high. And he puts the Bible down and then he lies. Ted to show you how honorable people . They take these conversations. They didn't tell anybody. Probably illegal. I wonder if it's legal then they have to go to jail.","But you know they did. Of course he's right. That's what he said was -- what he said, \"No, Mr Trump can be -- this way, that way can be pres.\" He could be anything he wants. Being presidential is the easiest. Because all you do is walk up and talk and leave and everybody falls asleep. Here's the story -- here's the story, so lying Ted Cruz said, \"He said his own manager was a great guy.","His own manager said that he talks this way.\" I don't talk this way. And then he said, \"And he said you won't build the wall\" We're building the wall, folks. I didn't say anything. The wall is not even . So he said because in other words the concept is just to show you how disgusting politics.","The concept is that, because of the fact that in a room I'm gonna act different than when I have thousands of people in front. I'm like everybody else. I'm saying essentially the same things. I say the same thing but you say it in different way. So what he did is took and said, \"He will change and he won't build the wall and he won't do that.\" Everything I said, I do folks.","I do. OK? But to show you how dishonest he was, he actually used the expression like we said it. First of all, don't even say that. Even if we meant it. Nobody would say it. OK. Oh, we didn't do because I mean that totally. What I say here, and it's always going to be said in a different way.","Depends on your audience, you have to be different. I mean, when we have this audience, we have to be different than when we have 12 people sitting in the conference room. Unless, you're Ted Cruz he speaks the same way. I was saying, he's -- he's an OK debater but he's a terrible golfer. Right? All right.","And I beat him in every single debate. Every single debate would be Ted Cruz, lying Ted. You know, he was supposed to be a good debater and I said, \"I hear he's a good debater. Right?\" You know, he's supposed to be like he debated in high school or college or something. But you know, he never had a debater like me where I interrupt him every four words.","You know what I mean. I don't actually think he is a good debater. So Drudge, the greatest guy, Drudge, Time magazine, you know they all write the debates. Right? Online polls. Hundreds and hundreds of thousands of people follow. You know who won? I've won every single debate. Every single source, every single debate.","Pretty good. Pretty. I've never done it before. You know, I've folks -- I've been doing this now for 10 months. It's not like, \"Oh, gee.\" But I've been doing it for now nine months or 10 months. But -- but thank you darling, I love you too. Thank you. So. I'd love to doing it -- I'd love doing it because it's going to be so much fun.","First of all, the people that I meet are unbelievable people. They love this country so much. That they'll be here -- that they'll be here on Saturday afternoon. In a room that's very warm complete Bonkley. The good news is you -- you speak. I just spoke in a room that was so hot. It was like a steam room.","It was like -- it was like a steam room. You speak, it's exercising and it's like you lose -- you lose 10 pounds or so. What do I lose? Weight. But we're going to do such a good job and you have to remember, you're going to remember this afternoon. But you have to remember, on Tuesday, you have to get out and vote.","Now, none of the other candidates are even coming. You know very little, to Connecticut, and I'm coming a lot together. I don't take anything, we can't take anything for granted. I know the poll numbers working. You have to forget the poll numbers because a lot of times people say, \"Oh, Trump he's going to win.","I love Trump. He's going to win but I don't have to vote.\" The more we win by, the better it's going to be. Because we have a movement going on. It's being written about Bill O'Reilly, the other day. O'Reilly, right? And he's rough. And he is a rough guy and he's smart. What he said, \"The biggest political event to the effect, that this, The Trump Phenomenon.\" He said, and -- and sewing out the Trump Phenomenon ditch. You are the Phenomena, doing our connection.","He said The Trump Phenomena has something to that effect, is the biggest political story. The most important political story of his lifetime. Did anyone see that? I almost fell off my chair once. Because I know, that he was always brilliant, brilliant, brilliant.","But -- but the truth is and it's never an easy interview with Bill, I will tell you that, and he's straight down the middle. He has no friendships, no nothing. He goes right down and you got to hand it to him. And he said -- and he actually said it twice. Because he said it the night before too. Bill O'Reilly, when he said the biggest political story in his lifetime.","And he mentioned in that is the assassination of John F. Kennedy. You know, which of course to me is you know, a big, big and horrible event. And we've had some horrible events and some very big event. So for him to say that, it was a very big step. And what he's saying is all over. When I go to Alabama, where we have 35,000 people.","Our crowds are much bigger than Bernie by the way. And Bernie is over here. He's over here. And you know, but Bernie did make a couple of statements. Should I read the statements? Because we're going to forget about Bernie. You know, in about a month you'll say, \"Who's Bernie? Who the hell is he? Unless Hillary gets indicted in which case Bernie wins.","But Bernie -- Bernie said that she's not qualified to be president. That's a big step. And then he pulled it back a little bit because that's the tough seller. You know why? I mean, she's . But I'll tell you where he was right. And then I'm happy with what Bernie said.","He said, \"She suffers from bad judgment.\" She does have bad judgement. She want to go into the war in Iraq. I was against it by the way. And Bernie was against it. But she wanted to go into the war in Iraq. And I said, \"It's going to absolutely, you know, destabilize the Middle East if you do that.\" And it was a disaster.","And that was right. You know they talked about Trump and stuff. Trump's going to have a fast trigger. But I want to confess, I'm probably going to have the slowest trigger of anybody but nobody is going to mess with me because they wanted me. . Bigger and better and stronger than ever, ever before.","And we're going to take care of our vets who have been absolutely mistreated. OK. And by the way, we're going to respect our police officers because our police have got to be on the credit they deserve. Our police have not been given the credit they deserve. They're doing an unbelievable job, folks.","OK. You know, they have one incident that was a mistake or you had a problem with somebody and out of millions of people. And they'll put that incident on television for weeks and weeks and weeks. OK? Our police are amazing people. So -- so this all began in June or June 16th when I came down in Trump Tower and I saw one medium.","I mean, it looked like the Academy Awards, I said it all the time. It looked like the Academy Awards and it's that something I wanted to do. I love it's great company. I have a nice life, I have a wonderful family. Now, my family is involved in this. They're all excited. Eric and Don, Ivanka and Tiffany and all of them.","That was a little bit, I mean, now I'll leave this stuff. But -- but even that reminds me and Melanie. They're all involve. And they -- they loved it. And they loved it because they -- they know we can going to make America great again, folks. And when I came down.","When I came down to this thing. Really for me, it was about trade deals and it was about borders and it was you know, just so many things that. Trade is so easy it's not like right my wheelhouse because I know whether it's rich border or Albany where I was. Last week Syracuse, Poughkeepsie, Bethpage Long Island and outer Long Island, Suffolk County, all places I love.","Right? Places that I mean, I had as much as 87 and 89%. Can you imagine getting 89% from something? I mean . What is that? I was saying this is about the Europe. To -- to have it overwhelming victory like that. We're smart, greater than even -- they know it's going to work it was far greater from the people that really know you the best.","OK. They know me. They know the good, the bad, the ugly. They know Donald Trump. I grew up there. And I've been in so much papers and so much was written about me. Some correct and some, you know, dishonest. But -- but the people of New York really know me. So to have that kind of a victory is great. And it really shows a lot to Pennsylvania and Maryland and Rhode Island and Delaware and yourselves where, I mean Connecticut, honestly knows me. Pennsylvania knows me because I went to school there.","And I went to school in Pennsylvania. It's a great place, great state. But they -- they all have the same problems and then we have problems where our jobs are being decimated. Six million jobs have been taken out of our country like so easily, so easily. And we have politicians that have been working on this problem for five years they don't know what to do. And what we're going to do, let's say we have our company here in Bridgeport goes to Mexico.","Great. We'll call you. Enjoy Bridgeport employed , because you bet, you'll coming back. And what happens is this, and ideally you want to see these companies before they leave. Nobody talks, I don't think anybody talks them. When companies leave, I don't think people talk to them. If I were doing it, I'd say here's what it is. But the governors in all fairness they need help from the federal government.","And we have to impose a major tax on these companies when they leave they go to Mexico like Carrier Air Conditioners. They go to Mexico and they think they're going to sell air conditioners back into our country, no tax, you know, free trade. Free trade, I believe in it 100% but not when you have stupid people negotiating your deals and money.","OK? Because we don't have any . We don't have . So I'm a free trader but free trade means you know, if you look at Mexico their people are sharp. Their leaders are sharper, their smarter. What they're doing? They're killing us on the border. Killings us on the border.","But that won't happen now even beyond the wall. The -- the patrol, if you look at the Border Patrol they gave us last week you probably saw it. First time in the history of the Border Patrol, they 16,500 men and women endorsed Donald Trump. They never done it before. They're incredible people and they're keeping the job.","Sheriff Joe Arpaio of Arizona endorsed Trump. Everybody wanted his endorsement. He endorsed that, so we're going to have it's so important. We're going to have them all. We have to stop the drugs. You know what I want? New Hampshire. I adore them when I see the people of New Hampshire who are great people.","That was my first victories. I love New Hampshire, from day one of this month. And you see this beautiful valleys and lakes, little roads right in front of us. It's beautiful. The people are perfect. And I go into a meeting and I say, \"So what's the big problem there?\" They say, \"Heroin.\" I say, \"What?\" Heroin.","Just, right? It didn't -- it didn't mesh with these beautiful trees and then you know, heroin. And then you go to other places, come here and it's the same thing. I mean, I know all about Bridgeport for years . But you look, and it's coming in through the southern border.","And I told the people of New Hampshire that right where I live. We're going to end that problem. And you know, the biggest problem. You know, in Singapore that's tough. Singapore is so tough on drug dealers. I mean, this country could be the killer. I don't want to have to tell you. What do they do in Singapore?","He said, \"They hang them.\" You would never approve that. Singapore is so tough on drug dealers that people ponder. But Singapore is so tough, they don't have a problem. They're don't have a problem. There's no games. OK? They don't have a problem.","With us, you get caught once, twice, something like eight times and then they start getting a little bit tougher. You can't solve problems like that. But I told the people of New Hampshire that I told South Carolina when I went in South Carolina. That was supposed to be a stronghold for Ted Cruz. Was only one problem I won in a landslide.","And I won with the Evangelicals because Evangelicals don't like liars and he's a liar. So I won with the Evangelicals and I won it in a landslide and I won Louisiana. And that's when I realized the system's rigged because I won Louisiana. And I said, \"Oh, I wasn't supposed to win Louisiana.","I was behind and I was not supposed to win. That was supposed to be a Ted Cruz.\" And remember there are also other people. There are other people. And again, I'm doing so late and now I'm getting over 50% with all these people. Now we're down to three, finally. Remember, when they say, \"Trump doesn't get over 50%.\" I was having 12 and 14 and 15. I was just like Karl Rove they S&P. He still thinks Romney won, Romney won.","He's got -- he was off last night and he was, it was -- he was trying to explain, how the fact that I won New York in one of the greatest landslides anyone's ever seen. For granted that, it wasn't really that good. It wasn't. And even the -- I -- I won't say what was in this but him. But even he was like, \"Real?\" And I hate it. The level of hatred by the establishment of us is so incredible.","OK? It's so totally incredible. So. What? No, no. We're going to change that, by the way. We're going to change it. We're going to change it. But when you watch, when you watch this guys and they were talking about the 50%. And he said, \"Again 50%.\" But this time -- and 61 or 62% he can't do that anymore so he came up with another narrative.","But when you watch him struggling. He's all nervous and all crazy because this stuff happened. They say it was one of the biggest. Even people that hate me said, \"That was a massive victory.\" Right? And he's working so hard that no one listen to me that much. You know, it's only in New York. It doesn't mean that much.","And you see, look folks, the system is rigged. So what happens is, Louisiana was Ted Cruz. Ted Cruz was going to win the south. He was going to win all of the south. There's only one problem. I won the south. Listen, I won Alabama, I love Alabama. I said before, \"If I don't win in Connecticut I'm moving to Alabama.\" Because I'm telling you, they're treating me good.","OK? If I won the south, I won -- I won Alabama, I won Arkansas, we won places. We won Kentucky. We won so many places. Florida was one of the greatest. We won in . Right? And our won Massachusetts. So when Alabama and Massachusetts that's pretty different OK? But we have all these victories. And I said that people, the system -- I really found out about the rich system in Louisiana because I was behind.","I wasn't supposed to win. I was told don't go there. And then a poll came out that I was seven or eight points behind. I said, \"Hey, let's give it a shot.\" So I went down there a couple of times and the final line was on Friday night and I made a speech. And we had an airplane hangar that was massive land from Boeing 747. It was massive.","And we said, \"I'm coming to make a speech the night before the election.\" That election took place I believe on a Saturday. And I made the speech and the people were unbelievable and that it was like a love fest. Like this is. It was like a love fest. OK? And -- and like this. The people of this country are amazing.","That's why they're calling it a movement on the cover of Time magazine. A movement. And by the way, they say it's a movie like we've never had in the history of our country. It's true. Millions of. So I win Louisiana and I'm making the speech and it was unbelievable and I left. And the next day they had the election and I won.","Please. I won. And then I wasn't supposed to win. He was supposed to win and it was an upset. And I was just fine. Now a couple of weeks later, they're airing up different things and they're showing how well we're doing because we're winning a lot of states. And mostly, you know, mostly.","And then I see all these guys, \"Oh, you made a mistake.\" I -- I said, \"Why? You know, we don't make a mistake?\" \"No, no. You made a mistake.\" I won the state, easily. And you have this guy Cruz having more delegates. And they're lying Ted. I won -- I won Louisiana and you have Cruz over here. Well that can't be possible.","How do you win it? And you don't get as many delegates. It's -- it's a no. I'll tell you how they do it. It's a rigged system. So while I'm working with speeches that he can't win with the people. He will get decimated. When they start doing negative ads, I had 55,000 negative ads. Kasich had to have one.","When they started -- if they put one ad on Kasich. One ad. It's going to be point. But you know what happens. I said, \"So how does this happen?\" And then all of a sudden they realized they have all of it. They film this stuff for like nine or 10 months. All of a sudden they realized these are rigged deal.","Because how can you win the state? In less delegates. Right? So we started to talk to sit and watch out the delegates in Pennsylvania lovers. OK. But it's still a bad system because when you win with a popular vote and when you win states by a lot with the popular vote, you win that state. You win that. So what this guy does?","He can't win the popular vote. Because he's got zero personality, because he lies like thief. OK? And he can't win with the popular vote. So he's got this large number of people, probably paid for by a super PAC which is not supposed to be happening. Go around, whining and dining people, taking them out to dinner, spending a lot of money.","Probably getting them hotel rooms and everything else. Why did you see? We'll figure it all out. But I'll tell you what? It's really buying an election in this country if you can't do that, folks. You can't do. So you're not allowed to do that in theory. And I'd be interested to see this the super PAC doing it. OK? You're not supposed to be doing it at this total communication I would say.","So we're dealing with a broken system. We're dealing with a crooked system like crooked Hillary. And we're dealing and we're dealing. We're really dealing with a fixed deal and we're going to change it. Now, the only way to beat that at this stage, the only way to beat that is like the fighters say. You know, the boxers and I love the boxers.","I've always liked the boxers through all the dirt. Mike Tyson endorsed me, they all endorsed me. You know, I want to get Bobby Knight to endorse me in Indiana as he endorsed . I love Bobby Knight. The truth is he did endorsed me. Do I look bad? Bobby Knight, I love the great basketball.","Bobby Knight, he's a great guy. Good you have Booby Knight in Indiana. In a week, and -- and honestly, I like the tough guys. I like the guys that are tough. Because there's something about them. OK? And they fight me and that's what you want, folks. Because you know what? The world is tough, the world is not so. The world is tough.","We're not tough. This country is not tough. Our leaders aren't tough, our negotiators, our representatives are not tough. Secretary of State Kerry is not tough for he can . We need -- we need toughness. You know, when Jeb Bush used to say, \"I don't like his tongue.\" My tongue.","They are chopping off people's heads in the Middle East. They're drowning people in steel cages. And Jeb does this, \"I don't like Donald Trump's tongue.\" OK? I don't have that side. I'm just angry at the incompetence of our leadership. The gross incompetence of our leadership. And we'll going to change it. I'm going to change it on Tuesday when we won the poll.","Every time he said the same things. He said, \"His tongue.\" They use the same word. \"It's very harsh.\" Well, I think he's very harsh. But he's tongue, she said, \"He's very harsh.\" I mean, here is -- think of it, linger it, linger it. We're being ripped off by China.","We're going to have a trade deficit of $505 billion, with China. We're going to have a trade deficit with Mexico of $58 billion a year. We have trade deficits of Japan and all with everybody. I mean, almost everyone. Almost everyone. Are you OK? OK Ted.","I mean, he looks like Ted. Don't forget, make America great again. Is it powerful? Make America great again. They said to me, they said to me a little while ago, they said, \"Well, that's not very positive messages.\" Actually, it's very positive because if I didn't say that, it would be just an hope.","Just hope. We have tremendous hope. We're going to make our country so strong again. So here's what we're going to do, listen to me. Listen to me. This has been a great afternoon. This has been a great. We're going to go. We're going to go on Tuesday and so forth. And you going to get all with your friends, and go and vote.","And that's when you're look back and I say this all the time and I mean it. I will do such a great job today. You will love your president but more important you'll be proud of your country. So you going to look back to your vote and you'll going to say, \"That was the single greatest vote I've ever cast.\" You'll going to look back, three years from now or 10 years from now or 30 years from now.","You'll going to say the greatest vote I ever cast. Was that Tuesday? I watch Donald Trump and then went to cast. That Tuesday, when I went to cast my vote because that's when our country started winning again and being great again. And I can only promise you this, we're going to start winning again. We're going military, we're going to build to that and make it great.","We're going to not terrorize this. Got it good. And hopefully . We're going to have a strong military. We're going to take care of our vets of as part of it. We're going to straight down on our education. We're going to straight down Obamacare. We're going to repeal it and replace it. It's going to be down.","We'll replaced with something that is absolutely terrific and we have so many options. That's a sad part. There were so many options and they didn't choose anything. They went with this horrible system that's totally underwater, now a disaster. So we're going to get rid of it. So you get away with health care.","You're going to win with the Second Amendment which will going to change. You going to for every level of government. You'll going to win it, the borders. We're going to have a strong powerful beautiful borders and people are going to come into our country but they're going to come in legally and we will build the wall.","But people will come in and they going to come in. And we're going to win with trade. We're going to make great trade deals and we'll not going to let our businesses be ripped out of our state and ripped out of this country anymore. We're going to stop . And they'll not going to leave, folks. And we're going to make America great again."],"text":" A little bit different but you know, your losing your job. That's the problem. Right? The manufacturing is leaving. We will take care of it, hang in there, folks. We will stop it. If moving to foreign countries, we're going to stop it. They're ripping us off like nobody has ever ripped off a country. Don't worry about it, hang in folks. I'm looking at these numbers. You know, before I leave -- and honestly, they're all pretty similar. A bridge one night. I think maybe you're a little bit worse. We could change it. Bridgeport region of Connecticut, I always say, \"Give me the stats. On Bridgeport or wherever I'm coming.\" And you know, as well that tremendous victory. Tremendous. You know, they're all saying, \"Oh, it would be impossible for me to get over 50.\" Don't forget, 50% when you have three people running their talk. And these characters in the media, the world's most dishonest people they are the worst. I want New Hampshire, I want South Carolina, I want all these things. And you have these pundits who are not -- not smart people, by the way. Not smart people. And just say -- and I had like 17 people total. So at the beginning, we have like 16 and 14 and 12. And I'd win and they'd say, \"Donald Trump, did not get 50%.\" How do you get 50%? When you have all these people. Right? And even now, we have three. I call it two but I really call it a half because I think we're in the half. We're in the half of . Lying Ted Cruz has absolutely nowhere . Liar. Lying Ted Cruz, get ready, he's got no , it's over. Because statistically he can't win anymore. New York -- you know what's nice? When a place like New York that knows me better than at your home. Right? It's like, if I had lived in Bridgeport and somebody did a nasty story. The people that know me best than the New York people, they voted the record 62%. Almost 63%. And -- and you know, they all said -- they all said, \"Wow, he has to get 50%.\" They thought they knew you couldn't get because you have three people running. And then what was funny, I had one way through it. I think 14 people and I did very well. I won one of the states and I won. And then I hear the pundits, \"He didn't get over 50.\" And I have senators and governors and people like Ben Carson was phenomenal, by the way. He endorsed me. But they know really smart guy and really smart people. And you have 15, 16, 17 and then you went and they said, \"He didn't get 50%.\" And people don't think, they said, \"Ah, that's too bad. Too bad.\" I mean, who can get it, 50? So now, in New York, they didn't think I was going to get 50%. We got almost 62%. And we won almost all of the delegates, 95 delegates. We won almost every delegate. So I mean, it was great. So what's happening is that, not that Cruz, he has no pathway to victory other than being a short seller. He has no pathway to victory. And Kasich has no -- he's -- he's won for 38 and he's running. That's right. Why are you running? I don't know. I'm just running. You know, what's interesting, folks? A lot of people -- a lot of people get better than Kasich. And you know, they said, \"Well, it's not fair. You can't.\" I mean, Marco Rubio did better. And Chris Christie did better. And a lot of -- Chris Christie, Brady endorsed me as you know. And Christopher and others did that. And -- and but you know, Kasich he's going to keep going. He's going to keep running. So keep running then. Thank you. I appreciate it. I appre -- I love this people. I wanted to do a big job up here, a long time ago. And the great Winston they said, \"No. That wouldn't been a good job.\" We were getting a lot of jobs but they're real geniuses. Real geniuses. They said, \"No.\" And you know what? they said they're dying right now like it was 20 years ago. So but you know what's nice -- you know what's nice? You know it's nice? They save me a lot of time but I would have done a great job. You know they're wasting our time. But they're making it interesting. Right? What is more fun than a Trump rally? It's not even one o'clock, you people could be out having fun watching a baseball game, playing golf, playing tennis. And you're here with Trump. Isn't this fun? The biggest crowd that they've ever had in the history of all arena or the school. And this is the same thing, the biggest crowd. They have many, many people outside. You let them in, you want to give up your seats then. All right. Nobody's going to give up their seat. Or we set our record here. We said it right. And you know what? These people want change not Obama change. People want real more change. We're tired of being ripped off. We're of seeing jobs go overseas in other countries and to Mexico. We're tired of seeing the stupidity that we run our country. It's gross. It's stupid and it's so -- Will not going to happen anymore. Will not going to happen. We're having a good time? I look on Television, you were lining up at -- it's seven o'clock in the morning and you're lining up. Seven o'clock in the morning and you're lining up in Bridgeport. I said, \"What's going on?\" They said, \"Oh, this is a Donald Trump rally as for women.\" I'm not going to be there for another many hours. But that happened. Honestly, I have used it every place we go to. And you know, it's covered on the cover of Time Magazine. It's a movement ,folks. Because we're not going to take this stuff anymore what's going on with our government. We're not going to take it anymore. With the highest tax nation in the world, and by the way, we are cutting our taxes far more than anybody else. OK? With the highest tax nation in the world, every single country that does business with us they rip us off left and right like we're bunch of dummies. And you know what? It's all going to change. We're going to make great trade deals. We're going to bring jobs back. We're not going to make our jobs go away. We're taking our jobs back. So listen to this. I mean, come on. How do you let this happen? So Bridgeport, the Bridgeport region has lost -- Folks, how do you let this happen? You know why? Because our government is no good at the top. That's why. OK? It's no good at the top. These are jobs that are going to other countries. Can we stop them? It's so simple. And you know what happens? When they leave here and they open in Mexico, we call, we call and we say, \"Folks, you can't go to there. You can't do it, really.\" Bridgeport, you see what's happening in Indiana where they're leaving? Carrier air condition leaves, goes to Mexico. Makes air conditions, sells them in this country and we don't tax them. Unless we tax them they're not leaving anymore, folks. They're not going to be leaving anymore. Listen to this, will build the wall. We're building the wall. You better believe me. You better believe me. We're building the wall. Now, who's paying for the wall? Right? By the way, 100%. We have a trade deficit with Mexico of $58 billion a year. The walls is going to cost $10 billion. We need a thousand miles. China, 13,000 miles built 2,000 years ago, the Great Wall of China. And you have these guys unsafe with me, \"Tell me, you really can't build the wall. Can you?\" Could you believe this? We'll call that . Who's in construction here? We will build that wall up so fast your head will spin, right? We'll have real wall, see the ceiling height? That's a little bit low, the wall is going to be bigger. Like I'm always saying, if they get up there, which they won't, they ain't coming down very fast. They'll going to be saying, \"Man, this is look pretty high.\" You see them right now, they go up, they jump down. I said jump. OK. But folks, how can you let this happen? How can you let this happen? The Bridgeport regions was 60% of those manufacturing jobs since 1990. That's a lot. Can you imagine? And I want to build a great job Peter. We would have a lot of jobs. So. That's government. That's government. I mean, that's government. It's -- like politicians, all talk no action. You'll never get it done. Believe me. Bridgeport lost more than 40% of his manufacturing jobs since 2001. When just what? When China joined the World Trade Organization. Listen to this, lying Ted Cruz supports Chinese currency manipulation, devaluation. This is the biggest dealer on top. The devaluation is how they get us. And they don't want to have that in the TPP, Trans-Pacific Partnership. Partnership. You know, they're talking about lately, this is wonderful, the economy. Let me tell you, NASCAR was a disaster. TPP is going to be wasted. We can't let it happen, folks. Because that'll drag the rest of the jobs away. We can't let that happen. And about president, the first day, boom, it's over. You know, their time the president confess, it's over. You know what it is? Five thousand pages. With all of these countries that are looking to do numbers on this 5,000 pages that none of our people even read. I don't believe they read it. And these other countries, they know every word, every comma, every sentence, every paragraph. We don't even. I don't even think our people read it. You know, the Obamacare is you know, thousands of pages. They talk about whether repeal it or replace it, a 100%. The Obamacare, you know, when we went through the Congress, practically, nobody even read it and it's a disaster, by the way. Isn't it? The premiums have gone up 25, 35, 45%, 55%. It's a total disaster. It's going to die of it's own way. They should have never approved it in the last budget. You know, our last budget three months ago, the omnibus. They call it the omnibus word. You know, they say the omnibus. It should never happened. It allows for Obamacare funding. OK. You couldn't survive without it. You know, how many times we could have killed Obamacare? Of all these people go to Washington and they all say, \"We're going to stop Obamacare. We're going to create borders. We're going to do this.\" And then they get to Washington and they walk through those gorgeous buildings with their wives or their husbands and they say, \"Look darling, we finally made it.\" And they become totally different people. You know, they get elected. We all, not only in Bridgeport, they get elected. And then they go if something happens down there. They become weak, they become ineffective. I'll tell you what happens to people they gave a money totally control them. And they wanted the result. Right? I'm self funding my campaign, folks. I'm going to tell you. Connecticut crossroads, this is city Bridgeport as a motto, which translates to, by industry we drive. But you got to know industry. You got to change your motto. Let's change it to, if we elect Trump, we will thrive. OK? If you elect Hillary now -- you know, when I'm used to Hillary. She doesn't have the strength. She doesn't have the stamina. You ever see these guys from China? They come in looking to kill. Right? These are the traders. They come in and we have political hacks negotiating with them. They come in, in waves. You know, it's always 10 people. I mean, a lot of money against China. Big jobs in California, in New York. I have the largest bank in the world as my tenant and one of my buildings in Manhattan it's a Chinese bank. I sell condos to China. China is fine. And you know what else? Mexico is great. The problem -- and I'm not angry with them. I'm angry at our leaders for being so stupid, for being so incompetent. That they allow this happen. So without reading in about Bridgeport losing 60%, 60 of its manufacturing jobs. OK? And you know where they're going? They're going to different countries. So clubs out. Also Connecticut, most General Electric, that we can't they're all friends. That what you have to help yourself. You know, when you go from state to state -- I don't know. Honestly, because I live in Connecticut, I love Connecticut. I have friends in Connecticut. You can't lose General Electric. Can you lose that? I mean, they're moving -- they're moving to -- they're moving to Massachusetts. And I love Massachusetts and I happen to love Tom Brady, the great quarterback, . Hey, how good is Tom Brady, right? I think I got a great You know what? Tom Grady likes me and the people of Massachusetts found out that Tom Brady likes Trump and Belichick likes Trump and all this stuff. I won by almost 50% with all these people. With all these people. So I came ask Massachusetts. But how the hell do you live Massachusetts? Take General Electric away from Connecticut. You can't do that. Now, where I can help you is I can help you when companies are moving from Connecticut to other parts of the world. That's not going to happen. OK? There, I can help you. General Electric, you should be ashamed of yourselves. But there I can help you. Guess, that's the bad one a little . I hated seeing that, I mean, I thought it was sort of amazing. Now, General Electric plant, you hadn't talk about that. Sorry. That's too late. Those you have to fight your own way. You know, the country, the country, the country I'm going to solve that problem so fast. You know, for years our politicians have been talking about the problem where we're losing to Mexico and China and Japan and every country. India, Vietnam, there's a new hot one. They're taking our businesses. You know, somewhere . So we're taking candy from a baby. You give me that peace of candy. Right? That's the way they take our business. Millions of millions of jobs, thousands upon thousands. It ends. If I win it ends. And these politicians won You know, if you love crooked Hillary Clinton, she's all controlled by her lobbyists, she's all controlled by her donors. Hey I -- I can lose my business when I give to everybody. I give to everybody. I know, she gave better than anybody, folks. But I saw what's happening to our country. Our country is going to hell. We're losing jobs, our military can't beat ISIS, our vets aren't being taken care of, Obamacare is a disaster. Our Second Amendment is under siege. Educationally we're doing horribly while waiting in the Common Core and what we're . The top 30 countries, the daily cast. So we're No. 30 in education. So we're last, we're No. 30. You have Norway, Denmark, Sweden, China, Japan. They have all this, they're the best. And we're No. 30, at the 30. All right. So here's the problem with 30 and 30, in terms of cost per pupil. Tell me who's No. 1? By so much that there is no No. 2. It's not like, \"Oh gee, we just edged out Norway.\" I know in New York they send pupil to Norway to check out their educational system. Because they want to find why is Norway better than New York. But I'm sending you, hey look, let him work. OK. Let him work. Let him work. But we're No. 1 in terms of cost and we're at the bottom of the heat. Now, it's a little like me. I spent at least, in terms of running for president. That's my money. I spent a lot of money. I spent 40 million box for . At least 40 million. I spent the least and I'm winning by a lot. Right? Other people -- other people have spent the most and they got knocked down bad. Bad. Now you tell me who do you want to have as a president? Right? So a couple of more slides then I can just -- otherwise you know, I have the statue , I have the statue mission. He's a great guy. I feel so badly when I recover of this statue. So let's see, factories would close the door I would replace. There's something, you know. Medium household income in Connecticut has declined $6,000 since 2000 and they're working hard. You know, one of the people said, \"Are you hyper?\" I'm gonna it, i'm not hyper. We're -- we're really tired of it. OK. We're tired of it. We're tired of the incompetent people representing us. We're tired of -- because with of those people we are under -- I will honor this country. And it's like this, every place is totally packed, totally sold out as many people as you have seen work hard as before. It was -- it was the biggest birthday ever had. I mean, every crowd. These other guys come in. The guy like Cruz comes in and -- and you know, they have like 3, 400 people. They were in a conference room or some place. No, it's true. And Kasich the same thing, they have a couple of hundred people within about 20 minutes they're falling asleep. It's true. And Cruz you know, open the rhetoric, \"I will la -- I will.\" Well he's a liar. Well he got another one. You know, I have a great -- I have a great staff. I have a great staff. One of whom comes from Connecticut. But I have fantastic people. And I have all these people, connecting people. Right? Like I mean, they're great people. And it's so unfair. So with the Republicans down and Washington not far. Actually far. They want him, you know, they want to have like nice meeting, beautiful sunshine. They're wonderful. And they had a meeting and he said, \"Yes, Donald Trump knows he's really smart and he will, you know, be different when he's in private, of which of course we are.\" Everybody is. When I was speaking, who's not different though when you're in private room? So he's different here than he is there. Of course, we all are, right? I think. And we're different when we're talking about our policy speech and opposed to speech. Where I'm with people, my friends, I call this my friends, you know, you have the most loyal group of people. Every poll shows that they had people on the other day, \"We'll never leave Trump.\" they said. You know, one of them looked dishonest media people. The most, world's most dishonest people. What would it take to get you with people out of Trump? I'll hug that -- I'll hug that television set. What would it get? I was watching. Should have tender for friends behind you. What would it get for you to drop Donald Trump and go to another channel? Listen to this, listen, stop talking, we're never dropping. There's nothing you can do. That's right. That's right. I'll tell you what? And the other people, you're going to see, the other people. If they like seeds in the wrong direction they can drop. OK, they drop. We have the most loyal people on the cover of Time magazine. It's all over the place. We have . I don't have to be doing this thing. You don't have to be doing on a Saturday afternoon. There's so many things. And you look, and it's such an honor to have houses, look at all these people up there. I mean, look. How is it up there? Don't forget you're doing much better than the people standing outside. You got to remember that. But it's been amazing. So Paul is down and he said, \"Yeah, Donald and Donald would be a good member of the four, you know. Right now, we're fighting the party because it's a racist. OK? It's racist.\" So -- so you know, over a period times my wife would say, \"Be more presidential.\" Ivanka would say, \"Be more presidential.\" And I started thinking and I said, \"I can't.\" You know, being presidential is easy. Much easier than what I have to do. Here, I have to rant and rave. I have to keep you people going. Otherwise, you can fall asleep on me, right? If I was presidential, first of all, I have a teleprompter. You ever see crooked Hillary Clinton? She walks in, \"Good afternoon. How are you?\" You see crooked Hilary Clinton. When people start yawning, leaving, the whole thing is a disaster. And she'll be a disaster as president. But here's -- here's the thing, look, so he said -- he said that -- and Donald was obviously -- hey look, you know, a smart guy. Went to the best school, the best everything. I'm like, \"Really smart.\" I'm so smart. I don't want to even tell people, you'll all drop me. They said, \"It's no good.\" But we have smart people. We have, like the most incredible people that found their self. Paul was saying -- Paul was saying that, \"Well, you got a different view and if he's in a room, he's different than we spent in .\" Everybody is, right? So lying Ted Cruz, right? He said, \"He's insane.\" You know, with that horrible slurs. You know, the hand. Don't forget with the Bible. Right? He walks in, Bible held high. And he puts the Bible down and then he lies. Ted to show you how honorable people . They take these conversations. They didn't tell anybody. Probably illegal. I wonder if it's legal then they have to go to jail. But you know they did. Of course he's right. That's what he said was -- what he said, \"No, Mr Trump can be -- this way, that way can be pres.\" He could be anything he wants. Being presidential is the easiest. Because all you do is walk up and talk and leave and everybody falls asleep. Here's the story -- here's the story, so lying Ted Cruz said, \"He said his own manager was a great guy. His own manager said that he talks this way.\" I don't talk this way. And then he said, \"And he said you won't build the wall\" We're building the wall, folks. I didn't say anything. The wall is not even . So he said because in other words the concept is just to show you how disgusting politics. The concept is that, because of the fact that in a room I'm gonna act different than when I have thousands of people in front. I'm like everybody else. I'm saying essentially the same things. I say the same thing but you say it in different way. So what he did is took and said, \"He will change and he won't build the wall and he won't do that.\" Everything I said, I do folks. I do. OK? But to show you how dishonest he was, he actually used the expression like we said it. First of all, don't even say that. Even if we meant it. Nobody would say it. OK. Oh, we didn't do because I mean that totally. What I say here, and it's always going to be said in a different way. Depends on your audience, you have to be different. I mean, when we have this audience, we have to be different than when we have 12 people sitting in the conference room. Unless, you're Ted Cruz he speaks the same way. I was saying, he's -- he's an OK debater but he's a terrible golfer. Right? All right. And I beat him in every single debate. Every single debate would be Ted Cruz, lying Ted. You know, he was supposed to be a good debater and I said, \"I hear he's a good debater. Right?\" You know, he's supposed to be like he debated in high school or college or something. But you know, he never had a debater like me where I interrupt him every four words. You know what I mean. I don't actually think he is a good debater. So Drudge, the greatest guy, Drudge, Time magazine, you know they all write the debates. Right? Online polls. Hundreds and hundreds of thousands of people follow. You know who won? I've won every single debate. Every single source, every single debate. Pretty good. Pretty. I've never done it before. You know, I've folks -- I've been doing this now for 10 months. It's not like, \"Oh, gee.\" But I've been doing it for now nine months or 10 months. But -- but thank you darling, I love you too. Thank you. So. I'd love to doing it -- I'd love doing it because it's going to be so much fun. First of all, the people that I meet are unbelievable people. They love this country so much. That they'll be here -- that they'll be here on Saturday afternoon. In a room that's very warm complete Bonkley. The good news is you -- you speak. I just spoke in a room that was so hot. It was like a steam room. It was like -- it was like a steam room. You speak, it's exercising and it's like you lose -- you lose 10 pounds or so. What do I lose? Weight. But we're going to do such a good job and you have to remember, you're going to remember this afternoon. But you have to remember, on Tuesday, you have to get out and vote. Now, none of the other candidates are even coming. You know very little, to Connecticut, and I'm coming a lot together. I don't take anything, we can't take anything for granted. I know the poll numbers working. You have to forget the poll numbers because a lot of times people say, \"Oh, Trump he's going to win. I love Trump. He's going to win but I don't have to vote.\" The more we win by, the better it's going to be. Because we have a movement going on. It's being written about Bill O'Reilly, the other day. O'Reilly, right? And he's rough. And he is a rough guy and he's smart. What he said, \"The biggest political event to the effect, that this, The Trump Phenomenon.\" He said, and -- and sewing out the Trump Phenomenon ditch. You are the Phenomena, doing our connection. He said The Trump Phenomena has something to that effect, is the biggest political story. The most important political story of his lifetime. Did anyone see that? I almost fell off my chair once. Because I know, that he was always brilliant, brilliant, brilliant. But -- but the truth is and it's never an easy interview with Bill, I will tell you that, and he's straight down the middle. He has no friendships, no nothing. He goes right down and you got to hand it to him. And he said -- and he actually said it twice. Because he said it the night before too. Bill O'Reilly, when he said the biggest political story in his lifetime. And he mentioned in that is the assassination of John F. Kennedy. You know, which of course to me is you know, a big, big and horrible event. And we've had some horrible events and some very big event. So for him to say that, it was a very big step. And what he's saying is all over. When I go to Alabama, where we have 35,000 people. Our crowds are much bigger than Bernie by the way. And Bernie is over here. He's over here. And you know, but Bernie did make a couple of statements. Should I read the statements? Because we're going to forget about Bernie. You know, in about a month you'll say, \"Who's Bernie? Who the hell is he? Unless Hillary gets indicted in which case Bernie wins. But Bernie -- Bernie said that she's not qualified to be president. That's a big step. And then he pulled it back a little bit because that's the tough seller. You know why? I mean, she's . But I'll tell you where he was right. And then I'm happy with what Bernie said. He said, \"She suffers from bad judgment.\" She does have bad judgement. She want to go into the war in Iraq. I was against it by the way. And Bernie was against it. But she wanted to go into the war in Iraq. And I said, \"It's going to absolutely, you know, destabilize the Middle East if you do that.\" And it was a disaster. And that was right. You know they talked about Trump and stuff. Trump's going to have a fast trigger. But I want to confess, I'm probably going to have the slowest trigger of anybody but nobody is going to mess with me because they wanted me. . Bigger and better and stronger than ever, ever before. And we're going to take care of our vets who have been absolutely mistreated. OK. And by the way, we're going to respect our police officers because our police have got to be on the credit they deserve. Our police have not been given the credit they deserve. They're doing an unbelievable job, folks. OK. You know, they have one incident that was a mistake or you had a problem with somebody and out of millions of people. And they'll put that incident on television for weeks and weeks and weeks. OK? Our police are amazing people. So -- so this all began in June or June 16th when I came down in Trump Tower and I saw one medium. I mean, it looked like the Academy Awards, I said it all the time. It looked like the Academy Awards and it's that something I wanted to do. I love it's great company. I have a nice life, I have a wonderful family. Now, my family is involved in this. They're all excited. Eric and Don, Ivanka and Tiffany and all of them. That was a little bit, I mean, now I'll leave this stuff. But -- but even that reminds me and Melanie. They're all involve. And they -- they loved it. And they loved it because they -- they know we can going to make America great again, folks. And when I came down. When I came down to this thing. Really for me, it was about trade deals and it was about borders and it was you know, just so many things that. Trade is so easy it's not like right my wheelhouse because I know whether it's rich border or Albany where I was. Last week Syracuse, Poughkeepsie, Bethpage Long Island and outer Long Island, Suffolk County, all places I love. Right? Places that I mean, I had as much as 87 and 89%. Can you imagine getting 89% from something? I mean . What is that? I was saying this is about the Europe. To -- to have it overwhelming victory like that. We're smart, greater than even -- they know it's going to work it was far greater from the people that really know you the best. OK. They know me. They know the good, the bad, the ugly. They know Donald Trump. I grew up there. And I've been in so much papers and so much was written about me. Some correct and some, you know, dishonest. But -- but the people of New York really know me. So to have that kind of a victory is great. And it really shows a lot to Pennsylvania and Maryland and Rhode Island and Delaware and yourselves where, I mean Connecticut, honestly knows me. Pennsylvania knows me because I went to school there. And I went to school in Pennsylvania. It's a great place, great state. But they -- they all have the same problems and then we have problems where our jobs are being decimated. Six million jobs have been taken out of our country like so easily, so easily. And we have politicians that have been working on this problem for five years they don't know what to do. And what we're going to do, let's say we have our company here in Bridgeport goes to Mexico. Great. We'll call you. Enjoy Bridgeport employed , because you bet, you'll coming back. And what happens is this, and ideally you want to see these companies before they leave. Nobody talks, I don't think anybody talks them. When companies leave, I don't think people talk to them. If I were doing it, I'd say here's what it is. But the governors in all fairness they need help from the federal government. And we have to impose a major tax on these companies when they leave they go to Mexico like Carrier Air Conditioners. They go to Mexico and they think they're going to sell air conditioners back into our country, no tax, you know, free trade. Free trade, I believe in it 100% but not when you have stupid people negotiating your deals and money. OK? Because we don't have any . We don't have . So I'm a free trader but free trade means you know, if you look at Mexico their people are sharp. Their leaders are sharper, their smarter. What they're doing? They're killing us on the border. Killings us on the border. But that won't happen now even beyond the wall. The -- the patrol, if you look at the Border Patrol they gave us last week you probably saw it. First time in the history of the Border Patrol, they 16,500 men and women endorsed Donald Trump. They never done it before. They're incredible people and they're keeping the job. Sheriff Joe Arpaio of Arizona endorsed Trump. Everybody wanted his endorsement. He endorsed that, so we're going to have it's so important. We're going to have them all. We have to stop the drugs. You know what I want? New Hampshire. I adore them when I see the people of New Hampshire who are great people. That was my first victories. I love New Hampshire, from day one of this month. And you see this beautiful valleys and lakes, little roads right in front of us. It's beautiful. The people are perfect. And I go into a meeting and I say, \"So what's the big problem there?\" They say, \"Heroin.\" I say, \"What?\" Heroin. Just, right? It didn't -- it didn't mesh with these beautiful trees and then you know, heroin. And then you go to other places, come here and it's the same thing. I mean, I know all about Bridgeport for years . But you look, and it's coming in through the southern border. And I told the people of New Hampshire that right where I live. We're going to end that problem. And you know, the biggest problem. You know, in Singapore that's tough. Singapore is so tough on drug dealers. I mean, this country could be the killer. I don't want to have to tell you. What do they do in Singapore? He said, \"They hang them.\" You would never approve that. Singapore is so tough on drug dealers that people ponder. But Singapore is so tough, they don't have a problem. They're don't have a problem. There's no games. OK? They don't have a problem. With us, you get caught once, twice, something like eight times and then they start getting a little bit tougher. You can't solve problems like that. But I told the people of New Hampshire that I told South Carolina when I went in South Carolina. That was supposed to be a stronghold for Ted Cruz. Was only one problem I won in a landslide. And I won with the Evangelicals because Evangelicals don't like liars and he's a liar. So I won with the Evangelicals and I won it in a landslide and I won Louisiana. And that's when I realized the system's rigged because I won Louisiana. And I said, \"Oh, I wasn't supposed to win Louisiana. I was behind and I was not supposed to win. That was supposed to be a Ted Cruz.\" And remember there are also other people. There are other people. And again, I'm doing so late and now I'm getting over 50% with all these people. Now we're down to three, finally. Remember, when they say, \"Trump doesn't get over 50%.\" I was having 12 and 14 and 15. I was just like Karl Rove they S&P. He still thinks Romney won, Romney won. He's got -- he was off last night and he was, it was -- he was trying to explain, how the fact that I won New York in one of the greatest landslides anyone's ever seen. For granted that, it wasn't really that good. It wasn't. And even the -- I -- I won't say what was in this but him. But even he was like, \"Real?\" And I hate it. The level of hatred by the establishment of us is so incredible. OK? It's so totally incredible. So. What? No, no. We're going to change that, by the way. We're going to change it. We're going to change it. But when you watch, when you watch this guys and they were talking about the 50%. And he said, \"Again 50%.\" But this time -- and 61 or 62% he can't do that anymore so he came up with another narrative. But when you watch him struggling. He's all nervous and all crazy because this stuff happened. They say it was one of the biggest. Even people that hate me said, \"That was a massive victory.\" Right? And he's working so hard that no one listen to me that much. You know, it's only in New York. It doesn't mean that much. And you see, look folks, the system is rigged. So what happens is, Louisiana was Ted Cruz. Ted Cruz was going to win the south. He was going to win all of the south. There's only one problem. I won the south. Listen, I won Alabama, I love Alabama. I said before, \"If I don't win in Connecticut I'm moving to Alabama.\" Because I'm telling you, they're treating me good. OK? If I won the south, I won -- I won Alabama, I won Arkansas, we won places. We won Kentucky. We won so many places. Florida was one of the greatest. We won in . Right? And our won Massachusetts. So when Alabama and Massachusetts that's pretty different OK? But we have all these victories. And I said that people, the system -- I really found out about the rich system in Louisiana because I was behind. I wasn't supposed to win. I was told don't go there. And then a poll came out that I was seven or eight points behind. I said, \"Hey, let's give it a shot.\" So I went down there a couple of times and the final line was on Friday night and I made a speech. And we had an airplane hangar that was massive land from Boeing 747. It was massive. And we said, \"I'm coming to make a speech the night before the election.\" That election took place I believe on a Saturday. And I made the speech and the people were unbelievable and that it was like a love fest. Like this is. It was like a love fest. OK? And -- and like this. The people of this country are amazing. That's why they're calling it a movement on the cover of Time magazine. A movement. And by the way, they say it's a movie like we've never had in the history of our country. It's true. Millions of. So I win Louisiana and I'm making the speech and it was unbelievable and I left. And the next day they had the election and I won. Please. I won. And then I wasn't supposed to win. He was supposed to win and it was an upset. And I was just fine. Now a couple of weeks later, they're airing up different things and they're showing how well we're doing because we're winning a lot of states. And mostly, you know, mostly. And then I see all these guys, \"Oh, you made a mistake.\" I -- I said, \"Why? You know, we don't make a mistake?\" \"No, no. You made a mistake.\" I won the state, easily. And you have this guy Cruz having more delegates. And they're lying Ted. I won -- I won Louisiana and you have Cruz over here. Well that can't be possible. How do you win it? And you don't get as many delegates. It's -- it's a no. I'll tell you how they do it. It's a rigged system. So while I'm working with speeches that he can't win with the people. He will get decimated. When they start doing negative ads, I had 55,000 negative ads. Kasich had to have one. When they started -- if they put one ad on Kasich. One ad. It's going to be point. But you know what happens. I said, \"So how does this happen?\" And then all of a sudden they realized they have all of it. They film this stuff for like nine or 10 months. All of a sudden they realized these are rigged deal. Because how can you win the state? In less delegates. Right? So we started to talk to sit and watch out the delegates in Pennsylvania lovers. OK. But it's still a bad system because when you win with a popular vote and when you win states by a lot with the popular vote, you win that state. You win that. So what this guy does? He can't win the popular vote. Because he's got zero personality, because he lies like thief. OK? And he can't win with the popular vote. So he's got this large number of people, probably paid for by a super PAC which is not supposed to be happening. Go around, whining and dining people, taking them out to dinner, spending a lot of money. Probably getting them hotel rooms and everything else. Why did you see? We'll figure it all out. But I'll tell you what? It's really buying an election in this country if you can't do that, folks. You can't do. So you're not allowed to do that in theory. And I'd be interested to see this the super PAC doing it. OK? You're not supposed to be doing it at this total communication I would say. So we're dealing with a broken system. We're dealing with a crooked system like crooked Hillary. And we're dealing and we're dealing. We're really dealing with a fixed deal and we're going to change it. Now, the only way to beat that at this stage, the only way to beat that is like the fighters say. You know, the boxers and I love the boxers. I've always liked the boxers through all the dirt. Mike Tyson endorsed me, they all endorsed me. You know, I want to get Bobby Knight to endorse me in Indiana as he endorsed . I love Bobby Knight. The truth is he did endorsed me. Do I look bad? Bobby Knight, I love the great basketball. Bobby Knight, he's a great guy. Good you have Booby Knight in Indiana. In a week, and -- and honestly, I like the tough guys. I like the guys that are tough. Because there's something about them. OK? And they fight me and that's what you want, folks. Because you know what? The world is tough, the world is not so. The world is tough. We're not tough. This country is not tough. Our leaders aren't tough, our negotiators, our representatives are not tough. Secretary of State Kerry is not tough for he can . We need -- we need toughness. You know, when Jeb Bush used to say, \"I don't like his tongue.\" My tongue. They are chopping off people's heads in the Middle East. They're drowning people in steel cages. And Jeb does this, \"I don't like Donald Trump's tongue.\" OK? I don't have that side. I'm just angry at the incompetence of our leadership. The gross incompetence of our leadership. And we'll going to change it. I'm going to change it on Tuesday when we won the poll. Every time he said the same things. He said, \"His tongue.\" They use the same word. \"It's very harsh.\" Well, I think he's very harsh. But he's tongue, she said, \"He's very harsh.\" I mean, here is -- think of it, linger it, linger it. We're being ripped off by China. We're going to have a trade deficit of $505 billion, with China. We're going to have a trade deficit with Mexico of $58 billion a year. We have trade deficits of Japan and all with everybody. I mean, almost everyone. Almost everyone. Are you OK? OK Ted. I mean, he looks like Ted. Don't forget, make America great again. Is it powerful? Make America great again. They said to me, they said to me a little while ago, they said, \"Well, that's not very positive messages.\" Actually, it's very positive because if I didn't say that, it would be just an hope. Just hope. We have tremendous hope. We're going to make our country so strong again. So here's what we're going to do, listen to me. Listen to me. This has been a great afternoon. This has been a great. We're going to go. We're going to go on Tuesday and so forth. And you going to get all with your friends, and go and vote. And that's when you're look back and I say this all the time and I mean it. I will do such a great job today. You will love your president but more important you'll be proud of your country. So you going to look back to your vote and you'll going to say, \"That was the single greatest vote I've ever cast.\" You'll going to look back, three years from now or 10 years from now or 30 years from now. You'll going to say the greatest vote I ever cast. Was that Tuesday? I watch Donald Trump and then went to cast. That Tuesday, when I went to cast my vote because that's when our country started winning again and being great again. And I can only promise you this, we're going to start winning again. We're going military, we're going to build to that and make it great. We're going to not terrorize this. Got it good. And hopefully . We're going to have a strong military. We're going to take care of our vets of as part of it. We're going to straight down on our education. We're going to straight down Obamacare. We're going to repeal it and replace it. It's going to be down. We'll replaced with something that is absolutely terrific and we have so many options. That's a sad part. There were so many options and they didn't choose anything. They went with this horrible system that's totally underwater, now a disaster. So we're going to get rid of it. So you get away with health care. You're going to win with the Second Amendment which will going to change. You going to for every level of government. You'll going to win it, the borders. We're going to have a strong powerful beautiful borders and people are going to come into our country but they're going to come in legally and we will build the wall. But people will come in and they going to come in. And we're going to win with trade. We're going to make great trade deals and we'll not going to let our businesses be ripped out of our state and ripped out of this country anymore. We're going to stop . And they'll not going to leave, folks. And we're going to make America great again. "}