{"id":398,"author":"Donald Trump","title":"Speech: Donald Trump in Harrington, DE","date":"2016-04-22","link":"https://factba.se/transcript/donald-trump-speech-harrington-de-april-22-2016","paragraphs":["You know, when I left the office I asked for a couple of things, I said, \"Number one, I spend a fortune in Delaware.\" Nobody knows that, right? It's a great place, so I said to my people I had no idea. I said, \"You know we do a lot of business in Delaware.\" That's good 'cause that means taxes and everything.","So I said, \"How many entities do we have registered in Delaware. Like companies and this -- \" So I figured they'd say maybe two or three, right? Three hundred and seventy eight.","I said, \"What!\". So we have 378 entities registered in the state of Delaware. Meaning I'd pay you a lot of money, folks. I don't feel at all guilty, OK. I don't know, they might be off by a couple but that's about it. They did it -- They had about 12 minutes to give me the answer so it could be a little off.","But you know what it is, it's a lot. All right, good. That's good. All right. So -- and it's a great place. I'd say they have great people and really they've done corporately an unbelievable job. Hello, folks.","Hello, folks. Thank you. Still can't believe 378. Here's the bad news. But we're going to go through this mess because you know why. We're going to fix it. OK. We're going to fix it. We're going to fix it fast.","Real median household income in Delaware has declined by more than $10,000. Think of it, since 2000. No good, right? No good. Well, I'm doing my share. Delaware lost one third of its manufacturing jobs since China entered the World Trade Organization in 2000 and won.","This region of the state also lost one third of its manufacturing jobs, same period China. Oh, by the way, lying Ted Cruz supports Chinese currency cheating, now think of it. He voted against the amendment to try and block currency cheating by China.","And Ted Cruz voted against it. And it's the single biggest weapon that China and other countries have against us for just absolutely destroying our businesses. And this guy voted against it. It's almost impossible to vote against it if you love our country. But you know what happened. Somebody got to him and said, \"Listen, we want you to vote against it because some company or some country didn't want it.\" And this is what we have running for office.","No more, folks. We're going to end it.OK? Terrible.","I actually had to have that one checked. I said, \"How can you vote against that?\" Nobody can, why he voted. Lying Ted Cruz. Delaware was hit very hard by closures of its auto manufacturing plants, right? Yes. Over the years including Chrysler and GM plant. Cruz and Kasich supports the Trans-Pacific Partnership, which will absolutely kill the auto industry in this country.","I'm against it, I've been fighting. And Casey voted for NAFTA, which has cleaned our clock for years when he was a congressman. So we can't let that stuff happen, folks.","And by the way, Trans-Pacific Partnership is worse than NAFTA's. It's gonna be worse. We've got to stop it. We've got to stop it. We've got to stop it. OK? Obama wants it. If Obama wants it, you know it's no good, OK? Man, oh man. Don't, don't. A couple of more and then -- because I hate to do it it's like so negative, right?","But it doesn't matter because if I become president we're gonna turn it around, we're going to make great trade deals. We're going to make great trade deals we're gonna bring our jobs back and we're going to keep the jobs that we have here. Believe me. Believe me.","All right. The number of food stamp recipients in this county has increased sixfold. That's a lot. Since 2000. Wow, 6,000 food-stamp recipients. Now you have 36,000. Come on, fellows, we've got to get going here. We'll get it changed. Delaware voters are concerned about the possible intake of Syrian refugees.","Is that unbelievable? The state has seen large increases in its foreign born population. We don't even know where the hell they come from. We don't know where they come from, who they are. They're totally undocumented. And you've seen a large intake.","With the problems that we have, you've seen a large intake. Do you remember when they said they were going to only take 3,000? That it was 6,000 and I said it was gonna be a lot more. I was saying 200,000. You know what, I'm right. OK. We're taking in tens of thousands of people. And you know what, we all have heart and we want to take care of that but we don't know where these people are coming from.","Totally, like they have no documents, totally undocumented. We have enough problems in our country. We've got 19 trillion in debt. We've got a border, the southern border is like a piece of Swiss cheese and we'll talk about it.","We will build the wall. Yes, we will build the wall. Build the wall. Build the wall. Build the wall. Build the wall. We will. I will build it. We'll build it. Who's going to pay for it? One hundred percent, OK. By the way, are we having a good time? I mean, you know, we have a great time considering the subject matter is no good, right?","But when we say -- look at all those hats, Make America Great Again, when we say that, you know, somebody, a reporter -- by the way is the world's most dishonest people are back there.","Look at all the cameras going. Look at all those cameras. It's unbelievable. They are dishonest. Most of them, not all of them but most of them. Although last night Bill O'Reilly said, because you know this is a movement, folks, no matter where we go there's more people pouring in. Look at this place. It's big place.","A lot of people. But Bill O'Reilly on Fox said last night that what's happened with Trump is one of the biggest political events that he's ever seen. And in fact, I'll go a step further, he actually said it's the biggest political event that he'd seen in his lifetime. That's a big -- right?","He said the biggest political -- and he's a pro and he's an amazing guy, and tough, and smart. Doesn't always treat me great, but that's OK. But I'll tell you, he said the biggest political event he's ever seen in his lifetime. So I have to tell you that there is something going on that's incredible no matter where we go. We go to Alabama we had 35,000 people and we won Alabama.","We won Arkansaw. We won Kentucky, and we won Florida. And we won South Carolina, and we won New Hampshire. And we won Connecticut and we won so much.","And why did we wait two days to go with record numbers, New York, oh. You know what's nice about winning New York, really, and not just the fact that it's big and it's got -- you know, we won almost every delegate. We won and we won by a massive amount, we had 62%. And when you think of it you got three people running.","It's almost impossible to break 50 and we got 62%. But what -- Really is.","But you know what's nice about winning New York? Those people know me well. I mean, you don't know me as well, you just take all my money with all the taxes. OK. But, but I've known Delaware for a long time and it's a great -- it's a great place and we're going to get rid of all the bad stuff that we talk about.","We're going to get rid of it, but we're going to get rid of it. And we have to do that also at a federal level. You know you can't allow policy that allows China and Mexico, and Japan, and Vietnam, and India.","You can't allow policy that allows these businesses to be ripped out of your state like candy from a baby, folks. Like candy from a baby. It'll all end and we'll talk about that. But what's really nice about New York is they know me the best. You know, I grew up in New York and I've been in New York for a long time and I've been very public.","I've been very well vetted. Everything I've ever done, if I sneeze, it's a big story.","But they know me they know me well. And to win by that kind of a margin is not just the size of New York but even from another person from another state call me, a friend of mine from another state said, \"The nicest part, they know you so well in New York. And for you to win by this massive number, a record setting number, is really a great tribute.","And I never thought of it that I just wanted to get over 50. Right? And we got a lot over there.","So it is. It's a great -- and they're great people in New York and you know I went over the state and I know New York state very well. You had Syracuse and Rochester and Albany and lots of other places. Poughkeepsie. We went to Long Island, Bethpage. We went all over. We went all over. And Suffolk County, and it's horrible what's going on. You look at -- And same here, same everywhere.","And it's interesting because I always ask for these things, you know, this stuff. And I ask for it and I say, you know the statisticians they get it out of the books they get out of government books and I say, \"Give me the information.\"","So I've done many speeches in many places over the last, you know, couple of months. And it's like always the same, the manufacturing jobs are being stolen, our jobs are being taken. We're losing at every front. There's nothing good. Our country doesn't win anymore. You just look. And it's the same thing, whether it's Delaware or whether it's Syracuse, New York or whether it's Albany, we have 21,000 people in Albany show up. Incredible people in an arena, great arena, but we have 21,000 people.","We had thousands and thousands of people show up at every stop.","And it's always the same. I say, \"Get me the information.\" And if the information was good I'd like to read it. I'd much rather read it than read this stuff. But it's always the same. The jobs are being stripped. The factories are closing and you ride through some of these communities and you just go from the airport to like a venue like this, and you see all of the closures.","You see it. You could see it was a thriving place 20 years ago, 10 years ago, 30 years ago. And now it's just been stripped.","It's been stripped and we're not going to let it happen anymore, folks. OK. We're not going to be the dummies. We're not going to be the dummies. It's terrible. It's terrible. I even said when they gave me the statistics, I said, \"What do I need him for?\" All I have to do, I mean, I have a good memory like a great memory, all I have to do is get up and say manufacturing down 30%. It's the same thing everywhere.","It's the same thing everywhere. I don't even blame, I mean, in some cases you have to say local politics or local politicians that support.","But the big -- the big mega -- mega deal is what's happening with our country. Our leadership is terrible. Our leadership is incompetent. We don't know what the hell we're doing. It's right. There really is no leadership. You know you have a president who goes to Cuba, he watches a game and there's a big tragedy happens, watches the end of the game.","He lands in Cuba. No. He lands in Cuba and there's nobody to greet him.","Now here's the difference. No problem with Cuba, by the way, no problem. And it's time to make a deal. I'd like to see a better deal but it's fine. But you land in Cuba and nobody's there. Now in the history of Air Force One, which is pretty long, right, for the first time anybody that plane has ever landed when nobody was there.","In other words, there was not the head of the state. Castro, anybody to greet.","Then he goes to Saudi Arabia, same thing happens. The big leaders are not there to greet him at the plane. And you know what I would do? If I said, \"Well, how are we doing? Who's here to greet me? I'm the president of the United States. I'm on Air Force One. Who's here?\" Well, we don't have anybody to greet you, Mr. President.","Now Obama gets off the plane. Here's what I do. Pilot, boom go back to Washington.","So. Go back to Washington. And I love the Cuban people and I love the Saudis. Go ahead. Go ahead. Why. Let's have some fun. It's Friday. Let's have some fun. Let's have some fun. It's Friday. I have all the time in the world. Great, great people, great people in this country. We're going to have Apple, and we're going to have companies, you watch.","They're going to start making their products in our country, folks, you watch, you watch. I know how to fix the system. You know you have these guys they talk about free trade. Look what free trade has done to our country. No matter where I go, no matter where I go. Look. Look at what's happened with free trade and I'm a free trader, I believe in free trade but I don't believe in being stupid.","I don't believe in these deals. They're so bad. We have to make great deals. We have a lot of time. You know, I told the story a couple of times you so honored by it actually. I wish you did hear it. But a friend of mine is dying, he's dying, very sick. He's the toughest guy and he's always been like the toughest guy, successful.","He made himself successful. He just grabbed whatever -- he just made himself.","And he's a good person but really a tough person. And I've always liked him. And a champ or winner and he gets sick. He's very sick and he was supposed to be dead a year ago and he's just got good genetics or something. The doctors can -- I even speak to the doctors. \"How's he doing?\" They said, \"We can't believe it.\" He's alive a year longer than he's supposed to be. And I call him like every couple of days.","And I say, \"How are you doing.\" \"I'm all right.\" I said, \"You're all right.\"","And in a way it reminds me of our country because our country has been so abused for so long by incompetent politicians by horrible deals, by horrible deals. I mean, we have potentially the greatest military in the world but it's been decimated with cuts and problems. We don't take care of our vets. We lose on every single front.","And then we make trade deals where it's hard to believe. Friends of mine say how could it be possible to make a deal like that. They must be really stupid. I said, No, they're not stupid.\" They get major, major campaign contributions so they make bad deals because they're paid off with PAC money and campaign contributions.","So that's what I thought it is. So, I mean it's sad. But it reminds me my friend, for this country it keeps going. The debt keeps getting larger. Now we're up to 19 billion. They signed a horrible budget deal three months ago, the omnibus budget, which by the way funds the Syrians coming in. It takes care of illegal immigration coming in. It keeps funding Obamacare, which is a disaster and we're going to repeal it and replace it. Repeal it and replace it.","And I tell you, it just reminds me my friend. you know it shows you how great our country is. That our country can be abused by politicians that are so corrupt or so incompetent that we continue to go along. But we're sitting on a big fat bubble and we better get going fast because it's not going to be pretty it'll be like no other, and we better get going fast.","OK? We better get going fast."],"text":" You know, when I left the office I asked for a couple of things, I said, \"Number one, I spend a fortune in Delaware.\" Nobody knows that, right? It's a great place, so I said to my people I had no idea. I said, \"You know we do a lot of business in Delaware.\" That's good 'cause that means taxes and everything. So I said, \"How many entities do we have registered in Delaware. Like companies and this -- \" So I figured they'd say maybe two or three, right? Three hundred and seventy eight. I said, \"What!\". So we have 378 entities registered in the state of Delaware. Meaning I'd pay you a lot of money, folks. I don't feel at all guilty, OK. I don't know, they might be off by a couple but that's about it. They did it -- They had about 12 minutes to give me the answer so it could be a little off. But you know what it is, it's a lot. All right, good. That's good. All right. So -- and it's a great place. I'd say they have great people and really they've done corporately an unbelievable job. Hello, folks. Hello, folks. Thank you. Still can't believe 378. Here's the bad news. But we're going to go through this mess because you know why. We're going to fix it. OK. We're going to fix it. We're going to fix it fast. Real median household income in Delaware has declined by more than $10,000. Think of it, since 2000. No good, right? No good. Well, I'm doing my share. Delaware lost one third of its manufacturing jobs since China entered the World Trade Organization in 2000 and won. This region of the state also lost one third of its manufacturing jobs, same period China. Oh, by the way, lying Ted Cruz supports Chinese currency cheating, now think of it. He voted against the amendment to try and block currency cheating by China. And Ted Cruz voted against it. And it's the single biggest weapon that China and other countries have against us for just absolutely destroying our businesses. And this guy voted against it. It's almost impossible to vote against it if you love our country. But you know what happened. Somebody got to him and said, \"Listen, we want you to vote against it because some company or some country didn't want it.\" And this is what we have running for office. No more, folks. We're going to end it.OK? Terrible. I actually had to have that one checked. I said, \"How can you vote against that?\" Nobody can, why he voted. Lying Ted Cruz. Delaware was hit very hard by closures of its auto manufacturing plants, right? Yes. Over the years including Chrysler and GM plant. Cruz and Kasich supports the Trans-Pacific Partnership, which will absolutely kill the auto industry in this country. I'm against it, I've been fighting. And Casey voted for NAFTA, which has cleaned our clock for years when he was a congressman. So we can't let that stuff happen, folks. And by the way, Trans-Pacific Partnership is worse than NAFTA's. It's gonna be worse. We've got to stop it. We've got to stop it. We've got to stop it. OK? Obama wants it. If Obama wants it, you know it's no good, OK? Man, oh man. Don't, don't. A couple of more and then -- because I hate to do it it's like so negative, right? But it doesn't matter because if I become president we're gonna turn it around, we're going to make great trade deals. We're going to make great trade deals we're gonna bring our jobs back and we're going to keep the jobs that we have here. Believe me. Believe me. All right. The number of food stamp recipients in this county has increased sixfold. That's a lot. Since 2000. Wow, 6,000 food-stamp recipients. Now you have 36,000. Come on, fellows, we've got to get going here. We'll get it changed. Delaware voters are concerned about the possible intake of Syrian refugees. Is that unbelievable? The state has seen large increases in its foreign born population. We don't even know where the hell they come from. We don't know where they come from, who they are. They're totally undocumented. And you've seen a large intake. With the problems that we have, you've seen a large intake. Do you remember when they said they were going to only take 3,000? That it was 6,000 and I said it was gonna be a lot more. I was saying 200,000. You know what, I'm right. OK. We're taking in tens of thousands of people. And you know what, we all have heart and we want to take care of that but we don't know where these people are coming from. Totally, like they have no documents, totally undocumented. We have enough problems in our country. We've got 19 trillion in debt. We've got a border, the southern border is like a piece of Swiss cheese and we'll talk about it. We will build the wall. Yes, we will build the wall. Build the wall. Build the wall. Build the wall. Build the wall. We will. I will build it. We'll build it. Who's going to pay for it? One hundred percent, OK. By the way, are we having a good time? I mean, you know, we have a great time considering the subject matter is no good, right? But when we say -- look at all those hats, Make America Great Again, when we say that, you know, somebody, a reporter -- by the way is the world's most dishonest people are back there. Look at all the cameras going. Look at all those cameras. It's unbelievable. They are dishonest. Most of them, not all of them but most of them. Although last night Bill O'Reilly said, because you know this is a movement, folks, no matter where we go there's more people pouring in. Look at this place. It's big place. A lot of people. But Bill O'Reilly on Fox said last night that what's happened with Trump is one of the biggest political events that he's ever seen. And in fact, I'll go a step further, he actually said it's the biggest political event that he'd seen in his lifetime. That's a big -- right? He said the biggest political -- and he's a pro and he's an amazing guy, and tough, and smart. Doesn't always treat me great, but that's OK. But I'll tell you, he said the biggest political event he's ever seen in his lifetime. So I have to tell you that there is something going on that's incredible no matter where we go. We go to Alabama we had 35,000 people and we won Alabama. We won Arkansaw. We won Kentucky, and we won Florida. And we won South Carolina, and we won New Hampshire. And we won Connecticut and we won so much. And why did we wait two days to go with record numbers, New York, oh. You know what's nice about winning New York, really, and not just the fact that it's big and it's got -- you know, we won almost every delegate. We won and we won by a massive amount, we had 62%. And when you think of it you got three people running. It's almost impossible to break 50 and we got 62%. But what -- Really is. But you know what's nice about winning New York? Those people know me well. I mean, you don't know me as well, you just take all my money with all the taxes. OK. But, but I've known Delaware for a long time and it's a great -- it's a great place and we're going to get rid of all the bad stuff that we talk about. We're going to get rid of it, but we're going to get rid of it. And we have to do that also at a federal level. You know you can't allow policy that allows China and Mexico, and Japan, and Vietnam, and India. You can't allow policy that allows these businesses to be ripped out of your state like candy from a baby, folks. Like candy from a baby. It'll all end and we'll talk about that. But what's really nice about New York is they know me the best. You know, I grew up in New York and I've been in New York for a long time and I've been very public. I've been very well vetted. Everything I've ever done, if I sneeze, it's a big story. But they know me they know me well. And to win by that kind of a margin is not just the size of New York but even from another person from another state call me, a friend of mine from another state said, \"The nicest part, they know you so well in New York. And for you to win by this massive number, a record setting number, is really a great tribute. And I never thought of it that I just wanted to get over 50. Right? And we got a lot over there. So it is. It's a great -- and they're great people in New York and you know I went over the state and I know New York state very well. You had Syracuse and Rochester and Albany and lots of other places. Poughkeepsie. We went to Long Island, Bethpage. We went all over. We went all over. And Suffolk County, and it's horrible what's going on. You look at -- And same here, same everywhere. And it's interesting because I always ask for these things, you know, this stuff. And I ask for it and I say, you know the statisticians they get it out of the books they get out of government books and I say, \"Give me the information.\" So I've done many speeches in many places over the last, you know, couple of months. And it's like always the same, the manufacturing jobs are being stolen, our jobs are being taken. We're losing at every front. There's nothing good. Our country doesn't win anymore. You just look. And it's the same thing, whether it's Delaware or whether it's Syracuse, New York or whether it's Albany, we have 21,000 people in Albany show up. Incredible people in an arena, great arena, but we have 21,000 people. We had thousands and thousands of people show up at every stop. And it's always the same. I say, \"Get me the information.\" And if the information was good I'd like to read it. I'd much rather read it than read this stuff. But it's always the same. The jobs are being stripped. The factories are closing and you ride through some of these communities and you just go from the airport to like a venue like this, and you see all of the closures. You see it. You could see it was a thriving place 20 years ago, 10 years ago, 30 years ago. And now it's just been stripped. It's been stripped and we're not going to let it happen anymore, folks. OK. We're not going to be the dummies. We're not going to be the dummies. It's terrible. It's terrible. I even said when they gave me the statistics, I said, \"What do I need him for?\" All I have to do, I mean, I have a good memory like a great memory, all I have to do is get up and say manufacturing down 30%. It's the same thing everywhere. It's the same thing everywhere. I don't even blame, I mean, in some cases you have to say local politics or local politicians that support. But the big -- the big mega -- mega deal is what's happening with our country. Our leadership is terrible. Our leadership is incompetent. We don't know what the hell we're doing. It's right. There really is no leadership. You know you have a president who goes to Cuba, he watches a game and there's a big tragedy happens, watches the end of the game. He lands in Cuba. No. He lands in Cuba and there's nobody to greet him. Now here's the difference. No problem with Cuba, by the way, no problem. And it's time to make a deal. I'd like to see a better deal but it's fine. But you land in Cuba and nobody's there. Now in the history of Air Force One, which is pretty long, right, for the first time anybody that plane has ever landed when nobody was there. In other words, there was not the head of the state. Castro, anybody to greet. Then he goes to Saudi Arabia, same thing happens. The big leaders are not there to greet him at the plane. And you know what I would do? If I said, \"Well, how are we doing? Who's here to greet me? I'm the president of the United States. I'm on Air Force One. Who's here?\" Well, we don't have anybody to greet you, Mr. President. Now Obama gets off the plane. Here's what I do. Pilot, boom go back to Washington. So. Go back to Washington. And I love the Cuban people and I love the Saudis. Go ahead. Go ahead. Why. Let's have some fun. It's Friday. Let's have some fun. Let's have some fun. It's Friday. I have all the time in the world. Great, great people, great people in this country. We're going to have Apple, and we're going to have companies, you watch. They're going to start making their products in our country, folks, you watch, you watch. I know how to fix the system. You know you have these guys they talk about free trade. Look what free trade has done to our country. No matter where I go, no matter where I go. Look. Look at what's happened with free trade and I'm a free trader, I believe in free trade but I don't believe in being stupid. I don't believe in these deals. They're so bad. We have to make great deals. We have a lot of time. You know, I told the story a couple of times you so honored by it actually. I wish you did hear it. But a friend of mine is dying, he's dying, very sick. He's the toughest guy and he's always been like the toughest guy, successful. He made himself successful. He just grabbed whatever -- he just made himself. And he's a good person but really a tough person. And I've always liked him. And a champ or winner and he gets sick. He's very sick and he was supposed to be dead a year ago and he's just got good genetics or something. The doctors can -- I even speak to the doctors. \"How's he doing?\" They said, \"We can't believe it.\" He's alive a year longer than he's supposed to be. And I call him like every couple of days. And I say, \"How are you doing.\" \"I'm all right.\" I said, \"You're all right.\" And in a way it reminds me of our country because our country has been so abused for so long by incompetent politicians by horrible deals, by horrible deals. I mean, we have potentially the greatest military in the world but it's been decimated with cuts and problems. We don't take care of our vets. We lose on every single front. And then we make trade deals where it's hard to believe. Friends of mine say how could it be possible to make a deal like that. They must be really stupid. I said, No, they're not stupid.\" They get major, major campaign contributions so they make bad deals because they're paid off with PAC money and campaign contributions. So that's what I thought it is. So, I mean it's sad. But it reminds me my friend, for this country it keeps going. The debt keeps getting larger. Now we're up to 19 billion. They signed a horrible budget deal three months ago, the omnibus budget, which by the way funds the Syrians coming in. It takes care of illegal immigration coming in. It keeps funding Obamacare, which is a disaster and we're going to repeal it and replace it. Repeal it and replace it. And I tell you, it just reminds me my friend. you know it shows you how great our country is. That our country can be abused by politicians that are so corrupt or so incompetent that we continue to go along. But we're sitting on a big fat bubble and we better get going fast because it's not going to be pretty it'll be like no other, and we better get going fast. OK? We better get going fast."}