{"id":399,"author":"Donald Trump","title":"Speech: Donald Trump in Harrisburg, PA","date":"2016-04-21","link":"https://factba.se/transcript/donald-trump-speech-harrisburg-pa-april-21-2016","paragraphs":["-- are you -- So I am supposed to wait a half an hour because there are thousands of people outside trying to get in but I can't do that to you. So we're going to come on right now. So I've never done that before, you know, I've never done that before. I've never introduced myself. But they didn't quite say it right the first time.","So, anyway, now we have thousands of people outside thousands and, they're going to pour in the filling up the floor. They're filling up and I just said you know what, they're coming through the mags and I said you know what, let's start a little bit earlier, right? The hell with this. Well, I want to tell you, we have a lot of friends here tonight.","And I think, we have our two favorite congressmen and we're here -- before we introduce them I'd -- get them out of here. Get them out. Get them out. Go ahead, go home to mom. Go home to mommy. These people, I tell you, you can't get rid of them. Oh, that's okay. That's okay. Be gentle.","You know, I have to say that. Be gentle, be nice and easy. Got him? Got him? Are you OK? Good. Our people take care of our people, right? So -- good. Thank you. So we have a lot of friends here tonight and I'm going to introduce just a few. First of all, a man who takes on a nightly basis and he loves this area.","He lives right around here. And you know, who knows Pennsylvania better than Donald Trump. I went to school here. I went to school here. But -- and it's a great state, but a man who is constantly defending me and he really does a good job. And whenever he's in a little doubt, he says he reminds me of Ronald Reagan.","That's OK, right? Jeffrey Lord, he works with CNN. Jeffrey, a great guy. He's become very famous. I will tell you, and he's a great defender. There's nobody better. Also, we have two congressmen here who have been unbelievable. They've been here right from the beginning. I have absolutely no idea where they are, but they're here someplace.","Congressman Tom Marino, you know, where's Tom? Where is our Tom? And Lou Barletta. Congressman Barletta. Lou. Lou. So they're here. They've been amazing. I mean, they've really been amazing. So folks, I hate to do this. We're going to depress you for a little while and then, we're going to have so much fun because here's the bottom line.","We're going to make it better. We're going to bring our jobs back. We're going to strengthen our military. We're going to build a wall. We're going to build a wall. We're going to build a wall. Oh we're going to build it. We're going to build it and you know who is going to pay for it. I don't hear you.","100%, OK? 100%. So I told my folks, and by the way, how good was Stephen? Is Stephen good, right? And he tells the truth. He's a straight arrow and he tells the truth. So Pennsylvania, I love you too. That was a guy, but I love him anyway, OK? Pennsylvania has taken -- I know I just asked a group.","So I said give me some talk on Harrisburg and on Pennsylvania, and I want to just see what it is. Pennsylvania is taking harder hits on trade than just about anywhere else in the United States.","Not good. Not good. The state of Pennsylvania has lost more than 35% of its manufacturing jobs since 2001. Not good. What are you guys doing? How do you let this happen, guys? How do you let this happen? Don't worry. Doesn't matter. We're bringing it back. They're all going to come back better than left.","Better than left. And that includes steel and that includes coal, clean coal, but that includes a lot of things that a lot of industries that are being decimated. Harrisburg lost nearly 40% of its manufacturing jobs since 2001. That's amazing. You know, the number's so high. And I'll tell you what, in 2001, and Jeffrey knows this, that's when China.","Oh that's when China went into the World Trade Organization. Guess what? Now, in all fairness to China, we're not only talking about China. We're talking about a lot of different places. Mexico has been taking your companies like, like it's candy from a baby, right? Median in -- and this is so terrible. Median household income in Harrisburg, in the Harrisburg region of Pennsylvania, has declined $7000 since the year 2000. Now look, countrywide just so you understand, people, hardworking unbelievable people, their income and their wages have gone down over the last 14, 15 years.","Their real wages have gone down. They work longer. They work harder. Some of them are working double jobs. Some of them are forced to go part-time jobs because of Obamacare. It's a disaster. They're forced to do it. No good, folks. No good, going to end. Where -- and by the way, just in case, I don't want to hold it too long.","We will repeal and replace Obamacare. Just, you know. Food stamps as you know, are up almost 300% in this area. Now, Pennsylvania used to provide and boy do I know this. Hey, how good is Ben? Big Ben. Do we love Big Ben? Big Ben. I'm just saying because he's a friend of mine. I played golf with him a couple of times.","He actually hit a drive and it went right. It hit a tree. It was a massive tree. The ball hit the tree so hard. I said Ben, that tree will be dead within two years. I'm telling you. The noise was scary, but Big Ben is great and he's a winner. He's a winner. I'm telling you. He is a take two Super Bowls and you look at that play, that defensive play he made on the running back, right?","He's a big winner. So say a lot of Big Ben. So Pennsylvania provided steel to the entire world. That's not true anymore. Now, you have China dumping steel all over the place. They're dumping everything they can dump not just steel, folks. And I don't blame China. They can get away with it. I blame our people and our leaders for being so incompetent and so stupid to allow a thing like this to happen.","So politicians allowed all of these jobs essentially to be shipped overseas. We're really like it -- it's really like it -- if you look and I'm driving in from the airport and you look at the empty buildings and the empty factories, and places that held unbelievable people including yourselves in many cases and your relatives, and they're gone.","It's just looking not so good. We're going to straighten it out, folks. We're going to straighten it out. Now, as Stephen told you, Cruz and Kasich he could -- by the way, how about Cruz. Is it lying Ted, you're right. Lying Ted, he's a liar. How about this, he is some liar.","He's a professional liar. You know, I say it. I'm doing great with Evangelicals, but lying Ted comes in and he holds the Bible up and he holds it high, right? He holds it high and then he lies, he lies, but he puts it down and he lies. So here's the story. He loves TPP Trans-Pacific Partnership. NAFTA.","NAFTA had a huge impact, at negative impact on this area, and all over the country. But NAFTA, you look at New England, what happens in New England? You look at upstate New York, where I just won and I won it because they know that I'm bringing back the jobs. I'll be bringing back the jobs. Mexico, China, Japan, Vietnam, India.","Any country you name, I guarantee you can throw up any name. They're taking advantage of not necessarily our stupid politicians. In some cases, stupid and in some cases, they do what they have to do in order to get campaign contributions. I'm not doing that, folks. I'm putting up my own money. I'm not doing it. When you look at what's going on with the super PACs and you look at what's going on with campaign contributions to these people.","I can tell you that a friend of mine came up to me two weeks ago. And he said, why would they do a deal like this Donald? Are they so stupid? I said no they're not stupid, they're smart. They did a deal because they got massive campaign contributions for doing a deal that was bad for our country. All of that stuff is going to end, folks.","We're going to do great deals now. We're doing great here. I don't know. You know, I self-fund and I don't know if it's worth it. So, so far I'm in for like $40 million or $45 million. I mean, I don't care. Even if you're rich, that's a lot of money, right? Is 45, Jeffrey, $45 million, that's a lot of money.","I'll tell you this. I don't know that I get credit for it. I'll be honest. Guys are offering -- Jeb Bush raised $168 million, right, for his super PAC. I would have raised five times that and a lot of times I feel foolish. I feel foolish that I'm turning down millions of dollars. I have one member of my club in Florida very great club the Mar-a-Lago Club and he keeps coming up. He's a very rich guy.","Donald, I'd like to help your campaign. Would you take $10 million? Now you have to understand, all my life, I put money, I've taken money. You know, that's what I do, I'm a business guy. I take, I take, I take. And every time I see him, he doesn't even understand it. I say, I really can't do that. I'm sorry.","I'm self-funding. He goes, no, no, that's okay. He doesn't even understand what I'm saying because he can't believe it because he just gives money and he's a good guy and a generous guy, rich guy. So then, I come by to see him a month later. Donald seriously, I'd like to give you $10 million. I say, no I can't do that.","I'm not -- self-funding and, you know, for me that's very hard to do. So he's done it now four times and I just keep turning him down. And I say to myself, I wonder if people appreciate it because I don't know. I don't. I don't know. They may, they may not. They may, they not, but you know.","So when I turn -- and he's one. I have many people. I have many, many people like that, and you know, I say, all my life I take. There's nothing wrong, we're business people, right? Who's a business person here, raise your hand, right. We take. Now taking is good. We have employees. We take care of their healthcare and their education.","A lot of good things, but I take and I take and I keep taking, and I become richer and richer and richer. But now, I'm going to take for you. I'm going to take for the country because our country needs help. Our country needs help. We're being stripped of our money. We're being stripped of our jobs. We have people that don't know what they're doing, and in some cases, they don't care.","So we are going to change things around, and we're going to change them around big league. Look at these people over there. I love you, folks. Look at that. Unbelievable. And I hope the people that are pouring in are not angry at me they'll go back. And they'll say, you know, Trump was really good, but we only got to see the last nine minutes of his speech.","But that's OK. We should keep going, right? the hell with them, right? So those are the numbers and those are the stats for this area. Those are the stats for Pennsylvania where -- a place I love, a place that I'm very close to, as you know. It's where I learned how to play golf. Cobbs Creek, does anyone know where Cobbs Creek is in Philadelphia?","A public course in Philadelphia. I used to play from the Wharton School I go to Cobbs Creek, and let me tell you, you met people at Cobbs Creek that were re -- actually very, very sophisticated hustlers and if you could survive on Cobbs Creek, you could practically survive anywhere. So we love Philadelphia.","Let me tell you, folks. We love it. We love -- I learned, I learned a lot. I learned a lot in Pennsylvania. All right. So I left Indiana and they have a company in Indiana called Carrier in Indianapolis. And I thought -- and I could use a hundred different companies and tell the story, but I think it's a terrible story.","They've been there for many years. They had 1,400 employees, great people, in fact, a number of the employees were at the speech the other day. And I said, what do you think? And we talked to them and I talked to them afterwards. They're like great people. They were there, one was there for 18 years, one was there for almost 30, and you probably saw it on television where some semi mid-level guy was rough, and he said we're closing, we're moving to Mexico.","That Carrier and I buy a lot of air conditioners from Carrier. I'm not buying them anymore folks, just say you understand. So I've been watching politicians now for five years talking about keeping the companies in our country and they've done nothing. They haven't done a damn thing. And they can talk about free trade and I'm a free trader.","But you can only have free trade if you have smart leaders and smart negotiators and we don't. We have leaders that are dumb as rocks. They don't know what the hell is happening to our country. And when you ride by these buildings in Harrisburg, when you ride by the buildings in Albany, and in Rochester, and Syracuse, New York, this is why I got the big vote because they understand that I get it, and they don't get it. They don't. Our politicians don't get it. So here's the story, folks.","Here's what we do. If we have crooked Hillary. Well, I mean, is there anybody more crooked than this woman. No. Is there anybody? You know, Bernie Sanders, who in all fairness and I have to tell you, in all fairness, he said she has bad judgment. All right? She does. He's been tough on her.","In fact, I'd like him to keep going because the longer he goes, the more I'm going to like it. What he's saying about her, he said a couple of the things, he said she suffers from bad judgment. And she said, now I don't know. I think she's qualified, I guess, but that doesn't mean she's good. I mean, I actually like -- he said she's not qualified to be president.","Now, what he meant is because her judgment is so bad. So Bernie Sanders, not me, said she's not qualified. So now, I'm going to say she's not qualified, OK? She has really, really -- you look at her judgment. I've been against the war in Iraq. The war in Iraq is dev -- has been devastating.","We've spent $2 trillion, we probably have spent in the Middle East, $4 trillion, and we have roads with potholes in the middle of the highways. We have airports that are obsolete. We have the worst transportation system and train system. In China, they have trains that go 250 miles an hour. Over here, if the train goes more than 60 it's like collision territory.","And we see it all the time. We've got to start rebuilding this country. We've got to rebuild our country. Now, we shouldn't have been in Iraq. It was a horrible decision. The way Obama got us out of Iraq was a disaster. He said a specific date. And when I heard him say that, I said, he has to be -- no he can't mean that.","I said ah, it's camouflage. He doesn't really mean that, but he did mean it. That was today. The enemy sat back. They said they can't believe it. They said why should we get killed. Believe me, they don't want to be killed. They went back. We left and boom. We should have, we should have been out. We should have never ever gone in. We totally destabilized the Middle East.","And I've been saying that for years. But we went in. Mistake. The way we got out was a mistake because we got out, we didn't leave the troops. We should've left some troops. And now what's happened? ISIS. We also, by the way, put terrible people in charge of Iraq. And that's really a primary reason, Jeffrey, why ISIS was formed because they couldn't get, they couldn't get together because they were not inclusive.","And so ISIS formed. Now, we have another problem. And then you have all of the mistakes that Hillary made as secretary of state. A total disaster. Not even talking about Benghazi, I mean, just big horrible mistakes. So we have a mess. So what we have to do -- All right, get him out.","Good. Aww, Look at those police. Do we love our police by the way? Do we love our police? So it's right. You know and I say, by the way, our Trump rallies fun? Are these fun? Do you know that if like lying Ted Cruz came to Harrisburg, if he had 250 people in a conference room, I'd be surprised if he could get that many people.","I would actually be surprised. And here we have 10,000 people. I would be so surprised if he could even get that. OK. You're ready? And honestly, Cruz and Kasich have no path to victory. It's over. It's over. Now, Cruz. Cruz said Kasich should get out because he has no path. I mean, not even close. He's won one out of 38. Well, Cruz is only one what 10 or 11. I've won 22 or 23. Millions of votes ahead.","I think they both should get out. What are they doing? What are they doing? All right. So we shouldn't have been in, we were in. We have to finish the job. We have to -- we should never ever have been. You know, Saddam Hussein was a bad guy, right? If you look at Gaddafi, he was a bad guy but they had one thing in common.","And one thing that they were really, really good at. Number one they were not politically correct. We all agree? They were great at killing terrorists. They were great. We are not good at killing terrorists. We catch somebody who's a terrorist and it's 25 years before the trial starts. They killed terrorists and we would have been better off if our presidents went to the beach and never even heard the words Middle East.","That's how bad, but now it's a mess. Now, we have people that are cutting off heads and drowning people in steel cages. We're going to knock the hell out of ISIS. We're going to knock the hell. We are going to build a military that's so big and so strong and so powerful. And by the way, it's the cheapest thing we can do. So big so strong, so powerful that nobody is going to mess with us again.","Nobody. Nobody. Just remember, our military is being decimated. It's being decimated by cuts and every other thing. And our soldiers are great people. These are great people, the military people, but the politicians are all talk, no action, not treating them right. So we're going to knock the hell out of ISIS.","We're going to build up our military. We're going to make it powerful and strong again. And by the way, we are going to take care of our vets. Our vets. So let's go back. So we have Carrier and when I first came in, when and I first, June 16th. Who knew this was going to happen? Who knew this was going to happen?","Bill O'Reilly last night on Fox during his show, I mean, I was really greatly complimented. He said that what's happened with Donald Trump is the single biggest political event that he's witnessed and seen during his lifetime. I said, wow, that was pretty good. Even Jeffrey wouldn't say that. I mean, it was a big statement.","And you know I like Bill, but it was a big statement. It was an important statement. And what he meant by that is this is all a movement. No matter where we go. We go to Alabama we have 35,000 people. We had 25,000 in Orlando, 25,000 people all over. I mean, it's routine. If I say, if they say to me like, sir you have 10,000 people tonight.","I said that's a small crowd. What's wrong? What's wrong? We have tremendous crowds. We have by far the biggest crowds far bigger than Bernie, by the way, far bigger and Bernie is second. But now, Bernie is over I guess, right? It's over. It's over for Bernie. And really, I want to run against Hillary, I don't want to run against Bernie.","I really want to run against, I want to run against crooked Hillary Clinton. We're going to beat her so badly. I want to run against crooked Hillary. So here's what happens. So Carrier announced they're leaving Indianapolis and this is so easy. You know, I have the best business leaders in the world.","You saw the other night when I won New York, Carl Icahn, the greatest business people endorsed me, and we'll use them to make our trade deals. These are the big -- they don't want money that -- they wanted to do it. To them, it's a chess game and they love the country. But here's what happens. So Carrier announced 1,400 people, you get out, you're fired.","Like The Apprentice, you're fired. And they say, we're moving to Mexico. We're moving. Just like that. We're moving to Mexico. Our government doesn't do anything about it. And the politicians won't because they're taken care of by special interests, so they won't do anything about it. So all right, get him out.","Look how fast our police work. Are they the greatest? Look at that. Oh, these police, these police. We love our police. Thank you. Well, they were, they were running him out. That's beautiful. I loved this. So what happens is our politicians do absolutely nothing, absolutely nothing.","Carrier leaves and here's what I do. Now my wife is constantly saying darling be more presidential. I just don't know that I wanted to do it quite yet Jeffrey because we have a job to do. I've got two leftovers. I have to finish that. OK? We have to. We have to. And we're doing so good. And we have to be tough for a little while.","And I'll be at some point, I'm going to be so presidential that you people will be so bored, and I'll come back as a presidential person. And instead of 10,000 people, I'll have about 150 people and they'll say, but boy, he really looks presidential. But you know, we have a very sad topic because we're talking about what's happened to our country.","But we have a very happy topic also because you know, believe it or not, let's make America great again, make America great again. America first. All of these statements are positive statements. And the one I love is the one that's on all those beautiful hats, some red, some white is a man, some hunters caps.","Right? Right? Make America great again. That's a positive message. That's a positive message. So I want to do Carrier myself because I love it. You know, I love working. I'm not a vacation guy, right? Like Obama, he plays golf in Hawaii. He flies on a 747 spewing, spewing flies. Then he talks about the carbon footprint.","He goes to Hawaii in his 747 for vacation. And then, he comes back has a news conference on the carbon footprint. I mean, give me a break, folk, OK? So here's the story. I want to do Carrier. I know it's not presidential. I don't want to give it to Carl Icahn. I don't want to give it to these great business guys.","They're the richest guys, the best negotiators. I don't want to give it to them. I love doing this stuff. I call up the presidents of Carrier, highly, highly unpresidential, right? The president of the United States calling up an air conditioning company. But that air conditioning company, abandoned 1,400 jobs in our country and because our politicians are so stupid they allow it to happen, and they've been talking about stopping it for five years.","It's called corporate inversions. They don't even know what the words mean. So they've been talking about it for years. So here's what we do. I get him on the phone and I say good luck, sir, good luck with your new plant in Mexico. I hope you do fantastically, but as you know, you've terminated 1,400 people.","And as you know, I don't like that. And as you also know, we now have a very strong border. We have a border where the Border Patrol men and women, who by the way, last week endorsed me, 16,000 and these are great people that aren't allowed to do their job. If they let them do their job, you still need the wall to stop the drugs and other things.","But these are great people, they're not allowed to do the job. By the way, Sheriff Joe Arpaio also from Arizona. Enjoy. So you know who the good one on the border. So tell him, I say here's the story. Enjoy your new plant. Enjoy the very, very hot weather because here's a story, when you sell a unit, you do an air conditioning unit, every single unit that crosses our now very strong border.","In other words, you have to go through a certain way. You don't just have it come across like we have now. Every year, they're coming across our border. It's going to be taxed at 35% per year, OK? Now, believe me, I'm really good at this stuff. I'm so good at this stuff, I built such a great company. So here's the story.","If you say it before they move, they're not going to move. They're not going to move. In other words, you tell them before they move. Don't tell them later. You go up to them and say listen, you're moving I'm so what can we do we, want to keep you. No, we're moving. Oh, you're an arrogant guy, huh.","Guess what? You move, but if you move and you make product in Mexico or wherever or wherever, every unit coming across the border is going to be taxed at 35%. Now, here's what's going to happen. If they have that conversation with lying Ted Cruz or with Kasich, who nobody even knows who the hell he is. If they have the conversation with these guys, 100% they move and that's the end of it. If they have the conversation with Hillary, it's guess what?","It's going to be even worse. You won't even pick up the phone because what's going to happen is their lobbyists and their special interests will call the politicians, and they'll say you can't do that. This group gave you $1 million when you ran and they're going to give you $1 million the next time you run.","You can't do that -- let me tell you. In other words, they got it. Now they tell me nothing. Nothing. I won't take their call. I couldn't care less. So here's what's going to happen. And I like talking to him before they move. I would talk to him before they move because if it's before they move, they're going to say the following.","They'll call me back within 24 hours and they will say, Mr. President sir, we've decided not to move the United States, OK? If they've already moved. They're going to try and undo that deal so fast. I guarantee you. And here's what happens. Maybe they can't come back. Maybe it's too late, but our country is going to make a lot of money, folks.","We're going to make a lot of money and we need the money. We have massive deficits. We owe $19 trillion, and that's the way it is. Now on a larger basis, Ford, Ford Motor Company built to -- get him out. Get him out. Get him. Get him. Here come the police. Look at them move, I love these police here.","I'd get them out, please. Get them out. Take them out of here. See they're right in front of the cameras. Right in front of the cameras where they want to be. You know, we had a couple of protesters. We had some protesters in New York before I made a speech. And the media went to him. And by the way, see the media?","That is the most dishonest group of human beings. They are the worst. They are the most dishonest people. And that's what I like about protesters, they go around and they show the crowd. So I like it. So I like my protesters. But in New York they had protesters and they went up. The media went up and they say why are you here?","Do you not like Donald Trump? No, I like him. He's a great guy. Oh, and they have signs manufactured by a beautiful printing press, not made in the basement like it's supposed to be. They go up to another one. Why are you here? And the guy goes, I don't know. I don't know. In other words, it's all a phony deal, folks.","It's a phony disgusting deal. We had one, two days I've very few of -- I'll tell you what. Have you heard about protesters? They're giving up with us because we like it. We like it. We have fun with it, right? We have fun with it. But it's a phony deal. Many of these people, I would say, most of these people are told to come here and try and disrupt and agitate.","They're bad people but we are so cool, and we take care of ourselves. And remember what I said, the safest place on earth is a Trump rally. Believe me. Believe me. So Carrier won't be leaving. Ford is building a $2.5 billion plant in Mexico. I've been talking about it for two years, it's been my big baby.","And $2.5 billion you know what that is? And they're going to make their cars and trucks and parts, and they're going to pour them right into the United States. We get nothing. Now, the other day I'm reading in the Wall Street Journal that they've decided to do more. They're going to do more. It's going to be bigger.","They're going to make it bigger. Why do we get out of it? We get nothing. Look at this area? Look at the state of Pennsylvania that I love. They're ripping our businesses out. They're taking our heart out. They're taking our jobs out, and we're not going to let them get away with it anymore. And the system is rigged.","The voting is rigged. The whole deal is crooked. 100% almost as crooked as crooked Hillary. It's a crooked deal. And that's why you have a case where I go in and win with a vote, and these guys go and they buy delegates. They buy them dinners, they send them to hotels. The whole thing is a sham. And by the way, I don't know if even my enemies in the media agree with me. And lots of changes are being made.","With all of that being said, we're winning by a lot. We're kicking ass. I'll tell you. Believe me. So we're going to stop. And when I came down that escalator with Melania, I had two things in mind, trade because we make the worst trade deals, probably at any time, anywhere. What China has done to our country.","We have a trade deficit with China of $505 billion a year. Then, you have these stupid people that write magazines, they call them the elite. Oh, really they're elite? Do you think they have a better plan than I do? These elite people, these are elite. They call them elite. That means that we're not elite.","That means that I'm not elite, I don't know. I don't think anybody has better whatever. Do they have better than what we -- you know, I built a company and I filed all the papers at Federal election. I borrowed $1 million and I built it in. I mean, here's the stuff, my father gave me $250,000. I wish my father gave me -- my father was tough and he was from Brooklyn, and he built houses in Brooklyn.","And I borrowed $1 million and I built it into a company that's worth more than $10 billion with the greatest assets, with the greatest assets, some of the greatest assets in the world. Great cash flow, very little debt. And I say it not to brag at all. I say it because that's the kind of thinking we need in this country, at least for a while, until we straighten it out.","Because we're sitting right now on a bubble, on a big fat ugly bubble. And if it explodes, it's going to be ugly. You think your businesses are doing lousy now? If that bubble explodes and it's going to happen unless I'm elected. We are going to do things that are going to be so good. And that's what I do. We've got to get down the debt.","We're going to do so many things. But the big thing we have to do is we have to take care of our trade. We can't allow China and to have us have a trade deficit of $505 billion. Japan, massive trade deficit. They sell cars. They give us cars, millions of cars come in. We give them practically nothing. The balance is up here.","We send them beef, OK? Would you rather have a piece of beef or a car? It's so imbalanced. We have all the cards. Here's the good news. We have the cards. We have the piggy bank. We're not going to have the pity -- we're not going to have it for long because the money is being drained out of our system by other countries and because we have political hacks negotiating deals for us. So that's going to all end.","Mexico has a trade. We have a trade deficit with Mexico, $58 billion and that doesn't include the drugs that pour across the border, which probably, who else knows, it's probably more. We are going to do things and when I get up at the debates -- and remember this, I've been number one at every single debate.","I've been center stage. We've been center stage in every debate said all these politicians. I was driving them crazy and then the debates. If you look at Drudge who's an amazing guy, if you look at all the polls, the debate polls. Right after the debates, every single debate, every single poll, I won which is nice.","I didn't know I could debate. I never did that. That's all politicians do. They're all talk and no action. And our country's going to hell and we're going to stop it, and we're going to stop it fast, OK? So when we have a trade deficit with China, $505 billion, billion not million, billion. That means, you know, not so good.","Not so good, right? So what happens is this, we have these people, there in magazines and they write. They're terrible, they're terrible people. They don't know. Actually, they might not even be. Maybe, you know, they call themselves I told you, the elite. And they write and they said oh, there's going to be trade war.","There's no trade war. When somebody is taking in $505 billion more than we are, let's have a trade. I mean, it's OK. Who cares. We can't keep going like this. And here's the story. We will get along better with China than we get along right now. And we'll equalize things and they won't be doing what they're doing right now.","Right now, they have perpetrated the single greatest theft in the history of the world. They have robbed us blind, and so have other nations. China's been the greatest abuser, but so have other nations. So we're going to stop it and we are going to bring our jobs back, and we're going to keep our jobs here.","And there's going to be a time in the very near future when Apple Computer. And don't worry about him. Don't worry about him. Leave him alone. He's got no voice. I can't hear the guy. He's got no voice. Leave him alone. You know, the biggest -- the cutest thing. My people. They see somebody who's going, oh, hey, oh, nobody can hear him.","Then my people go, there he is. There he is. They they make a -- don't worry about it. Let him be -- you can't even hear the guy. Oh, but the police are there already. Look at that guy, policeman raise your hand, I love you. Look at these guys. Look at these guys. There's like a rock concert, right? A rock concert.","Beautiful, look at you, Oh. So hey, ready. Ready? So we can't let this go on. We're not going to let it go on. We're not going to let it go. And now during one of the debates, a couple of the people that I was debating came up to me, and they said Donald, you know you can't build a wall. I said, why not?","I didn't even know what he was talking to. I said China built the Great Wall of China two thousand years ago. Thirteen thousand miles long. We can't build a wall that's 1,000. Tell me about it because I wanted to -- and we have Caterpillar tractors. They didn't. They didn't quite have them yet. So they came up and they said, we can't build a wall.","Now, it's 2,000 miles but we need 1,000 miles of wall. Nothing. It's nothing. I will have the most gorgeous wall you've ever seen. Someday, when I'm gone they'll name it the Trump wall. So I'm going to make it so big, so strong, and so beautiful. And believe me, walls work, walls work. All you have to do, just ask Israel do walls work?","Walls work. So here's the story, the second thing they said is you really can't get Mexico. And I love Mexico and I love the Hispanics and I'm going to get so many jobs for the Hispanics, for the African-Americans, for people that can't get jobs now. And we're going to do great. In Nevada, where I won the state.","They did a poll. People leaving, Hispanics. I was number one in the poll. An easy number one. And the news reported it, they said we don't understand Donald Trump is number one with Hispanics. I love the Hispanics. I can't help it that the leaders in Mexico and every other country. Every other country that do business with us, we're like the dumb bully that keeps getting knocked down.","You get them out. Good. Get this guy out. Get them out of here. So then, I said Mexico's going to pay for the wall. These same two guys walk up to me, they say Mexico's never going to pay for the wall. I said, why not? If we're having a trade deficit of $58 billion a year and there was going to cost $10 billion, that's one of the easiest negotiations I've seen.","And then, they had the former President Vincente Fox, the former president of Mexico. He's being interviewed by one of the big cable networks and he said, we won't pay for the -- and then, he used the F-bomb. And I said, oh, is he in trouble tomorrow, it's going to be headlines, he used the F-bomb on live television, right?","He used the F-bomb. And I said, can you imagine -- hey, by the way, folks, if I ever use the F-bomb, I think, I'd get the electric chair. Do you agree, OK? This guy nobody talks, but here's what he said, we're not going to pay for the you know what wall on live television, OK? Oh, and the anger was so unbelieve -- and you know why he was angry?","How dare somebody tell them to do something because for years they and every other country has been ripping us off, and they're not used to somebody saying listen, we're building a wall, and you're paying for it because you're sending a lot of people over, and you're giving us a lot of headaches, and you're going to pay for that wall.","And that wall is peanuts compared to the kind of money you make. Don't even -- Fox, Fox. Don't even waste your breath. I love what you say. Don't even way -- it's so easy. That's almost as easy as telling Carrier, you better stay or you got problems, OK? You better stay or you got problems.","Remember that five years have been thinking about, what can we do? Let's give them incentive. Let's give them financing. Listen, no, no. Just tell them, you leave. You make products, great. Come in. Tax. You don't have to do anything it's so simple. But they don't want to do it. They don't want to do it because they're stupid.","I mean, because they're really stupid or corrupt in a sense, they're corrupt. So here's the story. So Fox said, no way. There is no way. Now, I actually liked it because two years ago, he used to say there is no way we will allow a wall to be built. He obviously understands that's going to happen. Now he doesn't talk about that.","Now he just says, they're not going to pay for it. Believe me. Mexico's paying for the wall, OK? That's it. That's it. You know, I won the state of New Hampshire and it's a beautiful state, a beautiful area. And it was my first victory. Now, I've won 23, 24 states. I'm getting spoiled. I got to win Pennsylvania.","That's what I got to win, OK? Pennsylvania. I mean, Cruz doesn't even know where Harrisburg is. He doesn't -- this guy, I mean, he went to New York and they threw him around like a rag doll. I love -- when I watch him come in second to Kasich. I just love it. I love it, it's so -- it's so cool. Oh, look we're all filled up back there.","I hope you people in the back. Are you OK? I mean, I feel badly for the people. They got to hear about 2% of what we've been talking about all night. But look, look. So we are going to get all of these things done. You've got to get out and vote. You've really got to put a big -- you've got to get your friends, you've got to get everybody, Tuesday.","You know a few days. It's amazing how time flies. It feels like I won New York. Yesterday it's already like three days. And I -- I tell you what it really does. They really know me well in New York. This is serious. They know me well. What really is nice is the people that really know me. I mean, I'm doing buildings here.","I'm doing buildings. I employ lots of people. The people that know the person when they vote for the person and you get even 10 points higher than the polls were saying you weren't going to get. That means they love you. I get 61. People were saying, oh, remember they were all saying the great Jeffrey Lord can tell you this, but they were all saying, Jeffrey, if he can break 50 it'll be a great victory, is that right?","But breaking 60, nobody even -- I got 61 more than 61. So here's the story. Here's the story. And almost all of the delegates, here's the story. You got to go out to vote on Tuesday because we have a movement going on. We have a movement that's been on the cover of Time Magazine many times over the last number of months.","We have a movement that everybody in the world is talking about. We have a movement of millions and millions of people. You know, the Republican Party, not known necessarily as the hottest thing in the world is now one of the hottest things in the world. It's one of the hottest parties in the world. You know, the Republican Party, four years ago Mitt Romney ran and he choked, he choked.","You know what happened? No, he choked. He should have won that election. That election was easier than this election. But don't worry, I'll win. But he should have won that election and John McCain ran, and it was a tough one because of the economy. But John ran and I backed him and he lost.","Mitt Romney ran and I backed him, and he lost. And then I said to my wife, you know what this time, I'm going to do it myself. We're going to get it done. We're going to get it. So, so important. You're going to remember this night. You're going to remember this night. Beautiful evening. Very nice. Other than, I don't like -- other than, I don't like the scenery of empty factories all over the place, OK? But you're going to remember this beautiful evening.","More importantly on Tuesday, you're going to remember going to the voters' booth. You're going to cast the most important vote of your life. You're going to vote for Trump. And you know, did you ever hear these politicians? I mean, you know they're just politicians when they say please, please go out and vote.","Even if you're not voting for me, vote for my opponent. It's so important as an American exercise, for you to go out and vote. I'm not saying that. If you're going to vote for anybody else other than me, do not go out to vote, OK? Don't go out to vote. Don't, right? I don't want anybody -- but I don't think there's too many people in this room that are -- Is there anybody in the room that's going to vote for other than Trump?","Who's going to vote for Trump? Ah, we love you. But here's the story. Here's the story. So important, we have this movement. It's an incredible movement. I told you about Bill O'Reilly, what he said. I told you about Time Magazine. I told you about everything. It's the hottest thing happening.","We have, we're up 70% from four years ago. The Democrats are down to 35%. In other words, Hillary and Bernie are down 35% from four years ago. We're up 70 -- more than 70% in votes. All right, right? Now, here's the story. And by the way, this is the hottest event all over the world they're talking about.","What's happened to the Republican Party. And then, you have these people the bosses of the party, the establishment, they don't like Trump. And you know, they don't like me because they can't take care of me because I'm not taking their money. I don't want to. I just, I just want -- I want to bring back our jobs.","I want to take care of our military. I want to do what's right for our country. We've got to save our country. So here's the story. Great night. You're going to go on Tuesday, you're going to vote. You're going to get all your friends. Everybody that can vote. Don't forget the other side votes, and who the hell knows if they're even allowed to vote.","You're going to get every single person you know that can vote. Go out to vote. You're going to say it was the most important vote you've ever cast. You're going to look back. You're going to look back. In four years, in 20 years, in 30 years, you're going to say that was the greatest vote that I ever cast because when Donald Trump became president of the United States, our country started winning again.","We don't win anymore. We don't win anymore. We don't win anymore. We don't win with our military. We can't beat ISIS. We don't win with our vets. We don't take care of them. We don't win with education. Common Core is a disaster, which by the way, we're ending, and we're bringing educational back. We don't win with healthcare.","And as you know, Obamacare our premiums are going 25%, 35%, 45% up. We're not going -- it's ended, it's over. We're going to have great healthcare. We don't win at the borders. We don't win a trade. Here's what's going to happen, folks. And you better get used to it. We're going to start winning again. We're going to win with our military.","We're going to knock the hell out of ISIS. We're going to win with our vets. We're going to take care of our vets. We're going to win on the border. We're going to have a real border. We're going to have a great border. We're going to have a border where people come into our country, but they can only come into our country legally.","We're going to win with education. We're getting rid of Common Core. We're bringing our education locally. We're going to win with healthcare. We're going to win with trade. We're going to make the greatest trade deals this country has ever made. And we're going to bring jobs back to Harrisburg and to Pennsylvania, and to every other state in the union.","We're going to have Apple products made in the United States instead of Made in China. Believe me. We're going to stop the manipulation of currency. We're going to stop the devaluation of currency. We're going to have products like from Apple starting to be made in our great country again. So we're going to start winning again.","We're going to start as of Tuesday. We're going to win so much, folks. Some of you won't be able to take it because you're not used to it. We're going to win at every level. And I have fun with this. And I have to say it. Should I say it? We are going to win, win, win. We're going to win so much. That you're going to say Mr. President, please, please, sir.","We don't want to win so much it's driving us crazy. And I'm going to say I'm sorry, we're going to keep winning. We're going to win at every single level and we're going to make America great again. I love you Harrisburg. I love you Pennsylvania."],"text":" -- are you -- So I am supposed to wait a half an hour because there are thousands of people outside trying to get in but I can't do that to you. So we're going to come on right now. So I've never done that before, you know, I've never done that before. I've never introduced myself. But they didn't quite say it right the first time. So, anyway, now we have thousands of people outside thousands and, they're going to pour in the filling up the floor. They're filling up and I just said you know what, they're coming through the mags and I said you know what, let's start a little bit earlier, right? The hell with this. Well, I want to tell you, we have a lot of friends here tonight. And I think, we have our two favorite congressmen and we're here -- before we introduce them I'd -- get them out of here. Get them out. Get them out. Go ahead, go home to mom. Go home to mommy. These people, I tell you, you can't get rid of them. Oh, that's okay. That's okay. Be gentle. You know, I have to say that. Be gentle, be nice and easy. Got him? Got him? Are you OK? Good. Our people take care of our people, right? So -- good. Thank you. So we have a lot of friends here tonight and I'm going to introduce just a few. First of all, a man who takes on a nightly basis and he loves this area. He lives right around here. And you know, who knows Pennsylvania better than Donald Trump. I went to school here. I went to school here. But -- and it's a great state, but a man who is constantly defending me and he really does a good job. And whenever he's in a little doubt, he says he reminds me of Ronald Reagan. That's OK, right? Jeffrey Lord, he works with CNN. Jeffrey, a great guy. He's become very famous. I will tell you, and he's a great defender. There's nobody better. Also, we have two congressmen here who have been unbelievable. They've been here right from the beginning. I have absolutely no idea where they are, but they're here someplace. Congressman Tom Marino, you know, where's Tom? Where is our Tom? And Lou Barletta. Congressman Barletta. Lou. Lou. So they're here. They've been amazing. I mean, they've really been amazing. So folks, I hate to do this. We're going to depress you for a little while and then, we're going to have so much fun because here's the bottom line. We're going to make it better. We're going to bring our jobs back. We're going to strengthen our military. We're going to build a wall. We're going to build a wall. We're going to build a wall. Oh we're going to build it. We're going to build it and you know who is going to pay for it. I don't hear you. 100%, OK? 100%. So I told my folks, and by the way, how good was Stephen? Is Stephen good, right? And he tells the truth. He's a straight arrow and he tells the truth. So Pennsylvania, I love you too. That was a guy, but I love him anyway, OK? Pennsylvania has taken -- I know I just asked a group. So I said give me some talk on Harrisburg and on Pennsylvania, and I want to just see what it is. Pennsylvania is taking harder hits on trade than just about anywhere else in the United States. Not good. Not good. The state of Pennsylvania has lost more than 35% of its manufacturing jobs since 2001. Not good. What are you guys doing? How do you let this happen, guys? How do you let this happen? Don't worry. Doesn't matter. We're bringing it back. They're all going to come back better than left. Better than left. And that includes steel and that includes coal, clean coal, but that includes a lot of things that a lot of industries that are being decimated. Harrisburg lost nearly 40% of its manufacturing jobs since 2001. That's amazing. You know, the number's so high. And I'll tell you what, in 2001, and Jeffrey knows this, that's when China. Oh that's when China went into the World Trade Organization. Guess what? Now, in all fairness to China, we're not only talking about China. We're talking about a lot of different places. Mexico has been taking your companies like, like it's candy from a baby, right? Median in -- and this is so terrible. Median household income in Harrisburg, in the Harrisburg region of Pennsylvania, has declined $7000 since the year 2000. Now look, countrywide just so you understand, people, hardworking unbelievable people, their income and their wages have gone down over the last 14, 15 years. Their real wages have gone down. They work longer. They work harder. Some of them are working double jobs. Some of them are forced to go part-time jobs because of Obamacare. It's a disaster. They're forced to do it. No good, folks. No good, going to end. Where -- and by the way, just in case, I don't want to hold it too long. We will repeal and replace Obamacare. Just, you know. Food stamps as you know, are up almost 300% in this area. Now, Pennsylvania used to provide and boy do I know this. Hey, how good is Ben? Big Ben. Do we love Big Ben? Big Ben. I'm just saying because he's a friend of mine. I played golf with him a couple of times. He actually hit a drive and it went right. It hit a tree. It was a massive tree. The ball hit the tree so hard. I said Ben, that tree will be dead within two years. I'm telling you. The noise was scary, but Big Ben is great and he's a winner. He's a winner. I'm telling you. He is a take two Super Bowls and you look at that play, that defensive play he made on the running back, right? He's a big winner. So say a lot of Big Ben. So Pennsylvania provided steel to the entire world. That's not true anymore. Now, you have China dumping steel all over the place. They're dumping everything they can dump not just steel, folks. And I don't blame China. They can get away with it. I blame our people and our leaders for being so incompetent and so stupid to allow a thing like this to happen. So politicians allowed all of these jobs essentially to be shipped overseas. We're really like it -- it's really like it -- if you look and I'm driving in from the airport and you look at the empty buildings and the empty factories, and places that held unbelievable people including yourselves in many cases and your relatives, and they're gone. It's just looking not so good. We're going to straighten it out, folks. We're going to straighten it out. Now, as Stephen told you, Cruz and Kasich he could -- by the way, how about Cruz. Is it lying Ted, you're right. Lying Ted, he's a liar. How about this, he is some liar. He's a professional liar. You know, I say it. I'm doing great with Evangelicals, but lying Ted comes in and he holds the Bible up and he holds it high, right? He holds it high and then he lies, he lies, but he puts it down and he lies. So here's the story. He loves TPP Trans-Pacific Partnership. NAFTA. NAFTA had a huge impact, at negative impact on this area, and all over the country. But NAFTA, you look at New England, what happens in New England? You look at upstate New York, where I just won and I won it because they know that I'm bringing back the jobs. I'll be bringing back the jobs. Mexico, China, Japan, Vietnam, India. Any country you name, I guarantee you can throw up any name. They're taking advantage of not necessarily our stupid politicians. In some cases, stupid and in some cases, they do what they have to do in order to get campaign contributions. I'm not doing that, folks. I'm putting up my own money. I'm not doing it. When you look at what's going on with the super PACs and you look at what's going on with campaign contributions to these people. I can tell you that a friend of mine came up to me two weeks ago. And he said, why would they do a deal like this Donald? Are they so stupid? I said no they're not stupid, they're smart. They did a deal because they got massive campaign contributions for doing a deal that was bad for our country. All of that stuff is going to end, folks. We're going to do great deals now. We're doing great here. I don't know. You know, I self-fund and I don't know if it's worth it. So, so far I'm in for like $40 million or $45 million. I mean, I don't care. Even if you're rich, that's a lot of money, right? Is 45, Jeffrey, $45 million, that's a lot of money. I'll tell you this. I don't know that I get credit for it. I'll be honest. Guys are offering -- Jeb Bush raised $168 million, right, for his super PAC. I would have raised five times that and a lot of times I feel foolish. I feel foolish that I'm turning down millions of dollars. I have one member of my club in Florida very great club the Mar-a-Lago Club and he keeps coming up. He's a very rich guy. Donald, I'd like to help your campaign. Would you take $10 million? Now you have to understand, all my life, I put money, I've taken money. You know, that's what I do, I'm a business guy. I take, I take, I take. And every time I see him, he doesn't even understand it. I say, I really can't do that. I'm sorry. I'm self-funding. He goes, no, no, that's okay. He doesn't even understand what I'm saying because he can't believe it because he just gives money and he's a good guy and a generous guy, rich guy. So then, I come by to see him a month later. Donald seriously, I'd like to give you $10 million. I say, no I can't do that. I'm not -- self-funding and, you know, for me that's very hard to do. So he's done it now four times and I just keep turning him down. And I say to myself, I wonder if people appreciate it because I don't know. I don't. I don't know. They may, they may not. They may, they not, but you know. So when I turn -- and he's one. I have many people. I have many, many people like that, and you know, I say, all my life I take. There's nothing wrong, we're business people, right? Who's a business person here, raise your hand, right. We take. Now taking is good. We have employees. We take care of their healthcare and their education. A lot of good things, but I take and I take and I keep taking, and I become richer and richer and richer. But now, I'm going to take for you. I'm going to take for the country because our country needs help. Our country needs help. We're being stripped of our money. We're being stripped of our jobs. We have people that don't know what they're doing, and in some cases, they don't care. So we are going to change things around, and we're going to change them around big league. Look at these people over there. I love you, folks. Look at that. Unbelievable. And I hope the people that are pouring in are not angry at me they'll go back. And they'll say, you know, Trump was really good, but we only got to see the last nine minutes of his speech. But that's OK. We should keep going, right? the hell with them, right? So those are the numbers and those are the stats for this area. Those are the stats for Pennsylvania where -- a place I love, a place that I'm very close to, as you know. It's where I learned how to play golf. Cobbs Creek, does anyone know where Cobbs Creek is in Philadelphia? A public course in Philadelphia. I used to play from the Wharton School I go to Cobbs Creek, and let me tell you, you met people at Cobbs Creek that were re -- actually very, very sophisticated hustlers and if you could survive on Cobbs Creek, you could practically survive anywhere. So we love Philadelphia. Let me tell you, folks. We love it. We love -- I learned, I learned a lot. I learned a lot in Pennsylvania. All right. So I left Indiana and they have a company in Indiana called Carrier in Indianapolis. And I thought -- and I could use a hundred different companies and tell the story, but I think it's a terrible story. They've been there for many years. They had 1,400 employees, great people, in fact, a number of the employees were at the speech the other day. And I said, what do you think? And we talked to them and I talked to them afterwards. They're like great people. They were there, one was there for 18 years, one was there for almost 30, and you probably saw it on television where some semi mid-level guy was rough, and he said we're closing, we're moving to Mexico. That Carrier and I buy a lot of air conditioners from Carrier. I'm not buying them anymore folks, just say you understand. So I've been watching politicians now for five years talking about keeping the companies in our country and they've done nothing. They haven't done a damn thing. And they can talk about free trade and I'm a free trader. But you can only have free trade if you have smart leaders and smart negotiators and we don't. We have leaders that are dumb as rocks. They don't know what the hell is happening to our country. And when you ride by these buildings in Harrisburg, when you ride by the buildings in Albany, and in Rochester, and Syracuse, New York, this is why I got the big vote because they understand that I get it, and they don't get it. They don't. Our politicians don't get it. So here's the story, folks. Here's what we do. If we have crooked Hillary. Well, I mean, is there anybody more crooked than this woman. No. Is there anybody? You know, Bernie Sanders, who in all fairness and I have to tell you, in all fairness, he said she has bad judgment. All right? She does. He's been tough on her. In fact, I'd like him to keep going because the longer he goes, the more I'm going to like it. What he's saying about her, he said a couple of the things, he said she suffers from bad judgment. And she said, now I don't know. I think she's qualified, I guess, but that doesn't mean she's good. I mean, I actually like -- he said she's not qualified to be president. Now, what he meant is because her judgment is so bad. So Bernie Sanders, not me, said she's not qualified. So now, I'm going to say she's not qualified, OK? She has really, really -- you look at her judgment. I've been against the war in Iraq. The war in Iraq is dev -- has been devastating. We've spent $2 trillion, we probably have spent in the Middle East, $4 trillion, and we have roads with potholes in the middle of the highways. We have airports that are obsolete. We have the worst transportation system and train system. In China, they have trains that go 250 miles an hour. Over here, if the train goes more than 60 it's like collision territory. And we see it all the time. We've got to start rebuilding this country. We've got to rebuild our country. Now, we shouldn't have been in Iraq. It was a horrible decision. The way Obama got us out of Iraq was a disaster. He said a specific date. And when I heard him say that, I said, he has to be -- no he can't mean that. I said ah, it's camouflage. He doesn't really mean that, but he did mean it. That was today. The enemy sat back. They said they can't believe it. They said why should we get killed. Believe me, they don't want to be killed. They went back. We left and boom. We should have, we should have been out. We should have never ever gone in. We totally destabilized the Middle East. And I've been saying that for years. But we went in. Mistake. The way we got out was a mistake because we got out, we didn't leave the troops. We should've left some troops. And now what's happened? ISIS. We also, by the way, put terrible people in charge of Iraq. And that's really a primary reason, Jeffrey, why ISIS was formed because they couldn't get, they couldn't get together because they were not inclusive. And so ISIS formed. Now, we have another problem. And then you have all of the mistakes that Hillary made as secretary of state. A total disaster. Not even talking about Benghazi, I mean, just big horrible mistakes. So we have a mess. So what we have to do -- All right, get him out. Good. Aww, Look at those police. Do we love our police by the way? Do we love our police? So it's right. You know and I say, by the way, our Trump rallies fun? Are these fun? Do you know that if like lying Ted Cruz came to Harrisburg, if he had 250 people in a conference room, I'd be surprised if he could get that many people. I would actually be surprised. And here we have 10,000 people. I would be so surprised if he could even get that. OK. You're ready? And honestly, Cruz and Kasich have no path to victory. It's over. It's over. Now, Cruz. Cruz said Kasich should get out because he has no path. I mean, not even close. He's won one out of 38. Well, Cruz is only one what 10 or 11. I've won 22 or 23. Millions of votes ahead. I think they both should get out. What are they doing? What are they doing? All right. So we shouldn't have been in, we were in. We have to finish the job. We have to -- we should never ever have been. You know, Saddam Hussein was a bad guy, right? If you look at Gaddafi, he was a bad guy but they had one thing in common. And one thing that they were really, really good at. Number one they were not politically correct. We all agree? They were great at killing terrorists. They were great. We are not good at killing terrorists. We catch somebody who's a terrorist and it's 25 years before the trial starts. They killed terrorists and we would have been better off if our presidents went to the beach and never even heard the words Middle East. That's how bad, but now it's a mess. Now, we have people that are cutting off heads and drowning people in steel cages. We're going to knock the hell out of ISIS. We're going to knock the hell. We are going to build a military that's so big and so strong and so powerful. And by the way, it's the cheapest thing we can do. So big so strong, so powerful that nobody is going to mess with us again. Nobody. Nobody. Just remember, our military is being decimated. It's being decimated by cuts and every other thing. And our soldiers are great people. These are great people, the military people, but the politicians are all talk, no action, not treating them right. So we're going to knock the hell out of ISIS. We're going to build up our military. We're going to make it powerful and strong again. And by the way, we are going to take care of our vets. Our vets. So let's go back. So we have Carrier and when I first came in, when and I first, June 16th. Who knew this was going to happen? Who knew this was going to happen? Bill O'Reilly last night on Fox during his show, I mean, I was really greatly complimented. He said that what's happened with Donald Trump is the single biggest political event that he's witnessed and seen during his lifetime. I said, wow, that was pretty good. Even Jeffrey wouldn't say that. I mean, it was a big statement. And you know I like Bill, but it was a big statement. It was an important statement. And what he meant by that is this is all a movement. No matter where we go. We go to Alabama we have 35,000 people. We had 25,000 in Orlando, 25,000 people all over. I mean, it's routine. If I say, if they say to me like, sir you have 10,000 people tonight. I said that's a small crowd. What's wrong? What's wrong? We have tremendous crowds. We have by far the biggest crowds far bigger than Bernie, by the way, far bigger and Bernie is second. But now, Bernie is over I guess, right? It's over. It's over for Bernie. And really, I want to run against Hillary, I don't want to run against Bernie. I really want to run against, I want to run against crooked Hillary Clinton. We're going to beat her so badly. I want to run against crooked Hillary. So here's what happens. So Carrier announced they're leaving Indianapolis and this is so easy. You know, I have the best business leaders in the world. You saw the other night when I won New York, Carl Icahn, the greatest business people endorsed me, and we'll use them to make our trade deals. These are the big -- they don't want money that -- they wanted to do it. To them, it's a chess game and they love the country. But here's what happens. So Carrier announced 1,400 people, you get out, you're fired. Like The Apprentice, you're fired. And they say, we're moving to Mexico. We're moving. Just like that. We're moving to Mexico. Our government doesn't do anything about it. And the politicians won't because they're taken care of by special interests, so they won't do anything about it. So all right, get him out. Look how fast our police work. Are they the greatest? Look at that. Oh, these police, these police. We love our police. Thank you. Well, they were, they were running him out. That's beautiful. I loved this. So what happens is our politicians do absolutely nothing, absolutely nothing. Carrier leaves and here's what I do. Now my wife is constantly saying darling be more presidential. I just don't know that I wanted to do it quite yet Jeffrey because we have a job to do. I've got two leftovers. I have to finish that. OK? We have to. We have to. And we're doing so good. And we have to be tough for a little while. And I'll be at some point, I'm going to be so presidential that you people will be so bored, and I'll come back as a presidential person. And instead of 10,000 people, I'll have about 150 people and they'll say, but boy, he really looks presidential. But you know, we have a very sad topic because we're talking about what's happened to our country. But we have a very happy topic also because you know, believe it or not, let's make America great again, make America great again. America first. All of these statements are positive statements. And the one I love is the one that's on all those beautiful hats, some red, some white is a man, some hunters caps. Right? Right? Make America great again. That's a positive message. That's a positive message. So I want to do Carrier myself because I love it. You know, I love working. I'm not a vacation guy, right? Like Obama, he plays golf in Hawaii. He flies on a 747 spewing, spewing flies. Then he talks about the carbon footprint. He goes to Hawaii in his 747 for vacation. And then, he comes back has a news conference on the carbon footprint. I mean, give me a break, folk, OK? So here's the story. I want to do Carrier. I know it's not presidential. I don't want to give it to Carl Icahn. I don't want to give it to these great business guys. They're the richest guys, the best negotiators. I don't want to give it to them. I love doing this stuff. I call up the presidents of Carrier, highly, highly unpresidential, right? The president of the United States calling up an air conditioning company. But that air conditioning company, abandoned 1,400 jobs in our country and because our politicians are so stupid they allow it to happen, and they've been talking about stopping it for five years. It's called corporate inversions. They don't even know what the words mean. So they've been talking about it for years. So here's what we do. I get him on the phone and I say good luck, sir, good luck with your new plant in Mexico. I hope you do fantastically, but as you know, you've terminated 1,400 people. And as you know, I don't like that. And as you also know, we now have a very strong border. We have a border where the Border Patrol men and women, who by the way, last week endorsed me, 16,000 and these are great people that aren't allowed to do their job. If they let them do their job, you still need the wall to stop the drugs and other things. But these are great people, they're not allowed to do the job. By the way, Sheriff Joe Arpaio also from Arizona. Enjoy. So you know who the good one on the border. So tell him, I say here's the story. Enjoy your new plant. Enjoy the very, very hot weather because here's a story, when you sell a unit, you do an air conditioning unit, every single unit that crosses our now very strong border. In other words, you have to go through a certain way. You don't just have it come across like we have now. Every year, they're coming across our border. It's going to be taxed at 35% per year, OK? Now, believe me, I'm really good at this stuff. I'm so good at this stuff, I built such a great company. So here's the story. If you say it before they move, they're not going to move. They're not going to move. In other words, you tell them before they move. Don't tell them later. You go up to them and say listen, you're moving I'm so what can we do we, want to keep you. No, we're moving. Oh, you're an arrogant guy, huh. Guess what? You move, but if you move and you make product in Mexico or wherever or wherever, every unit coming across the border is going to be taxed at 35%. Now, here's what's going to happen. If they have that conversation with lying Ted Cruz or with Kasich, who nobody even knows who the hell he is. If they have the conversation with these guys, 100% they move and that's the end of it. If they have the conversation with Hillary, it's guess what? It's going to be even worse. You won't even pick up the phone because what's going to happen is their lobbyists and their special interests will call the politicians, and they'll say you can't do that. This group gave you $1 million when you ran and they're going to give you $1 million the next time you run. You can't do that -- let me tell you. In other words, they got it. Now they tell me nothing. Nothing. I won't take their call. I couldn't care less. So here's what's going to happen. And I like talking to him before they move. I would talk to him before they move because if it's before they move, they're going to say the following. They'll call me back within 24 hours and they will say, Mr. President sir, we've decided not to move the United States, OK? If they've already moved. They're going to try and undo that deal so fast. I guarantee you. And here's what happens. Maybe they can't come back. Maybe it's too late, but our country is going to make a lot of money, folks. We're going to make a lot of money and we need the money. We have massive deficits. We owe $19 trillion, and that's the way it is. Now on a larger basis, Ford, Ford Motor Company built to -- get him out. Get him out. Get him. Get him. Here come the police. Look at them move, I love these police here. I'd get them out, please. Get them out. Take them out of here. See they're right in front of the cameras. Right in front of the cameras where they want to be. You know, we had a couple of protesters. We had some protesters in New York before I made a speech. And the media went to him. And by the way, see the media? That is the most dishonest group of human beings. They are the worst. They are the most dishonest people. And that's what I like about protesters, they go around and they show the crowd. So I like it. So I like my protesters. But in New York they had protesters and they went up. The media went up and they say why are you here? Do you not like Donald Trump? No, I like him. He's a great guy. Oh, and they have signs manufactured by a beautiful printing press, not made in the basement like it's supposed to be. They go up to another one. Why are you here? And the guy goes, I don't know. I don't know. In other words, it's all a phony deal, folks. It's a phony disgusting deal. We had one, two days I've very few of -- I'll tell you what. Have you heard about protesters? They're giving up with us because we like it. We like it. We have fun with it, right? We have fun with it. But it's a phony deal. Many of these people, I would say, most of these people are told to come here and try and disrupt and agitate. They're bad people but we are so cool, and we take care of ourselves. And remember what I said, the safest place on earth is a Trump rally. Believe me. Believe me. So Carrier won't be leaving. Ford is building a $2.5 billion plant in Mexico. I've been talking about it for two years, it's been my big baby. And $2.5 billion you know what that is? And they're going to make their cars and trucks and parts, and they're going to pour them right into the United States. We get nothing. Now, the other day I'm reading in the Wall Street Journal that they've decided to do more. They're going to do more. It's going to be bigger. They're going to make it bigger. Why do we get out of it? We get nothing. Look at this area? Look at the state of Pennsylvania that I love. They're ripping our businesses out. They're taking our heart out. They're taking our jobs out, and we're not going to let them get away with it anymore. And the system is rigged. The voting is rigged. The whole deal is crooked. 100% almost as crooked as crooked Hillary. It's a crooked deal. And that's why you have a case where I go in and win with a vote, and these guys go and they buy delegates. They buy them dinners, they send them to hotels. The whole thing is a sham. And by the way, I don't know if even my enemies in the media agree with me. And lots of changes are being made. With all of that being said, we're winning by a lot. We're kicking ass. I'll tell you. Believe me. So we're going to stop. And when I came down that escalator with Melania, I had two things in mind, trade because we make the worst trade deals, probably at any time, anywhere. What China has done to our country. We have a trade deficit with China of $505 billion a year. Then, you have these stupid people that write magazines, they call them the elite. Oh, really they're elite? Do you think they have a better plan than I do? These elite people, these are elite. They call them elite. That means that we're not elite. That means that I'm not elite, I don't know. I don't think anybody has better whatever. Do they have better than what we -- you know, I built a company and I filed all the papers at Federal election. I borrowed $1 million and I built it in. I mean, here's the stuff, my father gave me $250,000. I wish my father gave me -- my father was tough and he was from Brooklyn, and he built houses in Brooklyn. And I borrowed $1 million and I built it into a company that's worth more than $10 billion with the greatest assets, with the greatest assets, some of the greatest assets in the world. Great cash flow, very little debt. And I say it not to brag at all. I say it because that's the kind of thinking we need in this country, at least for a while, until we straighten it out. Because we're sitting right now on a bubble, on a big fat ugly bubble. And if it explodes, it's going to be ugly. You think your businesses are doing lousy now? If that bubble explodes and it's going to happen unless I'm elected. We are going to do things that are going to be so good. And that's what I do. We've got to get down the debt. We're going to do so many things. But the big thing we have to do is we have to take care of our trade. We can't allow China and to have us have a trade deficit of $505 billion. Japan, massive trade deficit. They sell cars. They give us cars, millions of cars come in. We give them practically nothing. The balance is up here. We send them beef, OK? Would you rather have a piece of beef or a car? It's so imbalanced. We have all the cards. Here's the good news. We have the cards. We have the piggy bank. We're not going to have the pity -- we're not going to have it for long because the money is being drained out of our system by other countries and because we have political hacks negotiating deals for us. So that's going to all end. Mexico has a trade. We have a trade deficit with Mexico, $58 billion and that doesn't include the drugs that pour across the border, which probably, who else knows, it's probably more. We are going to do things and when I get up at the debates -- and remember this, I've been number one at every single debate. I've been center stage. We've been center stage in every debate said all these politicians. I was driving them crazy and then the debates. If you look at Drudge who's an amazing guy, if you look at all the polls, the debate polls. Right after the debates, every single debate, every single poll, I won which is nice. I didn't know I could debate. I never did that. That's all politicians do. They're all talk and no action. And our country's going to hell and we're going to stop it, and we're going to stop it fast, OK? So when we have a trade deficit with China, $505 billion, billion not million, billion. That means, you know, not so good. Not so good, right? So what happens is this, we have these people, there in magazines and they write. They're terrible, they're terrible people. They don't know. Actually, they might not even be. Maybe, you know, they call themselves I told you, the elite. And they write and they said oh, there's going to be trade war. There's no trade war. When somebody is taking in $505 billion more than we are, let's have a trade. I mean, it's OK. Who cares. We can't keep going like this. And here's the story. We will get along better with China than we get along right now. And we'll equalize things and they won't be doing what they're doing right now. Right now, they have perpetrated the single greatest theft in the history of the world. They have robbed us blind, and so have other nations. China's been the greatest abuser, but so have other nations. So we're going to stop it and we are going to bring our jobs back, and we're going to keep our jobs here. And there's going to be a time in the very near future when Apple Computer. And don't worry about him. Don't worry about him. Leave him alone. He's got no voice. I can't hear the guy. He's got no voice. Leave him alone. You know, the biggest -- the cutest thing. My people. They see somebody who's going, oh, hey, oh, nobody can hear him. Then my people go, there he is. There he is. They they make a -- don't worry about it. Let him be -- you can't even hear the guy. Oh, but the police are there already. Look at that guy, policeman raise your hand, I love you. Look at these guys. Look at these guys. There's like a rock concert, right? A rock concert. Beautiful, look at you, Oh. So hey, ready. Ready? So we can't let this go on. We're not going to let it go on. We're not going to let it go. And now during one of the debates, a couple of the people that I was debating came up to me, and they said Donald, you know you can't build a wall. I said, why not? I didn't even know what he was talking to. I said China built the Great Wall of China two thousand years ago. Thirteen thousand miles long. We can't build a wall that's 1,000. Tell me about it because I wanted to -- and we have Caterpillar tractors. They didn't. They didn't quite have them yet. So they came up and they said, we can't build a wall. Now, it's 2,000 miles but we need 1,000 miles of wall. Nothing. It's nothing. I will have the most gorgeous wall you've ever seen. Someday, when I'm gone they'll name it the Trump wall. So I'm going to make it so big, so strong, and so beautiful. And believe me, walls work, walls work. All you have to do, just ask Israel do walls work? Walls work. So here's the story, the second thing they said is you really can't get Mexico. And I love Mexico and I love the Hispanics and I'm going to get so many jobs for the Hispanics, for the African-Americans, for people that can't get jobs now. And we're going to do great. In Nevada, where I won the state. They did a poll. People leaving, Hispanics. I was number one in the poll. An easy number one. And the news reported it, they said we don't understand Donald Trump is number one with Hispanics. I love the Hispanics. I can't help it that the leaders in Mexico and every other country. Every other country that do business with us, we're like the dumb bully that keeps getting knocked down. You get them out. Good. Get this guy out. Get them out of here. So then, I said Mexico's going to pay for the wall. These same two guys walk up to me, they say Mexico's never going to pay for the wall. I said, why not? If we're having a trade deficit of $58 billion a year and there was going to cost $10 billion, that's one of the easiest negotiations I've seen. And then, they had the former President Vincente Fox, the former president of Mexico. He's being interviewed by one of the big cable networks and he said, we won't pay for the -- and then, he used the F-bomb. And I said, oh, is he in trouble tomorrow, it's going to be headlines, he used the F-bomb on live television, right? He used the F-bomb. And I said, can you imagine -- hey, by the way, folks, if I ever use the F-bomb, I think, I'd get the electric chair. Do you agree, OK? This guy nobody talks, but here's what he said, we're not going to pay for the you know what wall on live television, OK? Oh, and the anger was so unbelieve -- and you know why he was angry? How dare somebody tell them to do something because for years they and every other country has been ripping us off, and they're not used to somebody saying listen, we're building a wall, and you're paying for it because you're sending a lot of people over, and you're giving us a lot of headaches, and you're going to pay for that wall. And that wall is peanuts compared to the kind of money you make. Don't even -- Fox, Fox. Don't even waste your breath. I love what you say. Don't even way -- it's so easy. That's almost as easy as telling Carrier, you better stay or you got problems, OK? You better stay or you got problems. Remember that five years have been thinking about, what can we do? Let's give them incentive. Let's give them financing. Listen, no, no. Just tell them, you leave. You make products, great. Come in. Tax. You don't have to do anything it's so simple. But they don't want to do it. They don't want to do it because they're stupid. I mean, because they're really stupid or corrupt in a sense, they're corrupt. So here's the story. So Fox said, no way. There is no way. Now, I actually liked it because two years ago, he used to say there is no way we will allow a wall to be built. He obviously understands that's going to happen. Now he doesn't talk about that. Now he just says, they're not going to pay for it. Believe me. Mexico's paying for the wall, OK? That's it. That's it. You know, I won the state of New Hampshire and it's a beautiful state, a beautiful area. And it was my first victory. Now, I've won 23, 24 states. I'm getting spoiled. I got to win Pennsylvania. That's what I got to win, OK? Pennsylvania. I mean, Cruz doesn't even know where Harrisburg is. He doesn't -- this guy, I mean, he went to New York and they threw him around like a rag doll. I love -- when I watch him come in second to Kasich. I just love it. I love it, it's so -- it's so cool. Oh, look we're all filled up back there. I hope you people in the back. Are you OK? I mean, I feel badly for the people. They got to hear about 2% of what we've been talking about all night. But look, look. So we are going to get all of these things done. You've got to get out and vote. You've really got to put a big -- you've got to get your friends, you've got to get everybody, Tuesday. You know a few days. It's amazing how time flies. It feels like I won New York. Yesterday it's already like three days. And I -- I tell you what it really does. They really know me well in New York. This is serious. They know me well. What really is nice is the people that really know me. I mean, I'm doing buildings here. I'm doing buildings. I employ lots of people. The people that know the person when they vote for the person and you get even 10 points higher than the polls were saying you weren't going to get. That means they love you. I get 61. People were saying, oh, remember they were all saying the great Jeffrey Lord can tell you this, but they were all saying, Jeffrey, if he can break 50 it'll be a great victory, is that right? But breaking 60, nobody even -- I got 61 more than 61. So here's the story. Here's the story. And almost all of the delegates, here's the story. You got to go out to vote on Tuesday because we have a movement going on. We have a movement that's been on the cover of Time Magazine many times over the last number of months. We have a movement that everybody in the world is talking about. We have a movement of millions and millions of people. You know, the Republican Party, not known necessarily as the hottest thing in the world is now one of the hottest things in the world. It's one of the hottest parties in the world. You know, the Republican Party, four years ago Mitt Romney ran and he choked, he choked. You know what happened? No, he choked. He should have won that election. That election was easier than this election. But don't worry, I'll win. But he should have won that election and John McCain ran, and it was a tough one because of the economy. But John ran and I backed him and he lost. Mitt Romney ran and I backed him, and he lost. And then I said to my wife, you know what this time, I'm going to do it myself. We're going to get it done. We're going to get it. So, so important. You're going to remember this night. You're going to remember this night. Beautiful evening. Very nice. Other than, I don't like -- other than, I don't like the scenery of empty factories all over the place, OK? But you're going to remember this beautiful evening. More importantly on Tuesday, you're going to remember going to the voters' booth. You're going to cast the most important vote of your life. You're going to vote for Trump. And you know, did you ever hear these politicians? I mean, you know they're just politicians when they say please, please go out and vote. Even if you're not voting for me, vote for my opponent. It's so important as an American exercise, for you to go out and vote. I'm not saying that. If you're going to vote for anybody else other than me, do not go out to vote, OK? Don't go out to vote. Don't, right? I don't want anybody -- but I don't think there's too many people in this room that are -- Is there anybody in the room that's going to vote for other than Trump? Who's going to vote for Trump? Ah, we love you. But here's the story. Here's the story. So important, we have this movement. It's an incredible movement. I told you about Bill O'Reilly, what he said. I told you about Time Magazine. I told you about everything. It's the hottest thing happening. We have, we're up 70% from four years ago. The Democrats are down to 35%. In other words, Hillary and Bernie are down 35% from four years ago. We're up 70 -- more than 70% in votes. All right, right? Now, here's the story. And by the way, this is the hottest event all over the world they're talking about. What's happened to the Republican Party. And then, you have these people the bosses of the party, the establishment, they don't like Trump. And you know, they don't like me because they can't take care of me because I'm not taking their money. I don't want to. I just, I just want -- I want to bring back our jobs. I want to take care of our military. I want to do what's right for our country. We've got to save our country. So here's the story. Great night. You're going to go on Tuesday, you're going to vote. You're going to get all your friends. Everybody that can vote. Don't forget the other side votes, and who the hell knows if they're even allowed to vote. You're going to get every single person you know that can vote. Go out to vote. You're going to say it was the most important vote you've ever cast. You're going to look back. You're going to look back. In four years, in 20 years, in 30 years, you're going to say that was the greatest vote that I ever cast because when Donald Trump became president of the United States, our country started winning again. We don't win anymore. We don't win anymore. We don't win anymore. We don't win with our military. We can't beat ISIS. We don't win with our vets. We don't take care of them. We don't win with education. Common Core is a disaster, which by the way, we're ending, and we're bringing educational back. We don't win with healthcare. And as you know, Obamacare our premiums are going 25%, 35%, 45% up. We're not going -- it's ended, it's over. We're going to have great healthcare. We don't win at the borders. We don't win a trade. Here's what's going to happen, folks. And you better get used to it. We're going to start winning again. We're going to win with our military. We're going to knock the hell out of ISIS. We're going to win with our vets. We're going to take care of our vets. We're going to win on the border. We're going to have a real border. We're going to have a great border. We're going to have a border where people come into our country, but they can only come into our country legally. We're going to win with education. We're getting rid of Common Core. We're bringing our education locally. We're going to win with healthcare. We're going to win with trade. We're going to make the greatest trade deals this country has ever made. And we're going to bring jobs back to Harrisburg and to Pennsylvania, and to every other state in the union. We're going to have Apple products made in the United States instead of Made in China. Believe me. We're going to stop the manipulation of currency. We're going to stop the devaluation of currency. We're going to have products like from Apple starting to be made in our great country again. So we're going to start winning again. We're going to start as of Tuesday. We're going to win so much, folks. Some of you won't be able to take it because you're not used to it. We're going to win at every level. And I have fun with this. And I have to say it. Should I say it? We are going to win, win, win. We're going to win so much. That you're going to say Mr. President, please, please, sir. We don't want to win so much it's driving us crazy. And I'm going to say I'm sorry, we're going to keep winning. We're going to win at every single level and we're going to make America great again. I love you Harrisburg. I love you Pennsylvania."}