{"id":401,"author":"Donald Trump","title":"Speech: Donald Trump Delivers a Campaign Speech in Buffalo, NY","date":"2016-04-18","link":"https://factba.se/transcript/donald-trump-speech-buffalo-ny-april-18-2016","paragraphs":["Well, I want to thank everybody. And what about Rex? What about Rex? You know, you know, all of Kerry's notes -- look, his notes. He doesn't -- and by the way, I think he's a very good speaker. He says he doesn't do this. I'll tell you what, he is. He's a great, great football coach. Here, Rex. Great football coach and a great guy.","And I want to thank Rex and Michelle. Amazing. You know, he won championships in New York, AFC, I think, twice. And always had these teams that were brutal. They were just good. Great defense. And I've been watching and I'll tell you you're gonna have a very, very good season this year. You watch. You watch.","It's gonna be great, and that's because you have a great coach and you really do and he's also a terrific guy. So listen. We're here tonight to discuss lots of things. But you know, something that a lot of people didn't know. I bid $1 billion for the Buffalo Bills. I've bid billion. And I sent out a certified letter from a bank.","And the bank said, Donald Trump will give on 24 hours notice to the NFL $1 billion for the Buffalo Bills, which tells you I love Buffalo, right? And you know we had? We had two great people, you know, the Pegula's and they are great people. And watch they're gonna do an incredible job. First good move was getting Rex to coach the team.","First great move was getting Rex. But you know, what I want to do? Though, do we have already? Get him out. Get him out. Get him out. That was quick. That was quick time. But you know, they always line up right in front of the cameras. Always right in front of the camera. Yeah, get him out, please. But this place is unbelievable.","Look at this and you know what? We have 5,000 people outside trying to get in. But we want to start now, right? We want to start. Now, so they'll be coming in as we go along. All right. Yeah. Get them out. Make room for some of the people outside. Good idea. So I will say, I bid $1 billion all cash for the Buffalo Bills.","And Teri and Kim came in and they bid more. And I was a little bit like hurt. I thought I would have it and would all be together. But you have great owners. I will say that. You're gonna have great owners. And I'll tell you what. You talk about a business deal. He was in the oil business and the fracking.","He sold his stuff at the exact perfect time and he invested in the NFL. That's a great deal for me. That's a great, great -- that's a great, great thing that he did. So you talk about great business deals. And by the way, the other stuff. It isn't going in the right direction. So they made a terrific deal.","Thank you. Look at this. Yeah, get them out. Go home to mommy. Bye. Isn't it crazy? You know, we do all have a First Amendment right, and they really violate our First Amendment right. But what are going to to do, right? Thank you, man. Thank you. So just to finish up. They made a great business deal. All deals should be so good.","When oil went down, he sold like two seconds before the oil went down. Invested in the NFL. That's a good investment. And I'll tell you as owners and with this great, great coach, you're gonna have an unbelievable team this year. And I'm gonna be rooting for the Buffalo Bills. Believe me. Believe me. And you know besides that, we are gonna bring Buffalo back, we're gonna bring New York back and we're gonna bring the United States of America back.","So on the way up, I always do this. I've been out of Syracuse. I'm all over the state. And we love this state and we love New York values. Do we agree? We love New York values. I always tell my people, give me some current information on the economy of Buffalo. Don't get scared and don't feel guilty because it's not your fault.","It's politicians representing all of us that have no clue, that are totally incompetent and these are the people that represent us at the highest level, including president of the United States. And look at what's happened here. Listen to this. Do not get discouraged. I'm telling you, we're bringing it back fast.","You watch what happens. We're not making bad trade deals. We're gonna end all the nonsense and we're gonna bring jobs back to the United States, and that includes Buffalo. That includes Buffalo. So look, these are right out of book. Buffalo has been hammered by our trade policies. Few cities in America have taken a harder hit.","We know that. I know that. I live like I'm here all the time. I have great friends, including Rex here and Michelle. According to the United States Bureau of Labor Statistics, Buffalo has lost nearly half of its manufacturing jobs since 1990. Think of it. Three main reasons: NAFTA, Asian currency manipulation, product dumping, China's entrance into the World Trade Organization.","Nearly 40%, and I'm gonna stop because I don't want to depress people. Nearly 40% of Buffalo's lost jobs have occurred since 2001. Don't worry. New York State has lost three out of four of its manufacturing jobs since the '60s. Three out of four. So folks, look, here's what's happening. We're making horrible deals.","We have people that don't know what they're doing. Companies are moving to Mexico and every place else. We have NAFTA, which was by the way, a Clinton deal. And as you know, Bill Clinton was married to crooked Hillary Clinton. You know that, right? You know that. And that is a total disaster. NAFTA has been a disaster.","Now we have a new one coming up, Trans-Pacific Partnership. It's gonna make NAFTA look like peanuts. We are going to cut it out. We're gonna stop it. It will be detrimental as hell to the people up here and all of the people in the United States. And by the way, Ted Cruz. Lying Ted Cruz. Lying Ted, one of the great liars of all time, lying Ted.","How you doing with Trump? We're doing great. We're winning, winning, winning. And then you see I'm killing him on stage, and I'm up 2 million votes or more than that. 2 million votes. How are we doing with Trump? Oh, we're doing great. Yeah, we're doing now. Now tomorrow, I have to tell you that's a big day.","Because tomorrow we're gonna show Ted Cruz, who hates New York, hates New York. When you look at that debate and you see the way he talked about us and New York values. Here's a man that turned down Sandy money for this state and plenty of other money. We had lots of things coming into New York, and he voted against.","No New Yorker can vote for Ted Cruz and no New Yorker can vote from Kasich when he was one that approved NAFTA. He voted in favor of NAFTA, which has been a disaster for yoru state and for this country. A total disaster. So with all of that being said, tomorrow get out and vote. We've got to vote. We've got to vote.","And you know, Cruz is way, way down in the polls. And Kasich is not even sort of showing up. I think he's one for 32 and he's the governor of that state. And if I spent another two days, I think I would have beaten him in that state. We were close. And Cruz is just a catastrophe. He didn't even get 50% in his own state.","He was way below 50%. And he doesn't represent what we need. And he doesn't represent us on trade. And the other things that we need to make America great and to make Buffalo great again, OK? He doesn't. Now, I've been having like an interesting period. I've never done a thing like this. I said, I'm running -- I've been a politician for nine months.","Can you believe this? Although, it's been interesting. But you know what, seriously, it takes guts to run for office like this. You know, I never did it before. We've had debates -- every online poll said I won every single debate, which is always nice. And I've been on center stage -- we've been number one virtually since the time I announced.","Because people know that not only are we gonna get great crowds like this, this is crazy you. Know when they said, we're gonna take the arena up in Buffalo. They said, oh, don't do that. It's a massive arena. Look at this place. Just take a look at this. Unbelievable. Unbelievable. But people know and I've been saying it for years that we are being ripped off worldwide by virtually every single country that we do business with.","Every single country no matter what. You can look at everyone. You can call out a name. Every single country that we do business with, we end up with the short end of the stick. And it's gonna end here. It's going to end. We're bringing our jobs back here. You know, it's really nice. I tell you what I want to do as long as you're shouting and I love to hear it. Nothing nicer than USA.","I think what I want to do is I want to talk just for a second. I wrote this out and it's very close to my heart because I was down there. And I watch our police and our firemen down on 7-Eleven, down the World Trade Center, right after it came down and I saw the greatest people I've ever seen in action. I saw the bravest people I've ever seen, including the construction workers, including every person down there.","That's what New York value is about. And so I wrote out a little something and I'd like to talk about the New York values that we all know so well. The values that make us love this state despite its problems. We love this state. We know it's gonna come back. If I'm president, it's gonna come back so fast you won't even believe it. You watch.","Now New York has been a symbol of American strength to the world. Now, where do we see the values? We see the values with our New York police and firefighters. They don't get enough credit. These are great, great people, great Americans. We see it with the New York transit workers. You saw what they went through and you saw the strength and the dedication.","We see it with families that go to your parks, Central Park. All of you parks. Your parks in Buffalos. Your park -- your parks not only in Buffalo but Syracuse. And I was to every play -- Rochester, Albany. We had 20,000 people in Albany, in an arena like this. You see it all over. You see tremendous, tremendous spirit.","You see it in restaurant workers, in deli's and factory workers in upstate New York. The ones that are left, but we're gonna build you up. Don't worry. Don't worry. You see it really in the whole fabric of the community. And what are New York values? Honesty and straight talking. A lot of times people say, oh, you tell it to straight, Mr. Trump.","I think that's what we like. Don't you think? Don't you think? You see it in our work ethic. We work hard. We work hard and we're proud. You see it in our family values and our families. You see it in the energy to get things done. You hear about it all the time. The energy in New York and the energy in New York State.","We're builders. We make things. We have courage and we do great, great jobs for our community. We have great community service, and that's where you see it. Now, New York values were on display for all to see in the aftermath of 9/11. A strike at the heart of our city and our nation and in fact, even the world.","This was the worst hit that our country has ever taken. Worse than Pearl Harbor. Because when they attacked Pearl Harbor, at least it was military. This was civilians. These were great people. Everybody in this room practically knew somebody that died or somebody that was horribly injured during that terrible day.","But this was attack on civilians and this was the worst attack in the history of our country. And when you think of what we've done since then and how we've reacted that's New York values, folks. That's New York values. And you're right, we are going to build that wall and we are gonna build it. Believe me. We're gonna build a wall.","We're gonna a build a wall and Mexico is gonna pay for the wall and you know it and I know it and they know it. In our darkest moments as a city, we showed the world the very best of America. The firefighters and first responders and the police officers and the Port Authority workers. All of them who ran up those stairs knowing that the end could be very near.","They knew it. They felt that building. They knew bad things were going to happen and they ran up those stairs and nobody came back. That's New York values, folks. That's New York value. Father Michael Judge, a great guy. The chaplain of the New York City Fire Department, who died providing comfort and prayer to the wounded in the fallen on 9/11. A good friend of many people in this room.","He really displayed New York values and he knew what was coming very, very soon. Father Judge. The people in the towers who helped rescue each other and those that perished knowing that if they left earlier they could have gotten out. They didn't want to do it. They stayed. They helped other people. Those are New York values.","The restaurants and local businesses, who kept their shops open to help the first responders and help people in need. Those are first -- I'll tell you what, those are really the people when you think in terms of New York values the bravery. And you never hear about somebody who left, who is running in the opposite direction.","These people were going through terror and you know what happened. Everyone who helped clear the rubble. And I was there and I watched and I helped a little bit. But I want to tell you, those people were amazing. Clearing the rubble, trying to find additional lives. You didn't know what was gonna come down on all of us and they handled it. Every small act of kindness, every great act of courage, those are New York values, OK? So when a guy like lying Ted Cruz talks about, talks about New York values folks, those are the values that we want to talk about.","Now let me just tell you a couple of things and why tomorrow is so important because the system is rigged. It's not meant for a guy like me, who's not taking any money from these special interests. I'm self funding my campaign. I came up here. I pay for it to come up here. It's a rigged system just like so much else in government is rigged, but I've never seen anything like it. When you have a Colorado or Wyoming, in the case of Colorado, they were supposed to vote.","They said there were no changes made, but there was. I announced in June. People saw that I was gonna do great in Colorado. And all of a sudden, in August, they changed the system. They took the vote away from the people of Colorado. They didn't give the vote to the people of Wyoming. Now, I could have done really well because I'm very good at dealing with the bosses.","But you know, you've had it and you say, forget it. You can take them out to hotels, the delegates. You can take them on planes. You can do whatever you want to do. You know what, I said, no way. Because we're gonna get there. We don't need it. We're gonna get there. It's a rigged and it's a corrupt system but we're gonna get there.","And I believe we're gonna do it much more easily than people think. And we're gonna do it on the first ballot. We're gonna get to that big 12 37. And when we do, we're going to get a little bit of a race. You know, they all say if it's Trump against Clinton, that's gonna be the greatest voter turnout in the history of our country and I think that's true.","And that, by the way, is a good thing. It's good for us too. By the way, the more people that come, the better. But it's a great thing. Because you know, historically, our country has done very, very poorly in voter turnout. A lot of people don't vote. Now the Republicans have increased almost 70% from what it was four years ago when Mitt Romney choked and he lost a leg.","He lost an election that should have been won. That was an election that was just waiting to be won and they lost it. They blew it. Same group, same people. They're happy as long as they keep their jobs, as long as they get their consulting money. Same group, same everything. We're gonna change it because we're gonna win and we're gonna beat Crooked Hillary so badly that your heads will spin.","So let me just tell you we're going along and we just get -- had a great poll from Fox and we had some great posts from everything. But against Hillary, we're gonna do so great. But you have to understand folks, we haven't even started with crooked Hillary yet. We have not started the game. We haven't -- only about two months ago, I did say something and she went like that.","And then Bernie got the credit for doing well. Since then, I don't know if he's lost. And think of it, I'm no fan of Bernie. Believe me. But every -- No, no, no, that's OK. I am no fan of Bernie. His ideas are very bad, etc., etc. But every week, you see Bernie won, Bernie own, Bernie own, Bernie won. He wins every time.","And then you hear about the crooked system. She got -- crooked Hillary with a crooked system. You hear about the system and they say -- and the pundits say, well, Bernie has no chance. Why does he have a chance? He wins. Because the system is rigged. But we're gonna unrigged the system and then we're gonna clean up the system, OK? We're gonna clean it up. In the case of the Democrats, they have superdelegates.","In our case, it's worse because it's more sinister. It's harder to see but it's actually more devious and it's worse. And you know what, we have millions of people that came out to vote for Trump and they're not really voting for me. They're voting for what we want. We -- you know what we want. We want great, we want great trade deals.","We want a strong military. We want to take care of our vets. We want to beat ISIS and stop playing games. We want to repeal and replace Obamacare. We want to protect our great Second Amendment, so important. We want to end Common Core, end it, end it, end it and bring education locally, to Buffalo and all of the local communities.","We will -- it will be so much better. And we want to have strong, strong borders where people can come in. But they have to come in legally, legally. They come in legally. And we will build that wall. We will build that wall. Now, when I'm on stage with these guys -- don't forget we started off with 17 people.","And you know, I get a kick. They say, Donald Trump didn't hit 50%. I'm dealing with 16 people over here. How do you hit? You got all these people up there. Then you'd lose two. You'd lose another two. They get it down to twelve. They get it down to 10. They get it down to seven. I mean give me a break. Donald Trump didn't hit.","I've got 14 people up there. I'm supposed to hit fifth. But I've won far more states than anybody else. Not even close. Not even close. And as we all know, but it's never covered millions of votes more and it's gonna be interesting to see what happens because I'm saying that we're going to hit the 12 37. I believe.","Because New York is looking great but you got to go and vote. And Pennsylvania and Rhode Island and every state we're looking. At Maryland, we are looking so good and Indiana is gonna be great. I think Indiana. We're gonna get out to California. I mean we have a lot of stops, and I'm gonna work so hard. And you know my family said, Dad, why are you doing this?","I say, because, honestly, we can do something that's so special. We're gonna turn this country around. We're gonna make the greatest trade deals ever made. We're gonna become so strong, so powerful, so rich and you're gonna be so proud of our country again. We're not gonna be the dummies anymore. So when I'm on the stage at one of the debates.","One of my folks come up. First of all, they all said, remember, you can't build a wall. China built a wall 13,000 miles long and 2,000 years ago, 2,000 years ago, the Great Wall of China. This is the Great Wall of Trump, I guess. I don't know.. Boy, what spirit the people of Buffalo have, right? What spirit.","And you know, I have to tell you. You see all those cameras going on. Every night they put us on live, live, live. They don't cover anyone else like -- they like it live. Some night I'd like to have it not so live so we could really talk, folks. But these are the most -- I'm telling you, these are -- well, let's see.","Lying Ted maybe it's first. By the way, wouldn't it be interesting if Ted Cruz came in third tomorrow. Won't that be interesting? Very interesting. Honestly, I never thought I was gonna see him as one of the last three people. I never thought it was gonna happen. I never thought it was gonna happen. I could name the other ones but I didn't want to do it. I thought there'd be other people, you know, before we have final victory.","I didn't expect to see -- I honestly, I didn't expect to see either of these two, but that's OK. That's OK. So during one of the debates, the debate is over. I had talked about Mexico's gonna pay for the wall. I had talked about the wall. And a couple of the participants came up to me. They said, Donald, you know you're not gonna build a wall.","I said, why not? You can't build a wall. Really? Why not? Tell me why we can't? And they said, I don't know. You know how easy that is beautiful brick cast concrete going up? I'll tell you one thing if anybody gets to the top of the Trump Wall, it's gonna be a long way down. It's gonna be very scary. It's gonna be a real wall.","But they said, you can't really build a wall. And I said about the Great Wall of China, which is very serious wall by the way. I told him about the Great Wall of China. I said look, over there, you're talking about 12,000, 13,000. Over here, you're talking about really a thousand miles, it's 2,000 but n -- because I have a lot of natural barriers, etc.","They said, you'll never be able to build. It's so easy. So easy. When I can build 6,000 units in the middle of Manhattan on the Hudson River. I can guarantee you. I can guarantee you this is easy by comparison. With all the stuff I put up, with all the environmental permits I had to get for so many different jobs all over the world, all over the world, on oceans, on Scotland, on oceans where they said you'd never be able to get the approvals.","I got the approvals. In New York, in Manhattan, in Washington, in California, no matter where on the Pacific Ocean, with all of what I've done -- Look, I borrowed a million dollars and I turned it in a relatively short period of time into more than $10 billion. OK folks, that's the numbers. Now, one of the most iconic company, some of the great assets anywhere in the world, all of the papers are filed.","I had to file the papers. A couple of friends of mine -- you know, many of the great businessmen supported me. And by the way, we're gonna use these people to negotiate with China, Japan and Mexico. These are the best negotiators in the world. We have political hacks right now. So it's a company with some of the greatest assets, most iconic assets in the world, very little debt, tremendous cash flow.","All the papers are filed. The press was devastated. They went to see. They were going crazy. It was like a feeding frenzy. They were gonna do a number. And then they said, oh man, he really built a great company. It was private. They didn't know. That's the first time I've ever done a filing. And you know what happens?","I'm not saying that in a braggadocio manner. I'm saying this, this is the kind of thinking and at least for a period of time till we straighten things out, big league, that our country needs. So you know I'm conservative, but all or some of these conservatives, you have all these people. I had so many ads.","I had 55. I didn't even believe this. I saw it on television. I had -- which you can never believe 100% so maybe they were 50. So listen to this, I thought it was impossible but I knew it was a hell of a lot. You heard the story during the golf tournament at Doral, Trump National Doral. Adam Scott is winning and they said, and now for a commercial.","And I've been watching for a week all of these. I said please, please don't that -- don't let that be a negative Trump ad before we present him with the trophy. So he hits his great shot. They say, and we'll be right back. Trump ad, Trump ad. I mean the most negative and untruthful. Most of its untruthful, not all of it. But, you know, pretty much OK. And I'd say, turn the televisions off.","They're all over the greens, all of -- I said get the televisions off. Anyway, I was hit. But let me just tell you, 55,000 ads. 55,000. I said that's impossible. And 55,000 like close to 100 million in negative ads. Then you listen to Kasich and you said, nobody ever hit him with an ad. Nobody talks about it. He said he does well against Hillary.","As soon as they run the first ad that's the end of him. As soon as they run some negative ads on Cruz and boy, would he be easy. That's the end of him. And think of it, 55,000 ads and we're doing well. 55,000 ads and we're gonna win New York State, which no other and I'm talking about in the general election, which no other candidate even has a chance.","We're gonna win Michigan. We're gonna win Pennsylvania. We're gonna win states that aren't in play. And we're gonna win Florida, big league. You know what they did in Florida folks. You know what they did in Florida. So Florida was rigged also. Florida was rigged that the governor of Florida, Jeb Bush, the ex governor.","Pretty popular. Nice guy. Now he's a nice guy. Before when I was competing, I didn't like. Now, he's a nice guy. It's amazing the way that happens. And Marco Rubio, one of them was gonna win Florida. And so what they did is they made the state at the last moment. Winner take all 99 delegates, right? Winner take all.","And then they had a problem because a poll came out. It said Trump is gonna kill everybody. He's at 48 and these guys were at like 17 and 12. They say, wait a minute. This is a disaster. What do we do? So they look upon changing. I didn't let him change. I didn't let him change. But this was a winner -- this was a winner take all state that I was supposed to be taking advantage of, OK? There's only one problem.","I won it by 20 points. We won it in a landslide. And we got 99 delegates, OK? So just remember -- and so it works both ways. But just remember folks, we're gonna win and we're gonna win on the first. And it could be -- we have to go longer but I don't think so because I'm seeing numbers that are pretty very compelling.","But I will tell you this. We are going to win. And once we win, our country is gonna become so strong and so powerful again. And you're gonna be so proud of your president. But I don't care about that. But you're gonna be so proud of your country once again. So there is no place that's better or more fun or safer or safer.","Remember that. There is no place that's better, more fun or safer than a Trump rally. No. So we're losing a lot of business. Let's talk business because you guys are being decimated. I'm telling you, our military, I'm gonna -- just let me handle it. We're gonna make it so strong, so powerful. Nobody is ever messing with us. We're taking care of our vets.","All of that. But let's talk jobs. Because in Buffalo, we have to talk jobs. In Indiana, in Pennsylvania, I was just in Pittsburgh, we had an unbelievable crowd. They need jobs. Our jobs are being taken away. They're going to Mexico. You saw what happened with Carrier, Carrier air conditioner, right? So they get announced -- now, Nabisco is gone.","Mexico. Ford, massive $2.5 billion plant in Mexico. Many other countries that's becoming a mini China for ripping off the United States. And I'm not angry at Mexico or the leaders of Mexico. I'm angry at the leaders of the United States for being so stupid to allow this to happen. So the other day and this could be -- I could substitute many many names, but we'll use this one, Carrier air conditioners.","I bought many, many over the years. I won't buy them anymore. I'm not buying Carrier anymore. So they announced they're laying off 14 -- and it was done with a cellphone. One of the folks downstairs that was getting fired. They're covering this sort of mid-level guy, and he was nasty. He said essentially, you know, you're all gonna be fired.","We're moving to Mexico. Oh wonderful. They've been there for 30 years, in many cases, and now they're gone. Not gonna happen with me. So what happens is this. They move to Mexico. They think they're gonna make air conditioners and they're gonna sell them back to the United States with no tax, with no consequence, with no problem.","It's not gonna happen, folks. It's not gonna happen. They want to go there. That's great. But there is going to be consequence. And I've told this before but it's so obvious and it's so -- There are only so many things you can say. But I've told it before and again could apply to hundreds of different companies.","I say to my wife, you know, I want to make this call. And she'll say, no, no you must act more presidential. I don't want to really act more presidential until we win. Do we agree, folks? You know, we'll be a little bit less then. You know, more presidential is easier than working, working, working like I do because more presidential means low key and a little bit.","My daughter, Ivanka, came up to me in the last debate. Now Dad, you've won every debate. We love Ivanka, right? And we love Melania. We love them all. I have good kids. But my daughter, Ivanka, she said, now Dad, be more presidential. Then my wife says, now be very presidential. I said, wait a minute. I've won every debate.","If they hit me, I got to hit them back. They said, no, no you don't. I said, yes I do. Anyway. I was very presidential in that debate and it worked out really well. And you know what, we're doing great. But here's the story. I'm gonna say to my family, I'm sorry. This is too easy. I want to call Carrier.","Can you imagine, President of the United States calling for the head of an air conditioning company, all right. But the head of an air conditioning company that didn't do right by us, OK? And while I could give it to somebody, it's just too quick, too easy and I love this stuff. It's like I'm very natural at it. I'm really, really good at it. So here's the conversation and remember, if either -- anyone of these people Ted Cruz, Kasich.","They're all controlled by their lobbyist. They're all controlled by special interests. These are not stupid people. Hillary controlled by special interests. When their special interests calls, when their lobbyist calls, when their donors call and they have a stake in a deal. They're not gonna do what's right for you.","I didn't take any money. I have turned down -- if I would have accepted money, Jeb Bush had the biggest fund. I think it was $148 million. Can you believe it? $148 million. You might as well throw it right out the window. What -- It's just a waste. And you see what -- by the way, do you see what their consultants make?","These consultants they can retire. They made millions and millions of dollars and they lost. But here's the story. I will call or I will speak to or I'll have somebody call, maybe. But I want to do it myself. I will call the head. This is President United States want to speak to the head of Carrier. I'll get him on the phone.","I'll say, listen. Congratulations on your move to Mexico. I hope you have many years of good health and happiness and great, great productivity. But here's the story, here's the story. Every single air conditioning unit that you make and you want to send across now very, very powerful border, where by the way, the Border Patrol, 16,5000 people endorsed me last week and they've never done that before.","And where Sheriff Joe Arpaio, a great guy, endorsed me last month from Arizona, and there's nobody better or tougher or fairer at the border than he is. So I'm saying every unit that you make and you send across that border, you're gonna pay a 35% tax on that unit. And as sure as you're standing or sitting -- look at you, everybody is standing.","You can sit down, but stand. Stand is better. It's more respect. And I'll tell you what's gonna happen. I will get a call the next day from everybody, you know, the lobbyists. They never gave me money. The special interest, they never -- I know these people. I'm not doing anything. I'm working for you, folks.","I'm working for you. I don't need this. I'm working for you. We're gonna make America great again. That's what I want to do. What kind of a legacy. Is that the coolest legacy? That's almost as good as owning the Buffalo Bills, right? That's almost. So here's what happens. I'll say, forget them, forget them.","Then the head of Carrier is gonna call up and said, Mr. President will you change your mind? I said absolutely not. 100%. I'll be ready to hang up. And they'll say, Mr. President, sir. We're not gonna move. We're not gonna leave the United States. 100%, folks. 100%. Now, I've been watching corporate inversion and I've been watching what's going on with these companies leaving the United States.","The politicians don't even know what's happening. It's happening far faster than anybody can even discuss. They ought to do headline banners because there's nothing worse. Not many things worse. I will tell you that. But we've got to stop it. Now the way you stop it is that. I've been watching now for four years politicians negotiating with each other.","They're not business people and they're essentially they're all bought. They're bought and paid for by special interests that want to see these things happen. So what's going to happen is they will never ever come to the conclusion and how simple a conclusion. Now when Ford and Carrier and Nabisco -- Nabisco is moving out of Chicago and they're moving where?","To Mexico. No more Oreos. No more. So here's the story. Here's the story. 100% if we negotiate tough. Number one we have to work with our companies to keep them where they are. Most importantly, we have to keep them in the United States. Most importantly, let's get them to move to Buffalo, right? We'll get them to move to Buffalo.","But we are gonna have and we are gonna attract so much business. We right now have a trade deficit with Mexico of $58 billion a year not including all of the drugs that pour across the border and poison our youth that we're gonna stop when we let our great border patrol people go to work. And when we build the wall, we're gonna stop the drugs from coming to Buffalo and coming to our country and destroying our youth.","So the conservatives they would say, like Jeb Bush used to get up, he is not a conservative. Who cares? I am a conservative. But I'm a free trader. But you can only be a free trader, remember this, if you have really smart people representing your interests and we don't. They're either not smart or essentially they're paid off with campaign contributions.","And either one of those situations is not acceptable, OK? It's not acceptable. So we are going to have the toughest, the smartest, the sharpest business people in the world negotiating on trade deals. Now let me tell you, the dishonest press, world's most dishonest people. They cover it wrong all the time.","It was asked to me about NATO. What do you think about NATO? And it was asked on CNN by Wolf Blitzer. And I said, here's the story. Number one, NATO is obsolete. Number two, the countries in NATO are not paying their fair share. They're not carrying the baggage. They're not paying. We're protecting these and they take advantage of us. And who can blame them for doing so? So I said, you always have to be prepared to walk but we'll never have to walk.","They have to pay up, folks. They owe us tremendous amounts of money. Many of these countries are very rich countries. I want them to pay up and I want them to pay up all of the delinquency. All of this stuff in arrears. They owe us the money. We've protected them. They're taking advantage of us because they have no respect for our leaders.","They will have respect for us. We're gonna be very soon a $21 trillion. They will have great respect for us. We will have a better, we will have a better relationship than our President Obama has right now and they'll be even. Now, we, as you know, protect Japan. We protect Germany. We protect South Korea.","We protect Saudi Arabia. And you know what? We're dying with these deals. These deals are terrible. These a monster monster companies and countries. These are the biggest companies and the biggest countries in terms of economics. Why are we doing this? In South Korea, and I have buildings in South Korea.","I have great respect for South Korea and Japan and Germany and Saudi Arabia. But we're protecting them. They've got to pay us, folks. They've got to pay. We can't do this. This isn't from years ago. They have to take care of us. We have to straighten out our country. They have to take care of us. And I want to keep doing it and I want to keep -- I want to keep doing it. I want to keep it going.","But you know what? At some point, they're laughing at us. I have friends in Saudi Arabia. I have friends in Germany. I have friends in Japan. I have many friends in South Korea. Every time you order a television set, Samsung, LG. You order it from South Korea they're unbelievably successful countries. They've got to help us out.","They've got to help us out. They're gonna pay. If we didn't take care of Saudi Arabia, as an example, they wouldn't be there for six months and nobody has more money and nobody -- before the -- I'll give you an example. Before the oil went down, Saudi Arabia was making $1 billion a day. A billion dollars a day.","We're losing a fortune every single month. We lose a fortune. They've got to pay up, folks. They've got to pay up and we want to get along with everybody, OK? They got to pay up. So we're going to have something that's very special. I'm going against the bosses. You know, I used to be a big contributor. I used to be, I guess, one of the bosses in a certain way.","I was a member of the establishment. Nobody knows the game better than I do. Believe me. I know the game so well. I can go to lobbyists. They have crews stamped on their forehead. It says crews. I can handle anything. And you give these guys millions of dollars and they go and they produce a vote and the vote very well could be bad for the country, but it's good for the company or the country that they're representing.","We can't do that anymore, folks. Because you know when you see some of these horrible deals -- I have a friend who's a very smart guy. And he said to me, I can't believe that they approve this deal, a certain deal. It doesn't matter. Certain deal. I can't believe and a certain senator was in charge of it. I can't believe he's that stupid.","I say, he's not stupid at all. He's not stupid. He's smart. What happened is he was contacted by special interests and by lobbyists and he was told to do this. They gave millions of dollars. He was told to do it. And it's very adverse to the country, extremely adverse to the country. But you know what? It's damn good for him because they'll be around for years and years and years, essentially taking care of him.","So my friends, I never thought of it that way. It must be. Because there's no way a deal like this could be made. So that's the story. With me folks, those these are not gonna happen, not gonna happen. Now here's the story, here's the story. So important. So important. And we're gonna have -- and by the way, we're gonna have better relationships with all of these rip off countries.","You look at China, they're building military fortresses in the South China Sea. You look at what all of these countries are doing and how they take advantage of us. We are going to have tough, smart trade deals, really smart trade deals. You know, if you want to deal in China. They send their stuff to us. No tax, no nothing.","If you want to do business in China, it's virtually impossible, number one, to get your product in. And if you do, they tax you. So what are we doing? This is not free trade. This is stupid, stupid, stupid trade. And it's not gonna happen. So here's the story, folks. Tomorrow is a big, big day because the thing I like most are -- I mean, I hope it turns out this way.","But we have these massive polls. I don't like massive polls for one reason. People may say, oh, let's stay home. We have a movement going on like they say they have never seen in this country. Time Magazine covers many times, all of the newspapers and as much as the media treats me unfairly, they do admit there's probably never been anything like this.","We had 35,000 in Mobile Alabama. We filled up Maverick Stadium in Dallas. We fill up everything. So here's the story. You're gonna leave here and you're gonna say that was a great evening. But more importantly, tomorrow, you're gonna go out and vote and you're gonna make sure all your friends are gonna go and vote.","And you're gonna remember, and you're gonna remember, you are going to remember this evening and you're going to remember more importantly tomorrow and the vote. And you're gonna look back in four years and 12 years and 25 years and you're gonna say, that's the greatest single vote I've ever cast. Because from that point on, as soon as we beat Hillary Clinton, we are going to start as a country winning again.","We're gonna win on trade. We're gonna win with ISIS. We're gonna knock the hell out of them fast. Gonna knock them. We're gonna rebuild our military. We are going to win with our military. We're going to make our military so strong, so powerful. You're gonna be proud again. The vets have given me such support.","The military has giving me such support. What's happening to our military is a disgrace. So we're gonna win with our military. We're never gonna have to use it probably because nobody is gonna mess. We're gonna take care of our vets. We're gonna win on the borders. We're gonna win with health care. We're gonna win with Common Core, ending and bringing it back local.","We're gonna take care of our Second Amendment. If we had guns on the other side of the room, in Los Angeles with bullets flying the other way, or if in Paris, the toughest gun laws in the world, if in Paris, they had guns with bullets firing the other way, you wouldn't have had 130 people absolutely decimated and killed and hundreds of people in the hospital.","It would have been a whole different story. So we're gonna take care of our Second Amendment. And folks, you're gonna look back and you're gonna see, we're gonna start winning, winning, winning. And this is the last big speech I'm making in New York so I can say it the way we want to say it. We're gonna win at every element of what we're doing.","We're gonna win with the military. We're gonna win with everything. We're gonna win so much you'll gonna get tired of winning. You're gonna be saying from Buffalo, please, please, Mr. Bear. We don't want any more business. We're doing too much business. We're making too much money. No matter what you do, we don't want to win anymore.","And I'm gonna say, sorry. We're gonna keep winning. We're gonna win, win, win. And we're gonna make America great again. America first, folks. America first. Thank you, Buffalo. Thank you. Thank you, Buffalo. We love you, Buffalo. Thank you."],"text":" Well, I want to thank everybody. And what about Rex? What about Rex? You know, you know, all of Kerry's notes -- look, his notes. He doesn't -- and by the way, I think he's a very good speaker. He says he doesn't do this. I'll tell you what, he is. He's a great, great football coach. Here, Rex. Great football coach and a great guy. And I want to thank Rex and Michelle. Amazing. You know, he won championships in New York, AFC, I think, twice. And always had these teams that were brutal. They were just good. Great defense. And I've been watching and I'll tell you you're gonna have a very, very good season this year. You watch. You watch. It's gonna be great, and that's because you have a great coach and you really do and he's also a terrific guy. So listen. We're here tonight to discuss lots of things. But you know, something that a lot of people didn't know. I bid $1 billion for the Buffalo Bills. I've bid billion. And I sent out a certified letter from a bank. And the bank said, Donald Trump will give on 24 hours notice to the NFL $1 billion for the Buffalo Bills, which tells you I love Buffalo, right? And you know we had? We had two great people, you know, the Pegula's and they are great people. And watch they're gonna do an incredible job. First good move was getting Rex to coach the team. First great move was getting Rex. But you know, what I want to do? Though, do we have already? Get him out. Get him out. Get him out. That was quick. That was quick time. But you know, they always line up right in front of the cameras. Always right in front of the camera. Yeah, get him out, please. But this place is unbelievable. Look at this and you know what? We have 5,000 people outside trying to get in. But we want to start now, right? We want to start. Now, so they'll be coming in as we go along. All right. Yeah. Get them out. Make room for some of the people outside. Good idea. So I will say, I bid $1 billion all cash for the Buffalo Bills. And Teri and Kim came in and they bid more. And I was a little bit like hurt. I thought I would have it and would all be together. But you have great owners. I will say that. You're gonna have great owners. And I'll tell you what. You talk about a business deal. He was in the oil business and the fracking. He sold his stuff at the exact perfect time and he invested in the NFL. That's a great deal for me. That's a great, great -- that's a great, great thing that he did. So you talk about great business deals. And by the way, the other stuff. It isn't going in the right direction. So they made a terrific deal. Thank you. Look at this. Yeah, get them out. Go home to mommy. Bye. Isn't it crazy? You know, we do all have a First Amendment right, and they really violate our First Amendment right. But what are going to to do, right? Thank you, man. Thank you. So just to finish up. They made a great business deal. All deals should be so good. When oil went down, he sold like two seconds before the oil went down. Invested in the NFL. That's a good investment. And I'll tell you as owners and with this great, great coach, you're gonna have an unbelievable team this year. And I'm gonna be rooting for the Buffalo Bills. Believe me. Believe me. And you know besides that, we are gonna bring Buffalo back, we're gonna bring New York back and we're gonna bring the United States of America back. So on the way up, I always do this. I've been out of Syracuse. I'm all over the state. And we love this state and we love New York values. Do we agree? We love New York values. I always tell my people, give me some current information on the economy of Buffalo. Don't get scared and don't feel guilty because it's not your fault. It's politicians representing all of us that have no clue, that are totally incompetent and these are the people that represent us at the highest level, including president of the United States. And look at what's happened here. Listen to this. Do not get discouraged. I'm telling you, we're bringing it back fast. You watch what happens. We're not making bad trade deals. We're gonna end all the nonsense and we're gonna bring jobs back to the United States, and that includes Buffalo. That includes Buffalo. So look, these are right out of book. Buffalo has been hammered by our trade policies. Few cities in America have taken a harder hit. We know that. I know that. I live like I'm here all the time. I have great friends, including Rex here and Michelle. According to the United States Bureau of Labor Statistics, Buffalo has lost nearly half of its manufacturing jobs since 1990. Think of it. Three main reasons: NAFTA, Asian currency manipulation, product dumping, China's entrance into the World Trade Organization. Nearly 40%, and I'm gonna stop because I don't want to depress people. Nearly 40% of Buffalo's lost jobs have occurred since 2001. Don't worry. New York State has lost three out of four of its manufacturing jobs since the '60s. Three out of four. So folks, look, here's what's happening. We're making horrible deals. We have people that don't know what they're doing. Companies are moving to Mexico and every place else. We have NAFTA, which was by the way, a Clinton deal. And as you know, Bill Clinton was married to crooked Hillary Clinton. You know that, right? You know that. And that is a total disaster. NAFTA has been a disaster. Now we have a new one coming up, Trans-Pacific Partnership. It's gonna make NAFTA look like peanuts. We are going to cut it out. We're gonna stop it. It will be detrimental as hell to the people up here and all of the people in the United States. And by the way, Ted Cruz. Lying Ted Cruz. Lying Ted, one of the great liars of all time, lying Ted. How you doing with Trump? We're doing great. We're winning, winning, winning. And then you see I'm killing him on stage, and I'm up 2 million votes or more than that. 2 million votes. How are we doing with Trump? Oh, we're doing great. Yeah, we're doing now. Now tomorrow, I have to tell you that's a big day. Because tomorrow we're gonna show Ted Cruz, who hates New York, hates New York. When you look at that debate and you see the way he talked about us and New York values. Here's a man that turned down Sandy money for this state and plenty of other money. We had lots of things coming into New York, and he voted against. No New Yorker can vote for Ted Cruz and no New Yorker can vote from Kasich when he was one that approved NAFTA. He voted in favor of NAFTA, which has been a disaster for yoru state and for this country. A total disaster. So with all of that being said, tomorrow get out and vote. We've got to vote. We've got to vote. And you know, Cruz is way, way down in the polls. And Kasich is not even sort of showing up. I think he's one for 32 and he's the governor of that state. And if I spent another two days, I think I would have beaten him in that state. We were close. And Cruz is just a catastrophe. He didn't even get 50% in his own state. He was way below 50%. And he doesn't represent what we need. And he doesn't represent us on trade. And the other things that we need to make America great and to make Buffalo great again, OK? He doesn't. Now, I've been having like an interesting period. I've never done a thing like this. I said, I'm running -- I've been a politician for nine months. Can you believe this? Although, it's been interesting. But you know what, seriously, it takes guts to run for office like this. You know, I never did it before. We've had debates -- every online poll said I won every single debate, which is always nice. And I've been on center stage -- we've been number one virtually since the time I announced. Because people know that not only are we gonna get great crowds like this, this is crazy you. Know when they said, we're gonna take the arena up in Buffalo. They said, oh, don't do that. It's a massive arena. Look at this place. Just take a look at this. Unbelievable. Unbelievable. But people know and I've been saying it for years that we are being ripped off worldwide by virtually every single country that we do business with. Every single country no matter what. You can look at everyone. You can call out a name. Every single country that we do business with, we end up with the short end of the stick. And it's gonna end here. It's going to end. We're bringing our jobs back here. You know, it's really nice. I tell you what I want to do as long as you're shouting and I love to hear it. Nothing nicer than USA. I think what I want to do is I want to talk just for a second. I wrote this out and it's very close to my heart because I was down there. And I watch our police and our firemen down on 7-Eleven, down the World Trade Center, right after it came down and I saw the greatest people I've ever seen in action. I saw the bravest people I've ever seen, including the construction workers, including every person down there. That's what New York value is about. And so I wrote out a little something and I'd like to talk about the New York values that we all know so well. The values that make us love this state despite its problems. We love this state. We know it's gonna come back. If I'm president, it's gonna come back so fast you won't even believe it. You watch. Now New York has been a symbol of American strength to the world. Now, where do we see the values? We see the values with our New York police and firefighters. They don't get enough credit. These are great, great people, great Americans. We see it with the New York transit workers. You saw what they went through and you saw the strength and the dedication. We see it with families that go to your parks, Central Park. All of you parks. Your parks in Buffalos. Your park -- your parks not only in Buffalo but Syracuse. And I was to every play -- Rochester, Albany. We had 20,000 people in Albany, in an arena like this. You see it all over. You see tremendous, tremendous spirit. You see it in restaurant workers, in deli's and factory workers in upstate New York. The ones that are left, but we're gonna build you up. Don't worry. Don't worry. You see it really in the whole fabric of the community. And what are New York values? Honesty and straight talking. A lot of times people say, oh, you tell it to straight, Mr. Trump. I think that's what we like. Don't you think? Don't you think? You see it in our work ethic. We work hard. We work hard and we're proud. You see it in our family values and our families. You see it in the energy to get things done. You hear about it all the time. The energy in New York and the energy in New York State. We're builders. We make things. We have courage and we do great, great jobs for our community. We have great community service, and that's where you see it. Now, New York values were on display for all to see in the aftermath of 9/11. A strike at the heart of our city and our nation and in fact, even the world. This was the worst hit that our country has ever taken. Worse than Pearl Harbor. Because when they attacked Pearl Harbor, at least it was military. This was civilians. These were great people. Everybody in this room practically knew somebody that died or somebody that was horribly injured during that terrible day. But this was attack on civilians and this was the worst attack in the history of our country. And when you think of what we've done since then and how we've reacted that's New York values, folks. That's New York values. And you're right, we are going to build that wall and we are gonna build it. Believe me. We're gonna build a wall. We're gonna a build a wall and Mexico is gonna pay for the wall and you know it and I know it and they know it. In our darkest moments as a city, we showed the world the very best of America. The firefighters and first responders and the police officers and the Port Authority workers. All of them who ran up those stairs knowing that the end could be very near. They knew it. They felt that building. They knew bad things were going to happen and they ran up those stairs and nobody came back. That's New York values, folks. That's New York value. Father Michael Judge, a great guy. The chaplain of the New York City Fire Department, who died providing comfort and prayer to the wounded in the fallen on 9/11. A good friend of many people in this room. He really displayed New York values and he knew what was coming very, very soon. Father Judge. The people in the towers who helped rescue each other and those that perished knowing that if they left earlier they could have gotten out. They didn't want to do it. They stayed. They helped other people. Those are New York values. The restaurants and local businesses, who kept their shops open to help the first responders and help people in need. Those are first -- I'll tell you what, those are really the people when you think in terms of New York values the bravery. And you never hear about somebody who left, who is running in the opposite direction. These people were going through terror and you know what happened. Everyone who helped clear the rubble. And I was there and I watched and I helped a little bit. But I want to tell you, those people were amazing. Clearing the rubble, trying to find additional lives. You didn't know what was gonna come down on all of us and they handled it. Every small act of kindness, every great act of courage, those are New York values, OK? So when a guy like lying Ted Cruz talks about, talks about New York values folks, those are the values that we want to talk about. Now let me just tell you a couple of things and why tomorrow is so important because the system is rigged. It's not meant for a guy like me, who's not taking any money from these special interests. I'm self funding my campaign. I came up here. I pay for it to come up here. It's a rigged system just like so much else in government is rigged, but I've never seen anything like it. When you have a Colorado or Wyoming, in the case of Colorado, they were supposed to vote. They said there were no changes made, but there was. I announced in June. People saw that I was gonna do great in Colorado. And all of a sudden, in August, they changed the system. They took the vote away from the people of Colorado. They didn't give the vote to the people of Wyoming. Now, I could have done really well because I'm very good at dealing with the bosses. But you know, you've had it and you say, forget it. You can take them out to hotels, the delegates. You can take them on planes. You can do whatever you want to do. You know what, I said, no way. Because we're gonna get there. We don't need it. We're gonna get there. It's a rigged and it's a corrupt system but we're gonna get there. And I believe we're gonna do it much more easily than people think. And we're gonna do it on the first ballot. We're gonna get to that big 12 37. And when we do, we're going to get a little bit of a race. You know, they all say if it's Trump against Clinton, that's gonna be the greatest voter turnout in the history of our country and I think that's true. And that, by the way, is a good thing. It's good for us too. By the way, the more people that come, the better. But it's a great thing. Because you know, historically, our country has done very, very poorly in voter turnout. A lot of people don't vote. Now the Republicans have increased almost 70% from what it was four years ago when Mitt Romney choked and he lost a leg. He lost an election that should have been won. That was an election that was just waiting to be won and they lost it. They blew it. Same group, same people. They're happy as long as they keep their jobs, as long as they get their consulting money. Same group, same everything. We're gonna change it because we're gonna win and we're gonna beat Crooked Hillary so badly that your heads will spin. So let me just tell you we're going along and we just get -- had a great poll from Fox and we had some great posts from everything. But against Hillary, we're gonna do so great. But you have to understand folks, we haven't even started with crooked Hillary yet. We have not started the game. We haven't -- only about two months ago, I did say something and she went like that. And then Bernie got the credit for doing well. Since then, I don't know if he's lost. And think of it, I'm no fan of Bernie. Believe me. But every -- No, no, no, that's OK. I am no fan of Bernie. His ideas are very bad, etc., etc. But every week, you see Bernie won, Bernie own, Bernie own, Bernie won. He wins every time. And then you hear about the crooked system. She got -- crooked Hillary with a crooked system. You hear about the system and they say -- and the pundits say, well, Bernie has no chance. Why does he have a chance? He wins. Because the system is rigged. But we're gonna unrigged the system and then we're gonna clean up the system, OK? We're gonna clean it up. In the case of the Democrats, they have superdelegates. In our case, it's worse because it's more sinister. It's harder to see but it's actually more devious and it's worse. And you know what, we have millions of people that came out to vote for Trump and they're not really voting for me. They're voting for what we want. We -- you know what we want. We want great, we want great trade deals. We want a strong military. We want to take care of our vets. We want to beat ISIS and stop playing games. We want to repeal and replace Obamacare. We want to protect our great Second Amendment, so important. We want to end Common Core, end it, end it, end it and bring education locally, to Buffalo and all of the local communities. We will -- it will be so much better. And we want to have strong, strong borders where people can come in. But they have to come in legally, legally. They come in legally. And we will build that wall. We will build that wall. Now, when I'm on stage with these guys -- don't forget we started off with 17 people. And you know, I get a kick. They say, Donald Trump didn't hit 50%. I'm dealing with 16 people over here. How do you hit? You got all these people up there. Then you'd lose two. You'd lose another two. They get it down to twelve. They get it down to 10. They get it down to seven. I mean give me a break. Donald Trump didn't hit. I've got 14 people up there. I'm supposed to hit fifth. But I've won far more states than anybody else. Not even close. Not even close. And as we all know, but it's never covered millions of votes more and it's gonna be interesting to see what happens because I'm saying that we're going to hit the 12 37. I believe. Because New York is looking great but you got to go and vote. And Pennsylvania and Rhode Island and every state we're looking. At Maryland, we are looking so good and Indiana is gonna be great. I think Indiana. We're gonna get out to California. I mean we have a lot of stops, and I'm gonna work so hard. And you know my family said, Dad, why are you doing this? I say, because, honestly, we can do something that's so special. We're gonna turn this country around. We're gonna make the greatest trade deals ever made. We're gonna become so strong, so powerful, so rich and you're gonna be so proud of our country again. We're not gonna be the dummies anymore. So when I'm on the stage at one of the debates. One of my folks come up. First of all, they all said, remember, you can't build a wall. China built a wall 13,000 miles long and 2,000 years ago, 2,000 years ago, the Great Wall of China. This is the Great Wall of Trump, I guess. I don't know.. Boy, what spirit the people of Buffalo have, right? What spirit. And you know, I have to tell you. You see all those cameras going on. Every night they put us on live, live, live. They don't cover anyone else like -- they like it live. Some night I'd like to have it not so live so we could really talk, folks. But these are the most -- I'm telling you, these are -- well, let's see. Lying Ted maybe it's first. By the way, wouldn't it be interesting if Ted Cruz came in third tomorrow. Won't that be interesting? Very interesting. Honestly, I never thought I was gonna see him as one of the last three people. I never thought it was gonna happen. I never thought it was gonna happen. I could name the other ones but I didn't want to do it. I thought there'd be other people, you know, before we have final victory. I didn't expect to see -- I honestly, I didn't expect to see either of these two, but that's OK. That's OK. So during one of the debates, the debate is over. I had talked about Mexico's gonna pay for the wall. I had talked about the wall. And a couple of the participants came up to me. They said, Donald, you know you're not gonna build a wall. I said, why not? You can't build a wall. Really? Why not? Tell me why we can't? And they said, I don't know. You know how easy that is beautiful brick cast concrete going up? I'll tell you one thing if anybody gets to the top of the Trump Wall, it's gonna be a long way down. It's gonna be very scary. It's gonna be a real wall. But they said, you can't really build a wall. And I said about the Great Wall of China, which is very serious wall by the way. I told him about the Great Wall of China. I said look, over there, you're talking about 12,000, 13,000. Over here, you're talking about really a thousand miles, it's 2,000 but n -- because I have a lot of natural barriers, etc. They said, you'll never be able to build. It's so easy. So easy. When I can build 6,000 units in the middle of Manhattan on the Hudson River. I can guarantee you. I can guarantee you this is easy by comparison. With all the stuff I put up, with all the environmental permits I had to get for so many different jobs all over the world, all over the world, on oceans, on Scotland, on oceans where they said you'd never be able to get the approvals. I got the approvals. In New York, in Manhattan, in Washington, in California, no matter where on the Pacific Ocean, with all of what I've done -- Look, I borrowed a million dollars and I turned it in a relatively short period of time into more than $10 billion. OK folks, that's the numbers. Now, one of the most iconic company, some of the great assets anywhere in the world, all of the papers are filed. I had to file the papers. A couple of friends of mine -- you know, many of the great businessmen supported me. And by the way, we're gonna use these people to negotiate with China, Japan and Mexico. These are the best negotiators in the world. We have political hacks right now. So it's a company with some of the greatest assets, most iconic assets in the world, very little debt, tremendous cash flow. All the papers are filed. The press was devastated. They went to see. They were going crazy. It was like a feeding frenzy. They were gonna do a number. And then they said, oh man, he really built a great company. It was private. They didn't know. That's the first time I've ever done a filing. And you know what happens? I'm not saying that in a braggadocio manner. I'm saying this, this is the kind of thinking and at least for a period of time till we straighten things out, big league, that our country needs. So you know I'm conservative, but all or some of these conservatives, you have all these people. I had so many ads. I had 55. I didn't even believe this. I saw it on television. I had -- which you can never believe 100% so maybe they were 50. So listen to this, I thought it was impossible but I knew it was a hell of a lot. You heard the story during the golf tournament at Doral, Trump National Doral. Adam Scott is winning and they said, and now for a commercial. And I've been watching for a week all of these. I said please, please don't that -- don't let that be a negative Trump ad before we present him with the trophy. So he hits his great shot. They say, and we'll be right back. Trump ad, Trump ad. I mean the most negative and untruthful. Most of its untruthful, not all of it. But, you know, pretty much OK. And I'd say, turn the televisions off. They're all over the greens, all of -- I said get the televisions off. Anyway, I was hit. But let me just tell you, 55,000 ads. 55,000. I said that's impossible. And 55,000 like close to 100 million in negative ads. Then you listen to Kasich and you said, nobody ever hit him with an ad. Nobody talks about it. He said he does well against Hillary. As soon as they run the first ad that's the end of him. As soon as they run some negative ads on Cruz and boy, would he be easy. That's the end of him. And think of it, 55,000 ads and we're doing well. 55,000 ads and we're gonna win New York State, which no other and I'm talking about in the general election, which no other candidate even has a chance. We're gonna win Michigan. We're gonna win Pennsylvania. We're gonna win states that aren't in play. And we're gonna win Florida, big league. You know what they did in Florida folks. You know what they did in Florida. So Florida was rigged also. Florida was rigged that the governor of Florida, Jeb Bush, the ex governor. Pretty popular. Nice guy. Now he's a nice guy. Before when I was competing, I didn't like. Now, he's a nice guy. It's amazing the way that happens. And Marco Rubio, one of them was gonna win Florida. And so what they did is they made the state at the last moment. Winner take all 99 delegates, right? Winner take all. And then they had a problem because a poll came out. It said Trump is gonna kill everybody. He's at 48 and these guys were at like 17 and 12. They say, wait a minute. This is a disaster. What do we do? So they look upon changing. I didn't let him change. I didn't let him change. But this was a winner -- this was a winner take all state that I was supposed to be taking advantage of, OK? There's only one problem. I won it by 20 points. We won it in a landslide. And we got 99 delegates, OK? So just remember -- and so it works both ways. But just remember folks, we're gonna win and we're gonna win on the first. And it could be -- we have to go longer but I don't think so because I'm seeing numbers that are pretty very compelling. But I will tell you this. We are going to win. And once we win, our country is gonna become so strong and so powerful again. And you're gonna be so proud of your president. But I don't care about that. But you're gonna be so proud of your country once again. So there is no place that's better or more fun or safer or safer. Remember that. There is no place that's better, more fun or safer than a Trump rally. No. So we're losing a lot of business. Let's talk business because you guys are being decimated. I'm telling you, our military, I'm gonna -- just let me handle it. We're gonna make it so strong, so powerful. Nobody is ever messing with us. We're taking care of our vets. All of that. But let's talk jobs. Because in Buffalo, we have to talk jobs. In Indiana, in Pennsylvania, I was just in Pittsburgh, we had an unbelievable crowd. They need jobs. Our jobs are being taken away. They're going to Mexico. You saw what happened with Carrier, Carrier air conditioner, right? So they get announced -- now, Nabisco is gone. Mexico. Ford, massive $2.5 billion plant in Mexico. Many other countries that's becoming a mini China for ripping off the United States. And I'm not angry at Mexico or the leaders of Mexico. I'm angry at the leaders of the United States for being so stupid to allow this to happen. So the other day and this could be -- I could substitute many many names, but we'll use this one, Carrier air conditioners. I bought many, many over the years. I won't buy them anymore. I'm not buying Carrier anymore. So they announced they're laying off 14 -- and it was done with a cellphone. One of the folks downstairs that was getting fired. They're covering this sort of mid-level guy, and he was nasty. He said essentially, you know, you're all gonna be fired. We're moving to Mexico. Oh wonderful. They've been there for 30 years, in many cases, and now they're gone. Not gonna happen with me. So what happens is this. They move to Mexico. They think they're gonna make air conditioners and they're gonna sell them back to the United States with no tax, with no consequence, with no problem. It's not gonna happen, folks. It's not gonna happen. They want to go there. That's great. But there is going to be consequence. And I've told this before but it's so obvious and it's so -- There are only so many things you can say. But I've told it before and again could apply to hundreds of different companies. I say to my wife, you know, I want to make this call. And she'll say, no, no you must act more presidential. I don't want to really act more presidential until we win. Do we agree, folks? You know, we'll be a little bit less then. You know, more presidential is easier than working, working, working like I do because more presidential means low key and a little bit. My daughter, Ivanka, came up to me in the last debate. Now Dad, you've won every debate. We love Ivanka, right? And we love Melania. We love them all. I have good kids. But my daughter, Ivanka, she said, now Dad, be more presidential. Then my wife says, now be very presidential. I said, wait a minute. I've won every debate. If they hit me, I got to hit them back. They said, no, no you don't. I said, yes I do. Anyway. I was very presidential in that debate and it worked out really well. And you know what, we're doing great. But here's the story. I'm gonna say to my family, I'm sorry. This is too easy. I want to call Carrier. Can you imagine, President of the United States calling for the head of an air conditioning company, all right. But the head of an air conditioning company that didn't do right by us, OK? And while I could give it to somebody, it's just too quick, too easy and I love this stuff. It's like I'm very natural at it. I'm really, really good at it. So here's the conversation and remember, if either -- anyone of these people Ted Cruz, Kasich. They're all controlled by their lobbyist. They're all controlled by special interests. These are not stupid people. Hillary controlled by special interests. When their special interests calls, when their lobbyist calls, when their donors call and they have a stake in a deal. They're not gonna do what's right for you. I didn't take any money. I have turned down -- if I would have accepted money, Jeb Bush had the biggest fund. I think it was $148 million. Can you believe it? $148 million. You might as well throw it right out the window. What -- It's just a waste. And you see what -- by the way, do you see what their consultants make? These consultants they can retire. They made millions and millions of dollars and they lost. But here's the story. I will call or I will speak to or I'll have somebody call, maybe. But I want to do it myself. I will call the head. This is President United States want to speak to the head of Carrier. I'll get him on the phone. I'll say, listen. Congratulations on your move to Mexico. I hope you have many years of good health and happiness and great, great productivity. But here's the story, here's the story. Every single air conditioning unit that you make and you want to send across now very, very powerful border, where by the way, the Border Patrol, 16,5000 people endorsed me last week and they've never done that before. And where Sheriff Joe Arpaio, a great guy, endorsed me last month from Arizona, and there's nobody better or tougher or fairer at the border than he is. So I'm saying every unit that you make and you send across that border, you're gonna pay a 35% tax on that unit. And as sure as you're standing or sitting -- look at you, everybody is standing. You can sit down, but stand. Stand is better. It's more respect. And I'll tell you what's gonna happen. I will get a call the next day from everybody, you know, the lobbyists. They never gave me money. The special interest, they never -- I know these people. I'm not doing anything. I'm working for you, folks. I'm working for you. I don't need this. I'm working for you. We're gonna make America great again. That's what I want to do. What kind of a legacy. Is that the coolest legacy? That's almost as good as owning the Buffalo Bills, right? That's almost. So here's what happens. I'll say, forget them, forget them. Then the head of Carrier is gonna call up and said, Mr. President will you change your mind? I said absolutely not. 100%. I'll be ready to hang up. And they'll say, Mr. President, sir. We're not gonna move. We're not gonna leave the United States. 100%, folks. 100%. Now, I've been watching corporate inversion and I've been watching what's going on with these companies leaving the United States. The politicians don't even know what's happening. It's happening far faster than anybody can even discuss. They ought to do headline banners because there's nothing worse. Not many things worse. I will tell you that. But we've got to stop it. Now the way you stop it is that. I've been watching now for four years politicians negotiating with each other. They're not business people and they're essentially they're all bought. They're bought and paid for by special interests that want to see these things happen. So what's going to happen is they will never ever come to the conclusion and how simple a conclusion. Now when Ford and Carrier and Nabisco -- Nabisco is moving out of Chicago and they're moving where? To Mexico. No more Oreos. No more. So here's the story. Here's the story. 100% if we negotiate tough. Number one we have to work with our companies to keep them where they are. Most importantly, we have to keep them in the United States. Most importantly, let's get them to move to Buffalo, right? We'll get them to move to Buffalo. But we are gonna have and we are gonna attract so much business. We right now have a trade deficit with Mexico of $58 billion a year not including all of the drugs that pour across the border and poison our youth that we're gonna stop when we let our great border patrol people go to work. And when we build the wall, we're gonna stop the drugs from coming to Buffalo and coming to our country and destroying our youth. So the conservatives they would say, like Jeb Bush used to get up, he is not a conservative. Who cares? I am a conservative. But I'm a free trader. But you can only be a free trader, remember this, if you have really smart people representing your interests and we don't. They're either not smart or essentially they're paid off with campaign contributions. And either one of those situations is not acceptable, OK? It's not acceptable. So we are going to have the toughest, the smartest, the sharpest business people in the world negotiating on trade deals. Now let me tell you, the dishonest press, world's most dishonest people. They cover it wrong all the time. It was asked to me about NATO. What do you think about NATO? And it was asked on CNN by Wolf Blitzer. And I said, here's the story. Number one, NATO is obsolete. Number two, the countries in NATO are not paying their fair share. They're not carrying the baggage. They're not paying. We're protecting these and they take advantage of us. And who can blame them for doing so? So I said, you always have to be prepared to walk but we'll never have to walk. They have to pay up, folks. They owe us tremendous amounts of money. Many of these countries are very rich countries. I want them to pay up and I want them to pay up all of the delinquency. All of this stuff in arrears. They owe us the money. We've protected them. They're taking advantage of us because they have no respect for our leaders. They will have respect for us. We're gonna be very soon a $21 trillion. They will have great respect for us. We will have a better, we will have a better relationship than our President Obama has right now and they'll be even. Now, we, as you know, protect Japan. We protect Germany. We protect South Korea. We protect Saudi Arabia. And you know what? We're dying with these deals. These deals are terrible. These a monster monster companies and countries. These are the biggest companies and the biggest countries in terms of economics. Why are we doing this? In South Korea, and I have buildings in South Korea. I have great respect for South Korea and Japan and Germany and Saudi Arabia. But we're protecting them. They've got to pay us, folks. They've got to pay. We can't do this. This isn't from years ago. They have to take care of us. We have to straighten out our country. They have to take care of us. And I want to keep doing it and I want to keep -- I want to keep doing it. I want to keep it going. But you know what? At some point, they're laughing at us. I have friends in Saudi Arabia. I have friends in Germany. I have friends in Japan. I have many friends in South Korea. Every time you order a television set, Samsung, LG. You order it from South Korea they're unbelievably successful countries. They've got to help us out. They've got to help us out. They're gonna pay. If we didn't take care of Saudi Arabia, as an example, they wouldn't be there for six months and nobody has more money and nobody -- before the -- I'll give you an example. Before the oil went down, Saudi Arabia was making $1 billion a day. A billion dollars a day. We're losing a fortune every single month. We lose a fortune. They've got to pay up, folks. They've got to pay up and we want to get along with everybody, OK? They got to pay up. So we're going to have something that's very special. I'm going against the bosses. You know, I used to be a big contributor. I used to be, I guess, one of the bosses in a certain way. I was a member of the establishment. Nobody knows the game better than I do. Believe me. I know the game so well. I can go to lobbyists. They have crews stamped on their forehead. It says crews. I can handle anything. And you give these guys millions of dollars and they go and they produce a vote and the vote very well could be bad for the country, but it's good for the company or the country that they're representing. We can't do that anymore, folks. Because you know when you see some of these horrible deals -- I have a friend who's a very smart guy. And he said to me, I can't believe that they approve this deal, a certain deal. It doesn't matter. Certain deal. I can't believe and a certain senator was in charge of it. I can't believe he's that stupid. I say, he's not stupid at all. He's not stupid. He's smart. What happened is he was contacted by special interests and by lobbyists and he was told to do this. They gave millions of dollars. He was told to do it. And it's very adverse to the country, extremely adverse to the country. But you know what? It's damn good for him because they'll be around for years and years and years, essentially taking care of him. So my friends, I never thought of it that way. It must be. Because there's no way a deal like this could be made. So that's the story. With me folks, those these are not gonna happen, not gonna happen. Now here's the story, here's the story. So important. So important. And we're gonna have -- and by the way, we're gonna have better relationships with all of these rip off countries. You look at China, they're building military fortresses in the South China Sea. You look at what all of these countries are doing and how they take advantage of us. We are going to have tough, smart trade deals, really smart trade deals. You know, if you want to deal in China. They send their stuff to us. No tax, no nothing. If you want to do business in China, it's virtually impossible, number one, to get your product in. And if you do, they tax you. So what are we doing? This is not free trade. This is stupid, stupid, stupid trade. And it's not gonna happen. So here's the story, folks. Tomorrow is a big, big day because the thing I like most are -- I mean, I hope it turns out this way. But we have these massive polls. I don't like massive polls for one reason. People may say, oh, let's stay home. We have a movement going on like they say they have never seen in this country. Time Magazine covers many times, all of the newspapers and as much as the media treats me unfairly, they do admit there's probably never been anything like this. We had 35,000 in Mobile Alabama. We filled up Maverick Stadium in Dallas. We fill up everything. So here's the story. You're gonna leave here and you're gonna say that was a great evening. But more importantly, tomorrow, you're gonna go out and vote and you're gonna make sure all your friends are gonna go and vote. And you're gonna remember, and you're gonna remember, you are going to remember this evening and you're going to remember more importantly tomorrow and the vote. And you're gonna look back in four years and 12 years and 25 years and you're gonna say, that's the greatest single vote I've ever cast. Because from that point on, as soon as we beat Hillary Clinton, we are going to start as a country winning again. We're gonna win on trade. We're gonna win with ISIS. We're gonna knock the hell out of them fast. Gonna knock them. We're gonna rebuild our military. We are going to win with our military. We're going to make our military so strong, so powerful. You're gonna be proud again. The vets have given me such support. The military has giving me such support. What's happening to our military is a disgrace. So we're gonna win with our military. We're never gonna have to use it probably because nobody is gonna mess. We're gonna take care of our vets. We're gonna win on the borders. We're gonna win with health care. We're gonna win with Common Core, ending and bringing it back local. We're gonna take care of our Second Amendment. If we had guns on the other side of the room, in Los Angeles with bullets flying the other way, or if in Paris, the toughest gun laws in the world, if in Paris, they had guns with bullets firing the other way, you wouldn't have had 130 people absolutely decimated and killed and hundreds of people in the hospital. It would have been a whole different story. So we're gonna take care of our Second Amendment. And folks, you're gonna look back and you're gonna see, we're gonna start winning, winning, winning. And this is the last big speech I'm making in New York so I can say it the way we want to say it. We're gonna win at every element of what we're doing. We're gonna win with the military. We're gonna win with everything. We're gonna win so much you'll gonna get tired of winning. You're gonna be saying from Buffalo, please, please, Mr. Bear. We don't want any more business. We're doing too much business. We're making too much money. No matter what you do, we don't want to win anymore. And I'm gonna say, sorry. We're gonna keep winning. We're gonna win, win, win. And we're gonna make America great again. America first, folks. America first. Thank you, Buffalo. Thank you. Thank you, Buffalo. We love you, Buffalo. Thank you."}