{"id":402,"author":"Donald Trump","title":"Speech: Donald Trump in Poughkeepsie, NY","date":"2016-04-17","link":"https://factba.se/transcript/donald-trump-speech-poughkeepsie-ny-april-17-2016","paragraphs":["Wow. Amazing. Wow. Thank you. Thank you. people. It's so great to be back in New York. It's so great. Thank you. This is really some group of people. So we broke the all-time record. That's a pretty good record. Now the ice rink, whatever that is, is filling up and now I heard it's full, and there are thousands of people outside.","Would anybody like to exchange places, right? You've got the right way. Thank you very much. I have my brother Robert here and Anne Marie. Where are they? Where are they? Where is my brother? Where is that guy? And Anne Marie, and you know they have a restaurant so you might as well do a little bit of this Monty's, which is a great restaurant.","Does anybody know Monty's? It's on 333, Route 343, right? So you know what, you better get over there. OK. Now they'll go back there. There'll be limos from Manhattan. Look at all that live television. Did I give them a great free ad? OK. OK. Rob, there you go. All right. Well I just want to thank everybody.","We're having an amazing time. This has been incredible and, you know, a lot of things are going on and we're dealing with democracy. We're dealing with a great country but our country's in big, big, big trouble. And you know what folks? We're not gonna take it anymore. It's not gonna happen. We're not taking it anymore.","Today on Drudge, and Drudge's a great guy, Matt Drudge. One of the great people. And at the top of Drudge, they have a story about China, is very upset with Donald Trump. You all saw that. Because Donald Trump is saying that the trade practices that China participates in are not good and they are taken advantage.","They are folks and boy, did I let -- you have to see my response. You go home, you see my response. I say, \"In the history of the world, this is the single greatest theft I've ever seen.\" We've rebuilt China. We have a five-hundred-billion-dollar trade deficit. And you know what? We're going to start reversing things very very quickly, believe me. I have a feeling that China would like to see me not win.","Do you agree with that? I have a feeling. And you know, we just want fairness. I deal with China. I made a lot of money dealing with China. They're great but the problem is our leaders don't have a clue. They don't know what they're doing whether it's China, Mexico, Japan, Vietnam. No matter where you go, our leaders have no clue.","Our military is being decimated. We can't beat ISIS. Can you imagine what General George -- Look at this. Take a look, General McArthur, right, George Patton, we have these great generals. They're now spinning in their graves, folks. They're looking at this situation. We can't beat ISIS. It's going to be a much different story.","We're going to -- we are going to create a military that's so strong, so powerful that nobody is ever going to mess with us again. Remember that. And, you know, this is not the guy with a happy finger. This is a guy that said, \"Don't go into Iraq.\" We went into Iraq, it was a disastrous decision. Then we got out and we got out the wrong way.","Once we were there we should have left some and we don't have to save the date that we're leaving. We will be leaving Obama. We will be leaving on a certain date. The enemy pulls back and boy, have they done a number ever since we left, so it's very sad. You look at the Iran deal, a horror show, but the other deal we gave them, we just handed them Iraq.","If you think of it. We hand them Iraq, the second largest oil reserves in the world. We gave it to Iran. Iran is doing very, very well because of the United States. I want to tell you, folks, I want to tell you. We're going to become the smart company. It would look as a country -- as a country it's so embarrassing to say but we are going to become the smart country again.","We are going to become this smart country. Now on my way up. I don't want to depress the audience. I love the audience. You know what I did? I get here and I said I'll shake 10, 15 hands.You know, I don't like you too much. I got to speak in front of all my friends, I care for the people I know in this room.","I hope you love my club. You know I have a club in Dutchess, right? Trump National, great. Great club. And Doug is here and Brian's here, they're all here. Great club but I have many clubs up here. I have many things up here but this is a great part of the world. But let me give you the -- let me give you the bad news, I can't believe you people would let this happen but you know it wasn't you -- you do know that.","It's incompetent leaders, incompetent leadership. So before I came up I said, \"Do me a favor. Give me a little stuff on Poughkeepsie and the area.\" And I want to read it and I'm not gonna read all of it because you'll go home crying. OK, but we're gonna bring it back, don't worry. It does -- here's the good news.","The good news is we're gonna bring jobs back from Mexico and all these places that have ripped us off. According to the Federal Reserve the number of manufacturing jobs in the Poughkeepsie region, good region, has declined by 58% since 1990. The three main reasons: NAFTA, which was voted on by Kasich, OK. He voted in favor of NAFTA.","Now, now Kasich is voting in favor. He wants TPP, he's pushing it. As a governor, he's pushing it and I want to tell you that's gonna be worse than NAFTA. That's gonna make NAFTA look like a baby and him and lyin' Ted Cruz, one of the great liars of all time. One of the great liars of all times. They're pushing -- they're pushing Trans-Pacific partnership.","It's a total disaster. It will wipe out New York State and, you know, I've been to many places in New York State, Albany, we're gonna be to Buffalo tomorrow night, it's gonna be incredible. We're gonna have 20,000 people but I've been all over New York. I was here before I don't have to go around, you know, unlike everybody else.","I live here, right? But I mean, I have property in your region, it's not even that. But I'll tell you what, I've taken a look and I watched and I see and these politicians don't have it. They're never going to bring us back. They're never ever going to take us back. I'm self-funding my campaign. In other words, I'm not bought by the special interests and the lobbyists that have these guys totally in their pocket.","I mean, you look at what's going on, take a look at Senator Ted Cruz, lying Ted. You know, he walks in, right? With a Bible held high. It's lying Ted Cruz. He walks in, Bible held high, puts it down, goes over here and he starts lying more than any human being I've ever seen in my life. So you're not gonna vote him.","And remember this lying Ted. He's a possessed, he's a possessed. And you know they're always saying, \" Would you endorse Trump?\" and he goes, \"Well -- \", like this, that you know, like he's tortured. He doesn't have to. I don't care. I want the people. I just want the people. These guys, you know, it's so phony.","Like, do you ever watch political campaigns? All my life I've watched them. I've always been fascinated and they'll be fighting and fighting and saying horrible things about each other, it's vicious. Then one wins, one loses, and they go to make their speech, and the one that loses say, \"I'd like to congratulate.","He's going to be a great governor or senator or president.\" I don't think I'm gonna be doing that, folks, you know. I don't think so. Number one, I don't think we're making any concession speeches, I'll be honest. And you know, we're doing so well, we're leading by millions of votes. We're leading by hundreds of delegates.","I think we're gonna make it without having to, you know, rely on the bosses. You saw what happened in Colorado where people are picketing and going crazy? Well in Colorado, and I said don't waste my money. Here's the nice part. I've spent -- I'm self-funding, right? And maybe because we're busy, but I've spent less money just about the -- practically anybody and I'm in No. 1 position by a lot.","Don't you want that for your president? Don't you want that? I spent less. You know, we went up to New Hampshire. We went to New Hampshire, that was my first big -- I love New Hampshire, we won it. And I spent $2 million and Jeb spent, oh, I don't know, many, many times ever. And I came in first in a landslide and let's not use names but Jeb was -- wow, did he get beaten.","And then I went to South Carolina and all of the bosses came out and they were all like, you know, pushing one guy because the one guy had a lot of contributors, a lot of contributors. I won in a landslide. A total -- Nikki Haley was for him. Everybody was for him. And you know what? Well, she's very weak on -- I tell you what, she's very weak on borders and she's very weak -- very, on illegal immigration and you know what, folks, we're going to have strong borders.","We're going to have strong borders and we're gonna have the wall. Gonna have the wall 100%. Are you ready? Are you ready? Are you ready? Are you ready? You better believe it. You better believe it. So, folks, just because I'm sure you people have never heard of this. I'm sure you've never thought of this.","Who is going to pay for the wall? Who? Hundred percent. Hundred percent. We have, right now, a 58-billion-dollar-a-year trade deficit with Mexico. The walls gonna cost $10 billion. Gonna be a nice wall, gonna be beautiful, gonna be very big, very powerful. Someday they're gonna name that wall after Donald Trump.","Perhaps I have to make it nice. And let me tell you, we're gonna have a big beautiful door in that wall. We're going to have people coming into our country, which we want but they're going to come in legally, legally, OK? And we're gonna bring our country together. You see what. You know my rallies are the safest place on earth because everybody protects everybody.","And you know if you have one person stand up and I -- I'm so disappointed we haven't because if you do the camera, that's the only time -- The only time these very dishonest people -- Look at all the live television, all that live television. The media, I would say, the media lies almost as much as lying Ted but not quite, not quite.","And then of course we have crooked Hillary, crooked Hillary, folks. She's been crooked from the beginning and to think that she has a shot at being our president. Crooked Hillary Clinton, we can't let it happen. You can't let it happen. And Fox just came out with a very good poll. I do great with her, now, I will say this.","I will say this. I saw one of the shows they said I have had, this is hard to believe, I've had 55,000 negative ads, 55,000 this is not -- they will tell you, you know, I have to be a hundred percent. If I'm off by 1% the next day they say, \"Donald Trump exaggerated 55,000 negative ads.\", close to a hundred million dollars and negative, and I'm still doing great and we're gonna beat Hillary so easily.","Now Kasich has had no negative ads, nobody cares, nobody cares. He said, \"I'm doing better against Hillary.\", nobody cares, nobody even knows who he is. No, of course, you do. He's had no negative. Let him have a hundred million dollars of negative ads. You know in Florida, which I won in a landslide, 21 points.","I won Florida by massive and we had so many negative ads that I couldn't even watch and I told the story. Adam Scott, the great golfer from Australia. I own Trump National Doral. We're having the world, the Cadillac World Championship. Adam Scott hit this incredible last shot, flopped it up, put it right next to the pin, sinks the putt, and I'm saying, \"Oh, please don't put on the ads now.","Just get through -- hand him the trophy.\", and they said, \"And now we'll be back in three minutes.\" I say, \"Wait a minute.\" And I have -- I'm surrounded by television sets all over the place and I've been watching in Florida during the race during that, which, oh, boy did we have a big victory there. Don't forget, it doesn't get any bigger than that 21 points, OK. So during -- I'm saying wait a minute.","So now Adam Scott's getting ready and ad after ad, Trump, and by the way, most of these ads are lie, little truth every once in a while, you know, a little bit. But most of these ads are a total lie. We had ad after ad, after ad, and then he got his trophy. I said this can only happen to me, this could only happen to me. But if Kasich -- if Kasich would get a little dose of some ads, he'd sink like a rock, I mean, I say -- they say, I really say it seriously, same thing with lying Ted.","I mean, nobody hits him with negative ads 'cause nobody cares, nobody cares. And let me tell you, the only person that crooked Hillary Clinton does not want to run against is Donald Trump, in fact, the only person. Do you remember -- so two months ago we gave her a little dough she said something about me and I gave her back, and believe me, that was a bad night in the Clinton household for two months and I got no credit.","all of a sudden Bernie started doing well and I'm the one that brought her like this and they gave Bernie the credit. Isn't that terrible? They should have given me the credit. No, no. Look. I know plenty of people. I know people that are working with her. I know people that work with everybody. The one person, Hillary Clinton, and Bill, do not want to run against this Trump, believe me that, believe me. And even the press doesn't admit it and they've done a lot of polling of this and the Fox poll that just came out was fantastic, by the way, but they've done a lot of polling on this and even the press admits and they have to say it will be the biggest voter turnout in the history of United States elections if it's Trump and Clinton.","And that's good for us. It'll be the biggest voted -- everybody says that, and you know we don't vote too much in this country. The percentage is extremely low. This will be Trump versus Clinton will be the biggest voter turnout in the history of our country. Everybody says it, right? Right? You say it. So OK, we're going to go over a couple of these notes and then I'm going to throw them into the audience.","OK, you're ready? So the reasons you're doing badly at NAFTA: Asian currency manipulation. They manipulate their currency to a point they're like Grand Master's. They're brilliant at it, I get it so well. We have -- our politicians don't understand. They're making it impossible for our companies to compete and they're not supposed to be doing it, OK. They're not supposed to be doing it and the Chinese entrance into the World Trade Organization, another disaster, where we let that happen.","All right. TPP, remember, disaster. Don't let it happen. Anybody that wants it, vote them out of office up here. They're going to take the rest of your businesses. OK. Poughkeepsie lost 35% of its manufacturing job since 2001. Poughkeepsie region has seen a 16% decline in the mining and construction jobs.","Ridiculous. And you know who's getting them, other places are getting them, other countries. It's not even in the United States. In the United States, not good, outside of the United States, unacceptable. OK. The workforce in Poughkeepsie -- look these guys are starting to cry, don't worry about it, we're gonna bring it back.","Your jobs are coming back. The workforce in Poughkeepsie region has shrunk by 20,000 jobs since 2008, right. New York State has lost three out of every four manufacturing jobs since 1963 or four. I mean, in theory we should have many more, you know, over the years will pick up jobs, right. We've gone the wrong way, as you all know.","That's why your taxes are so high. That's why your taxes are so high. I mean, I won't even talk about the fact that we could have led the energy revolution, believe me, because you take a look at what's going on in Pennsylvania and then you take a look on the other side of a fictitious line, and it's pretty sad, let me tell you that.","New York State has lost 350,000 manufacturing jobs since '97, a 350,000. I mean it's -- it's honestly it's a disgrace is anybody crying. Are the women crying? Are the men crying? By the way, do the women love Trump? OK. Turn that sign around for those [Inaudible. All right. Thank you, thank you. By the way, they won't show, they never turned the cameras.","The only time they turn the camera's if we have a protester. That's why I love our protesters. Most of them are bought and paid for, you know, we had a protest, a little protest the other night in New York, they had a guy. \"Why are you here?\", \"I don't know. I -- They gave me the sign.\" Oh, you went to somebody else.","Why are you here and why do you dislike Donald Trump?, \"I really don't. I think he's a good guy, actually.\". They didn't -- this is all nonsense, folks. I'm telling you. We are -- we are being led down the drain by people that don't have this country's best interest at heart or they're incompetent, OK. The infrastructure in New York State is considered by all to be a total and complete disaster.","One third of the state's major highways and 45% of its major roads. I know that I hit a lot of potholes, are in very bad condition, poor affair. Now, illegal immigration costs New York taxpayers over $5 billion every year. All right, so that's that's all. We're gonna get it going, folks. We're gonna get -- We're gonna get it going, don't worry.","Hey, is that a depressing report? I hate to read it. In fact, we have most of your -- Where's Sheriff Butch? Where's Sheriff? Where is he? Where's Butch? One of the toughest guys. You don't want to be a criminal in this area, that I want to tell you. Butch, Butch will take care of business, right? But -- and it's great that he's here and so many law enforcement, and by the way, law enforcement has to be given far more respect, these are great people, and we don't give them proper respect, and we have to. They have done an amazing job.","I didn't ask him to come up. I just said where -- Butch, say something.","See, that shows -- that shows how aggressive Butch is. I said, \"Where's Butch in the audience, raise your hand\" He walks on this stage, that's an aggressive person. That's what we need, we need a little more aggression in this country. So here's the story, folks, we're going through, we're winning by a lot we have a very, very big vote coming up on Tuesday.","That vote is so vital and we have to win by big numbers because we have a system that's absolutely rigged. It's rigged. We have a rigged system.Thank you. thank you. Don't pay. I think he's on our side, actually. You know a lot of times I'll hear somebody screaming during what I'm saying and I'll think there are protests and they're actually on my side so leave 'em alone.","So look, you have a system that's rigged, we have a system that's crooked, we have a system that's got a lot of problems and we have a system that doesn't allow the people to vote in many cases and if they do vote their vote isn't really representative of what it should be. We have this delegate system, which is a sham.","So in Colorado the people are going crazy out there because they never got a chance to vote. Everywhere you see with the dishonest media they'd say, \"Well, we never change anything.\". Well, that's wrong because I was going to win Colorado with the people, which is the only thing that matters and I announced on June 16th and in August they changed, they changed it so the people no longer vote because they saw who's going to vote.","Same thing happened in Florida but it was a reversal, they didn't know what was going on. I was going to run and I announced I was going to run and so was Jeb Bush and so was Marco, the senator, you have the governor of the Senate, right? And everybody assumed that easily win Florida. So they changed the system and they made it in all -- in other words, you get all the delegates if you enter.","You win by one vote you get all the delegates. So they said, \"All right, this is a good way of taking advantage of Trump.\", so they made it so that whoever wins gets all of the delegates a big win, Florida, like second biggest, I think, you have to California, which, by the way, a new poll just came out in California 20 minutes ago, CBS 49% for Trump, believe that?","Forty nine. And that's what the other guys and we're winning in California, we're winning everywhere, we're winning everywhere but you got to go vote. So in Florida, what happened is, they changed it so that winner-take-all, winner-take-all So they figured Jeb or Marco. There's only one problem, about two weeks after they changed it a poll came out and it said, \"Trump is gonna kill everybody.\", and then we ended up winning by 20 or 21 points they made a bad calculation, right.","They've been. But anywhere you have a situation where we're voting, that's where I do well. Where the bosses are in, I could do better with the bosses than anybody, believe me. I deal with bosses, I've dealt with the bosses all my life. I've done very well politically, I just don't want to. I could have gone out to Colorado.","I'm sure I could have met the head guy. I'm sure I could have wined him and dined him to take her to Mar-a-Lago and put them on private plane sent them all over the place, which is legal but that's not democracy, you know you're allowed, essentially, to pay off these people. You're allowed to pay off these delegates.","And again, we want to be smart we want to be fair and it shouldn't be allowed. So in Colorado I said, \"Don't play the game.\" Let's keep it so that -- I love it. I love spending the least having the best result that we're killing everybody. So here's the story. So they go out and they're wining and dining out, you have no idea what's going on with those delegates.","It's a crooked process ,folks. OK. It's a dishonest process. That has nothing to do with democracy. The fact that you're taking all these people out and wining them and dining them. Nobody does that stuff better than me. I just don't want to do it, I just don't want to do it. And now you have Wyoming, it just came out, not a lot of delegates but it would be easy.","I'll go, I'll fly to Wyoming. I'll meet the chairman. I guarantee you within 10 minutes he's my best friend. He dropped a guy like Cruz in about two seconds. OK. But I just don't want to do it because it's not the right thing to do. We have a bad system and the system has to change, has to change. So -- and we've been getting a lot of good press on it. I mean a lot of good press, and what's happening is we're now starting really the final drive, and we have New York, where we're doing great.","We're having Pennsylvania, where we're doing great. Maryland, we're doing so great in so many places. Now, you know that Massachusetts we got almost 50% but it helps that Tom Brady likes me. Do we agree? That was one -- It does help, the Tom Brady look. But we've done great. And you know it's funny, I watch this guy -- I have to, I feel I'm talking to friends here.","This is like a friendly crowd. Well I'll give you -- I'll give you an example. OK. I'll give you an example. A friendly crowd, although my hand is So backstage my brother calls and a couple of other, \"Do you mind shaking hands with maybe five or ten people and taking pictures?\", \"No problem.\". I get here there had to be 250 people.","I was there for, you know, an hour. So let's go New York. OK. That's called aggression. That's called aggression, including my brother, including Anne Marie. I get there I said, \"Wait a minute, wait a minute. I don't want that. Look. Look how long that line.\" You have no idea, I'm telling you. I've been back there for an hour doing this stuff and then they said, \"No signatures.\" We have to run them by, every single person, \"Please, would you sign this.\" OK. \"Please, would you -- \" How -- what am I going to do? I have to sign it or they won't vote for me and now I'm a politician, can you believe it? So we're gonna straighten things out, we're gonna bring jobs back, we're gonna bring jobs back to our country.","We're gonna bring jobs back to New York. New York State is, right now, a total and complete disaster. We're losing our manufacturing. We're losing our jobs, we're losing our economy. People are forced to leave and you don't want to leave and you have your house and your house is worth less now than it was 15 years ago, and you know, we -- I know all the problems.","We're gonna change that, we're going to turn it around, we're gonna turn it around very fast, you're gonna be amazed how fast it's gonna go. You're gonna be amazed how fast it goes. And you're gonna look at that statement that I wrote. I was so honored when China, the head of finance for China said, about Donald Trump, OK. I was on it because now maybe people didn't start looking I don't even think our leaders know that China's ripping us off, OK. I don't even think they know and you're gonna go home you're gonna look at my answer.","I think you're gonna say finally, finally. That's what we need, finally. But it's not just China, it's Japan, what they do with currency is unbelievable. The devaluations, it's Mexico, it's Vietnam, it's any country you can think of. Any country, any country. So we're gonna bring it back. So here's the story, folks.","In two days, meaning Tuesday, you're gonna go, you're gonna vote, you're gonna get all your friends, get all those friends. You're gonna vote and we've got to really create a mandate. You know, I've been on the cover of Time magazine many, many times over the last short period of time and they're talking about what's happening here.","They actually say this. This isn't me because I have all this live television. If I say it, they're gonna say, \"He didn't say.\", they're saying, \"What's happened has perhaps never happened in the history of our country. OK. This is really something special. This is a movement, they actually call it a movement.","This is not just in Poughkeepsie. This is not just in Poughkeepsie, folks. I go to Dallas we had 21,000 people, we filled up the Mavericks arena. I go to Mobile, Alabama, 35,000 people. No matter where we go, we have thousands. Tampa, 25,000, Orlando 25,000. Here, you have here and your ice rink. And I'm going into the ice rink in a couple of minutes, so I got to see those people, right?","Should I? Should I? Yeah, yeah. I got to see it. OK. They came out and they said this has never been anything like this, I mean, this building is not exactly new and they said there's never been anything like this, where this room is packed and that room is packed. and it's just one of those things. It's a movement.","And you know what it is? It's a movement for common sense it's a movement for jobs. It's a movement for a strong military and taking care of our vets. It's a movement for strong borders and no drugs pouring in and poisoning our youth, where you have a huge problem. It's a movement for the wall, which we're going to have, and by the way, Mexico is in fact going to pay for it. You know when I'm on the stage I'm in the debates with these guys and they talk about the wall and they come -- one of them came up to me after the debate.","You know Mexico's not gonna pay for the wall, I said, \"What are you talking about? What are you talking about?\", a hundred -- by the way, you're there, right? A hundred percent, and then I said, \"We have a 58-billion-dollar trade deficit and the wall costs $10 billion and you tell me I can't pull that deal off, that will be so easy.","But these politicians don't know and even if they do know. Even if they do know, they're not going to do it because they're controlled by their special interests and they're never going to go against their special in -- If I would have raised money for this campaign, Jeb Bush had a hundred and forty eight million, probably much more than that by the time it ended but toward the middle it looked like a 148 million.","By the way, that did him a lot of good, right? Bye-bye. But he had a 148. If I would have raised money for one of these crummy PACs I think they're a total disaster. By the way, by the way, they're absolutely ashamed. They're absolutely ashamed, they're a disgrace to democracy. Remember I said it. That's me talking.","And then they say, \"Well we don't talk to our PAC.\" They're best friends are running the PAC. They say we don't talk well. What about the golf match you played last week with the gov -- but we didn't discuss the commercials that we were -- Folks, folks, let me tell you, we're in the world, OK. These PACs are a disgrace.","They're a disgrace. And you can do something you can show do whatever you want to do but what's going on in politics today is a disgrace whether it's the superdelegates, you know, and I'm no fan of Bernie Sanders. Believe me, I think he's terrible. I don't like him. I don't think he's good. I think he's terrible.","I refuse to vote for a communist. OK, but let me tell you -- let me tell you in all fairness -- but in all fairness to Bernie Sanders he goes out and every week it's Bernie Sanders wins, Bernie Sanders wins, Bernie Sanders wins like what is it, nine or 11 in a row. Bernie Sanders win and then I listened to the dishonest media and they're around a table and they said, \"Well he's won like 10 out of 11.\", and they say, \"Well, but he can't win, it's over.\". That's what it is. It's a -- it's a corrupt system because in all fairness, Bernie Sanders should be able to win and they all say he can't win because it's -- they don't say this, I say this because it's a fixed system.","It's a corrupt system that's run by the bosses. And you know what? The Republican side is worse because it's less obvious and yet it's just as bad. It's far less obvious but it's just as bad the political pros that taken the money they're the ones that call the shots. Here's what they didn't count on: They didn't count on Trump getting millions and millions of votes, that's what they didn't count on. I mean, we have a guy named Ricketts.","I never even heard him, I don't know him, I never saw him. He owns the Chicago Cubs. He's a big enemy of mine and I never met this guy, I never met this guy and I used to like the Chicago Cubs. I don't like them at all anymore, folks. They're gonna fail, they're gonna fail. Because you know what? When we put the kibosh on something it always fails.","But here's a guy giving millions of dollars to fight me. We have other guys, I've never even heard of them. Now number one, they want to be, you know, they want to be famous. They're rich but they're not famous, OK. And they would give everything they want to be famous. But Ricketts owns the Chicago. I said, \"Who we're doing this?\", \"Guy named Ricketts.","Did you ever hear of him?\", \"No. Who is he?\", \"He owns the Chicago Cubs.\", \"Oh, yeah, I see. OK. Good.\" Now I'm rooting against the Chicago Cubs and I have real estate there but I'm rooting against the Chicago Cubs. But -- oh, he'll go crazy. Now -- so I can't believe they mentioned my name, this is bad, oh, oh. His PR people say, \"You have to stay out of the news.\" Let him take a little heat, let that guy take -- and by the way, here's the beauty, I was supposed to not win Illinois, Chicago, Illinois.","I was not supposed to not win Illinois. He spent a lot of money, that family, Ricketts family, against Trump. I won in a landslide, folks. I won in a landslide. So I just wanna leave by saying the following: \"We don't win anymore, but we're gonna start winning again big.\" You're gonna go home and you're gonna remember this evening but more importantly, you're gonna go home, you're gonna rest up on Monday.","Make as many calls as you can to get everybody out and go and give us a big mandate a big, big mandate for the movement. OK. Remember, they call it a phenomena. There's never been anything like this. Give us a big mandate for the movement because the movement's about common sense. It's about being the smart people and it's about winning.","So we don't win anymore. But we're going to start winning. We're going to win with our military. We're going to knock the hell out of ISIS. We're going to win for our vets, our great veterans, who are being treated horribly in many cases. They're being treated far worse than illegal immigrants who come over to this country.","We're going to win for our vets. We're going to win at trade. We're gonna have the best trade deals, Carl Icahn. Some of the greatest business people in the world have endorsed me. We're going to use our smartest and our best. We're not using political hacks anymore. That's the people that do these deals.","They're political hacks that know nothing about business. They know nothing about -- like -- like Secretary Kerry, he's a political hack. The deal he made with Iran is one of the worst deals I've ever seen in my life. So we're gonna have our best people, we're gonna have -- we have the greatest people in the world.","We have the greatest business people in the world. They don't want money. They want to do it. They want to see our country be great again and they're endorsing me and they love me and we'll start off with Carl Icahn, OK. So we're gonna take our trade and we're gonna reverse it and we're gonna stop companies like Mexico.","These countries like Mexico and others from stealing our businesses, stealing our jobs, stealing our money it's going to be reversed. When Carrier just announced, when they moved over, when they just announced and they're moving to Mexico and they'll sell their product in the United States, no tax, no nothing, nope, not with me. They're gonna pay a 35% tax for every single air-conditioning unit they make.","And let me tell you, you know what they're gonna do? I'll be called but they didn't give me any money. Nobody gave me anything I'm representing you. I'm not representing lobbyists and special interest. So here's what's gonna happen, I'll be called, I won't even take their call I couldn't care less. Now I'm doing this to represent you -- I didn't need this, folks, I didn't need to, believe me. You don't think this is work?","You don't think this is work, but here's what we're going to do, we're gonna charge them at 35 and here's what's gonna happen, I won't be called. You know my wife said, \"Please, please.\" You --"],"text":" Wow. Amazing. Wow. Thank you. Thank you. people. It's so great to be back in New York. It's so great. Thank you. This is really some group of people. So we broke the all-time record. That's a pretty good record. Now the ice rink, whatever that is, is filling up and now I heard it's full, and there are thousands of people outside. Would anybody like to exchange places, right? You've got the right way. Thank you very much. I have my brother Robert here and Anne Marie. Where are they? Where are they? Where is my brother? Where is that guy? And Anne Marie, and you know they have a restaurant so you might as well do a little bit of this Monty's, which is a great restaurant. Does anybody know Monty's? It's on 333, Route 343, right? So you know what, you better get over there. OK. Now they'll go back there. There'll be limos from Manhattan. Look at all that live television. Did I give them a great free ad? OK. OK. Rob, there you go. All right. Well I just want to thank everybody. We're having an amazing time. This has been incredible and, you know, a lot of things are going on and we're dealing with democracy. We're dealing with a great country but our country's in big, big, big trouble. And you know what folks? We're not gonna take it anymore. It's not gonna happen. We're not taking it anymore. Today on Drudge, and Drudge's a great guy, Matt Drudge. One of the great people. And at the top of Drudge, they have a story about China, is very upset with Donald Trump. You all saw that. Because Donald Trump is saying that the trade practices that China participates in are not good and they are taken advantage. They are folks and boy, did I let -- you have to see my response. You go home, you see my response. I say, \"In the history of the world, this is the single greatest theft I've ever seen.\" We've rebuilt China. We have a five-hundred-billion-dollar trade deficit. And you know what? We're going to start reversing things very very quickly, believe me. I have a feeling that China would like to see me not win. Do you agree with that? I have a feeling. And you know, we just want fairness. I deal with China. I made a lot of money dealing with China. They're great but the problem is our leaders don't have a clue. They don't know what they're doing whether it's China, Mexico, Japan, Vietnam. No matter where you go, our leaders have no clue. Our military is being decimated. We can't beat ISIS. Can you imagine what General George -- Look at this. Take a look, General McArthur, right, George Patton, we have these great generals. They're now spinning in their graves, folks. They're looking at this situation. We can't beat ISIS. It's going to be a much different story. We're going to -- we are going to create a military that's so strong, so powerful that nobody is ever going to mess with us again. Remember that. And, you know, this is not the guy with a happy finger. This is a guy that said, \"Don't go into Iraq.\" We went into Iraq, it was a disastrous decision. Then we got out and we got out the wrong way. Once we were there we should have left some and we don't have to save the date that we're leaving. We will be leaving Obama. We will be leaving on a certain date. The enemy pulls back and boy, have they done a number ever since we left, so it's very sad. You look at the Iran deal, a horror show, but the other deal we gave them, we just handed them Iraq. If you think of it. We hand them Iraq, the second largest oil reserves in the world. We gave it to Iran. Iran is doing very, very well because of the United States. I want to tell you, folks, I want to tell you. We're going to become the smart company. It would look as a country -- as a country it's so embarrassing to say but we are going to become the smart country again. We are going to become this smart country. Now on my way up. I don't want to depress the audience. I love the audience. You know what I did? I get here and I said I'll shake 10, 15 hands.You know, I don't like you too much. I got to speak in front of all my friends, I care for the people I know in this room. I hope you love my club. You know I have a club in Dutchess, right? Trump National, great. Great club. And Doug is here and Brian's here, they're all here. Great club but I have many clubs up here. I have many things up here but this is a great part of the world. But let me give you the -- let me give you the bad news, I can't believe you people would let this happen but you know it wasn't you -- you do know that. It's incompetent leaders, incompetent leadership. So before I came up I said, \"Do me a favor. Give me a little stuff on Poughkeepsie and the area.\" And I want to read it and I'm not gonna read all of it because you'll go home crying. OK, but we're gonna bring it back, don't worry. It does -- here's the good news. The good news is we're gonna bring jobs back from Mexico and all these places that have ripped us off. According to the Federal Reserve the number of manufacturing jobs in the Poughkeepsie region, good region, has declined by 58% since 1990. The three main reasons: NAFTA, which was voted on by Kasich, OK. He voted in favor of NAFTA. Now, now Kasich is voting in favor. He wants TPP, he's pushing it. As a governor, he's pushing it and I want to tell you that's gonna be worse than NAFTA. That's gonna make NAFTA look like a baby and him and lyin' Ted Cruz, one of the great liars of all time. One of the great liars of all times. They're pushing -- they're pushing Trans-Pacific partnership. It's a total disaster. It will wipe out New York State and, you know, I've been to many places in New York State, Albany, we're gonna be to Buffalo tomorrow night, it's gonna be incredible. We're gonna have 20,000 people but I've been all over New York. I was here before I don't have to go around, you know, unlike everybody else. I live here, right? But I mean, I have property in your region, it's not even that. But I'll tell you what, I've taken a look and I watched and I see and these politicians don't have it. They're never going to bring us back. They're never ever going to take us back. I'm self-funding my campaign. In other words, I'm not bought by the special interests and the lobbyists that have these guys totally in their pocket. I mean, you look at what's going on, take a look at Senator Ted Cruz, lying Ted. You know, he walks in, right? With a Bible held high. It's lying Ted Cruz. He walks in, Bible held high, puts it down, goes over here and he starts lying more than any human being I've ever seen in my life. So you're not gonna vote him. And remember this lying Ted. He's a possessed, he's a possessed. And you know they're always saying, \" Would you endorse Trump?\" and he goes, \"Well -- \", like this, that you know, like he's tortured. He doesn't have to. I don't care. I want the people. I just want the people. These guys, you know, it's so phony. Like, do you ever watch political campaigns? All my life I've watched them. I've always been fascinated and they'll be fighting and fighting and saying horrible things about each other, it's vicious. Then one wins, one loses, and they go to make their speech, and the one that loses say, \"I'd like to congratulate. He's going to be a great governor or senator or president.\" I don't think I'm gonna be doing that, folks, you know. I don't think so. Number one, I don't think we're making any concession speeches, I'll be honest. And you know, we're doing so well, we're leading by millions of votes. We're leading by hundreds of delegates. I think we're gonna make it without having to, you know, rely on the bosses. You saw what happened in Colorado where people are picketing and going crazy? Well in Colorado, and I said don't waste my money. Here's the nice part. I've spent -- I'm self-funding, right? And maybe because we're busy, but I've spent less money just about the -- practically anybody and I'm in No. 1 position by a lot. Don't you want that for your president? Don't you want that? I spent less. You know, we went up to New Hampshire. We went to New Hampshire, that was my first big -- I love New Hampshire, we won it. And I spent $2 million and Jeb spent, oh, I don't know, many, many times ever. And I came in first in a landslide and let's not use names but Jeb was -- wow, did he get beaten. And then I went to South Carolina and all of the bosses came out and they were all like, you know, pushing one guy because the one guy had a lot of contributors, a lot of contributors. I won in a landslide. A total -- Nikki Haley was for him. Everybody was for him. And you know what? Well, she's very weak on -- I tell you what, she's very weak on borders and she's very weak -- very, on illegal immigration and you know what, folks, we're going to have strong borders. We're going to have strong borders and we're gonna have the wall. Gonna have the wall 100%. Are you ready? Are you ready? Are you ready? Are you ready? You better believe it. You better believe it. So, folks, just because I'm sure you people have never heard of this. I'm sure you've never thought of this. Who is going to pay for the wall? Who? Hundred percent. Hundred percent. We have, right now, a 58-billion-dollar-a-year trade deficit with Mexico. The walls gonna cost $10 billion. Gonna be a nice wall, gonna be beautiful, gonna be very big, very powerful. Someday they're gonna name that wall after Donald Trump. Perhaps I have to make it nice. And let me tell you, we're gonna have a big beautiful door in that wall. We're going to have people coming into our country, which we want but they're going to come in legally, legally, OK? And we're gonna bring our country together. You see what. You know my rallies are the safest place on earth because everybody protects everybody. And you know if you have one person stand up and I -- I'm so disappointed we haven't because if you do the camera, that's the only time -- The only time these very dishonest people -- Look at all the live television, all that live television. The media, I would say, the media lies almost as much as lying Ted but not quite, not quite. And then of course we have crooked Hillary, crooked Hillary, folks. She's been crooked from the beginning and to think that she has a shot at being our president. Crooked Hillary Clinton, we can't let it happen. You can't let it happen. And Fox just came out with a very good poll. I do great with her, now, I will say this. I will say this. I saw one of the shows they said I have had, this is hard to believe, I've had 55,000 negative ads, 55,000 this is not -- they will tell you, you know, I have to be a hundred percent. If I'm off by 1% the next day they say, \"Donald Trump exaggerated 55,000 negative ads.\", close to a hundred million dollars and negative, and I'm still doing great and we're gonna beat Hillary so easily. Now Kasich has had no negative ads, nobody cares, nobody cares. He said, \"I'm doing better against Hillary.\", nobody cares, nobody even knows who he is. No, of course, you do. He's had no negative. Let him have a hundred million dollars of negative ads. You know in Florida, which I won in a landslide, 21 points. I won Florida by massive and we had so many negative ads that I couldn't even watch and I told the story. Adam Scott, the great golfer from Australia. I own Trump National Doral. We're having the world, the Cadillac World Championship. Adam Scott hit this incredible last shot, flopped it up, put it right next to the pin, sinks the putt, and I'm saying, \"Oh, please don't put on the ads now. Just get through -- hand him the trophy.\", and they said, \"And now we'll be back in three minutes.\" I say, \"Wait a minute.\" And I have -- I'm surrounded by television sets all over the place and I've been watching in Florida during the race during that, which, oh, boy did we have a big victory there. Don't forget, it doesn't get any bigger than that 21 points, OK. So during -- I'm saying wait a minute. So now Adam Scott's getting ready and ad after ad, Trump, and by the way, most of these ads are lie, little truth every once in a while, you know, a little bit. But most of these ads are a total lie. We had ad after ad, after ad, and then he got his trophy. I said this can only happen to me, this could only happen to me. But if Kasich -- if Kasich would get a little dose of some ads, he'd sink like a rock, I mean, I say -- they say, I really say it seriously, same thing with lying Ted. I mean, nobody hits him with negative ads 'cause nobody cares, nobody cares. And let me tell you, the only person that crooked Hillary Clinton does not want to run against is Donald Trump, in fact, the only person. Do you remember -- so two months ago we gave her a little dough she said something about me and I gave her back, and believe me, that was a bad night in the Clinton household for two months and I got no credit. all of a sudden Bernie started doing well and I'm the one that brought her like this and they gave Bernie the credit. Isn't that terrible? They should have given me the credit. No, no. Look. I know plenty of people. I know people that are working with her. I know people that work with everybody. The one person, Hillary Clinton, and Bill, do not want to run against this Trump, believe me that, believe me. And even the press doesn't admit it and they've done a lot of polling of this and the Fox poll that just came out was fantastic, by the way, but they've done a lot of polling on this and even the press admits and they have to say it will be the biggest voter turnout in the history of United States elections if it's Trump and Clinton. And that's good for us. It'll be the biggest voted -- everybody says that, and you know we don't vote too much in this country. The percentage is extremely low. This will be Trump versus Clinton will be the biggest voter turnout in the history of our country. Everybody says it, right? Right? You say it. So OK, we're going to go over a couple of these notes and then I'm going to throw them into the audience. OK, you're ready? So the reasons you're doing badly at NAFTA: Asian currency manipulation. They manipulate their currency to a point they're like Grand Master's. They're brilliant at it, I get it so well. We have -- our politicians don't understand. They're making it impossible for our companies to compete and they're not supposed to be doing it, OK. They're not supposed to be doing it and the Chinese entrance into the World Trade Organization, another disaster, where we let that happen. All right. TPP, remember, disaster. Don't let it happen. Anybody that wants it, vote them out of office up here. They're going to take the rest of your businesses. OK. Poughkeepsie lost 35% of its manufacturing job since 2001. Poughkeepsie region has seen a 16% decline in the mining and construction jobs. Ridiculous. And you know who's getting them, other places are getting them, other countries. It's not even in the United States. In the United States, not good, outside of the United States, unacceptable. OK. The workforce in Poughkeepsie -- look these guys are starting to cry, don't worry about it, we're gonna bring it back. Your jobs are coming back. The workforce in Poughkeepsie region has shrunk by 20,000 jobs since 2008, right. New York State has lost three out of every four manufacturing jobs since 1963 or four. I mean, in theory we should have many more, you know, over the years will pick up jobs, right. We've gone the wrong way, as you all know. That's why your taxes are so high. That's why your taxes are so high. I mean, I won't even talk about the fact that we could have led the energy revolution, believe me, because you take a look at what's going on in Pennsylvania and then you take a look on the other side of a fictitious line, and it's pretty sad, let me tell you that. New York State has lost 350,000 manufacturing jobs since '97, a 350,000. I mean it's -- it's honestly it's a disgrace is anybody crying. Are the women crying? Are the men crying? By the way, do the women love Trump? OK. Turn that sign around for those We're gonna get it going, folks. We're gonna get -- We're gonna get it going, don't worry. Hey, is that a depressing report? I hate to read it. In fact, we have most of your -- Where's Sheriff Butch? Where's Sheriff? Where is he? Where's Butch? One of the toughest guys. You don't want to be a criminal in this area, that I want to tell you. Butch, Butch will take care of business, right? But -- and it's great that he's here and so many law enforcement, and by the way, law enforcement has to be given far more respect, these are great people, and we don't give them proper respect, and we have to. They have done an amazing job. I didn't ask him to come up. I just said where -- Butch, say something. They already heard me. What about this guy, ladies and gentlemen. Hey, No. 1. See, that shows -- that shows how aggressive Butch is. I said, \"Where's Butch in the audience, raise your hand\" He walks on this stage, that's an aggressive person. That's what we need, we need a little more aggression in this country. So here's the story, folks, we're going through, we're winning by a lot we have a very, very big vote coming up on Tuesday. That vote is so vital and we have to win by big numbers because we have a system that's absolutely rigged. It's rigged. We have a rigged system.Thank you. thank you. Don't pay. I think he's on our side, actually. You know a lot of times I'll hear somebody screaming during what I'm saying and I'll think there are protests and they're actually on my side so leave 'em alone. So look, you have a system that's rigged, we have a system that's crooked, we have a system that's got a lot of problems and we have a system that doesn't allow the people to vote in many cases and if they do vote their vote isn't really representative of what it should be. We have this delegate system, which is a sham. So in Colorado the people are going crazy out there because they never got a chance to vote. Everywhere you see with the dishonest media they'd say, \"Well, we never change anything.\". Well, that's wrong because I was going to win Colorado with the people, which is the only thing that matters and I announced on June 16th and in August they changed, they changed it so the people no longer vote because they saw who's going to vote. Same thing happened in Florida but it was a reversal, they didn't know what was going on. I was going to run and I announced I was going to run and so was Jeb Bush and so was Marco, the senator, you have the governor of the Senate, right? And everybody assumed that easily win Florida. So they changed the system and they made it in all -- in other words, you get all the delegates if you enter. You win by one vote you get all the delegates. So they said, \"All right, this is a good way of taking advantage of Trump.\", so they made it so that whoever wins gets all of the delegates a big win, Florida, like second biggest, I think, you have to California, which, by the way, a new poll just came out in California 20 minutes ago, CBS 49% for Trump, believe that? Forty nine. And that's what the other guys and we're winning in California, we're winning everywhere, we're winning everywhere but you got to go vote. So in Florida, what happened is, they changed it so that winner-take-all, winner-take-all So they figured Jeb or Marco. There's only one problem, about two weeks after they changed it a poll came out and it said, \"Trump is gonna kill everybody.\", and then we ended up winning by 20 or 21 points they made a bad calculation, right. They've been. But anywhere you have a situation where we're voting, that's where I do well. Where the bosses are in, I could do better with the bosses than anybody, believe me. I deal with bosses, I've dealt with the bosses all my life. I've done very well politically, I just don't want to. I could have gone out to Colorado. I'm sure I could have met the head guy. I'm sure I could have wined him and dined him to take her to Mar-a-Lago and put them on private plane sent them all over the place, which is legal but that's not democracy, you know you're allowed, essentially, to pay off these people. You're allowed to pay off these delegates. And again, we want to be smart we want to be fair and it shouldn't be allowed. So in Colorado I said, \"Don't play the game.\" Let's keep it so that -- I love it. I love spending the least having the best result that we're killing everybody. So here's the story. So they go out and they're wining and dining out, you have no idea what's going on with those delegates. It's a crooked process ,folks. OK. It's a dishonest process. That has nothing to do with democracy. The fact that you're taking all these people out and wining them and dining them. Nobody does that stuff better than me. I just don't want to do it, I just don't want to do it. And now you have Wyoming, it just came out, not a lot of delegates but it would be easy. I'll go, I'll fly to Wyoming. I'll meet the chairman. I guarantee you within 10 minutes he's my best friend. He dropped a guy like Cruz in about two seconds. OK. But I just don't want to do it because it's not the right thing to do. We have a bad system and the system has to change, has to change. So -- and we've been getting a lot of good press on it. I mean a lot of good press, and what's happening is we're now starting really the final drive, and we have New York, where we're doing great. We're having Pennsylvania, where we're doing great. Maryland, we're doing so great in so many places. Now, you know that Massachusetts we got almost 50% but it helps that Tom Brady likes me. Do we agree? That was one -- It does help, the Tom Brady look. But we've done great. And you know it's funny, I watch this guy -- I have to, I feel I'm talking to friends here. This is like a friendly crowd. Well I'll give you -- I'll give you an example. OK. I'll give you an example. A friendly crowd, although my hand is So backstage my brother calls and a couple of other, \"Do you mind shaking hands with maybe five or ten people and taking pictures?\", \"No problem.\". I get here there had to be 250 people. I was there for, you know, an hour. So let's go New York. OK. That's called aggression. That's called aggression, including my brother, including Anne Marie. I get there I said, \"Wait a minute, wait a minute. I don't want that. Look. Look how long that line.\" You have no idea, I'm telling you. I've been back there for an hour doing this stuff and then they said, \"No signatures.\" We have to run them by, every single person, \"Please, would you sign this.\" OK. \"Please, would you -- \" How -- what am I going to do? I have to sign it or they won't vote for me and now I'm a politician, can you believe it? So we're gonna straighten things out, we're gonna bring jobs back, we're gonna bring jobs back to our country. We're gonna bring jobs back to New York. New York State is, right now, a total and complete disaster. We're losing our manufacturing. We're losing our jobs, we're losing our economy. People are forced to leave and you don't want to leave and you have your house and your house is worth less now than it was 15 years ago, and you know, we -- I know all the problems. We're gonna change that, we're going to turn it around, we're gonna turn it around very fast, you're gonna be amazed how fast it's gonna go. You're gonna be amazed how fast it goes. And you're gonna look at that statement that I wrote. I was so honored when China, the head of finance for China said, about Donald Trump, OK. I was on it because now maybe people didn't start looking I don't even think our leaders know that China's ripping us off, OK. I don't even think they know and you're gonna go home you're gonna look at my answer. I think you're gonna say finally, finally. That's what we need, finally. But it's not just China, it's Japan, what they do with currency is unbelievable. The devaluations, it's Mexico, it's Vietnam, it's any country you can think of. Any country, any country. So we're gonna bring it back. So here's the story, folks. In two days, meaning Tuesday, you're gonna go, you're gonna vote, you're gonna get all your friends, get all those friends. You're gonna vote and we've got to really create a mandate. You know, I've been on the cover of Time magazine many, many times over the last short period of time and they're talking about what's happening here. They actually say this. This isn't me because I have all this live television. If I say it, they're gonna say, \"He didn't say.\", they're saying, \"What's happened has perhaps never happened in the history of our country. OK. This is really something special. This is a movement, they actually call it a movement. This is not just in Poughkeepsie. This is not just in Poughkeepsie, folks. I go to Dallas we had 21,000 people, we filled up the Mavericks arena. I go to Mobile, Alabama, 35,000 people. No matter where we go, we have thousands. Tampa, 25,000, Orlando 25,000. Here, you have here and your ice rink. And I'm going into the ice rink in a couple of minutes, so I got to see those people, right? Should I? Should I? Yeah, yeah. I got to see it. OK. They came out and they said this has never been anything like this, I mean, this building is not exactly new and they said there's never been anything like this, where this room is packed and that room is packed. and it's just one of those things. It's a movement. And you know what it is? It's a movement for common sense it's a movement for jobs. It's a movement for a strong military and taking care of our vets. It's a movement for strong borders and no drugs pouring in and poisoning our youth, where you have a huge problem. It's a movement for the wall, which we're going to have, and by the way, Mexico is in fact going to pay for it. You know when I'm on the stage I'm in the debates with these guys and they talk about the wall and they come -- one of them came up to me after the debate. You know Mexico's not gonna pay for the wall, I said, \"What are you talking about? What are you talking about?\", a hundred -- by the way, you're there, right? A hundred percent, and then I said, \"We have a 58-billion-dollar trade deficit and the wall costs $10 billion and you tell me I can't pull that deal off, that will be so easy. But these politicians don't know and even if they do know. Even if they do know, they're not going to do it because they're controlled by their special interests and they're never going to go against their special in -- If I would have raised money for this campaign, Jeb Bush had a hundred and forty eight million, probably much more than that by the time it ended but toward the middle it looked like a 148 million. By the way, that did him a lot of good, right? Bye-bye. But he had a 148. If I would have raised money for one of these crummy PACs I think they're a total disaster. By the way, by the way, they're absolutely ashamed. They're absolutely ashamed, they're a disgrace to democracy. Remember I said it. That's me talking. And then they say, \"Well we don't talk to our PAC.\" They're best friends are running the PAC. They say we don't talk well. What about the golf match you played last week with the gov -- but we didn't discuss the commercials that we were -- Folks, folks, let me tell you, we're in the world, OK. These PACs are a disgrace. They're a disgrace. And you can do something you can show do whatever you want to do but what's going on in politics today is a disgrace whether it's the superdelegates, you know, and I'm no fan of Bernie Sanders. Believe me, I think he's terrible. I don't like him. I don't think he's good. I think he's terrible. I refuse to vote for a communist. OK, but let me tell you -- let me tell you in all fairness -- but in all fairness to Bernie Sanders he goes out and every week it's Bernie Sanders wins, Bernie Sanders wins, Bernie Sanders wins like what is it, nine or 11 in a row. Bernie Sanders win and then I listened to the dishonest media and they're around a table and they said, \"Well he's won like 10 out of 11.\", and they say, \"Well, but he can't win, it's over.\". That's what it is. It's a -- it's a corrupt system because in all fairness, Bernie Sanders should be able to win and they all say he can't win because it's -- they don't say this, I say this because it's a fixed system. It's a corrupt system that's run by the bosses. And you know what? The Republican side is worse because it's less obvious and yet it's just as bad. It's far less obvious but it's just as bad the political pros that taken the money they're the ones that call the shots. Here's what they didn't count on: They didn't count on Trump getting millions and millions of votes, that's what they didn't count on. I mean, we have a guy named Ricketts. I never even heard him, I don't know him, I never saw him. He owns the Chicago Cubs. He's a big enemy of mine and I never met this guy, I never met this guy and I used to like the Chicago Cubs. I don't like them at all anymore, folks. They're gonna fail, they're gonna fail. Because you know what? When we put the kibosh on something it always fails. But here's a guy giving millions of dollars to fight me. We have other guys, I've never even heard of them. Now number one, they want to be, you know, they want to be famous. They're rich but they're not famous, OK. And they would give everything they want to be famous. But Ricketts owns the Chicago. I said, \"Who we're doing this?\", \"Guy named Ricketts. Did you ever hear of him?\", \"No. Who is he?\", \"He owns the Chicago Cubs.\", \"Oh, yeah, I see. OK. Good.\" Now I'm rooting against the Chicago Cubs and I have real estate there but I'm rooting against the Chicago Cubs. But -- oh, he'll go crazy. Now -- so I can't believe they mentioned my name, this is bad, oh, oh. His PR people say, \"You have to stay out of the news.\" Let him take a little heat, let that guy take -- and by the way, here's the beauty, I was supposed to not win Illinois, Chicago, Illinois. I was not supposed to not win Illinois. He spent a lot of money, that family, Ricketts family, against Trump. I won in a landslide, folks. I won in a landslide. So I just wanna leave by saying the following: \"We don't win anymore, but we're gonna start winning again big.\" You're gonna go home and you're gonna remember this evening but more importantly, you're gonna go home, you're gonna rest up on Monday. Make as many calls as you can to get everybody out and go and give us a big mandate a big, big mandate for the movement. OK. Remember, they call it a phenomena. There's never been anything like this. Give us a big mandate for the movement because the movement's about common sense. It's about being the smart people and it's about winning. So we don't win anymore. But we're going to start winning. We're going to win with our military. We're going to knock the hell out of ISIS. We're going to win for our vets, our great veterans, who are being treated horribly in many cases. They're being treated far worse than illegal immigrants who come over to this country. We're going to win for our vets. We're going to win at trade. We're gonna have the best trade deals, Carl Icahn. Some of the greatest business people in the world have endorsed me. We're going to use our smartest and our best. We're not using political hacks anymore. That's the people that do these deals. They're political hacks that know nothing about business. They know nothing about -- like -- like Secretary Kerry, he's a political hack. The deal he made with Iran is one of the worst deals I've ever seen in my life. So we're gonna have our best people, we're gonna have -- we have the greatest people in the world. We have the greatest business people in the world. They don't want money. They want to do it. They want to see our country be great again and they're endorsing me and they love me and we'll start off with Carl Icahn, OK. So we're gonna take our trade and we're gonna reverse it and we're gonna stop companies like Mexico. These countries like Mexico and others from stealing our businesses, stealing our jobs, stealing our money it's going to be reversed. When Carrier just announced, when they moved over, when they just announced and they're moving to Mexico and they'll sell their product in the United States, no tax, no nothing, nope, not with me. They're gonna pay a 35% tax for every single air-conditioning unit they make. And let me tell you, you know what they're gonna do? I'll be called but they didn't give me any money. Nobody gave me anything I'm representing you. I'm not representing lobbyists and special interest. So here's what's gonna happen, I'll be called, I won't even take their call I couldn't care less. Now I'm doing this to represent you -- I didn't need this, folks, I didn't need to, believe me. You don't think this is work? You don't think this is work, but here's what we're going to do, we're gonna charge them at 35 and here's what's gonna happen, I won't be called. You know my wife said, \"Please, please.\" You -- "}