{"id":403,"author":"Donald Trump","title":"Speech: Donald Trump in Richmond County, NY","date":"2016-04-17","link":"https://factba.se/transcript/donald-trump-speech-richmond-county-ny-april-17-2016","paragraphs":["We have great people on Staten Island, that I know it so well. In Grymes Hill, in Tysens Park, and all of it. I love you too. I love you. I was just with the owner of the hotel, great guy, and his wife, who's much better than him, actually. And he said this is the biggest crowd we've ever had in this hotel, by far.","There's people outside. There's people all over the place. So that's a tribute. That's a tribute to the -- to the folks that put on the dinner, that's a tribute. And Joe, I wanna -- where's Joe? I want to thank you, Joe. Great job. Great job. Just so you know, I'm sure you're not aware this, there aren't too many Republicans on the council.","Do we agree with that, Joe? Huh? Three. OK. I thought there'd be one. Yeah? That's OK. Good job. That tells me you're really good, right? All right. Well, I want to thank everybody. So you know coming out -- and we have a big day. Folks, you have to, you have to get out tomorrow. And tomorrow -- you don't know, tomorrow, you're gonna do the following: you're going to get people, right?","And then Tuesday, you're gonna take all of those people you get and we're gonna have a landslide victory, and we're gonna make America great again. We're gonna make America great again. So tomorrow, get everybody you can. And Tuesday, get them all together and get down. Because I'll tell you what, we have something now.","You know what's an honor? Here's what an honor is. That we have 1,500, 1,700 people, and that's only because of the walls. And get the owner to build a larger hotel. Come here. Owner, build a larger room. We want this room expanded next year. OK? But what's a great honor is, look at you. Nobody's sitting down.","Nope, not one person is sitting down. So sit down. Go ahead. Now, how many times -- I mean, if \"Lying Ted Cruz\" came here, you would never stand up like that, I can tell you. Who, by the way, hates New York -- who hates New York. And the other one, you know, the Kasich. He comes in, nobody knows who he is. And somebody said he did OK 'cause he has one negative ad and nobody has hit him.","Wait 'til they hit him. So here's the story for -- and we just came out -- a great Fox poll just came out yesterday on me and Hillary. I love this poll. Let me tell you, the one person she doesn't want to run against. You know that. Who? Now the one person she doesn't want -- you know, it's -- you know the story.","It's crooked Hillary. She's as crooked as they come. And I'll tell you what, we are gonna beat her so badly and I'm gonna do things that no other Republican that's running can do or any Republican, period. I think -- no, no, beyond -- we have to get to the position. Don't forget this, I think we're gonna make our delegates fairly easily and I think we're going to be fine.","I think the convention is going to be unity. I hope it's going to be unity because the Republican Party needs unity. It really needs unity. But when I get the nomination, we're going to come together and we're gonna win New York. And if we win New York, no other person can do -- you won't see, if it weren't me -- it's going to be. If it weren't me, you would never see any candidate even come to New York and spend time in New York, because there's zero chance that anybody can win New York for many, many years.","For decades -- for decades, New York has not been won. And that's why you see the big poll numbers. Don't believe the polls. Go out and vote. Don't believe the polls. You know the worst thing they'll say, \"Oh, Trump's going to do well. I don't have to vote.\" The more, the more we win by the -- let me tell you -- go ahead.","That guy is the professional agitator. Do you, do you -- no, it's true. The safest place to be anywhere is at a New York rally. It's true. A New York rally headed by Trump is the safest place you can be. There's love in the room. There's love in the room. I was up yesterday, and I've been all over the state.","I was in -- I've been all over. Big, big crowd. 20,000 21,000 in Albany. Beautiful arena, by the way. 21,000. We were all over. Rochester -- and it's the safest place. And I say it all the time because the press refuses to say it. Now there's -- I love you to, darling. They'll show this professional, you hear the way he got up? And he's dressed all nicely.","He's not for real. They'll show this guy, they'll say Trump had a protester in Staten Island. That'll be like 90% of the story. They won't say that we have a record crowd, the biggest in the history of a hotel that's -- how many years old? Come here. Come here. Come here. Fiona, how old is this hotel? 15. It's 15 years old.","So we ever read that? I thought it was, you know -- well, it looks very good. I was gonna say I think it was older, but I'm not gonna say that. Something nice you bet I'll -- 15 years. The biggest crowd. Look, they're not gonna say that. They're gonna say, a man stood up and he started shouting. And did you see that guy?","That guy is a professional guy. He was paid to be here, probably. OK. So let me just tell you, first of all, nobody has more fun than we do at our rallies. Do you agree with that? Nobody. Nobody. And second, of all we have all this live television. It's always live. It's live. Look, there it is right up there.","Look. That looks -- look, there it is. We're live. Always live. Someday, I wish you'd turn off the live television, then we could really have fun. Right? It's always live. But let me give you -- there's no place that's more fun and there's no better people. And I have to say this, because we are on live television, we have to bring this country together.","We have to unify this country, white, African-American, men, women, young, old. We have to bring not just the people, we have to bring our country together and remember it. And I'm a unifier. A lot of people smile when I say that. They think, oh, I want safety, I want security for our country, I want strong borders.","We're gonna have a wall. We're gonna stop the drugs from coming in. We're gonna have a war, believe me. Believe me. I mean, today, on the top of Drudge, Matt Drudge, he's a phenomenal person. A phenomenal guy. It's a big deal, top of Drudge. China is upset with Donald Trump. How dare them. So they go -- they're upset.","Now, here's the story. Big -- the biggest story. Top of Drudge, big story. China is upset because of the way Donald Trump is talking about trade with China. They're ripping us off, folks. It's time. I'm so happy they're upset. They haven't been upset with us in 30 years. And now they're upset? I mean, we have a trade deficit with China of $500 billion a year . OK. They tax.","And you know what they said? We're not living up to treaties. They're the ones that don't live up to the agreements because they tax. I have friends, they're manufacturers, they can't get their product into China. And when they do, they have to pay a tax on it. And let me tell you, it's them that's the problem.","And they're going to treat us fairly and they're going to treat us justly, or it's bye-bye, bye-bye. And what we don't know because our leaders are incompetent, or by the way, they're taken care of by the special interest, which also happens, you know, like Ted Cruz. He's got the oil industries. He's got all these people.","Let me just tell you, they're taken care of by the special interests and the lobbyists. A hundred percent. Because a friend of mine came up to me recently and said, \"Donald, I don't understand. Why would they have approved this deal? And a particular senator, why would he do it? Is he stupid?\" I said, \"No, he's really smart.\" He got huge campaign contributions.","That's the only reason he's doing it. The guy said, \"But it's so bad for the country.\" I said, \"the senator couldn't care less about the country. He just cares about his campaign contributions.\" I'm self-funding my campaign. So, you know, I tell the story all the time. I love this story. It could be any company.","But Carrier just left, as you know, Indiana. Indianapolis, Indiana, great place, great city, tremendous people, and they just left. And they fired, viciously, 1,400 people and they moved to Mexico. They said we're moving to Mexico. You have seen -- many of you have seen the clip on television. It's all over the place.","They say, sorry, we're moving to Mexico. Everyone is essentially fired, right? Like The Apprentice, you're fired. Vicious. No, vicious though, and they're gonna move to Mexico. And here's what they're gonna do, they're gonna make air conditioning -- they make good product. I buy a lot of Carrier. I'm not buying them anymore, by the way.","They make good product. They make good product. So they're gonna move to Mexico. They're gonna build a plant. They're gonna sell it to the United States. They'll go through our Swiss cheese border. They're gonna -- but not if I'm president. It's not gonna be Swiss cheese anymore. Oh, that's gonna be a border.","And by the way, people will come into our country, but they're coming in legally folks, legally. OK? Coming in legally. So they'll make their product and they'll sell their air-conditioning units and they come in no tax, no nothing. And here's what I do, my wife always says, \"Please, please be more presidential.\" In other words, don't be so tough.","We need toughies. And by the way, by the way, in this room, I would say 95% of the people disagree with her. OK? Ivanka, my daughter, too. She said, \"Dad, in the last debate -- \" you know, I've won every debate according to all of the sites that do the pulse. I've won every -- I didn't know about debate.","I never debated. I mean, I debate -- my whole life is a debate. But the politicians, all they do is debate, right? They debate. Every night, they debate. So who knew it was gonna work out this way. And I've been center stage every single debate, meaning No, 1. Every single one. We've been leading every single debate.","But here's what I'm gonna do. So my daughter and my wife they say, \"Please, please act -- \" So the last debate I was much more -- I was like this. And you know, they hit me a little bit, and I'd go, hmm, aah, instead of hitting back. And I did well. It was much less exciting than the other debates. So one thing, I'd care -- and I won that debate.","I actually won that debate by bigger numbers. So maybe they're not -- but it was the most -- by far, the most boring debate. OK? That I could tell. But here's what I'd do with Carrier, I'd say,\"Congratulations on your new plant. Have many, many years of success. But here's the problem and here's the bad news, every unit that you make and that you send across our now very strong border, you're gonna pay a 35% tax on that unit.\" Now folks, and Staten Island has it. I have all your statistics here.","I don't want to read them to you because you'll be depressed, OK, but I say that. And you know what's gonna happen? They're gonna call and they're gonna have lobbyists call me. They didn't give me any money. I've turned down, I'll bet you, if I wanted to, I would have raised at least $500 million. You know, Bush, Jeb, he had the biggest one.","No, Jeb had $148 million. Think of it, we go to New Hampshire, Jeb was expected to win New Hampshire big. Right? So I win in a landslide, and I spent a tiny fraction. I spent $2 million, even less, and he spent many many, many times that. And I said to myself, \"Who do we want?\" Same thing, South Carolina.","I spend very little. Everyone else spends -- Cruz was supposed to win there, he got killed there. Remember, Cruz was going to win that. That was his wall, they said. That was his wall. Lying Ted. Lying Ted -- lying Ted was supposed to win South Carolina. I won in a landslide. But here's the beautiful thing, we're New Yorkers, we're smart.","We have New York values. And let me tell you, the country respects these values. Because who would you rather have? The person that came in No. 1 and has spent less than anybody else by far, or the person that's down at the bottom of the pack and spent more money than anybody else by far? OK? So I've spent, you know, relatively speaking, I've spent far less money than anybody else.","We didn't play in Colorado because it was run by the bosses. I only won -- and by the way, just so you know, they lie. They lie. It's all a rigged deal. They lie. They lie. Let me tell you, they said we didn't change anything. Well, they did. I announced in June. I then heard that Colorado -- I was gonna win big like I did in Florida.","I won big in Florida. Landslide. So it was a landslide. But I heard that we were gonna win big -- we did some internal stuff. We're gonna win Colorado big, OK? So it's June, we're doing well all over. Right from -- almost from the beginning, we've been No. 1, right? Almost like it took a couple of weeks to get the message out, but once the message was out, which is jobs, trade, strong military, take care of our vets, get rid of Obamacare -- get rid of Obamacare and replace it with something great, take care of our second amendment, which is under siege.","We're going to take care of it. Terminate totally common core, bring education locally back to Staten Island. So once they heard -- once they heard the message, I mean, it was like it was over. I mean, it was over. And I can only tell you this, nobody can beat my message. And remember -- remember so importantly, when I watched Lying Ted the other night saying, \"We will bring jobs back and we will strengthen our border, and we will build a wall.\" He said a wall.","I said, \"Where did that come from? Where did it come from?\" All of a sudden, he's talking about a wall. He told me six months ago, you'll never build a wall. And by the way, Mexico is going to pay for the wall. They all came up 100%, 100%. Mexico is going to pay for the wall 100%. Now here's the story. Here's the story.","We have a trade deficit with -- and I love Mexico. I love the Mexican people. I love the Hispanic people. I'm winning in the polls in Nevada. I won tremendous Hispanic population. I was No. 1 in the polls with the Hispanics, by far, because they know I'm going to bring jobs back to this country. So what happens is, I see these people, and now, they're copying me. They're copying me on so many things.","Remember, I said, \"Keep the oil.\" We should have never gone to Iraq. I never wanted to go to Iraq. I was against it from the beginning. They should have never gone. But now, you're there. We're leaving. I said, \"Keep the oil. Keep the oil from everybody.\" Keep the oil. They didn't do it. So now, who has the oil?","ISIS has the oil. Iran is going to have the oil after that horrible deal. That grossly incompetent deal made with Iran. The best deal they made is we handed them Iraq on a silver platter. The second-largest oil reserves and the most beautiful oil there is, by the way, phenomenal quality oil. We gave them Iraq.","They've been fighting forever to try, but yet two military power is the same. We gave them Iraq. So we're not going to be the stupid people anymore, folks. We're gonna start -- we're going to start winning again. We don't win. We never win. We never ever win. When was the last time you saw a victory? We don't win on trade.","We don't win for our vets. Our military is being decimated with cuts and everything else at a time when we most need our military than ever before. I mean, we have nuclear weapons that we don't even know if they work. And I wouldn't say this except, stupidly, they allowed this to go on 60 Minutes, a big television program, where they talk about telephone systems that are 40 years old and the wires they can hardly hear on the other side.","This is what we have. Russia is upgrading their nuclear capacity and capability, and we do nothing. And we have stuff that's so old and so rotted that we don't even know if it works. It's going to be a whole different ballgame, folks. It's going to be a whole different ballgame. You know, Vladimir Putin said Donald Trump is a genius.","He's going to do very well. That's a real genius. So I said, great. So these people that I'm running against, we want you to disavow his statement. I said, \"Are you crazy? I'm not gonna disavow that statement.\" Believe me, he's not gonna get anything with that statement. Except this, wouldn't it be nice if we actually got along with Russia?","Wouldn't it be nice? It would be OK. It's not so bad. I can think of other places to spend our money, all right? So here's the story, we're gonna have a really big thing happening on Tuesday. And we've had this wonderful group of people -- and look at you, you're still standing. You people don't bother sitting down.","Has this ever happened before? This has never happened before. No. Look at this. Nobody sits down. Now, the press won't report that. This dishonest media. The most dishonest group of people. They're horrible. Fox is not going to report it. A new reporter will take his place. Fox won't report it. What's going to happen is this.","I hope you heard that, John. What's going to happen is this. They're gonna say, \"We're in Staten Island. Donald Trump just made a speech. Thank you very much. Good luck.\" They're not going to say that the audience was packed, the biggest crowd they've had in 15 years. They're not going to say -- don't forget, this is your big dinner.","This is your Lincoln Day. But they're not going to say that. They're not going to say that not one person in the audience for a 20-minute speech sat down. Nobody's seen that before. So here's the story. On Tuesday, you're gonna go vote. You're gonna get everybody you can. You're gonna go vote on Tuesday.","And when you vote, you're gonna look back on that vote and this day but that vote much more importantly. You're going to look back and you're going to say, \"That was the greatest vote I've ever cast, ever, ever, ever.\" You'll be thinking about it in two years, in four years. Don't worry, we'll get things going fast.","And you have to look at my answer, my response to China. You have to look at it because it's what somebody has to say. We can't continue to be ripped off like we're being ripped off, folks. So you've got to look at it. And it's not war. I'm not talking about war. But they have waged economic war against us. What China has done -- you know, we have rebuilt China, just so -- I hope you're all happy with that.","In the meantime, you can't get funding for your schools in Staten Island. Right? Or your roads, which have potholes, I hate to say. So just so you understand -- just so you understand, we have rebuilt China. They have bridges going up. They have railroads like you've never seen. We have the old Long Island Railroad -- chug, chug, chug, chug.","It runs into a train in front of it. You saw that the other day, a big collision, where they have collisions, and it's like we're a third world country folks. Not gonna happen anymore. They have trains that go 250 miles an hour. We have old stuff. So here's -- thank you, honey. So here's the story. Here's the story.","What China has done to us -- and this is only one country. I hate to use them, but they're the biggest abuser. They abuse us beyond belief. And I'm not angry at China. In fact, I respect them. I made a lot of money dealing with China. A tremendous amount of money. I built a great company. I made a tremendous amount of money.","I'm not angry at China. I'm angry at our leaders for being so incompetent that they allow it to happen. So -- and I said this as part of my response to the Wall Street Journal when they just call. I said, \"In the history of the world, this is the greatest theft ever perpetrated on anyone or any country what China has done to us. It's the greatest single theft.","They've taken our jobs. They've taken our money. I mean, I see the buildings that are empty all over Staten Island, and I see them up in Rochester, and I see them in Albany, and I see them in Rome -- our Rome -- I see them all over. I was out on the island, I was out in Bethpage, and you see what's going on. It's really really sick.","That's not gonna happen anymore with me. It's gonna be turned around fast, fast. And you know the truth is we have the card. So here's the story. We don't win anymore. We lose all the time. Our military can't win. We can't beat ISIS. Can you imagine General George Patton, who was so rough that he would be thrown out of the -- right now, he couldn't even be a general.","They throw him out. You know why? He's not politically correct. We need less political corrector. Somebody told me that General Patton, on occasion -- you know, soldiers would die for him. General MacArthur, Douglas MacArthur, also great. But General Patton was such a rough guy he would, on occasion, slap his soldiers.","He would slap them real in the face. Slap them. If that ever happened today, they'd put him in jail for the rest of his life, maybe give them the electric chair, right? It's a whole different – right, father? Look, I'm looking at the father. Even the father is smiling at me because he understands what I'm saying.","Now we need our great leaders. We have to fight. We have to fight. You know, we have to stop the oil. And I said because ISIS is making their money. Libya, which was a pure Hillary Clinton deal. All right? No, pure. So ISIS -- ISIS has now taken over Libya, and they've taken over the oil, and they're selling all Libyan oil, and we don't do blockades.","We don't do anything. We're run -- how about when they take the oil? How about the truckers? We send down leaflets, we will bomb your truck. Please remove yourself from the truck. In one hour, we will start bombing you. Do you believe -- now, do you believe this? Then I also heard -- but this must be a joke -- I also heard the reason we're not doing big damage to the oil fields is because environmental protection, they don't want to do it, because no. And at first, I said they're kidding, but now, I heard that's really true.","It's like a strategy. They don't want to create an environmental problem. Can you believe this? This is it. Tell that to George Patton. Tell that to George Washington, OK? Tell that to anybody. They would look back, they would say, what is going on with our great, great country? What is going on? So we're gonna make America great again, ready?","We're gonna start winning again. We're gonna win with our military. We're gonna win for our vets. We're gonna win on our borders. We're gonna build the wall. We're gonna win on our borders. We're gonna win with trade. We're going to go from the worst deals ever made to great, great trade deals. We're gonna bring our economy back and our jobs back to Staten Island, too.","We're gonna win on education. We're gonna win on the Second Amendment. And we are going to win on healthcare. We're gonna win so much, and I do this, and I kid with it, and I have fun with it, but it's true. We're gonna win so much. We're gonna win, win, win. You people are going to get so tired of winning, you're going to say, \"Please Mr. President, let's have a couple of losses.\" And I'm going to say, \"No way.","We're going to keep winning, and we're going to make America great again.\" Thank you, Staten Island. I love you Staten Island. Thank you. Thank You. Thank You. Get out and vote. Tuesday, get out and vote.","And later on, as you know, we're going to Poughkeepsie, and we have a big crowd there. We always seem to have the crowds. But we've all over the state, and we've seen what's been happening with the state and with the country. Our jobs are being dissipated. They're being taken like we're -- like candy from a baby.","And they go into Mexico. They going to every place. And I guess today, the top story on Drudge is China's upset with the fact that I'm talking about them negatively from a financial standpoint, that I've mentioned the fact that they're ripping us off. And so I responded. I think you'll like actually the response.","The response was the kind of response we should have been given them for many, many years. So if you folks have any questions -- but before you do that, I just wanna say, you people have done an unbelievable job. And a lot of times, you don't get the kind of acclaim or respect that you should be getting.","And with me, you get it. But with the public, you do get it. You don't hear about it from the press. But with the public, you do get it. And we just want to thank you all because we have a tremendous amount of respect for the work that you do. So Lou and everybody, thank you very much. OK, questions. Yes, John?","Well, it's a rigged election. Now I'm winning by a lot. And a lot of people say, don't complain, you're winning. And I think we'll get there on the first ballot, actually. And we're gonna have a big day, hopefully, in New York, because I love New York. And a guy like Cruz, you heard his statement on values, New York values.","And I can't imagine any New Yorker voting for Cruz. And he can't beat Hillary. I'm gonna beat Hillary. In fact, you notice their commercials came out there about me. They don't even talk about Cruz. She's only concerned about me. Now Kasich is interesting. He's never had a negative commercial. Nobody's ever hit him.","Nobody knows he's there. And so he does well -- he does OK because nobody talks about him. With me, I had -- I think I saw in Fox, 55,000 negative ads. And despite that, I'm leading by a lot. But I think this: It's about the voters, it's not about the bosses. And I'm here to show that it's about the voters.","And we're going to show that it's about the voters. And I win all the time when it's up to the voters. When it's up to the bosses, we didn't play in Colorado, because I heard that it was going to be for the bosses, for the RMC, for the people. So I'm not gonna spend -- waste a lot of money. Don't forget, I'm self-funding, so when I spend money, it's my money.","It's not some PACs money where people are giving it just because they want to have influence and they want their local politician or their politician to do what they want to do. So we didn't play there. We didn't play in Wyoming because the game was rigged. And I don't want to go six, seven months before, because that's what you have to do. Take them on trips, put them in hotel rooms, do the whole thing.","I don't want to play that game. I'm winning with the voters, and we're winning big. And I think we'll get to the 12 37.","Well I think the people that are for me, of which there are many millions. You know, many millions of people have voted in our primaries. Many, many -- and you'll see it tomorrow also. Many millions of people have voted more than voted four years ago. You know that. They came out for me. They didn't come out for Lying Ted Cruz.","They didn't come out for Kasich. They don't know who Kasich is. Nobody does. They came out for me. And these are people that, in many cases, have never voted. These are very smart people, very very strong people. And when they see -- they see what's going on. They see, as an example, the RNC said, \"We never changed the rules.\" Well, that's wrong.","Because I announced on June 16th in, as you know, Colorado, and in August, they changed the rules in Colorado. I'm in June and August because they saw how well I would have done in Colorado, so they changed the rules. They changed the rules in Florida so that the winner gets all. They didn't know that I was gonna win.","That was a good one. They changed the rules because they thought Bush was gonna win. Winner get all, except they had a problem. Trump won. I got all. So I got 99 delegates. But they didn't mean that to happen. It wasn't done for that reason. So sometimes, you get lucky. But if you look at Wyoming, it's the same thing.","But just so you understand, they kept saying we didn't change the rules. We did touch it. Which they totally did. I came out in June. They saw I was gonna win Colorado easily with the voters, which is most important. So they changed the rules, and they took the voters out of it, and they had the party bosses make the selection.","So that's the way it goes OK, yeah.","Because I don't want play the real game. I'll tell you why. Because we live in a democracy, and it's all about getting the bosses out. The bosses are picking that. Now, I'm winning, you will say, I'm winning by 200 delegates. I'm winning, more importantly, in my opinion, I'm winning by over 2 million votes.","In other words, I've gotten more than 2 million votes. And other than the fact that I have 17 candidates starting, you know, throughout the process. We had 17 then dropping out, I would be leading Hillary Clinton by millions and millions of votes. I heard her say during the debate, I have a million votes more than Donald Trump.","She's got Bernie, a socialist, and I've got 17 governors, senators, and guys like Ben Carson, who's fantastic. I have all these guys running. So I have 17 people, she's got one. And if we didn't have 17, I'd be leading her by probably four million votes.","Because you have to change. I'll tell you why. I understand the question. You have to change. It has to be changed. Now it's not gonna happen probably this time, although they're watching a lot closer. In fact, they announced they're not gonna be making rules changes now, because the public is really angry.","And the Republicans are really angry. The voters are really angry. It's got to change. Now in four years, it's going to change, so I've done something. In four years, it's gonna change. It's not gonna be this way in four years. But you're gonna have a very, very upset and angry group of people at the convention.","Now, I hope that doesn't happen because if I win, people are gonna be very happy.","Well I hope it doesn't involve violence. I hope it doesn't. And I'm not suggesting that. I hope it doesn't involve violence. And I don't think it will. But I will say this: It's a rigged system. It's a crooked system. It's a hundred percent crooked. The bosses -- is that a correct -- these people know it better.","It's a crooked -- they're not here for this reason, to be honest. But this is -- they understand law enforcement better than anybody else. It's a corrupt and crooked system where you're allowed to take delegates. Look, nobody has better toys than I do. I can put them in the best planes and bring them to the best resorts anywhere in the world: Doral, Mar-a-lago.","I can put them in the best places in the world. California, I have something that blows everything away. But it's a corrupt system. You're basically buying these people. You're basically saying, \"Delegate, listen, we're gonna send you to Mar-a-lago on a Boeing 757. You're gonna use the spa. You're gonna this, you're gonna that.","We want your vote.\" That's a corrupt system. That has -- wait a minute that has nothing to do with democracy. So here's the story: I'm winning by a lot. I think we're going to win the 12 37. I think we're not gonna have the second ballot. I'd just tell you, though, despite what I just said, it's a corrupt system, and it's a rigged system.","And I think for future years, the Republican Party should change, OK?","Well, I can't say that. I have to see how I'm treated and how these people -- I'm representing many millions of people. You know, the Republican Party and the primaries are up 72%, which is astronomical. The Democrats are down 35%. I mean, you people, those are the numbers. An amazing thing has happened.","The Republican Party, which people don't think of it in terms of going up, they think of it in terms of getting smaller, smaller, smaller, every year, they're up 72%, because voters are coming and voting. Some of them for the first time, because they never had a candidate that they want to vote for. They're great people.","They're great Americans. But it's up 72%. The Democrats are down 35%, and I'll tell you why. We're getting independents. We're getting Democrats to vote. And we're getting -- to me, it makes me very happy, people that have never voted before. And let me tell you, if you disenfranchise those people, you're gonna have some very upset people.","Yes, go ahead.","I just have to see what happens. Jeremy, it's too early to say. I have to see. I have to see how it's handled, and I have to see what level of fairness. These millions of people who I'm representing. You understand, I have far more votes than anybody, including Hillary, because I had 17 people. She had Bernie, OK? Bernie.","Oh, Bernie. You guys aren't big into socialism or communism, are you? I don't think you're going for a communist, are you, Lou? OK. Go ahead back there.","Oh, I have. Excuse me. Excuse me. I had rallies, the biggest rallies in New York. We had 21,000 people in Albany. We had -- well, I'm going up to Poughkeepsie in a little while. You know why, to be honest with you, because the polls are so good and so strong, that I really want to focus on areas where they know me, but they don't know me as well.","No. Not at all. We've had we've had virtually nothing. I'll tell you truthfully, the press doesn't cover it that way. And I've said it yesterday and a couple of days, the safest -- I was in Watertown yesterday. We had tremendous crowds. And we're tremendous crowds everywhere. Albany was unbelievable. We're in Rochester, unbelievable.","Rome, our Rome, not the Rome that we think about. I think about our Rome. Rome tremendous crowd I know it very well, and I've had property on Staten Island. In fact, when I grew up during the summers, I used to work on Staten Island. My father had -- Grimes Hill. That was in the Grimes Hill section, which a couple of you folks know about, right?","But the Grimes Hill section of Staten Island which was really nice. I love Staten Island, and Tysons Park. And I worked on Staten Island for four summers. I love it. It's a great piece. Greatest people. These people are incredible people.","Well, I looked at it. I just had stats done because I'm making a speech in a couple of minutes. And if you look at the number of jobs that are being lost, it's incredible. It's incredible. 25% of the manufacturing jobs. And I mean, it's an unbelievable stat. And you know I notice because before I go to every community, I do like a stat cheat.","I have my people give me the stats. And they were all the same. Way jobs way down. Food stamps way up. It's like every -- you could almost -- they're almost interchangeable. The numbers are slightly different, but they're interchangeable. Now they have to have jobs. This country needs jobs. I noticed Ted Cruz the other day follows my line, jobs, jobs.","Well, he never used to say that. He's saying it because I get the crowds and I'm getting the response, and he's not getting the voters. He gets the bosses. And I can get the bosses easier than him if I wanted. I'm good with bosses. I'm the greatest with bosses. I just don't want them. I don't want them. It's not about that anymore.","Yes, ma'am.","Still here. Very good. Corey's right here. Did a good job. Totally exonerated from that bogus nonsense from somebody that made a bogus claim, who by the way, if you look at the tape, it bore no relationship to what she said happened. And I'd tell you, I really have a lot of respect for the people in Florida for looking at that fairly.","I really do. I have great respect for the prosecutor and for the police for taking a look at that clip and realizing that she misrepresented. I have great respect for that. And he's good. That was a weight on his shoulder. I mean, I saw it had a huge impact on him with his family. And he's got four beautiful children and a wonderful wife in New Hampshire.","And I'll tell you what, that was a very unfair thing that happened to him. Very, very unfair. So I'll say it. OK, do one more. Go.","Oh, I don't want to talk about an old election. That's all I need to do. I don't want to talk. I'll tell you what. I'll tell you what, though. The voters, to me, are very important. Yes, go ahead. Did you have one?","What, a search operation?","They can't screen them, they have no documentation. You know, you can't screen a person with no documentation. They have no written documents whatsoever, so there's nothing you can do. Go ahead, one more.","A lot of them. There's about 12. Go ahead. He knows good.","I'm gonna come up with something on colleges because I'll tell you what, the biggest question I get are from young people that have gone to college, have done well, very good colleges, and they come to me and it's turned well for them. They're loaded up with debt, and they can't get a job. And I'm gonna have policy on that very, very soon.","And I'll tell you what. It's so important. It's such a big issue. I'll see you inside folks. Thank you very much. And Lou, thank you and your group most importantly."],"text":" We have great people on Staten Island, that I know it so well. In Grymes Hill, in Tysens Park, and all of it. I love you too. I love you. I was just with the owner of the hotel, great guy, and his wife, who's much better than him, actually. And he said this is the biggest crowd we've ever had in this hotel, by far. There's people outside. There's people all over the place. So that's a tribute. That's a tribute to the -- to the folks that put on the dinner, that's a tribute. And Joe, I wanna -- where's Joe? I want to thank you, Joe. Great job. Great job. Just so you know, I'm sure you're not aware this, there aren't too many Republicans on the council. Do we agree with that, Joe? Huh? Three. OK. I thought there'd be one. Yeah? That's OK. Good job. That tells me you're really good, right? All right. Well, I want to thank everybody. So you know coming out -- and we have a big day. Folks, you have to, you have to get out tomorrow. And tomorrow -- you don't know, tomorrow, you're gonna do the following: you're going to get people, right? And then Tuesday, you're gonna take all of those people you get and we're gonna have a landslide victory, and we're gonna make America great again. We're gonna make America great again. So tomorrow, get everybody you can. And Tuesday, get them all together and get down. Because I'll tell you what, we have something now. You know what's an honor? Here's what an honor is. That we have 1,500, 1,700 people, and that's only because of the walls. And get the owner to build a larger hotel. Come here. Owner, build a larger room. We want this room expanded next year. OK? But what's a great honor is, look at you. Nobody's sitting down. Nope, not one person is sitting down. So sit down. Go ahead. Now, how many times -- I mean, if \"Lying Ted Cruz\" came here, you would never stand up like that, I can tell you. Who, by the way, hates New York -- who hates New York. And the other one, you know, the Kasich. He comes in, nobody knows who he is. And somebody said he did OK 'cause he has one negative ad and nobody has hit him. Wait 'til they hit him. So here's the story for -- and we just came out -- a great Fox poll just came out yesterday on me and Hillary. I love this poll. Let me tell you, the one person she doesn't want to run against. You know that. Who? Now the one person she doesn't want -- you know, it's -- you know the story. It's crooked Hillary. She's as crooked as they come. And I'll tell you what, we are gonna beat her so badly and I'm gonna do things that no other Republican that's running can do or any Republican, period. I think -- no, no, beyond -- we have to get to the position. Don't forget this, I think we're gonna make our delegates fairly easily and I think we're going to be fine. I think the convention is going to be unity. I hope it's going to be unity because the Republican Party needs unity. It really needs unity. But when I get the nomination, we're going to come together and we're gonna win New York. And if we win New York, no other person can do -- you won't see, if it weren't me -- it's going to be. If it weren't me, you would never see any candidate even come to New York and spend time in New York, because there's zero chance that anybody can win New York for many, many years. For decades -- for decades, New York has not been won. And that's why you see the big poll numbers. Don't believe the polls. Go out and vote. Don't believe the polls. You know the worst thing they'll say, \"Oh, Trump's going to do well. I don't have to vote.\" The more, the more we win by the -- let me tell you -- go ahead. That guy is the professional agitator. Do you, do you -- no, it's true. The safest place to be anywhere is at a New York rally. It's true. A New York rally headed by Trump is the safest place you can be. There's love in the room. There's love in the room. I was up yesterday, and I've been all over the state. I was in -- I've been all over. Big, big crowd. 20,000 21,000 in Albany. Beautiful arena, by the way. 21,000. We were all over. Rochester -- and it's the safest place. And I say it all the time because the press refuses to say it. Now there's -- I love you to, darling. They'll show this professional, you hear the way he got up? And he's dressed all nicely. He's not for real. They'll show this guy, they'll say Trump had a protester in Staten Island. That'll be like 90% of the story. They won't say that we have a record crowd, the biggest in the history of a hotel that's -- how many years old? Come here. Come here. Come here. Fiona, how old is this hotel? 15. It's 15 years old. So we ever read that? I thought it was, you know -- well, it looks very good. I was gonna say I think it was older, but I'm not gonna say that. Something nice you bet I'll -- 15 years. The biggest crowd. Look, they're not gonna say that. They're gonna say, a man stood up and he started shouting. And did you see that guy? That guy is a professional guy. He was paid to be here, probably. OK. So let me just tell you, first of all, nobody has more fun than we do at our rallies. Do you agree with that? Nobody. Nobody. And second, of all we have all this live television. It's always live. It's live. Look, there it is right up there. Look. That looks -- look, there it is. We're live. Always live. Someday, I wish you'd turn off the live television, then we could really have fun. Right? It's always live. But let me give you -- there's no place that's more fun and there's no better people. And I have to say this, because we are on live television, we have to bring this country together. We have to unify this country, white, African-American, men, women, young, old. We have to bring not just the people, we have to bring our country together and remember it. And I'm a unifier. A lot of people smile when I say that. They think, oh, I want safety, I want security for our country, I want strong borders. We're gonna have a wall. We're gonna stop the drugs from coming in. We're gonna have a war, believe me. Believe me. I mean, today, on the top of Drudge, Matt Drudge, he's a phenomenal person. A phenomenal guy. It's a big deal, top of Drudge. China is upset with Donald Trump. How dare them. So they go -- they're upset. Now, here's the story. Big -- the biggest story. Top of Drudge, big story. China is upset because of the way Donald Trump is talking about trade with China. They're ripping us off, folks. It's time. I'm so happy they're upset. They haven't been upset with us in 30 years. And now they're upset? I mean, we have a trade deficit with China of $500 billion a year . OK. They tax. And you know what they said? We're not living up to treaties. They're the ones that don't live up to the agreements because they tax. I have friends, they're manufacturers, they can't get their product into China. And when they do, they have to pay a tax on it. And let me tell you, it's them that's the problem. And they're going to treat us fairly and they're going to treat us justly, or it's bye-bye, bye-bye. And what we don't know because our leaders are incompetent, or by the way, they're taken care of by the special interest, which also happens, you know, like Ted Cruz. He's got the oil industries. He's got all these people. Let me just tell you, they're taken care of by the special interests and the lobbyists. A hundred percent. Because a friend of mine came up to me recently and said, \"Donald, I don't understand. Why would they have approved this deal? And a particular senator, why would he do it? Is he stupid?\" I said, \"No, he's really smart.\" He got huge campaign contributions. That's the only reason he's doing it. The guy said, \"But it's so bad for the country.\" I said, \"the senator couldn't care less about the country. He just cares about his campaign contributions.\" I'm self-funding my campaign. So, you know, I tell the story all the time. I love this story. It could be any company. But Carrier just left, as you know, Indiana. Indianapolis, Indiana, great place, great city, tremendous people, and they just left. And they fired, viciously, 1,400 people and they moved to Mexico. They said we're moving to Mexico. You have seen -- many of you have seen the clip on television. It's all over the place. They say, sorry, we're moving to Mexico. Everyone is essentially fired, right? Like The Apprentice, you're fired. Vicious. No, vicious though, and they're gonna move to Mexico. And here's what they're gonna do, they're gonna make air conditioning -- they make good product. I buy a lot of Carrier. I'm not buying them anymore, by the way. They make good product. They make good product. So they're gonna move to Mexico. They're gonna build a plant. They're gonna sell it to the United States. They'll go through our Swiss cheese border. They're gonna -- but not if I'm president. It's not gonna be Swiss cheese anymore. Oh, that's gonna be a border. And by the way, people will come into our country, but they're coming in legally folks, legally. OK? Coming in legally. So they'll make their product and they'll sell their air-conditioning units and they come in no tax, no nothing. And here's what I do, my wife always says, \"Please, please be more presidential.\" In other words, don't be so tough. We need toughies. And by the way, by the way, in this room, I would say 95% of the people disagree with her. OK? Ivanka, my daughter, too. She said, \"Dad, in the last debate -- \" you know, I've won every debate according to all of the sites that do the pulse. I've won every -- I didn't know about debate. I never debated. I mean, I debate -- my whole life is a debate. But the politicians, all they do is debate, right? They debate. Every night, they debate. So who knew it was gonna work out this way. And I've been center stage every single debate, meaning No, 1. Every single one. We've been leading every single debate. But here's what I'm gonna do. So my daughter and my wife they say, \"Please, please act -- \" So the last debate I was much more -- I was like this. And you know, they hit me a little bit, and I'd go, hmm, aah, instead of hitting back. And I did well. It was much less exciting than the other debates. So one thing, I'd care -- and I won that debate. I actually won that debate by bigger numbers. So maybe they're not -- but it was the most -- by far, the most boring debate. OK? That I could tell. But here's what I'd do with Carrier, I'd say,\"Congratulations on your new plant. Have many, many years of success. But here's the problem and here's the bad news, every unit that you make and that you send across our now very strong border, you're gonna pay a 35% tax on that unit.\" Now folks, and Staten Island has it. I have all your statistics here. I don't want to read them to you because you'll be depressed, OK, but I say that. And you know what's gonna happen? They're gonna call and they're gonna have lobbyists call me. They didn't give me any money. I've turned down, I'll bet you, if I wanted to, I would have raised at least $500 million. You know, Bush, Jeb, he had the biggest one. No, Jeb had $148 million. Think of it, we go to New Hampshire, Jeb was expected to win New Hampshire big. Right? So I win in a landslide, and I spent a tiny fraction. I spent $2 million, even less, and he spent many many, many times that. And I said to myself, \"Who do we want?\" Same thing, South Carolina. I spend very little. Everyone else spends -- Cruz was supposed to win there, he got killed there. Remember, Cruz was going to win that. That was his wall, they said. That was his wall. Lying Ted. Lying Ted -- lying Ted was supposed to win South Carolina. I won in a landslide. But here's the beautiful thing, we're New Yorkers, we're smart. We have New York values. And let me tell you, the country respects these values. Because who would you rather have? The person that came in No. 1 and has spent less than anybody else by far, or the person that's down at the bottom of the pack and spent more money than anybody else by far? OK? So I've spent, you know, relatively speaking, I've spent far less money than anybody else. We didn't play in Colorado because it was run by the bosses. I only won -- and by the way, just so you know, they lie. They lie. It's all a rigged deal. They lie. They lie. Let me tell you, they said we didn't change anything. Well, they did. I announced in June. I then heard that Colorado -- I was gonna win big like I did in Florida. I won big in Florida. Landslide. So it was a landslide. But I heard that we were gonna win big -- we did some internal stuff. We're gonna win Colorado big, OK? So it's June, we're doing well all over. Right from -- almost from the beginning, we've been No. 1, right? Almost like it took a couple of weeks to get the message out, but once the message was out, which is jobs, trade, strong military, take care of our vets, get rid of Obamacare -- get rid of Obamacare and replace it with something great, take care of our second amendment, which is under siege. We're going to take care of it. Terminate totally common core, bring education locally back to Staten Island. So once they heard -- once they heard the message, I mean, it was like it was over. I mean, it was over. And I can only tell you this, nobody can beat my message. And remember -- remember so importantly, when I watched Lying Ted the other night saying, \"We will bring jobs back and we will strengthen our border, and we will build a wall.\" He said a wall. I said, \"Where did that come from? Where did it come from?\" All of a sudden, he's talking about a wall. He told me six months ago, you'll never build a wall. And by the way, Mexico is going to pay for the wall. They all came up 100%, 100%. Mexico is going to pay for the wall 100%. Now here's the story. Here's the story. We have a trade deficit with -- and I love Mexico. I love the Mexican people. I love the Hispanic people. I'm winning in the polls in Nevada. I won tremendous Hispanic population. I was No. 1 in the polls with the Hispanics, by far, because they know I'm going to bring jobs back to this country. So what happens is, I see these people, and now, they're copying me. They're copying me on so many things. Remember, I said, \"Keep the oil.\" We should have never gone to Iraq. I never wanted to go to Iraq. I was against it from the beginning. They should have never gone. But now, you're there. We're leaving. I said, \"Keep the oil. Keep the oil from everybody.\" Keep the oil. They didn't do it. So now, who has the oil? ISIS has the oil. Iran is going to have the oil after that horrible deal. That grossly incompetent deal made with Iran. The best deal they made is we handed them Iraq on a silver platter. The second-largest oil reserves and the most beautiful oil there is, by the way, phenomenal quality oil. We gave them Iraq. They've been fighting forever to try, but yet two military power is the same. We gave them Iraq. So we're not going to be the stupid people anymore, folks. We're gonna start -- we're going to start winning again. We don't win. We never win. We never ever win. When was the last time you saw a victory? We don't win on trade. We don't win for our vets. Our military is being decimated with cuts and everything else at a time when we most need our military than ever before. I mean, we have nuclear weapons that we don't even know if they work. And I wouldn't say this except, stupidly, they allowed this to go on 60 Minutes, a big television program, where they talk about telephone systems that are 40 years old and the wires they can hardly hear on the other side. This is what we have. Russia is upgrading their nuclear capacity and capability, and we do nothing. And we have stuff that's so old and so rotted that we don't even know if it works. It's going to be a whole different ballgame, folks. It's going to be a whole different ballgame. You know, Vladimir Putin said Donald Trump is a genius. He's going to do very well. That's a real genius. So I said, great. So these people that I'm running against, we want you to disavow his statement. I said, \"Are you crazy? I'm not gonna disavow that statement.\" Believe me, he's not gonna get anything with that statement. Except this, wouldn't it be nice if we actually got along with Russia? Wouldn't it be nice? It would be OK. It's not so bad. I can think of other places to spend our money, all right? So here's the story, we're gonna have a really big thing happening on Tuesday. And we've had this wonderful group of people -- and look at you, you're still standing. You people don't bother sitting down. Has this ever happened before? This has never happened before. No. Look at this. Nobody sits down. Now, the press won't report that. This dishonest media. The most dishonest group of people. They're horrible. Fox is not going to report it. A new reporter will take his place. Fox won't report it. What's going to happen is this. I hope you heard that, John. What's going to happen is this. They're gonna say, \"We're in Staten Island. Donald Trump just made a speech. Thank you very much. Good luck.\" They're not going to say that the audience was packed, the biggest crowd they've had in 15 years. They're not going to say -- don't forget, this is your big dinner. This is your Lincoln Day. But they're not going to say that. They're not going to say that not one person in the audience for a 20-minute speech sat down. Nobody's seen that before. So here's the story. On Tuesday, you're gonna go vote. You're gonna get everybody you can. You're gonna go vote on Tuesday. And when you vote, you're gonna look back on that vote and this day but that vote much more importantly. You're going to look back and you're going to say, \"That was the greatest vote I've ever cast, ever, ever, ever.\" You'll be thinking about it in two years, in four years. Don't worry, we'll get things going fast. And you have to look at my answer, my response to China. You have to look at it because it's what somebody has to say. We can't continue to be ripped off like we're being ripped off, folks. So you've got to look at it. And it's not war. I'm not talking about war. But they have waged economic war against us. What China has done -- you know, we have rebuilt China, just so -- I hope you're all happy with that. In the meantime, you can't get funding for your schools in Staten Island. Right? Or your roads, which have potholes, I hate to say. So just so you understand -- just so you understand, we have rebuilt China. They have bridges going up. They have railroads like you've never seen. We have the old Long Island Railroad -- chug, chug, chug, chug. It runs into a train in front of it. You saw that the other day, a big collision, where they have collisions, and it's like we're a third world country folks. Not gonna happen anymore. They have trains that go 250 miles an hour. We have old stuff. So here's -- thank you, honey. So here's the story. Here's the story. What China has done to us -- and this is only one country. I hate to use them, but they're the biggest abuser. They abuse us beyond belief. And I'm not angry at China. In fact, I respect them. I made a lot of money dealing with China. A tremendous amount of money. I built a great company. I made a tremendous amount of money. I'm not angry at China. I'm angry at our leaders for being so incompetent that they allow it to happen. So -- and I said this as part of my response to the Wall Street Journal when they just call. I said, \"In the history of the world, this is the greatest theft ever perpetrated on anyone or any country what China has done to us. It's the greatest single theft. They've taken our jobs. They've taken our money. I mean, I see the buildings that are empty all over Staten Island, and I see them up in Rochester, and I see them in Albany, and I see them in Rome -- our Rome -- I see them all over. I was out on the island, I was out in Bethpage, and you see what's going on. It's really really sick. That's not gonna happen anymore with me. It's gonna be turned around fast, fast. And you know the truth is we have the card. So here's the story. We don't win anymore. We lose all the time. Our military can't win. We can't beat ISIS. Can you imagine General George Patton, who was so rough that he would be thrown out of the -- right now, he couldn't even be a general. They throw him out. You know why? He's not politically correct. We need less political corrector. Somebody told me that General Patton, on occasion -- you know, soldiers would die for him. General MacArthur, Douglas MacArthur, also great. But General Patton was such a rough guy he would, on occasion, slap his soldiers. He would slap them real in the face. Slap them. If that ever happened today, they'd put him in jail for the rest of his life, maybe give them the electric chair, right? It's a whole different – right, father? Look, I'm looking at the father. Even the father is smiling at me because he understands what I'm saying. Now we need our great leaders. We have to fight. We have to fight. You know, we have to stop the oil. And I said because ISIS is making their money. Libya, which was a pure Hillary Clinton deal. All right? No, pure. So ISIS -- ISIS has now taken over Libya, and they've taken over the oil, and they're selling all Libyan oil, and we don't do blockades. We don't do anything. We're run -- how about when they take the oil? How about the truckers? We send down leaflets, we will bomb your truck. Please remove yourself from the truck. In one hour, we will start bombing you. Do you believe -- now, do you believe this? Then I also heard -- but this must be a joke -- I also heard the reason we're not doing big damage to the oil fields is because environmental protection, they don't want to do it, because no. And at first, I said they're kidding, but now, I heard that's really true. It's like a strategy. They don't want to create an environmental problem. Can you believe this? This is it. Tell that to George Patton. Tell that to George Washington, OK? Tell that to anybody. They would look back, they would say, what is going on with our great, great country? What is going on? So we're gonna make America great again, ready? We're gonna start winning again. We're gonna win with our military. We're gonna win for our vets. We're gonna win on our borders. We're gonna build the wall. We're gonna win on our borders. We're gonna win with trade. We're going to go from the worst deals ever made to great, great trade deals. We're gonna bring our economy back and our jobs back to Staten Island, too. We're gonna win on education. We're gonna win on the Second Amendment. And we are going to win on healthcare. We're gonna win so much, and I do this, and I kid with it, and I have fun with it, but it's true. We're gonna win so much. We're gonna win, win, win. You people are going to get so tired of winning, you're going to say, \"Please Mr. President, let's have a couple of losses.\" And I'm going to say, \"No way. We're going to keep winning, and we're going to make America great again.\" Thank you, Staten Island. I love you Staten Island. Thank you. Thank You. Thank You. Get out and vote. Tuesday, get out and vote. And later on, as you know, we're going to Poughkeepsie, and we have a big crowd there. We always seem to have the crowds. But we've all over the state, and we've seen what's been happening with the state and with the country. Our jobs are being dissipated. They're being taken like we're -- like candy from a baby. And they go into Mexico. They going to every place. And I guess today, the top story on Drudge is China's upset with the fact that I'm talking about them negatively from a financial standpoint, that I've mentioned the fact that they're ripping us off. And so I responded. I think you'll like actually the response. The response was the kind of response we should have been given them for many, many years. So if you folks have any questions -- but before you do that, I just wanna say, you people have done an unbelievable job. And a lot of times, you don't get the kind of acclaim or respect that you should be getting. And with me, you get it. But with the public, you do get it. You don't hear about it from the press. But with the public, you do get it. And we just want to thank you all because we have a tremendous amount of respect for the work that you do. So Lou and everybody, thank you very much. OK, questions. Yes, John? Well, it's a rigged election. Now I'm winning by a lot. And a lot of people say, don't complain, you're winning. And I think we'll get there on the first ballot, actually. And we're gonna have a big day, hopefully, in New York, because I love New York. And a guy like Cruz, you heard his statement on values, New York values. And I can't imagine any New Yorker voting for Cruz. And he can't beat Hillary. I'm gonna beat Hillary. In fact, you notice their commercials came out there about me. They don't even talk about Cruz. She's only concerned about me. Now Kasich is interesting. He's never had a negative commercial. Nobody's ever hit him. Nobody knows he's there. And so he does well -- he does OK because nobody talks about him. With me, I had -- I think I saw in Fox, 55,000 negative ads. And despite that, I'm leading by a lot. But I think this: It's about the voters, it's not about the bosses. And I'm here to show that it's about the voters. And we're going to show that it's about the voters. And I win all the time when it's up to the voters. When it's up to the bosses, we didn't play in Colorado, because I heard that it was going to be for the bosses, for the RMC, for the people. So I'm not gonna spend -- waste a lot of money. Don't forget, I'm self-funding, so when I spend money, it's my money. It's not some PACs money where people are giving it just because they want to have influence and they want their local politician or their politician to do what they want to do. So we didn't play there. We didn't play in Wyoming because the game was rigged. And I don't want to go six, seven months before, because that's what you have to do. Take them on trips, put them in hotel rooms, do the whole thing. I don't want to play that game. I'm winning with the voters, and we're winning big. And I think we'll get to the 12 37. Well I think the people that are for me, of which there are many millions. You know, many millions of people have voted in our primaries. Many, many -- and you'll see it tomorrow also. Many millions of people have voted more than voted four years ago. You know that. They came out for me. They didn't come out for Lying Ted Cruz. They didn't come out for Kasich. They don't know who Kasich is. Nobody does. They came out for me. And these are people that, in many cases, have never voted. These are very smart people, very very strong people. And when they see -- they see what's going on. They see, as an example, the RNC said, \"We never changed the rules.\" Well, that's wrong. Because I announced on June 16th in, as you know, Colorado, and in August, they changed the rules in Colorado. I'm in June and August because they saw how well I would have done in Colorado, so they changed the rules. They changed the rules in Florida so that the winner gets all. They didn't know that I was gonna win. That was a good one. They changed the rules because they thought Bush was gonna win. Winner get all, except they had a problem. Trump won. I got all. So I got 99 delegates. But they didn't mean that to happen. It wasn't done for that reason. So sometimes, you get lucky. But if you look at Wyoming, it's the same thing. But just so you understand, they kept saying we didn't change the rules. We did touch it. Which they totally did. I came out in June. They saw I was gonna win Colorado easily with the voters, which is most important. So they changed the rules, and they took the voters out of it, and they had the party bosses make the selection. So that's the way it goes OK, yeah. Because I don't want play the real game. I'll tell you why. Because we live in a democracy, and it's all about getting the bosses out. The bosses are picking that. Now, I'm winning, you will say, I'm winning by 200 delegates. I'm winning, more importantly, in my opinion, I'm winning by over 2 million votes. In other words, I've gotten more than 2 million votes. And other than the fact that I have 17 candidates starting, you know, throughout the process. We had 17 then dropping out, I would be leading Hillary Clinton by millions and millions of votes. I heard her say during the debate, I have a million votes more than Donald Trump. She's got Bernie, a socialist, and I've got 17 governors, senators, and guys like Ben Carson, who's fantastic. I have all these guys running. So I have 17 people, she's got one. And if we didn't have 17, I'd be leading her by probably four million votes. Because you have to change. I'll tell you why. I understand the question. You have to change. It has to be changed. Now it's not gonna happen probably this time, although they're watching a lot closer. In fact, they announced they're not gonna be making rules changes now, because the public is really angry. And the Republicans are really angry. The voters are really angry. It's got to change. Now in four years, it's going to change, so I've done something. In four years, it's gonna change. It's not gonna be this way in four years. But you're gonna have a very, very upset and angry group of people at the convention. Now, I hope that doesn't happen because if I win, people are gonna be very happy. Well I hope it doesn't involve violence. I hope it doesn't. And I'm not suggesting that. I hope it doesn't involve violence. And I don't think it will. But I will say this: It's a rigged system. It's a crooked system. It's a hundred percent crooked. The bosses -- is that a correct -- these people know it better. It's a crooked -- they're not here for this reason, to be honest. But this is -- they understand law enforcement better than anybody else. It's a corrupt and crooked system where you're allowed to take delegates. Look, nobody has better toys than I do. I can put them in the best planes and bring them to the best resorts anywhere in the world: Doral, Mar-a-lago. I can put them in the best places in the world. California, I have something that blows everything away. But it's a corrupt system. You're basically buying these people. You're basically saying, \"Delegate, listen, we're gonna send you to Mar-a-lago on a Boeing 757. You're gonna use the spa. You're gonna this, you're gonna that. We want your vote.\" That's a corrupt system. That has -- wait a minute that has nothing to do with democracy. So here's the story: I'm winning by a lot. I think we're going to win the 12 37. I think we're not gonna have the second ballot. I'd just tell you, though, despite what I just said, it's a corrupt system, and it's a rigged system. And I think for future years, the Republican Party should change, OK? Well, I can't say that. I have to see how I'm treated and how these people -- I'm representing many millions of people. You know, the Republican Party and the primaries are up 72%, which is astronomical. The Democrats are down 35%. I mean, you people, those are the numbers. An amazing thing has happened. The Republican Party, which people don't think of it in terms of going up, they think of it in terms of getting smaller, smaller, smaller, every year, they're up 72%, because voters are coming and voting. Some of them for the first time, because they never had a candidate that they want to vote for. They're great people. They're great Americans. But it's up 72%. The Democrats are down 35%, and I'll tell you why. We're getting independents. We're getting Democrats to vote. And we're getting -- to me, it makes me very happy, people that have never voted before. And let me tell you, if you disenfranchise those people, you're gonna have some very upset people. Yes, go ahead. Would you accept though I just have to see what happens. Jeremy, it's too early to say. I have to see. I have to see how it's handled, and I have to see what level of fairness. These millions of people who I'm representing. You understand, I have far more votes than anybody, including Hillary, because I had 17 people. She had Bernie, OK? Bernie. Oh, Bernie. You guys aren't big into socialism or communism, are you? I don't think you're going for a communist, are you, Lou? OK. Go ahead back there. Where in your home city of New York City Oh, I have. Excuse me. Excuse me. I had rallies, the biggest rallies in New York. We had 21,000 people in Albany. We had -- well, I'm going up to Poughkeepsie in a little while. You know why, to be honest with you, because the polls are so good and so strong, that I really want to focus on areas where they know me, but they don't know me as well. No. Not at all. We've had we've had virtually nothing. I'll tell you truthfully, the press doesn't cover it that way. And I've said it yesterday and a couple of days, the safest -- I was in Watertown yesterday. We had tremendous crowds. And we're tremendous crowds everywhere. Albany was unbelievable. We're in Rochester, unbelievable. Rome, our Rome, not the Rome that we think about. I think about our Rome. Rome tremendous crowd I know it very well, and I've had property on Staten Island. In fact, when I grew up during the summers, I used to work on Staten Island. My father had -- Grimes Hill. That was in the Grimes Hill section, which a couple of you folks know about, right? But the Grimes Hill section of Staten Island which was really nice. I love Staten Island, and Tysons Park. And I worked on Staten Island for four summers. I love it. It's a great piece. Greatest people. These people are incredible people. What would you like to see Well, I looked at it. I just had stats done because I'm making a speech in a couple of minutes. And if you look at the number of jobs that are being lost, it's incredible. It's incredible. 25% of the manufacturing jobs. And I mean, it's an unbelievable stat. And you know I notice because before I go to every community, I do like a stat cheat. I have my people give me the stats. And they were all the same. Way jobs way down. Food stamps way up. It's like every -- you could almost -- they're almost interchangeable. The numbers are slightly different, but they're interchangeable. Now they have to have jobs. This country needs jobs. I noticed Ted Cruz the other day follows my line, jobs, jobs. Well, he never used to say that. He's saying it because I get the crowds and I'm getting the response, and he's not getting the voters. He gets the bosses. And I can get the bosses easier than him if I wanted. I'm good with bosses. I'm the greatest with bosses. I just don't want them. I don't want them. It's not about that anymore. Yes, ma'am. Still here. Very good. Corey's right here. Did a good job. Totally exonerated from that bogus nonsense from somebody that made a bogus claim, who by the way, if you look at the tape, it bore no relationship to what she said happened. And I'd tell you, I really have a lot of respect for the people in Florida for looking at that fairly. I really do. I have great respect for the prosecutor and for the police for taking a look at that clip and realizing that she misrepresented. I have great respect for that. And he's good. That was a weight on his shoulder. I mean, I saw it had a huge impact on him with his family. And he's got four beautiful children and a wonderful wife in New Hampshire. And I'll tell you what, that was a very unfair thing that happened to him. Very, very unfair. So I'll say it. OK, do one more. Go. Oh, I don't want to talk about an old election. That's all I need to do. I don't want to talk. I'll tell you what. I'll tell you what, though. The voters, to me, are very important. Yes, go ahead. Did you have one? Yeah, yeah What, a search operation? Thousands of Syrian refugees They can't screen them, they have no documentation. You know, you can't screen a person with no documentation. They have no written documents whatsoever, so there's nothing you can do. Go ahead, one more. A lot of them. There's about 12. Go ahead. He knows good. I'm gonna come up with something on colleges because I'll tell you what, the biggest question I get are from young people that have gone to college, have done well, very good colleges, and they come to me and it's turned well for them. They're loaded up with debt, and they can't get a job. And I'm gonna have policy on that very, very soon. And I'll tell you what. It's so important. It's such a big issue. I'll see you inside folks. Thank you very much. And Lou, thank you and your group most importantly."}