{"id":404,"author":"Donald Trump","title":"Speech: Donald Trump in Syracuse, NY","date":"2016-04-16","link":"https://factba.se/transcript/donald-trump-speech-syracuse-ny-april-16-2016","paragraphs":["Thank you, everybody. Wow. Look at all those people pouring in. We said, we'll start now. We're not gonna wait, right? Let's go. We'll start. Wow. Yeah, we have thousands of people outside but were coming in. They'll come in. By the time they get in, we'll be finished. But that's OK, right? Thank you, everybody.","So I know a lot about Syracuse. You love Syracuse. I love Syracuse. We love New York. We love the United States of America, right? Better believe it. And folks, we're going to make our country strong. We're gonna make America great again. But you know what? We're gonna bring back jobs because we need jobs here.","We need jobs. So before we came up, I had one of my people just do a couple of numbers -- thank you. Get him out. Never ends. Folks, we're gonna take back our country. We're gonna take back our country. Believe me, believe me. So before I came up, I had one of my people, I said, go to the books, the real straight books.","Tell me and I know all about Syracuse. I've been up here so many times. I have so many friends. I do happen to love your basketball team. They did a good job, right? They did a good job. And you happen to have an excellent coach. I don't know if you agree but I think you have, you know, he's been doing that a long time and he's kept it good.","And you really do have a great thing. And you know, hey, Jim Brown, was great, right? But you know, Jim Brown, I've always heard was a better lacrosse player that even a football player. I don't know if anybody's heard that. But great, just a great, great history. Thank you. Thank you. Thank you very much everybody.","Thank you very much. So I did a little research. The number of manufacturing jobs has been cut in half in Syracuse in this area, been cut in half in a very short period of time, folks. We got to do something about it. We're bringing our jobs back. Syracuse lost 40% of its manufacturing jobs since 2001. That's when China happened to join the world -- you know, the World Trade Organization.","Forget it. Look, we're not gonna let China get away with it. We're not gonna get -- we're not letting Mexico get away with it. Our companies are moving out of here. We're gonna stop it. We're gonna stop it fast. The labor force participation rate is 60%, which is a very terrible number. And as you know, infrastructure in the area, it's a disaster, right?","It's a disaster. So you lost your manufacturing, you lost your jobs. Other than that, you're doing great, right? Right? But we're gonna bring it back, we're gonna bring it back like never before. If I'm elected president. You're gonna have jobs coming to Syracuse, coming to New York, coming all over the country like never ever, ever before.","Remember that. Remember that. So, so many to -- thank you, folks. Thank you. Do we love our New York crowds? Do we love this? Man, it's good to be back. You know, we've been all over the country. We've been doing really well. We have millions of votes more than the second person, who by the way, lying Ted.","Lying Ted. He's a lying guy. He can lie with the best of them. Or you know a really good liar though doesn't get caught. He gets caught all the time. Remember what he did with Ben Carson, right? He said, he has left the race during the race. During the election, he's left the race. He didn't leave the race and he picked up votes -- folks, but just remember this, folks, Ted Cruz does not like you and he does not like New York.","Now you can say what you want but that's it. Now he's also in third place. So remember this, Kasich voted in favor of NAFTA. He's a believer in NAFTA. NAFTA destroyed New York State, New England, so many different places. We've lost our jobs to Mexico. We've lost our jobs all over. We are gonna straighten it out.","But the two people that are running against me and they're not doing very well, that I can tell you, but they shouldn't do very well, all right? Remember that. So we're having a good run. Don't believe the polls. Do not -- you know, I had one poll come out today that's so high. I don't want you to believe the polls.","Pretend we're losing. You know, I always tell politicians before I became a politician, but I'm not a politician. I'll never be a politician. But I always said, I've always sold them, pretend you're a little bit down. Because here's the key, on Tuesday, you have to go out and you have to vote. You have to get your friends because we have a movement going on. It's a movement like they've never seen in this country.","Even the pundits and these are the most dishonest people there are on Earth, OK? The press, the press is terrible. Terrible. Among the most dishonest people you will ever deal with anywhere in life. They don't tell the truth. Some of them do but not too many, believe me. But just remember, we have a movement going on and even the ones that don't like me, of which there are many, for a lot of reasons.","But even the ones that don't like Trump, they say, this is a phenomena like the country has never seen before, OK? And the only way we keep this phenomena going. You know, I go to Mobile Alabama. We had 35,000 people. We had 21,000 the other night in Albany. Albany has got the same problems you do. We had tremendous crowds no matter where I go. Rochester, we were in Rochester.","Yesterday, I was in Hartford, Connecticut. I was in Pennsylvania. Pittsburgh, good football town. But we're in Pittsburgh, we had tremendous crowds, no matter where we go. It's a movement like they've never seen before. It's a movement that maybe isn't gonna ever happen again. And the only way you stop the movement is if we don't do a good job on Tuesday.","That's what it is. We have to keep it going. You know one of the -- and you know what? Let me just tell you very simply. I'm self funding. I'm putting up my own money, OK? Is that smart? I don't know. You know, I always say, I never get enough credit for that. I never get enough credit. Because when somebody looks at me and nobody thinks that, oh well, he's putting up his own money.","Let me tell you what it means. These guys, these politicians are all bought and paid for. Remember it. Remember it. Look, I used to be the ultimate establishment person nine months ago. I was like the perfect person. I gave massive campaign contributions to everybody. I mean, I was like -- but I saw the system and the system is not working and the system is all rigged as far as the delegate stuff is going.","Now look, I guess I'm complaining because it's not fair to the people. The people have to be -- when you look at what happened in Wyoming and what's happening there, when you look at what's happening in Colorado, where the people, where the people never got a chance to vote and they're going nuts out there.","They're angry. The bosses took away their vote. And I wasn't gonna send big teams of people three, four months ago, have them out there. Again, I'm self funding. You know what, you will appreciate because you visit a lot of business people here. And we're gonna cut regulations, by the way, and we're lowering your taxes big league, big league.","But what a lot of you will appreciate and I think you'll appreciate this. I've spent less money than just about anybody else. And I'm, by far, in number one position. Isn't that good? Isn't that good? Isn't that the one you want as your president? You know, I've spent -- I remember when we were in New Hampshire, I spent $2 million and won.","And Jeb spent, I don't know, so much money. Many, many, many times that I'd came out not so good and all the others did too. What I like is spending the least and having the best result because that's what we want to do with our country. Spend the least and have the best result. So the system is rigged. It's a bad system.","It's a dirty system and we're gonna do something about it, and maybe that will take place the next time around, meaning in four years. But the system is a bad, bad system. And they've got to do something about it. The Republican National Committee, they better get going. Because I'll tell you what, you're gonna have a rough July at that convention.","You better get going and you better straighten out the system because the people want their vote. The people want to vote and they want to be represented properly. It's totally corrupt politics and it's happening in all fairness, the last person that's a fan of Bernie, you know. I'm no fan of Bernie. You know he went to see the Pope, five minutes.","Then he came out, he said, we talked about the environment. We talked about global warming. We talked about all these different things. And I said, wait a minute, he only there five minutes. So the Pope gave him five. I wonder why the Pope gave him five. He shouldn't be giving them that much time really.","But say what you want about Bernie Sanders. He wins, he wins, he wins, he wins, he wins and then you watch the pundits and they say, but he can't win. You know why? Because the system is corrupt. Because the system is broken. And the Democrats have a different system. They have superdelegates. But our system is worse than theirs.","In our system, they're not even voting. The bosses are picking the delegates and it's a very bad thing. Despite all of that, you know, who's gonna win? We're gonna win. We're gonna win despite all of that. I'll tell you a little story. So when I first started, everybody said, oh, he's just doing it for fun.","He'll just do it for a couple of weeks. Would have been a lot easier that way, I have to tell you. Who knew this was going to happen? Who knew? But all the geniuses, you know, all these pundits, I think they're smart and they're not. But they're saying, no, no, he's just gonna be in it for a little while and he's gonna have some fun and he likes it for his brand.","Believe me, my brand? It's the worst thing I can do for my brand, OK? Because I tell the truth. Because I talk about strong borders. Because I talk about the wall. Because I talk about crime has to stop, OK? Crime has to stop. And trade deals have to stop. And taking your jobs out of Syracuse and that all of these great places, it has to stop.","And it will stop instantaneously when I'm running things. Believe me, it's so fast. And we'll explain it in a second. We'll explain it. But just let -- let me just say this, we have a great country. We have unbelievable people. But we have leaders that are either corrupt or incompetent, for the most part.","And we have some good ones, like the press. There's a few good ones, not too many. But we have either corrupt or incompetent leaders. And we got to straighten out our country. And that's what I'm doing it for. I'm doing it for one reason. That's why I'm self funding. I'm spending a lot Of money. You know, I say, I'm not putting up -- no, that's OK. Don't worry about it. You know what happens?","OK, hold it. Hold it, Trump folks. Don't worry about it. You know what happens? My people always make all the noise because they say that's one of them, they start screaming. Now he's got a very weak voice. Don't worry about him. All right send in -- send him home to mommy. Go ahead, send him home. Get him out.","Get him out. Get him out. All right, get him out of here. Hey, you notice they're always right in front of the press, right? They're always right in front. Look, where they are, right smack in front of the press. The good news is the cameras follow and they see -- look at the kind of a crowd. Early, early on a Saturday in Syracuse.","Look at the crowd, hey. Does anybody have more fun than at a Trump rally? And I'll tell you something, the safest place on earth is at a Trump rally and you know that. It's true. They like to act like a big deal, you know? Like this guy, he raises his hand and they're gonna see a massive protest at Trump rally because they lie.","They're like lying Ted. They lie. All right. It is, it is a little funny though, here's another one, here's another one. You know, the biggest problem though are my people seriously because my people get all excited. Here they are. Here they are. You can't even hear the person. But that's OK. I love my people.","If my people want to -- if you feel good doing that, go ahead do it. Get him out. Get him out. My people are the greatest. I have to let him do it. I always say, don't pay any attention to him. We'll speak over him. But my people always like to point and go crazy but that's OK. All right, get him out. Get out of here, please.","Get out. Go. It's all right. Do we have a great time? Great. It's so funny. You know, when I first started, I was tough. I will say, get that guy out here. Get him out. And the press was killing me. So then I became very soft. I said, would you please remove him. And they said, something happened to Trump.","He's not tough anymore. All right, get him out. Get him out now. Get him out. You know, the problem is it's so densely packed. It's hard for the police to get over here. All right, you can't hear him. Don't worry. He's got a very weak voice. My people have the strong voice. You know, why we're safe? You know why these are safe places and it's true every time because the people in these rooms that I see and these stadiums, we had 25,000 people in Tampa, Orlando.","The people love each other and they protect each other, and that's the way the country has to be for everybody, for everybody. And we're going to bring our country back together. Everybody not just here. We're gonna bring everybody. African-American, white every person, old, young, men, women. We're gonna bring people together.","We're gonna bring people together. Folks, seriously, I'm totally serious. Look, we have a country that's got tremendous problems. We have $19 trillion in debt, soon going to -- think of it, trillion. Nobody even knows what a trillion dollars is, going to $21 trillion because of the horrible budget deal that was just made three months ago.","So here's the story. We are gonna unify our country. You know, people don't think of me necessarily when they think of unification. I'm a unifier. I'm somebody that gets along with people, all people. We gonna get along great. The workers, we're gonna get along so great. We're gonna have everybody in this country pull together.","We have to. We're a country. We're a country. We're gonna have strong borders. We're gonna let people in, but they're gonna come in legally. Remember that, legally. And remember what I said. Remember what I said. All people. We have a great representative group here. All people, men, women, young, old, African-American, white, everybody, Hispanic, Hispanic.","We love Hispanic. Hispanics are gonna -- you have to see the polls. I won in Nevada. They take a poll of the Hispanics leaving. Trump wins the poll. Everyone's surprised. I said, I'm not surprised because I produce jobs. What we need are jobs, and that's what we need. So I'm not surprised. But folks, we have -- and you're gonna hear this from me more and more.","We have to bring our country together. We're a divided nation and we're not gonna be a divided nation for long. And we have to bring everybody up economically and we have to stop the dividing. And we have a president who is a divider, whether you like it or don't. And we have a president -- when you look at African-American youth, 59% right now unemployment, African-American youth.","You look at so many other categories. The country is doing poorly. Our jobs are being taken. They're being shipped all over the world. They're going to Mexico. You saw what happened, Carrier. You saw what happened, Nabisco. You saw what happened, Ford. I mean one after another. Thousands and thousands of companies are leaving corporate inversion.","It's a disaster. They're leaving because taxes are too high, and because we allow them to leave. And then they go in, as an example, Carrier. It goes to Mexico. I'm not buying Carrier. I buy lots of air conditioners. Carrier is a good product. I don't buy it anymore. I won't buy it anymore. Let me just tell you, we should do that.","You know, if a company is not loyal to us -- in Japan, it's very hard -- and I tell you what, I give the Japanese people credit for this and maybe their politicians. But you know, in Japan, they don't want to buy American products. They don't want to buy. They want to buy products that are made in Japan.","Now you talk about a corporate imbalance. They send us millions of cars. We send them practically nothing. What do we get out of it? What do we get out of it? So we're gonna change it, folks. We're gonna have Apple products and other company's products made in the USA, where we have jobs. And it's gonna bring us together because jobs is like the great equalizer.","Jobs will bring us together. Strong -- real strong economies. I'm not talking about the economy. Right now, even the other side admits that the jobs we have are called bad jobs. They're bad jobs. They're not good jobs. The 5% unemployment number is a total phony number. It was made up by politicians to make them look good.","Our real number is in the 20s. And you know what, honestly, if it was really 5%, I wouldn't have all these people here, despite the wall, despite the border, despite the security, despite the fact I'll do the best job with the military. We still wouldn't have all of these people. We still. So we're gonna get smart.","We're gonna get really smart. Now take an example, Carrier, because I want to talk about jobs. When I'm here, at Syracuse, I want to talk about jobs for a specific reason because you're being drained. You're being drained. And I give credit that you stay here. You're being drained. You love your community.","It's beautiful. It's great. You love your people. You love your house. You don't want to leave because some politicians don't know what they're doing. Just hold on folks because I'm telling you, I'm bringing him back, OK? It's gonna be brought back. And I'm gonna be very loyal to New York, New York State.","I'm gonna be loyal because this is my place. This is my place. Remember that. Remember that. You know, you have these guys like Ted Cruz, where he talked about New York values. He talked about New York values with hatred in his heart. When he during that debate he looked at me and he thought he was gonna make some points.","I don't even think he's a very good debater to be perfectly honest. But he talked about New York values and you could see there was a lot of hatred toward New York the way he said it. Now he comes, well, I meant liberals. You know, give me a break. This guy is so bad for New York. Look at what happened with Sandy.","Look at what happened with the aid for certain things. Look at what happened with the votes that he gave to New York. Guess what? He didn't give them to New York. He was against New York. And remember, Kasich NAFTA disaster. It took you jobs and he voted for it and was in favor of it. And they both want TPP, that's Trans Pacific Partnership.","It's gonna make NAFTA look like a baby. It's gonna make NAFTA -- Trans-Pacific Partnership, 6,000 pages, every country in that deal has read every single word and they've negotiated every single sentence. And our people, I'll bet you, we have nobody practically that even looked at the document. We just signed these stupid deals and we get ripped off and wiped out.","TPP is gonna take the jobs that you have remaining in Syracuse and in New York State. It's gonna take them away. We have to stop it. It's another Obama deal. Obama is the worst negotiator in the world. Except when it comes to negotiating with the Republicans, he always gets what he wants, right? So here's the story.","We're gonna make things great. We're gonna go to companies that want to leave and we're gonna say, you want to leave? Take Carrier. I used Carrier as an example. They left a wonderful location in Indiana. They left a wonderful location, 1,400 people. It looked like they had some wise guy mid-level manager -- you all saw the clip on television.","He gets up, he go, we're moving to Mexico. Thank you. It's like everybody fired. They've been there for 25, 30 years. 35 years. We're moving to Mexico he says. So here's my story. You know, my wife and my daughter, Ivanka, Melania, they all say -- and my kids. They say, hey, dad, you're really, really, really smart.","Why don't you act a little more presidential, it would be good. I said, I can't act presidential until I finish the victory, right? We got to, we got to win. They want me to be nice. Remember Jeb Bush when he said, I don't like Donald Trump's tone. Well, here's the problem. Here's the problem. They're chopping off heads in the Middle East.","They're drowning people in the Middle East. If you're a Christian in the Middle East, you don't even have a chance. And if you're a Christian in the Middle East, you can't even come to this country. If you're Muslim, it's easy. If you're Christian, it's impossible to come into this country, OK? That's no good.","So here's the story. They're chopping off heads. They're drowning people 50 at a time in these massive heavy steel cages. Boom. Drop it. Pull it up a half an hour later. And I have Hillary, and I have Jeb before he lost, before he lost. But I have Hillary saying, I don't like the tone of Donald Trump. Folks, we need a tough tone.","Believe me. We need a tough. And we have to be unpredictable. You know, we're so predictable militarily, trade deals. We're like the stupid people. We're represented by people that well, in many cases, incompetent, and in many cases, they're very smart because they get money from all of these donors and these donors want deals to be made.","I have a friend who said very strongly. He's very smart guy. He said, Donald, I don't understand. How did these senators and this one particular senator, how did he approve the deal? Is he stupid? I said, no, no he's smart. He's approved it because his lobbyist told him he has to. Because the company gave him millions of dollars, put millions of dollars into these phony PACs, which are total phony deals, by the way.","You know, if I ever opened a PAC, I would have had the -- I think Jeb had the biggest PAC, $148 million. I could have I could have done that times 10. In fact, I must tell you this, I don't know if I've ever said it to this extent. I sort of feel stupid not taking all this money. I have these guys, Donald, I'd like to give you $10 million toward your campaign.","I said, no, I don't want it. Donald, I'd like to give you $5 million toward your campaign. No, I don't want it. And you know, this is like counter to my life. My whole life I've been taken money. I make money. I make money. I took a million dollar loan. In a relatively short period of time, I built a company that's worth more than $10 billion, OK? With a million dollar loan.","That's how I started. And I built a company with some of the greatest assets in the world, very little debt. I filed all the papers. You know, nobody knew. The press was devastated. They went up and they looked, they said, wow, this is a great company. They couldn't believe. It was like a feeding frenzy.","In fact, a friend of mine said, now I know you're really rich because you would never run. Can you imagine if I filed bad papers? If I filed papers where it wasn't a great company? I built a great company, great assets, some of the greatest most iconic assets in the world. Turnberry in Scotland, Doral in Miami, hundreds and hundreds of acres in the middle of Miami, buildings all over the place.","In addition, we had great success in television. We had great success in the book world. The Art of the Deal, one of the most successful books ever done in business, maybe the most successful. See, I used to say, the most here it is right there. There is another one. The most successful business book ever written.","But I don't do that now because they'll go back and examine. Well, let's see, 20 years ago, somebody wrote a book. Let me just tell you. So I say one of the most successful but I think it might be the most successful. So I've had great success. And when I tell you these things I'm not saying it in a bragging way.","I'm saying that's the kind of thinking we need in this country at least until we straighten it out. We need that kind of thinking. But so often I'm asked like, what would you do? What would you do about ISIS? And when would you attack them? And where would you attack them? And how would you do it? And I say, I don't want to answer.","You know, I want to be like why do we always have to tell the enemy what our plans are? Why? Why? When Obama a number of months ago said, he's sending 50 of our finest, finest, finest young soldiers over to Iraq, over to Syria and he goes and makes an announcement. And I said, why is he doing that? Why is he doing that?","They have a target, right now, a target on their back. Everybody is looking for him. If he doesn't announce it, they can do their job. Special people. But now everybody over there is looking for him. If he didn't, if he didn't talk -- you know, it's these politicians, they have to talk. All talk, no action.","We want results. We don't want talk. Is that right? We want results. And I've been saying for years because I have a lot of fans here. They've been following me and we just have a great relay. By the way, the most loyal supporters anywhere probably in the world in this country. A woman was on television.","I got to tell you, I've said this a couple of times over the last few days but I love this woman. I will search the world for her. She was on television. She's probably 55 or 60 years old. She had 10 women behind her that were Trump fans. You know, they had buttons all over, buttons on their head, buttons in their hair.","And this wise guy walks up to him, one of these characters right back here. Walks up -- look at all those live television shots. Every time I got to be live. I'd like that to be live so we can really open up. But -- so he's on television. And he said, why does it take for you to drop Mr. Trump and go with someone else?","She said, don't talk anymore. Don't talk. There is absolutely nothing that man can do that we will drop and the women behind started screaming. And I told people, I said, and you know what I wanted to do? I want to get up and hug and kiss that television set. But we have the most loyal and we have the smartest people too.","We have the smartest people. You know, there was a time when they say, oh, these are the least educated. Let me tell you, we have the smartest people and the polls in New York are saying I have the top educated and I have people without a lot of education. I'm winning with men. I'm winning with women. We're winning with every single category.","Now you got to get out and produce on Tuesday. But we're winning with every single category, every single. So here, I got it. I have to go back because you know we're gonna talk for a second about the border, but we're gonna talk about Carrier first. So I'm gonna call Carrier and I'm gonna say, congratulations on your new plant.","I'll bet it's gonna be lovely. And I have to do this. This is why my kids say, don't call. Don't do it yourself. I said I have to. This is too easy, OK? Now I have the greatest business people in the world endorse me. Carl Icahn, great business people, endorse me. These are people that will represent us with trade deals.","Not political hacks that get taken to the cleaner every -- I have guys that can't sleep at night. They turn and toss and sweat. They can't sleep because all they can think of -- they're consumed with doing this deal. They want the best in the world. And I know the best. I know guys that are overrated. I know people you never heard of that are better than all of them.","But these are people that don't sleep. They toss and turn and sweat. All they can think about and they'll be thinking about the deal with China. The deal with Japan. The deal with Mexico. They don't want money. They don't even want to do it beyond the deal. They will make the greatest deals. It will bring our wealth back and it will bring our jobs back.","And with Carrier, and with Carrier -- but I have to do it myself because it's too easy. Now Carrier, it could be Ford, could be Nabisco and Nabisco is leaving Chicago. They're moving to Mexico. They're big plant moving to Mexico. No more Oreos, folks. I'm not eating Oreos anymore. So listen. So with Carrier, I called the president the Carrier.","This is President Trump calling. Can you believe I'm talking to an air conditioning guy? Can you believe this? But I have to do it myself. My daughter would go crazy. She said, dad, that's not presidential. I'd say, who cares? It's too easy. They said that in the last debate. They said, Dad, Dad, you're winning every debate.","Every debate they say I won. You saw that the polls -- Drudge, who's an incredible guy, by the way, Drudge. He's incredible. Matt Drudge. But Drudge has a poll, Time magazine has a poll, Slate. They have like seven or eight polls. Every single debate, I've won. Every single debate. I didn't even know if I could debate.","I never did this stuff before. That's what the politicians do. But every single debate. What happens is I call Carrier, I say, look, here's the story. You are gonna pay. First of all, enjoy your plant. Enjoy your life. But you just left 1,400 great people in Indiana and now you're moving to Mexico. And you think you're gonna make air conditioning units and sell them to the United States and there's not gonna be tax.","Well, there you're wrong. You're gonna pay a 35% tax on every single unit you sell to the United States. Every single unit. These companies that are leaving us have to know that when you leave us and you fire all our people from Syracuse and Albany and Rochester and all of the places that I'm going to and Best Page, which was an unbelievable rally.","But when you fire -- I went to Suffolk, which I know all my life. I love Suffolk. I mean, I see all these empty factory buildings. It's ridiculous. You have to know when you move to Mexico or wherever you go, but when you move to Mexico that if you move there's gonna be a penalty. It's gonna be -- we're gonna tax your product when you come back in. And you know what, folks, we may have lost those jobs but we're gonna reduce the hell out of your taxes because we're gonna make a fortune when they sell their product to us, OK? But I'll -- and the politicians have never figured it out.","You know, it's called corporate inversion. They don't even know what that word is. It's called corporate inversion. They never figured. They're working on a plan. They want to keep companies. They've been working on this plan for five years. They don't have a plan. Here's the plan, folks. I'm a conservative.","I'm a free trader. But when you free trade, you have to have smart people representing you. We have very, very dumb people and we have people that are all taken care of by the money people and the special interests. And I see it because, by the way, I have had $94 million in negative ads. And you know, it's by people that I never even met.","Who the hell is the Ricketts family from Chicago? They put up millions. They own the Chicago Cubs. I have a great building in Chicago. I think the Chicago Cubs are gonna do terribly this year, OK? You want to know the truth. I don't even know who these people are. But you know what, a guy named Zinger. Who the hell ever heard of it? I'll tell you, I'll tell you a little secret.","I saw -- I was surprised because I thought I was friends with Coke brothers. I thought I was their friend. But somebody said, they're linked to a certain PAC. The reason they want to not have me get elected is that I know the game better than any of them know it. I know where the skeletons are, folks. I know.","I know all about the games. I know them better than they know and they don't want it. Plus, they don't like the fact -- one of them said, we hate the fact that Donald isn't that guy. I know most of these men. We hate the fact that Donald doesn't want any money. Because if I don't want any money, they don't have any control.","Does that make sense? They have no control. They have no control. So I tell Carrier, it's a 35% tax on every single unit you selling. And now we're gonna have a real border. We're not going have a Swiss cheese border, right? And by the way, the border patrol 16,500 border patrol agents endorsed me last week.","First time they've ever endorsed a presidential candidate. And Sheriff Joe Arpaio, who's a great guy from Arizona. There's nobody tougher than Sheriff Joe on the border. Sheriff Joe endorsed me. So we know who's gonna be at the border. We're gonna have a report. And here's what Carrier is gonna say to me. They're gonna say, Mr. President, you can't do this.","You can't. I said, oh, yes I can. And then about 24 hours, I will be inundated with calls from people, special interest, lobbyists. But I don't care about these people. I don't care. They didn't give me anything. I don't want their money. They didn't give me anything. So I'll be inundated. I won't take the call.","I won't even bother talking to him. Why should I talk to him? It's a waste of a call. And I will get a call, I guarantee you, within 24 hours from the head of Carrier saying, Mr. President, we've decided to stay in the United States. That's what's gonna happen. 100%. And by the way, that's a 100%. That's not like 89.3%. That's 100%. So here's what we have to do. We're gonna build a tremendous border.","We're gonna have a great border. We're gonna have people come in. We want people to come into our country. They have to come in but they're gonna go through a process and they're gonna come in legally. But we're gonna build a wall. And it's gonna be an incredible wall. It's gonna be a real wall. It's gonna keep drugs out.","And it's gonna keep illegal immigrants out because we can't do it. We can't afford it. We're a debtor nation, folks. We can't afford it. We are not letting people from Syria with no documentation, with no paperwork, with no anything come into our country. And if they do come in, we're gonna have to sadly send them back.","We can not take them in our country. You saw what two people did where the woman radicalized the guy and they killed 14 co-workers that they had good relationships with. And everybody said, what happened? They were given a baby shower, a little time before. You saw what happened. We can't do it, folks. We don't know where these people come from.","Zero documentation. Zero paperwork. As far as the border itself, we're going to stop. It's killing our jobs. It's -- you look at Kate in San Francisco, what happened. You look at Jameel in California, what happened. Shot three times in the face by a person that should have never been allowed in this country.","And frankly, I have great relationships with Mexico. I have great relationships with the Hispanics because I employ thousands and thousands of people. They're great. But their government is too smart for our government. They could stop this problem even before the wall is built, but they don't want to. The drugs are pouring in. I won New Hampshire and New Hampshire people.","I go to meetings and I say, what's your biggest problem? They said, heroin. I said, you've got to be kidding. Look, how beautiful this place is. You know, you see the beautiful trees and roadways and lakes. Heroin? How does heroin work with new Hampshire. New Hampshire has a tremendous heroin problem and so do you, by the way, a tremendous heroin.","It comes from the southern border. They drive it right through like it doesn't even exist. We get the drugs. They get the cash. No more, folks. It's gonna end, OK? It's gonna end. No more. They are poisoning our youth. Our youth doesn't have a chance. They're poisoning our youth. Our youth can buy this stuff for less money than it costs to buy candy.","Our youth is being destroyed. They're being poisoned and even beyond our youth, but they're being poisoned and we're gonna stop it. So here's the story. We're going to build a great wall. Who is gonna pay for the wall? Who? By the way, 100%. These politicians, these politicians come up to me and they say, you can't build a wall.","This was like a year ago. You can't build a wall. I said, of course, you can. Now they don't say that anymore. Now they say, you can't get Mexico to pay. Politicians will never be able to do it. For me, it's easy. It's so easy. Because you know why? We have a trade deficit with Mexico of $58 billion a year.","That wall is gonna cost $10 billion to build and it's gonna be so beautiful. Cause someday maybe they'll name it after Trump, right? They'll be the Trump wall. I don't that. I don't want. But it's gonna be a real wall. It's gonna be an effective wall and walls work. Well, you have to do is ask Israel. Walls work.","And we are going to stop illegal immigration and we are going to stop drugs from destroying and poisoning our youth. Believe me. So here's the story sort of wrap it up. Here's the -- this is so -- I love being with you people. The same accent. I have the same accent. I have -- unfortunately, for all of us, right?","I have that same beautiful little twang, as you do. You know, Hillary can talk, although I will say, I do love Arkansas. I won Arkansas. I won Alabama. I won the South. I won the South. I won Florida. You know, one story I have to tell you about this just to show you how crooked politics is. But sometimes -- so Florida was going to be won easily by Jeb Bush, ex-governor.","He was gonna win it or Rubio. Then they see me come into the race. So they fixed it. So what they did is they rejiggered it. So winner take all. This means that Trump won't win Florida because you have the governor coming in and you have the senator. So it was rigged. Like everything else in this party, it was rigged.","It was rigged so that I couldn't win. So now, winner take all. 99 delegates just about the top outside of California where I think we're gonna do great, by the way. 99 delegates winner take all. They changed it so that I wouldn't get any delegates. Then they do a poll. Now it's changed. Then they do a poll, Trump 48; Bush, 12; Rubio, 14. And they say, oh my god, what did we do? We got to change it back.","And I end up winning the state of Florida in a landslide. So you never know how it turns out. OK, so ready? We are gonna rebuild our military so it's bigger, better, stronger than it ever was before. Ever. And by the way, I love this lady. I love this lady. I love this lady. Take your time fellas. Take your time.","Take your time. I love you, man. This is a great guy. He was probably waiting here five hours. We love you. Hey, give me. I love that guy. You know, he's probably been waiting here for like five hours. So tough stuff. But boy, did we have -- nobody -- I'm telling you, nobody has the loyalty that we have.","These people, they're amazing. You people are amazing and we're gonna really take it. So here's what we're gonna do. Thank you. Here's what we're gonna do. You gotta go out. You're gonna remember this afternoon. You gotta go out. You gotta vote. And I promise you one thing. I'm gonna do a great job for you, folks.","I don't want your money. I don't want anything. I want your vote. Bring everybody you know to vote. Do whatever you can. Just go out and vote and you leave the rest to me because I'm working for you. I'm your messenger. You know, when they talk about, when they talk about this incredible group of people and they actually say, it's a phenomena.","They've never seen it before. All -- every time. Look at this, I mean on a Saturday morning, look at all these people filling up a convention center. So here's what's gonna happen. We don't win anymore. We don't win anymore. We don't win with our military. We can't beat ISIS. By the way, we're gonna knock the hell out of them.","We're gonna knock the hell out of them. We don't win for our great vets. We're gonna win for our vets. We're gonna take care of our vets. These are our great people. We don't win our trade. We never win on trade. We're losing billions and billions and billions of dollars a year. More money than anybody's ever heard of. We're gonna win on trade.","We're gonna win with education. We're gonna get rid of Obamacare. We're gonna get rid of Obamacare, remember. Just remember I said it. It's gonna fall of its own weight anyway by '17. But we're gonna get rid of it. We're gonna repeal it and replace it with something so much better for so much less money.","We're gonna get rid of Common Core and we're bringing our education local. We're gonna go local. We are going to win at the border. We are going to have the strongest borders and great people are coming in. They're coming in through a legal process. But we're gonna finally have borders. So we have our country back again.","And here's what you're gonna do. You're gonna remember this day and you're gonna remember more importantly, Tuesday. And you're gonna say to your family, to your friends, to your husbands, to your wives, to whoever. You're gonna say, that was the single greatest vote I've ever cast. That never in my life have I been so happy to cast a vote.","And you're gonna remember that vote in two years and four years and 20 years and 30 years from now. And you're gonna say again and again, that was the greatest vote I've ever cast. Because you know what's gonna happen, folks? We're gonna start winning again. We're gonna win with trade. We're gonna win with jobs.","We're gonna win with economy. We're gonna win with our military. We're gonna win for our vets. We're gonna win with education. We're gonna win with health care. We're gonna win so much you're gonna say, please, please -- I love doing this. I do love it. You're gonna say, Mr. President, please. We can't stand it. We're winning too much.","We can't stand it. Please, let's not win all the time. And I'm gonna say, I'm sorry, we're gonna win more and more and more. And we're gonna make America great again. I love you. I love you Syracuse. We're gonna win. Thank you. I love you. Thank you, everybody."],"text":" Thank you, everybody. Wow. Look at all those people pouring in. We said, we'll start now. We're not gonna wait, right? Let's go. We'll start. Wow. Yeah, we have thousands of people outside but were coming in. They'll come in. By the time they get in, we'll be finished. But that's OK, right? Thank you, everybody. So I know a lot about Syracuse. You love Syracuse. I love Syracuse. We love New York. We love the United States of America, right? Better believe it. And folks, we're going to make our country strong. We're gonna make America great again. But you know what? We're gonna bring back jobs because we need jobs here. We need jobs. So before we came up, I had one of my people just do a couple of numbers -- thank you. Get him out. Never ends. Folks, we're gonna take back our country. We're gonna take back our country. Believe me, believe me. So before I came up, I had one of my people, I said, go to the books, the real straight books. Tell me and I know all about Syracuse. I've been up here so many times. I have so many friends. I do happen to love your basketball team. They did a good job, right? They did a good job. And you happen to have an excellent coach. I don't know if you agree but I think you have, you know, he's been doing that a long time and he's kept it good. And you really do have a great thing. And you know, hey, Jim Brown, was great, right? But you know, Jim Brown, I've always heard was a better lacrosse player that even a football player. I don't know if anybody's heard that. But great, just a great, great history. Thank you. Thank you. Thank you very much everybody. Thank you very much. So I did a little research. The number of manufacturing jobs has been cut in half in Syracuse in this area, been cut in half in a very short period of time, folks. We got to do something about it. We're bringing our jobs back. Syracuse lost 40% of its manufacturing jobs since 2001. That's when China happened to join the world -- you know, the World Trade Organization. Forget it. Look, we're not gonna let China get away with it. We're not gonna get -- we're not letting Mexico get away with it. Our companies are moving out of here. We're gonna stop it. We're gonna stop it fast. The labor force participation rate is 60%, which is a very terrible number. And as you know, infrastructure in the area, it's a disaster, right? It's a disaster. So you lost your manufacturing, you lost your jobs. Other than that, you're doing great, right? Right? But we're gonna bring it back, we're gonna bring it back like never before. If I'm elected president. You're gonna have jobs coming to Syracuse, coming to New York, coming all over the country like never ever, ever before. Remember that. Remember that. So, so many to -- thank you, folks. Thank you. Do we love our New York crowds? Do we love this? Man, it's good to be back. You know, we've been all over the country. We've been doing really well. We have millions of votes more than the second person, who by the way, lying Ted. Lying Ted. He's a lying guy. He can lie with the best of them. Or you know a really good liar though doesn't get caught. He gets caught all the time. Remember what he did with Ben Carson, right? He said, he has left the race during the race. During the election, he's left the race. He didn't leave the race and he picked up votes -- folks, but just remember this, folks, Ted Cruz does not like you and he does not like New York. Now you can say what you want but that's it. Now he's also in third place. So remember this, Kasich voted in favor of NAFTA. He's a believer in NAFTA. NAFTA destroyed New York State, New England, so many different places. We've lost our jobs to Mexico. We've lost our jobs all over. We are gonna straighten it out. But the two people that are running against me and they're not doing very well, that I can tell you, but they shouldn't do very well, all right? Remember that. So we're having a good run. Don't believe the polls. Do not -- you know, I had one poll come out today that's so high. I don't want you to believe the polls. Pretend we're losing. You know, I always tell politicians before I became a politician, but I'm not a politician. I'll never be a politician. But I always said, I've always sold them, pretend you're a little bit down. Because here's the key, on Tuesday, you have to go out and you have to vote. You have to get your friends because we have a movement going on. It's a movement like they've never seen in this country. Even the pundits and these are the most dishonest people there are on Earth, OK? The press, the press is terrible. Terrible. Among the most dishonest people you will ever deal with anywhere in life. They don't tell the truth. Some of them do but not too many, believe me. But just remember, we have a movement going on and even the ones that don't like me, of which there are many, for a lot of reasons. But even the ones that don't like Trump, they say, this is a phenomena like the country has never seen before, OK? And the only way we keep this phenomena going. You know, I go to Mobile Alabama. We had 35,000 people. We had 21,000 the other night in Albany. Albany has got the same problems you do. We had tremendous crowds no matter where I go. Rochester, we were in Rochester. Yesterday, I was in Hartford, Connecticut. I was in Pennsylvania. Pittsburgh, good football town. But we're in Pittsburgh, we had tremendous crowds, no matter where we go. It's a movement like they've never seen before. It's a movement that maybe isn't gonna ever happen again. And the only way you stop the movement is if we don't do a good job on Tuesday. That's what it is. We have to keep it going. You know one of the -- and you know what? Let me just tell you very simply. I'm self funding. I'm putting up my own money, OK? Is that smart? I don't know. You know, I always say, I never get enough credit for that. I never get enough credit. Because when somebody looks at me and nobody thinks that, oh well, he's putting up his own money. Let me tell you what it means. These guys, these politicians are all bought and paid for. Remember it. Remember it. Look, I used to be the ultimate establishment person nine months ago. I was like the perfect person. I gave massive campaign contributions to everybody. I mean, I was like -- but I saw the system and the system is not working and the system is all rigged as far as the delegate stuff is going. Now look, I guess I'm complaining because it's not fair to the people. The people have to be -- when you look at what happened in Wyoming and what's happening there, when you look at what's happening in Colorado, where the people, where the people never got a chance to vote and they're going nuts out there. They're angry. The bosses took away their vote. And I wasn't gonna send big teams of people three, four months ago, have them out there. Again, I'm self funding. You know what, you will appreciate because you visit a lot of business people here. And we're gonna cut regulations, by the way, and we're lowering your taxes big league, big league. But what a lot of you will appreciate and I think you'll appreciate this. I've spent less money than just about anybody else. And I'm, by far, in number one position. Isn't that good? Isn't that good? Isn't that the one you want as your president? You know, I've spent -- I remember when we were in New Hampshire, I spent $2 million and won. And Jeb spent, I don't know, so much money. Many, many, many times that I'd came out not so good and all the others did too. What I like is spending the least and having the best result because that's what we want to do with our country. Spend the least and have the best result. So the system is rigged. It's a bad system. It's a dirty system and we're gonna do something about it, and maybe that will take place the next time around, meaning in four years. But the system is a bad, bad system. And they've got to do something about it. The Republican National Committee, they better get going. Because I'll tell you what, you're gonna have a rough July at that convention. You better get going and you better straighten out the system because the people want their vote. The people want to vote and they want to be represented properly. It's totally corrupt politics and it's happening in all fairness, the last person that's a fan of Bernie, you know. I'm no fan of Bernie. You know he went to see the Pope, five minutes. Then he came out, he said, we talked about the environment. We talked about global warming. We talked about all these different things. And I said, wait a minute, he only there five minutes. So the Pope gave him five. I wonder why the Pope gave him five. He shouldn't be giving them that much time really. But say what you want about Bernie Sanders. He wins, he wins, he wins, he wins, he wins and then you watch the pundits and they say, but he can't win. You know why? Because the system is corrupt. Because the system is broken. And the Democrats have a different system. They have superdelegates. But our system is worse than theirs. In our system, they're not even voting. The bosses are picking the delegates and it's a very bad thing. Despite all of that, you know, who's gonna win? We're gonna win. We're gonna win despite all of that. I'll tell you a little story. So when I first started, everybody said, oh, he's just doing it for fun. He'll just do it for a couple of weeks. Would have been a lot easier that way, I have to tell you. Who knew this was going to happen? Who knew? But all the geniuses, you know, all these pundits, I think they're smart and they're not. But they're saying, no, no, he's just gonna be in it for a little while and he's gonna have some fun and he likes it for his brand. Believe me, my brand? It's the worst thing I can do for my brand, OK? Because I tell the truth. Because I talk about strong borders. Because I talk about the wall. Because I talk about crime has to stop, OK? Crime has to stop. And trade deals have to stop. And taking your jobs out of Syracuse and that all of these great places, it has to stop. And it will stop instantaneously when I'm running things. Believe me, it's so fast. And we'll explain it in a second. We'll explain it. But just let -- let me just say this, we have a great country. We have unbelievable people. But we have leaders that are either corrupt or incompetent, for the most part. And we have some good ones, like the press. There's a few good ones, not too many. But we have either corrupt or incompetent leaders. And we got to straighten out our country. And that's what I'm doing it for. I'm doing it for one reason. That's why I'm self funding. I'm spending a lot Of money. You know, I say, I'm not putting up -- no, that's OK. Don't worry about it. You know what happens? OK, hold it. Hold it, Trump folks. Don't worry about it. You know what happens? My people always make all the noise because they say that's one of them, they start screaming. Now he's got a very weak voice. Don't worry about him. All right send in -- send him home to mommy. Go ahead, send him home. Get him out. Get him out. Get him out. All right, get him out of here. Hey, you notice they're always right in front of the press, right? They're always right in front. Look, where they are, right smack in front of the press. The good news is the cameras follow and they see -- look at the kind of a crowd. Early, early on a Saturday in Syracuse. Look at the crowd, hey. Does anybody have more fun than at a Trump rally? And I'll tell you something, the safest place on earth is at a Trump rally and you know that. It's true. They like to act like a big deal, you know? Like this guy, he raises his hand and they're gonna see a massive protest at Trump rally because they lie. They're like lying Ted. They lie. All right. It is, it is a little funny though, here's another one, here's another one. You know, the biggest problem though are my people seriously because my people get all excited. Here they are. Here they are. You can't even hear the person. But that's OK. I love my people. If my people want to -- if you feel good doing that, go ahead do it. Get him out. Get him out. My people are the greatest. I have to let him do it. I always say, don't pay any attention to him. We'll speak over him. But my people always like to point and go crazy but that's OK. All right, get him out. Get out of here, please. Get out. Go. It's all right. Do we have a great time? Great. It's so funny. You know, when I first started, I was tough. I will say, get that guy out here. Get him out. And the press was killing me. So then I became very soft. I said, would you please remove him. And they said, something happened to Trump. He's not tough anymore. All right, get him out. Get him out now. Get him out. You know, the problem is it's so densely packed. It's hard for the police to get over here. All right, you can't hear him. Don't worry. He's got a very weak voice. My people have the strong voice. You know, why we're safe? You know why these are safe places and it's true every time because the people in these rooms that I see and these stadiums, we had 25,000 people in Tampa, Orlando. The people love each other and they protect each other, and that's the way the country has to be for everybody, for everybody. And we're going to bring our country back together. Everybody not just here. We're gonna bring everybody. African-American, white every person, old, young, men, women. We're gonna bring people together. We're gonna bring people together. Folks, seriously, I'm totally serious. Look, we have a country that's got tremendous problems. We have $19 trillion in debt, soon going to -- think of it, trillion. Nobody even knows what a trillion dollars is, going to $21 trillion because of the horrible budget deal that was just made three months ago. So here's the story. We are gonna unify our country. You know, people don't think of me necessarily when they think of unification. I'm a unifier. I'm somebody that gets along with people, all people. We gonna get along great. The workers, we're gonna get along so great. We're gonna have everybody in this country pull together. We have to. We're a country. We're a country. We're gonna have strong borders. We're gonna let people in, but they're gonna come in legally. Remember that, legally. And remember what I said. Remember what I said. All people. We have a great representative group here. All people, men, women, young, old, African-American, white, everybody, Hispanic, Hispanic. We love Hispanic. Hispanics are gonna -- you have to see the polls. I won in Nevada. They take a poll of the Hispanics leaving. Trump wins the poll. Everyone's surprised. I said, I'm not surprised because I produce jobs. What we need are jobs, and that's what we need. So I'm not surprised. But folks, we have -- and you're gonna hear this from me more and more. We have to bring our country together. We're a divided nation and we're not gonna be a divided nation for long. And we have to bring everybody up economically and we have to stop the dividing. And we have a president who is a divider, whether you like it or don't. And we have a president -- when you look at African-American youth, 59% right now unemployment, African-American youth. You look at so many other categories. The country is doing poorly. Our jobs are being taken. They're being shipped all over the world. They're going to Mexico. You saw what happened, Carrier. You saw what happened, Nabisco. You saw what happened, Ford. I mean one after another. Thousands and thousands of companies are leaving corporate inversion. It's a disaster. They're leaving because taxes are too high, and because we allow them to leave. And then they go in, as an example, Carrier. It goes to Mexico. I'm not buying Carrier. I buy lots of air conditioners. Carrier is a good product. I don't buy it anymore. I won't buy it anymore. Let me just tell you, we should do that. You know, if a company is not loyal to us -- in Japan, it's very hard -- and I tell you what, I give the Japanese people credit for this and maybe their politicians. But you know, in Japan, they don't want to buy American products. They don't want to buy. They want to buy products that are made in Japan. Now you talk about a corporate imbalance. They send us millions of cars. We send them practically nothing. What do we get out of it? What do we get out of it? So we're gonna change it, folks. We're gonna have Apple products and other company's products made in the USA, where we have jobs. And it's gonna bring us together because jobs is like the great equalizer. Jobs will bring us together. Strong -- real strong economies. I'm not talking about the economy. Right now, even the other side admits that the jobs we have are called bad jobs. They're bad jobs. They're not good jobs. The 5% unemployment number is a total phony number. It was made up by politicians to make them look good. Our real number is in the 20s. And you know what, honestly, if it was really 5%, I wouldn't have all these people here, despite the wall, despite the border, despite the security, despite the fact I'll do the best job with the military. We still wouldn't have all of these people. We still. So we're gonna get smart. We're gonna get really smart. Now take an example, Carrier, because I want to talk about jobs. When I'm here, at Syracuse, I want to talk about jobs for a specific reason because you're being drained. You're being drained. And I give credit that you stay here. You're being drained. You love your community. It's beautiful. It's great. You love your people. You love your house. You don't want to leave because some politicians don't know what they're doing. Just hold on folks because I'm telling you, I'm bringing him back, OK? It's gonna be brought back. And I'm gonna be very loyal to New York, New York State. I'm gonna be loyal because this is my place. This is my place. Remember that. Remember that. You know, you have these guys like Ted Cruz, where he talked about New York values. He talked about New York values with hatred in his heart. When he during that debate he looked at me and he thought he was gonna make some points. I don't even think he's a very good debater to be perfectly honest. But he talked about New York values and you could see there was a lot of hatred toward New York the way he said it. Now he comes, well, I meant liberals. You know, give me a break. This guy is so bad for New York. Look at what happened with Sandy. Look at what happened with the aid for certain things. Look at what happened with the votes that he gave to New York. Guess what? He didn't give them to New York. He was against New York. And remember, Kasich NAFTA disaster. It took you jobs and he voted for it and was in favor of it. And they both want TPP, that's Trans Pacific Partnership. It's gonna make NAFTA look like a baby. It's gonna make NAFTA -- Trans-Pacific Partnership, 6,000 pages, every country in that deal has read every single word and they've negotiated every single sentence. And our people, I'll bet you, we have nobody practically that even looked at the document. We just signed these stupid deals and we get ripped off and wiped out. TPP is gonna take the jobs that you have remaining in Syracuse and in New York State. It's gonna take them away. We have to stop it. It's another Obama deal. Obama is the worst negotiator in the world. Except when it comes to negotiating with the Republicans, he always gets what he wants, right? So here's the story. We're gonna make things great. We're gonna go to companies that want to leave and we're gonna say, you want to leave? Take Carrier. I used Carrier as an example. They left a wonderful location in Indiana. They left a wonderful location, 1,400 people. It looked like they had some wise guy mid-level manager -- you all saw the clip on television. He gets up, he go, we're moving to Mexico. Thank you. It's like everybody fired. They've been there for 25, 30 years. 35 years. We're moving to Mexico he says. So here's my story. You know, my wife and my daughter, Ivanka, Melania, they all say -- and my kids. They say, hey, dad, you're really, really, really smart. Why don't you act a little more presidential, it would be good. I said, I can't act presidential until I finish the victory, right? We got to, we got to win. They want me to be nice. Remember Jeb Bush when he said, I don't like Donald Trump's tone. Well, here's the problem. Here's the problem. They're chopping off heads in the Middle East. They're drowning people in the Middle East. If you're a Christian in the Middle East, you don't even have a chance. And if you're a Christian in the Middle East, you can't even come to this country. If you're Muslim, it's easy. If you're Christian, it's impossible to come into this country, OK? That's no good. So here's the story. They're chopping off heads. They're drowning people 50 at a time in these massive heavy steel cages. Boom. Drop it. Pull it up a half an hour later. And I have Hillary, and I have Jeb before he lost, before he lost. But I have Hillary saying, I don't like the tone of Donald Trump. Folks, we need a tough tone. Believe me. We need a tough. And we have to be unpredictable. You know, we're so predictable militarily, trade deals. We're like the stupid people. We're represented by people that well, in many cases, incompetent, and in many cases, they're very smart because they get money from all of these donors and these donors want deals to be made. I have a friend who said very strongly. He's very smart guy. He said, Donald, I don't understand. How did these senators and this one particular senator, how did he approve the deal? Is he stupid? I said, no, no he's smart. He's approved it because his lobbyist told him he has to. Because the company gave him millions of dollars, put millions of dollars into these phony PACs, which are total phony deals, by the way. You know, if I ever opened a PAC, I would have had the -- I think Jeb had the biggest PAC, $148 million. I could have I could have done that times 10. In fact, I must tell you this, I don't know if I've ever said it to this extent. I sort of feel stupid not taking all this money. I have these guys, Donald, I'd like to give you $10 million toward your campaign. I said, no, I don't want it. Donald, I'd like to give you $5 million toward your campaign. No, I don't want it. And you know, this is like counter to my life. My whole life I've been taken money. I make money. I make money. I took a million dollar loan. In a relatively short period of time, I built a company that's worth more than $10 billion, OK? With a million dollar loan. That's how I started. And I built a company with some of the greatest assets in the world, very little debt. I filed all the papers. You know, nobody knew. The press was devastated. They went up and they looked, they said, wow, this is a great company. They couldn't believe. It was like a feeding frenzy. In fact, a friend of mine said, now I know you're really rich because you would never run. Can you imagine if I filed bad papers? If I filed papers where it wasn't a great company? I built a great company, great assets, some of the greatest most iconic assets in the world. Turnberry in Scotland, Doral in Miami, hundreds and hundreds of acres in the middle of Miami, buildings all over the place. In addition, we had great success in television. We had great success in the book world. The Art of the Deal, one of the most successful books ever done in business, maybe the most successful. See, I used to say, the most here it is right there. There is another one. The most successful business book ever written. But I don't do that now because they'll go back and examine. Well, let's see, 20 years ago, somebody wrote a book. Let me just tell you. So I say one of the most successful but I think it might be the most successful. So I've had great success. And when I tell you these things I'm not saying it in a bragging way. I'm saying that's the kind of thinking we need in this country at least until we straighten it out. We need that kind of thinking. But so often I'm asked like, what would you do? What would you do about ISIS? And when would you attack them? And where would you attack them? And how would you do it? And I say, I don't want to answer. You know, I want to be like why do we always have to tell the enemy what our plans are? Why? Why? When Obama a number of months ago said, he's sending 50 of our finest, finest, finest young soldiers over to Iraq, over to Syria and he goes and makes an announcement. And I said, why is he doing that? Why is he doing that? They have a target, right now, a target on their back. Everybody is looking for him. If he doesn't announce it, they can do their job. Special people. But now everybody over there is looking for him. If he didn't, if he didn't talk -- you know, it's these politicians, they have to talk. All talk, no action. We want results. We don't want talk. Is that right? We want results. And I've been saying for years because I have a lot of fans here. They've been following me and we just have a great relay. By the way, the most loyal supporters anywhere probably in the world in this country. A woman was on television. I got to tell you, I've said this a couple of times over the last few days but I love this woman. I will search the world for her. She was on television. She's probably 55 or 60 years old. She had 10 women behind her that were Trump fans. You know, they had buttons all over, buttons on their head, buttons in their hair. And this wise guy walks up to him, one of these characters right back here. Walks up -- look at all those live television shots. Every time I got to be live. I'd like that to be live so we can really open up. But -- so he's on television. And he said, why does it take for you to drop Mr. Trump and go with someone else? She said, don't talk anymore. Don't talk. There is absolutely nothing that man can do that we will drop and the women behind started screaming. And I told people, I said, and you know what I wanted to do? I want to get up and hug and kiss that television set. But we have the most loyal and we have the smartest people too. We have the smartest people. You know, there was a time when they say, oh, these are the least educated. Let me tell you, we have the smartest people and the polls in New York are saying I have the top educated and I have people without a lot of education. I'm winning with men. I'm winning with women. We're winning with every single category. Now you got to get out and produce on Tuesday. But we're winning with every single category, every single. So here, I got it. I have to go back because you know we're gonna talk for a second about the border, but we're gonna talk about Carrier first. So I'm gonna call Carrier and I'm gonna say, congratulations on your new plant. I'll bet it's gonna be lovely. And I have to do this. This is why my kids say, don't call. Don't do it yourself. I said I have to. This is too easy, OK? Now I have the greatest business people in the world endorse me. Carl Icahn, great business people, endorse me. These are people that will represent us with trade deals. Not political hacks that get taken to the cleaner every -- I have guys that can't sleep at night. They turn and toss and sweat. They can't sleep because all they can think of -- they're consumed with doing this deal. They want the best in the world. And I know the best. I know guys that are overrated. I know people you never heard of that are better than all of them. But these are people that don't sleep. They toss and turn and sweat. All they can think about and they'll be thinking about the deal with China. The deal with Japan. The deal with Mexico. They don't want money. They don't even want to do it beyond the deal. They will make the greatest deals. It will bring our wealth back and it will bring our jobs back. And with Carrier, and with Carrier -- but I have to do it myself because it's too easy. Now Carrier, it could be Ford, could be Nabisco and Nabisco is leaving Chicago. They're moving to Mexico. They're big plant moving to Mexico. No more Oreos, folks. I'm not eating Oreos anymore. So listen. So with Carrier, I called the president the Carrier. This is President Trump calling. Can you believe I'm talking to an air conditioning guy? Can you believe this? But I have to do it myself. My daughter would go crazy. She said, dad, that's not presidential. I'd say, who cares? It's too easy. They said that in the last debate. They said, Dad, Dad, you're winning every debate. Every debate they say I won. You saw that the polls -- Drudge, who's an incredible guy, by the way, Drudge. He's incredible. Matt Drudge. But Drudge has a poll, Time magazine has a poll, Slate. They have like seven or eight polls. Every single debate, I've won. Every single debate. I didn't even know if I could debate. I never did this stuff before. That's what the politicians do. But every single debate. What happens is I call Carrier, I say, look, here's the story. You are gonna pay. First of all, enjoy your plant. Enjoy your life. But you just left 1,400 great people in Indiana and now you're moving to Mexico. And you think you're gonna make air conditioning units and sell them to the United States and there's not gonna be tax. Well, there you're wrong. You're gonna pay a 35% tax on every single unit you sell to the United States. Every single unit. These companies that are leaving us have to know that when you leave us and you fire all our people from Syracuse and Albany and Rochester and all of the places that I'm going to and Best Page, which was an unbelievable rally. But when you fire -- I went to Suffolk, which I know all my life. I love Suffolk. I mean, I see all these empty factory buildings. It's ridiculous. You have to know when you move to Mexico or wherever you go, but when you move to Mexico that if you move there's gonna be a penalty. It's gonna be -- we're gonna tax your product when you come back in. And you know what, folks, we may have lost those jobs but we're gonna reduce the hell out of your taxes because we're gonna make a fortune when they sell their product to us, OK? But I'll -- and the politicians have never figured it out. You know, it's called corporate inversion. They don't even know what that word is. It's called corporate inversion. They never figured. They're working on a plan. They want to keep companies. They've been working on this plan for five years. They don't have a plan. Here's the plan, folks. I'm a conservative. I'm a free trader. But when you free trade, you have to have smart people representing you. We have very, very dumb people and we have people that are all taken care of by the money people and the special interests. And I see it because, by the way, I have had $94 million in negative ads. And you know, it's by people that I never even met. Who the hell is the Ricketts family from Chicago? They put up millions. They own the Chicago Cubs. I have a great building in Chicago. I think the Chicago Cubs are gonna do terribly this year, OK? You want to know the truth. I don't even know who these people are. But you know what, a guy named Zinger. Who the hell ever heard of it? I'll tell you, I'll tell you a little secret. I saw -- I was surprised because I thought I was friends with Coke brothers. I thought I was their friend. But somebody said, they're linked to a certain PAC. The reason they want to not have me get elected is that I know the game better than any of them know it. I know where the skeletons are, folks. I know. I know all about the games. I know them better than they know and they don't want it. Plus, they don't like the fact -- one of them said, we hate the fact that Donald isn't that guy. I know most of these men. We hate the fact that Donald doesn't want any money. Because if I don't want any money, they don't have any control. Does that make sense? They have no control. They have no control. So I tell Carrier, it's a 35% tax on every single unit you selling. And now we're gonna have a real border. We're not going have a Swiss cheese border, right? And by the way, the border patrol 16,500 border patrol agents endorsed me last week. First time they've ever endorsed a presidential candidate. And Sheriff Joe Arpaio, who's a great guy from Arizona. There's nobody tougher than Sheriff Joe on the border. Sheriff Joe endorsed me. So we know who's gonna be at the border. We're gonna have a report. And here's what Carrier is gonna say to me. They're gonna say, Mr. President, you can't do this. You can't. I said, oh, yes I can. And then about 24 hours, I will be inundated with calls from people, special interest, lobbyists. But I don't care about these people. I don't care. They didn't give me anything. I don't want their money. They didn't give me anything. So I'll be inundated. I won't take the call. I won't even bother talking to him. Why should I talk to him? It's a waste of a call. And I will get a call, I guarantee you, within 24 hours from the head of Carrier saying, Mr. President, we've decided to stay in the United States. That's what's gonna happen. 100%. And by the way, that's a 100%. That's not like 89.3%. That's 100%. So here's what we have to do. We're gonna build a tremendous border. We're gonna have a great border. We're gonna have people come in. We want people to come into our country. They have to come in but they're gonna go through a process and they're gonna come in legally. But we're gonna build a wall. And it's gonna be an incredible wall. It's gonna be a real wall. It's gonna keep drugs out. And it's gonna keep illegal immigrants out because we can't do it. We can't afford it. We're a debtor nation, folks. We can't afford it. We are not letting people from Syria with no documentation, with no paperwork, with no anything come into our country. And if they do come in, we're gonna have to sadly send them back. We can not take them in our country. You saw what two people did where the woman radicalized the guy and they killed 14 co-workers that they had good relationships with. And everybody said, what happened? They were given a baby shower, a little time before. You saw what happened. We can't do it, folks. We don't know where these people come from. Zero documentation. Zero paperwork. As far as the border itself, we're going to stop. It's killing our jobs. It's -- you look at Kate in San Francisco, what happened. You look at Jameel in California, what happened. Shot three times in the face by a person that should have never been allowed in this country. And frankly, I have great relationships with Mexico. I have great relationships with the Hispanics because I employ thousands and thousands of people. They're great. But their government is too smart for our government. They could stop this problem even before the wall is built, but they don't want to. The drugs are pouring in. I won New Hampshire and New Hampshire people. I go to meetings and I say, what's your biggest problem? They said, heroin. I said, you've got to be kidding. Look, how beautiful this place is. You know, you see the beautiful trees and roadways and lakes. Heroin? How does heroin work with new Hampshire. New Hampshire has a tremendous heroin problem and so do you, by the way, a tremendous heroin. It comes from the southern border. They drive it right through like it doesn't even exist. We get the drugs. They get the cash. No more, folks. It's gonna end, OK? It's gonna end. No more. They are poisoning our youth. Our youth doesn't have a chance. They're poisoning our youth. Our youth can buy this stuff for less money than it costs to buy candy. Our youth is being destroyed. They're being poisoned and even beyond our youth, but they're being poisoned and we're gonna stop it. So here's the story. We're going to build a great wall. Who is gonna pay for the wall? Who? By the way, 100%. These politicians, these politicians come up to me and they say, you can't build a wall. This was like a year ago. You can't build a wall. I said, of course, you can. Now they don't say that anymore. Now they say, you can't get Mexico to pay. Politicians will never be able to do it. For me, it's easy. It's so easy. Because you know why? We have a trade deficit with Mexico of $58 billion a year. That wall is gonna cost $10 billion to build and it's gonna be so beautiful. Cause someday maybe they'll name it after Trump, right? They'll be the Trump wall. I don't that. I don't want. But it's gonna be a real wall. It's gonna be an effective wall and walls work. Well, you have to do is ask Israel. Walls work. And we are going to stop illegal immigration and we are going to stop drugs from destroying and poisoning our youth. Believe me. So here's the story sort of wrap it up. Here's the -- this is so -- I love being with you people. The same accent. I have the same accent. I have -- unfortunately, for all of us, right? I have that same beautiful little twang, as you do. You know, Hillary can talk, although I will say, I do love Arkansas. I won Arkansas. I won Alabama. I won the South. I won the South. I won Florida. You know, one story I have to tell you about this just to show you how crooked politics is. But sometimes -- so Florida was going to be won easily by Jeb Bush, ex-governor. He was gonna win it or Rubio. Then they see me come into the race. So they fixed it. So what they did is they rejiggered it. So winner take all. This means that Trump won't win Florida because you have the governor coming in and you have the senator. So it was rigged. Like everything else in this party, it was rigged. It was rigged so that I couldn't win. So now, winner take all. 99 delegates just about the top outside of California where I think we're gonna do great, by the way. 99 delegates winner take all. They changed it so that I wouldn't get any delegates. Then they do a poll. Now it's changed. Then they do a poll, Trump 48; Bush, 12; Rubio, 14. And they say, oh my god, what did we do? We got to change it back. And I end up winning the state of Florida in a landslide. So you never know how it turns out. OK, so ready? We are gonna rebuild our military so it's bigger, better, stronger than it ever was before. Ever. And by the way, I love this lady. I love this lady. I love this lady. Take your time fellas. Take your time. Take your time. I love you, man. This is a great guy. He was probably waiting here five hours. We love you. Hey, give me. I love that guy. You know, he's probably been waiting here for like five hours. So tough stuff. But boy, did we have -- nobody -- I'm telling you, nobody has the loyalty that we have. These people, they're amazing. You people are amazing and we're gonna really take it. So here's what we're gonna do. Thank you. Here's what we're gonna do. You gotta go out. You're gonna remember this afternoon. You gotta go out. You gotta vote. And I promise you one thing. I'm gonna do a great job for you, folks. I don't want your money. I don't want anything. I want your vote. Bring everybody you know to vote. Do whatever you can. Just go out and vote and you leave the rest to me because I'm working for you. I'm your messenger. You know, when they talk about, when they talk about this incredible group of people and they actually say, it's a phenomena. They've never seen it before. All -- every time. Look at this, I mean on a Saturday morning, look at all these people filling up a convention center. So here's what's gonna happen. We don't win anymore. We don't win anymore. We don't win with our military. We can't beat ISIS. By the way, we're gonna knock the hell out of them. We're gonna knock the hell out of them. We don't win for our great vets. We're gonna win for our vets. We're gonna take care of our vets. These are our great people. We don't win our trade. We never win on trade. We're losing billions and billions and billions of dollars a year. More money than anybody's ever heard of. We're gonna win on trade. We're gonna win with education. We're gonna get rid of Obamacare. We're gonna get rid of Obamacare, remember. Just remember I said it. It's gonna fall of its own weight anyway by '17. But we're gonna get rid of it. We're gonna repeal it and replace it with something so much better for so much less money. We're gonna get rid of Common Core and we're bringing our education local. We're gonna go local. We are going to win at the border. We are going to have the strongest borders and great people are coming in. They're coming in through a legal process. But we're gonna finally have borders. So we have our country back again. And here's what you're gonna do. You're gonna remember this day and you're gonna remember more importantly, Tuesday. And you're gonna say to your family, to your friends, to your husbands, to your wives, to whoever. You're gonna say, that was the single greatest vote I've ever cast. That never in my life have I been so happy to cast a vote. And you're gonna remember that vote in two years and four years and 20 years and 30 years from now. And you're gonna say again and again, that was the greatest vote I've ever cast. Because you know what's gonna happen, folks? We're gonna start winning again. We're gonna win with trade. We're gonna win with jobs. We're gonna win with economy. We're gonna win with our military. We're gonna win for our vets. We're gonna win with education. We're gonna win with health care. We're gonna win so much you're gonna say, please, please -- I love doing this. I do love it. You're gonna say, Mr. President, please. We can't stand it. We're winning too much. We can't stand it. Please, let's not win all the time. And I'm gonna say, I'm sorry, we're gonna win more and more and more. And we're gonna make America great again. I love you. I love you Syracuse. We're gonna win. Thank you. I love you. Thank you, everybody."}