{"id":405,"author":"Donald Trump","title":"Speech: Donald Trump in Watertown, NY","date":"2016-04-16","link":"https://factba.se/transcript/donald-trump-speech-watertown-ny-april-16-2016","paragraphs":["Soon we're going to be doing something more important. We're going to be breaking the all time record in job production. We're going to get jobs back. All right? We'll get the jobs back. All right? That I promise you. And we're going to -- by the way, just so you understand. We're going to close up our borders.","People are coming into the country but they come in legally. You have a big drug problem, a big heroin problem. We're going to end it, folks. We're going to end it. Really poisoning our youth. When you have the problem up here and somebody said to me you know New Hampshire, I won. I won New Hampshire and I was with the folks.","So I said, \"What do you think? What's the biggest problem?\" They said, \"Heroin.\" I said, \"Heroin?\" Because you know, you're looking at these beautiful fields of values and trees. And I said, \"How could that be your biggest problem?\" This is our biggest problem, heroin. And I hear you have the problem too.","And we're going to stop it, folks. We're going to stop it. We're going to build the wall. We're going to have strong borders. We're going to stop it. It's crazy. What we're going through as a country is crazy. So just get out. Remember, Tuesday, got to get out and vote.","We got to vote. Because the truth is we have a movement going on. It's on the cover of Time magazine, the cover of everything. And they say its a phenomenal like we've never seen in this country. No matter where I go, no matter where I go. And I wanted to come up to Watertown. I've heard so many good things, folks.","It's beautiful. Beautiful. And I know why they call it Watertown because I flew over, there's a lot of water. That's pretty good. You know, I always say, you never -- in real estate, you never lose money with water. Rivers, lakes and oceans. So we should be making a lot of money up here, folks.","Because you got plenty , body of water. So here's the one problem. Right? And we'll get this taken care of. If I'm elected, we get it taken care of, fast. Because we're going to bring our jobs back. We're not going to be losing our jobs to Mexico, on all of these other places. So I -- I went. I said to my people, \"Give me some numbers.\" And Stephen came up and he gave me some talk.","And it's depressing. When you see it, it's depressing. According to the United States Bureau of Labor Statistics, the number of manufacturing jobs in Watertown has decreased by 50% and not that long a period. That's a lot of jobs. Come on folks, let's get with it. Right? I mean, that's a lot of jobs. Or we'll bring them back.","You know what? Because of stupid government deals, because of horrible trade deals between NAFTA and everything else. They don't know what they're doing. We have politicians that don't know what they're doing. And in some cases, they do. Like Cruz and these guys, they have all these people funding them and all these people are not for your best interest.","Now, he's not for your best interest for another reason. New York values. He said that with hatred in his eyes. New York values. But actually, he's not the problem because he's now in third place. So I don't even know if his a. Now Kasich, for anybody thinking. You know, as an alternative to him.","Kasich approved NAFTA. He voted for NAFTA. NAFTA emptied out your businesses. TPP which they're both in favor of. TPP, you know what that is. Trans-Pacific Partnership. Will make NAFTA look like a baby. It's gonna be so bad for the United States. So bad for this region. It'll be terrible. So we're going to end it, folks.","It's not going to happen with me. Believe me. We're bringing our jobs back. So Watertown lost one third of its manufacturing jobs since the year 2001. That's not good. It's one of the great job thefts in history. It's called the World Trade Organization. That's when China went in. Actually, honestly, what China has done to our country -- because of our politicians, they don't know truly how they're incompetent.","What China's done to our country is the greatest theft in the history of the world. It's really true. They've taken our jobs, they've taken our people, they've taken our money. You know, we have now a trade deficit with China of $505 billion a year. Five hundred and five billion a year and it's going to remain that way.","And honestly, it's been that way for a long time. It's a great tribute to our country that we can lose that much money for that long and here we still have a country. But we're not going to have word of bubble. We're not going to have it so much longer. You know, I told this story the other day. A friend of mine is very healthy guy, very strong guy.","Always very strong got sick. Got very, very sick. And he was supposed to him passed away a long time ago actually. A very good guy but tough, tough guy. And you know, strong. But he got very, very sick. And he was supposed to be dead a year ago. And he just keeps hanging in, hanging in, hanging in. And he won't die and I call him everyday.","How are you doing? \"I'm doing OK. I'm doing OK I'm telling you. I'm going to be OK.\" Fantastic. You know, he was literally supposed to be dead one year ago. It's like our country. The way our country is right now. The way our country is right now with all these horrible deals. A horrible trade deals. The horrible NAFTA.","When you look at what it sent to us. When you look at NATO on a military. We have 28 countries. It's 68 years old. They asked me about it the other day. Sixty, think of it, 68 years old. They asked me, I said, \"It's obsolete and we paid too much.\" And we're paying for these countries and they're not carrying their weight.","They're not carrying their weight. And I made a statement and I said, \"Look, you always have to be prepared to work.\" I don't want to work from NATO. But it is obsolete because our big problem now is terror and it's not set up for terror. That was set up against the Soviet Union and other things. But we don't have a Soviet Union.","But we still have a problem with Russia. So it's OK. It's OK to keep it. But they have to pay their way. So you have many of these countries, they're not paying what they're supposed to be paying. With me, they're going to pay or their gone. OK? You know, we protect them. They're going to pay. Somebody said, \"Oh, you're sure?\" And I'll do it nicely.","I'll say, \"Look, you haven't paid in a long time. You got to pay and if you don't pay, you're gone.\" We're not going to be weak. We can't be the policemen to the world anymore, folks. We own $19 trillion. And it was sort interesting, one of the reporters asked me this, \"Well, does that mean that you would break them?\" I said, \"Look, it will be just fine.","They'll going to pay.\" When we leave, we may have to leave for one day and then they'll call up, \"OK. OK. We'll pay.\" They don't going to be out there alone. But we have to modernize it. We have to make it or have an alternative for terror. Because we have to knock the hell out of ISIS. We have to rebuild our military.","We got to do it. But they were talking about NATO and I said, \"Not only do they have to pay but their delinquent.\" We have businesses. Right? You have apartments. Their delinquent. They always money from the bank. They got to pay the money they owe us for the last many years. They -- nobody asked them. I guarantee you this, they don't pay.","Nobody calls them. Do you to think anybody says you didn't pay? They don't pay. Who can blame them? You know, I don't blame China. I don't blame Mexico. I don't blame Japan for taking advantage of us. I blame our leaders for being stupid people. OK? I blame our leaders. So let's go -- let's go into our couple of more depressing factors and then I'll give the good news.","We're going to change it. OK? That's the good news. Because you don't want to leave. I'd say, \"Don't leave. This place is gorgeous. We'll bring back the joy.\" Once we get the jobs back, we're all set. We got the jobs back, we get rid of the heroin and we're all set. OK? There were more people in the labor force in Watertown in 1990 than there is today.","That's not good. In other words, we're supposed to be growing and we're going the opposite direction. The workforce in Watertown is shrinking and nearly 5,000 more people in the labor force. Wow. In just a five years you have lost 5,000 jobs. No good. It's not that bigger place. Right? You know. The number of people employed in Watertown was higher in 2008 than it was today.","What it was home to Fort Drum. That's a great place. Fort Drum. Oh, I love Fort Drum. I love -- I love the military You're in Fort Drum? Beautiful. So how many people in Fort Drum? And they love Trump. The military likes Trump and we're going to take care. And folks, you know, our -- our military has been decimated.","OK? And these -- these people know it better than anybody. We're going to build up our military. Bigger, better, stronger than ever before. We need it more than we've ever needed before. We're going to make it bigger, better and stronger than ever before. Nobody's going to mess with us and we're going to take care of our veterans because our veterans have been absolutely treated unfairly.","So you pass the word back. OK? To the veterans. Any veterans here? Any veterans? Folks, you pass the word around let me tell you. Good, good looking veteran. You look too young to be a veteran. So we're going to take care of it. OK. A couple of more horrible factors here. Labor force participation, I don't even have to tell you it's one of the worst levels ever.","New York State has lost three out of four. This is the state. Three out of four, manufacturing jobs since 1960. In other words, three out of four. That's most of the jobs. And then we wonder why our taxes are so high. Right? That's one of the reasons you're losing the jobs because your taxes are so high.","Cruz and Kasich supported TPP and they support giving Obama more trading authority which is no. You don't want to give Obama trading authority because he's a -- he's a lousy negotiator. Except when it comes to negotiating with the Republicans. He gets everything he wants. Right? You saw the last budget, the omnibus budget?","He got money from Obamacare for Obamacare. Now Obamacare, we're going to repeal it and replace it 100%. It's a disaster. But in the last Budget, we got money for Obamacare to keep funding it. It's losing a fortune. Your premiums are going up 35, 45, 55%. I mean, they've gone through the roof.","Your deductibles are so high that unless you're close to death, you'll never use it. And then you don't care. Right? If we don't close to death. Ah, whatever it is. Right? But unless you're close to -- you -- you see what's going on with your deductibles. You can't -- you'll never be able to use it. So you paying all this money for something you're not going to be able to use.","When you look at this, here, Chinese currency. Now, Cruz fought so hard so that China -- you know, I -- one of the many reasons I'm against TPP. It's no good anyway. But the worst element is that currency manipulation is the single greatest weapon these countries have. And particular China and Japan have to just absolutely destroy us. Take a look at what's happened in the Caterpillar Tractor because so much business is going to Komatsu because of what Japan has done to the yen.","Right? So currency manipulation and Cruz insist that we cannot have any language talking about currency manipulation in TPP. No. 1 we shouldn't have TPP. But if you're going have it, you've got to have currency manipulation language and he's fighting. Now what does that mean? That means, that probably somebody is taking care of them.","Right? That means, that somebody representing China or representing a company for China or representing something having to do with a company that does business with China. Doesn't want that in there because these guys -- so I'm self funding. All of this is mine. When I fly in I -- It's on my dime. Right?","It's on my. And what does that mean? That means, I'm not controlled by the special interest, by the lobbyists. And they control. They control Crooked Hillary and they control lying Ted Cruz. Right? They control lying Ted. You ever see a guy lie like this? You know. He'll walk into a meeting with a Bible held high.","This is lying Ted Cruz. Everyone knows he's a liar. What he did to Ben Carson? Who endorsed me, by the way. He's a great guy. Remember in Iowa? He said, \"Ben Carson has left the race.\" He didn't leave the race. \"Vote for me.\" This was on Election Day. I mean, this wasn't like you know, two days later or three days before on Election Day.","Right? He said, \"Ben Carson has left the race.\" Then right after the polls closed he called up Ben. \"Ben, I'd like to apologize. I didn't know.\" He's lying Ted. He's no good. I'm telling you, he's no good. Bad guy. He's a bad guy. He's a bad liar. He said the other day, he said, \"I won Utah.\" And I've won.","I'm the only one consistently that beats like Trump. You know, I've got 22 states. He's got -- what does he have nine or 10? I'm leading him by millions and millions of votes. Millions of votes. Some leading him by me. And yet I watch him talking and if you listen to him you think he's winning. He's get -- first of all, he's got no road to the nomination and might be. He doesn't. Mathematically, after this weekend when he gets wiped out in New York which he will.","He gets wiped out. He no longer has a road to the nomination. He will no longer after this weekend because it should be -- it should be pretty thorough. Because who would after he talked about New York values? And talked about it in such a disgusting way. Who in New York would vote for this guy? And who in New York would vote for the other guy who is in favor of -- of the NAFTA?","So you can. So -- I'm sorry, folks. You only got Trump. That's all you have. You have to have it. OK? You'll be so happy. You are going to be so happy. You'll be thrilled. Believe me. I'll tell you what? You will leave and you will vote on Tuesday. You going to bring your friends, bring everybody. It will be the greatest vote that you'll ever cast.","You will look back in four years and 10 years. You will look back and you will say that's when jobs started coming back. That's when we started winning again. You will be so happy and you will be so thrilled. Do I hear somebody? Go home. Go home. Go, go, go. Go home. Get him out of here.","Get him out. Get out of hear. You know. Don't -- I mean, they really do impede of free speech, you know. Now, in the old days it used to be much rougher for them. Today nobody touches and then of course that's good. That's fine. You know, when I started and I'd have a guy.","I mean, you know, what are they doing? I don't even know what he's holding up. He's holding up some piece of paper. Some card. Usually its made in a factory and handed to these people. They had some of the other day in front of the Grand Hyatt Hotel which I built in Manhattan. And they had some guys. And the press went up to him.","Why are you here? And they couldn't and they didn't know. Why are you here? Why are you demonstrating? Well, I don't know. I was told to be here. They're a bunch of phonies. Let me tell you, it's a bunch of phonies. It's a whole -- it's a whole phony deal just like what's happening with the Republican Party in terms of this delegate deal.","I'm -- so I'm leading with all the delegates, I'm leading with the votes by a lot. I'm winning -- leading with the delegates by a lot. But what's going on with delegates or what's going on with our party. We got to give the vote back to the people, folks because it's no good. It's all.","It's all rigged. It's a rigged deal. You know, you look at Colorado and -- and I watch the RFC. He's a nice guy. Rides. He's a nice guy. But he said, \"Well, we haven't changed.\" Well, I went in, in June, in August they changed. And the reason they changed was because they saw I was going to win Colorado.","So the way we do it is to give them to the bosses. So Colorado, their vote was taken away. Wyoming, their vote was taken away. Now, I like to run. We have a lot of good businesses people here. I run a smart campaign. I'm putting up of my own money so I'm not going to waste money. So I could have had people go there four months ago, five months ago.","But I don't want to waste money. Especially, when maybe, at the end of the whole pro . Their just about anybody else. I mean, Jeb Bush had a $148 million that he spent and he was killed. And his actual campaign was bigger than that. That was just as fun. I've spent just about less money than anybody else and I'm on first place by a lot.","Don't you want that for your president? Don't you want it? For me, that means something. You know, when I went to New Hampshire and I spent $2 million and others people were -- and I was in first place by a lot. You know, we won New Hampshire in a landslide. South Carolina in a landslide. Nevada in a and.","Like 21 or 22 states. We won them in a landslide and I spent less money. That's what you want, folks. We want to spent less money and get the best. That's what we want. OK? I look at some of these projects that we have in this country. I just -- I mean, like an amazement. We have a project and its got.","It comes in it four times more than projection and six times more than projection. Even military spending, they buy things that they don't even want. They buy them because the company is selling the item. Whatever it may be is very politically connected. They don't want that item. They want another item but that company makes the better product but they're not politically connected.","So they get the item that we're talking about. It ends up costing much more than they ever thought. And I say, \"Gee, was I wonder why?\" It's because your politicians work it out, folks. And we're not going to have any more of that. We going to have a real country again with borders and strength and intelligence.","So when I look at these numbers, oh, I'm so disappointed in you. Infrastructure a total disaster. That you know. Look at that, yeah, infrastructure. Well, we know that. All over New York, its a disaster. . We're going to straight -- look, we're going to straight it out. It's gonna be great. And just hang in there, folks.","Just hang in there. When I'm president -- and I love this state. I know the state so well. I know this area. But I love this state and we're going to straight it out. We're going to get jobs back and they going to pour back in. And it's the single biggest thing. And jobs, jobs will cover up a lot of problems.","You know, once you have jobs that's going to cover up a lot of problems. But we can't continue. You can't continue to go. When you lose in 40, 50, 60% of your jobs in manufacturing that going down to tubes. I mean, you can't do that. You can't do it. You haven't had an effective pay increase in 18 years.","Think of that, 18 years. And then they wonder why Trump has the most people as rallies. I have bigger rallies than anybody by far. Why does Trump? Why does Trump have the big rallies? Why there's so many people come? Now, a lot of it has to do. \"] What? I love you too.","I do. I ask you too. I must love you. I wouldn't be doing this. Who the hell needs to do this on a Saturday afternoon? Right? My family. Thank you. My families sometimes, Ivanka, Melania, my kids they're all good. They said -- they said, \"Dad. Why ah? Why are you doing.","You don't have to do this. You have such a good.\" I built this winning company. I took a million dollars and I built a company that's worth more than $10 billion in a fairly short period. I have some of the most iconic, some of the greatest assets in the world. Very little debt, tremendous cash flow and I say it for one simple reason because that -- and I couldn't care less about it. Because I let the kids run it. I let the managers run it. It's so simple.","Let me tell you, I'm doing this because that's the kind of thinking our country needs. We have 21. We have very soon 21 billion -- think of it. We have $21 trillion. Trillion. Nobody even knows what the hell a trillion. What's a trillion? Ask. Nobody knows what a trillion is. You know, not so long ago you never heard the term trillion.","Now it's like a routine. So we have 21 version that horrible omnibus budget. Which by the way, financed Obamacare extension, finance people coming in from Syria that we have no idea who they are, where they are. We have no -- they have no paperwork, no documentation. So here's the story, folks.","Here's the story. Many -- we're going to end up. We're -- don't worry about it. We're going to -- trust. You know, when I first did this, when I first came they got to go. No, no. They got to go. This is beyond the wall. This they fly them in. OK. This is beyond the wall. They fly over the wall. Look. Look.","We're going to be now the smart country. We're not going to be the dummies anymore. We're going to be the smart company. We're going to be the smart country and we're going to have to send them back. We have no idea who they are. There's no documentation whatsoever. And we'll help them build a safe zone in Syria someplace and I'll get -- and I'll get the Gulf states who by the way are not carrying their way.","They got a lot of money. They're not taking the migrants. You know, there's no migration going into the Gulf states. They're going to pay for it. We'll supervise it. Hey, I have a bigger heart than anybody. We -- you know, it's a problem. You look at that migration although it is strange because you see so many young strong men.","Right? Do you ever see anything? I said, \"Where are the women? Where are the children? What's going on?\" You have young strong men. And they're coming into our country. They're coming in by the thousands. Remember I said a big number and everyone said, \"That's ridiculous.\" He's talking about 3,000. Well, the 3,000's gone to 10,000's gone and now they're talking about tens of thousands of people are pouring into our country.","We don't even know who the hell they are or where they come from. And let me tell you, you're going to have a problem. It's going to be a big ugly problem and we better be careful and we better be smart and we better be vigilant or our country is in big trouble. If you look at what happened in California where the two people, where she radicalized him and they killed their co-workers.","Fourteen people, lots of people in the hospital and their lives will never be the same. But you look at that. And by the way, speaking of that Second Amendment. If there were guns on the other side of that room. Right? If there would guns on the other side of that room with a couple of these guys like -- where's that guy from Drum?","Right there. Right there. If he had his gun and he's standing on the other side, you don't have 14 people dead. You have a couple of bad ones dead but you don't have 14 people. Same thing. Same thing in Paris. I mean, my whole campaign change. It was -- and actually, when Paris happened because of the fact that they say that I do great on security.","People have confidence on me. I'm not going to let people -- I'm not -- you trust me. You do trust me and I appreciate it. But I will be the best on the military by far. And what happened with Paris, 130 people killed and they were just sitting ducks with these guys. These animals walked in, boom, boom, boom, boom.","Hundred and thirty people killed. Tremendous numbers of people right now in the hospital and nobody even -- ruined for life. Many of them will die. Seriously, seriously wounded. And you know what? If there were guns in that room outside of the bad guns -- first of all, they might not have ever come in. OK? Because there's a -- I'm not going in there.","They've guns. But if they did go in, the -- the casualties might be very little. And you know what? They would have been gone very, very quickly. So we have to protect. We have to protect our Second Amendment. OK? And nobody is going to mess with it. Nobody. Nobody. Thank you. So when I started this on June 16th that I came down the escalator with Melania and it was great.","And then everybody was happy and I started talking about illegal immigration which would have never even been talked about if I didn't bring it up. And I talked about the crime and I took a lot of heat. And I talked about all of the problems and I talked about the drugs pouring across and everything. And then, two, three weeks later, everyone saying he's right.","Now they're all copying me. Isn't it incredible? I even heard lying Ted the other day said, \"We must build the wall.\" I said, \"Where did that come from?\" Where did it come from? He's a liar. He's a liar. But you know what? We have to build a wall and we have to do many other things. And we have to be vigilant and we have to be smart and we have to watch and we have to see.","And when you see something that's wrong you have to report it to your police. Because there's nobody like the police. The police are so great they don't get the credit they deserve. They don't get the credit they deserve. But you have to report it to your police and we take care of it. You know, when they had these 14 people.","They were killed. The two people, they have bombs all over their floor. Everybody knew they were up to something bad. Their bombs. I mean, you don't walk into too many houses if you see bombs all over the floor. Right? People saw it, they all knew. One person said they didn't want to do it and they didn't want to have racial profiling.","Another words, the lawyers said, \"You got a problem. You knew this was here. You better make up some excuse. So they sent a racial profile.\" Do you believe that? When you see a problem you got to report it. But they aren't reporting the problems. I mean, they just caught the one guy. He was living right next to where he grew up and he was there for months and months.","They don't use the word mastermind anymore because I went -- I said don't call them masterminds. You know, they are ruining our youth with the Internet. Their taking our youth and they go on over to fight ISIS. And they're calling the head guy with the white cap, the guy that I call the guy with the dirty cap.","They're calling him a mastermind. And I said, \"Don't call him that.\" And for two weeks I pounded the press and now they don't use the word. I haven't heard the word mastermind anymore. But then you wonder, how come they were able to use our Internet better than we are? And they're taking kids out of here.","And they're fighting crisis for whatever reason. They're fighting crisis. And let tell you something, anybody leaves our country and fights for ISIS they never ever come back into this country. Remember that. You know, right now they leave our country. They leave our country. They fight for ISIS, they come back like nothing ever happened.","Because here's what's going to happen, someday they're not going to leave. They're going to be fighting us right here. They're not going to leave. Why shouldn't they leave? So anybody leaves our country they're not coming back. They're gone, gone, gone for ever. OK? Forever. So. So here's the story, folks.","We don't win anymore. Thank you. Oh, yeah go ahead. Very aggressive person. Go ahead. She wants to ask me a question. Go ahead. If I don't like it. You know, nobody can hear her right up. Go ahead. Let's go. She's reading the question off her phone. Go ahead. Oh, that's OK. Oh, that sounds bad. Come on let's go. Let's go. Let's go and they're holding up all these people there.","I can't hear her question. Like, let's forget the questions. Right? OK. Thank you. I can't hear the question. OK. So here's very aggressive person but that's OK. Since valuable -- are you must be very successful? No, no. That's enough. That's enough.","I think the question was nice but it wasn't you know, it wasn't like a question. I don't think a lot of people would have been interested. Of course I will. I will help the moral state of the country and you know what I'll do? I'm going to bring our country together because our country right now is divided.","And I'm going to bring our country together. Everybody. Everybody. The safest place to be in this country is at a Trump rally. And you listen to the press, all wrong. The safest place to be is that because the people here love each other. But we going to love other people, we going to love everybody.","We're going to love women, men children, elderly, every -- we're going to take care of every. Why? African-American. Everybody. We're all going to come together as a country and we're going to be a strong great country again. Right now we're a divided country. And we're going to make this country something special.","And I've gone all over the country, all over the country. And I've had the biggest crowds of anybody by far. Thirty five thousand people in Alabama, 22,000 people in Dallas filled up the whole ma -- Mavericks arena. We are and always, the biggest crowds. And always the people are unbelievable in this country.","All they need is some help. We need smart decision making. We need a strong military not a decimated military. We need -- we need help for our veterans because you know, the people in the military now, they say well, they're going to be a veteran into the future. And they lose their co -- they lose their faith when they see what's happening to our veterans.","It's not fair to the people that are veterans or the people that are serving. So we're going to take care. But here's the story, folks. Right. We don't win anymore. The truth is we know. We don't win anymore. When we used to win. We don't win anymore. We don't win in any level. We lose in everything. We don't win, we going to win with me, you better believe it. You're going to win me. You better believe it. I mean, my family has going to say, before my family says, \"What do you do this for?\" That's a lot of work.","It is a lot of work and it takes guts to run for president. Not so easy. You know, I'm proud to say I wasn't a politician until a June. But -- and I'm not a politician now, folks. But -- but there's so much potential in this country and I love this country and I want to give back. I made a lot of money, I had a great success, I've had -- I've had a lot of fun doing it too.","I've loved doing it. I've loved every moment I've been alive in this country. And we going to give back and we're going to take communities like this that are incredible with incredible people. And we're going to bring jobs back together. We're not going to be the foolish people that allow other countries to take our factories and to take our jobs.","We're not going to allow it to happen anymore. So here's the story. You're going to go and you'll going to vote hopefully on Tuesday. And you'll going to look back, you'll going to look back on today. You'll going to say, \"We were in this beautiful airplane hangar.\" Which is very nice actually. Look at that beautiful weather.","But we -- I have is very heavy coat. I said, \"You think I needed the coat?\" I'm glad I didn't wear this. It's pretty hot up here. But you'll going to look back and you'll going to say, \"That was an incredible day.\" That was a great afternoon, a beautiful afternoon with fantastic, beautiful, incredible people that were your friends and are your friends and you're together as a community.","But that was the day that we went out because of that day and we voted the following Tuesday. And that was the greatest single vote I've ever cast. You'll going to say that. And you'll going to look back in two years -- especially, the guys of Fort Drum. Right? Especially. Right? Because I'm -- I'm with you.","I'm with you people for more than anybody else by far. You're going to be so happy. Because you're proud, you're proud. You're proud of the military and you look at some of the equipment. A friend of mine has a son who's over in Iraq. And he said the most disappointing thing. And you'd maybe able to, you know, endorse this and say in all of the folks from Fort Drum.","He said, \"We fight the enemy and the enemy has newer equipment than we do.\" And It's our equipment. And they get it, by taking it away from people that we give it to that we think are good but they're not good or they run when the first bullet is fired. They drop it, they run and these guys pick up our equipment.","He said, \"We're fighting with older equipment like the Humvees. They have Humvees with no plate.\" And the -- the enemy took 2,300 armor plated Humvees away from people that we gave him to like you take candy from a baby. Those days are over, folks. It's not going to happen anymore. Is that a correct story?","Right? So. So here's the story. You going to go vote, you going to go vote. Everybody in this room. Now, if you don't want to vote for me, don't vote. Do you ever hear the politicians? They always say, \"It makes no difference whether you're going to vote for me or my opponent but you must go out and vote.","It's the great American treasure.\" OK. Me? I've to say differently. If you're not going to vote for me, don't vote. OK? Don't vote. Sit home -- sit home and watch television. But I have a feeling everybody in this crowd, is anybody in this crowd not going to vote for Trump? Everybody going to vote for Trump?","All right then. I -- I believe that actually. Look, you'll going to say -- you'll going to say, looking back two years, four years, eight years, ten years, twenty five years. You'll going to say, \"When you cast that vote, it was the greatest vote you'll ever cast because that's when our country started winning again.\" We're going to win on trade.","We're going to win on your jobs. We're going to bring your jobs back. We're going to win on the economy. We're going to win for our vets. We're going to win for our military. We're going to knock the hell out of ISIS. We're going to win with our military. We're going to win with our borders, we're building the wall.","Mexico is going to pay for the wall, by the way. We're going to get rid of the drugs. We're going to win on that front. We're going to win with education. We're getting rid of Common Core. We're going to bring education local. We're going to repeal and replace Obamacare.","We're going to replace it with something so much better. Folks, we're going to start winning, winning, winning, winning. You're going to be so proud of your president and that I don't care. You're going to be so proud of your country again. So get out there on Tuesday and vote. I love you Watertown. Get out and vote.","And we're going to have a big, big success in New York. Thank you. Thank you everybody. It's a great honor to be here. Thank you. Thank you everybody. Thank you."],"text":" Soon we're going to be doing something more important. We're going to be breaking the all time record in job production. We're going to get jobs back. All right? We'll get the jobs back. All right? That I promise you. And we're going to -- by the way, just so you understand. We're going to close up our borders. People are coming into the country but they come in legally. You have a big drug problem, a big heroin problem. We're going to end it, folks. We're going to end it. Really poisoning our youth. When you have the problem up here and somebody said to me you know New Hampshire, I won. I won New Hampshire and I was with the folks. So I said, \"What do you think? What's the biggest problem?\" They said, \"Heroin.\" I said, \"Heroin?\" Because you know, you're looking at these beautiful fields of values and trees. And I said, \"How could that be your biggest problem?\" This is our biggest problem, heroin. And I hear you have the problem too. And we're going to stop it, folks. We're going to stop it. We're going to build the wall. We're going to have strong borders. We're going to stop it. It's crazy. What we're going through as a country is crazy. So just get out. Remember, Tuesday, got to get out and vote. We got to vote. Because the truth is we have a movement going on. It's on the cover of Time magazine, the cover of everything. And they say its a phenomenal like we've never seen in this country. No matter where I go, no matter where I go. And I wanted to come up to Watertown. I've heard so many good things, folks. It's beautiful. Beautiful. And I know why they call it Watertown because I flew over, there's a lot of water. That's pretty good. You know, I always say, you never -- in real estate, you never lose money with water. Rivers, lakes and oceans. So we should be making a lot of money up here, folks. Because you got plenty , body of water. So here's the one problem. Right? And we'll get this taken care of. If I'm elected, we get it taken care of, fast. Because we're going to bring our jobs back. We're not going to be losing our jobs to Mexico, on all of these other places. So I -- I went. I said to my people, \"Give me some numbers.\" And Stephen came up and he gave me some talk. And it's depressing. When you see it, it's depressing. According to the United States Bureau of Labor Statistics, the number of manufacturing jobs in Watertown has decreased by 50% and not that long a period. That's a lot of jobs. Come on folks, let's get with it. Right? I mean, that's a lot of jobs. Or we'll bring them back. You know what? Because of stupid government deals, because of horrible trade deals between NAFTA and everything else. They don't know what they're doing. We have politicians that don't know what they're doing. And in some cases, they do. Like Cruz and these guys, they have all these people funding them and all these people are not for your best interest. Now, he's not for your best interest for another reason. New York values. He said that with hatred in his eyes. New York values. But actually, he's not the problem because he's now in third place. So I don't even know if his a. Now Kasich, for anybody thinking. You know, as an alternative to him. Kasich approved NAFTA. He voted for NAFTA. NAFTA emptied out your businesses. TPP which they're both in favor of. TPP, you know what that is. Trans-Pacific Partnership. Will make NAFTA look like a baby. It's gonna be so bad for the United States. So bad for this region. It'll be terrible. So we're going to end it, folks. It's not going to happen with me. Believe me. We're bringing our jobs back. So Watertown lost one third of its manufacturing jobs since the year 2001. That's not good. It's one of the great job thefts in history. It's called the World Trade Organization. That's when China went in. Actually, honestly, what China has done to our country -- because of our politicians, they don't know truly how they're incompetent. What China's done to our country is the greatest theft in the history of the world. It's really true. They've taken our jobs, they've taken our people, they've taken our money. You know, we have now a trade deficit with China of $505 billion a year. Five hundred and five billion a year and it's going to remain that way. And honestly, it's been that way for a long time. It's a great tribute to our country that we can lose that much money for that long and here we still have a country. But we're not going to have word of bubble. We're not going to have it so much longer. You know, I told this story the other day. A friend of mine is very healthy guy, very strong guy. Always very strong got sick. Got very, very sick. And he was supposed to him passed away a long time ago actually. A very good guy but tough, tough guy. And you know, strong. But he got very, very sick. And he was supposed to be dead a year ago. And he just keeps hanging in, hanging in, hanging in. And he won't die and I call him everyday. How are you doing? \"I'm doing OK. I'm doing OK I'm telling you. I'm going to be OK.\" Fantastic. You know, he was literally supposed to be dead one year ago. It's like our country. The way our country is right now. The way our country is right now with all these horrible deals. A horrible trade deals. The horrible NAFTA. When you look at what it sent to us. When you look at NATO on a military. We have 28 countries. It's 68 years old. They asked me about it the other day. Sixty, think of it, 68 years old. They asked me, I said, \"It's obsolete and we paid too much.\" And we're paying for these countries and they're not carrying their weight. They're not carrying their weight. And I made a statement and I said, \"Look, you always have to be prepared to work.\" I don't want to work from NATO. But it is obsolete because our big problem now is terror and it's not set up for terror. That was set up against the Soviet Union and other things. But we don't have a Soviet Union. But we still have a problem with Russia. So it's OK. It's OK to keep it. But they have to pay their way. So you have many of these countries, they're not paying what they're supposed to be paying. With me, they're going to pay or their gone. OK? You know, we protect them. They're going to pay. Somebody said, \"Oh, you're sure?\" And I'll do it nicely. I'll say, \"Look, you haven't paid in a long time. You got to pay and if you don't pay, you're gone.\" We're not going to be weak. We can't be the policemen to the world anymore, folks. We own $19 trillion. And it was sort interesting, one of the reporters asked me this, \"Well, does that mean that you would break them?\" I said, \"Look, it will be just fine. They'll going to pay.\" When we leave, we may have to leave for one day and then they'll call up, \"OK. OK. We'll pay.\" They don't going to be out there alone. But we have to modernize it. We have to make it or have an alternative for terror. Because we have to knock the hell out of ISIS. We have to rebuild our military. We got to do it. But they were talking about NATO and I said, \"Not only do they have to pay but their delinquent.\" We have businesses. Right? You have apartments. Their delinquent. They always money from the bank. They got to pay the money they owe us for the last many years. They -- nobody asked them. I guarantee you this, they don't pay. Nobody calls them. Do you to think anybody says you didn't pay? They don't pay. Who can blame them? You know, I don't blame China. I don't blame Mexico. I don't blame Japan for taking advantage of us. I blame our leaders for being stupid people. OK? I blame our leaders. So let's go -- let's go into our couple of more depressing factors and then I'll give the good news. We're going to change it. OK? That's the good news. Because you don't want to leave. I'd say, \"Don't leave. This place is gorgeous. We'll bring back the joy.\" Once we get the jobs back, we're all set. We got the jobs back, we get rid of the heroin and we're all set. OK? There were more people in the labor force in Watertown in 1990 than there is today. That's not good. In other words, we're supposed to be growing and we're going the opposite direction. The workforce in Watertown is shrinking and nearly 5,000 more people in the labor force. Wow. In just a five years you have lost 5,000 jobs. No good. It's not that bigger place. Right? You know. The number of people employed in Watertown was higher in 2008 than it was today. What it was home to Fort Drum. That's a great place. Fort Drum. Oh, I love Fort Drum. I love -- I love the military You're in Fort Drum? Beautiful. So how many people in Fort Drum? And they love Trump. The military likes Trump and we're going to take care. And folks, you know, our -- our military has been decimated. OK? And these -- these people know it better than anybody. We're going to build up our military. Bigger, better, stronger than ever before. We need it more than we've ever needed before. We're going to make it bigger, better and stronger than ever before. Nobody's going to mess with us and we're going to take care of our veterans because our veterans have been absolutely treated unfairly. So you pass the word back. OK? To the veterans. Any veterans here? Any veterans? Folks, you pass the word around let me tell you. Good, good looking veteran. You look too young to be a veteran. So we're going to take care of it. OK. A couple of more horrible factors here. Labor force participation, I don't even have to tell you it's one of the worst levels ever. New York State has lost three out of four. This is the state. Three out of four, manufacturing jobs since 1960. In other words, three out of four. That's most of the jobs. And then we wonder why our taxes are so high. Right? That's one of the reasons you're losing the jobs because your taxes are so high. Cruz and Kasich supported TPP and they support giving Obama more trading authority which is no. You don't want to give Obama trading authority because he's a -- he's a lousy negotiator. Except when it comes to negotiating with the Republicans. He gets everything he wants. Right? You saw the last budget, the omnibus budget? He got money from Obamacare for Obamacare. Now Obamacare, we're going to repeal it and replace it 100%. It's a disaster. But in the last Budget, we got money for Obamacare to keep funding it. It's losing a fortune. Your premiums are going up 35, 45, 55%. I mean, they've gone through the roof. Your deductibles are so high that unless you're close to death, you'll never use it. And then you don't care. Right? If we don't close to death. Ah, whatever it is. Right? But unless you're close to -- you -- you see what's going on with your deductibles. You can't -- you'll never be able to use it. So you paying all this money for something you're not going to be able to use. When you look at this, here, Chinese currency. Now, Cruz fought so hard so that China -- you know, I -- one of the many reasons I'm against TPP. It's no good anyway. But the worst element is that currency manipulation is the single greatest weapon these countries have. And particular China and Japan have to just absolutely destroy us. Take a look at what's happened in the Caterpillar Tractor because so much business is going to Komatsu because of what Japan has done to the yen. Right? So currency manipulation and Cruz insist that we cannot have any language talking about currency manipulation in TPP. No. 1 we shouldn't have TPP. But if you're going have it, you've got to have currency manipulation language and he's fighting. Now what does that mean? That means, that probably somebody is taking care of them. Right? That means, that somebody representing China or representing a company for China or representing something having to do with a company that does business with China. Doesn't want that in there because these guys -- so I'm self funding. All of this is mine. When I fly in I -- It's on my dime. Right? It's on my. And what does that mean? That means, I'm not controlled by the special interest, by the lobbyists. And they control. They control Crooked Hillary and they control lying Ted Cruz. Right? They control lying Ted. You ever see a guy lie like this? You know. He'll walk into a meeting with a Bible held high. This is lying Ted Cruz. Everyone knows he's a liar. What he did to Ben Carson? Who endorsed me, by the way. He's a great guy. Remember in Iowa? He said, \"Ben Carson has left the race.\" He didn't leave the race. \"Vote for me.\" This was on Election Day. I mean, this wasn't like you know, two days later or three days before on Election Day. Right? He said, \"Ben Carson has left the race.\" Then right after the polls closed he called up Ben. \"Ben, I'd like to apologize. I didn't know.\" He's lying Ted. He's no good. I'm telling you, he's no good. Bad guy. He's a bad guy. He's a bad liar. He said the other day, he said, \"I won Utah.\" And I've won. I'm the only one consistently that beats like Trump. You know, I've got 22 states. He's got -- what does he have nine or 10? I'm leading him by millions and millions of votes. Millions of votes. Some leading him by me. And yet I watch him talking and if you listen to him you think he's winning. He's get -- first of all, he's got no road to the nomination and might be. He doesn't. Mathematically, after this weekend when he gets wiped out in New York which he will. He gets wiped out. He no longer has a road to the nomination. He will no longer after this weekend because it should be -- it should be pretty thorough. Because who would after he talked about New York values? And talked about it in such a disgusting way. Who in New York would vote for this guy? And who in New York would vote for the other guy who is in favor of -- of the NAFTA? So you can. So -- I'm sorry, folks. You only got Trump. That's all you have. You have to have it. OK? You'll be so happy. You are going to be so happy. You'll be thrilled. Believe me. I'll tell you what? You will leave and you will vote on Tuesday. You going to bring your friends, bring everybody. It will be the greatest vote that you'll ever cast. You will look back in four years and 10 years. You will look back and you will say that's when jobs started coming back. That's when we started winning again. You will be so happy and you will be so thrilled. Do I hear somebody? Go home. Go home. Go, go, go. Go home. Get him out of here. Get him out. Get out of hear. You know. Don't -- I mean, they really do impede of free speech, you know. Now, in the old days it used to be much rougher for them. Today nobody touches and then of course that's good. That's fine. You know, when I started and I'd have a guy. I mean, you know, what are they doing? I don't even know what he's holding up. He's holding up some piece of paper. Some card. Usually its made in a factory and handed to these people. They had some of the other day in front of the Grand Hyatt Hotel which I built in Manhattan. And they had some guys. And the press went up to him. Why are you here? And they couldn't and they didn't know. Why are you here? Why are you demonstrating? Well, I don't know. I was told to be here. They're a bunch of phonies. Let me tell you, it's a bunch of phonies. It's a whole -- it's a whole phony deal just like what's happening with the Republican Party in terms of this delegate deal. I'm -- so I'm leading with all the delegates, I'm leading with the votes by a lot. I'm winning -- leading with the delegates by a lot. But what's going on with delegates or what's going on with our party. We got to give the vote back to the people, folks because it's no good. It's all. It's all rigged. It's a rigged deal. You know, you look at Colorado and -- and I watch the RFC. He's a nice guy. Rides. He's a nice guy. But he said, \"Well, we haven't changed.\" Well, I went in, in June, in August they changed. And the reason they changed was because they saw I was going to win Colorado. So the way we do it is to give them to the bosses. So Colorado, their vote was taken away. Wyoming, their vote was taken away. Now, I like to run. We have a lot of good businesses people here. I run a smart campaign. I'm putting up of my own money so I'm not going to waste money. So I could have had people go there four months ago, five months ago. But I don't want to waste money. Especially, when maybe, at the end of the whole pro . Their just about anybody else. I mean, Jeb Bush had a $148 million that he spent and he was killed. And his actual campaign was bigger than that. That was just as fun. I've spent just about less money than anybody else and I'm on first place by a lot. Don't you want that for your president? Don't you want it? For me, that means something. You know, when I went to New Hampshire and I spent $2 million and others people were -- and I was in first place by a lot. You know, we won New Hampshire in a landslide. South Carolina in a landslide. Nevada in a and. Like 21 or 22 states. We won them in a landslide and I spent less money. That's what you want, folks. We want to spent less money and get the best. That's what we want. OK? I look at some of these projects that we have in this country. I just -- I mean, like an amazement. We have a project and its got. It comes in it four times more than projection and six times more than projection. Even military spending, they buy things that they don't even want. They buy them because the company is selling the item. Whatever it may be is very politically connected. They don't want that item. They want another item but that company makes the better product but they're not politically connected. So they get the item that we're talking about. It ends up costing much more than they ever thought. And I say, \"Gee, was I wonder why?\" It's because your politicians work it out, folks. And we're not going to have any more of that. We going to have a real country again with borders and strength and intelligence. So when I look at these numbers, oh, I'm so disappointed in you. Infrastructure a total disaster. That you know. Look at that, yeah, infrastructure. Well, we know that. All over New York, its a disaster. . We're going to straight -- look, we're going to straight it out. It's gonna be great. And just hang in there, folks. Just hang in there. When I'm president -- and I love this state. I know the state so well. I know this area. But I love this state and we're going to straight it out. We're going to get jobs back and they going to pour back in. And it's the single biggest thing. And jobs, jobs will cover up a lot of problems. You know, once you have jobs that's going to cover up a lot of problems. But we can't continue. You can't continue to go. When you lose in 40, 50, 60% of your jobs in manufacturing that going down to tubes. I mean, you can't do that. You can't do it. You haven't had an effective pay increase in 18 years. Think of that, 18 years. And then they wonder why Trump has the most people as rallies. I have bigger rallies than anybody by far. Why does Trump? Why does Trump have the big rallies? Why there's so many people come? Now, a lot of it has to do. \"] What? I love you too. I do. I ask you too. I must love you. I wouldn't be doing this. Who the hell needs to do this on a Saturday afternoon? Right? My family. Thank you. My families sometimes, Ivanka, Melania, my kids they're all good. They said -- they said, \"Dad. Why ah? Why are you doing. You don't have to do this. You have such a good.\" I built this winning company. I took a million dollars and I built a company that's worth more than $10 billion in a fairly short period. I have some of the most iconic, some of the greatest assets in the world. Very little debt, tremendous cash flow and I say it for one simple reason because that -- and I couldn't care less about it. Because I let the kids run it. I let the managers run it. It's so simple. Let me tell you, I'm doing this because that's the kind of thinking our country needs. We have 21. We have very soon 21 billion -- think of it. We have $21 trillion. Trillion. Nobody even knows what the hell a trillion. What's a trillion? Ask. Nobody knows what a trillion is. You know, not so long ago you never heard the term trillion. Now it's like a routine. So we have 21 version that horrible omnibus budget. Which by the way, financed Obamacare extension, finance people coming in from Syria that we have no idea who they are, where they are. We have no -- they have no paperwork, no documentation. So here's the story, folks. Here's the story. Many -- we're going to end up. We're -- don't worry about it. We're going to -- trust. You know, when I first did this, when I first came they got to go. No, no. They got to go. This is beyond the wall. This they fly them in. OK. This is beyond the wall. They fly over the wall. Look. Look. We're going to be now the smart country. We're not going to be the dummies anymore. We're going to be the smart company. We're going to be the smart country and we're going to have to send them back. We have no idea who they are. There's no documentation whatsoever. And we'll help them build a safe zone in Syria someplace and I'll get -- and I'll get the Gulf states who by the way are not carrying their way. They got a lot of money. They're not taking the migrants. You know, there's no migration going into the Gulf states. They're going to pay for it. We'll supervise it. Hey, I have a bigger heart than anybody. We -- you know, it's a problem. You look at that migration although it is strange because you see so many young strong men. Right? Do you ever see anything? I said, \"Where are the women? Where are the children? What's going on?\" You have young strong men. And they're coming into our country. They're coming in by the thousands. Remember I said a big number and everyone said, \"That's ridiculous.\" He's talking about 3,000. Well, the 3,000's gone to 10,000's gone and now they're talking about tens of thousands of people are pouring into our country. We don't even know who the hell they are or where they come from. And let me tell you, you're going to have a problem. It's going to be a big ugly problem and we better be careful and we better be smart and we better be vigilant or our country is in big trouble. If you look at what happened in California where the two people, where she radicalized him and they killed their co-workers. Fourteen people, lots of people in the hospital and their lives will never be the same. But you look at that. And by the way, speaking of that Second Amendment. If there were guns on the other side of that room. Right? If there would guns on the other side of that room with a couple of these guys like -- where's that guy from Drum? Right there. Right there. If he had his gun and he's standing on the other side, you don't have 14 people dead. You have a couple of bad ones dead but you don't have 14 people. Same thing. Same thing in Paris. I mean, my whole campaign change. It was -- and actually, when Paris happened because of the fact that they say that I do great on security. People have confidence on me. I'm not going to let people -- I'm not -- you trust me. You do trust me and I appreciate it. But I will be the best on the military by far. And what happened with Paris, 130 people killed and they were just sitting ducks with these guys. These animals walked in, boom, boom, boom, boom. Hundred and thirty people killed. Tremendous numbers of people right now in the hospital and nobody even -- ruined for life. Many of them will die. Seriously, seriously wounded. And you know what? If there were guns in that room outside of the bad guns -- first of all, they might not have ever come in. OK? Because there's a -- I'm not going in there. They've guns. But if they did go in, the -- the casualties might be very little. And you know what? They would have been gone very, very quickly. So we have to protect. We have to protect our Second Amendment. OK? And nobody is going to mess with it. Nobody. Nobody. Thank you. So when I started this on June 16th that I came down the escalator with Melania and it was great. And then everybody was happy and I started talking about illegal immigration which would have never even been talked about if I didn't bring it up. And I talked about the crime and I took a lot of heat. And I talked about all of the problems and I talked about the drugs pouring across and everything. And then, two, three weeks later, everyone saying he's right. Now they're all copying me. Isn't it incredible? I even heard lying Ted the other day said, \"We must build the wall.\" I said, \"Where did that come from?\" Where did it come from? He's a liar. He's a liar. But you know what? We have to build a wall and we have to do many other things. And we have to be vigilant and we have to be smart and we have to watch and we have to see. And when you see something that's wrong you have to report it to your police. Because there's nobody like the police. The police are so great they don't get the credit they deserve. They don't get the credit they deserve. But you have to report it to your police and we take care of it. You know, when they had these 14 people. They were killed. The two people, they have bombs all over their floor. Everybody knew they were up to something bad. Their bombs. I mean, you don't walk into too many houses if you see bombs all over the floor. Right? People saw it, they all knew. One person said they didn't want to do it and they didn't want to have racial profiling. Another words, the lawyers said, \"You got a problem. You knew this was here. You better make up some excuse. So they sent a racial profile.\" Do you believe that? When you see a problem you got to report it. But they aren't reporting the problems. I mean, they just caught the one guy. He was living right next to where he grew up and he was there for months and months. They don't use the word mastermind anymore because I went -- I said don't call them masterminds. You know, they are ruining our youth with the Internet. Their taking our youth and they go on over to fight ISIS. And they're calling the head guy with the white cap, the guy that I call the guy with the dirty cap. They're calling him a mastermind. And I said, \"Don't call him that.\" And for two weeks I pounded the press and now they don't use the word. I haven't heard the word mastermind anymore. But then you wonder, how come they were able to use our Internet better than we are? And they're taking kids out of here. And they're fighting crisis for whatever reason. They're fighting crisis. And let tell you something, anybody leaves our country and fights for ISIS they never ever come back into this country. Remember that. You know, right now they leave our country. They leave our country. They fight for ISIS, they come back like nothing ever happened. Because here's what's going to happen, someday they're not going to leave. They're going to be fighting us right here. They're not going to leave. Why shouldn't they leave? So anybody leaves our country they're not coming back. They're gone, gone, gone for ever. OK? Forever. So. So here's the story, folks. We don't win anymore. Thank you. Oh, yeah go ahead. Very aggressive person. Go ahead. She wants to ask me a question. Go ahead. If I don't like it. You know, nobody can hear her right up. Go ahead. Let's go. She's reading the question off her phone. Go ahead. Oh, that's OK. Oh, that sounds bad. Come on let's go. Let's go. Let's go and they're holding up all these people there. I can't hear her question. Like, let's forget the questions. Right? OK. Thank you. I can't hear the question. OK. So here's very aggressive person but that's OK. Since valuable -- are you must be very successful? No, no. That's enough. That's enough. I think the question was nice but it wasn't you know, it wasn't like a question. I don't think a lot of people would have been interested. Of course I will. I will help the moral state of the country and you know what I'll do? I'm going to bring our country together because our country right now is divided. And I'm going to bring our country together. Everybody. Everybody. The safest place to be in this country is at a Trump rally. And you listen to the press, all wrong. The safest place to be is that because the people here love each other. But we going to love other people, we going to love everybody. We're going to love women, men children, elderly, every -- we're going to take care of every. Why? African-American. Everybody. We're all going to come together as a country and we're going to be a strong great country again. Right now we're a divided country. And we're going to make this country something special. And I've gone all over the country, all over the country. And I've had the biggest crowds of anybody by far. Thirty five thousand people in Alabama, 22,000 people in Dallas filled up the whole ma -- Mavericks arena. We are and always, the biggest crowds. And always the people are unbelievable in this country. All they need is some help. We need smart decision making. We need a strong military not a decimated military. We need -- we need help for our veterans because you know, the people in the military now, they say well, they're going to be a veteran into the future. And they lose their co -- they lose their faith when they see what's happening to our veterans. It's not fair to the people that are veterans or the people that are serving. So we're going to take care. But here's the story, folks. Right. We don't win anymore. The truth is we know. We don't win anymore. When we used to win. We don't win anymore. We don't win in any level. We lose in everything. We don't win, we going to win with me, you better believe it. You're going to win me. You better believe it. I mean, my family has going to say, before my family says, \"What do you do this for?\" That's a lot of work. It is a lot of work and it takes guts to run for president. Not so easy. You know, I'm proud to say I wasn't a politician until a June. But -- and I'm not a politician now, folks. But -- but there's so much potential in this country and I love this country and I want to give back. I made a lot of money, I had a great success, I've had -- I've had a lot of fun doing it too. I've loved doing it. I've loved every moment I've been alive in this country. And we going to give back and we're going to take communities like this that are incredible with incredible people. And we're going to bring jobs back together. We're not going to be the foolish people that allow other countries to take our factories and to take our jobs. We're not going to allow it to happen anymore. So here's the story. You're going to go and you'll going to vote hopefully on Tuesday. And you'll going to look back, you'll going to look back on today. You'll going to say, \"We were in this beautiful airplane hangar.\" Which is very nice actually. Look at that beautiful weather. But we -- I have is very heavy coat. I said, \"You think I needed the coat?\" I'm glad I didn't wear this. It's pretty hot up here. But you'll going to look back and you'll going to say, \"That was an incredible day.\" That was a great afternoon, a beautiful afternoon with fantastic, beautiful, incredible people that were your friends and are your friends and you're together as a community. But that was the day that we went out because of that day and we voted the following Tuesday. And that was the greatest single vote I've ever cast. You'll going to say that. And you'll going to look back in two years -- especially, the guys of Fort Drum. Right? Especially. Right? Because I'm -- I'm with you. I'm with you people for more than anybody else by far. You're going to be so happy. Because you're proud, you're proud. You're proud of the military and you look at some of the equipment. A friend of mine has a son who's over in Iraq. And he said the most disappointing thing. And you'd maybe able to, you know, endorse this and say in all of the folks from Fort Drum. He said, \"We fight the enemy and the enemy has newer equipment than we do.\" And It's our equipment. And they get it, by taking it away from people that we give it to that we think are good but they're not good or they run when the first bullet is fired. They drop it, they run and these guys pick up our equipment. He said, \"We're fighting with older equipment like the Humvees. They have Humvees with no plate.\" And the -- the enemy took 2,300 armor plated Humvees away from people that we gave him to like you take candy from a baby. Those days are over, folks. It's not going to happen anymore. Is that a correct story? Right? So. So here's the story. You going to go vote, you going to go vote. Everybody in this room. Now, if you don't want to vote for me, don't vote. Do you ever hear the politicians? They always say, \"It makes no difference whether you're going to vote for me or my opponent but you must go out and vote. It's the great American treasure.\" OK. Me? I've to say differently. If you're not going to vote for me, don't vote. OK? Don't vote. Sit home -- sit home and watch television. But I have a feeling everybody in this crowd, is anybody in this crowd not going to vote for Trump? Everybody going to vote for Trump? All right then. I -- I believe that actually. Look, you'll going to say -- you'll going to say, looking back two years, four years, eight years, ten years, twenty five years. You'll going to say, \"When you cast that vote, it was the greatest vote you'll ever cast because that's when our country started winning again.\" We're going to win on trade. We're going to win on your jobs. We're going to bring your jobs back. We're going to win on the economy. We're going to win for our vets. We're going to win for our military. We're going to knock the hell out of ISIS. We're going to win with our military. We're going to win with our borders, we're building the wall. Mexico is going to pay for the wall, by the way. We're going to get rid of the drugs. We're going to win on that front. We're going to win with education. We're getting rid of Common Core. We're going to bring education local. We're going to repeal and replace Obamacare. We're going to replace it with something so much better. Folks, we're going to start winning, winning, winning, winning. You're going to be so proud of your president and that I don't care. You're going to be so proud of your country again. So get out there on Tuesday and vote. I love you Watertown. Get out and vote. And we're going to have a big, big success in New York. Thank you. Thank you everybody. It's a great honor to be here. Thank you. Thank you everybody. Thank you."}