{"id":406,"author":"Donald Trump","title":"Speech: Donald Trump in Plattsburgh, NY","date":"2016-04-15","link":"https://factba.se/transcript/donald-trump-speech-plattsburgh-ny-april-15-2016","paragraphs":["Good to be with you. Good to be with you. Beautiful. This is a great part of the world. Believe me, folks. This is a great part. So thank you. What a wonderful crowd. A lot of people. We have a lot of people everywhere we go. You know what it's called? Make America great again. That's what we want. That's what we're going to be doing.","We're going to stop all the nonsense that's going along. You look at the foreign trade. You look at what's happening. We're going to stop it, folks. We're going to bring jobs back to New York state. We're going to bring them back fast -- very, very fast. So you know what I've been doing when I'm going around the state and we have had big -- we were in Albany, in Rochester, in Rome, our Rome, as opposed to the other Rome, right?","But -- and you look at the numbers, and what I've been doing, I've been asking people, \"Give me some numbers. Let me see how we're doing. How are we doing up in Plattsburgh?\" So here's some numbers. United States industrial production, right, declined for the past seven straight months. You know, our GDP is like zero.","If in China, their GDP dips below seven, eight, 9%, you know what they do? It's like a major catastrophe. Ours is zero. We're down to practically nothing. Here's a strong looking guy right there. Yeah, that's OK. That's my kind of a guy. He's got the flag, he's got the whole deal. Good job. Good job. Only in America, folks.","Only in America. Thank you. That's true. The number of people with a job in Plattsburgh has been -- has really -- I mean, over the last 15 years, it's really gone down, there are nearly 3,000 fewer people right now working in your community than they had in 2000. Not good. Come on, folks.","What's wrong here? What's wrong? You know what's wrong? You need leadership. That's what's wrong. Because you got the right people. We've got the best people. The unemplo -- the unemployment rate in Plattsburgh right now is higher today substantially than it was just six months ago. So who left? Everybody leaves.","They're not going to leave with me, folks. They're going to pay a big penalty when they start leaving, OK? Hey, folks, look, you know, the politicians, they talk and they talk. I always say, \"All talk, no action.\" When they leave and they go to Mexico because they think we're going to rip off the United States a little bit, so they close up, whether it's Carrier or Nabisco or Ford, and they go -- or many others, many, many -- hundreds and hundreds of others.","They think they're moving to Mexico, they're going to make their product and they're going to sell it back to you, and there's not going to be a nice big fat tax to pay? Not going to happen, folks. OK. And they're not going to move. They're not going to move. They won't be moving so fast. You know, right now, they have no downside.","They leave us -- whether it's here or anyplace, you know, they leave us and they want to go to other countries and they make their product and they sell it in, then somebody say, \"Will the product will cost more?\" Well, number one, that's not necessarily true. But number two, but we're going to have jobs, so the product costs a little bit more, we're going to have a lot more jobs.","We're going to be very smart. That's what I do. You know, I took -- I borrowed a million dollars and I built a company that's worth more than $10 billion. Believe me, folks. I know what I'm doing. I know what I'm doing. Believe me, I know. And I built one of the great companies, and I filed with the Federal elections, and I built some of the greatest assets in the world, very low debt, unlike our nine tri -- we have right now $19 trillion in debt.","So I built this great -- some of the great assets, low debt, great cash flow, and I say it for a different reason because that's the kind of thinking we need in our country now or we're not going to have a country left. We're not going to have -- literally, we're not going to have a country left.","So we're going to do it right. All right. And let me give you a couple of most horrible statistics that we're going to throw that away and we're going to get down to business, right? All these young people. So in all these great young people that are in this first row, I'm looking at them. Beautiful, great young people.","We want them to stay here when you're finished with school, all right? Not to move. Labor force participation rate, I don't have to say it's a disaster. New York State has lost three out of four every job, all manufacturing. You've lost three out of four of your manufacturing jobs since 1960. Not so great.","Not so great. Ask China how are they doing, OK? New York State has lost 350,000 manufacturing jobs since 1997. No good. No good. Not going to happen. Lying Ted Cruz supports giving Obama more and more control over trade. No good. He can't do it. He wants TPP to be approved. You approve TPP. And as you know, Kasich, he approved NAFTA.","You know what NAFTA did to your area. It's a disaster. OK? You don't want these guys, folks. These are the -- and you know what, they're all controlled by special interests. They're all controlled by the money that they get to run against me. I'm running, I'm using my own money. I took my plane. I come up here.","I'm paying for it. And when people come in they say, \"Well, you have to do this. They were a big contributor.\" Who knows that world better than I do? Nobody. You know, I've been a politician now for like nine months, but who knows the other side better than me. And they have lobbyists and they have special interests, have total control over Cruz, have total control over Hillary.","Hillary. She's terrible. I watched her last night in the debate. We probably have some Sanders fans, right? Do we have any? Because that's OK. No? Because you're pretty close to his territory. You're pretty close. You know, I'll tell you, I'm not a fan, but I will tell you this. We have one thing in common.","He knows our country is being ripped off in trade. The difference is, I really know our country is being ripped off and badly, but I'm going to turn it around and I'm going to turn it around in jobs for us, OK, because that's what's going to happen. Lying Ted, he supports Chinese currency cheating, which is really the way they beat us. They don't beat us with their product.","We have a better product. We can do a better job. They beat us by manipulating their currency, and our politicians, they don't even understand it. But our politicians do nothing about it. That's going to change. TPP, Trans-Pacific Partnership, is going to destroy the state of New York. Believe me. It's going to decimate.","We've got to get it stop. Cruz wants it. Kasich wants it. We've got to get it stopped. I'll negotiate deals, folks, that will bring back jobs. We can't go with this. You know -- you know, TPP is composed of many countries, and what they're doing, the agreement is from 5,000-7,000 pages long. Every one of those countries knows every word of that agreement.","We probably -- our guys, they don't even re -- I don't even think they read it. I do -- just like Obamacare, which by the way we're going to repeal and replace, OK? Disaster. It's a disaster. Do you know that our politicians, there's practically a politician in Washington that even read that monstrous agreement.","And you see doctors, you talk to your doctors. Your doctors will tell you it's a catastrophe. We're going to get rid of it. We're going to have great health care. It's going to cost you less money. It's going to be better for the country, and it's going to do the job. And look at what's happening. Your premiums are going up 35, 45, and 55%. It's a disaster.","So we're going to get rid of it. OK. Illegal immigration. Who loves the idea of the wall? Right? 100%. 100%. We're going to build that wall. It's going to be so beautiful. You know, it's going to be beautiful. It will be. It'll be as good looking as a wall can look. I'm very good at this stuff.","But what it will be is it will be big, it'll be powerful, it'll have a big door in it, folks, because people are going to come into the country. We want people to come into the country, but they have to come in legally, OK? Legally. No more of the craziness. So -- so -- go ahead. Going to happen.","So this all started on June 16th, and I said, \"You know, we have problems with immigration.\" I brought it up during the speech. Wow, did that become a big deal, right? They wouldn't even be talking about illegal immigration if I weren't in this race. Nobody would be talking. The Border Patrol, who are great people by the way, 16,000. Are you Border Patrol people?","Really, wow. Well, maybe you're among. 16,500 Border Patrol folks endorsed me last week. They've never endorsed a presidential candidate before. Right now -- you know, they want to do their job even -- look, we're going to build the wall. You need the wall because we've got to stop the drugs. We've got to stop a lot of things.","But -- but the Border Patrol endorsed me because they can do -- they can -- if we let you do your job, it's going to be a whole different ballgame, right? Whole different ballgame. And, you know, they're incredible people and they want to do their job. Sheriff Joe Arpaio endorsed Trump. So -- so we're going to do great.","You know, one thing I wanted to do and I see it and I did it yesterday. I had some charts made. Now, I didn't want to do a big deal because this is so evident. But take a look. This is US manufacturing since 1980, but especially since the year 2000. Actually, from 1980-2000, not so bad. But you take a look at this chart.","OK. Take a look at that. That's not success, folks. That's big failure. That's big, big failure. Your jobs are being sucked out of the country, and we're going to stop it. And we're not only going to stop it. I just spoke to a reporter because we're going up to Syracuse soon, and Syracuse is in the same position.","They have been devastated by what's happening. And I said, \"You call me back in three years, I guarantee, you're going to see such a difference. Your head will spin. You watch. You watch.\" Do you agree with that? Who's going to pay for -- all right. You want to know? Who is going to pay for the wall? Not -- not even close, OK? Not even close.","You know, they had a man from Mexico, you know, the former President, right? You know, you saw that. And he was on Mexico and he used a terrible word. He used the f bomb. And I said to myself, \"Can you imagine if I use the f bomb? It would be like -- it would be the electric chair,right? The electric chair.\" He used it. And he said, \"There's no way we're going to pay for the wall\", that there's no way that Mexico's going to pay, which is a big improvement because he used to say, \"There's no way we're going to let the wall be built.\" So he now assumes the wall's going to be built.","Just so you understand. We lose with Mexico -- and I like Mexico. The Mexican people are incredible people. The Hispanics, I'm doing great with Hispanics because they know I'm going to bring back jobs. But what happens is this. What happens is this. They are so used to getting -- well, not Mexico, everybody, every country, that he couldn't believe that we would even suggest that Mexico would pay, and he threw out the f bomb.","We're not going to pay for you know what? Wall. I said, \"I couldn't believe it.\" He just said that on a major cable, on CNN. He just said that. I said, \"I can't believe he can say that.\" Next day, nobody even talked about that. But I'm telling you, he knows that they're paying. We lose 58 -- with -- with trade.","We lose $58 billion a year trading with Mexico. OK? We have a trade deficit. $58 billion a year. The wall's going to cost $10 billion. We have business people here, some -- many. Who's a business person? By the way, you're going to love me. We're going to get rid of those regulations that put you out of business, OK? We're going to get rid of that.","And we're going to get rid of it big league and we're going to get rid of it fast. But the business people are dying with regulations, they're dying with everything. We're going to build a wall. It's going to happen, but we're going to put our Border Patrol people together and you're going to stop drugs from coming in. You're going to stop illegal immigration.","We are going to have a country again. We're going to have strong borders and you're going to be so proud of your President. I'm telling you. OK? Remember that. So during one of the debates, lying Ted Cruz, everybody hear, boy, he's going way down in the polls. He's now third. You know, he was complaining about Kasich.","Now, Kasich has a problem because he approved NAFTA. That -- that's no good. He actually voted for it. But Cruz was saying, \"I want Trump one on one.\" You know, the other day, he said he won in Utah. He said, \"I won in Utah.\" But he didn't say that I won in Arizona the same day with a lot of people. But Cruz is going really down because people have been watching him.","And somehow, there's really nothing compelling there. You know, he's the last hope -- he's the last hope to stop Trump. That's all he's got going. That's not going to be good enough, folks, because we have a movement going on. We have movement. But his poll numbers, he was down like 12 points. A poll just came out as I walked up. I said, \"Would it be rude of me if I said that Ted Cruz's poll numbers are really tanking.","Would that be rude?\" And one -- he's going to come in third. He's -- he -- it looks like pretty sure he's going to come in third. And then you go out weeks and weeks and weeks, and it looks to me like he's going to be in third place. So he's going to be -- I don't think he's -- I actually think he's going to be not so much of a factor.","Let's see what happens. But during one of the debates, he came out and he talked with hatred about New York values, OK? Now, he's got an excuse. He says, \"Well, I was referring to liberals. I was referring to --\" You know, it's all nonsense. When you watch the tone. You know the tone? You know, they always want me to be have a nice tone.","They say, \"Mr. Trump, your tone.\" Hillary Clinton said, \"I don't like his tone.\" Remember that? I don't like -- so here it is. Jeb Bush said it to me. Where's Jeb? Jeb Bush said it to me. Low energy. Jeb Bush said, \"I don't like the tone of Mr. Trump.\" At least he calls me Mr. Trump. See that's a sign of respect.","Then he said, \"Donald Trump is a gifted politician.\" I said, \"I'm a politician? I didn't realize that.\" My wife said, \"Why did he call you a gifted? Why did he say nice things if he was competing?\" I said, \"That's the problem we have with our politicians. They don't know how to do it. They don't know how to do it.\" So look, I'm not a politician.","I refuse to be called a politician. But I started off with 17. We had 17 people. The real number -- total number was 18. 17 people against me. And now we're down to a couple. And one of them -- one of them is one for 32. And the other one, I've won many more states. I'm a 22 or something and he's at nine or 10. And more -- you know, to me the most important -- to me the most important, I'm at, and listen to this, millions of votes more -- through the primary process, millions and millions of votes more than Ted Cruz, millions of votes more than John Kasich in South Carolina, in New Hampshire, the whole South, Florida, Kentucky.","We've won so much. Massachusetts, I won Massachusetts. I think that's because -- you know why I won? Why did I win Massa -- because Tom Brady likes me, OK? And we like him. We like Tom Brady. But I won Massachusetts, got almost 50% in Massachusetts. In fact, I won Alabama and Massachusetts, very close together.","And they say that's pretty diverse when you get right down to it, OK? So we're having a good time. But when you -- when you look at what's happening, and I watched -- I watched that debate last night. Anybody watched the debate with Hillary and Bernie? So Hillary said, \"I have millions of votes more than Bernie.\" Which is true, I have to say.","Although, I don't know. I hear Bernie, he wins. He wins. He wins. He keeps winning. He keeps winning. Week after week, Bernie is winning, winning. And then I listen to the pundits. And tonight, Bernie Sanders won again for the seventh or eighth or ninth time in a row. But he's got -- no, OK. And you know what, that's OK. Because I feel sorry for him in a way.","He wins, and then you listen to the pundits. But he can't win. You know why? Because it's a rigged system, folks. It's a rigged system. I'm not a fan of Bernie Sanders, but he keeps winning. He keeps winning. He's winning here, winning there, winning here. Then you watch the little round tables of the political pundits, most of whom don't know what the hell they're talking about.","But you watch the round table and it says Bernie Sanders can't win. Why can't he win if he wins all the time? Because they have a phony system that the bosses pick whoever is running for election. So here's what we have. We have a rigged system. The Republican system is rigged. OK? It's a rigged system. And you look at Colorado where they're having a big march later or something's happening, but the people are angry.","I would have done great in Colorado. And then they said, \"We didn't change the system. He knew the rules.\" Let me tell you. When I joined the campaign in June, they had a system. After they saw that I was going to win Colorado, they changed the system. They said they didn't change, they changed the system.","And they went to a deal where the bosses picked the delegates and the people never got to vote, and the people didn't know in Colorado that their vote was being taken away from them. And let me tell, you have some angry people in Colorado right now. And if you want to know the truth, it's a beautiful thing to watch because they're 100% right.","They're 100% right. So it will be interesting. Now, with all of that being said, I'm hundreds of delegates up. And I think we're going to close it out before the convention to be honest with you. We have a great -- so important is for you to get out and vote. I'm going to bring your jobs back, folks. Believe me. We're going to make our military so strong, so tough, so smart.","We're going to take care of our vets. We're going to take great care of our vets. We're going to do all the things that you know I talk about. But you got to get out. But we have a movement going on. It's an incredible moment. I just want to read you this. I wrote this. I said it last night at a dinner and people liked it. But I wrote this because I feel strongly about it. During a debate, Cruz talked about New York values New York values.","Boy, he wished he didn't say that, right? That was a -- that was a bad thing. And he said it with hatred toward New Yorkers, he said it with hatred toward me, but me I don't care about. But he said it with a lot of anger and a lot of hatred. And he was talking about everything that you know he was talking about.","Now, he's trying to make excuses. You know, saying, \"Well, I meant liberal. I meant liberal.\" He doesn't mean liberal. Not too many liberals in this room, could be a few, but that's OK. They've been very nice. Let me go and let me just say that New York values represent great things -- great things. And I just want to talk about the New York values that we all know so well.","The values that make us love this state, despite the fact that we're not doing so well, which has been a symbol of American strength for years throughout the world. And that's for many, many years. New York state, for many years, has -- has really represented American strength. And we're going to take care of all these areas where the companies are leaving and we're going to be back to that position again.","Where do we see New York values? We see it with our great New York police force. We love our police. We see it with our firefighters, who by the way we're running up those stairs knowing that the World Trade Center probably was going to be tumbling down, and these people were running up those stairs along with the police, trying to help people and they knew that those buildings were -- they were coming down.","And they didn't -- they just went up. These are great people. These are New York values by the way. These are the real New York values that guys like Cruz and others don't want to talk about. We see it with our transit workers. You saw the bravery with the transit workers. We see it with families playing in Central Park and playing in your parks up here.","Families that love each other and they love our state and they love our country. You see it with restaurant workers in delis and factory workers upstate. Now, when I wrote this, I didn't know the unemployment. What factory workers, right? But we're going to bring those factory workers back. We're going to bring the businesses back and the people up here are going to have so many jobs to be looking at. We see it in the whole fabric of our community.","What are New York values? Honesty and straight talking. A lot of people, they tell me, I don't know. But they tell me they like Trump because he's a straight talker. Now, gets me in trouble every once in a while. Sometimes we talk too straight. But the honest truth, we have to be straight talkers. This political correctness is killing our country.","It's killing us. It's killing us. We see it in our work ethic. Because the New York work ethic, and you hear it all the time, the energy that we have in New York. You see it in a family and you see it -- another one, you see it in the -- the vibrance -- the vibrance of our people. Our people are vibrant, our people are loving people.","We're builders. We make things. We have courage and we love our community, and that's what New York values is. And just remember this, New York values were really on display for all to see in the aftermath, more than any time that I've -- I've lived here all my life. I know this area, I know every area of New York.","I was in Long Island and Bethpage. We were in Suffolk. We were in Suffolk. And it's rough because you see the buildings, it is so much empty stuff. But New York values were on display more than any other time in the aftermath of 9/11. A strike that hit at the heart of our city, the heart of our nation like no other event that ever happened to our country, worse than Pearl Harbor.","Pearl Harbor was an attack on our military. People -- even though it was a total sneak attack, at least it was our military. They can defend, and, boy, did they defend. Did we defend? You better believe it. That was not a good move attacking Pearl Harbor. It's going to turn out to be not a good move attacking the World Trade Center, folks.","Believe me. Not a good move. In our darkest moments as a city, we showed the world the very best of America, the firefighters and the first responders and our police officers and our Port Authority workers who ran up those stairs. Those are what New York values are all about. Father Mychal Judge, an incredible guy who I knew a little bit.","A chaplain to New York City Fire Department who died providing comfort and prayer to the wounded and the fallen, and he knew -- he knew when he looked, he knew he probably would be dying. Those are New York values, folks. Those are New York values. The people in the towers who helped rescue each other. Those are New York values.","They were rescuing each other. They were staying there far longer than they should have. They knew the danger of what they were doing. And you know what, they had choices and you don't even want to know what those choices were, stay in or get out, and the stairs no longer work. They had no way out. But those are New York values.","Those were amazing, amazing people. The restaurants and the local businesses who kept their shops open to help the responders. I have an office building in downtown, 40 Wall Street. People were staying there. They were living there. Everybody opened their hearts. Those are New York values. Everyone who help clear the rubble and rescue the injured and are now suffering, in many cases, because the fumes, they -- what they breathed in is having a lasting effect.","Many died -- many died from what they breathed in. But people were there immediately after the tragedy, and they're suffering to this day. Many, many died. Those are New York values. Every small act of kindness, every great act of coverage -- the courage down there was incredible. Those are New York values, the real New York values.","And these are the values we need to make America great again, folks. These are the values. We have the people. We have great, great people in this state. We have people that are admired all over the world for their energy, for their intelligence, for everything. And we're going to bring this state back, but we're going to bring this country back because everybody, I think, we put our country even above our state.","Do we agree with that? I think we put our country even above our state. So when I watched the Ted Cruz's of the world mocking New York values, I don't like it. I don't like it. That's OK. Let him -- don't even talk. Don't even look. You know, when you hear these little weak voices back there. Nobody hears them.","The only time we hear them is when we start pointing. So ladies and gentlemen, so important -- so important. You got to get out and you ha -- see, they just disappeared. You know. it's like unbelievable. Just amazing. You know, my rallies are the safest places to be on earth and nobody wants to report that.","The dis -- the dishonest media will never report that. And because we love each other and we protect each other, and that's the way our country is going to be soon. We love each other, we protect each other. And, you know, there's one little -- there's one person like this person with the weak voice. If there's one person that tries to say something, the next, they look at love in this room.","Look how many people there are at this odd time of the day and look how many people. And the press will say, \"Rally interrupted by a protester\", who lasted for about three seconds whose voice gave out, right? These rallies are safe places. So I just want to --look, I want to finish by saying this. You're going to remember this afternoon.","You're going to remember this day, and hopefully on Tuesday, you're going to vote. And I'm not one of these politicians that say, \"It doesn't matter if you vote for me or my opponent. It's so important for the American spirit for you to vote.\" Well, let me just give you a little hint. If you want to vote for somebody else, don't vote.","OK? I really -- don't vote. You don't have to. For one time I'll say, \"Don't worry about the American spirit\". Now, we want you to vote for Trump because we're going to make America great again. Here's the thing. Look, here's the -- and I mean it so much. I have the greatest people in the world.","I have the greatest business people in the world lined up to renegotiate these horrible trade deals that have taken all our jobs, that have closed all our factories. We are -- and they don't want money. They don't want anything. They want to do it. You know, they're great people, some, then some of them aren't nice and all that.","They're not the nicest people. Who cares? I don't care. Do we want nice? We want the smart people. We've got the greatest people in the world. We have the greatest business people in the world. We don't use them, we don't talk to them. They're going to renegotiate these deals. Believe me, they're better than anybody.","I know all the best. They don't want anything. They just want to be able to do it because, in their way, they love this country more than you, as much as you, and they want to see our country thrive again. So we're going to start using our right people. Here's what has to happen i -- in many ways. Militarily, in business, we're going to use the people that know how to do the job.","We're not doing that right now. We're using people that are politically correct. You know, we do everything well. Think of it. Our military, we can't beat ISIS. We don't win. And that's what happens. You're going to remember this day and you're going to remember your vote on Tuesday and you're going to look back at that vote and you'll get to say that's the single greatest vote I ever cast because that's when things started changing.","That's when our country started to win again. We're going to win with our military. We're going to knock the hell out of ISIS. We're going to win -- we're going to win for our vets. We're going to take care of them. They're not taken care of as well as illegal immigrants right now. We're going to win for our vets and we're going to win with our vets.","We're going to win on the border. We're going to win on trade. That's right, we are going to build the wall. The wall will be built and the wall will be paid for by Mexico. We're going to win with trade. We're going to go from the worst trade deals ever negotiated in the history of our world to great deals that bring back our factories and bring back our jobs.","We're going to win with health care. Obamacare is gone. We're going to win with health care. We're going to get rid of Common Core and we're going to bring our education locally. We're going to save our Second Amendment, which is under siege. We're going to save our Second Amendment. And you're going to go in and you're going to vote and you're going to say, \"We started winning again.\" And I'm going to say, \"We win, win, win.\" And, you know, it's going to be interesting and I have fun with this.","But we're going to start winning again. We're going to win so much. We're going to win with military. We're going to win with trade. We're going to win with borders. We're going to win with health care. We're going to win, win, win. You're going to get sick and tired of winning. You're going to say to me, \"Mr. President, please, please.","We don't want to win so much. It's too much.\" And I'm going to say, \"No way. We're going to keep winning. We're going to make America great again.\" Thank you. Thank you. Get out and vote on Tuesday. I love you. We're going to bring it back. We're going to bring our country back. Thank you everybody. Thank you."],"text":" Good to be with you. Good to be with you. Beautiful. This is a great part of the world. Believe me, folks. This is a great part. So thank you. What a wonderful crowd. A lot of people. We have a lot of people everywhere we go. You know what it's called? Make America great again. That's what we want. That's what we're going to be doing. We're going to stop all the nonsense that's going along. You look at the foreign trade. You look at what's happening. We're going to stop it, folks. We're going to bring jobs back to New York state. We're going to bring them back fast -- very, very fast. So you know what I've been doing when I'm going around the state and we have had big -- we were in Albany, in Rochester, in Rome, our Rome, as opposed to the other Rome, right? But -- and you look at the numbers, and what I've been doing, I've been asking people, \"Give me some numbers. Let me see how we're doing. How are we doing up in Plattsburgh?\" So here's some numbers. United States industrial production, right, declined for the past seven straight months. You know, our GDP is like zero. If in China, their GDP dips below seven, eight, 9%, you know what they do? It's like a major catastrophe. Ours is zero. We're down to practically nothing. Here's a strong looking guy right there. Yeah, that's OK. That's my kind of a guy. He's got the flag, he's got the whole deal. Good job. Good job. Only in America, folks. Only in America. Thank you. That's true. The number of people with a job in Plattsburgh has been -- has really -- I mean, over the last 15 years, it's really gone down, there are nearly 3,000 fewer people right now working in your community than they had in 2000. Not good. Come on, folks. What's wrong here? What's wrong? You know what's wrong? You need leadership. That's what's wrong. Because you got the right people. We've got the best people. The unemplo -- the unemployment rate in Plattsburgh right now is higher today substantially than it was just six months ago. So who left? Everybody leaves. They're not going to leave with me, folks. They're going to pay a big penalty when they start leaving, OK? Hey, folks, look, you know, the politicians, they talk and they talk. I always say, \"All talk, no action.\" When they leave and they go to Mexico because they think we're going to rip off the United States a little bit, so they close up, whether it's Carrier or Nabisco or Ford, and they go -- or many others, many, many -- hundreds and hundreds of others. They think they're moving to Mexico, they're going to make their product and they're going to sell it back to you, and there's not going to be a nice big fat tax to pay? Not going to happen, folks. OK. And they're not going to move. They're not going to move. They won't be moving so fast. You know, right now, they have no downside. They leave us -- whether it's here or anyplace, you know, they leave us and they want to go to other countries and they make their product and they sell it in, then somebody say, \"Will the product will cost more?\" Well, number one, that's not necessarily true. But number two, but we're going to have jobs, so the product costs a little bit more, we're going to have a lot more jobs. We're going to be very smart. That's what I do. You know, I took -- I borrowed a million dollars and I built a company that's worth more than $10 billion. Believe me, folks. I know what I'm doing. I know what I'm doing. Believe me, I know. And I built one of the great companies, and I filed with the Federal elections, and I built some of the greatest assets in the world, very low debt, unlike our nine tri -- we have right now $19 trillion in debt. So I built this great -- some of the great assets, low debt, great cash flow, and I say it for a different reason because that's the kind of thinking we need in our country now or we're not going to have a country left. We're not going to have -- literally, we're not going to have a country left. So we're going to do it right. All right. And let me give you a couple of most horrible statistics that we're going to throw that away and we're going to get down to business, right? All these young people. So in all these great young people that are in this first row, I'm looking at them. Beautiful, great young people. We want them to stay here when you're finished with school, all right? Not to move. Labor force participation rate, I don't have to say it's a disaster. New York State has lost three out of four every job, all manufacturing. You've lost three out of four of your manufacturing jobs since 1960. Not so great. Not so great. Ask China how are they doing, OK? New York State has lost 350,000 manufacturing jobs since 1997. No good. No good. Not going to happen. Lying Ted Cruz supports giving Obama more and more control over trade. No good. He can't do it. He wants TPP to be approved. You approve TPP. And as you know, Kasich, he approved NAFTA. You know what NAFTA did to your area. It's a disaster. OK? You don't want these guys, folks. These are the -- and you know what, they're all controlled by special interests. They're all controlled by the money that they get to run against me. I'm running, I'm using my own money. I took my plane. I come up here. I'm paying for it. And when people come in they say, \"Well, you have to do this. They were a big contributor.\" Who knows that world better than I do? Nobody. You know, I've been a politician now for like nine months, but who knows the other side better than me. And they have lobbyists and they have special interests, have total control over Cruz, have total control over Hillary. Hillary. She's terrible. I watched her last night in the debate. We probably have some Sanders fans, right? Do we have any? Because that's OK. No? Because you're pretty close to his territory. You're pretty close. You know, I'll tell you, I'm not a fan, but I will tell you this. We have one thing in common. He knows our country is being ripped off in trade. The difference is, I really know our country is being ripped off and badly, but I'm going to turn it around and I'm going to turn it around in jobs for us, OK, because that's what's going to happen. Lying Ted, he supports Chinese currency cheating, which is really the way they beat us. They don't beat us with their product. We have a better product. We can do a better job. They beat us by manipulating their currency, and our politicians, they don't even understand it. But our politicians do nothing about it. That's going to change. TPP, Trans-Pacific Partnership, is going to destroy the state of New York. Believe me. It's going to decimate. We've got to get it stop. Cruz wants it. Kasich wants it. We've got to get it stopped. I'll negotiate deals, folks, that will bring back jobs. We can't go with this. You know -- you know, TPP is composed of many countries, and what they're doing, the agreement is from 5,000-7,000 pages long. Every one of those countries knows every word of that agreement. We probably -- our guys, they don't even re -- I don't even think they read it. I do -- just like Obamacare, which by the way we're going to repeal and replace, OK? Disaster. It's a disaster. Do you know that our politicians, there's practically a politician in Washington that even read that monstrous agreement. And you see doctors, you talk to your doctors. Your doctors will tell you it's a catastrophe. We're going to get rid of it. We're going to have great health care. It's going to cost you less money. It's going to be better for the country, and it's going to do the job. And look at what's happening. Your premiums are going up 35, 45, and 55%. It's a disaster. So we're going to get rid of it. OK. Illegal immigration. Who loves the idea of the wall? Right? 100%. 100%. We're going to build that wall. It's going to be so beautiful. You know, it's going to be beautiful. It will be. It'll be as good looking as a wall can look. I'm very good at this stuff. But what it will be is it will be big, it'll be powerful, it'll have a big door in it, folks, because people are going to come into the country. We want people to come into the country, but they have to come in legally, OK? Legally. No more of the craziness. So -- so -- go ahead. Going to happen. So this all started on June 16th, and I said, \"You know, we have problems with immigration.\" I brought it up during the speech. Wow, did that become a big deal, right? They wouldn't even be talking about illegal immigration if I weren't in this race. Nobody would be talking. The Border Patrol, who are great people by the way, 16,000. Are you Border Patrol people? Really, wow. Well, maybe you're among. 16,500 Border Patrol folks endorsed me last week. They've never endorsed a presidential candidate before. Right now -- you know, they want to do their job even -- look, we're going to build the wall. You need the wall because we've got to stop the drugs. We've got to stop a lot of things. But -- but the Border Patrol endorsed me because they can do -- they can -- if we let you do your job, it's going to be a whole different ballgame, right? Whole different ballgame. And, you know, they're incredible people and they want to do their job. Sheriff Joe Arpaio endorsed Trump. So -- so we're going to do great. You know, one thing I wanted to do and I see it and I did it yesterday. I had some charts made. Now, I didn't want to do a big deal because this is so evident. But take a look. This is US manufacturing since 1980, but especially since the year 2000. Actually, from 1980-2000, not so bad. But you take a look at this chart. OK. Take a look at that. That's not success, folks. That's big failure. That's big, big failure. Your jobs are being sucked out of the country, and we're going to stop it. And we're not only going to stop it. I just spoke to a reporter because we're going up to Syracuse soon, and Syracuse is in the same position. They have been devastated by what's happening. And I said, \"You call me back in three years, I guarantee, you're going to see such a difference. Your head will spin. You watch. You watch.\" Do you agree with that? Who's going to pay for -- all right. You want to know? Who is going to pay for the wall? Not -- not even close, OK? Not even close. You know, they had a man from Mexico, you know, the former President, right? You know, you saw that. And he was on Mexico and he used a terrible word. He used the f bomb. And I said to myself, \"Can you imagine if I use the f bomb? It would be like -- it would be the electric chair,right? The electric chair.\" He used it. And he said, \"There's no way we're going to pay for the wall\", that there's no way that Mexico's going to pay, which is a big improvement because he used to say, \"There's no way we're going to let the wall be built.\" So he now assumes the wall's going to be built. Just so you understand. We lose with Mexico -- and I like Mexico. The Mexican people are incredible people. The Hispanics, I'm doing great with Hispanics because they know I'm going to bring back jobs. But what happens is this. What happens is this. They are so used to getting -- well, not Mexico, everybody, every country, that he couldn't believe that we would even suggest that Mexico would pay, and he threw out the f bomb. We're not going to pay for you know what? Wall. I said, \"I couldn't believe it.\" He just said that on a major cable, on CNN. He just said that. I said, \"I can't believe he can say that.\" Next day, nobody even talked about that. But I'm telling you, he knows that they're paying. We lose 58 -- with -- with trade. We lose $58 billion a year trading with Mexico. OK? We have a trade deficit. $58 billion a year. The wall's going to cost $10 billion. We have business people here, some -- many. Who's a business person? By the way, you're going to love me. We're going to get rid of those regulations that put you out of business, OK? We're going to get rid of that. And we're going to get rid of it big league and we're going to get rid of it fast. But the business people are dying with regulations, they're dying with everything. We're going to build a wall. It's going to happen, but we're going to put our Border Patrol people together and you're going to stop drugs from coming in. You're going to stop illegal immigration. We are going to have a country again. We're going to have strong borders and you're going to be so proud of your President. I'm telling you. OK? Remember that. So during one of the debates, lying Ted Cruz, everybody hear, boy, he's going way down in the polls. He's now third. You know, he was complaining about Kasich. Now, Kasich has a problem because he approved NAFTA. That -- that's no good. He actually voted for it. But Cruz was saying, \"I want Trump one on one.\" You know, the other day, he said he won in Utah. He said, \"I won in Utah.\" But he didn't say that I won in Arizona the same day with a lot of people. But Cruz is going really down because people have been watching him. And somehow, there's really nothing compelling there. You know, he's the last hope -- he's the last hope to stop Trump. That's all he's got going. That's not going to be good enough, folks, because we have a movement going on. We have movement. But his poll numbers, he was down like 12 points. A poll just came out as I walked up. I said, \"Would it be rude of me if I said that Ted Cruz's poll numbers are really tanking. Would that be rude?\" And one -- he's going to come in third. He's -- he -- it looks like pretty sure he's going to come in third. And then you go out weeks and weeks and weeks, and it looks to me like he's going to be in third place. So he's going to be -- I don't think he's -- I actually think he's going to be not so much of a factor. Let's see what happens. But during one of the debates, he came out and he talked with hatred about New York values, OK? Now, he's got an excuse. He says, \"Well, I was referring to liberals. I was referring to --\" You know, it's all nonsense. When you watch the tone. You know the tone? You know, they always want me to be have a nice tone. They say, \"Mr. Trump, your tone.\" Hillary Clinton said, \"I don't like his tone.\" Remember that? I don't like -- so here it is. Jeb Bush said it to me. Where's Jeb? Jeb Bush said it to me. Low energy. Jeb Bush said, \"I don't like the tone of Mr. Trump.\" At least he calls me Mr. Trump. See that's a sign of respect. Then he said, \"Donald Trump is a gifted politician.\" I said, \"I'm a politician? I didn't realize that.\" My wife said, \"Why did he call you a gifted? Why did he say nice things if he was competing?\" I said, \"That's the problem we have with our politicians. They don't know how to do it. They don't know how to do it.\" So look, I'm not a politician. I refuse to be called a politician. But I started off with 17. We had 17 people. The real number -- total number was 18. 17 people against me. And now we're down to a couple. And one of them -- one of them is one for 32. And the other one, I've won many more states. I'm a 22 or something and he's at nine or 10. And more -- you know, to me the most important -- to me the most important, I'm at, and listen to this, millions of votes more -- through the primary process, millions and millions of votes more than Ted Cruz, millions of votes more than John Kasich in South Carolina, in New Hampshire, the whole South, Florida, Kentucky. We've won so much. Massachusetts, I won Massachusetts. I think that's because -- you know why I won? Why did I win Massa -- because Tom Brady likes me, OK? And we like him. We like Tom Brady. But I won Massachusetts, got almost 50% in Massachusetts. In fact, I won Alabama and Massachusetts, very close together. And they say that's pretty diverse when you get right down to it, OK? So we're having a good time. But when you -- when you look at what's happening, and I watched -- I watched that debate last night. Anybody watched the debate with Hillary and Bernie? So Hillary said, \"I have millions of votes more than Bernie.\" Which is true, I have to say. Although, I don't know. I hear Bernie, he wins. He wins. He wins. He keeps winning. He keeps winning. Week after week, Bernie is winning, winning. And then I listen to the pundits. And tonight, Bernie Sanders won again for the seventh or eighth or ninth time in a row. But he's got -- no, OK. And you know what, that's OK. Because I feel sorry for him in a way. He wins, and then you listen to the pundits. But he can't win. You know why? Because it's a rigged system, folks. It's a rigged system. I'm not a fan of Bernie Sanders, but he keeps winning. He keeps winning. He's winning here, winning there, winning here. Then you watch the little round tables of the political pundits, most of whom don't know what the hell they're talking about. But you watch the round table and it says Bernie Sanders can't win. Why can't he win if he wins all the time? Because they have a phony system that the bosses pick whoever is running for election. So here's what we have. We have a rigged system. The Republican system is rigged. OK? It's a rigged system. And you look at Colorado where they're having a big march later or something's happening, but the people are angry. I would have done great in Colorado. And then they said, \"We didn't change the system. He knew the rules.\" Let me tell you. When I joined the campaign in June, they had a system. After they saw that I was going to win Colorado, they changed the system. They said they didn't change, they changed the system. And they went to a deal where the bosses picked the delegates and the people never got to vote, and the people didn't know in Colorado that their vote was being taken away from them. And let me tell, you have some angry people in Colorado right now. And if you want to know the truth, it's a beautiful thing to watch because they're 100% right. They're 100% right. So it will be interesting. Now, with all of that being said, I'm hundreds of delegates up. And I think we're going to close it out before the convention to be honest with you. We have a great -- so important is for you to get out and vote. I'm going to bring your jobs back, folks. Believe me. We're going to make our military so strong, so tough, so smart. We're going to take care of our vets. We're going to take great care of our vets. We're going to do all the things that you know I talk about. But you got to get out. But we have a movement going on. It's an incredible moment. I just want to read you this. I wrote this. I said it last night at a dinner and people liked it. But I wrote this because I feel strongly about it. During a debate, Cruz talked about New York values New York values. Boy, he wished he didn't say that, right? That was a -- that was a bad thing. And he said it with hatred toward New Yorkers, he said it with hatred toward me, but me I don't care about. But he said it with a lot of anger and a lot of hatred. And he was talking about everything that you know he was talking about. Now, he's trying to make excuses. You know, saying, \"Well, I meant liberal. I meant liberal.\" He doesn't mean liberal. Not too many liberals in this room, could be a few, but that's OK. They've been very nice. Let me go and let me just say that New York values represent great things -- great things. And I just want to talk about the New York values that we all know so well. The values that make us love this state, despite the fact that we're not doing so well, which has been a symbol of American strength for years throughout the world. And that's for many, many years. New York state, for many years, has -- has really represented American strength. And we're going to take care of all these areas where the companies are leaving and we're going to be back to that position again. Where do we see New York values? We see it with our great New York police force. We love our police. We see it with our firefighters, who by the way we're running up those stairs knowing that the World Trade Center probably was going to be tumbling down, and these people were running up those stairs along with the police, trying to help people and they knew that those buildings were -- they were coming down. And they didn't -- they just went up. These are great people. These are New York values by the way. These are the real New York values that guys like Cruz and others don't want to talk about. We see it with our transit workers. You saw the bravery with the transit workers. We see it with families playing in Central Park and playing in your parks up here. Families that love each other and they love our state and they love our country. You see it with restaurant workers in delis and factory workers upstate. Now, when I wrote this, I didn't know the unemployment. What factory workers, right? But we're going to bring those factory workers back. We're going to bring the businesses back and the people up here are going to have so many jobs to be looking at. We see it in the whole fabric of our community. What are New York values? Honesty and straight talking. A lot of people, they tell me, I don't know. But they tell me they like Trump because he's a straight talker. Now, gets me in trouble every once in a while. Sometimes we talk too straight. But the honest truth, we have to be straight talkers. This political correctness is killing our country. It's killing us. It's killing us. We see it in our work ethic. Because the New York work ethic, and you hear it all the time, the energy that we have in New York. You see it in a family and you see it -- another one, you see it in the -- the vibrance -- the vibrance of our people. Our people are vibrant, our people are loving people. We're builders. We make things. We have courage and we love our community, and that's what New York values is. And just remember this, New York values were really on display for all to see in the aftermath, more than any time that I've -- I've lived here all my life. I know this area, I know every area of New York. I was in Long Island and Bethpage. We were in Suffolk. We were in Suffolk. And it's rough because you see the buildings, it is so much empty stuff. But New York values were on display more than any other time in the aftermath of 9/11. A strike that hit at the heart of our city, the heart of our nation like no other event that ever happened to our country, worse than Pearl Harbor. Pearl Harbor was an attack on our military. People -- even though it was a total sneak attack, at least it was our military. They can defend, and, boy, did they defend. Did we defend? You better believe it. That was not a good move attacking Pearl Harbor. It's going to turn out to be not a good move attacking the World Trade Center, folks. Believe me. Not a good move. In our darkest moments as a city, we showed the world the very best of America, the firefighters and the first responders and our police officers and our Port Authority workers who ran up those stairs. Those are what New York values are all about. Father Mychal Judge, an incredible guy who I knew a little bit. A chaplain to New York City Fire Department who died providing comfort and prayer to the wounded and the fallen, and he knew -- he knew when he looked, he knew he probably would be dying. Those are New York values, folks. Those are New York values. The people in the towers who helped rescue each other. Those are New York values. They were rescuing each other. They were staying there far longer than they should have. They knew the danger of what they were doing. And you know what, they had choices and you don't even want to know what those choices were, stay in or get out, and the stairs no longer work. They had no way out. But those are New York values. Those were amazing, amazing people. The restaurants and the local businesses who kept their shops open to help the responders. I have an office building in downtown, 40 Wall Street. People were staying there. They were living there. Everybody opened their hearts. Those are New York values. Everyone who help clear the rubble and rescue the injured and are now suffering, in many cases, because the fumes, they -- what they breathed in is having a lasting effect. Many died -- many died from what they breathed in. But people were there immediately after the tragedy, and they're suffering to this day. Many, many died. Those are New York values. Every small act of kindness, every great act of coverage -- the courage down there was incredible. Those are New York values, the real New York values. And these are the values we need to make America great again, folks. These are the values. We have the people. We have great, great people in this state. We have people that are admired all over the world for their energy, for their intelligence, for everything. And we're going to bring this state back, but we're going to bring this country back because everybody, I think, we put our country even above our state. Do we agree with that? I think we put our country even above our state. So when I watched the Ted Cruz's of the world mocking New York values, I don't like it. I don't like it. That's OK. Let him -- don't even talk. Don't even look. You know, when you hear these little weak voices back there. Nobody hears them. The only time we hear them is when we start pointing. So ladies and gentlemen, so important -- so important. You got to get out and you ha -- see, they just disappeared. You know. it's like unbelievable. Just amazing. You know, my rallies are the safest places to be on earth and nobody wants to report that. The dis -- the dishonest media will never report that. And because we love each other and we protect each other, and that's the way our country is going to be soon. We love each other, we protect each other. And, you know, there's one little -- there's one person like this person with the weak voice. If there's one person that tries to say something, the next, they look at love in this room. Look how many people there are at this odd time of the day and look how many people. And the press will say, \"Rally interrupted by a protester\", who lasted for about three seconds whose voice gave out, right? These rallies are safe places. So I just want to --look, I want to finish by saying this. You're going to remember this afternoon. You're going to remember this day, and hopefully on Tuesday, you're going to vote. And I'm not one of these politicians that say, \"It doesn't matter if you vote for me or my opponent. It's so important for the American spirit for you to vote.\" Well, let me just give you a little hint. If you want to vote for somebody else, don't vote. OK? I really -- don't vote. You don't have to. For one time I'll say, \"Don't worry about the American spirit\". Now, we want you to vote for Trump because we're going to make America great again. Here's the thing. Look, here's the -- and I mean it so much. I have the greatest people in the world. I have the greatest business people in the world lined up to renegotiate these horrible trade deals that have taken all our jobs, that have closed all our factories. We are -- and they don't want money. They don't want anything. They want to do it. You know, they're great people, some, then some of them aren't nice and all that. They're not the nicest people. Who cares? I don't care. Do we want nice? We want the smart people. We've got the greatest people in the world. We have the greatest business people in the world. We don't use them, we don't talk to them. They're going to renegotiate these deals. Believe me, they're better than anybody. I know all the best. They don't want anything. They just want to be able to do it because, in their way, they love this country more than you, as much as you, and they want to see our country thrive again. So we're going to start using our right people. Here's what has to happen i -- in many ways. Militarily, in business, we're going to use the people that know how to do the job. We're not doing that right now. We're using people that are politically correct. You know, we do everything well. Think of it. Our military, we can't beat ISIS. We don't win. And that's what happens. You're going to remember this day and you're going to remember your vote on Tuesday and you're going to look back at that vote and you'll get to say that's the single greatest vote I ever cast because that's when things started changing. That's when our country started to win again. We're going to win with our military. We're going to knock the hell out of ISIS. We're going to win -- we're going to win for our vets. We're going to take care of them. They're not taken care of as well as illegal immigrants right now. We're going to win for our vets and we're going to win with our vets. We're going to win on the border. We're going to win on trade. That's right, we are going to build the wall. The wall will be built and the wall will be paid for by Mexico. We're going to win with trade. We're going to go from the worst trade deals ever negotiated in the history of our world to great deals that bring back our factories and bring back our jobs. We're going to win with health care. Obamacare is gone. We're going to win with health care. We're going to get rid of Common Core and we're going to bring our education locally. We're going to save our Second Amendment, which is under siege. We're going to save our Second Amendment. And you're going to go in and you're going to vote and you're going to say, \"We started winning again.\" And I'm going to say, \"We win, win, win.\" And, you know, it's going to be interesting and I have fun with this. But we're going to start winning again. We're going to win so much. We're going to win with military. We're going to win with trade. We're going to win with borders. We're going to win with health care. We're going to win, win, win. You're going to get sick and tired of winning. You're going to say to me, \"Mr. President, please, please. We don't want to win so much. It's too much.\" And I'm going to say, \"No way. We're going to keep winning. We're going to make America great again.\" Thank you. Thank you. Get out and vote on Tuesday. I love you. We're going to bring it back. We're going to bring our country back. Thank you everybody. Thank you."}