{"id":407,"author":"Donald Trump","title":"Speech: Donald Trump in Hartford, CT","date":"2016-04-15","link":"https://factba.se/transcript/donald-trump-speech-hartford-ct-april-15-2016","paragraphs":["Amazing. Who loves Hartford Connecticut? Everybody, right? Everybody. Thank you, everybody. It's an honor to be here. That's some crowd. That's a lot of people. You got people pouring in from outside. That's great. It's great. Really an honor to be with so many. Wow, look at this, at this time and on this day.","I want to thank you. You know we have phenomenal poll numbers in Connecticut. We're going to bring back your economy, we're going to bring back jobs to Connecticut. We're going to bring them back. We're going to bring them back. It's sad what's happening. Our jobs are being sent to Mexico they're being sent all over the place.","Every place but our nation. And we're not going to let it happen anymore, folks. We're going to be the smart people from here on in. We're not going to let it happen anymore. Remember that. Just remember. You heard it here first. And you know with our competitors, the people I run against. I'm self funding I'm putting up my own money.","I'm doing this. When I come up here. I come on my dime. When these other guys come up, they come up a whole different route. Just so you understand. They're totally controlled by the special interests by the lobbyists. They're totally controlled by people that put up their money. No good. It's -- We've had it. We've now had it. This all began in June.","And I came down the escalator, I talked about illegal immigration. Nobody would even be talking about that now if I didn't bring it up. I talked about -- I talked about many things I talked about the wall, the wall. You better believe it. We're going to build the wall. We're going to build the wall and Mexico is going to pay for the wall.","OK. I will tell you that just like you're standing here 10,000 people, at least, just like you stand here, Mexico will pay for the wall. They understand it. You understand it. That's the way it's going to be. We're going to have strong borders, folks, and we're going to have the wall and we're going to stop drugs from pouring in. And by the way, and pouring in I know how -- I was just backstage and a reporter was telling me how heroin is poisoning our youth.","We're going to stop it from coming in. We're going to stop it. We can't let it go on like this. So I came down the escalator with Melania and they said, \"You know what, this is something I have to do. You know, running for president. Not easy not easy.\" Although I must say I'm enjoying it. We're having a good time together.","We're having a good, good time. And I talk -- Thank you. I love you too. Love this guy. Love this guy. I love this guy whoever he is. So I talked about trade. I talked about immigration. I talked about a lot of things but my focus was trade and illegal immigration and what's happened is it took off. And who would have thought this is happening now.","We're leading in the polls by a lot. Lying Ted Cruz has gone way down. Whoa. Whoa. He's gone down. You know Casey was in favor of NAFTA. He voted for NAFTA. NAFTA has killed Connecticut. It's killed Hartford. It's killed, frankly, big parts of our country. You can have people and you can't vote for people that voted in favor of NAFTA.","It's no good. It's no good. So -- So I started off with illegal immigration and trade. And let me tell you, let's talk trade because, Connecticut, more than anything else. Boy, do you need jobs, right? We need jobs. We need jobs and we're going to bring jobs back in. We're not going to be the dummies that lose all of our jobs now.","We're going to be the smart ones. Oh, do you have one over there. There's one of the dummies. There's one of the dummies. Alright, get him out of here. Get him out. Get him out. There is nothing more fun than a Trump rally, right?Nothing. Get him out. All right. Look. Do we love our country? Are we going to take our country back?","Are we not going to be the stupid people anymore? We are led by people that are grossly incompetent. They don't know what they are doing. Militarily we can't beat ISIS. We have people that have no clue. That's going to end, folks. It's going to end and it's going to end right after this election.","It's going to end. Let me tell you, when I came down -- when I came down, I said, You know what we have to do? Go ahead, USA, you better believe it. USA. So when I came down, and I've been doing this up in New York State, I was on Long Island yesterday, I was -- I'm all over. In fact, I just left upstate New York, it's being devastated by job loss.","And I looked and I said give me that -- I know Hartford very well, I've lived in Connecticut. I have so many friends in Connecticut, I love Connecticut. But I know, I know we have problems. We lost General Electric. How do you lose General Electric? I mean, It doesn't help you folks much. At -- At least we lost him to the United States as one of the few.","Right. To be honest. But that doesn't help you do much but you can't lose General Electric. You just can't. I don't know what happened. I will say this if I were governor, I wouldn't be losing General Electric, that I could do. That I could tell you. So since 2000 I said give me some stats on Hartford because I want to have accurate -- This is right out of the book.","Since 2000, the number of food stamp recipients in Hartford County Connecticut have increased by 54,000 people. It's an increase of 150%. We need jobs. We need jobs. It's not their fault. We need jobs. The economy of the state of Connecticut has experienced absolute devastation having to do with manufacturing, we know that.","And I didn't have to get a report to tell you that. OK. I could have told you that. According to the Bureau of Labor Statistics there were 307,000 people in Connecticut employed in manufacturing in 1990, 307,000. There are now 159,000. Another words it's been cut in half. We can't go that way, folks. We're going to go the other way.","If I'm elected president we're bringing our companies back and we're bringing our jobs back. There's been a cut. I mean this is terrible there's been a cut. Of 30% in Connecticut manufacturing jobs since only the year 2000. And by the way incidentally that happens to be the year that China entered the World Trade.","I mean, that's really when it came in and it entered world trade. And you know what, no good. Cruz, lying Ted Cruz. You know who that is? Cruz. He supports currency cheating by China because what they've done by devaluing their currency constantly, which they're not supposed to be doing, by devaluing it. What happens is it makes it impossible for our companies to compete with Chinese companies.","We're going to stop it. Cruz wants it to go on because somebody probably representing interests in China has said, \"This is what we want.\" because let me tell you, folks, I told you I'm self funding they're not sell funding. They're being funded by companies. They're being funded by countries and it's not in your best interest and they're going to go where the money is not where you are.","Remember that. Believe me. And you know, I've been on the other side of that equation for a long time. I've been a politician. Oh, do I hate saying it for nine months. But you have to say we're doing pretty well, right? Are we're doing pretty well? The labor force in Connecticut today is 10,000 people smaller than it was in 2011. Ten thousand, it's a lot of people.","We're heading in the wrong direction. I could go on and on. Tech firms in Connecticut, no good. Median household income. Way, way, way down. Folks, we need a change but not an Obama change. We need a real change. We don't need Hillary Clinton who's a disaster. We don't need Hillary Clinton. Hillary Clinton is a joke.","Hillary Clinton. Hillary Clinton knows nothing about trade. She knows nothing about business except getting business and money into her own account using what she's got to get it in. Remember when she said she was poor, she had no money. She had tens of millions of dollars. She's a liar, wouldn't you think, right.","I don't know if we can use the same term. We have a good term coming up. You only have one lying Ted. I don't think we can use the same term, failed. But look. Hillary Clinton is never ever, never ever going to beat jobs. She's not going to bring jobs back to this country. Wall Street owns Hillary Clinton.","Wall Street. Remember. On that I agree with Bernie Sanders, I agree, twice. I agree there. I'm no fan of Bernie Sanders. I agree with him on two things. Hillary. You know he feels she cannot do it. OK. But I agree with him on something very important. He feels that foreign trade our trade deals are a disaster, he's right.","He can't do anything about it because he doesn't have -- He doesn't understand. I mean basically he's a communist what the heck. We're going to have a communist? OK. We're going to have a communist? But, you know, it's very interesting, you know the system is rigged, folks. And the top Republicans called up, they said, \"Donald, please could you stop saying that.\" I said, \"But look, I'm telling the truth.\" I don't care.","I'm telling the truth. We're changing the system. And all of these bosses that pick delegates, you know first of all, I am leading by hundreds with delegates. I'm leading by millions with votes. By millions. Hillary Clinton got up yesterday she said I have more votes than Trump by a million or something.","I've been running he gets 17 people she's running against one. OK. And if I was running against four or five. I would have millions of more votes than Hillary Clinton. What's happening to the Republican Party is amazing because millions and millions of people are coming in that didn't come in four years ago for Romney, who by the way let us down.","He let us down he choked, I mean, let's face it. He choked. He was gagging. We're all -- we got a lot of athletes, I know some of my friends are in there and they're good athletes. You know the gag is he was gagging. He -- he couldn't get across the finish line. But we have millions of people right now. Millions more coming into the Republican Party.","It's up 70%. Interestingly, in terms of votes the Democrats are down 35% think of it. And the Republicans want to play cute with us. Right. If I don't make it you're going to have millions of people that don't vote for a Republican. They're not going to vote at all. Millions of people. Because they're tired of the Republicans, they're tired of the politicians all talk no action.","They've had it. They've totally had it. So you going to have millions of people that aren't going to vote. And hopefully that's all OK. Hopefully that's all but they're very, very angry and they're disenfranchised. And then we have a rigged system on top of it. But despite the rigging, I think we get there before the convention.","I think we do. So I built a great business and I filed my papers and the reporters these are the most dishonest human beings you'll ever meet, you'll ever meet. The most dishonest. The press the media. The media, the most dishonest. You know the one thing I do like about the protesters?","I call them agitators because most of them are paid to be out here. OK. We don't -- We don't have any in Hartford. That's really nice. But I will say this. What I do like is, you know, in fact sometimes I'm going to stage my own agitators. I'm gonna put them in different corners because the only time the cameras will show these massive crowds.","The only time is when there's trouble. Meaning, there's a little bit of a protester raises their hand and says something. These are really bad people. I want to tell you that they're not getting the story out. They don't tell the story. They don't tell the story. You know it's funny. I've had the biggest crowds.","They never say how big the crowds are. Last night or the night before I saw Bernie Sanders in New York. They said he had 27,000. Believe me that was not 27. When Trump has a crowd, they'll say, \"Ladies and gentlemen, we're here with Donald Trump. Ahuh, let's just \" They don't report what's going on. Now.","You know, look. Some are honest but they don't report the kind of crowds in the country. And this thing was set up a few days ago. They don't record, they don't report it. They don't report it for me. Now Bernie, always has big crowds. I have much bigger crowds than he does. They don't want to report it because they're dishonest.","They don't want to see what's going on. We have a movement going on. The likes of which nobody has ever seen in this country. People are fed up. They're disgusted. They're disgusted with Obamacare. They're disgusted with every single thing that's happening to us in our country. We don't win anymore we lose at every single facet.","Get them out of here. Out. Out. Get him out. Get him out. They just want to be on television for two seconds that's all. And I always say don't hurt that person, right? Don't hurt that person. So I'll tell you what. You know another thing. Trump rallies are among the safest places to be on Earth.","It's true. We don't hear them. Because the people in this room love each other and they protect each other. And that's what we have to do as a country. We have to protect each other. And that beats everything. Right now we're a divided country. We have to bring our country back and we have to be inclusive, that beats everybody.","We have to be inclusive but we have the safest places that you'll ever be. I mean, that you'll ever be. And I see it all the time. If one person -- if one person raises their hand, the next day headlines, \"Trump has a protester.\" We have great safety. And I'll tell you what, I love our loyal people because there's no people like our people.","So if you look at what's happening to us from an economic standpoint we have gross domestic product, which is practically zero. If China had practically zero, they'd have a revolution. China goes down to 7, 8, 9% and it's like a big deal and there's turmoil in the country. We're at practically zero, folks.","Meaning, we have nothing going. And when I come up to Hartford and why -- when I go up to New York State and I look at all of those empty buildings that used to houses jobs, workers, great companies and those companies have left for Mexico and other places. When I see the kind of business that China's taken out, China has had five -- Think of it. We have a trade deficit with China, $505 billion, OK, a deficit.","We have a deficit with Mexico of $58 billion. We have a massive deficit with Japan and Vietnam and every single country virtually that we do business with. We have incompetent people negotiating deals or we have crooked people because they're taken care of by their special interests. And we're not going to take it anymore, folks.","We're not going to take it. It's over. It is over. You know, Get him out. Get him out. Don't hurt him. See how nice I am? I'm saying don't hurt him. See what I say? I say get him out. Then I go -- then I go, Don't hurt him. Don't hurt him. Don't hurt him. Get him out. Not supposed to be here.","Not supposed to be here. All right. You know they really do impede your freedom of speech we have a first amendment right. They really impede freedom of speech. And it's a disgrace. It's really a disgrace. But the good news is, folks, it won't be long. We're just not taking it and it won't be long. All right.","It won't be long. You know, recently they said, \"What do you think of NATO? Now, I never studied NATO big but I said two things, it's obsolete and the United States is paying too much, too much. Yeah, get them out. Thank you. Get them out. Get them out. All right. You know the biggest problem with these protesters is us because as soon as the guy -- they raised their voice, they have no voice, they have nothing.","They've got nothing going. They're all putting you -- You notice the ties they're all beautifully manufactured and handed to them. And then they say, \"Why are you here?\" Last night I saw something in New York. \"Why are you here?\" The press was saying. And the person said, \"I don't know. I was told to be.\" Oh. \"But why are you protesting against Trump.\" He said, \"I think so. Yeah, I think so.\" This is such a con job being placed on the American public, folks.","It's a total and complete con job. So it's fine. But the worst is this somebody raises, they have no voice, they raise their voice a little. Put up their hand. We should just let them go. Don't keep pointing to them because we make much more noise than they do. I'll talk right over them. There's no problem.","There's no problem. We actually do. We end up making the noise was a loud areas there he is. In the meantime the poor person. They don't even know why they're there. They don't even know. They don't have a clue. So here's the story. We're going to bring jobs back to our country. We're going to have a strong border.","We're not going to let Carrier air conditioning move to Mexico, make air conditioning, fire 14,00 great people who really were there for years and years and years and did a great job. I'm a big buyer of Carrier products. I'm not going to buy them anymore. Not going to buy them. But we're not going to let Carrier move to Mexico and they move to Mexico.","Don't make any noise, folks. That's OK. Don't -- just nice and easy. Nice and easy. Nice and easy. Is this the greatest place on earth to be right here? Right. Greatest. It's OK. You get him out. You know when I first started this, this is true, some of you saw, I used to get angry at the protest I said, \"Get him out of here.","Get him out.\" And then the press would say, \"It was horrible the way that Mr. Trump behaved. He was so mean, he was so nasty.\" So the next day we had a protest. I said, \"Oh please, get him out. Please get him out.\" And you know what happened. They said, \"He's getting weaker.\" That was no good either. So anyway yeah get him out, get him out.","Look at those cameras the way they're all turned like pretzels. Look at those cameras. They're so dishonest. They are so dishonest get them out. Get them out. Go home to mommy. Go home. They don't even -- I'm telling you, most of them don't even know why they're here. They're told to be here.","And when these guys. They don't even show it. But when they show it they say we don't really know we're here. They don't even know. It's just, I actually feel sad bring back what? I won't say that. I won't say that. So folks, you're going to be voting very soon. Very soon. And you've got to promise me. You've got to promise me, you're going out, you're going to vote.","Thank you. Thank you. That's great. And I want you. I want you. We'll get you. We're going to get you. We're going to bring it back. We're going to bring it back. We're going to bring it back fast. You know, they used to say the words silent majority. Right. This is no longer a silent majority.","This is a massive noisy majority. We're in the cover of Time magazine all the time. Everybody's talking about us and we're not going to let go. So look. You have these politicians. Nobody knows politicians better than I do. Don't forget, I was establishment 12 months ago, right. I was establishment, I was a big donor, a big giver.","They loved me. You know they always love you when they take your money, right? But I was the establishment. Now, I'm probably about as anti-establishment as God ever created. All right. But I understand the game better than anybody, I understand the system. And the system is rigged in so many ways. The economy is rigged.","The banks are rigged. The whole deal is rigged, folks. And we're going to change it around. We're going to bring it back. And I'll tell you what. We're going to -- We're going to really look I'm leading in delegates by a lot. But you know what, that delegate system is a disaster the way they count. It's a disaster.","And not fair. Not good. And it's not good for democracy. It's not good for what we stand for. So we're going to win it anyway. We're going to have our 1,237 anyway. But I have to tell you, folks, it's a bad system and it's a dangerous system because people are angry as hell about what's going on. You know, they're angry about what's going on. So here's the story.","You are going to remember this evening. You're going to go home. To your wife to your boyfriend, to whoever you're going home to. Whoever it is, enjoy yourself. OK. And you're going to say, that was a great evening. And you're going to go very shortly, not this Tuesday but right after, you're going to go because New York is looking fantastically.","New York. New York is looking big, big league. Big, big poll numbers. And a poll just came out nationwide. Well, New York is -- is gone. It's gone. But we're lying Ted Cruz is like this I don't know what happened to him. Boom. Lying Ted, lying Ted. What a liar. Lying Ted. Do you ever see, he walks into a room with his Bible held high, held High.","It's lying Ted, folks. Puts down the Bible and then he lies. Remember what he did to Ben Carson? Ben Carson who endorsed me. Ben Carson and Chris Christie who endorsed me. But Ben Carson, during the election in Iowa during the ele -- not the day before the day, during the election, he spread the word that Ben Carson had left the race.","And he told everybody come vote for him. And then right after the election he apologized. And then he said, oh, he didn't know anything about it. He's lying Ted, bad. But he's going like this. He's dropping like a rock in the polls. And you know when he goes bad in the polls, do you ever watch when he goes bad in the polls.","He's like a basket case. Watch what happens. Watch how badly we beat him and we're going to have a lot of fun doing it, folks. OK. We're gonna have a lot of -- So here's the story. I love being with you. You know I've lived in this state and I know the state and I have the greatest friends. Some of my greatest friends are from the state.","Lot of great people up in Hartford. Here is, except the insurance companies charge me too much money which I hate. OK. But here's the story. Our country doesn't win anymore. We don't win with military. We don't win on the borders. We don't win with health care. We don't win with our second amendment, which by the way will be 100% protected by me. And you know what, we're going to start winning.","And when you cast your vote. In a short period of time you got to promise me. Raise your hands. Does everybody promise? We're going to vote. We're going to vote for Trump. And if you're not going to vote for Trump, don't bother go. Just don't go. We're going to vote for Trump because we're going to turn our nation around.","Here's what's going to happen. You're going to look back in two years and four years in 20 years. You're going to look at your family you can look at your friends and you're going to say. That was the greatest vote I've ever cast. That's when America became great again. That's when we started winning again.","That's when we won with our military. We're going to take out ISIS fast. That's when we started winning on trade. That's when we won with health care. That's when we ended Common Core and brought our education local. You're going to say that was the greatest vote you ever cast because that's when America became great again. I love you. Thank you all."],"text":" Amazing. Who loves Hartford Connecticut? Everybody, right? Everybody. Thank you, everybody. It's an honor to be here. That's some crowd. That's a lot of people. You got people pouring in from outside. That's great. It's great. Really an honor to be with so many. Wow, look at this, at this time and on this day. I want to thank you. You know we have phenomenal poll numbers in Connecticut. We're going to bring back your economy, we're going to bring back jobs to Connecticut. We're going to bring them back. We're going to bring them back. It's sad what's happening. Our jobs are being sent to Mexico they're being sent all over the place. Every place but our nation. And we're not going to let it happen anymore, folks. We're going to be the smart people from here on in. We're not going to let it happen anymore. Remember that. Just remember. You heard it here first. And you know with our competitors, the people I run against. I'm self funding I'm putting up my own money. I'm doing this. When I come up here. I come on my dime. When these other guys come up, they come up a whole different route. Just so you understand. They're totally controlled by the special interests by the lobbyists. They're totally controlled by people that put up their money. No good. It's -- We've had it. We've now had it. This all began in June. And I came down the escalator, I talked about illegal immigration. Nobody would even be talking about that now if I didn't bring it up. I talked about -- I talked about many things I talked about the wall, the wall. You better believe it. We're going to build the wall. We're going to build the wall and Mexico is going to pay for the wall. OK. I will tell you that just like you're standing here 10,000 people, at least, just like you stand here, Mexico will pay for the wall. They understand it. You understand it. That's the way it's going to be. We're going to have strong borders, folks, and we're going to have the wall and we're going to stop drugs from pouring in. And by the way, and pouring in I know how -- I was just backstage and a reporter was telling me how heroin is poisoning our youth. We're going to stop it from coming in. We're going to stop it. We can't let it go on like this. So I came down the escalator with Melania and they said, \"You know what, this is something I have to do. You know, running for president. Not easy not easy.\" Although I must say I'm enjoying it. We're having a good time together. We're having a good, good time. And I talk -- Thank you. I love you too. Love this guy. Love this guy. I love this guy whoever he is. So I talked about trade. I talked about immigration. I talked about a lot of things but my focus was trade and illegal immigration and what's happened is it took off. And who would have thought this is happening now. We're leading in the polls by a lot. Lying Ted Cruz has gone way down. Whoa. Whoa. He's gone down. You know Casey was in favor of NAFTA. He voted for NAFTA. NAFTA has killed Connecticut. It's killed Hartford. It's killed, frankly, big parts of our country. You can have people and you can't vote for people that voted in favor of NAFTA. It's no good. It's no good. So -- So I started off with illegal immigration and trade. And let me tell you, let's talk trade because, Connecticut, more than anything else. Boy, do you need jobs, right? We need jobs. We need jobs and we're going to bring jobs back in. We're not going to be the dummies that lose all of our jobs now. We're going to be the smart ones. Oh, do you have one over there. There's one of the dummies. There's one of the dummies. Alright, get him out of here. Get him out. Get him out. There is nothing more fun than a Trump rally, right?Nothing. Get him out. All right. Look. Do we love our country? Are we going to take our country back? Are we not going to be the stupid people anymore? We are led by people that are grossly incompetent. They don't know what they are doing. Militarily we can't beat ISIS. We have people that have no clue. That's going to end, folks. It's going to end and it's going to end right after this election. It's going to end. Let me tell you, when I came down -- when I came down, I said, You know what we have to do? Go ahead, USA, you better believe it. USA. So when I came down, and I've been doing this up in New York State, I was on Long Island yesterday, I was -- I'm all over. In fact, I just left upstate New York, it's being devastated by job loss. And I looked and I said give me that -- I know Hartford very well, I've lived in Connecticut. I have so many friends in Connecticut, I love Connecticut. But I know, I know we have problems. We lost General Electric. How do you lose General Electric? I mean, It doesn't help you folks much. At -- At least we lost him to the United States as one of the few. Right. To be honest. But that doesn't help you do much but you can't lose General Electric. You just can't. I don't know what happened. I will say this if I were governor, I wouldn't be losing General Electric, that I could do. That I could tell you. So since 2000 I said give me some stats on Hartford because I want to have accurate -- This is right out of the book. Since 2000, the number of food stamp recipients in Hartford County Connecticut have increased by 54,000 people. It's an increase of 150%. We need jobs. We need jobs. It's not their fault. We need jobs. The economy of the state of Connecticut has experienced absolute devastation having to do with manufacturing, we know that. And I didn't have to get a report to tell you that. OK. I could have told you that. According to the Bureau of Labor Statistics there were 307,000 people in Connecticut employed in manufacturing in 1990, 307,000. There are now 159,000. Another words it's been cut in half. We can't go that way, folks. We're going to go the other way. If I'm elected president we're bringing our companies back and we're bringing our jobs back. There's been a cut. I mean this is terrible there's been a cut. Of 30% in Connecticut manufacturing jobs since only the year 2000. And by the way incidentally that happens to be the year that China entered the World Trade. I mean, that's really when it came in and it entered world trade. And you know what, no good. Cruz, lying Ted Cruz. You know who that is? Cruz. He supports currency cheating by China because what they've done by devaluing their currency constantly, which they're not supposed to be doing, by devaluing it. What happens is it makes it impossible for our companies to compete with Chinese companies. We're going to stop it. Cruz wants it to go on because somebody probably representing interests in China has said, \"This is what we want.\" because let me tell you, folks, I told you I'm self funding they're not sell funding. They're being funded by companies. They're being funded by countries and it's not in your best interest and they're going to go where the money is not where you are. Remember that. Believe me. And you know, I've been on the other side of that equation for a long time. I've been a politician. Oh, do I hate saying it for nine months. But you have to say we're doing pretty well, right? Are we're doing pretty well? The labor force in Connecticut today is 10,000 people smaller than it was in 2011. Ten thousand, it's a lot of people. We're heading in the wrong direction. I could go on and on. Tech firms in Connecticut, no good. Median household income. Way, way, way down. Folks, we need a change but not an Obama change. We need a real change. We don't need Hillary Clinton who's a disaster. We don't need Hillary Clinton. Hillary Clinton is a joke. Hillary Clinton. Hillary Clinton knows nothing about trade. She knows nothing about business except getting business and money into her own account using what she's got to get it in. Remember when she said she was poor, she had no money. She had tens of millions of dollars. She's a liar, wouldn't you think, right. I don't know if we can use the same term. We have a good term coming up. You only have one lying Ted. I don't think we can use the same term, failed. But look. Hillary Clinton is never ever, never ever going to beat jobs. She's not going to bring jobs back to this country. Wall Street owns Hillary Clinton. Wall Street. Remember. On that I agree with Bernie Sanders, I agree, twice. I agree there. I'm no fan of Bernie Sanders. I agree with him on two things. Hillary. You know he feels she cannot do it. OK. But I agree with him on something very important. He feels that foreign trade our trade deals are a disaster, he's right. He can't do anything about it because he doesn't have -- He doesn't understand. I mean basically he's a communist what the heck. We're going to have a communist? OK. We're going to have a communist? But, you know, it's very interesting, you know the system is rigged, folks. And the top Republicans called up, they said, \"Donald, please could you stop saying that.\" I said, \"But look, I'm telling the truth.\" I don't care. I'm telling the truth. We're changing the system. And all of these bosses that pick delegates, you know first of all, I am leading by hundreds with delegates. I'm leading by millions with votes. By millions. Hillary Clinton got up yesterday she said I have more votes than Trump by a million or something. I've been running he gets 17 people she's running against one. OK. And if I was running against four or five. I would have millions of more votes than Hillary Clinton. What's happening to the Republican Party is amazing because millions and millions of people are coming in that didn't come in four years ago for Romney, who by the way let us down. He let us down he choked, I mean, let's face it. He choked. He was gagging. We're all -- we got a lot of athletes, I know some of my friends are in there and they're good athletes. You know the gag is he was gagging. He -- he couldn't get across the finish line. But we have millions of people right now. Millions more coming into the Republican Party. It's up 70%. Interestingly, in terms of votes the Democrats are down 35% think of it. And the Republicans want to play cute with us. Right. If I don't make it you're going to have millions of people that don't vote for a Republican. They're not going to vote at all. Millions of people. Because they're tired of the Republicans, they're tired of the politicians all talk no action. They've had it. They've totally had it. So you going to have millions of people that aren't going to vote. And hopefully that's all OK. Hopefully that's all but they're very, very angry and they're disenfranchised. And then we have a rigged system on top of it. But despite the rigging, I think we get there before the convention. I think we do. So I built a great business and I filed my papers and the reporters these are the most dishonest human beings you'll ever meet, you'll ever meet. The most dishonest. The press the media. The media, the most dishonest. You know the one thing I do like about the protesters? I call them agitators because most of them are paid to be out here. OK. We don't -- We don't have any in Hartford. That's really nice. But I will say this. What I do like is, you know, in fact sometimes I'm going to stage my own agitators. I'm gonna put them in different corners because the only time the cameras will show these massive crowds. The only time is when there's trouble. Meaning, there's a little bit of a protester raises their hand and says something. These are really bad people. I want to tell you that they're not getting the story out. They don't tell the story. They don't tell the story. You know it's funny. I've had the biggest crowds. They never say how big the crowds are. Last night or the night before I saw Bernie Sanders in New York. They said he had 27,000. Believe me that was not 27. When Trump has a crowd, they'll say, \"Ladies and gentlemen, we're here with Donald Trump. Ahuh, let's just \" They don't report what's going on. Now. You know, look. Some are honest but they don't report the kind of crowds in the country. And this thing was set up a few days ago. They don't record, they don't report it. They don't report it for me. Now Bernie, always has big crowds. I have much bigger crowds than he does. They don't want to report it because they're dishonest. They don't want to see what's going on. We have a movement going on. The likes of which nobody has ever seen in this country. People are fed up. They're disgusted. They're disgusted with Obamacare. They're disgusted with every single thing that's happening to us in our country. We don't win anymore we lose at every single facet. Get them out of here. Out. Out. Get him out. Get him out. They just want to be on television for two seconds that's all. And I always say don't hurt that person, right? Don't hurt that person. So I'll tell you what. You know another thing. Trump rallies are among the safest places to be on Earth. It's true. We don't hear them. Because the people in this room love each other and they protect each other. And that's what we have to do as a country. We have to protect each other. And that beats everything. Right now we're a divided country. We have to bring our country back and we have to be inclusive, that beats everybody. We have to be inclusive but we have the safest places that you'll ever be. I mean, that you'll ever be. And I see it all the time. If one person -- if one person raises their hand, the next day headlines, \"Trump has a protester.\" We have great safety. And I'll tell you what, I love our loyal people because there's no people like our people. So if you look at what's happening to us from an economic standpoint we have gross domestic product, which is practically zero. If China had practically zero, they'd have a revolution. China goes down to 7, 8, 9% and it's like a big deal and there's turmoil in the country. We're at practically zero, folks. Meaning, we have nothing going. And when I come up to Hartford and why -- when I go up to New York State and I look at all of those empty buildings that used to houses jobs, workers, great companies and those companies have left for Mexico and other places. When I see the kind of business that China's taken out, China has had five -- Think of it. We have a trade deficit with China, $505 billion, OK, a deficit. We have a deficit with Mexico of $58 billion. We have a massive deficit with Japan and Vietnam and every single country virtually that we do business with. We have incompetent people negotiating deals or we have crooked people because they're taken care of by their special interests. And we're not going to take it anymore, folks. We're not going to take it. It's over. It is over. You know, Get him out. Get him out. Don't hurt him. See how nice I am? I'm saying don't hurt him. See what I say? I say get him out. Then I go -- then I go, Don't hurt him. Don't hurt him. Don't hurt him. Get him out. Not supposed to be here. Not supposed to be here. All right. You know they really do impede your freedom of speech we have a first amendment right. They really impede freedom of speech. And it's a disgrace. It's really a disgrace. But the good news is, folks, it won't be long. We're just not taking it and it won't be long. All right. It won't be long. You know, recently they said, \"What do you think of NATO? Now, I never studied NATO big but I said two things, it's obsolete and the United States is paying too much, too much. Yeah, get them out. Thank you. Get them out. Get them out. All right. You know the biggest problem with these protesters is us because as soon as the guy -- they raised their voice, they have no voice, they have nothing. They've got nothing going. They're all putting you -- You notice the ties they're all beautifully manufactured and handed to them. And then they say, \"Why are you here?\" Last night I saw something in New York. \"Why are you here?\" The press was saying. And the person said, \"I don't know. I was told to be.\" Oh. \"But why are you protesting against Trump.\" He said, \"I think so. Yeah, I think so.\" This is such a con job being placed on the American public, folks. It's a total and complete con job. So it's fine. But the worst is this somebody raises, they have no voice, they raise their voice a little. Put up their hand. We should just let them go. Don't keep pointing to them because we make much more noise than they do. I'll talk right over them. There's no problem. There's no problem. We actually do. We end up making the noise was a loud areas there he is. In the meantime the poor person. They don't even know why they're there. They don't even know. They don't have a clue. So here's the story. We're going to bring jobs back to our country. We're going to have a strong border. We're not going to let Carrier air conditioning move to Mexico, make air conditioning, fire 14,00 great people who really were there for years and years and years and did a great job. I'm a big buyer of Carrier products. I'm not going to buy them anymore. Not going to buy them. But we're not going to let Carrier move to Mexico and they move to Mexico. Don't make any noise, folks. That's OK. Don't -- just nice and easy. Nice and easy. Nice and easy. Is this the greatest place on earth to be right here? Right. Greatest. It's OK. You get him out. You know when I first started this, this is true, some of you saw, I used to get angry at the protest I said, \"Get him out of here. Get him out.\" And then the press would say, \"It was horrible the way that Mr. Trump behaved. He was so mean, he was so nasty.\" So the next day we had a protest. I said, \"Oh please, get him out. Please get him out.\" And you know what happened. They said, \"He's getting weaker.\" That was no good either. So anyway yeah get him out, get him out. Look at those cameras the way they're all turned like pretzels. Look at those cameras. They're so dishonest. They are so dishonest get them out. Get them out. Go home to mommy. Go home. They don't even -- I'm telling you, most of them don't even know why they're here. They're told to be here. And when these guys. They don't even show it. But when they show it they say we don't really know we're here. They don't even know. It's just, I actually feel sad bring back what? I won't say that. I won't say that. So folks, you're going to be voting very soon. Very soon. And you've got to promise me. You've got to promise me, you're going out, you're going to vote. Thank you. Thank you. That's great. And I want you. I want you. We'll get you. We're going to get you. We're going to bring it back. We're going to bring it back. We're going to bring it back fast. You know, they used to say the words silent majority. Right. This is no longer a silent majority. This is a massive noisy majority. We're in the cover of Time magazine all the time. Everybody's talking about us and we're not going to let go. So look. You have these politicians. Nobody knows politicians better than I do. Don't forget, I was establishment 12 months ago, right. I was establishment, I was a big donor, a big giver. They loved me. You know they always love you when they take your money, right? But I was the establishment. Now, I'm probably about as anti-establishment as God ever created. All right. But I understand the game better than anybody, I understand the system. And the system is rigged in so many ways. The economy is rigged. The banks are rigged. The whole deal is rigged, folks. And we're going to change it around. We're going to bring it back. And I'll tell you what. We're going to -- We're going to really look I'm leading in delegates by a lot. But you know what, that delegate system is a disaster the way they count. It's a disaster. And not fair. Not good. And it's not good for democracy. It's not good for what we stand for. So we're going to win it anyway. We're going to have our 1,237 anyway. But I have to tell you, folks, it's a bad system and it's a dangerous system because people are angry as hell about what's going on. You know, they're angry about what's going on. So here's the story. You are going to remember this evening. You're going to go home. To your wife to your boyfriend, to whoever you're going home to. Whoever it is, enjoy yourself. OK. And you're going to say, that was a great evening. And you're going to go very shortly, not this Tuesday but right after, you're going to go because New York is looking fantastically. New York. New York is looking big, big league. Big, big poll numbers. And a poll just came out nationwide. Well, New York is -- is gone. It's gone. But we're lying Ted Cruz is like this I don't know what happened to him. Boom. Lying Ted, lying Ted. What a liar. Lying Ted. Do you ever see, he walks into a room with his Bible held high, held High. It's lying Ted, folks. Puts down the Bible and then he lies. Remember what he did to Ben Carson? Ben Carson who endorsed me. Ben Carson and Chris Christie who endorsed me. But Ben Carson, during the election in Iowa during the ele -- not the day before the day, during the election, he spread the word that Ben Carson had left the race. And he told everybody come vote for him. And then right after the election he apologized. And then he said, oh, he didn't know anything about it. He's lying Ted, bad. But he's going like this. He's dropping like a rock in the polls. And you know when he goes bad in the polls, do you ever watch when he goes bad in the polls. He's like a basket case. Watch what happens. Watch how badly we beat him and we're going to have a lot of fun doing it, folks. OK. We're gonna have a lot of -- So here's the story. I love being with you. You know I've lived in this state and I know the state and I have the greatest friends. Some of my greatest friends are from the state. Lot of great people up in Hartford. Here is, except the insurance companies charge me too much money which I hate. OK. But here's the story. Our country doesn't win anymore. We don't win with military. We don't win on the borders. We don't win with health care. We don't win with our second amendment, which by the way will be 100% protected by me. And you know what, we're going to start winning. And when you cast your vote. In a short period of time you got to promise me. Raise your hands. Does everybody promise? We're going to vote. We're going to vote for Trump. And if you're not going to vote for Trump, don't bother go. Just don't go. We're going to vote for Trump because we're going to turn our nation around. Here's what's going to happen. You're going to look back in two years and four years in 20 years. You're going to look at your family you can look at your friends and you're going to say. That was the greatest vote I've ever cast. That's when America became great again. That's when we started winning again. That's when we won with our military. We're going to take out ISIS fast. That's when we started winning on trade. That's when we won with health care. That's when we ended Common Core and brought our education local. You're going to say that was the greatest vote you ever cast because that's when America became great again. I love you. Thank you all."}