{"id":408,"author":"Donald Trump","title":"Speech: Donald Trump in Patchogue, NY","date":"2016-04-14","link":"https://factba.se/transcript/donald-trump-speech-patchogue-ny-april-14-2016","paragraphs":["Thank you very much, everybody. Wow, what a group. This place is packed. We are home. Oh, do I love Long Island. But we are finally home. Thank you, everybody. This is a real honor and I will tell you, I've been all over this country and our country's in trouble but we will make America great again. And it's going to go very quickly, very, very quickly.","I want to start off by thanking John and the committee and everybody. I know this is a record. I hear it's a big record like a record by a lot. And so this is your all time record. And we like that. Right? We're part of it. You know, in coming out today I wanted to do a little work and don't be depressed because what's going to happen is these numbers will turn around quickly.","OK. They're going to turn around quickly. But I asked a few questions about Suffolk and you know I've been here so much my life. I've been here all my life. And people are leaving but we're not going to let them leave anymore. And when I say people I'm talking about companies, we're not going to make it so easy to leave anymore.","We can't do that. But you know, I -- I asked them -- I asked him to do a little work and just a little bit. They want to talk about how we bring it back and we're going to bring it back. And it's going to go a lot faster than people understand. You know, I'm self funding my campaign so I don't have to listen to all of my donors and all of my people that give me money and they say, \"Here's money go get elected.","And after you're elected you better do what we tell you to do.\" It's not going to happen, OK. We know -- we know that whole deal. But few regions of the country have been hurt worse than Suffolk. You know that. OK. You know that. I don't even know why it's so beautiful out here. It's like one of the -- One of the really beautiful places.","But it's jobs, and they're moving into Mexico, they're moving all over. That second happened for long. According to the U.S. Bureau of Labor Statistics, Suffolk, Nassau a region of New York has lost more than half of its manufacturing jobs since 1990. That's not good, folks. I can't believe. I know some of the guys in this room.","They're so tough. Some of the tough guys I know. I can't believe you guys would allow that to happen. What the hell. Are you getting soft? They're getting soft on me. I don't believe this. Right? They know what I'm talking about. Also according to the bureau, the region has lost 30% of its manufacturing since just 2001. It's crazy.","And you know, really a big part of it, folks, is -- is the fact and it's such an important thing, the fact that the politicians aren't fighting for our country anymore. They don't fight for us. You know when you look at China, when you look at Japan, when you look at Mexico you look at Vietnam, you look at so many different countries all over the world.","They're devaluing their currency. They're so much smarter than our leaders. It's like a great football team in the NFL playing your high school team. I like that sound. I like that. But it's like your great team playing, you know, you just can't do it. We need our best people. I know the best people, we know the best negotiators in the world.","We have great people, we have the greatest business people in the world right here. Right here. We don't use them. We don't use them. We are going to start using them. Big league. And by the way. We don't want to ever forget. We're going to have strong borders. We're going to have a wall. The wall is going to be built.","You of course know who's paying for the wall, right, who's back. We're going to stop the drugs from pouring into our country and poisoning our youth. We're going to do so many things we're going to get rid of Obamacare, we're going to get rid of it fast. It's no good doesn't work. Your premiums are going up. You see it, 35, 45, 55% every year.","It's crazy. Now we're going to get rid of it. We're going to get great health care at a much smaller cost better at less money. Right? Always protect our Second Amendment. You know that, right? Right? So. You're looking at this and it's just one of those things. Now, with John and some of the people, you have some great people out here.","You have some great, great -- and you really do you have some really good politicians. They know what's going on. Wow. I'm not going to read this status. It's too negative. To hell with that. I mean, that was a bad one. I couldn't read it. I want you walking away happy today. You know we broke the record.","I want you walking away happy today. Wow. There's some bad things going on. So, we're going to be really smart and I'm going to talk about trade. You know, when I did this. Who knew -- Who knew this was going to happen with Trump, right? And I'm one of you. Who knew this was going to happen? But when I announced on June 16th, and I didn't know, my wife were coming down on the escalator, a couple of people have seen that picture.","And I said, \"Come on let's do it.\" They're doing the Iran deal it was so bad so pathetic. I looked at it. I looked at the way they negotiate and I said, \"These people don't know what they're doing.\" How about that deal? We give in $150 billion. We get nothing. The prisoners don't get released. They should have been released before we ever started negotiating.","It's an insult. That's right, no deal. It means you get up and you walk. You get up and you walk. And we never walk. So here's what we're going to do. We're going to end up. And you know when you see the manufacturing when you see the people build that wall. What's more important to you, the wall or the trade deals?","We'll talk about trade. Because I know this area, they want business coming back in. I see what's going on. I know what's going on. I come here. I have many friends from this place. I have to tell you and they're tough. These are tough. I have tough friends. But let me just tell you, we're going to bring it back.","We're going to bring it back fast. You know you probably read and you probably saw Ford building massive plants in Mexico. Ford Motor. You probably saw -- Think about it. I'm sure you saw that Carrier air conditioning fired 14,00 people, 14,000 people, and they moved to Mexico. What do we get out if we get nothing out of it whatsoever.","These are great people. I spoke to some of them. These are great people. They got -- they got knocked off like you've never seen. It's not happening. So here's what we're going to do. Carrier. Your companies, they could do -- you could do any country. You know, Nabisco, big plant. Big plant in Chicago. They're moving to Mexico.","Everyone. They're moving to Mexico. They're moving all over. They're moving everywhere but here. So here's what we're doing. Take Korea as an example. They'll be making air conditioners and we call them and we say good luck enjoy your new plant in Mexico have a lot of fun. But every single time you make an air conditioning unit you're going to a very strong border now no longer Swiss cheese.","We just got approved, by the way, endorsed by 15,500 border patrol agents, which is phenomenal. First time in their history that they've endorsed a presidential candidate. Just got endorsed by Sheriff Joe from Arizona. Do we love Sheriff Joe? So we tell Carrier. Here's the story, folks. I hope you're going to enjoy your plant.","But here's the story. Every time you make an AC unit it crosses the border, you're going to pay a 35% tax on that unit. Believe me. Believe me. Now the free traders, and I'm a free trader, but our people don't understand free trade. Our leaders have no clue. And to have free trade you need smart people. We don't have smart people at the top.","We don't have people that know. We don't have people. And I'll tell you the truth, you take a guy like lying Ted Cruz. Lying Ted, right? Lying Ted, you know, he talked about New York values. Did you see the debate? He talked about New York values... Right. Oh, I love -- Look at this woman. Woman for Trump.","Women for Trump. Thank you. Women for Trump. You better believe it. You better believe we're going to do great with the women for Trump. Thank you very much. It's very nice. So here's the story. So lying Ted Cruz talked about New York values at the debate. And he talked about it with anger and really hatred.","I mean he was trying to make a point against me. Boy, did that one hit him hard. That was not something. Because he's doing very well. In fact, very right now he's, I guess, No. 3 in the polls in New York and many of the other states and nobody even knows who No. 2 is. They don't know. Isn't it amazing the way some names just stick to people.","I know plenty of my friends in here right out there. They've got a lot of nicknames that we gave them too. They're a little better. I like them better than lying Ted, let me tell you. But you know lying Ted comes in with a Bible held high. You know that, right? It's held high. He puts the Bible down and then he starts lying all day long.","You know, that's what it is. So, anyway, so here's what's going to happen. We tell Carrier air conditioner, and we tell them, \" Folks, sorry, 35% tax. You move.\" That's what it's going to be. And you know what's going to happen. They're not moving. They're not moving. Now, our politicians don't have a clue, so they don't want to say that.","They don't bring it up. They don't discuss it. They talk about free trade. We have free trade with China. We have a $500 billion a year deficit with China. We're going to turn this country around, folks. We're going to make our country great again. We're going to make our country so great. All of those hats.","All of those beautiful red hats I see. We're going to make our country so great. And you know you have to remember. We love the country. There are a lot of people, they don't love our country so much. We have people that are in office that do not love our country so much, believe me. And I see it. They can't because they sell out all the time.","And you know, I have a friend, he's a smart guy said, \"How could a certain politician have made that deal?\" I didn't think he was that stupid. He's not stupid at all. He's doing it because his lobbyist is demanding that he do it. It's good for him, it's good for his lobbyist and it's bad for our country.","Those deals aren't going to be happening much anymore, folks, because nobody's giving me that money. Nobody, nobody, nobody. You know, and I tell this, I've turned down -- Beautiful. I'll tell you what. This -- Look at this this crowd. This crowd is never going to be beaten. Where's John? John, you're never going to beat this crowd.","I can tell you. Next year, three years, 10 years, you're not going to beat this crowd But when you look at it and you just see what they're doing, they're selling our country out. Now we had cases recently with this whole delegate situation in Colorado. They canceled the vote and they appoint people and there it's just not the right thing to do, folks.","And they're having big marches tomorrow all over the place, all over Denver, all over the state. You'll see what happens because we've taken the vote away from great people. We've disenfranchised people. People haven't had a real wage increase in 18 years in this country. And we're going to stop it. We're going to bring it back.","And here's what's really important, on Tuesday you've got to get out and vote. Got to get out. We have -- and you know it's in Time magazine like four times in the last number of months. Can you believe? All my life I've wanted to be on Time a lot. And I was twice in years. Many, many, many years. Now it's four times in the last number of months.","You know why? Because of what we've done. It's a movement. It's a movement to take back our country. It's a movement to be smart. It's a movement to bring up our military to rebuild our military. Bigger better and stronger than ever, ever, ever before. You know our our military is being depleted badly. You just look, I mean, you see what's happening.","And the problem is -- and by the way, speaking of our military, our veterans we're going to take care of our veterans. I don't know if we have veterans here. We're going to take care of our veterans. But the greatest thing we can do when you look at what's going on in the world, when you look at the hatred for this country, when you look at the fact that we have a president that doesn't want to use the term radical Islamic terrorism, he doesn't want to use it. He won't use it. And if you can't talk about it, you're never going to solve the problem.","We're going to solve the problem fast, folks. We're going to solve the problem very, very, very fast so. So, so, oh, we're going to build the wall. Who's going to -- who's going to pay for that wall? A hundred percent, a hundred percent. You know, these politicians, we had 17 of them. It was 17 people. And here I am. You watch what happens.","But here we are. So they'd come up to me after and I'd say, \"Mexico is going to pay for the wall.\" And they'd say, \"Donald, you can't build a wall.\" Of course you can. You know, China built a wall 2,000 years ago that's many times bigger 13,000 miles. We need a thousand miles and we can't do it. And we have brand new Caterpillar tractors that other people aren't buying like we're going to buy.","So here's a story we're going to build a wall. Mexico's going to pay for the wall and then they say, \"How are you going to get Mexico to pay for the wall?\" The politicians come up to me. You can't get Mexico -- I say, \"What do you mean?\" We lose and trade deficit every year, $58 billion a year with Mexico not going to happen anymore.","Not only -- And I have great relationships with Mexico with the Hispanic people. I just won Nevada. The state of Nevada, a big Hispanic population. I was No. 1 in the polls with Hispanics. And I'm not angry. Listen. Let me just tell you. I'm not angry at China. I'm not angry at Japan for ripping us off. You want to talk about an imbalance.","They give us the cars, we give them wheat, we give them nothing. I'm not angry at these countries. I'm angry at our politicians for being so stupid. So stupid to let it happen. So stupid. So when they talk about free trade, China doesn't have free trade. China taxes our product going in. We let them send it. They tax our product going in. So $500 billion dollars a year with China.","We lose. So here's the story, folks. Just to sum up. So important that on Tuesday you vote and I think you know John is predicting this is going to be my single biggest margin, Suffolk, this whole area. He'd better be right. He'd better be right. Because if I told you what I gave up to be with my friend,s I got too many friends in this place.","But I want to tell you. We don't win anymore, we lose. We lose at everything. We don't win with our military. We don't win with our vets, we don't take care of our veterans properly. We don't win with health care. We don't win with education. We're going to end Common Core and we're going to bring it local.","We don't win with the Second Amendment. It's being dissipated it's being chopped. And we're going to stop that. We're going to protect our Second Amendment. If we had some guns on the other side in California, where the 14 people were killed, if we had bullets going in the opposite direction would have been a lot better situation folks, that I could tell you.","We don't win at our borders. We're going to have that strong border and we're going to just -- I'll tell you what, folks, you know me, you know me better than anybody. And you know one of the reasons I'm so honored when I see these polls that are so good is because the people that are voting and the people that are in the polls, now we've got to show it on Tuesday because polls don't mean much of you don't get out and vote.","But -- I love you too. He doesn't sound like my kind of guy but I love him. But the people that know me best are these people. The people that know me best are from here and from New York State. From all over. This -- So I'm on it. But let me just tell you, we're going to start winning again. We're going to win on trade.","We're going to win with the military, we're gonna knock the hell out of ISIS. We're going to win for our vets. We're going to win with education. We're going to win with so many things every single day. We're going to win on the borders. We are going to start winning again. In fact, we're going to win so much that you people might get sick of winning.","Does anybody get sick of winning? You're going to say, \"I don't like this president we win too much.\" But I don't think we have too many of those people in the room. Folks, folks we're going to start winning again. You're going to be so proud of your president. But more importantly you're going to be so proud of your country again.","So get out and vote and I can promise you. We will make America great again. Thank you. I love you. Thank you. Thank you, everybody. Thank you."],"text":" Thank you very much, everybody. Wow, what a group. This place is packed. We are home. Oh, do I love Long Island. But we are finally home. Thank you, everybody. This is a real honor and I will tell you, I've been all over this country and our country's in trouble but we will make America great again. And it's going to go very quickly, very, very quickly. I want to start off by thanking John and the committee and everybody. I know this is a record. I hear it's a big record like a record by a lot. And so this is your all time record. And we like that. Right? We're part of it. You know, in coming out today I wanted to do a little work and don't be depressed because what's going to happen is these numbers will turn around quickly. OK. They're going to turn around quickly. But I asked a few questions about Suffolk and you know I've been here so much my life. I've been here all my life. And people are leaving but we're not going to let them leave anymore. And when I say people I'm talking about companies, we're not going to make it so easy to leave anymore. We can't do that. But you know, I -- I asked them -- I asked him to do a little work and just a little bit. They want to talk about how we bring it back and we're going to bring it back. And it's going to go a lot faster than people understand. You know, I'm self funding my campaign so I don't have to listen to all of my donors and all of my people that give me money and they say, \"Here's money go get elected. And after you're elected you better do what we tell you to do.\" It's not going to happen, OK. We know -- we know that whole deal. But few regions of the country have been hurt worse than Suffolk. You know that. OK. You know that. I don't even know why it's so beautiful out here. It's like one of the -- One of the really beautiful places. But it's jobs, and they're moving into Mexico, they're moving all over. That second happened for long. According to the U.S. Bureau of Labor Statistics, Suffolk, Nassau a region of New York has lost more than half of its manufacturing jobs since 1990. That's not good, folks. I can't believe. I know some of the guys in this room. They're so tough. Some of the tough guys I know. I can't believe you guys would allow that to happen. What the hell. Are you getting soft? They're getting soft on me. I don't believe this. Right? They know what I'm talking about. Also according to the bureau, the region has lost 30% of its manufacturing since just 2001. It's crazy. And you know, really a big part of it, folks, is -- is the fact and it's such an important thing, the fact that the politicians aren't fighting for our country anymore. They don't fight for us. You know when you look at China, when you look at Japan, when you look at Mexico you look at Vietnam, you look at so many different countries all over the world. They're devaluing their currency. They're so much smarter than our leaders. It's like a great football team in the NFL playing your high school team. I like that sound. I like that. But it's like your great team playing, you know, you just can't do it. We need our best people. I know the best people, we know the best negotiators in the world. We have great people, we have the greatest business people in the world right here. Right here. We don't use them. We don't use them. We are going to start using them. Big league. And by the way. We don't want to ever forget. We're going to have strong borders. We're going to have a wall. The wall is going to be built. You of course know who's paying for the wall, right, who's back. We're going to stop the drugs from pouring into our country and poisoning our youth. We're going to do so many things we're going to get rid of Obamacare, we're going to get rid of it fast. It's no good doesn't work. Your premiums are going up. You see it, 35, 45, 55% every year. It's crazy. Now we're going to get rid of it. We're going to get great health care at a much smaller cost better at less money. Right? Always protect our Second Amendment. You know that, right? Right? So. You're looking at this and it's just one of those things. Now, with John and some of the people, you have some great people out here. You have some great, great -- and you really do you have some really good politicians. They know what's going on. Wow. I'm not going to read this status. It's too negative. To hell with that. I mean, that was a bad one. I couldn't read it. I want you walking away happy today. You know we broke the record. I want you walking away happy today. Wow. There's some bad things going on. So, we're going to be really smart and I'm going to talk about trade. You know, when I did this. Who knew -- Who knew this was going to happen with Trump, right? And I'm one of you. Who knew this was going to happen? But when I announced on June 16th, and I didn't know, my wife were coming down on the escalator, a couple of people have seen that picture. And I said, \"Come on let's do it.\" They're doing the Iran deal it was so bad so pathetic. I looked at it. I looked at the way they negotiate and I said, \"These people don't know what they're doing.\" How about that deal? We give in $150 billion. We get nothing. The prisoners don't get released. They should have been released before we ever started negotiating. It's an insult. That's right, no deal. It means you get up and you walk. You get up and you walk. And we never walk. So here's what we're going to do. We're going to end up. And you know when you see the manufacturing when you see the people build that wall. What's more important to you, the wall or the trade deals? We'll talk about trade. Because I know this area, they want business coming back in. I see what's going on. I know what's going on. I come here. I have many friends from this place. I have to tell you and they're tough. These are tough. I have tough friends. But let me just tell you, we're going to bring it back. We're going to bring it back fast. You know you probably read and you probably saw Ford building massive plants in Mexico. Ford Motor. You probably saw -- Think about it. I'm sure you saw that Carrier air conditioning fired 14,00 people, 14,000 people, and they moved to Mexico. What do we get out if we get nothing out of it whatsoever. These are great people. I spoke to some of them. These are great people. They got -- they got knocked off like you've never seen. It's not happening. So here's what we're going to do. Carrier. Your companies, they could do -- you could do any country. You know, Nabisco, big plant. Big plant in Chicago. They're moving to Mexico. Everyone. They're moving to Mexico. They're moving all over. They're moving everywhere but here. So here's what we're doing. Take Korea as an example. They'll be making air conditioners and we call them and we say good luck enjoy your new plant in Mexico have a lot of fun. But every single time you make an air conditioning unit you're going to a very strong border now no longer Swiss cheese. We just got approved, by the way, endorsed by 15,500 border patrol agents, which is phenomenal. First time in their history that they've endorsed a presidential candidate. Just got endorsed by Sheriff Joe from Arizona. Do we love Sheriff Joe? So we tell Carrier. Here's the story, folks. I hope you're going to enjoy your plant. But here's the story. Every time you make an AC unit it crosses the border, you're going to pay a 35% tax on that unit. Believe me. Believe me. Now the free traders, and I'm a free trader, but our people don't understand free trade. Our leaders have no clue. And to have free trade you need smart people. We don't have smart people at the top. We don't have people that know. We don't have people. And I'll tell you the truth, you take a guy like lying Ted Cruz. Lying Ted, right? Lying Ted, you know, he talked about New York values. Did you see the debate? He talked about New York values... Right. Oh, I love -- Look at this woman. Woman for Trump. Women for Trump. Thank you. Women for Trump. You better believe it. You better believe we're going to do great with the women for Trump. Thank you very much. It's very nice. So here's the story. So lying Ted Cruz talked about New York values at the debate. And he talked about it with anger and really hatred. I mean he was trying to make a point against me. Boy, did that one hit him hard. That was not something. Because he's doing very well. In fact, very right now he's, I guess, No. 3 in the polls in New York and many of the other states and nobody even knows who No. 2 is. They don't know. Isn't it amazing the way some names just stick to people. I know plenty of my friends in here right out there. They've got a lot of nicknames that we gave them too. They're a little better. I like them better than lying Ted, let me tell you. But you know lying Ted comes in with a Bible held high. You know that, right? It's held high. He puts the Bible down and then he starts lying all day long. You know, that's what it is. So, anyway, so here's what's going to happen. We tell Carrier air conditioner, and we tell them, \" Folks, sorry, 35% tax. You move.\" That's what it's going to be. And you know what's going to happen. They're not moving. They're not moving. Now, our politicians don't have a clue, so they don't want to say that. They don't bring it up. They don't discuss it. They talk about free trade. We have free trade with China. We have a $500 billion a year deficit with China. We're going to turn this country around, folks. We're going to make our country great again. We're going to make our country so great. All of those hats. All of those beautiful red hats I see. We're going to make our country so great. And you know you have to remember. We love the country. There are a lot of people, they don't love our country so much. We have people that are in office that do not love our country so much, believe me. And I see it. They can't because they sell out all the time. And you know, I have a friend, he's a smart guy said, \"How could a certain politician have made that deal?\" I didn't think he was that stupid. He's not stupid at all. He's doing it because his lobbyist is demanding that he do it. It's good for him, it's good for his lobbyist and it's bad for our country. Those deals aren't going to be happening much anymore, folks, because nobody's giving me that money. Nobody, nobody, nobody. You know, and I tell this, I've turned down -- Beautiful. I'll tell you what. This -- Look at this this crowd. This crowd is never going to be beaten. Where's John? John, you're never going to beat this crowd. I can tell you. Next year, three years, 10 years, you're not going to beat this crowd But when you look at it and you just see what they're doing, they're selling our country out. Now we had cases recently with this whole delegate situation in Colorado. They canceled the vote and they appoint people and there it's just not the right thing to do, folks. And they're having big marches tomorrow all over the place, all over Denver, all over the state. You'll see what happens because we've taken the vote away from great people. We've disenfranchised people. People haven't had a real wage increase in 18 years in this country. And we're going to stop it. We're going to bring it back. And here's what's really important, on Tuesday you've got to get out and vote. Got to get out. We have -- and you know it's in Time magazine like four times in the last number of months. Can you believe? All my life I've wanted to be on Time a lot. And I was twice in years. Many, many, many years. Now it's four times in the last number of months. You know why? Because of what we've done. It's a movement. It's a movement to take back our country. It's a movement to be smart. It's a movement to bring up our military to rebuild our military. Bigger better and stronger than ever, ever, ever before. You know our our military is being depleted badly. You just look, I mean, you see what's happening. And the problem is -- and by the way, speaking of our military, our veterans we're going to take care of our veterans. I don't know if we have veterans here. We're going to take care of our veterans. But the greatest thing we can do when you look at what's going on in the world, when you look at the hatred for this country, when you look at the fact that we have a president that doesn't want to use the term radical Islamic terrorism, he doesn't want to use it. He won't use it. And if you can't talk about it, you're never going to solve the problem. We're going to solve the problem fast, folks. We're going to solve the problem very, very, very fast so. So, so, oh, we're going to build the wall. Who's going to -- who's going to pay for that wall? A hundred percent, a hundred percent. You know, these politicians, we had 17 of them. It was 17 people. And here I am. You watch what happens. But here we are. So they'd come up to me after and I'd say, \"Mexico is going to pay for the wall.\" And they'd say, \"Donald, you can't build a wall.\" Of course you can. You know, China built a wall 2,000 years ago that's many times bigger 13,000 miles. We need a thousand miles and we can't do it. And we have brand new Caterpillar tractors that other people aren't buying like we're going to buy. So here's a story we're going to build a wall. Mexico's going to pay for the wall and then they say, \"How are you going to get Mexico to pay for the wall?\" The politicians come up to me. You can't get Mexico -- I say, \"What do you mean?\" We lose and trade deficit every year, $58 billion a year with Mexico not going to happen anymore. Not only -- And I have great relationships with Mexico with the Hispanic people. I just won Nevada. The state of Nevada, a big Hispanic population. I was No. 1 in the polls with Hispanics. And I'm not angry. Listen. Let me just tell you. I'm not angry at China. I'm not angry at Japan for ripping us off. You want to talk about an imbalance. They give us the cars, we give them wheat, we give them nothing. I'm not angry at these countries. I'm angry at our politicians for being so stupid. So stupid to let it happen. So stupid. So when they talk about free trade, China doesn't have free trade. China taxes our product going in. We let them send it. They tax our product going in. So $500 billion dollars a year with China. We lose. So here's the story, folks. Just to sum up. So important that on Tuesday you vote and I think you know John is predicting this is going to be my single biggest margin, Suffolk, this whole area. He'd better be right. He'd better be right. Because if I told you what I gave up to be with my friend,s I got too many friends in this place. But I want to tell you. We don't win anymore, we lose. We lose at everything. We don't win with our military. We don't win with our vets, we don't take care of our veterans properly. We don't win with health care. We don't win with education. We're going to end Common Core and we're going to bring it local. We don't win with the Second Amendment. It's being dissipated it's being chopped. And we're going to stop that. We're going to protect our Second Amendment. If we had some guns on the other side in California, where the 14 people were killed, if we had bullets going in the opposite direction would have been a lot better situation folks, that I could tell you. We don't win at our borders. We're going to have that strong border and we're going to just -- I'll tell you what, folks, you know me, you know me better than anybody. And you know one of the reasons I'm so honored when I see these polls that are so good is because the people that are voting and the people that are in the polls, now we've got to show it on Tuesday because polls don't mean much of you don't get out and vote. But -- I love you too. He doesn't sound like my kind of guy but I love him. But the people that know me best are these people. The people that know me best are from here and from New York State. From all over. This -- So I'm on it. But let me just tell you, we're going to start winning again. We're going to win on trade. We're going to win with the military, we're gonna knock the hell out of ISIS. We're going to win for our vets. We're going to win with education. We're going to win with so many things every single day. We're going to win on the borders. We are going to start winning again. In fact, we're going to win so much that you people might get sick of winning. Does anybody get sick of winning? You're going to say, \"I don't like this president we win too much.\" But I don't think we have too many of those people in the room. Folks, folks we're going to start winning again. You're going to be so proud of your president. But more importantly you're going to be so proud of your country again. So get out and vote and I can promise you. We will make America great again. Thank you. I love you. Thank you. Thank you, everybody. Thank you."}