{"id":409,"author":"Donald Trump","title":"Speech: Donald Trump in New York, NY","date":"2016-04-14","link":"https://factba.se/transcript/donald-trump-speech-new-york-ny-april-14-2016","paragraphs":["Drop dead, right drop dead, that was a drop dead, right drop dead. That was a drop dead, right drop dead. That was a killer. That was it not a good time for killer that was it not a good time for killer. That was it not a good time for our city right now. It was a bad time for our city right now. It was a bad time for our city right now.","It was a bad time for our city, but it was something that was our city, but it was something that was our city. But it was something that was - we had to do something because we love - we had to do something because we love - we had to do something because we love New York, we love New York and that was New York.","We love New York and that was New York. We love New York and that was probably maybe the worst of the worst, probably maybe the worst of the worst, probably maybe the worst of the worst. And - but I just wanted to do it, I loved and - but I just wanted to do it, I loved and - but I just wanted to do it.","I loved the building. I loved the potential of the building. I loved the potential of the building. I loved the potential of the building. It's called the Commodore, the building, it's called the Commodore, the building, it's called the Commodore hotel. It was built in 1909 and it was a hotel. It was built in 1909 and it was a hotel.","It was built in 1909. And it was a mess and they had a spa and the spa was mess and they had a spa and the spa was mess and they had a spa and the spa was called relaxation Plus and nobody ever called relaxation Plus and nobody ever called relaxation Plus. And nobody ever got into what the Plus meant. You don't got into what the Plus meant.","You don't got into what the Plus meant. You don't want to know and everybody in the want to know and everybody in the want to know and everybody in the building was failing. Every retail tenant building was failing. Every retail tenant building was failing. Every retail tenant in the building was failing and I was in the building was failing and I was in the building was failing and I was able to get most of them out, but able to get most of them out, but able to get most of them Out but relaxation Plus was making an absolute relaxation Plus was making an absolute relaxation Plus was making an absolute fortune and I couldn't get him out and I fortune and I couldn't get him out and I fortune and I couldn't get him out.","And I asked about all sorts of things I asked about all sorts of things I asked about all sorts of things. I shouldn't say this too loud because I shouldn't say this too loud because I shouldn't say this too loud because I will be really ridiculed by the - will be really ridiculed by the will be really ridiculed by the Conservatives of which I am one I even Conservatives Of which I am one I even Conservatives of which I am one I even said what about condemnation, but I said what about condemnation, but I said what about condemnation, but I didn't do that.","Okay. Is everybody happy? I didn't do that. Okay. Is everybody happy? I didn't do that, okay. Is everybody happy? I didn't do that, but I ended up getting - didn't do that, but I ended up getting - didn't do that. But I ended up getting them out and brought the building down them out and brought the building down them out.","And brought the building down to its steel except for some of the - to its steel except for some of the - to its steel, except for some of the details on a couple of the ceilings details on a couple of the ceilings details on a couple of the Ceilings, because they would have been very hard because they would have been very hard because they would have been very hard.","This is one of the rooms actually, right. This is one of the rooms actually, right. This is one of the rooms actually right here. The detail of the ballroom and the here, the detail of the ballroom and the here, the detail of the ballroom and the details of the rooms outside and trying details of the rooms outside and trying details of the rooms outside and trying to save those details cost A fortune to save those details cost a fortune to save those details cost a fortune because when the whole bill was because when the whole bill was because when the whole bill was essentially brought down to the steel, we essentially brought down to the steel.","We essentially brought down to the steel we had to put canvas over all of the areas, had to put canvas over all of the areas, had to put canvas over all of the areas we were saving and when it rained that we were saving. And when it rained that we were saving and when it rained, that was not an easy situation.","But I got - it was not an easy situation, but I got - it was not an easy situation, but I got it built. And what happened is as we were built and what happened is as we were built and what happened is as we were opening the market changed because the opening - the market changed because the opening the market changed because the city was doing so badly.","And that was the city was doing so badly and that was the city was doing so badly and that was the worst that the city had ever been worst that the city had ever been worst that the city had ever been economically. Also people leaving economically. Also people leaving economically, also people leaving companies were leaving in droves and it companies were leaving in droves and it companies were leaving in droves and it was just something of a miracle.","The area was just something of a miracle. The area was just something of a miracle. The area I opened the building to tremendous. I opened the building to tremendous. I opened the building to tremendous fanfare and the area became just special fanfare and the area became just special fanfare and the area became just special.","That means special and I called it a that means special and I called it a that means special and I called it a Park Avenue address even though it Park Avenue address, even though it Park Avenue address, even though it really fronted on 42nd Street. I called, really fronted on 42nd Street, I called, really fronted on 42nd Street, I called it Park Avenue.","You know it's in the park it Park Avenue, you know it's in the park, it Park Avenue, you know it's in the park, you have a new ramp and you have a new ramp and you have a new ramp and fairness right, might not be pure park. I fairness right might not be pure park, I fairness right might not be pure park.","I had a choice of Lexington Avenue. 42nd had a choice of Lexington Avenue, 42nd had a choice of Lexington Avenue, 42nd Street or Park Avenue and guess what I Street or Park Avenue and guess what I Street or Park Avenue and guess what I chose Park Avenue. And that wasn't bad chose Park Avenue. And that wasn't bad chose Park Avenue and that wasn't bad, right.","Well, I had that also in Columbus, right? Well, I had that also in Columbus, right? Well, I had that also in Columbus Circle, you know I did the big hotel Circle. You know, I did the big hotel Circle, you know I did the big hotel Trump International and it's been a Trump International and it's been a Trump International and it's been a great success from the dead was built great success from the dead was built great success From the dead was built and were in the circle and Columbus and were in the circle and Columbus and were in the circle and Columbus Circle didn't have a good name, but it Circle didn't have a good name, but it Circle didn't have a good name.","But it also was on Central Park West, but it was also was on Central Park West, but it was also was on Central Park West, but it was called 7 Columbus Circle and a little called 7 Columbus Circle and a little called 7 Columbus Circle. And a little known fact and in fact you know when we known fact and in fact you know when we known fact and in fact you know, when we talk about government, we talk about talk about government, we talk about talk about government, we talk about rules And regulations, a little known rules and regulations, a little known rules and regulations, a little known fact is that when you have an address at fact is that when you have an address at fact is that when you have an address at least in New York, when You have an least in New York when you have an least in New York when you have an address in a building, it's very, very address in a building.","It's very, very address in a building. It's very, very hard. So hard to change. So when you have hard so hard to change, so when you have hard so hard to change. So when you have a building that 7 Columbus Circle you a building that 7 Columbus Circle you a building, that 7 Columbus Circle, you have to go through the whole United have to go through the whole United have to go through the whole United States government to Get because of the States government to get because of the States government to get because of the mail service and because of the u.s.","mail service and because of the u.s. mail service and because of the u.s. mail and all of the different problems mail and all Of the different problems mail and all of the different problems, so with 7 Columbus and I basically - so with 7 Columbus and I basically - so with 7 Columbus and I basically script that one down script that one down script that one down, we built a tremendous building.","But I had - we built a tremendous building, but I had - we built a tremendous building, but I had a call at 7, sir. I said I'm not doing it a call at 7, sir. I said I'm not doing it a call at 7, sir. I said I'm not doing it and I went out and I really put on a big and I went out and I really put on a big and I went out and I really put on a big campaign in Washington and I got a campaign in Washington And I got a campaign in Washington and I got a change to number one Central Park West change to number one Central Park West, change to number one Central Park West that was good too.","That was good too. That was good too. And you know, I figured the day I got and you know I figured the day I got and you know I figured the day I got that change. The building was worth about that change. The building was worth about that change. The building was worth about seven times more than I paid for it seven times more than I paid for it seven times more than I paid for it, right.","So anyway, but this has been a just right. So anyway, but this has been a just right. So anyway, but this has been a just an amazing - an amazing event in this, an amazing - an amazing event in this, an amazing - an amazing event in this building. And I think of it because when building and I think of it because when building and I think of it because when I did the building, everybody said don't I did the building.","Everybody said don't I did the building. Everybody said don't do it. It can't be done, it's never gonna do it, it can't be done. It's never gonna do it. It can't be done. It's never gonna happen. Bad area, bad location, tremendous happen, bad area, bad location, tremendous happen, bad area, bad location, tremendous crime.","The city's dying and the city was crime, the city's dying and the city was crime, the city's dying and the city was dying. It wasn't just like not doing well dying. It wasn't just like not doing well dying. It wasn't just like not doing well. The city was dead and I remember one I - the city was dead and I remember one I - the city was dead.","And I remember one I said to a friend of mine who was in a said to a friend of mine who was in a said to a friend of mine who was in a different business, a very good business, different business, a very good business, different business. A very good business and he was talking about what I did and he was talking about what I did and he was talking about what I did became a friend.","I said well, I'm in the - became a friend. I said well, I'm in the - became a friend. I said, well, I'm in the real estate business in New York and real estate business in New York and real estate business in New York and they looked at me and said, oh, that's too - they looked at me and said, oh, that's too - they looked at me And said, oh, that's too bad, bad, bad, that's how bad it was, but it turned out that's how bad it was.","But it turned out that's how bad it was. But it turned out to be a great business number one and it to be a great business number one and it to be a great business number one. And it turned out to be a great, great success, turned out to be a great, great success, turned out to be a great, great success as a hotel and it was built and Hyatt as a hotel and it was built and Hyatt as a hotel.","And it was built and Hyatt was my partner and we - we did a good job, was my partner. And we - we did a good job, was my partner. And we - we did a good job and it was from - from the time it opened and it was from - from the time it opened and it was from - from the time it opened, it was amazing because from the day it, it was amazing because from the day It - it was amazing because from the day it opened, the market changed, opened, the market changed, opened the market changed and that's happened with a number of - and that's happened with a number of - and that's happened with a number of jobs that happened with me with 40 Wall jobs that happened with me with 40 Wall jobs that happened with me with 40 Wall Street.","I bought a building the tallest Street, I bought a building, the tallest Street I bought a building, the tallest building in downtown Manhattan, voted building in downtown Manhattan, voted building in downtown Manhattan, voted during the Depression, literally the - during the Depression, literally the - during the Depression.","Literally the depression of the early 90s and paid depression of the early 90s and paid depression of the early 90s and paid very little for it. Again, nobody wanted very little for it. Again, nobody wanted very little for it. Again nobody wanted it. And then when I opened, it was like it and then when I opened it was like it.","And then when I opened, it was like the world had changed and it became a - the world had changed and it became a - the world had changed and it became a tremendously successful building, which I tremendously successful building, which I tremendously successful building, which I still have. So a lot of things happen, but still have - so a lot of things happen, but still have.","So a lot of things happen. But with this one in particular, because when - with this one in particular, because when - with this one in particular, because when I did it, it was - people just didn't want - I did it, it was - people just didn't want - I did it. It was - people just didn't want it, especially my father and my father, it, especially my father and my father, it, especially my father and my father was the man that taught me the most and was the man that taught me the most and was the man that Taught me the most and he loaned me a small amount of money and he loaned me a small amount of money and he loaned me a small amount of money and I built it into a great, great company.","I built it into a great, great company. I built it into a great, great company and it was you know, just something I and it was you know, just something I and it was you know, just something I loved, but he was so against me coming loved, but he was so against me coming loved. But he was so against me coming into Manhattan and then this became so into Manhattan and then this became so into Manhattan.","And then this became so successful and he said, Wow, successful and he said, Wow, successful. And he said, Wow, paid him back. The money did other things paid him back, the money did other things paid him back. The money did other things. We did the Convention Center, the Jacob, we did the Convention Center, the Jacob.","We did the Convention Center, the Jacob Javits Convention Center. I got the state Javits Convention Center, I got the state Javits Convention Center, I got the state and the city to build and today to this and the city to build and today to this and the city to build. And today to this day, they were going to build that one in day.","They were going to build that one in day. They were going to build that one in the water and they had all sorts of the water and they had all sorts of the water. And they had all sorts of environmental approvals, he even then environmental approvals, he even then environmental approvals. He even then they had environmental improve us and they had environmental improve us and they had environmental improve us and they had the pier had bulkhead problems.","They had the pier had bulkhead problems, they had the pier had bulkhead, problems had tremendous problems and they were in - had tremendous problems and they were in - had tremendous problems and they were in the wrong location. I went to Governor the wrong location. I went to Governor the wrong location.","I went to Governor Kerry who was a Democrat, but I want to Kerry who was a Democrat, but I want to Kerry who was a Democrat, but I want to tell you he was a great, great problem. Tell you he was a great, great problem, tell you he was a great, great problem solver and they were spending so much solver and they were spending so much solver and they were spending so much money on and wasting it.","They couldn't money on and wasting it. They couldn't money on and wasting it. They couldn't get any approval. And I went to the get any approval and I went to the get any approval and I went to the governor, we had a man, I won't mention governor. We had a man, I won't mention governor. We had a man, I won't mention his name, but he's very well known and he his name, but he's very well known and he his name, but he's very well known and he was totally against what I was doing.","And was totally against what I was doing and was totally against what I was doing and he just wanted to build it in this one. He just wanted to build it in this one. He just wanted to build it in this one location which was a bad. You had to go location, which was a bad, you had to go location, which was a bad, you had to go through a Hell's Kitchen and you had to through a Hell's Kitchen and you had to through a Hell's Kitchen and you had to go under the West Side, Highway go under the West Side, Highway go under the West Side Highway, you had to build, ramps over the highway, you had to build, ramps over the highway.","You had to build, ramps over the highway, you had no access. And on top of that, it - you had no access and on top of that it - you had no access. And on top of that, it was being built in the Hudson River and was being built in the Hudson River and was being built in the Hudson River. And you couldn't get any approvals other - you couldn't get any approvals other - you couldn't get any approvals.","Other than that, it was a wonderful sight. And than that it was a wonderful sight. And than that it was a wonderful sight. And this guy, I won't mention his name, his this guy, I won't mention his name, his this guy. I won't mention his name. His name was Richard Ravich was totally New name was Richard Ravich was totally New name was Richard Ravich was totally New Yorkers know that name.","He was so intent Yorkers know that name, he was so intent Yorkers know that name. He was so intent on building it and I was arguing with on building it and I was arguing with on building it and I was arguing with him and fighting. And I said, look, I have him and fighting and I said, look, I have him and fighting and I said, look, I have the - an option to the Westside railroad, the - an option to the Westside railroad, the an option to the Westside railroad yards.","And I had it for this purpose, I yards and I had it for this purpose. I yards and I had it for this purpose. I did it with a Penn Central Company which did it with a Penn Central Company, which did it with a Penn Central Company which was in bankruptcy. And I said, look, this was in bankruptcy and I said, look, this was in bankruptcy and I said, look this, you don't have to go, it's on the proper, you don't have to go, it's on the proper, you don't have to go.","It's on the proper side of the West Side, Highway, the site side of the West Side, Highway, the site side of the West Side Highway, the site is big, the site is good. We went up to is big, the site is good. We went up to is big, the site is good. We went up to Governor Kerry Governor, Kerry Governor, Kerry governor, Kerry appointed Ravich to head governor Kerry appointed Ravich to head governor Kerry appointed Ravich to head up this commission to build the up this commission to build the up this commission to build the Convention Center.","And they were just Convention Center and they were just Convention Center and they were just about starting and I sat down, I'll never about starting and I sat down, I'll never about starting and I sat down, I'll never forget it. I sat down with governor, you forget it, I sat down with governor, you forget it, I sat down with governor you Kerry and his staff and he said Ravitz Kerry and his staff and he said Ravitz Kerry and his staff and he said Ravitz, you make the Case for your site and he you make the case for your site and he you make the case for your site and he made a case for 20 minutes and every made a case for 20 minutes and every made a case for 20 minutes.","And every time he talked, it was just wrong, wrong time. He talked it was just wrong, wrong time. He talked it was just wrong, wrong, wrong, wrong, wrong. He said Donald, would you make the case? I he said Donald, would you make the case? I he said Donald, would you make the case? I made the case. It took me five minutes at made the case.","It took me five minutes at made the case. It took me five minutes at the end of five minutes. He says not even the end of five minutes, he says not even the end of five minutes. He says not even close, totally change gears built it, got close, totally change gears, built it, got close, totally change gears, built it, got the approvals, quickly, got it, built it, the approvals quickly, got it, built it, the approvals quickly got it built, it was called the Jacob, Javits Convention was called the Jacob Javits Convention was called the Jacob Javits Convention Center and to this day it does wait so Center and to this day it does wait so Center and to this day it does wait.","So we're happy about it. We're happy about it, we're happy about it. And then I built you know, many other and then I built you know many other and then I built you know, many other buildings all over the city. I mean I'm buildings all over the city. I mean, I'm buildings all over the city. I mean, I'm just listing some of them and because just listing some of them and because just listing some of them and because this one really was where, Sir this was this one really was where Sir this was this one really was where Sir, this was my First, this was my first - the Grand my first, this was my first - the Grand my first, this was my first the Grand Hotel and then little things like the Hotel and then little things like the Hotel and then little things like the Wollman Rink, seven years.","The city, Wollman Rink, seven years, the city, Wollman Rink, seven years, the city couldn't fix an ice skating. Rinks couldn't fix an ice skating. Rinks couldn't fix an ice skating rinks probably. I think I became more famous probably. I think I became more famous probably. I think I became more famous because of the Waldman room they had for because of the Waldman room they had for because of the Waldman room they had for seven years, they couldn't build an seven years.","They couldn't build an seven years. They couldn't build an ice-skating rink for seven years and I ice-skating rink for seven years and I ice-skating rink for seven years. And I had my daughter, Ivanka, she was very - it had my daughter Ivanka. She was very - it had my daughter Ivanka. She was very - it.","Did anybody hear of Ivanka? Anybody, but did anybody hear of Ivanka? Anybody? But did anybody hear of Ivanka? Anybody? But she was a very young girl. She kept. She was a very young girl. She kept. She was a very young girl. She kept saying daddy daddy, can't we go saying daddy daddy, can't we go saying daddy daddy can't?","We go ice-skating here after say you can't ice-skating here after say you can't ice-skating here after say you can't. They're building the rink. And finally, I - they're building the rink and finally I - they're building the rink. And finally, I went down, I looked and I saw 400 men in went down, I looked and I saw 400 men in went down.","I looked and I saw 400 men in those cases was all men. I have to say those cases was all men. I have to say those cases was all men. I have to say today you have men and women as your today you have men and women. As your today, you have men and women as your construction people, which is great, but construction people, which is great, but construction people, which is great.","But it was all men that 400 men sitting in, it was all men, that 400 men sitting in, it was all men, that 400 men sitting in the rink, not looking. And I came back a, the rink not looking and I came back a, the rink not looking and I came back a half hour later, they still weren't half hour later. They still weren't half hour later, they still weren't working.","They were taking lunch breaks working. They were taking lunch breaks working. They were taking lunch breaks many, many times a day that nobody was many, many times a day that nobody was many, many times a day that nobody was working and they went out and they got working and they went out and they got working and they went Out - and they got from Miami Beach, a expert or an ice, but from Miami Beach, a expert or an ice, but from Miami Beach, a expert or an ice.","But they meant - they meant - they meant refrigerators not to make ice. And I'll refrigerators not to make ice. And I'll refrigerators not to make ice, and I'll never forget sort of an interesting - never forget sort of an interesting, never forget sort of an interesting story. I hope it's interesting, but I got story.","I hope it's interesting, but I got story. I hope it's interesting. But I got to tell it anyway because who Nell wants to tell it anyway because who Nell wants to tell it anyway, because who Nell wants to talk about politics all the time to talk about politics all the time to talk about politics all the time.","Right? This politics gets a little boring, right? This politics gets a little boring, right? This politics gets a little boring. But what happened is I went to the mayor, but what happened is I went to the mayor. But what happened is I went to the mayor and said, listen, mr. mayor, Ed Koch I said and said, listen, mr.","mayor, Ed Koch I said and said, listen, mr. mayor, Ed Koch, I said it's seven years now. It's going to be - it's seven years now. It's going to be - it's seven years now, it's going to be eight, nine, ten, they have eight, nine, ten, they have eight, nine, ten, they have idea, they use the thing called freon and idea.","They use the thing called freon and idea. They use the thing called freon and that's a gas that goes through copper, that's a gas that goes through copper, that's a gas that goes through copper, piping, copper tubing. They had six miles, piping, copper tubing, they had six miles, piping, copper tubing.","They had six miles of copper, it had a four inches apart and of copper it had a four inches apart and of copper it had a four inches apart and it was laid this massive rank. It's - it was laid this massive rank, it's - it was laid this massive rank, it's almost 90,000 square feet that's like almost 90,000 square feet.","That's like almost 90,000 square feet. That's like big, big office floors, times three big, big, big office floors times three big, big, big office floors, times three big spots. You see, I run it, I've run it for spots. You see I run it, I've run it for spots. You see I run it. I've run it for many, many years.","It's been such a submit' many, many years. It's been such a submit' many, many years. It's been such a submit' tremendous place, but they had the freon tremendous place. But they had the freon tremendous place, but they had the freon and it was laid four inches miles of it and it was laid four inches miles of it and it was laid four inches miles of it.","And every time they put this beautiful and every time they put this beautiful and every time they put this beautiful copper down single time, the next night copper down single time, the next night copper down single time, the next night people would steal it. So they kept - people would steal it, so they kept people would steal it.","So they kept putting it down, kept getting so putting, putting it down, kept getting so putting, putting it down, kept getting so putting it down, kept getting so then they put it down, kept getting. So then they put it down, kept getting. So then they put the police force around and it was fine, the police force around and it was fine, the police force around and it was fine until the police force decided to go to until the police force decided to go to until the police force decided To go to lunch, it was well stolen lunch, it was well stolen lunch, it was well stolen, so they were losing millions of dollars.","So they were losing millions of dollars. So they were losing millions of dollars. They were actually in for 22 million. They were actually in for 22 million, they were actually in for 22 million dollars and they had nothing and I went dollars and they had nothing and I went dollars and they had nothing.","And I went to see Ed Koch and he said I'm not gonna to see Ed Koch and he said I'm not gonna to see Ed Koch and he said I'm not gonna let you do it. And then I went to see - let you do it and then I went to see - let you do it. And then I went to see some of the newspapers. I went to the - some of the newspapers, I went to the - some of the newspapers, I went to the editorial boards, I said the mayor won't editorial boards.","I said the mayor won't editorial boards. I said the mayor won't let us do it. I can fix this thing, I'll let us do it. I can fix this thing. I'll let us do it. I can fix this thing. I'll do it in six months to a year and you're do it in six months to a year and you're do it in six months to a year and you're gonna be years and years and they don't gonna be years and years and they don't Gon na be years and years and they don't know what they're doing and they're know what they're doing and they're know what they're doing and they're spending a fortune.","And I'll never forget spending a fortune and I'll never forget spending a fortune. And I'll never forget, I went to two editorial boards, New York, I went to two editorial boards, New York, I went to two editorial boards, New York Times and the other one I won't say Times and the other one I won't say Times.","And the other one I won't say because they don't like the penguin, but because they don't like the penguin, but because they don't like the penguin. But I do like the New York Post. I do like the New York Post. I do like the New York Post. I do like the New Yorkers and they did. I do like the New Yorkers and they did.","I do like the New Yorkers and they did editorial said you have to let him do it. Editorial said you have to let him do it. Editorial said, you have to let him do it. You have to let him do it. You have to let him do it. You have to let him do it anyway. They let me do it. I took over the - anyway they let me do it.","I took over the - anyway they let me do it. I took over the project and a lot of people said well it project and a lot of people said well it project and a lot of people said, well, it was built, it wasn't built. It was the - the was built, it wasn't built, it was the - the was built, it wasn't built, it was the - the concrete was poured, it was nine inches, concrete was poured, it was nine inches.","Concrete was poured, it was nine inches higher on one side than the other side, higher on one side than the other side, higher on one side than the other side. So when you poured the water, you had a - so when you poured the water, you had a - so when you poured the water, you had a big swimming pool here and this one that big swimming pool here and this one that big swimming pool here.","And this one that none, it was just a mess and the one was none, it was just a mess and the one was none. It was just a mess and the one was so deep, you couldn't freeze it because so deep you couldn't freeze it because so deep you couldn't freeze it because it was too much. So I had to rip out the - it was too much.","So I had to rip out the - it was too much, so I had to rip out the entire slab and the slab was a foot to entire slab and the slab was a foot to entire slab and the slab was a foot to half thick. It only had it before inches half thick. It only had it before inches half thick. It only had it before inches.","So we ripped it and we did. And I - so we ripped it and we did. And I - so we ripped it and we did. And I finished it in four months and I said if finished it in four months and I said if finished it in four months and I said if it cost any more than two million, it cost any more than two million it cost any more than two Million dollars, because it's a great government dollars because it's a great government dollars because it's a great government.","You know they study this at the Wharton, you know, they study this at the Wharton. You know, they study this at the Wharton School. They study it at Harvard because School - they study it at Harvard because School - they study it at Harvard because it's the difference maybe between the - it's the difference maybe between the - it's the difference maybe between the public sector and the private sector, public sector and the private Sector public sector and the private sector, I went in fig, you know it's really been - I went in fig, you know it's really been - I went in fig, you know it's really been to this day, it's a great case study I to this day it's a great Case study I to this day, it's a great case study I went in and we did a job like you went in and we did a job like you went in and we did a job like you wouldn't believe, wouldn't believe, wouldn't believe we took out that Horrible big, massive, we took out that horrible, big, massive.","We took out that horrible, big, massive slab of concrete. We leveled it out, but slab of concrete, we leveled it out. But slab of concrete, we leveled it out. But most importantly, I said to the people, most importantly, I said to the people, most importantly, I said to the people what's with this freon, I hear they're what's with this freon.","I hear they're what's with this freon. I hear they're losing millions of dollars of copper, losing millions of dollars of copper, losing millions of dollars of copper tubing all the time. What is it? And I tubing all the time, what is it and I tubing all the time, what is it? And I said who are the people and they said?","Said who are the people and they said, said who are the people and they said, well, it's an air conditioning firm from well, it's an air conditioning firm from well, it's an air conditioning firm from Miami. I said from Miami, what do we - I - Miami I said from Miami, what do we - I Miami I said from Miami, what do we - I don't want ice from Miami, so I called up, don't want ice from Miami.","So I called up, don't want ice from Miami. So I called up a friend of mine who is a part owner of a friend of mine who is a part owner of a friend of mine who is a part owner of the Montreal Canadiens. Now we're talking the Montreal Canadiens, now we're talking the Montreal Canadiens, now we're talking right ice, I said would you do me a favor, right?","Ice I said would you do me a favor, right? Ice I said, would you do me a favor? Do you have anybody that knows how to do you have anybody that knows how to do you have anybody that knows how to make ice for an ice skating rink ease, make ice for an ice skating rink ease, make ice for an ice skating rink ease that I have the greatest guy in the - that I have the greatest guy in the - that I have the greatest guy in the world.","I said, could I talk to him please? World I said, could I talk to him please? World I said, could I talk to him please and he came to New York and he saw me, he and he came to New York and he saw me, he and he came to New York and he saw me, he said this is crazy, said this is Crazy said, this is crazy.","He said mr. Trump, they're gonna have he said, mr. Trump, they're gonna have he said, mr. Trump, they're gonna have five miles of this piping. If there's a five miles of this piping, if there's a five miles of this piping, if there's a little pin, oh, because it's gas for young little pin, oh, because it's gas for young little pin oh, because it's gas for young guess.","If there's a little pinhole than guess, if there's a little pinhole than guess if there's a little pinhole than five miles, it's - it's dead. He said you five miles, it's - it's dead. He said you five miles, it's - it's dead. He said you don't want that. You want rubber hose and don't want that. You want rubber hose and don't want that.","You want rubber hose and you want water and in the water you put, you want water and in the water you put, you want water and in the water you put salt. So it doesn't freeze, I said boy, salt, so it doesn't freeze. I said boy, salt. So it doesn't freeze. I said boy, that sounds good. And I went out and we - that sounds good and I went out and we - that sounds good and I went out and we bought it for just a tiny amount of bought it for just a tiny amount of bought it for just a tiny amount of money.","And it was rubber hose every four money and it was rubber hose every four money and it was rubber hose every four inches. But it's rubber hose, we got the inches, but it's rubber hose, we got the inches, but it's rubber hose. We got the equipment, it's called brine, they call it equipment, it's called brine, they call it equipment, it's called brine, they call it brine.","And we did the rubber hose, nobody brine and we did the rubber hose, nobody brine and we did the rubber hose. Nobody stole the rubber hose. Nobody wanted. We stole the rubber hose. Nobody wanted. We stole the rubber hose. Nobody wanted. We didn't need - we didn't need - security, didn't need, we didn't need security, didn't need, we didn't need security, nobody sold the rubber hose and we - nobody sold the rubber hose and we - nobody sold the rubber hose and we opened it up and what it was the most Opened it up and what it was the most opened it up and what it was the most amazing thing.","We put the rubber hose amazing thing. We put the rubber hose amazing thing. We put the rubber hose down, we tested it, there wasn't a leak in down. We tested it, there wasn't a leak in down, we tested it. There wasn't a leak in the whole thing, 6.2 miles of rubber hose, the whole thing 6.2 miles of rubber hose, the whole thing 6.2 miles of rubber hose.","Can you believe it? That's a lot. That's a - can you believe it? That's a lot. That's a - can you believe it? That's a lot. That's a - was it a leak. Now what happened is we - was it a leak. Now what happened is we was it a leak. Now what happened is we put the concrete over, we had concrete up put the concrete over, we had concrete up put the concrete over, we had concrete up to Harlem.","Now my - all of my construction to Harlem, now my all of my construction to Harlem, now my - all of my construction friends in that corner, in fact they all friends in that corner. In fact they all friends in that corner. In fact, they all have the worst seats. I don't know why have the worst seats. I don't know why have the worst seats.","I don't know why construction guys usually have the best construction guys usually have the best construction guys usually have the best seats, but they understand what I'm seats. But they understand what I'm seats. But they understand what I'm talking about because we wanted to talking about because we wanted to talking about because we wanted to contiguous for because the city used to contiguous for because the city used to contiguous for because the city used to pour ten feet come back.","A week later, pour ten feet come back a week later, pour ten feet come back a week later, pour another ten feet and yet all these pour another ten feet and yet all these pour another ten feet and yet all these blocks got you want a contiguous Well, we blocks got - you want a contiguous well, we blocks got, you want a contiguous well.","We had all the way back to Harlem. We had had all the way back to Harlem. We had had all the way back to Harlem. We had trucks and the most amazing thing trucks and the most amazing thing trucks and the most amazing thing and they poured - it took two days to pour and they poured. It took two days to pour and they poured.","It took two days to pour the slab. We actually made it six inches, the slab. We actually made it six inches the slab. We actually made it six inches because that's better and we turned on because that's better and we turned on because that's better. And we turned on and we put two inches of water on top of and we put two inches of water on top of - and we put two inches of water on top of this slab and they made lasers.","It was this slab and they made lasers. It was this slab and they made lasers. It was such a perfect slab to this day. It's such a perfect slab to this day. It's such a perfect slab to this day. It's perfect. They then put the water on top. I perfect. They then put the water on top, I perfect, they then put the water on top, I said try it because this thing hadn't said try it because this thing hadn't said try it because this thing hadn't had ice in nine years.","I should try it had ice in nine years, I should try it had ice in nine years, I should try it. And in two hours with the most beautiful and in two hours with the most beautiful and in two hours with the most beautiful ice just like the Montreal Canadiens and ice, just like the Montreal Canadiens and ice, just like the Montreal Canadiens.","And we had over and we had our - so - so I've - we had over and we had our - so - so I've - we had over and we had our - so - so I've had a lot of fun with New York and we had a lot of fun with New York And we had a lot of fun with New York and we did another job recently in the Bronx, did another job recently in the Bronx did another job recently in the Bronx where was the same thing where they had where was the same thing where they had - Where was the same thing where they had you know, ferry point, yeah, you know what you know, ferry point, yeah, you know what you know, ferry point, yeah, you know what I'm talking about, I'm talking about I'm talking about ferry point was under construction for ferry point Was under construction for ferry point was under construction for 26 years.","I mean people say, give me a 26 years, I mean people say give me a 26 years, I mean people say, give me a break 26. The only reason, I don't say 32 break 26, the only reason I don't say 32 break 26. The only reason I don't say 32 is because that can't be proven 26 years is because that can't be proven 26 years is because that can't be proven 26 years.","It ended up costing hundreds of millions. It ended up costing hundreds of millions. It ended up costing hundreds of millions of dollars. Nobody knows what the price of dollars, nobody knows what the price of dollars, nobody knows what the price is. Michael, Bloomberg said, could you do is - Michael, Bloomberg said, could you do is Michael Bloomberg said, could you do me a favor?","Could you look at this? It's a me a favor. Could you look at this? It's a me a favor. Could you look at this? It's a disaster, it's been under construction disaster, it's been under construction disaster. It's been under construction for so many and he was embarrassed and for so many and he was embarrassed and for so many and he was embarrassed and it's a very big golf project designed by it's a very big golf project designed by it's a very big golf Project designed by Jack Nicklaus and you know many, many Jack Nicklaus and you know many, many Jack Nicklaus and you know many, many iterations.","But I got it built in one iterations. But I got it built in one iterations, but I got it built in one year and it's open today and greatly year and it's open today and greatly year and it's open today and greatly successful. So for peanuts, when I say successful, so for peanuts, when I say successful, so for peanuts, when I say open, am I right?","That's the woman right open, am I right? That's the woman right open, am I right? That's the woman right there. She's probably under a my right there. She's probably under a my right there. She's probably under a - my right thank you, darling. I appreciate it very thank you, darling. I appreciate it very thank you, darling.","I appreciate it very nice. I don't know who else she is. I know nice, I don't know who else she is. I know nice. I don't know who else she is. I know she's not a protester. She's on my side. She's not a protester. She's on my side. She's not a protester. She's on my side and she's certainly not a pain, I'll tell, and she's certainly not a pain, I'll tell.","And she's certainly not a pain. I'll tell you what you take a look outside these you what you take a look outside these you what you take a look outside, these are paid protesters folks. They've got are paid protesters folks. They've got are paid protesters folks. They've got the most beautiful signs made from a - the most beautiful signs made from a - the most beautiful signs made from a factory there.","We'll print it out, they factory there. We'll print it out, they factory there, we'll print it out, they hand it instead if you want any hand it instead if you want any hand it instead if you want any information on the sign, please call this information on the sign. Please call this information on the sign.","Please call this number what kind of crap we want if number, what kind of crap we want if number, what kind of crap we want if they're real protesters. We want those, they're real protesters. We want those, they're real protesters. We want those signs made in the basement anyway, so signs made in the basement anyway.","So signs made in the basement anyway. So then we've done many jobs since then and then we've done many jobs since then. And then we've done many jobs since then and it's just a great city. It's a vibrant - it's just a great city, it's a vibrant, it's just a great city, it's a vibrant city, an amazing city.","We have to be city, an amazing city. We have to be city an amazing city. We have to be careful. Our mayor has to be careful, careful. Our mayor has to be careful, careful. Our mayor has to be careful because he can blow it very quickly if because he can blow it very quickly if because he can blow it very quickly if he keeps going the way he's going not - he keeps going the way he's going not - he keeps going.","The way he's going not doing good, we doing good, we doing good. We better be careful, mr. mayor. But we have better be careful, mr. mayor. But we have better be careful, mr. mayor. But we have a city that outlasts the mayor's it out, a city that outlasts the mayor's it out, a city that outlasts the mayor's it out lasts.","Everybody's got out last us. It's lasts. Everybody's got out last us. It's lasts. Everybody's got out last us. It's one of the great, great cities of the - one of the great, great cities of the - one of the great, great cities of the world and it's called Whitehouse. Is it - why won't you stop Whitehouse?","Is it - why won't you stop Whitehouse? Is it - why won't you stop disrespected about New York values disrespected about New York values disrespected about New York values become a things down, but it's just one become a things down, but it's just one become a things down. But it's just one of those things.","I said, you know, I talked of those things I said, you know, I talked of those things I said, you know I talked tonight about New York values that we tonight about New York values that we tonight about New York values that we all many of us That we all know so well all many of us that we all know so well all many of us that we all know so well.","The values that make us love this thing, the values that make us love this thing, the values that make us love this thing, which has been a symptom of American, which has been a symptom of American, which has been a symptom of American strength throughout the world. No matter strength throughout the world, no matter strength throughout the world, no matter where you go.","They love noodles. You know where you go. They love noodles. You know where you go. They love noodles. You know you can be from lots of other places and you can be from lots of other places and you can be from lots of other places. And if you want to see somebody, you just - if you want to see somebody, you just - if you want to see somebody you just said, what are you coming to New York said, what are you coming to New York said, what are you coming to New York Villas come, everybody comes to New York, villas come, everybody comes to New York, villas come, everybody comes to New York.","Eventually this is nothing like it. So eventually this is nothing like it. So eventually this is nothing like it. So when we talk about values, what are we - when we talk about values, what are we - when we talk about values, what are we seeing? New York values we see are really seeing New York values we see are really seeing New York values we see are really, really incredible when you look at really incredible when you look at really incredible when you look at September 11th, especially New York, September 11th, especially New York, September 11th, especially New York Police and New York firefighters Police and New York firefighters Police and New York firefighters, b-brother you see are unbelievable.","And b-brother you see are unbelievable. And b-brother you see are unbelievable and they keep those strains going. And those - they keep those strains going and those - they keep those strains going and those buses and everything else. But we see our buses and everything else, but we see our buses and everything else.","But we see our transit workers and what they went, transit workers and what they went, transit workers and what they went through when September 11th was through when September 11th was through when September 11th was incredible, incredible, incredible. We see families playing in Central Park. We see families playing in Central Park.","We see families playing in Central Park, thousands and thousands of families with thousands and thousands of families with thousands and thousands of families with their children, some without children, their children, some without children, their children, some without children, some together. Some not together, but we some together, some not together, but we some together, some not together.","But we see people in Central Park and people see people in Central Park and people see people in Central Park and people playing in Central Park. We see playing in Central Park, we see playing in Central Park. We see restaurant workers all over the city in restaurant workers all over the city in restaurant workers all over the city in delis and factory workers in upstate New delis and factory workers in upstate New delis and factory workers in upstate New York, York, York.","Unfortunately, I've spent a lot of time. Unfortunately, I've spent a lot of time. Unfortunately, I've spent a lot of time in upstate New York and those factory in upstate New York and those factory in upstate New York and those factory workers are rapidly, rapidly leaving. Our workers are rapidly, rapidly leaving.","Our workers are rapidly, rapidly leaving our state and we can't let that happen state and we can't let that happen state and we can't let that happen. And we have a whole fabric of our - and we have a whole fabric of our - and we have a whole fabric of our community. So what are New York values community?","So what are New York values community? So what are New York values? Because you know people are disputing because you know people are disputing because you know people are disputing. I'm not disputing and the New Yorkers I'm not disputing and the New Yorkers I'm not disputing and the New Yorkers are disputing.","And most people that know are disputing. And most people that know are disputing and most people that know to New York and of what - what we've done to New York and of what - what we've done to New York and of what - what we've done when you look at what happened with when you look At what happened with - when you look at what happened with September 11th, the job that this city September 11th, the job that this city September 11th, the job that this city has done and the people of the city have - has done and the people of the city Have has done and the people of the city have done is beyond what anyone's ever single done is beyond what anyone's ever single done is beyond what anyone's ever single and you say what are they your fellows and you say, what are they your fellows and you Say what are they?","Your fellows, number one, honesty and straight talking number one, honesty and straight talking number one, honesty and straight talking, honesty, you better, believe it, honesty, you better, believe it, honesty, you better, believe it. It's a worker hard-working people. It's - it's a worker hard-working people.","It's - it's a worker hard-working people. It's about family. New York, believe it is about family. New York, believe it is about family. New York believe it is about family. So important. It's the about family. So important. It's the about family. So important, it's the energy to get things done, energy to get things done, energy to get things done.","Big energy, if Jeb Bush came here, I'm big energy. If Jeb Bush came here, I'm big energy. If Jeb Bush came here, I'm telling you we have much more energy telling you. We have much more energy telling you. We have much more energy that has led felon. He should move to New that has led felon. He should move to New.","That has led felon. He should move to New York, right? We're business, we make things York, right? We're business, we make things York, right? We're business, we make things happen. That's so important we make happen. That's so important we make happen. That's so important. We make things happen and it's church.","And things happen and it's church and things happen and it's church and community service because this community service, because this community service, because this tremendous community service, New York, tremendous community service, New York, tremendous community service, New York values, one display for all to see in the Values one display for all to see in the values one display for all to see in the aftermath of 9/11, a strike at the heart aftermath of 9/11, a strike at the heart aftermath of 9/11, a strike at the heart of our city and our nation.","In our of our city and our nation in our of our city and our nation in our darkest moments as the city, we showed darkest moments as the city. We showed darkest moments as the city. We showed the world the very, very best in terms of the world, the very, very best in terms of the world, the very, very best in terms of bravery and the heart and soul that we bravery and the heart and soul that we bravery and the heart.","And soul that we have in America, the firefighters and first responders, the firefighters and first responders, the firefighters and first responders and the police officers and the Port and the police officers and the Port and the police officers and the Port Authority workers who ran up those Authority workers who ran up those Authority workers who ran up those stairs stairs stairs, those are New York values and those that - those are New York values and those that - those are New York values.","And those that New Yorker bad news, New Yorker, bad news, New Yorker, bad news, I'm not sure she seriously father Mychal. I'm not sure she seriously father Mychal. I'm not sure she seriously father Mychal judge chaplain to the New York City Fire judge chaplain to the New York City Fire judge chaplain to the New York City Fire Department who you know died and an Department who you know died and an Department who you know Died and an amazing guy who I knew a little bit, who amazing guy, who I knew a little bit, who amazing guy, who I knew a little bit, who a lot of people do very well, who, Rudy, a lot of people do very well, who, Rudy, a Lot of people do very well, who Rudy Giuliani really knew very well, but you Giuliani really knew very well, but you Giuliani really knew very well.","But you look at father judge, and I'll tell you, look at father judge and I'll tell you, look at father judge and I'll tell you what that was. Some guy and he went up what that was some guy and he went up what that was some guy and he went up there to pray and he knew what was going there to pray and he knew what was going there to pray and he knew what Was going to happen and he died and he died to happen and he died and he died to happen and he died.","And he died praying and taking care of people and he praying and taking care of people and he praying and taking care of people. And he was an amazing guy. The people in the - was an amazing guy. The people in the - was an amazing guy, the people in the towers who helped rescue each other towers who helped rescue each other towers who helped rescue each other.","Those are those of New York values, the - those are those of New York values. The - those are those of New York values. The restaurants and local businesses who restaurants and local businesses who restaurants and local businesses who kept their shops open to help everybody kept their shops open to help everybody kept their shops open to help everybody during this incredible time.","Those are during this incredible time. Those are during this incredible time. Those are the real values everyone who helped the real values, everyone who helped the real values, everyone who helped clear the rubble and the rescue, the clear the rubble and the rescue, the clear the rubble and the rescue, the injured.","Those are New Yorkers, every injured, those are New Yorkers, every injured, those are New Yorkers, every small act of kindness, every great act of small act of kindness, every great act of small act of kindness, every great act of courage of which there were so many courage Of which there were so many courage of which there were so many, there's never been anything like this.","There's never been anything like this. There's never been anything like this. This was the greatest attack and the - this was the greatest attack and the - this was the greatest attack and the worst and most horrific attack in the worst and most horrific attack in the worst and most horrific attack in the history of our country.","Far greater than history of our country, far greater than history of our country, far greater than Pearl Harbor because the attack was on Pearl Harbor because the attack was on Pearl Harbor because the attack was on civilians. It wasn't on the military it civilians. It wasn't on the military it civilians, it wasn't on the military, it was under civilians, but those are New was under civilians, but those are New was under civilians, but those are New York values and these are the values York values and these are the values York Values and these are the values that we need to make America great again that we need to make America great again that we need to make America great again.","We need to these values to bring America, we need to these values to bring America, we need to. These values to bring America together again and to heal Americans together again and to heal Americans together again and to heal Americans wounds again. So I just want to tell you wounds again, so I just want to tell you wounds again.","So I just want to tell you that I am so proud to do with you that I am so proud to do with you that I am so proud to do with you tonight. I am so proud to be discussing tonight. I am so proud to be discussing tonight. I am so proud to be discussing all sorts of topics, but most importantly all sorts of topics, but most importantly all sorts of topics.","But most importantly, New York values because no matter where New York values, because no matter where New York values, because no matter where go anywhere in the world, they talk in, go anywhere in the world. They talk in, go anywhere in the world. They talk in the most positive tones about what all the most positive tones about what all the most positive tones about what all of us have done.","So of us have done so of us have done so ladies and gentlemen, have a great dinner. Ladies and gentlemen, have a great dinner, ladies and gentlemen, have a great dinner. We're going to have an amazing election. We're going to have an amazing election. We're going to have an amazing election coming up. We're having some really great coming up.","We're having some really great coming up. We're having some really great primaries. It's been a lot of fun for me, primaries. It's been a lot of fun for me, primaries. It's been a lot of fun for me. You know what's it supposed to be this, you know, what's it supposed to be this, you know, what's it supposed to be this way.","A lot of people said, well, what do way a lot of people said, well, what do way a lot of people said, well, what do you know I've been dealing with, you know, I've been dealing with, you know, I've been dealing with politicians all my life. So I think I politicians all my life, so I think I politicians all my life.","So I think I know something, but it's been a great know something, but it's been a great know something, but it's been a great, great experience. I'm right now millions great experience. I'm right now millions great experience. I'm right now millions of votes ahead of my closest rival of votes ahead of my closest rival of votes ahead of my closest rival.","Millions of us, you know, people don't millions of us, you know, people don't millions of us. You know, people don't talk about books anymore, talk about books anymore, talk about books anymore. They talk delegates. I by the way I they talk delegates I by the way I they talk delegates. I - by the way, I happen to be hundreds of Delegates ahead, happen to be hundreds of Delegates ahead, happen to be hundreds of Delegates ahead too.","But I'm - you know, to me so important too, but I'm - you know, to me so important too, but I'm - you know, to me so important, I'm millions of votes ahead of my next, I'm millions of votes ahead of my next. I'm millions of votes ahead of my next year's oh, and we have thank you. Thank year's oh and we have thank you.","Thank year's oh and we have. Thank you. Thank you. Though millions of votes. You though millions of votes. You though millions of votes. We have 22, 6, 22 states and it started by - we have 22, 6, 22 states and it started by - we have 22, 6, 22 states. And it started by the way, with New Hampshire. We went down the way with New Hampshire.","We went down the way with New Hampshire, we went down to South Carolina states that I wasn't to South Carolina states that I wasn't to South Carolina states that I wasn't supposed to win and I ended up winning, supposed to win and I ended up winning supposed To win, and I ended up winning in a landslide: Alabama, Arkansas, Kentucky in a landslide; Alabama, Arkansas, Kentucky; in a landslide; Alabama, Arkansas, Kentucky.","The south, I may move to the south of New, the south, I may move to the south of New, the south. I may move to the south of New York as a treat as well because I'll York as a treat as well because I'll York as a treat as well because I'll tell you this South has been so great to tell you this South has been so great To tell you this South has been so great to me and then we went to Florida where you me and then we went to Florida where you me and then we went to Florida where you know it's my second home.","This is my know. It's my second home. This is my know. It's my second home. This is my first home. It's my second home and we first home, it's my second home and we first home, it's my second home, and we did so unbelievably won in a landslide, did so unbelievably won in a landslide, did so unbelievably won in a landslide by 20 points.","And it was an absolute by 20 points, and it was an absolute by 20 points. And it was an absolute landslide. And now we have something landslide, and now we have something landslide. And now we have something happening that's going to be very happening. That's going to be very happening. That's going to be very exciting.","The next four or five weeks are exciting. The next four or five weeks are exciting. The next four or five weeks are going to be very excited and we start going to be very excited and we start going to be very excited and we start what bring it on, what bring it on, what bring it on. Thank you. And we start on Tuesday.","Thank you. And we start on Tuesday. Thank you. And we start on Tuesday, soaping. And you know the interesting soaping and you know the interesting soaping and you know, the interesting thing is with all the primers that we've thing is with all the primers that we've thing is with all the primers that we've been through years and years and years been Through years and years and years been through years and years and years of primer of primer of primer, sort of either over or not very sort of either over or not very sort of either over or not.","Very important by the time they get to New important by the time they get to New, important by the time they get to New York, right? New York is so important. It's York, right? New York is so important. It's York, right? New York is so important. It's so important like New York should be so, so important like New York should be so.","So important like New York should be so important and I see what's happening and important and I see what's happening and important and I see what's happening and I see the polls coming in and I'm - so I see the polls coming in and I'm - so I see The polls coming in and I'm so honored because the people that know me honored because the people that know me honored because the people that know me best are the people from New York best are the people from New York best are the people from New York.","They're the ones that really know me, so they're the ones that really know me. So they're the ones that really know me. So when I'm up 42 points, if they're 42, when I'm up 42 points, if they're 42, when I'm up 42 points, if they're 42 points, that's a lot. But when I'm up 42 points, that's a lot. But when I'm up 42 points, that's a lot.","But when I'm up 42 and 44 points in the newest Falls, that's - and 44 points in the newest Falls, that's and 44 points in the newest Falls. That's such an honor because those are the such an honor because those are the such an honor because those are the people that know me best. So I think people that know me best.","So I think people that know me best. So I think we're gonna have a really exciting next. We're gonna have a really exciting next. We're gonna have a really exciting next four or five weeks. I think we're gonna four or five weeks. I think we're gonna four or five weeks. I think we're gonna have a great time in Cleveland, hopefully have a great time in Cleveland.","Hopefully have a great time in Cleveland. Hopefully not too good of time because by that not too good of time because by that not too good of time because by that time it should be solved by the time we enjoy the hotel, enjoy this great, great, enjoy the hotel, enjoy this great, great. Enjoy the hotel enjoy this great, great city and it's an honor to be with you city and it's an honor to be with you city and it's an honor to be with you tonight.","Thank you very much everybody."],"text":" Drop dead, right drop dead, that was a drop dead, right drop dead. That was a drop dead, right drop dead. That was a killer. That was it not a good time for killer that was it not a good time for killer. That was it not a good time for our city right now. It was a bad time for our city right now. It was a bad time for our city right now. It was a bad time for our city, but it was something that was our city, but it was something that was our city. But it was something that was - we had to do something because we love - we had to do something because we love - we had to do something because we love New York, we love New York and that was New York. We love New York and that was New York. We love New York and that was probably maybe the worst of the worst, probably maybe the worst of the worst, probably maybe the worst of the worst. And - but I just wanted to do it, I loved and - but I just wanted to do it, I loved and - but I just wanted to do it. I loved the building. I loved the potential of the building. I loved the potential of the building. I loved the potential of the building. It's called the Commodore, the building, it's called the Commodore, the building, it's called the Commodore hotel. It was built in 1909 and it was a hotel. It was built in 1909 and it was a hotel. It was built in 1909. And it was a mess and they had a spa and the spa was mess and they had a spa and the spa was mess and they had a spa and the spa was called relaxation Plus and nobody ever called relaxation Plus and nobody ever called relaxation Plus. And nobody ever got into what the Plus meant. You don't got into what the Plus meant. You don't got into what the Plus meant. You don't want to know and everybody in the want to know and everybody in the want to know and everybody in the building was failing. Every retail tenant building was failing. Every retail tenant building was failing. Every retail tenant in the building was failing and I was in the building was failing and I was in the building was failing and I was able to get most of them out, but able to get most of them out, but able to get most of them Out but relaxation Plus was making an absolute relaxation Plus was making an absolute relaxation Plus was making an absolute fortune and I couldn't get him out and I fortune and I couldn't get him out and I fortune and I couldn't get him out. And I asked about all sorts of things I asked about all sorts of things I asked about all sorts of things. I shouldn't say this too loud because I shouldn't say this too loud because I shouldn't say this too loud because I will be really ridiculed by the - will be really ridiculed by the will be really ridiculed by the Conservatives of which I am one I even Conservatives Of which I am one I even Conservatives of which I am one I even said what about condemnation, but I said what about condemnation, but I said what about condemnation, but I didn't do that. Okay. Is everybody happy? I didn't do that. Okay. Is everybody happy? I didn't do that, okay. Is everybody happy? I didn't do that, but I ended up getting - didn't do that, but I ended up getting - didn't do that. But I ended up getting them out and brought the building down them out and brought the building down them out. And brought the building down to its steel except for some of the - to its steel except for some of the - to its steel, except for some of the details on a couple of the ceilings details on a couple of the ceilings details on a couple of the Ceilings, because they would have been very hard because they would have been very hard because they would have been very hard. This is one of the rooms actually, right. This is one of the rooms actually, right. This is one of the rooms actually right here. The detail of the ballroom and the here, the detail of the ballroom and the here, the detail of the ballroom and the details of the rooms outside and trying details of the rooms outside and trying details of the rooms outside and trying to save those details cost A fortune to save those details cost a fortune to save those details cost a fortune because when the whole bill was because when the whole bill was because when the whole bill was essentially brought down to the steel, we essentially brought down to the steel. We essentially brought down to the steel we had to put canvas over all of the areas, had to put canvas over all of the areas, had to put canvas over all of the areas we were saving and when it rained that we were saving. And when it rained that we were saving and when it rained, that was not an easy situation. But I got - it was not an easy situation, but I got - it was not an easy situation, but I got it built. And what happened is as we were built and what happened is as we were built and what happened is as we were opening the market changed because the opening - the market changed because the opening the market changed because the city was doing so badly. And that was the city was doing so badly and that was the city was doing so badly and that was the worst that the city had ever been worst that the city had ever been worst that the city had ever been economically. Also people leaving economically. Also people leaving economically, also people leaving companies were leaving in droves and it companies were leaving in droves and it companies were leaving in droves and it was just something of a miracle. The area was just something of a miracle. The area was just something of a miracle. The area I opened the building to tremendous. I opened the building to tremendous. I opened the building to tremendous fanfare and the area became just special fanfare and the area became just special fanfare and the area became just special. That means special and I called it a that means special and I called it a that means special and I called it a Park Avenue address even though it Park Avenue address, even though it Park Avenue address, even though it really fronted on 42nd Street. I called, really fronted on 42nd Street, I called, really fronted on 42nd Street, I called it Park Avenue. You know it's in the park it Park Avenue, you know it's in the park, it Park Avenue, you know it's in the park, you have a new ramp and you have a new ramp and you have a new ramp and fairness right, might not be pure park. I fairness right might not be pure park, I fairness right might not be pure park. I had a choice of Lexington Avenue. 42nd had a choice of Lexington Avenue, 42nd had a choice of Lexington Avenue, 42nd Street or Park Avenue and guess what I Street or Park Avenue and guess what I Street or Park Avenue and guess what I chose Park Avenue. And that wasn't bad chose Park Avenue. And that wasn't bad chose Park Avenue and that wasn't bad, right. Well, I had that also in Columbus, right? Well, I had that also in Columbus, right? Well, I had that also in Columbus Circle, you know I did the big hotel Circle. You know, I did the big hotel Circle, you know I did the big hotel Trump International and it's been a Trump International and it's been a Trump International and it's been a great success from the dead was built great success from the dead was built great success From the dead was built and were in the circle and Columbus and were in the circle and Columbus and were in the circle and Columbus Circle didn't have a good name, but it Circle didn't have a good name, but it Circle didn't have a good name. But it also was on Central Park West, but it was also was on Central Park West, but it was also was on Central Park West, but it was called 7 Columbus Circle and a little called 7 Columbus Circle and a little called 7 Columbus Circle. And a little known fact and in fact you know when we known fact and in fact you know when we known fact and in fact you know, when we talk about government, we talk about talk about government, we talk about talk about government, we talk about rules And regulations, a little known rules and regulations, a little known rules and regulations, a little known fact is that when you have an address at fact is that when you have an address at fact is that when you have an address at least in New York, when You have an least in New York when you have an least in New York when you have an address in a building, it's very, very address in a building. It's very, very address in a building. It's very, very hard. So hard to change. So when you have hard so hard to change, so when you have hard so hard to change. So when you have a building that 7 Columbus Circle you a building that 7 Columbus Circle you a building, that 7 Columbus Circle, you have to go through the whole United have to go through the whole United have to go through the whole United States government to Get because of the States government to get because of the States government to get because of the mail service and because of the u.s. mail service and because of the u.s. mail service and because of the u.s. mail and all of the different problems mail and all Of the different problems mail and all of the different problems, so with 7 Columbus and I basically - so with 7 Columbus and I basically - so with 7 Columbus and I basically script that one down script that one down script that one down, we built a tremendous building. But I had - we built a tremendous building, but I had - we built a tremendous building, but I had a call at 7, sir. I said I'm not doing it a call at 7, sir. I said I'm not doing it a call at 7, sir. I said I'm not doing it and I went out and I really put on a big and I went out and I really put on a big and I went out and I really put on a big campaign in Washington and I got a campaign in Washington And I got a campaign in Washington and I got a change to number one Central Park West change to number one Central Park West, change to number one Central Park West that was good too. That was good too. That was good too. And you know, I figured the day I got and you know I figured the day I got and you know I figured the day I got that change. The building was worth about that change. The building was worth about that change. The building was worth about seven times more than I paid for it seven times more than I paid for it seven times more than I paid for it, right. So anyway, but this has been a just right. So anyway, but this has been a just right. So anyway, but this has been a just an amazing - an amazing event in this, an amazing - an amazing event in this, an amazing - an amazing event in this building. And I think of it because when building and I think of it because when building and I think of it because when I did the building, everybody said don't I did the building. Everybody said don't I did the building. Everybody said don't do it. It can't be done, it's never gonna do it, it can't be done. It's never gonna do it. It can't be done. It's never gonna happen. Bad area, bad location, tremendous happen, bad area, bad location, tremendous happen, bad area, bad location, tremendous crime. The city's dying and the city was crime, the city's dying and the city was crime, the city's dying and the city was dying. It wasn't just like not doing well dying. It wasn't just like not doing well dying. It wasn't just like not doing well. The city was dead and I remember one I - the city was dead and I remember one I - the city was dead. And I remember one I said to a friend of mine who was in a said to a friend of mine who was in a said to a friend of mine who was in a different business, a very good business, different business, a very good business, different business. A very good business and he was talking about what I did and he was talking about what I did and he was talking about what I did became a friend. I said well, I'm in the - became a friend. I said well, I'm in the - became a friend. I said, well, I'm in the real estate business in New York and real estate business in New York and real estate business in New York and they looked at me and said, oh, that's too - they looked at me and said, oh, that's too - they looked at me And said, oh, that's too bad, bad, bad, that's how bad it was, but it turned out that's how bad it was. But it turned out that's how bad it was. But it turned out to be a great business number one and it to be a great business number one and it to be a great business number one. And it turned out to be a great, great success, turned out to be a great, great success, turned out to be a great, great success as a hotel and it was built and Hyatt as a hotel and it was built and Hyatt as a hotel. And it was built and Hyatt was my partner and we - we did a good job, was my partner. And we - we did a good job, was my partner. And we - we did a good job and it was from - from the time it opened and it was from - from the time it opened and it was from - from the time it opened, it was amazing because from the day it, it was amazing because from the day It - it was amazing because from the day it opened, the market changed, opened, the market changed, opened the market changed and that's happened with a number of - and that's happened with a number of - and that's happened with a number of jobs that happened with me with 40 Wall jobs that happened with me with 40 Wall jobs that happened with me with 40 Wall Street. I bought a building the tallest Street, I bought a building, the tallest Street I bought a building, the tallest building in downtown Manhattan, voted building in downtown Manhattan, voted building in downtown Manhattan, voted during the Depression, literally the - during the Depression, literally the - during the Depression. Literally the depression of the early 90s and paid depression of the early 90s and paid depression of the early 90s and paid very little for it. Again, nobody wanted very little for it. Again, nobody wanted very little for it. Again nobody wanted it. And then when I opened, it was like it and then when I opened it was like it. And then when I opened, it was like the world had changed and it became a - the world had changed and it became a - the world had changed and it became a tremendously successful building, which I tremendously successful building, which I tremendously successful building, which I still have. So a lot of things happen, but still have - so a lot of things happen, but still have. So a lot of things happen. But with this one in particular, because when - with this one in particular, because when - with this one in particular, because when I did it, it was - people just didn't want - I did it, it was - people just didn't want - I did it. It was - people just didn't want it, especially my father and my father, it, especially my father and my father, it, especially my father and my father was the man that taught me the most and was the man that taught me the most and was the man that Taught me the most and he loaned me a small amount of money and he loaned me a small amount of money and he loaned me a small amount of money and I built it into a great, great company. I built it into a great, great company. I built it into a great, great company and it was you know, just something I and it was you know, just something I and it was you know, just something I loved, but he was so against me coming loved, but he was so against me coming loved. But he was so against me coming into Manhattan and then this became so into Manhattan and then this became so into Manhattan. And then this became so successful and he said, Wow, successful and he said, Wow, successful. And he said, Wow, paid him back. The money did other things paid him back, the money did other things paid him back. The money did other things. We did the Convention Center, the Jacob, we did the Convention Center, the Jacob. We did the Convention Center, the Jacob Javits Convention Center. I got the state Javits Convention Center, I got the state Javits Convention Center, I got the state and the city to build and today to this and the city to build and today to this and the city to build. And today to this day, they were going to build that one in day. They were going to build that one in day. They were going to build that one in the water and they had all sorts of the water and they had all sorts of the water. And they had all sorts of environmental approvals, he even then environmental approvals, he even then environmental approvals. He even then they had environmental improve us and they had environmental improve us and they had environmental improve us and they had the pier had bulkhead problems. They had the pier had bulkhead problems, they had the pier had bulkhead, problems had tremendous problems and they were in - had tremendous problems and they were in - had tremendous problems and they were in the wrong location. I went to Governor the wrong location. I went to Governor the wrong location. I went to Governor Kerry who was a Democrat, but I want to Kerry who was a Democrat, but I want to Kerry who was a Democrat, but I want to tell you he was a great, great problem. Tell you he was a great, great problem, tell you he was a great, great problem solver and they were spending so much solver and they were spending so much solver and they were spending so much money on and wasting it. They couldn't money on and wasting it. They couldn't money on and wasting it. They couldn't get any approval. And I went to the get any approval and I went to the get any approval and I went to the governor, we had a man, I won't mention governor. We had a man, I won't mention governor. We had a man, I won't mention his name, but he's very well known and he his name, but he's very well known and he his name, but he's very well known and he was totally against what I was doing. And was totally against what I was doing and was totally against what I was doing and he just wanted to build it in this one. He just wanted to build it in this one. He just wanted to build it in this one location which was a bad. You had to go location, which was a bad, you had to go location, which was a bad, you had to go through a Hell's Kitchen and you had to through a Hell's Kitchen and you had to through a Hell's Kitchen and you had to go under the West Side, Highway go under the West Side, Highway go under the West Side Highway, you had to build, ramps over the highway, you had to build, ramps over the highway. You had to build, ramps over the highway, you had no access. And on top of that, it - you had no access and on top of that it - you had no access. And on top of that, it was being built in the Hudson River and was being built in the Hudson River and was being built in the Hudson River. And you couldn't get any approvals other - you couldn't get any approvals other - you couldn't get any approvals. Other than that, it was a wonderful sight. And than that it was a wonderful sight. And than that it was a wonderful sight. And this guy, I won't mention his name, his this guy, I won't mention his name, his this guy. I won't mention his name. His name was Richard Ravich was totally New name was Richard Ravich was totally New name was Richard Ravich was totally New Yorkers know that name. He was so intent Yorkers know that name, he was so intent Yorkers know that name. He was so intent on building it and I was arguing with on building it and I was arguing with on building it and I was arguing with him and fighting. And I said, look, I have him and fighting and I said, look, I have him and fighting and I said, look, I have the - an option to the Westside railroad, the - an option to the Westside railroad, the an option to the Westside railroad yards. And I had it for this purpose, I yards and I had it for this purpose. I yards and I had it for this purpose. I did it with a Penn Central Company which did it with a Penn Central Company, which did it with a Penn Central Company which was in bankruptcy. And I said, look, this was in bankruptcy and I said, look, this was in bankruptcy and I said, look this, you don't have to go, it's on the proper, you don't have to go, it's on the proper, you don't have to go. It's on the proper side of the West Side, Highway, the site side of the West Side, Highway, the site side of the West Side Highway, the site is big, the site is good. We went up to is big, the site is good. We went up to is big, the site is good. We went up to Governor Kerry Governor, Kerry Governor, Kerry governor, Kerry appointed Ravich to head governor Kerry appointed Ravich to head governor Kerry appointed Ravich to head up this commission to build the up this commission to build the up this commission to build the Convention Center. And they were just Convention Center and they were just Convention Center and they were just about starting and I sat down, I'll never about starting and I sat down, I'll never about starting and I sat down, I'll never forget it. I sat down with governor, you forget it, I sat down with governor, you forget it, I sat down with governor you Kerry and his staff and he said Ravitz Kerry and his staff and he said Ravitz Kerry and his staff and he said Ravitz, you make the Case for your site and he you make the case for your site and he you make the case for your site and he made a case for 20 minutes and every made a case for 20 minutes and every made a case for 20 minutes. And every time he talked, it was just wrong, wrong time. He talked it was just wrong, wrong time. He talked it was just wrong, wrong, wrong, wrong, wrong. He said Donald, would you make the case? I he said Donald, would you make the case? I he said Donald, would you make the case? I made the case. It took me five minutes at made the case. It took me five minutes at made the case. It took me five minutes at the end of five minutes. He says not even the end of five minutes, he says not even the end of five minutes. He says not even close, totally change gears built it, got close, totally change gears, built it, got close, totally change gears, built it, got the approvals, quickly, got it, built it, the approvals quickly, got it, built it, the approvals quickly got it built, it was called the Jacob, Javits Convention was called the Jacob Javits Convention was called the Jacob Javits Convention Center and to this day it does wait so Center and to this day it does wait so Center and to this day it does wait. So we're happy about it. We're happy about it, we're happy about it. And then I built you know, many other and then I built you know many other and then I built you know, many other buildings all over the city. I mean I'm buildings all over the city. I mean, I'm buildings all over the city. I mean, I'm just listing some of them and because just listing some of them and because just listing some of them and because this one really was where, Sir this was this one really was where Sir this was this one really was where Sir, this was my First, this was my first - the Grand my first, this was my first - the Grand my first, this was my first the Grand Hotel and then little things like the Hotel and then little things like the Hotel and then little things like the Wollman Rink, seven years. The city, Wollman Rink, seven years, the city, Wollman Rink, seven years, the city couldn't fix an ice skating. Rinks couldn't fix an ice skating. Rinks couldn't fix an ice skating rinks probably. I think I became more famous probably. I think I became more famous probably. I think I became more famous because of the Waldman room they had for because of the Waldman room they had for because of the Waldman room they had for seven years, they couldn't build an seven years. They couldn't build an seven years. They couldn't build an ice-skating rink for seven years and I ice-skating rink for seven years and I ice-skating rink for seven years. And I had my daughter, Ivanka, she was very - it had my daughter Ivanka. She was very - it had my daughter Ivanka. She was very - it. Did anybody hear of Ivanka? Anybody, but did anybody hear of Ivanka? Anybody? But did anybody hear of Ivanka? Anybody? But she was a very young girl. She kept. She was a very young girl. She kept. She was a very young girl. She kept saying daddy daddy, can't we go saying daddy daddy, can't we go saying daddy daddy can't? We go ice-skating here after say you can't ice-skating here after say you can't ice-skating here after say you can't. They're building the rink. And finally, I - they're building the rink and finally I - they're building the rink. And finally, I went down, I looked and I saw 400 men in went down, I looked and I saw 400 men in went down. I looked and I saw 400 men in those cases was all men. I have to say those cases was all men. I have to say those cases was all men. I have to say today you have men and women as your today you have men and women. As your today, you have men and women as your construction people, which is great, but construction people, which is great, but construction people, which is great. But it was all men that 400 men sitting in, it was all men, that 400 men sitting in, it was all men, that 400 men sitting in the rink, not looking. And I came back a, the rink not looking and I came back a, the rink not looking and I came back a half hour later, they still weren't half hour later. They still weren't half hour later, they still weren't working. They were taking lunch breaks working. They were taking lunch breaks working. They were taking lunch breaks many, many times a day that nobody was many, many times a day that nobody was many, many times a day that nobody was working and they went out and they got working and they went out and they got working and they went Out - and they got from Miami Beach, a expert or an ice, but from Miami Beach, a expert or an ice, but from Miami Beach, a expert or an ice. But they meant - they meant - they meant refrigerators not to make ice. And I'll refrigerators not to make ice. And I'll refrigerators not to make ice, and I'll never forget sort of an interesting - never forget sort of an interesting, never forget sort of an interesting story. I hope it's interesting, but I got story. I hope it's interesting, but I got story. I hope it's interesting. But I got to tell it anyway because who Nell wants to tell it anyway because who Nell wants to tell it anyway, because who Nell wants to talk about politics all the time to talk about politics all the time to talk about politics all the time. Right? This politics gets a little boring, right? This politics gets a little boring, right? This politics gets a little boring. But what happened is I went to the mayor, but what happened is I went to the mayor. But what happened is I went to the mayor and said, listen, mr. mayor, Ed Koch I said and said, listen, mr. mayor, Ed Koch I said and said, listen, mr. mayor, Ed Koch, I said it's seven years now. It's going to be - it's seven years now. It's going to be - it's seven years now, it's going to be eight, nine, ten, they have eight, nine, ten, they have eight, nine, ten, they have idea, they use the thing called freon and idea. They use the thing called freon and idea. They use the thing called freon and that's a gas that goes through copper, that's a gas that goes through copper, that's a gas that goes through copper, piping, copper tubing. They had six miles, piping, copper tubing, they had six miles, piping, copper tubing. They had six miles of copper, it had a four inches apart and of copper it had a four inches apart and of copper it had a four inches apart and it was laid this massive rank. It's - it was laid this massive rank, it's - it was laid this massive rank, it's almost 90,000 square feet that's like almost 90,000 square feet. That's like almost 90,000 square feet. That's like big, big office floors, times three big, big, big office floors times three big, big, big office floors, times three big spots. You see, I run it, I've run it for spots. You see I run it, I've run it for spots. You see I run it. I've run it for many, many years. It's been such a submit' many, many years. It's been such a submit' many, many years. It's been such a submit' tremendous place, but they had the freon tremendous place. But they had the freon tremendous place, but they had the freon and it was laid four inches miles of it and it was laid four inches miles of it and it was laid four inches miles of it. And every time they put this beautiful and every time they put this beautiful and every time they put this beautiful copper down single time, the next night copper down single time, the next night copper down single time, the next night people would steal it. So they kept - people would steal it, so they kept people would steal it. So they kept putting it down, kept getting so putting, putting it down, kept getting so putting, putting it down, kept getting so putting it down, kept getting so then they put it down, kept getting. So then they put it down, kept getting. So then they put the police force around and it was fine, the police force around and it was fine, the police force around and it was fine until the police force decided to go to until the police force decided to go to until the police force decided To go to lunch, it was well stolen lunch, it was well stolen lunch, it was well stolen, so they were losing millions of dollars. So they were losing millions of dollars. So they were losing millions of dollars. They were actually in for 22 million. They were actually in for 22 million, they were actually in for 22 million dollars and they had nothing and I went dollars and they had nothing and I went dollars and they had nothing. And I went to see Ed Koch and he said I'm not gonna to see Ed Koch and he said I'm not gonna to see Ed Koch and he said I'm not gonna let you do it. And then I went to see - let you do it and then I went to see - let you do it. And then I went to see some of the newspapers. I went to the - some of the newspapers, I went to the - some of the newspapers, I went to the editorial boards, I said the mayor won't editorial boards. I said the mayor won't editorial boards. I said the mayor won't let us do it. I can fix this thing, I'll let us do it. I can fix this thing. I'll let us do it. I can fix this thing. I'll do it in six months to a year and you're do it in six months to a year and you're do it in six months to a year and you're gonna be years and years and they don't gonna be years and years and they don't Gon na be years and years and they don't know what they're doing and they're know what they're doing and they're know what they're doing and they're spending a fortune. And I'll never forget spending a fortune and I'll never forget spending a fortune. And I'll never forget, I went to two editorial boards, New York, I went to two editorial boards, New York, I went to two editorial boards, New York Times and the other one I won't say Times and the other one I won't say Times. And the other one I won't say because they don't like the penguin, but because they don't like the penguin, but because they don't like the penguin. But I do like the New York Post. I do like the New York Post. I do like the New York Post. I do like the New Yorkers and they did. I do like the New Yorkers and they did. I do like the New Yorkers and they did editorial said you have to let him do it. Editorial said you have to let him do it. Editorial said, you have to let him do it. You have to let him do it. You have to let him do it. You have to let him do it anyway. They let me do it. I took over the - anyway they let me do it. I took over the - anyway they let me do it. I took over the project and a lot of people said well it project and a lot of people said well it project and a lot of people said, well, it was built, it wasn't built. It was the - the was built, it wasn't built, it was the - the was built, it wasn't built, it was the - the concrete was poured, it was nine inches, concrete was poured, it was nine inches. Concrete was poured, it was nine inches higher on one side than the other side, higher on one side than the other side, higher on one side than the other side. So when you poured the water, you had a - so when you poured the water, you had a - so when you poured the water, you had a big swimming pool here and this one that big swimming pool here and this one that big swimming pool here. And this one that none, it was just a mess and the one was none, it was just a mess and the one was none. It was just a mess and the one was so deep, you couldn't freeze it because so deep you couldn't freeze it because so deep you couldn't freeze it because it was too much. So I had to rip out the - it was too much. So I had to rip out the - it was too much, so I had to rip out the entire slab and the slab was a foot to entire slab and the slab was a foot to entire slab and the slab was a foot to half thick. It only had it before inches half thick. It only had it before inches half thick. It only had it before inches. So we ripped it and we did. And I - so we ripped it and we did. And I - so we ripped it and we did. And I finished it in four months and I said if finished it in four months and I said if finished it in four months and I said if it cost any more than two million, it cost any more than two million it cost any more than two Million dollars, because it's a great government dollars because it's a great government dollars because it's a great government. You know they study this at the Wharton, you know, they study this at the Wharton. You know, they study this at the Wharton School. They study it at Harvard because School - they study it at Harvard because School - they study it at Harvard because it's the difference maybe between the - it's the difference maybe between the - it's the difference maybe between the public sector and the private sector, public sector and the private Sector public sector and the private sector, I went in fig, you know it's really been - I went in fig, you know it's really been - I went in fig, you know it's really been to this day, it's a great case study I to this day it's a great Case study I to this day, it's a great case study I went in and we did a job like you went in and we did a job like you went in and we did a job like you wouldn't believe, wouldn't believe, wouldn't believe we took out that Horrible big, massive, we took out that horrible, big, massive. We took out that horrible, big, massive slab of concrete. We leveled it out, but slab of concrete, we leveled it out. But slab of concrete, we leveled it out. But most importantly, I said to the people, most importantly, I said to the people, most importantly, I said to the people what's with this freon, I hear they're what's with this freon. I hear they're what's with this freon. I hear they're losing millions of dollars of copper, losing millions of dollars of copper, losing millions of dollars of copper tubing all the time. What is it? And I tubing all the time, what is it and I tubing all the time, what is it? And I said who are the people and they said? Said who are the people and they said, said who are the people and they said, well, it's an air conditioning firm from well, it's an air conditioning firm from well, it's an air conditioning firm from Miami. I said from Miami, what do we - I - Miami I said from Miami, what do we - I Miami I said from Miami, what do we - I don't want ice from Miami, so I called up, don't want ice from Miami. So I called up, don't want ice from Miami. So I called up a friend of mine who is a part owner of a friend of mine who is a part owner of a friend of mine who is a part owner of the Montreal Canadiens. Now we're talking the Montreal Canadiens, now we're talking the Montreal Canadiens, now we're talking right ice, I said would you do me a favor, right? Ice I said would you do me a favor, right? Ice I said, would you do me a favor? Do you have anybody that knows how to do you have anybody that knows how to do you have anybody that knows how to make ice for an ice skating rink ease, make ice for an ice skating rink ease, make ice for an ice skating rink ease that I have the greatest guy in the - that I have the greatest guy in the - that I have the greatest guy in the world. I said, could I talk to him please? World I said, could I talk to him please? World I said, could I talk to him please and he came to New York and he saw me, he and he came to New York and he saw me, he and he came to New York and he saw me, he said this is crazy, said this is Crazy said, this is crazy. He said mr. Trump, they're gonna have he said, mr. Trump, they're gonna have he said, mr. Trump, they're gonna have five miles of this piping. If there's a five miles of this piping, if there's a five miles of this piping, if there's a little pin, oh, because it's gas for young little pin, oh, because it's gas for young little pin oh, because it's gas for young guess. If there's a little pinhole than guess, if there's a little pinhole than guess if there's a little pinhole than five miles, it's - it's dead. He said you five miles, it's - it's dead. He said you five miles, it's - it's dead. He said you don't want that. You want rubber hose and don't want that. You want rubber hose and don't want that. You want rubber hose and you want water and in the water you put, you want water and in the water you put, you want water and in the water you put salt. So it doesn't freeze, I said boy, salt, so it doesn't freeze. I said boy, salt. So it doesn't freeze. I said boy, that sounds good. And I went out and we - that sounds good and I went out and we - that sounds good and I went out and we bought it for just a tiny amount of bought it for just a tiny amount of bought it for just a tiny amount of money. And it was rubber hose every four money and it was rubber hose every four money and it was rubber hose every four inches. But it's rubber hose, we got the inches, but it's rubber hose, we got the inches, but it's rubber hose. We got the equipment, it's called brine, they call it equipment, it's called brine, they call it equipment, it's called brine, they call it brine. And we did the rubber hose, nobody brine and we did the rubber hose, nobody brine and we did the rubber hose. Nobody stole the rubber hose. Nobody wanted. We stole the rubber hose. Nobody wanted. We stole the rubber hose. Nobody wanted. We didn't need - we didn't need - security, didn't need, we didn't need security, didn't need, we didn't need security, nobody sold the rubber hose and we - nobody sold the rubber hose and we - nobody sold the rubber hose and we opened it up and what it was the most Opened it up and what it was the most opened it up and what it was the most amazing thing. We put the rubber hose amazing thing. We put the rubber hose amazing thing. We put the rubber hose down, we tested it, there wasn't a leak in down. We tested it, there wasn't a leak in down, we tested it. There wasn't a leak in the whole thing, 6.2 miles of rubber hose, the whole thing 6.2 miles of rubber hose, the whole thing 6.2 miles of rubber hose. Can you believe it? That's a lot. That's a - can you believe it? That's a lot. That's a - can you believe it? That's a lot. That's a - was it a leak. Now what happened is we - was it a leak. Now what happened is we was it a leak. Now what happened is we put the concrete over, we had concrete up put the concrete over, we had concrete up put the concrete over, we had concrete up to Harlem. Now my - all of my construction to Harlem, now my all of my construction to Harlem, now my - all of my construction friends in that corner, in fact they all friends in that corner. In fact they all friends in that corner. In fact, they all have the worst seats. I don't know why have the worst seats. I don't know why have the worst seats. I don't know why construction guys usually have the best construction guys usually have the best construction guys usually have the best seats, but they understand what I'm seats. But they understand what I'm seats. But they understand what I'm talking about because we wanted to talking about because we wanted to talking about because we wanted to contiguous for because the city used to contiguous for because the city used to contiguous for because the city used to pour ten feet come back. A week later, pour ten feet come back a week later, pour ten feet come back a week later, pour another ten feet and yet all these pour another ten feet and yet all these pour another ten feet and yet all these blocks got you want a contiguous Well, we blocks got - you want a contiguous well, we blocks got, you want a contiguous well. We had all the way back to Harlem. We had had all the way back to Harlem. We had had all the way back to Harlem. We had trucks and the most amazing thing trucks and the most amazing thing trucks and the most amazing thing and they poured - it took two days to pour and they poured. It took two days to pour and they poured. It took two days to pour the slab. We actually made it six inches, the slab. We actually made it six inches the slab. We actually made it six inches because that's better and we turned on because that's better and we turned on because that's better. And we turned on and we put two inches of water on top of and we put two inches of water on top of - and we put two inches of water on top of this slab and they made lasers. It was this slab and they made lasers. It was this slab and they made lasers. It was such a perfect slab to this day. It's such a perfect slab to this day. It's such a perfect slab to this day. It's perfect. They then put the water on top. I perfect. They then put the water on top, I perfect, they then put the water on top, I said try it because this thing hadn't said try it because this thing hadn't said try it because this thing hadn't had ice in nine years. I should try it had ice in nine years, I should try it had ice in nine years, I should try it. And in two hours with the most beautiful and in two hours with the most beautiful and in two hours with the most beautiful ice just like the Montreal Canadiens and ice, just like the Montreal Canadiens and ice, just like the Montreal Canadiens. And we had over and we had our - so - so I've - we had over and we had our - so - so I've - we had over and we had our - so - so I've had a lot of fun with New York and we had a lot of fun with New York And we had a lot of fun with New York and we did another job recently in the Bronx, did another job recently in the Bronx did another job recently in the Bronx where was the same thing where they had where was the same thing where they had - Where was the same thing where they had you know, ferry point, yeah, you know what you know, ferry point, yeah, you know what you know, ferry point, yeah, you know what I'm talking about, I'm talking about I'm talking about ferry point was under construction for ferry point Was under construction for ferry point was under construction for 26 years. I mean people say, give me a 26 years, I mean people say give me a 26 years, I mean people say, give me a break 26. The only reason, I don't say 32 break 26, the only reason I don't say 32 break 26. The only reason I don't say 32 is because that can't be proven 26 years is because that can't be proven 26 years is because that can't be proven 26 years. It ended up costing hundreds of millions. It ended up costing hundreds of millions. It ended up costing hundreds of millions of dollars. Nobody knows what the price of dollars, nobody knows what the price of dollars, nobody knows what the price is. Michael, Bloomberg said, could you do is - Michael, Bloomberg said, could you do is Michael Bloomberg said, could you do me a favor? Could you look at this? It's a me a favor. Could you look at this? It's a me a favor. Could you look at this? It's a disaster, it's been under construction disaster, it's been under construction disaster. It's been under construction for so many and he was embarrassed and for so many and he was embarrassed and for so many and he was embarrassed and it's a very big golf project designed by it's a very big golf project designed by it's a very big golf Project designed by Jack Nicklaus and you know many, many Jack Nicklaus and you know many, many Jack Nicklaus and you know many, many iterations. But I got it built in one iterations. But I got it built in one iterations, but I got it built in one year and it's open today and greatly year and it's open today and greatly year and it's open today and greatly successful. So for peanuts, when I say successful, so for peanuts, when I say successful, so for peanuts, when I say open, am I right? That's the woman right open, am I right? That's the woman right open, am I right? That's the woman right there. She's probably under a my right there. She's probably under a my right there. She's probably under a - my right thank you, darling. I appreciate it very thank you, darling. I appreciate it very thank you, darling. I appreciate it very nice. I don't know who else she is. I know nice, I don't know who else she is. I know nice. I don't know who else she is. I know she's not a protester. She's on my side. She's not a protester. She's on my side. She's not a protester. She's on my side and she's certainly not a pain, I'll tell, and she's certainly not a pain, I'll tell. And she's certainly not a pain. I'll tell you what you take a look outside these you what you take a look outside these you what you take a look outside, these are paid protesters folks. They've got are paid protesters folks. They've got are paid protesters folks. They've got the most beautiful signs made from a - the most beautiful signs made from a - the most beautiful signs made from a factory there. We'll print it out, they factory there. We'll print it out, they factory there, we'll print it out, they hand it instead if you want any hand it instead if you want any hand it instead if you want any information on the sign, please call this information on the sign. Please call this information on the sign. Please call this number what kind of crap we want if number, what kind of crap we want if number, what kind of crap we want if they're real protesters. We want those, they're real protesters. We want those, they're real protesters. We want those signs made in the basement anyway, so signs made in the basement anyway. So signs made in the basement anyway. So then we've done many jobs since then and then we've done many jobs since then. And then we've done many jobs since then and it's just a great city. It's a vibrant - it's just a great city, it's a vibrant, it's just a great city, it's a vibrant city, an amazing city. We have to be city, an amazing city. We have to be city an amazing city. We have to be careful. Our mayor has to be careful, careful. Our mayor has to be careful, careful. Our mayor has to be careful because he can blow it very quickly if because he can blow it very quickly if because he can blow it very quickly if he keeps going the way he's going not - he keeps going the way he's going not - he keeps going. The way he's going not doing good, we doing good, we doing good. We better be careful, mr. mayor. But we have better be careful, mr. mayor. But we have better be careful, mr. mayor. But we have a city that outlasts the mayor's it out, a city that outlasts the mayor's it out, a city that outlasts the mayor's it out lasts. Everybody's got out last us. It's lasts. Everybody's got out last us. It's lasts. Everybody's got out last us. It's one of the great, great cities of the - one of the great, great cities of the - one of the great, great cities of the world and it's called Whitehouse. Is it - why won't you stop Whitehouse? Is it - why won't you stop Whitehouse? Is it - why won't you stop disrespected about New York values disrespected about New York values disrespected about New York values become a things down, but it's just one become a things down, but it's just one become a things down. But it's just one of those things. I said, you know, I talked of those things I said, you know, I talked of those things I said, you know I talked tonight about New York values that we tonight about New York values that we tonight about New York values that we all many of us That we all know so well all many of us that we all know so well all many of us that we all know so well. The values that make us love this thing, the values that make us love this thing, the values that make us love this thing, which has been a symptom of American, which has been a symptom of American, which has been a symptom of American strength throughout the world. No matter strength throughout the world, no matter strength throughout the world, no matter where you go. They love noodles. You know where you go. They love noodles. You know where you go. They love noodles. You know you can be from lots of other places and you can be from lots of other places and you can be from lots of other places. And if you want to see somebody, you just - if you want to see somebody, you just - if you want to see somebody you just said, what are you coming to New York said, what are you coming to New York said, what are you coming to New York Villas come, everybody comes to New York, villas come, everybody comes to New York, villas come, everybody comes to New York. Eventually this is nothing like it. So eventually this is nothing like it. So eventually this is nothing like it. So when we talk about values, what are we - when we talk about values, what are we - when we talk about values, what are we seeing? New York values we see are really seeing New York values we see are really seeing New York values we see are really, really incredible when you look at really incredible when you look at really incredible when you look at September 11th, especially New York, September 11th, especially New York, September 11th, especially New York Police and New York firefighters Police and New York firefighters Police and New York firefighters, b-brother you see are unbelievable. And b-brother you see are unbelievable. And b-brother you see are unbelievable and they keep those strains going. And those - they keep those strains going and those - they keep those strains going and those buses and everything else. But we see our buses and everything else, but we see our buses and everything else. But we see our transit workers and what they went, transit workers and what they went, transit workers and what they went through when September 11th was through when September 11th was through when September 11th was incredible, incredible, incredible. We see families playing in Central Park. We see families playing in Central Park. We see families playing in Central Park, thousands and thousands of families with thousands and thousands of families with thousands and thousands of families with their children, some without children, their children, some without children, their children, some without children, some together. Some not together, but we some together, some not together, but we some together, some not together. But we see people in Central Park and people see people in Central Park and people see people in Central Park and people playing in Central Park. We see playing in Central Park, we see playing in Central Park. We see restaurant workers all over the city in restaurant workers all over the city in restaurant workers all over the city in delis and factory workers in upstate New delis and factory workers in upstate New delis and factory workers in upstate New York, York, York. Unfortunately, I've spent a lot of time. Unfortunately, I've spent a lot of time. Unfortunately, I've spent a lot of time in upstate New York and those factory in upstate New York and those factory in upstate New York and those factory workers are rapidly, rapidly leaving. Our workers are rapidly, rapidly leaving. Our workers are rapidly, rapidly leaving our state and we can't let that happen state and we can't let that happen state and we can't let that happen. And we have a whole fabric of our - and we have a whole fabric of our - and we have a whole fabric of our community. So what are New York values community? So what are New York values community? So what are New York values? Because you know people are disputing because you know people are disputing because you know people are disputing. I'm not disputing and the New Yorkers I'm not disputing and the New Yorkers I'm not disputing and the New Yorkers are disputing. And most people that know are disputing. And most people that know are disputing and most people that know to New York and of what - what we've done to New York and of what - what we've done to New York and of what - what we've done when you look at what happened with when you look At what happened with - when you look at what happened with September 11th, the job that this city September 11th, the job that this city September 11th, the job that this city has done and the people of the city have - has done and the people of the city Have has done and the people of the city have done is beyond what anyone's ever single done is beyond what anyone's ever single done is beyond what anyone's ever single and you say what are they your fellows and you say, what are they your fellows and you Say what are they? Your fellows, number one, honesty and straight talking number one, honesty and straight talking number one, honesty and straight talking, honesty, you better, believe it, honesty, you better, believe it, honesty, you better, believe it. It's a worker hard-working people. It's - it's a worker hard-working people. It's - it's a worker hard-working people. It's about family. New York, believe it is about family. New York, believe it is about family. New York believe it is about family. So important. It's the about family. So important. It's the about family. So important, it's the energy to get things done, energy to get things done, energy to get things done. Big energy, if Jeb Bush came here, I'm big energy. If Jeb Bush came here, I'm big energy. If Jeb Bush came here, I'm telling you we have much more energy telling you. We have much more energy telling you. We have much more energy that has led felon. He should move to New that has led felon. He should move to New. That has led felon. He should move to New York, right? We're business, we make things York, right? We're business, we make things York, right? We're business, we make things happen. That's so important we make happen. That's so important we make happen. That's so important. We make things happen and it's church. And things happen and it's church and things happen and it's church and community service because this community service, because this community service, because this tremendous community service, New York, tremendous community service, New York, tremendous community service, New York values, one display for all to see in the Values one display for all to see in the values one display for all to see in the aftermath of 9/11, a strike at the heart aftermath of 9/11, a strike at the heart aftermath of 9/11, a strike at the heart of our city and our nation. In our of our city and our nation in our of our city and our nation in our darkest moments as the city, we showed darkest moments as the city. We showed darkest moments as the city. We showed the world the very, very best in terms of the world, the very, very best in terms of the world, the very, very best in terms of bravery and the heart and soul that we bravery and the heart and soul that we bravery and the heart. And soul that we have in America, the firefighters and first responders, the firefighters and first responders, the firefighters and first responders and the police officers and the Port and the police officers and the Port and the police officers and the Port Authority workers who ran up those Authority workers who ran up those Authority workers who ran up those stairs stairs stairs, those are New York values and those that - those are New York values and those that - those are New York values. And those that New Yorker bad news, New Yorker, bad news, New Yorker, bad news, I'm not sure she seriously father Mychal. I'm not sure she seriously father Mychal. I'm not sure she seriously father Mychal judge chaplain to the New York City Fire judge chaplain to the New York City Fire judge chaplain to the New York City Fire Department who you know died and an Department who you know died and an Department who you know Died and an amazing guy who I knew a little bit, who amazing guy, who I knew a little bit, who amazing guy, who I knew a little bit, who a lot of people do very well, who, Rudy, a lot of people do very well, who, Rudy, a Lot of people do very well, who Rudy Giuliani really knew very well, but you Giuliani really knew very well, but you Giuliani really knew very well. But you look at father judge, and I'll tell you, look at father judge and I'll tell you, look at father judge and I'll tell you what that was. Some guy and he went up what that was some guy and he went up what that was some guy and he went up there to pray and he knew what was going there to pray and he knew what was going there to pray and he knew what Was going to happen and he died and he died to happen and he died and he died to happen and he died. And he died praying and taking care of people and he praying and taking care of people and he praying and taking care of people. And he was an amazing guy. The people in the - was an amazing guy. The people in the - was an amazing guy, the people in the towers who helped rescue each other towers who helped rescue each other towers who helped rescue each other. Those are those of New York values, the - those are those of New York values. The - those are those of New York values. The restaurants and local businesses who restaurants and local businesses who restaurants and local businesses who kept their shops open to help everybody kept their shops open to help everybody kept their shops open to help everybody during this incredible time. Those are during this incredible time. Those are during this incredible time. Those are the real values everyone who helped the real values, everyone who helped the real values, everyone who helped clear the rubble and the rescue, the clear the rubble and the rescue, the clear the rubble and the rescue, the injured. Those are New Yorkers, every injured, those are New Yorkers, every injured, those are New Yorkers, every small act of kindness, every great act of small act of kindness, every great act of small act of kindness, every great act of courage of which there were so many courage Of which there were so many courage of which there were so many, there's never been anything like this. There's never been anything like this. There's never been anything like this. This was the greatest attack and the - this was the greatest attack and the - this was the greatest attack and the worst and most horrific attack in the worst and most horrific attack in the worst and most horrific attack in the history of our country. Far greater than history of our country, far greater than history of our country, far greater than Pearl Harbor because the attack was on Pearl Harbor because the attack was on Pearl Harbor because the attack was on civilians. It wasn't on the military it civilians. It wasn't on the military it civilians, it wasn't on the military, it was under civilians, but those are New was under civilians, but those are New was under civilians, but those are New York values and these are the values York values and these are the values York Values and these are the values that we need to make America great again that we need to make America great again that we need to make America great again. We need to these values to bring America, we need to these values to bring America, we need to. These values to bring America together again and to heal Americans together again and to heal Americans together again and to heal Americans wounds again. So I just want to tell you wounds again, so I just want to tell you wounds again. So I just want to tell you that I am so proud to do with you that I am so proud to do with you that I am so proud to do with you tonight. I am so proud to be discussing tonight. I am so proud to be discussing tonight. I am so proud to be discussing all sorts of topics, but most importantly all sorts of topics, but most importantly all sorts of topics. But most importantly, New York values because no matter where New York values, because no matter where New York values, because no matter where go anywhere in the world, they talk in, go anywhere in the world. They talk in, go anywhere in the world. They talk in the most positive tones about what all the most positive tones about what all the most positive tones about what all of us have done. So of us have done so of us have done so ladies and gentlemen, have a great dinner. Ladies and gentlemen, have a great dinner, ladies and gentlemen, have a great dinner. We're going to have an amazing election. We're going to have an amazing election. We're going to have an amazing election coming up. We're having some really great coming up. We're having some really great coming up. We're having some really great primaries. It's been a lot of fun for me, primaries. It's been a lot of fun for me, primaries. It's been a lot of fun for me. You know what's it supposed to be this, you know, what's it supposed to be this, you know, what's it supposed to be this way. A lot of people said, well, what do way a lot of people said, well, what do way a lot of people said, well, what do you know I've been dealing with, you know, I've been dealing with, you know, I've been dealing with politicians all my life. So I think I politicians all my life, so I think I politicians all my life. So I think I know something, but it's been a great know something, but it's been a great know something, but it's been a great, great experience. I'm right now millions great experience. I'm right now millions great experience. I'm right now millions of votes ahead of my closest rival of votes ahead of my closest rival of votes ahead of my closest rival. Millions of us, you know, people don't millions of us, you know, people don't millions of us. You know, people don't talk about books anymore, talk about books anymore, talk about books anymore. They talk delegates. I by the way I they talk delegates I by the way I they talk delegates. I - by the way, I happen to be hundreds of Delegates ahead, happen to be hundreds of Delegates ahead, happen to be hundreds of Delegates ahead too. But I'm - you know, to me so important too, but I'm - you know, to me so important too, but I'm - you know, to me so important, I'm millions of votes ahead of my next, I'm millions of votes ahead of my next. I'm millions of votes ahead of my next year's oh, and we have thank you. Thank year's oh and we have thank you. Thank year's oh and we have. Thank you. Thank you. Though millions of votes. You though millions of votes. You though millions of votes. We have 22, 6, 22 states and it started by - we have 22, 6, 22 states and it started by - we have 22, 6, 22 states. And it started by the way, with New Hampshire. We went down the way with New Hampshire. We went down the way with New Hampshire, we went down to South Carolina states that I wasn't to South Carolina states that I wasn't to South Carolina states that I wasn't supposed to win and I ended up winning, supposed to win and I ended up winning supposed To win, and I ended up winning in a landslide: Alabama, Arkansas, Kentucky in a landslide; Alabama, Arkansas, Kentucky; in a landslide; Alabama, Arkansas, Kentucky. The south, I may move to the south of New, the south, I may move to the south of New, the south. I may move to the south of New York as a treat as well because I'll York as a treat as well because I'll York as a treat as well because I'll tell you this South has been so great to tell you this South has been so great To tell you this South has been so great to me and then we went to Florida where you me and then we went to Florida where you me and then we went to Florida where you know it's my second home. This is my know. It's my second home. This is my know. It's my second home. This is my first home. It's my second home and we first home, it's my second home and we first home, it's my second home, and we did so unbelievably won in a landslide, did so unbelievably won in a landslide, did so unbelievably won in a landslide by 20 points. And it was an absolute by 20 points, and it was an absolute by 20 points. And it was an absolute landslide. And now we have something landslide, and now we have something landslide. And now we have something happening that's going to be very happening. That's going to be very happening. That's going to be very exciting. The next four or five weeks are exciting. The next four or five weeks are exciting. The next four or five weeks are going to be very excited and we start going to be very excited and we start going to be very excited and we start what bring it on, what bring it on, what bring it on. Thank you. And we start on Tuesday. Thank you. And we start on Tuesday. Thank you. And we start on Tuesday, soaping. And you know the interesting soaping and you know the interesting soaping and you know, the interesting thing is with all the primers that we've thing is with all the primers that we've thing is with all the primers that we've been through years and years and years been Through years and years and years been through years and years and years of primer of primer of primer, sort of either over or not very sort of either over or not very sort of either over or not. Very important by the time they get to New important by the time they get to New, important by the time they get to New York, right? New York is so important. It's York, right? New York is so important. It's York, right? New York is so important. It's so important like New York should be so, so important like New York should be so. So important like New York should be so important and I see what's happening and important and I see what's happening and important and I see what's happening and I see the polls coming in and I'm - so I see the polls coming in and I'm - so I see The polls coming in and I'm so honored because the people that know me honored because the people that know me honored because the people that know me best are the people from New York best are the people from New York best are the people from New York. They're the ones that really know me, so they're the ones that really know me. So they're the ones that really know me. So when I'm up 42 points, if they're 42, when I'm up 42 points, if they're 42, when I'm up 42 points, if they're 42 points, that's a lot. But when I'm up 42 points, that's a lot. But when I'm up 42 points, that's a lot. But when I'm up 42 and 44 points in the newest Falls, that's - and 44 points in the newest Falls, that's and 44 points in the newest Falls. That's such an honor because those are the such an honor because those are the such an honor because those are the people that know me best. So I think people that know me best. So I think people that know me best. So I think we're gonna have a really exciting next. We're gonna have a really exciting next. We're gonna have a really exciting next four or five weeks. I think we're gonna four or five weeks. I think we're gonna four or five weeks. I think we're gonna have a great time in Cleveland, hopefully have a great time in Cleveland. Hopefully have a great time in Cleveland. Hopefully not too good of time because by that not too good of time because by that not too good of time because by that time it should be solved by the time we enjoy the hotel, enjoy this great, great, enjoy the hotel, enjoy this great, great. Enjoy the hotel enjoy this great, great city and it's an honor to be with you city and it's an honor to be with you city and it's an honor to be with you tonight. Thank you very much everybody."}