{"id":411,"author":"Donald Trump","title":"Speech: Donald Trump in Rome, NY","date":"2016-04-12","link":"https://factba.se/transcript/donald-trump-speech-rome-ny-april-12-2016","paragraphs":["Thank you, everybody. Thank you. We love you. We love this area. Many, many friends up here, folks. And we've been -- in terms of the state, we've all been suffering together. You know that, right? But it is going to change. And we apologize for airplane hangers, but they're the only things that hold our crowds because something's going on. The fact is there's a movement going on and it's happening all over the country and it's people like yourselves, and we're going to turn our country around.","We're going to take our jobs back because they're going, they're going by the thousands every single week. And they're going to China and they're going to Mexico and they're going to any country that touches us with a trade deal because our negotiators have no idea whatsoever what they're doing, OK? So we're going to turn it around and we're going to turn it around very quickly.","I just, you know, in coming up, I wanted to read -- do you mind if I take this coat off, do you mind? All right. Come on. There's so many warm people, they're warm, they're warm and we will not use Carrier air conditioning to cool it down because they're moving to Mexico. We're not going to use them, right?","Not gonna use them. But you know, I did some a glitter work in the area and I'll tell you what, not good. But it's going to be good. Don't leave, don't leave, don't leave for warmer climates. You know, I won Florida by a lot and I love Florida. But don't leave for Florida. We're going to bring it back. Don't leave, OK? But listen to this.","Your county has lost 60% of its manufacturing jobs since 1980, 6%. According to the Bureau of Labor Statistics, the Utica Rome region has lost more than half of its manufacturing jobs since 1990. Now more than half, folks. Factors: NAFTA, which was, as you know, voted on by a certain person that's running.","We won't mention names. Voted on by somebody. The Asian currency manipulation, which I've been talking about for a long time and nobody even understands it but me. It's called devaluation and China entrance into the World Trade Organization has been a total disaster for you and for this region. So listen to this, according to Labor Bureau Statistics, Utica Rome region lost nearly 40% of its manufacturing jobs since 2001. What's going on? Is anybody working up here?","We got to change this. All right, it's terrible. Total private employment has shrunk nearly 10% in a short period of time. Medium household, this is something, median household income in New York state today is $3,700 less per year than it was in 1989, inflation adjusted. Folks, what the hell is going on? We're gonna bring it back.","We're gonna bring it back. New York State has lost three out of four, think of that, three out of every four manufacturing jobs that existed in 1960 is gone. That's right. I agree with you. But I'm not allowed -- I'm not allowed to use that term. If I use that term, the dishonest press does a big number, so I can't do it. Shout out whatever you want, I'll just say, I agree, all right?","Cruz support TPP and they support giving Obama more trading authority. This TPP, by the way, and fast track trading is a total disaster for this area and for our country and they're in favor of it and I'm against it. And boy, am I right. It's going to make NAFTA look like a baby. It's worse than NAFTA, and you better make sure your politicians don't approve it. When I get in office, I'll do real trade deals where we're going to bring our jobs back.","Just rely on it, folks. All right, rely on it. Rely on it. So -- but isn't that amazing? I said, give me a little information on the area. I know the area well. I thought you were doing better than that. So here's the story. I was just talking to some of the very talented reporters backstage and you know the system, folks, is rigged.","It's a rigged system. Now, you have to understand, I'm not complaining about the states that I won. Those are OK, of which I won I think 22 and Cruz won 10. Did you ever hear him say, I'm the only one -- remember lying Ted Cruz, lying Ted, has the Bible up here puts it down. He's a liar. Oh boy, does he lie.","But the system's rigged. And I'll tell you what, when you look at Colorado and people could say, oh well, that's the way the game is played. Look, they should have had an election. They didn't have an election. That system is set up so that the crooked politicians can make sure they get somebody in that's not, you know, part of what we're doing.","This is a movement, folks. I've self funding my campaign. They hate it. They hate it. They don't want me to self fund my campaign. They don't want it because you know what? They're all controlled by their special interests. They're all controlled by their lobbyist, 100%. So when it comes time to making trade deals, military deals, any deals, the lobbyist goes this, you can't do this.","This guy gave you a million dollars. This guy gave you $10 million. This group or this country gave you $5 million. You can't do it. And they said, OK, I won't do it with me. They didn't give me anything, folks, OK? I'm working for you. I'm working for you. So I our Republican system, our republican system is absolutely rigged.","It's a phony deal. Now, what do I know? I started running like nine months ago. Who would have thought I would have been in first place? What do I know, right? What do I know? But I'm in first place by a lot, millions and millions of votes. That doesn't count. You noticed? Nobody even talks about votes. I have millions of votes more, but I also have hundreds of delegates more.","But that's not the same thing to me. I think the vote is the thing that you count, right? The vote. And you look at some of these systems where the people that devised them and this had to do with Ron Paul, it had to do with a hole, they wanted to keep people out. This was a dirty trick. These are dirty tricksters.","This is a dirty trick. And I'll tell you what, the RNC, the Republican National Committee, they should be ashamed of themselves for allowing this kind of crap to happen. I can tell you that. They should be ashamed of themselves because it has nothing to do with democracy. They took the votes away from the people in Colorado.","People are burning up their Republican cards because they want to vote. And you got to see what's happening out there. It's actually a thing of beauty, if you want to know the truth because they're not going to take it. And they may -- it may be shoved down their face and who knows, but you know what, they're fighting and they're all over the place and they're angry.","Their votes have been taken away. We've already been disenfranchised because you look at what's going on. Because if you think about it, the economy is rigged, the banking system is rigged, there's a lot of things that are rigged in this world of ours and that's why a lot of you haven't had an effective wage increase in 20 years, folks.","And we're going to change it. We're going to change it. Gonna change it fast. So I'm no fan of Bernie Sanders, right? Believe me. Well, though, we do have one thing in common. What's the one thing? We actually do. Trade. He knows we're being ripped off and I know we're being ripped off. We're being ripped off, big league.","The difference is I'll make unbelievable deals and he doesn't know what to do. He just knows we're being ripped off. But Bernie Sanders, I will say this, for the last five weeks, you turn on the television. Sanders wins. Sanders wins. Again, Sanders wins like seven or eight or nine. He keeps winning. And then you listen to the people and the pundits and they say, he has no chance of winning.","I said, what's going on? Because you have superdelegates -- by the way, I think the Republicans have a worse system than the Democrats but they have superdelegates. It makes it impossible for a guy that wins to win. It's a crooked system, folks. It's a crooked system. It really is a crooked system. You know, again, I don't care who wins over there.","I'll take on either one of them. I sort of had my heart set on Hillary, to be honest with you. And her whole life, remember this, her whole life has been one big lie. It's been one big lie. And you go back and you look at Whitewater and you look at her cattle deal. Remember the cattle, she made the highest percentage practically in the history of cattle making.","I wonder why that happened, folks. But you take a look and now you look at this horrible scandal with e-mails where she's probably being protected, probably being protected because people that did 5% of what she did have had their lives destroyed and her life is just fine. It looks like she'll be the candidate.","And in a certain way, that's really the one I want to run against. We will beat her so badly beat her, we'll beat her badly. You know, when Ronald Reagan -- I mean I've had some nice polls, but when Ronald Reagan -- don't forget I have 17 people coming at me and they said, please, please, darling, my wife and my daughter, Ivanka.","Daddy, please, be more presidential. I said, wait a minute, wait a minute, I got 17 people throwing barbs at me. I got to take him out before I become presidential don't I, right? You know, they mean be nice and we can't be nice until they have -- we have two leftovers right now. We can't be nice, we can't be nice until we win it. And you know, when I first started, Jeb Bush had it made.","He was gonna win. He was presumptive. You know, in Florida, you speak about unfair. I got to tell you, you speak about what's unfair. So in Florida, you had 99 delegates and Jeb Bush had it set. Jeb Bush or Rubio, both of them, they had it set so that the winner takes everything because they wanted to make sure that I didn't get anything.","And so it was all set. It was set in steel. 99 delegates winner gets all. And then the first poll came out, Trump, 48; Jeb, 16; Rubio, 12. And they said, oh, right? They said, oh, this is terrible. We got to change it. So they made a move to change it. When you get proportion, but it was too late. I said, no way you can do it. We put up a little bit of a ruckus.","But I will say this, so in Florida, it was set. So that I wouldn't get it and it was set winner take all because the governor was gonna get it. The past governor, who is pretty popular. The past governor or the future of the Republican Party, which was Marco, right? Now I wouldn't -- I want to be nice. Marco, only Marco.","No first name. We don't go any -- we don't do that anymore. You know why we don't do it anymore because we won. We don't do it. No, he's going to be Marco, who's a guy -- by the way, who's a nice guy. Marco is actually a nice guy. He went a little Don Rickles on me but then we went heavy Don Rickles back.","But Marco is a nice guy. And I'm sure Jeb is a nice guy. I didn't get to know him too well. He was too busy doing negative ads. The guy spent like $48 million on ads, many of them against me negative ads. But remember they did Florida and you remember the outcry when the first poll came out and I was close to 50 and they were in the teens and they said, wow, what are we going to do? And I ended up winning by 20 points, by 20. We had a -- it was a landslide.","It was a landslide. So you never know about the phony rules and regulations but hopefully, the RNC is gonna get with the people. The RNC hasn't won an important election in a long time. We've had Obama far too long. The last election should have been won except Romney choked like a dog. He choked. He went, I can't breathe, I can't breathe, he said.","Romney choked. I never saw anything -- well, let me tell you, George speech choked a little bit but you know what, he's going to recover. He's a great young guy and he's going to recover. Romney can't recover from a choke. That was an election that should have been won. That was an election that should have been won easily and for the last month he disappeared.","He went into a house and he just disappeared. What the hell happened to him? And so I backed -- who in all fairness had a tough time, I backed Romney. You wouldn't believe this but I actually backed him, raised a lot of money for him and other things and he failed. So McCain failed, Romney felt and I said, this time, we're going to do it ourselves, OK? We're going to do it this way.","So we'll see. But we're doing well. We won the South. In fact, I think I may have to move to the south if New York doesn't treat me great. I won Alabama. Think. Of this. I won -- did you see today, we won Missouri. Today, we won Missouri. We love Missouri. And I was a little worried about Missouri because lying Ted Cruz, his top guy is from Missouri.","So when I won -- that's right, lying Ted. So when I won remember with Ted, he comes with a Bible held high and he talks about the Bible, except the evangelicals like me better than they like Ted Cruz because they know what they get. We're gonna get strong military. We're gonna take care of our vets. We're going to get protect our Second Amendment.","We're going to have strong borders. We're going to repeal Obamacare and replace it with something great. They know. They know. By the way -- They know. They know. They know what's gonna happen. They know we know how to win. You know, we know how to win, folks. You know, I saw a couple of the guys that I defeated soundly and they're saying, but he won't do well in the general election.","Well, they said, I wouldn't do well in the primaries too, you know, I mean. Same guy. He won't do well now. I haven't even started on Hillary and my numbers are better right now than Ronald Reagan's numbers were with Jimmy Carter. You know, Ronald Reagan, who was great, he had a 30 favorability and he was behind Jimmy Carter by so much.","Everybody said, oh, this is gonna be a disaster. And Jimmy Carter, now I will say this, the last person that Hillary wants to run against is me. I will tell you that and I know that for a fact. But Jimmy Carter wanted to run against Ronald Reagan. He said, oh please, let Reagan win. And he was so far behind Reagan.","And by the time the election took place, it was a big victory. An easy victory for Reagan. That's what happens. That's what happens because you aim your fire at that person. Now, I've only done it once to Hillary. I've only done it once I was about two months ago, right? And because of that Bernie did well.","I was the best thing that ever happened to Bernie because I hit her and Bill so hard when she used that phony little thing she said. That she went down. He started doing well. He stayed the same. And all of a sudden, Bernie was doing well and I got no credit for it. I took her, took her from here to here and you talk about unfavorable numbers.","So watch what happens once I get rid of the rest, OK? I want to be nice. I want to be presidential. I want to be presidential. It is true though. You know, in the last debate, my daughter came up and she said, Dad, be very, very nice tonight. I said, I can't be nice if somebody hits me. If somebody hits me, I got to hit her back or him back 10 times harder.","She said, no, no, no. And then my wife said, that's right. Be very nice. I said, I can't. And I was nice in the last debate. Now I have to say this, it was by far the most boring debate, but we won that debate. But I was nice. I was proud of myself. I walked off the stage. I said, was that good? But I was bored.","It was very boring. You know, it's more fun to hit back. We've got to hit back. So anyway. So it's been amazing. So I look forward to it. But it is a true story about Ronald Reagan. He went in, he was Jimmy Carter's absolute first pick. And boy, did he do a number. And within a month of that election it looked like Jimmy Carter was going to do OK. And within about two weeks, it was over.","It was over. And when you look at the mistakes that Hillary has made, when you look at the mistakes that Obama has made because basically -- by the way, do you see how nice she is to President Obama? Oh, yes Mr. President. Yes, sir Mr. President. Whatever the president wants is OK with me. Whatever he wants.","You know, she didn't used to be that way with him. In fact, she cannot stand President Obama. She didn't. But now, what does the president want? Well, he wants it. Oh well, I want the same thing. Isn't he a wonderful president? That's Hillary. I wonder why. Does anybody know why? That's right, folks. That's right.","Isn't it amazing how nice she is. She is so nice to the president. Let me tell you, nobody is going to be voting for a third term of Obama. He is a total disaster. He is a disaster. And nobody's voting, nobody is voting for a third term. So that's what I really look forward. I think we're going to do great.","I think we're going to do great in New York. You got to get out and vote next Tuesday. Got to do it. You know, we've had so much press on this movement and people said even last night on Bill O'Reilly, they had Brit Hume, who never says anything good about me. But he actually said, it's a phenomena what's taken place.","He actually said that. I couldn't believe it. No O'Reilly was nice. O'Reilly was nice but he had Brit Hume and Brit Hume, you know, he hasn't been particularly nice, Brit Hume and his sister. These people -- my people. These are my people. These are my people. Sometimes I can't believe it when I hear a foul mouth person like that.","No, but he said, it's a phenomena what's happened. He actually said -- Thank you. Thank you. USA is right. It's gonna be USA. America first, folks. America first right now. But he actually said and he means it. What? I mean he probably doesn't like me but he said, what's happened and what Trump has done is a phenomena.","He said something to the effect that it's probably never happened in the history of this country and it's true. You know, wherever I go, we have crowds like this. We have crowds that 35,000 people in Mobile Alabama. We had 20,000, 24,000 or 25,000 in Oklahoma. We got -- no matter where we go, New Hampshire, which we won in a landslide, South Carolina, landslide.","We won all these states. Many of them we weren't expected to win. You know, we weren't expected to win. See, in those cases, the rules are, OK? Right? Yes. But if we lose one, the rules are no good. No. The rules are no good when you don't get democracy. The rules are no good when they don't count your vote.","When they don't like in Colorado. The rules are no good when you have to play dirty tricks in order to pick up delegates, OK? And I don't think it's going to matter anyway because a guy like Cruz -- don't forget Cruz, don't forget Cruz. Lying Ted, what he did to Ben Carson in Iowa and Ben Carson endorsed me and he's a great guy.","What he did to Ben Carson, what he said Ben Carson has left the race. This was during the election. He's left the race and people are walking into the caucus, which is I don't like caucus. I like frankly an election, you walk in, you vote, you leave, OK? But they walk in and they say, oh Ben has left the race.","Come on, let's talk, let's talk. Thousands and thousands of people were lied to and misled during the election. And you know what, that's dirty stuff and the same things happening right now. The party is playing dirty and we got to show our Republican Party. You've been disenfranchised. Everybody has. You've got to show the Republican Party that they can't get away with this stuff any longer because it's enough.","And we've had enough losses. We've had enough losses with Romney types that are stiffs that can't get elected. He never had a chance. We've had enough of this stuff. We're going to win and we're going to win so big and we're going to bring the country back. And I'm going to take trade deals and I'm going to have jobs come back to our country.","They're not going to Mexico anymore. So much misinformation, though, folks. They lie so much. The press lies so much. I mean, I've had stories that when I started off, his father gave him $200 million. $200 million. In fact, my sister is a federal judge, she said, he did? That's straight. My father gave me great knowledge.","Didn't give me a lot. And later on, he passed, he give me something. But I have brothers and sisters, I started off with $1 million loan and I built it up to more than $10 billion dollars in value. A million dollar loan and I built it up in a relatively short period of time to more than $10 billion. Some of the greatest assets in the world.","You look at Doral. You look at buildings all over the place. You look at Turnberry, the great Turnberry. We have the British Open in Scotland. You look at all of these different places, tremendous cash flow, great iconic assets and very little debt. And I filed my papers with the federal election and the only reason I tell you is that's the kind of thinking we need in our country.","Now, we're getting killed. We have $19 trillion in debt. You know, the other day I was asked on one of the networks. I was asked a very good question, NATO. Now, I know about NATO but I'm not an expert in NATO, but I have a lot of common sense like a lot of the people here. Not all of you, but a lot of you, right?","And they asked me about NATO. First time I think I've ever been asked about NATO. Don't forget, I've only been doing this for nine months, folks. But I'm smart. I'm like a smart person. So they asked me about NATO. What do I think? And I'm saying, well, NATO was set up a long time ago about 68 years ago and it was really set up for the Soviet Union, which doesn't exist.","But Russia is still very powerful, more powerful in a certain way because of the mass weaponry that you have today, more powerful in certain way than ever before. But think of -- and by the way, Russia is building nukes and they're building missiles and they're doing forts all over the place. They're doing military bases and all we're doing is contracting.","We better be damn careful, folks. We better build our military bigger and better and stronger because we are going to be in big, big trouble pretty soon. You know, we're not playing with babies over there. We're going to be in big -- we think ISIS is a problem. Let me tell you. ISIS is peanuts. The first thing we have to do, we have to wipe ISIS the hell out.","We got to wipe them out. But we've got to get back to rebuilding our military because it's being decimated. It's being decimated. We've got to rebuild our military. We've got to take care of our security. You know somebody said, what's the most important job as president? I said, no, I'll give you the three most important jobs: Security, security, security, OK? After that, the economy and jobs and all of that stuff.","But without the security of our country and without having borders, I mean, look, what's happening in our southern border, the crime the drugs. We are going to build the wall. Who's gonna pay for the wall? Better believe it. By the way, by the way, you know, the lying people back there. They think that I kid.","Even these guys that I'm up against. You can't get Mexico to pay for the wall. I said -- that's right. He's right. You cannot get Mexico. I said, let me tell you say something. We have a trade deficit with Mexico of $58 billion here. That doesn't include all the drugs that come across the country. We get the drugs, the drugs poison our youth and they get the money.","And it just goes back and forth. We get drugs, they get money. That's not even included. And that number is probably bigger. Who the hell knows what that number is. By the way, this week, the Border Patrol, 15,500 unbelievable people endorsed Donald Trump for a reason. And they've never endorsed a candidate for president even before.","And it's not even a good thing for them to do it because, you know, now they'll have repercussions. But they really said, we don't care. He's the only one that gets it. He's the only one that understands. And then you had Sheriff Joe Arpaio, who is a fantastic guy, he endorsed Donald Trump. We've had so many great endorsements with Governor Christie and with Sarah Palin and with everybody.","Vander Plaats. Our friend, Bob Vander Plaats, from Liberty University just been -- We have had Ben Carson, I told you. Great. Great. I mean we have -- I'll tell you what. We have such great Jeff sessions. Cruz would get up and he talk about jack of the great. I mean, look, Senator Sessions is so respected in Congress, in the Senate, all over Washington.","And Senator Sessions, Cruz were talking about him. Senator Jeff Sessions said this, Senator Jeff Sessions. Senator Sessions just endorsed Donald Trump. Even I was surprised. All right? I believe he's the man that Ted Cruz, lying Ted respects more than anybody else in the U.S. Senate and he endorsed me. So that's a big endorsement in my book.","So I want to thank him. But, but look, when this all began, folks, it was June 16th -- thank you. I think. When this all began, it was June 16th. I came down the escalators and I talked about borders and I talked about bad trade deals. And we went very rapidly up and from virtually a couple of weeks after I announced till now, we've been number one every single week.","Every single week. And there's a reason for that. And the reason is security. And by the way, nobody respects women more than Donald Trump. Nobody. And we have women's groups all over the country that are forming because they know these liars back there in the media are treating me so unfairly with women.","And the other night on television, the other night was so great. It was on television and there was a woman and she had 10 or 15 friends standing behind her, a wonderful woman. And they said, exact -- you know trying to bring out the bad. What does it take for you not to go with Donald Trump? So that you went against him?","She said, stop your question, stop your question. There's nothing, nothing he can do that would ever make me vote or go against him. And the women behind all said, she said, he's the strongest on the military, he's the strongest on the border. He's gonna give us great spirit as a country. He's gonna bring back our trade and our jobs and our economy.","And there's nothing he can do. Now, I guess, she didn't exactly mean nothing, but she said nothing. And you know what I wanted to do? I wanted to get up and just hug that beautiful television set. I want to kiss that beautiful set. I'd love to find that woman. She was so amazing. But there are many women -- thank you.","Do you agree with her? Do you agree with her? No, it's -- I mean, it's such it's such a false -- I mean, they give you such false information. Look, what we're going to do is, first of all, we're going to take care of women's health issues far better than Hillary is ever going to do it. And we're going to take care of the security of our country.","And nobody's going to do that like me, folks. Nobody's gonna do that with me. Nobody. You know, during one of the debates, Ted Cruz is standing over here, and they said to him -- they asked him a question, which was not something he had polled. So he did not know how to answer it. By the way, he's not a good debater, in my opinion.","I mean, you know, they say, I've won every single debate from the beginning. I don't think he's a good debater. Somebody said, he's a world-class. He's not world-class anything. I can tell you one thing. I don't think he is a good debater, but he doesn't know how to talk. It's always so dramatic, dramatic.","It's called, you know -- some people would say, phony. But they asked Ted Cruz about water boarding. What do you think of waterboarding? And you didn't want -- oh yeah. He didn't want answer it, right? And then he didn't want to answer it. He didn't want to get in because he didn't want to be politically incorrect and all of that, right?","But he didn't want to talk about it and then they asked me, they said, what do you think Mr. Trump? I said, I'm fine with it. I think it's great. But I think we've got to get much tougher than waterboarding. Much tougher. We got to get much, much tougher. We have to stay within the laws. You know, the laws are so bad.","We have laws that don't even allow you to do waterboarding. So think of this, you're ISIS. They eat like you do. They're sitting home eating. They just chopped off 12 heads. They just drowned 100 people and then they're reading that the United States finds water boarding to be cruel and not nice. And anybody that gets caught waterboarding will be punished for life, thrown out of the military, destroyed.","And here they are chopping off heads and drowning people in heavy steel cages. Boom, stays down for one hour and they pull it back up. And they're talking about waterboarding. And you say to yourself, we're in a fight but we're playing by different rules. And that's not a good formula folks for winning. We got to play tougher.","We can't send leaflets down saying, we're going to start bombing you in one hour. It's unbelievable. And who is the one that's been saying for a long time take the oil? And by the way, I said from the beginning, from the beginning I said, don't go into Iraq. You know, they're all saying, oh Trump, maybe he's a tough guy.","Maybe he's too tough. You know, he may be too tough. He'll be too quick with the trigger. I'll be the slowest with a trigger. But here's the difference, nobody's going to mess with us if I'm in charge, OK? I'll be the slowest but nobody is going to mess with us. Nobody. Nobody. We're laughed at all over the world for being stupid people.","We're laughed out all over the world for having really stupid leadership and it's going to end, folks. We're going to make the greatest trade deals in the world. When it comes to defending all these countries that are wealthy, wealthy countries, we defend Japan, we defend Germany, we defend South Korea, we defend Saudi Arabia.","They were making a billion dollars a day when the oil was high. Now they're still making a fortune. We defend them. And you know what happens when we ask them for money? They say, no, no. And we -- Oh, OK, OK, maybe we'll talk to you next year. In NATO, many of the countries and they don't write this in the newspapers and the media doesn't discuss it what I said because they said, oh Trump wants to break up NATO.","You always have to be prepared to walk folks if you have a deal. If John Kerry walked from the Iran deal a couple of times, it could have been a much better deal. Instead, we gave $150 billion. We've got nothing in that deal. Nothing. And we should have had our prisoners before we started negotiating. Believe me. But you always have to be prepared.","So we have many, many countries in NATO that are not carrying their weight. They're not spending the money that they agreed to. They're not paying hardly anything. We're defending them, right? We're defending -- we have 28 countries we're defending many of those countries. Most of them aren't paying their weight and it's acknowledged.","And when I said this, some of the experts -- and I said, two things, it's obsolete. Was it obsolete? Because it doesn't really cover terror. And if it does, we have a lot of the wrong countries in there because these aren't terror countries. They do have problems with Soviet Union, now Russia. But these are countries that have problems but not terror.","It's a different kind of a problem. So I said, it's obsolete because terrorist is our problem, right? Now don't you think? I mean terrorist is our problem. Honestly, we have so many problems. We've had such bad leadership. We have problems. You go back 10, 12 years and I'm including other people when I say that.","But you look at where our country was, you look at where our debt was. $19 trillion going to $21 trillion, not billion. We have trillions. Nobody even knows what a trillion is. We have big problems, folks. So when I said, it's obsolete. It doesn't cover terror. That's OK. And a lot of the experts then said, wow, we've never thought of that.","And these are guys that study that. You know why? They're so close to it. Did you ever get so close to a deal or a job that you don't really see it? You don't see the big picture. And they also said it's not fair that we're carrying all these countries. I said that very strongly. We've got it. Now one of the things I do early on and I didn't say get rid of NATO.","But I'm prepared to walk because I'm not gonna let you defend other countries and keep raising your taxes. You're the highest taxed people in the world, in the whole world. And I would go back to these countries, some of whom are very rich, and I would say, you're delinquent like an apartment when somebody is with me. They owe me rent.","I say how many months? Two months, three months. I say you better get it quick, but they're delinquent. You call them delinquent. These countries are delinquent. Now they're delinquent. You know why? Because they think we're stupid. That's why. Why should they pay? So not only do I want the money that they should be paying us currently, but I want the money that they owe us for years and years.","OK? I want it. And then after that, they've got to pay a more fair share and they've got to keep it current. And if they don't, they're gone. And if it doesn't work out folks, we always gotta be prepared to walk, OK? They'll have to defend themselves. You know, you look at the Ukraine, we're always saying we'll fight.","Will this, will that I don't hear any country over there talking about the Ukraine. It's always us talking. We're paying 73% the costs of NATO. You have 28 countries. The United Nations. When was the last time you saw the U.N. -- I built the building right opposite the United Nations, probably destroyed the building's value if they leave.","I don't care. I don't care. I no longer care. I care about this. This is the big picture, folks. This is the big picture. When -- with all of these conflicts all over the world, Syria and Libya. How about Libya? That was a Hillary Clinton disaster. Benghazi, the ambassador. He called her supposedly 600 times and she never responded.","And yet, her friends call her and she responds immediately. How about that phony ad? Who do you want at 3:00 o'clock in the morning answering the phone? She wasn't there at 3:00 o'clock in the morning. And he was killed along with other people that were great people, right? He was killed. And now let me tell you and I'll tell this.","Maybe the press will write it. They'll give somebody else the credit but that's OK. But in Libya, great oil. Do you know it's among the finest oil patches in the world in terms of quality oil. You know who's got that oil now? ISIS. ISIS has the oil. And you know what they are doing with the oil? They're selling the oil all over and ships are pulling in and they're just selling it like crazy and they're making a fortune.","And we don't even set up a blockade and we don't bomb the hell out of those ships. Folks, we are being so stupidly led. We have people that don't have a clue. You know we're all sort of like together, we're smart people. I have the smartest people, I have the most loyal people and even these liars back there will say it, the most loyal people are Trump supporters.","The most loyal people are Trump supporters, by far. Because you know what? We grew up together in New York. You know me. I mean, we all have little things. But you know me, I know you, we all love each other. These other guys, these other guys, when you look at Cruz talking about New York values and the hate.","When you look at the things that they approve, when you look at the things they won't approve where it has to do with New York and then they come in and they want to get your vote, both of them. No. I don't think so, folks. I don't think so. I will tell you something. We are going to cherish and we are going to protect this state.","Our state is going to hell. We are going to cherish and we are going to protect our state. And we're going to bring back jobs to our state and we're going to bring back jobs to our country. We're going to bring them back. So here's the story just to end it. Look, we have a big election coming up. It's a very important election.","A very, very prominent writer journalist called me and said, somebody I do respect, and said, how does it feel? How does it feel, Mr. Trump? I said, what? He said what you've done has never been done, like Brit Hume what he said last night on O'Reilly. What you've done has never been done in the history of American politics.","And I said, I said, no, no, no. No, no, I know it's wonderful. He said -- I said, if I don't win. He said, no, no you don't have to win what you've done. I said, you're wrong. If I don't win, I will consider what I've done a massive waste of time and to my money, not your money because I'm self funding but my money.","A massive waste of time because I'm not looking for accolades in three years when they talk about the various elections. I don't care about that. The only way we're going to turn this country around because all these guys like Cruz and like the senators and like all of them, the politicians, they're all talk and no action.","Nobody knows them better than I do. I know him better than anybody. All of these guys, every single one of them are controlled and they're controlled by special interests and those special interests, in many cases, are adverse to our country. So here's the story. Get out and vote on Tuesday. I will not let you down.","We will win again. We will win, win, win. We're going to make America great again. I love you. Thank you. Thank you very much. Thank you."],"text":" Thank you, everybody. Thank you. We love you. We love this area. Many, many friends up here, folks. And we've been -- in terms of the state, we've all been suffering together. You know that, right? But it is going to change. And we apologize for airplane hangers, but they're the only things that hold our crowds because something's going on. The fact is there's a movement going on and it's happening all over the country and it's people like yourselves, and we're going to turn our country around. We're going to take our jobs back because they're going, they're going by the thousands every single week. And they're going to China and they're going to Mexico and they're going to any country that touches us with a trade deal because our negotiators have no idea whatsoever what they're doing, OK? So we're going to turn it around and we're going to turn it around very quickly. I just, you know, in coming up, I wanted to read -- do you mind if I take this coat off, do you mind? All right. Come on. There's so many warm people, they're warm, they're warm and we will not use Carrier air conditioning to cool it down because they're moving to Mexico. We're not going to use them, right? Not gonna use them. But you know, I did some a glitter work in the area and I'll tell you what, not good. But it's going to be good. Don't leave, don't leave, don't leave for warmer climates. You know, I won Florida by a lot and I love Florida. But don't leave for Florida. We're going to bring it back. Don't leave, OK? But listen to this. Your county has lost 60% of its manufacturing jobs since 1980, 6%. According to the Bureau of Labor Statistics, the Utica Rome region has lost more than half of its manufacturing jobs since 1990. Now more than half, folks. Factors: NAFTA, which was, as you know, voted on by a certain person that's running. We won't mention names. Voted on by somebody. The Asian currency manipulation, which I've been talking about for a long time and nobody even understands it but me. It's called devaluation and China entrance into the World Trade Organization has been a total disaster for you and for this region. So listen to this, according to Labor Bureau Statistics, Utica Rome region lost nearly 40% of its manufacturing jobs since 2001. What's going on? Is anybody working up here? We got to change this. All right, it's terrible. Total private employment has shrunk nearly 10% in a short period of time. Medium household, this is something, median household income in New York state today is $3,700 less per year than it was in 1989, inflation adjusted. Folks, what the hell is going on? We're gonna bring it back. We're gonna bring it back. New York State has lost three out of four, think of that, three out of every four manufacturing jobs that existed in 1960 is gone. That's right. I agree with you. But I'm not allowed -- I'm not allowed to use that term. If I use that term, the dishonest press does a big number, so I can't do it. Shout out whatever you want, I'll just say, I agree, all right? Cruz support TPP and they support giving Obama more trading authority. This TPP, by the way, and fast track trading is a total disaster for this area and for our country and they're in favor of it and I'm against it. And boy, am I right. It's going to make NAFTA look like a baby. It's worse than NAFTA, and you better make sure your politicians don't approve it. When I get in office, I'll do real trade deals where we're going to bring our jobs back. Just rely on it, folks. All right, rely on it. Rely on it. So -- but isn't that amazing? I said, give me a little information on the area. I know the area well. I thought you were doing better than that. So here's the story. I was just talking to some of the very talented reporters backstage and you know the system, folks, is rigged. It's a rigged system. Now, you have to understand, I'm not complaining about the states that I won. Those are OK, of which I won I think 22 and Cruz won 10. Did you ever hear him say, I'm the only one -- remember lying Ted Cruz, lying Ted, has the Bible up here puts it down. He's a liar. Oh boy, does he lie. But the system's rigged. And I'll tell you what, when you look at Colorado and people could say, oh well, that's the way the game is played. Look, they should have had an election. They didn't have an election. That system is set up so that the crooked politicians can make sure they get somebody in that's not, you know, part of what we're doing. This is a movement, folks. I've self funding my campaign. They hate it. They hate it. They don't want me to self fund my campaign. They don't want it because you know what? They're all controlled by their special interests. They're all controlled by their lobbyist, 100%. So when it comes time to making trade deals, military deals, any deals, the lobbyist goes this, you can't do this. This guy gave you a million dollars. This guy gave you $10 million. This group or this country gave you $5 million. You can't do it. And they said, OK, I won't do it with me. They didn't give me anything, folks, OK? I'm working for you. I'm working for you. So I our Republican system, our republican system is absolutely rigged. It's a phony deal. Now, what do I know? I started running like nine months ago. Who would have thought I would have been in first place? What do I know, right? What do I know? But I'm in first place by a lot, millions and millions of votes. That doesn't count. You noticed? Nobody even talks about votes. I have millions of votes more, but I also have hundreds of delegates more. But that's not the same thing to me. I think the vote is the thing that you count, right? The vote. And you look at some of these systems where the people that devised them and this had to do with Ron Paul, it had to do with a hole, they wanted to keep people out. This was a dirty trick. These are dirty tricksters. This is a dirty trick. And I'll tell you what, the RNC, the Republican National Committee, they should be ashamed of themselves for allowing this kind of crap to happen. I can tell you that. They should be ashamed of themselves because it has nothing to do with democracy. They took the votes away from the people in Colorado. People are burning up their Republican cards because they want to vote. And you got to see what's happening out there. It's actually a thing of beauty, if you want to know the truth because they're not going to take it. And they may -- it may be shoved down their face and who knows, but you know what, they're fighting and they're all over the place and they're angry. Their votes have been taken away. We've already been disenfranchised because you look at what's going on. Because if you think about it, the economy is rigged, the banking system is rigged, there's a lot of things that are rigged in this world of ours and that's why a lot of you haven't had an effective wage increase in 20 years, folks. And we're going to change it. We're going to change it. Gonna change it fast. So I'm no fan of Bernie Sanders, right? Believe me. Well, though, we do have one thing in common. What's the one thing? We actually do. Trade. He knows we're being ripped off and I know we're being ripped off. We're being ripped off, big league. The difference is I'll make unbelievable deals and he doesn't know what to do. He just knows we're being ripped off. But Bernie Sanders, I will say this, for the last five weeks, you turn on the television. Sanders wins. Sanders wins. Again, Sanders wins like seven or eight or nine. He keeps winning. And then you listen to the people and the pundits and they say, he has no chance of winning. I said, what's going on? Because you have superdelegates -- by the way, I think the Republicans have a worse system than the Democrats but they have superdelegates. It makes it impossible for a guy that wins to win. It's a crooked system, folks. It's a crooked system. It really is a crooked system. You know, again, I don't care who wins over there. I'll take on either one of them. I sort of had my heart set on Hillary, to be honest with you. And her whole life, remember this, her whole life has been one big lie. It's been one big lie. And you go back and you look at Whitewater and you look at her cattle deal. Remember the cattle, she made the highest percentage practically in the history of cattle making. I wonder why that happened, folks. But you take a look and now you look at this horrible scandal with e-mails where she's probably being protected, probably being protected because people that did 5% of what she did have had their lives destroyed and her life is just fine. It looks like she'll be the candidate. And in a certain way, that's really the one I want to run against. We will beat her so badly beat her, we'll beat her badly. You know, when Ronald Reagan -- I mean I've had some nice polls, but when Ronald Reagan -- don't forget I have 17 people coming at me and they said, please, please, darling, my wife and my daughter, Ivanka. Daddy, please, be more presidential. I said, wait a minute, wait a minute, I got 17 people throwing barbs at me. I got to take him out before I become presidential don't I, right? You know, they mean be nice and we can't be nice until they have -- we have two leftovers right now. We can't be nice, we can't be nice until we win it. And you know, when I first started, Jeb Bush had it made. He was gonna win. He was presumptive. You know, in Florida, you speak about unfair. I got to tell you, you speak about what's unfair. So in Florida, you had 99 delegates and Jeb Bush had it set. Jeb Bush or Rubio, both of them, they had it set so that the winner takes everything because they wanted to make sure that I didn't get anything. And so it was all set. It was set in steel. 99 delegates winner gets all. And then the first poll came out, Trump, 48; Jeb, 16; Rubio, 12. And they said, oh, right? They said, oh, this is terrible. We got to change it. So they made a move to change it. When you get proportion, but it was too late. I said, no way you can do it. We put up a little bit of a ruckus. But I will say this, so in Florida, it was set. So that I wouldn't get it and it was set winner take all because the governor was gonna get it. The past governor, who is pretty popular. The past governor or the future of the Republican Party, which was Marco, right? Now I wouldn't -- I want to be nice. Marco, only Marco. No first name. We don't go any -- we don't do that anymore. You know why we don't do it anymore because we won. We don't do it. No, he's going to be Marco, who's a guy -- by the way, who's a nice guy. Marco is actually a nice guy. He went a little Don Rickles on me but then we went heavy Don Rickles back. But Marco is a nice guy. And I'm sure Jeb is a nice guy. I didn't get to know him too well. He was too busy doing negative ads. The guy spent like $48 million on ads, many of them against me negative ads. But remember they did Florida and you remember the outcry when the first poll came out and I was close to 50 and they were in the teens and they said, wow, what are we going to do? And I ended up winning by 20 points, by 20. We had a -- it was a landslide. It was a landslide. So you never know about the phony rules and regulations but hopefully, the RNC is gonna get with the people. The RNC hasn't won an important election in a long time. We've had Obama far too long. The last election should have been won except Romney choked like a dog. He choked. He went, I can't breathe, I can't breathe, he said. Romney choked. I never saw anything -- well, let me tell you, George speech choked a little bit but you know what, he's going to recover. He's a great young guy and he's going to recover. Romney can't recover from a choke. That was an election that should have been won. That was an election that should have been won easily and for the last month he disappeared. He went into a house and he just disappeared. What the hell happened to him? And so I backed -- who in all fairness had a tough time, I backed Romney. You wouldn't believe this but I actually backed him, raised a lot of money for him and other things and he failed. So McCain failed, Romney felt and I said, this time, we're going to do it ourselves, OK? We're going to do it this way. So we'll see. But we're doing well. We won the South. In fact, I think I may have to move to the south if New York doesn't treat me great. I won Alabama. Think. Of this. I won -- did you see today, we won Missouri. Today, we won Missouri. We love Missouri. And I was a little worried about Missouri because lying Ted Cruz, his top guy is from Missouri. So when I won -- that's right, lying Ted. So when I won remember with Ted, he comes with a Bible held high and he talks about the Bible, except the evangelicals like me better than they like Ted Cruz because they know what they get. We're gonna get strong military. We're gonna take care of our vets. We're going to get protect our Second Amendment. We're going to have strong borders. We're going to repeal Obamacare and replace it with something great. They know. They know. By the way -- They know. They know. They know what's gonna happen. They know we know how to win. You know, we know how to win, folks. You know, I saw a couple of the guys that I defeated soundly and they're saying, but he won't do well in the general election. Well, they said, I wouldn't do well in the primaries too, you know, I mean. Same guy. He won't do well now. I haven't even started on Hillary and my numbers are better right now than Ronald Reagan's numbers were with Jimmy Carter. You know, Ronald Reagan, who was great, he had a 30 favorability and he was behind Jimmy Carter by so much. Everybody said, oh, this is gonna be a disaster. And Jimmy Carter, now I will say this, the last person that Hillary wants to run against is me. I will tell you that and I know that for a fact. But Jimmy Carter wanted to run against Ronald Reagan. He said, oh please, let Reagan win. And he was so far behind Reagan. And by the time the election took place, it was a big victory. An easy victory for Reagan. That's what happens. That's what happens because you aim your fire at that person. Now, I've only done it once to Hillary. I've only done it once I was about two months ago, right? And because of that Bernie did well. I was the best thing that ever happened to Bernie because I hit her and Bill so hard when she used that phony little thing she said. That she went down. He started doing well. He stayed the same. And all of a sudden, Bernie was doing well and I got no credit for it. I took her, took her from here to here and you talk about unfavorable numbers. So watch what happens once I get rid of the rest, OK? I want to be nice. I want to be presidential. I want to be presidential. It is true though. You know, in the last debate, my daughter came up and she said, Dad, be very, very nice tonight. I said, I can't be nice if somebody hits me. If somebody hits me, I got to hit her back or him back 10 times harder. She said, no, no, no. And then my wife said, that's right. Be very nice. I said, I can't. And I was nice in the last debate. Now I have to say this, it was by far the most boring debate, but we won that debate. But I was nice. I was proud of myself. I walked off the stage. I said, was that good? But I was bored. It was very boring. You know, it's more fun to hit back. We've got to hit back. So anyway. So it's been amazing. So I look forward to it. But it is a true story about Ronald Reagan. He went in, he was Jimmy Carter's absolute first pick. And boy, did he do a number. And within a month of that election it looked like Jimmy Carter was going to do OK. And within about two weeks, it was over. It was over. And when you look at the mistakes that Hillary has made, when you look at the mistakes that Obama has made because basically -- by the way, do you see how nice she is to President Obama? Oh, yes Mr. President. Yes, sir Mr. President. Whatever the president wants is OK with me. Whatever he wants. You know, she didn't used to be that way with him. In fact, she cannot stand President Obama. She didn't. But now, what does the president want? Well, he wants it. Oh well, I want the same thing. Isn't he a wonderful president? That's Hillary. I wonder why. Does anybody know why? That's right, folks. That's right. Isn't it amazing how nice she is. She is so nice to the president. Let me tell you, nobody is going to be voting for a third term of Obama. He is a total disaster. He is a disaster. And nobody's voting, nobody is voting for a third term. So that's what I really look forward. I think we're going to do great. I think we're going to do great in New York. You got to get out and vote next Tuesday. Got to do it. You know, we've had so much press on this movement and people said even last night on Bill O'Reilly, they had Brit Hume, who never says anything good about me. But he actually said, it's a phenomena what's taken place. He actually said that. I couldn't believe it. No O'Reilly was nice. O'Reilly was nice but he had Brit Hume and Brit Hume, you know, he hasn't been particularly nice, Brit Hume and his sister. These people -- my people. These are my people. These are my people. Sometimes I can't believe it when I hear a foul mouth person like that. No, but he said, it's a phenomena what's happened. He actually said -- Thank you. Thank you. USA is right. It's gonna be USA. America first, folks. America first right now. But he actually said and he means it. What? I mean he probably doesn't like me but he said, what's happened and what Trump has done is a phenomena. He said something to the effect that it's probably never happened in the history of this country and it's true. You know, wherever I go, we have crowds like this. We have crowds that 35,000 people in Mobile Alabama. We had 20,000, 24,000 or 25,000 in Oklahoma. We got -- no matter where we go, New Hampshire, which we won in a landslide, South Carolina, landslide. We won all these states. Many of them we weren't expected to win. You know, we weren't expected to win. See, in those cases, the rules are, OK? Right? Yes. But if we lose one, the rules are no good. No. The rules are no good when you don't get democracy. The rules are no good when they don't count your vote. When they don't like in Colorado. The rules are no good when you have to play dirty tricks in order to pick up delegates, OK? And I don't think it's going to matter anyway because a guy like Cruz -- don't forget Cruz, don't forget Cruz. Lying Ted, what he did to Ben Carson in Iowa and Ben Carson endorsed me and he's a great guy. What he did to Ben Carson, what he said Ben Carson has left the race. This was during the election. He's left the race and people are walking into the caucus, which is I don't like caucus. I like frankly an election, you walk in, you vote, you leave, OK? But they walk in and they say, oh Ben has left the race. Come on, let's talk, let's talk. Thousands and thousands of people were lied to and misled during the election. And you know what, that's dirty stuff and the same things happening right now. The party is playing dirty and we got to show our Republican Party. You've been disenfranchised. Everybody has. You've got to show the Republican Party that they can't get away with this stuff any longer because it's enough. And we've had enough losses. We've had enough losses with Romney types that are stiffs that can't get elected. He never had a chance. We've had enough of this stuff. We're going to win and we're going to win so big and we're going to bring the country back. And I'm going to take trade deals and I'm going to have jobs come back to our country. They're not going to Mexico anymore. So much misinformation, though, folks. They lie so much. The press lies so much. I mean, I've had stories that when I started off, his father gave him $200 million. $200 million. In fact, my sister is a federal judge, she said, he did? That's straight. My father gave me great knowledge. Didn't give me a lot. And later on, he passed, he give me something. But I have brothers and sisters, I started off with $1 million loan and I built it up to more than $10 billion dollars in value. A million dollar loan and I built it up in a relatively short period of time to more than $10 billion. Some of the greatest assets in the world. You look at Doral. You look at buildings all over the place. You look at Turnberry, the great Turnberry. We have the British Open in Scotland. You look at all of these different places, tremendous cash flow, great iconic assets and very little debt. And I filed my papers with the federal election and the only reason I tell you is that's the kind of thinking we need in our country. Now, we're getting killed. We have $19 trillion in debt. You know, the other day I was asked on one of the networks. I was asked a very good question, NATO. Now, I know about NATO but I'm not an expert in NATO, but I have a lot of common sense like a lot of the people here. Not all of you, but a lot of you, right? And they asked me about NATO. First time I think I've ever been asked about NATO. Don't forget, I've only been doing this for nine months, folks. But I'm smart. I'm like a smart person. So they asked me about NATO. What do I think? And I'm saying, well, NATO was set up a long time ago about 68 years ago and it was really set up for the Soviet Union, which doesn't exist. But Russia is still very powerful, more powerful in a certain way because of the mass weaponry that you have today, more powerful in certain way than ever before. But think of -- and by the way, Russia is building nukes and they're building missiles and they're doing forts all over the place. They're doing military bases and all we're doing is contracting. We better be damn careful, folks. We better build our military bigger and better and stronger because we are going to be in big, big trouble pretty soon. You know, we're not playing with babies over there. We're going to be in big -- we think ISIS is a problem. Let me tell you. ISIS is peanuts. The first thing we have to do, we have to wipe ISIS the hell out. We got to wipe them out. But we've got to get back to rebuilding our military because it's being decimated. It's being decimated. We've got to rebuild our military. We've got to take care of our security. You know somebody said, what's the most important job as president? I said, no, I'll give you the three most important jobs: Security, security, security, OK? After that, the economy and jobs and all of that stuff. But without the security of our country and without having borders, I mean, look, what's happening in our southern border, the crime the drugs. We are going to build the wall. Who's gonna pay for the wall? Better believe it. By the way, by the way, you know, the lying people back there. They think that I kid. Even these guys that I'm up against. You can't get Mexico to pay for the wall. I said -- that's right. He's right. You cannot get Mexico. I said, let me tell you say something. We have a trade deficit with Mexico of $58 billion here. That doesn't include all the drugs that come across the country. We get the drugs, the drugs poison our youth and they get the money. And it just goes back and forth. We get drugs, they get money. That's not even included. And that number is probably bigger. Who the hell knows what that number is. By the way, this week, the Border Patrol, 15,500 unbelievable people endorsed Donald Trump for a reason. And they've never endorsed a candidate for president even before. And it's not even a good thing for them to do it because, you know, now they'll have repercussions. But they really said, we don't care. He's the only one that gets it. He's the only one that understands. And then you had Sheriff Joe Arpaio, who is a fantastic guy, he endorsed Donald Trump. We've had so many great endorsements with Governor Christie and with Sarah Palin and with everybody. Vander Plaats. Our friend, Bob Vander Plaats, from Liberty University just been -- We have had Ben Carson, I told you. Great. Great. I mean we have -- I'll tell you what. We have such great Jeff sessions. Cruz would get up and he talk about jack of the great. I mean, look, Senator Sessions is so respected in Congress, in the Senate, all over Washington. And Senator Sessions, Cruz were talking about him. Senator Jeff Sessions said this, Senator Jeff Sessions. Senator Sessions just endorsed Donald Trump. Even I was surprised. All right? I believe he's the man that Ted Cruz, lying Ted respects more than anybody else in the U.S. Senate and he endorsed me. So that's a big endorsement in my book. So I want to thank him. But, but look, when this all began, folks, it was June 16th -- thank you. I think. When this all began, it was June 16th. I came down the escalators and I talked about borders and I talked about bad trade deals. And we went very rapidly up and from virtually a couple of weeks after I announced till now, we've been number one every single week. Every single week. And there's a reason for that. And the reason is security. And by the way, nobody respects women more than Donald Trump. Nobody. And we have women's groups all over the country that are forming because they know these liars back there in the media are treating me so unfairly with women. And the other night on television, the other night was so great. It was on television and there was a woman and she had 10 or 15 friends standing behind her, a wonderful woman. And they said, exact -- you know trying to bring out the bad. What does it take for you not to go with Donald Trump? So that you went against him? She said, stop your question, stop your question. There's nothing, nothing he can do that would ever make me vote or go against him. And the women behind all said, she said, he's the strongest on the military, he's the strongest on the border. He's gonna give us great spirit as a country. He's gonna bring back our trade and our jobs and our economy. And there's nothing he can do. Now, I guess, she didn't exactly mean nothing, but she said nothing. And you know what I wanted to do? I wanted to get up and just hug that beautiful television set. I want to kiss that beautiful set. I'd love to find that woman. She was so amazing. But there are many women -- thank you. Do you agree with her? Do you agree with her? No, it's -- I mean, it's such it's such a false -- I mean, they give you such false information. Look, what we're going to do is, first of all, we're going to take care of women's health issues far better than Hillary is ever going to do it. And we're going to take care of the security of our country. And nobody's going to do that like me, folks. Nobody's gonna do that with me. Nobody. You know, during one of the debates, Ted Cruz is standing over here, and they said to him -- they asked him a question, which was not something he had polled. So he did not know how to answer it. By the way, he's not a good debater, in my opinion. I mean, you know, they say, I've won every single debate from the beginning. I don't think he's a good debater. Somebody said, he's a world-class. He's not world-class anything. I can tell you one thing. I don't think he is a good debater, but he doesn't know how to talk. It's always so dramatic, dramatic. It's called, you know -- some people would say, phony. But they asked Ted Cruz about water boarding. What do you think of waterboarding? And you didn't want -- oh yeah. He didn't want answer it, right? And then he didn't want to answer it. He didn't want to get in because he didn't want to be politically incorrect and all of that, right? But he didn't want to talk about it and then they asked me, they said, what do you think Mr. Trump? I said, I'm fine with it. I think it's great. But I think we've got to get much tougher than waterboarding. Much tougher. We got to get much, much tougher. We have to stay within the laws. You know, the laws are so bad. We have laws that don't even allow you to do waterboarding. So think of this, you're ISIS. They eat like you do. They're sitting home eating. They just chopped off 12 heads. They just drowned 100 people and then they're reading that the United States finds water boarding to be cruel and not nice. And anybody that gets caught waterboarding will be punished for life, thrown out of the military, destroyed. And here they are chopping off heads and drowning people in heavy steel cages. Boom, stays down for one hour and they pull it back up. And they're talking about waterboarding. And you say to yourself, we're in a fight but we're playing by different rules. And that's not a good formula folks for winning. We got to play tougher. We can't send leaflets down saying, we're going to start bombing you in one hour. It's unbelievable. And who is the one that's been saying for a long time take the oil? And by the way, I said from the beginning, from the beginning I said, don't go into Iraq. You know, they're all saying, oh Trump, maybe he's a tough guy. Maybe he's too tough. You know, he may be too tough. He'll be too quick with the trigger. I'll be the slowest with a trigger. But here's the difference, nobody's going to mess with us if I'm in charge, OK? I'll be the slowest but nobody is going to mess with us. Nobody. Nobody. We're laughed at all over the world for being stupid people. We're laughed out all over the world for having really stupid leadership and it's going to end, folks. We're going to make the greatest trade deals in the world. When it comes to defending all these countries that are wealthy, wealthy countries, we defend Japan, we defend Germany, we defend South Korea, we defend Saudi Arabia. They were making a billion dollars a day when the oil was high. Now they're still making a fortune. We defend them. And you know what happens when we ask them for money? They say, no, no. And we -- Oh, OK, OK, maybe we'll talk to you next year. In NATO, many of the countries and they don't write this in the newspapers and the media doesn't discuss it what I said because they said, oh Trump wants to break up NATO. You always have to be prepared to walk folks if you have a deal. If John Kerry walked from the Iran deal a couple of times, it could have been a much better deal. Instead, we gave $150 billion. We've got nothing in that deal. Nothing. And we should have had our prisoners before we started negotiating. Believe me. But you always have to be prepared. So we have many, many countries in NATO that are not carrying their weight. They're not spending the money that they agreed to. They're not paying hardly anything. We're defending them, right? We're defending -- we have 28 countries we're defending many of those countries. Most of them aren't paying their weight and it's acknowledged. And when I said this, some of the experts -- and I said, two things, it's obsolete. Was it obsolete? Because it doesn't really cover terror. And if it does, we have a lot of the wrong countries in there because these aren't terror countries. They do have problems with Soviet Union, now Russia. But these are countries that have problems but not terror. It's a different kind of a problem. So I said, it's obsolete because terrorist is our problem, right? Now don't you think? I mean terrorist is our problem. Honestly, we have so many problems. We've had such bad leadership. We have problems. You go back 10, 12 years and I'm including other people when I say that. But you look at where our country was, you look at where our debt was. $19 trillion going to $21 trillion, not billion. We have trillions. Nobody even knows what a trillion is. We have big problems, folks. So when I said, it's obsolete. It doesn't cover terror. That's OK. And a lot of the experts then said, wow, we've never thought of that. And these are guys that study that. You know why? They're so close to it. Did you ever get so close to a deal or a job that you don't really see it? You don't see the big picture. And they also said it's not fair that we're carrying all these countries. I said that very strongly. We've got it. Now one of the things I do early on and I didn't say get rid of NATO. But I'm prepared to walk because I'm not gonna let you defend other countries and keep raising your taxes. You're the highest taxed people in the world, in the whole world. And I would go back to these countries, some of whom are very rich, and I would say, you're delinquent like an apartment when somebody is with me. They owe me rent. I say how many months? Two months, three months. I say you better get it quick, but they're delinquent. You call them delinquent. These countries are delinquent. Now they're delinquent. You know why? Because they think we're stupid. That's why. Why should they pay? So not only do I want the money that they should be paying us currently, but I want the money that they owe us for years and years. OK? I want it. And then after that, they've got to pay a more fair share and they've got to keep it current. And if they don't, they're gone. And if it doesn't work out folks, we always gotta be prepared to walk, OK? They'll have to defend themselves. You know, you look at the Ukraine, we're always saying we'll fight. Will this, will that I don't hear any country over there talking about the Ukraine. It's always us talking. We're paying 73% the costs of NATO. You have 28 countries. The United Nations. When was the last time you saw the U.N. -- I built the building right opposite the United Nations, probably destroyed the building's value if they leave. I don't care. I don't care. I no longer care. I care about this. This is the big picture, folks. This is the big picture. When -- with all of these conflicts all over the world, Syria and Libya. How about Libya? That was a Hillary Clinton disaster. Benghazi, the ambassador. He called her supposedly 600 times and she never responded. And yet, her friends call her and she responds immediately. How about that phony ad? Who do you want at 3:00 o'clock in the morning answering the phone? She wasn't there at 3:00 o'clock in the morning. And he was killed along with other people that were great people, right? He was killed. And now let me tell you and I'll tell this. Maybe the press will write it. They'll give somebody else the credit but that's OK. But in Libya, great oil. Do you know it's among the finest oil patches in the world in terms of quality oil. You know who's got that oil now? ISIS. ISIS has the oil. And you know what they are doing with the oil? They're selling the oil all over and ships are pulling in and they're just selling it like crazy and they're making a fortune. And we don't even set up a blockade and we don't bomb the hell out of those ships. Folks, we are being so stupidly led. We have people that don't have a clue. You know we're all sort of like together, we're smart people. I have the smartest people, I have the most loyal people and even these liars back there will say it, the most loyal people are Trump supporters. The most loyal people are Trump supporters, by far. Because you know what? We grew up together in New York. You know me. I mean, we all have little things. But you know me, I know you, we all love each other. These other guys, these other guys, when you look at Cruz talking about New York values and the hate. When you look at the things that they approve, when you look at the things they won't approve where it has to do with New York and then they come in and they want to get your vote, both of them. No. I don't think so, folks. I don't think so. I will tell you something. We are going to cherish and we are going to protect this state. Our state is going to hell. We are going to cherish and we are going to protect our state. And we're going to bring back jobs to our state and we're going to bring back jobs to our country. We're going to bring them back. So here's the story just to end it. Look, we have a big election coming up. It's a very important election. A very, very prominent writer journalist called me and said, somebody I do respect, and said, how does it feel? How does it feel, Mr. Trump? I said, what? He said what you've done has never been done, like Brit Hume what he said last night on O'Reilly. What you've done has never been done in the history of American politics. And I said, I said, no, no, no. No, no, I know it's wonderful. He said -- I said, if I don't win. He said, no, no you don't have to win what you've done. I said, you're wrong. If I don't win, I will consider what I've done a massive waste of time and to my money, not your money because I'm self funding but my money. A massive waste of time because I'm not looking for accolades in three years when they talk about the various elections. I don't care about that. The only way we're going to turn this country around because all these guys like Cruz and like the senators and like all of them, the politicians, they're all talk and no action. Nobody knows them better than I do. I know him better than anybody. All of these guys, every single one of them are controlled and they're controlled by special interests and those special interests, in many cases, are adverse to our country. So here's the story. Get out and vote on Tuesday. I will not let you down. We will win again. We will win, win, win. We're going to make America great again. I love you. Thank you. Thank you very much. Thank you."}