{"id":412,"author":"Donald Trump","title":"Speech: Donald Trump in Rochester, NY","date":"2016-04-10","link":"https://factba.se/transcript/donald-trump-speech-rochester-ny-april-10-2016","paragraphs":["Thank you, everybody. This is amazing. This is amazing. Wow. THis is amazing. Thank you very much. And you know, Rochester is a special place. I've known it for a long time. And we're going to make it better, OK? We're going to make it better. I want to thank -- before I begin, I have to thank some friends, Carl.","Carl? Carl Paladino. All right. Get him out of here. Boy, oh, boy. Where do they come from? Where do these people come from? Where do they come fr om? Where do they come from? There's nothing like a Trump rally, folks. I want to thank Carl Paladino, James , Bill Nojay and Bill Reilich.","Thank you, kids. Great job. Really great job. So let's talk a little bit about Rochester for a second because we're here, we come upstate, I know what's been going on for a long time. This same group including Carl and many others they asked me to run for Governor. Between you and I, I sort of said I'm sorry but I'm doing something else.","I didn't want to say. This is what the something else was. And I think it can have a lot bigger effect on upstate New York and on Rochester by doing what I'm doing that I could have even as Governor. Although you would have been fracking by now, a long time ago, you would have been fracking. I tell you that.","It is said that when you go at the line and you see in Pennsylvania machines, bomb, bomb, bomb all the way up and down the line. And yet on the right of the line, we can't have those machines because they're bad for the environment, OK? So explain it. We could have wiped out our debt in New York. We could have wiped out our debt, but hey, we will get it straightened out, folks.","One way or the other, we're going to get it straightened out. Here's some statistics. I just did this on the way up but I wanted to do it. I have a lot of friends that are here from this area and they're hanging in there, hanging in there. They're not leaving. But in New York State, lost three out of four manufacturing jom -- jobs that existed in 1960. You know when you think of that, three out of four.","Rochester which is an amazing place with amazing people which we see today. Has lost more than half of its manufacturing jobs since 1997 due to NAFTA, Asian currency manipulation and China. I mean, you know, give me a break. I've been talking about this for five years, for seven years, forever. Century Safe just left.","They moved to Mexico, right? No good. No good. I'm the only one who knows how to stop it. I would stop them so fast your heads would spin. And I guarantee you one thing, I'm not buying Century Safe that's for sure right. I'm not buying the product. The entire country lost one-third of its manufacturing jobs since 1997. Think of that.","How sick is that? How sad and how stupid, how stupid is it that we put up with it, one-third of its jobs manufacturing since 1997. Since 1999, Rochester has lost 32% of its transportation jobs, 30% of its building and ground maintenance jobs and 40 -- holy mackerel 43% of its science jobs, 43% gone. All right.","You do. You need somebody fast. I know that. We're going to get it straightened out, folks. It's not even going to be that hard, believe me. It's going to go quickly, a lot quicker than people think. They say, oh, he can't do that. I can do it, you watch. I'll just show you. It's going to go fast.","I mean, how much longer do we have, right? How much longer? It's going to go fast. TPP, Listen to this, Etsy trade pact which is a disaster. It will be worse for you, for Rochester, for upstate New York, for New England, for the entire country. It will be worse than NAFTA. It will be worse. Ted Cruz is totally in favor of it. OK, think of it. Lying Ted, he's a beauty.","I've met a lot tougher people than him over the years but I've never met anybody that could lie like him. Of course, a really good liar doesn't get caught lying, right? He gets caught. Remember with Ben Carson? Ben Carson has left the race he said. Vote for me, he's left. This was during Election Day and Ben Carson endorsed me by the way.","He's a great guy. But TP which is a disaster, both of my competitors now are totally endorsing TPP will give 3,000 foreign companies -- think of this one. Nobody even talks about this. The opportunity to sue New York for the differential in payments because of the United States and New York regulations. We have regulations.","These companies are now going to come in and they're going to sue us because we're allowing them to come in. The whole thing is crazy and we have politicians, they're not so stupid all of them. Some are stupid and some are being taken care of by, as you know, their lobbyists, their special interest. Me, I'm self-funding my campaign, folks.","Nobody's taking care of me. Nobody. No, I mean, think of that. So they're going to come in, we're going to end up with thousands of lawsuits over what? Over the fact that we allow them to come in. Rules and regulations and we have to abide, but we don't have to abide because of them. It's going to end, folks.","The stupidity is going to end. Now, Bausch & Lomb, you know all about Bausch Lomb. They moved their headquarters out of Rochester. Xerox is outsourcing to IBM in different locations. The whole thing is a catastrophe. Could I ask you a question? I love loyalty. I love the fact that you stay. Why did you stay?","Why? Why? You know why you stayed? Because you know if I get elected, Rochester is going to boom again, OK? It's going to boom again. Our whole country is going to boom again. You know, I'll give you a little example. So I hear about Century safes. So I just heard about it today. They left. They're going to Mexico.","They're going to make safes. They're going to let go of 500 people. And here's what's going to happen. And here's what's going to happen, very simply. They're going to make their safe and I'm going to say that's wonderful. It's a wonderful product. Good luck with it. But you're going to pay a nice big tariff for tax when you try and sell that safe to the United States, 100%. And if they know that before they make their decision to move, and before they build their plant, if they know that they're going to be paying a 35% tax, they're not moving, folks.","They're going to stay where they are. They'll be fine. And you know, I watched these politicians, corporate inversion, you see about corporate inversions, it's a huge problem where companies are moving out of the United States. They get lower taxes. And by the way, my tax policy, low taxes, I cut it. Some people -- by far the biggest of any of the candidates that ran and that are currently running, but we cut the taxes way, way down for middle-income people because the middle income has been forgotten in this country.","It's been forgotten, totally forgotten. And we cut them down for business. We're the highest-taxed nation anywhere in the world. We pay more tax than anybody. We have more rules and regulations than anybody. That's how these TPP countries are going to come in. They probably have clauses where, oh, you don't have to go by the rules and regulations.","And they come, they say, oh, you misrepresented because look at all the rules and regulations. Let's sue the United States. Let's sue New York State. Let's sue Rochester, OK? Get your lawyers ready, folks. And TPP is a disaster. End it. All right. So I know how to do this. Now, I watch, I watched these politicians, it's so sad and they don't know how to stop companies from moving.","Well, I know how. You just tell those companies, if you move, you're going to be taxed when you sell your product into the United States and they're not going to move. And they don't want to talk about it because I love free trade. The problem is when you have free trade, you need smart dealers. You need smart negotiators.","You need smart people running your country. We don't have that. We have just the exact opposite, OK? So I like free trade but free trade is not free trade. It's dumb trade because we lose with China. We lose with Mexico. We lose with Japan and Vietnam and every single country that we deal with. We lose with Canada, big league.","Tremendous, tremendous trade deficits with Canada. We lose with everybody. We lose no more is right, no more. It's ended. It's ended. It is ended. And that's why nobody has crowds like this. You know they stopped the buses from coming in an hour ago. There are thousands of people that want to come in and they said they had a fire problem -- look at the size of this hangar.","This is a big hangar it's packed. Now the press, the press which is so dishonest, they won't show that. They won't show that. Now, they don't show it. They don't show it. You know, I just went through -- I came up, they asked me a couple of weeks ago. What do I think of -- thank you very much.","We love you, too. We love these people. We love each other. We want to make our country great again, right? Make America Great Again. You know and I've been saying it, the American dream is dead but I'm going to make it bigger and better and stronger than ever before. You watch. You watch. And somebody said the other day, well, what is your policy, like on the military?","And I said, America first, America first. You know the New York Times just wrote a terrible misrepresentative story which they always do. They've totally -- you know, it's a failing newspaper. It's probably not going to live for another year. But they, they write such negative things. Just so -- and they know it's wrong.","They know it's wrong. They don't call for comment. They don't call for anything because I said, when we defend somebody, when we defend the country, we have to be reimbursed. You know, we defend Japan, we defend, we defend everybody. We're like the world's policeman. By the way, speaking of policemen, how great are the police today?","How great? How great? And our firefighters are great. We love them. But they wrote a story and they leave things out. For instance, we defend Saudi Arabia. Who has more money than Saudi Arabia? They were making before the oil went down. They were making $1 billion a day, OK? $1 billion a day and we defend them and we pay rent on places that we lease for our military.","We pay rent. We take care of everybody. We take care of Germany. We take care of South Korea. We take care of Japan. We take care of everybody and we're not reimbursed on a fair basis. So I said, I said -- whoop, do I hear some people over there? Oh, yeah, oh. I hope so. Hey, camera, they're over there. Get the -- get over there, camera.","The only way the cameras move is there's a disrupter. Then, they move. Then, they move. There is no rally like a Trump rally and nobody gets the people. That I can tell you. So we talked about it and -- Thank you. Thank you. Ooh, I love these people. Hey, we're all in this together, folks.","You know, we're all in this together. Don't forget. Don't forget. The politicians do what their special interests and their lobbyists tell them to do, OK? Just remember. That's why a Ted Cruz who's totally taken care of by the banks, by all sorts of special interests, all of these guys running including Hillary.","You talk about Hillary. I mean the worst. The worst. You saw what Bernie said? They suddenly get angry at each other now. Bernie's saying, she shouldn't be able to be in that position because she's made so many bad decisions, she shouldn't even be running for the position. You saw that.","And she has made bad, bad decisions. Boy, has she made -- I look so forward to going after Hillary, finally, after these guys. It's going to be easy. So the problem is that they're all going to be taken care of and they're all taken care of by different people. You have lobbyists in Washington that specialize in Cruz and they specialize in Hillary.","It says Hillary on their far head. Hillary, I take care of Hillary and they give them millions of dollars through different people, probably through themselves also. They give millions of dollars. And when there's a problem, you go and you hire those people and you say you know, Cruz has caught on to the fact that Century Safe or whoever it is, is moving and they want to be able to move.","They don't want any problems. And you know what, 100%, folks. No problem. With me, they'll come see me and I'm going to say no, no, no. I don't care. Doesn't matter. They're paying they're 35% tariff to get their product. I don't care. And I'm not going to be convinced otherwise. But remember what I just said, a little while ago I said because it's so important.","For you, it's more important than for most people because you've been decimated. You know a lot of areas that I go to they've been hurt. Every place has been hurt. But Rochester in upstate New York has been decimated, OK? Decimated. And let me just tell you. That's why it's so important and I guess that's why I'm killing everybody in New York in the polls.","Why wouldn't I? Why wouldn't I ? Because these politicians are all talk and they're no action. And they'll tell you and they follow what I say. You know they see what I say and then he'll get here, and they'll all get here, and they'll say we've got to tax them. The other day, I heard Ted Cruz say, we want a wall and we'll build a wall.","I said where did that come from all of a sudden out of the blue? Out of the blue. And by the way, speaking of that. We will have strong borders and we will have the wall and Mexico will pay for the wall. Mexico will pay for the wall, believe me. Believe me. See, we're in a -- we're in a really unfair system, folks.","I told you, you've been seeing what's going on and we're winning. And I think we should win before we get to the convention. I think we should. But, but let me tell you how crooked the system is. I go to Louisiana, worked hard, make speeches. I made a speech in a hangar just like this. It was packed. We had like 15,000; 16,000 people the night before the election.","I left. I wasn't expected to win Louisiana and I left. I wasn't expected to win. I won 22 or 23 places. Now, think of it 22, 22. You ever see Cruz, he gets up, the only one that can beat Donald Trump. You know lying Ted. The only one that can beat Donald Trump and then he holds the Bible up high. But I've been winning with the Evangelicals which is incredible.","I mean, they should because they don't like liars. But do you remember in the debate where he said the only one that beats Donald Trump is Ted Cruz, OK? Except for one problem, one problem, what's the problem? He said I beaten him six times. I said yeah, but I beaten you 18 times and he went like, Oh. It was a weird moment, frankly, it was a weird moment.","Now, I've won 21 or 22 states. He's won half that number maybe less than half that number. I've won -- here's what's important which they don't even count because it's a crooked system, folks. It's a crooked system. And in all fairness, take a look at what's happening to Bernie. He wins, he wins, he wins, he wins.","And I hear he doesn't have a chance. This is a crooked system, folks. This is a crooked -- I'm not a fan of Bernie. I couldn't care less. You know as far as I'm concerned, I couldn't care less about Bernie, but he wins and he wins, and he wins like me. I've won twice as much as Cruz. I've won millions and millions of votes more.","People that have never voted are coming out to vote for Trump. People that are Democrats, the Republican primaries, it's up 70, more than 70%, the Democrats are down 35%, surprise me. But the Republicans because of me are up 70%, almost 70%. From four years ago when we had a choke artist named Mitt Romney that should have won that election.","No, he's a choke artist but we're up 70% from four years ago. Now, every one of those people if they try and do their little shenanigans which is politics, as usual, every one of those people that are all enthused and look at all the people here today. And to think we had to stop the buses and thousands -- please apologize to them.","I'll come back. I'll come back. I'll come back. I'll be back a lot. But think of this. So I watched Bernie. He wins. He wins. He keeps winning, winning, winning. And then I see, he's got no chance. They always say he has no chance. Why doesn't he have a chance? Because the system is corrupt and it's worse on the Republican side because I'm up millions of votes on Cruz, millions.","I don't mean like I'm up by two votes. I'm up millions and millions of votes. I'm up by hundreds and hundreds of delegates. I go to Louisiana. I win Louisiana and I say, Isn't that beautiful? I love the people. I sent them a note, thank you very much. I love you, Louisiana. Then I find out that I get less delegates than Cruz because of some nonsense going on. No, I'm telling you.","And I say this to the RNC and I say it to the Republican Party. You're going to have a big problem, folks because you're people that don't like what's going on. You know, they don't like what's going on. I mean, I win the state of Arizona and Cruz wins Utah which is far less in terms of, in terms of the number of delegates, right?","And then I see Cruz. I won Utah. He doesn't talk about the fact that he got killed in Arizona by a landslide. We've got a corrupt system. It's not right. We're supposed to be a democracy. We're supposed to be, we're supposed to be you vote and the vote means something. All right. You vote and the vote means something.","And we've got to do something about it. Now, here's what's going to happen. We're doing fine. We should have won it a long time ago. But you know we keep losing where we're winning. Today, winning votes doesn't mean anything. This is the only job. Have you ever heard anybody say other than me, today, that Donald Trump has millions of votes more than Cruz, OK? I have millions of votes more than Cruz.","And nobody talks about that. Delegates, I have I think about 200, maybe more than that, more. But it's not right, folks because what they're doing and whether it's me or whether it's Bernie Sanders when I look at it and I see all these victories that I have, all these victories that he's got, and then you look at the establishment.","And I want to tell you, it's a corrupt deal going on in this country and it's not good. It's not good and it's not fair and it's not fair to you people. A reporter, very fair reporter just asked me what do you think would happen if you didn't get it, Mr. Trump. You have all these people, they've never seen -- by the way, there's a record crowd.","They've never had a crowd like that in the history of this place. And that's with many thousands of people being turned away. The buses couldn't take them here because obviously, you don't have any room. But with all of that, they said this is a record crowd over 10,000 people. They've never had anything like this.","And you know what, folks? You know what? They're taking your vote away. They're disenfranchising people that want to see America be great again. And politicians will never do it. They don't want to do it. They can't do it because they're their lobbyists and special interests are saying we're not going to let you do it. It's no good.","And we've got to change the system. And it's got to change fast. So I think we're going to be fine. We're doing really well, but we've got to have a system where voting means something. Doesn't it have to mean something? OK? So Rochester, listen to this beauty, Rochester lost 90,000 jobs since 1970, 4,000 jobs in the last six months, 4,000 jobs in six months.","Don't leave. Don't leave, Rochester. I'm telling you I will bring it back so fast. Oh, and then, they have the Rochester unemployment rate is higher than the state and all of that stuff. I mean, it's, it's really, it's really a sad situation. So we're going to make the greatest trade deals ever made by any country.","I'm good at that stuff. That's what I do. I built a great company, tremendous assets, some of the great assets of the world Doral, Turnberry, great buildings all over the place. And you know it's funny when I put my papers in. Everyone said, well, he won't file, you know, nobody knows because I'm private.","So nobody knows. So I put the papers in. The press goes there. They were so devastated to see how great. And I'm not bragging about, I'm just saying that's the kind of thinking the country needs now. They need thinking like thinking. They need smart thinking. I built a company with some of the greatest assets in the world but tremendous cash flow very, very low debt.","And people haven't seen anything like it. And it's you know, it's phenomenal and all filed. They all said, well, maybe he'll take a long time to file. I didn't take a long time. I actually filed ahead of schedule. In fact, if I wasn't going to run, I probably would have filed anyway because it's a form of bragging.","That's how good the company is, OK? I think I would have filed anyway. But I made the decision to run. And the reason I did was I just had it. I watched the Iran deal being made which now turns out to be a disaster. And I could have said it was a disaster. When they started negotiating with infinity years.","Did you ever see a deal take so long, OK? Now, Kerry did not read the art of the deal by the way. Kerry is an incompetent negotiator, Barack Obama is an incompetent -- Obama is an incompetent negotiator except when he negotiates against Republicans. He gets everything he wants. You know it's interesting, a friend of mine brought up something.","They talked about, right? Three or four years ago, they said, if we could only have the House, we got the House. Then they said, if we could only have the Senate, we got the Senate and you know what? It's gotten worse. It's worse. The omnibus budget is a disaster. It lets people come in from Syria, it funds it. It funds illegal immigrations coming across the border.","It funds Obamacare which we're going to repeal and replace, OK? But do you ever notice that? I said it the other day. The first time I said, you know Obama's a lousy negotiator for us but he's a great negotiator against the Republicans. It's pretty sad. It's pretty sad. Is it true though? Is it true? He gets everything.","He gets everything he wants. I watched Boehner say, we will not shut down the country. Well, I don't want to shut down the country either. You know we're in negotiation for the budget. Just before he got out, Boehner was there and he said, we will not, we will not shut down the country. Now, he may believe that and I believe it, and certainly, I don't want to do it either.","But why do you say that? Why do you talk about it? Now once he said that, I said, now the Republicans can't make a good deal because he gave away all the cards. Once he said that I don't want to shut down the country. For the press, I'm saying this because you know they'll say, Trump wants to shut down the country.","You know it was amazing. I got to finish the story about the Times. So the Times which is totally dishonest, it totally -- total piece of garbage. That, the Washington Post, these are -- how about that stupid Boston Globe. It's worthless, all for a dollar. Did you see that story? The whole front page state -- they made up a story that Trump, they pretended Trump is the President, and they made up the whole front pages of make-believe story which is really no different from the whole paper for the whole thing.","I mean, the whole thing is made up. And I think they're having a big backlash on that one. You know, here's a paper that the New York Times spent $1.3 billion to buy, they spent hundreds of millions of dollars on losses and operations. They re-computerized it, they spent a fortune. Let's assume they're in for $1.5 billion.","They sold it for $1, $1 and then, they do editorials telling me what I should be doing about Japan and about Saudi Arabia and about other countries that we defend, OK? So they wrote a totally dishonest story, totally dishonest and they basically knew but they don't put everything in. So we talked about as an example Japan or Saudi Arabia or any of them.","And I said no, no, no. We have to go to them. They have to pay their fair share. Now, I don't want them to defend themselves and nobody is stronger and nuclear than I am. It's the biggest single problem that this world has not global warming. You know Obama said, the biggest problem we have is global warming.","And by the way, it's supposed to be 70 degrees today, it's freezing here. Speaking of global warming where is we need some global warming? It's freezing, man. In fact, this is a record cold spell on the whole big section of the United States, it's not just Rochester. The whole big sections like record, record cold and I keep hearing about global warming.","Now they'll say, he doesn't understand. This is a worldwide problem. Oh no, I don't understand. Let's do IQ tests. So these people. These people. I said basically, no, I want to defend Japan and other countries. You know in South Korea, we have 28,000 soldiers on the line between the maniac and South Korea, North Korea and right.","We have 28,000 young, brilliant, beautiful, wonderful soldiers that are in harm's way. That are in harm's way that we love, that parents love, love, love and they're very nervous. And we have this guy over there talking nuclear, talking everything else and talking about you know, you ever see his armies?","They're very big and we have our people over there, and we're not properly reimbursed, OK? And Japan is not properly reimbursing and Saudi Arabia again, $1 billion a day. What are we doing, folks? They got to take care -- we got -- if we weren't in Saudi Arabia, if we were protecting them, they wouldn't be there for one week.","Believe me not one week and yet they make the money with you. And by the way, this has nothing to do with Saudi Arabia. I have so many friends from Saudi Arabia. So many friends in Japan, so many friends. I have buildings in South Korea. But you know what? What's fair is fair. I'm more interested in our country.","These are people, these are countries that are behemoths. Economic Germany, Germany. It's an economic behemoth, by the way, even though she is in the process of destroying Germany with immigration, destroying it. Do you know that she was person of the year? And I would have gotten it, if she didn't get it. And now they're saying, I think we made a mistake in picking Merkel.","We should have picked Trump. Time Magazine. The -- who cares. I've been on the cover of Time Magazine a lot lately. You know what they're doing. The reason I've been on so much is because it's a movement. What we have going is a movement. Now, they're trying to subvert the movement. They can't do it with bodies, they can't do it with people because they don't have near the people that we have.","So what they're trying to do is subvert the movement with crooked shenanigans, all right? And we're just not going to let it happen. We're not going to let it happen. We can't let it happen because we can bring this country back so fast, so fast. There are so many forces against us. They've been against wage earners for forever it seems.","But 17 years, 17 years people have not had an effective wage increase in this area, 17 years, they haven't had. And then, you wonder why are they angry? In fact, a writer came to me and said, Mr. Trump are you angry? I said no, I'm not angry. I know what's fair. Well, you're people are angry. I said, no they're not angry.","They're not angry people. You're not angry people but you're tired and you're sick of watching the stupidity and the thefts and you're watching the world take our country away from us. And that's exactly what's happening. Exactly. So I told the New York Times as plainly as you're standing there and I'm sorry we couldn't get your chairs.","There are just too many people. But I told the New York Times, I said no, no. They have to pay for these services that something commensurate. Even if we lose something but we can't -- we're losing our shirts on every single deal. We lose on trade. We lose on the military. You know people say, we have a military budget which is true, that's many, many times any budget, anywhere in the world.","That's true. You know why? Because we're defending everybody else. We're not taking care of ourselves. We don't take care of ourselves. Now, remember this in a deal and I wrote this in the art of the deal. You always have to be prepared to walk. Kerry, there it is right there. One of the great books of all time.","The Bible is the best. One of the great books. But I wrote you always have to be prepared to walk. Now, if Kerry would have gotten up a couple of times from the Iran deal. Like for instance, he should have said, before we start negotiating, we have to have our prisoners back. This is like three, four years ago.","They would have said no, great negotiators the Iranians, the Persians are great negotiators, all right? So they would have said no, we won't do that. And I would have said, if it was me, I would have said bye-bye. We're going. And then you double up the sanctions, you'll have your prisoners back within 24 hours 100%, 100%. I then would have gone very, very easily.","I would have gone and I would have said listen, the 150 billion, sorry, we don't have it. Do I ever tell you the story -- my father, he thought I was a little bit rough around the edges. He said son, you've got to take the lumps out, the lumps. You've got to be a little softer. So in the old days, I would have said we're not giving you the $150 billion, you know, there'll be a lot of anger and it takes longer to heal.","But he would have said differently. He would have said no, no, no we have a problem. Our country owes $19 trillion soon because of the crazy omnibus budget that was just passed by the Republicans, it's going to be $21 trillion. And honestly, we don't have the money. We can't give you the $150 billion. I'm sorry.","And you know what they would have done? They would have gotten very angry within two weeks. They would have come back. We would have come back. We would have saved $150 billion. Believe me, 100%, OK? We gave them $150 billion and they go out and buy Airbus. They go out and buy missiles from Russia. They buy from everybody by us, and by the way, we have a prohibition that they can't buy.","Now, I think that prohibition's great but when we hand them 150 billion, we should take the prohibition off for a little while. Don't you think? Let them buy from Rochester, New York. We don't care if they're from Iran, right? We'll sell them missiles that don't work correctly, right? Let them sue us. Tell them to sue us. Oh, I'm sorry.","They don't work. Gee, that's too bad. We'll take in about $12 billion for missiles and they'll say these missiles are terrible. I said yup, that was the purpose of it. But they're buying missiles that do work, folks, and really because of us. So, so many different things. I talk about Sergeant Bergdahl. We get Bergdahl, a traitor.","No, we get a traitor. Who by the way six people at least, but six people five known, but six people were killed looking for him. So we get Bergdahl and they get five of the people that they most coveted in Gitmo which we're keeping open by the way, 100% they will fill it up. So they get five killers that they most coveted, that they most wanted of anything, all right?","So look, when I started this on June 16th, and it takes guts to run for president, what do I know about this, OK? It takes guts, not easy. The last thing I ever thought I'd be is a politician. Can you believe I'm a politician, ay. Don't tell me. Don't tell me. But it does. It takes guts to run for President.","And I said I've just had it. I've had this stupidity. I've had these trade deals whether it's Century Safe or whether it's Carrier or whether it's Ford moving their big operations to Mexico or whether it's Nabisco closing their plant in Chicago, a place that needs some help and they close their plant in Chicago and they're moving it to Mexico.","How stupid are we, folks? How stupid. How stupid are the leaders of this country? We're not going to let them. We're not letting them get away with it anymore. We're not going to let it happen. We're not going to let it happen. So, so we're going to do things and I came down the escalator with Melania and I took a deep breath and I said she'll make a great first lady, I will say.","True. I took a deep breath and I said let's go. And there were cameras downstairs I say it all the time. I'm telling you it looked like the Academy Awards. Look at all of them back there. Look, look what we brought to Rochester today. Look at those people. Look at those cameras. Oh, if only when they -- if they were only honest.","If they'd only really follow the camera. You know what some of them do? They wait till everybody leaves. Now it's empty. And then they'll say we're here at the arena where Donald -- and everybody looks and they see this big empty space. They don't show it like this. They are really, really bad, dishonest people.","But that's OK. You know after a while you learn to live with it, OK? To finish up one thing and then I'm going to tell you where it started and where it's going and then we're going to have a quick thing and then I'm going to just tell you one thing, we're going to start winning again. We're going to start winning again, folks.","So when I talked about to the New York Times, when I talked about defense and this and that. I talked about they have to pay and if they don't pay, well, we have to be prepared to walk. So they said, well, would you walk? Well, we may have to be prepared because we cannot continue to go on with this where we're defending Japan.","We love Japan. I have many friends in Japan. I love Mexico, many friends in Mexico. Have thousands of people working from me, Hispanics. And in Nevada, when I had the poll, I won Nevada, the state of Nevada in a landslide. They did a poll of Hispanics. I won the Hispanics by a lot, a lot, OK? They're great.","They're great but their leaders are too smart for us. Their leaders are too cunning for us. What happens though is when I talk about, anyone of the countries, let's say Japan. I say, no, they have to take care of us. We can't continue to lose the kind of money that we're losing defending all these countries that, by the way, are making a fortune.","Look at the cars that come pouring into this country. From Los Angeles you go -- at the largest ships, I've ever seen. They're loaded up with cars from Japan. They come pouring in. And in fact, Obama said, the Japanese are very worried about the rhetoric of Trump. They should be worried, honestly, they've got to pay.","They've got to pay. They got to pay. And we don't mean -- I'll tell you what. I would bet that I will get along better with Japan than Obama does. And they rip us off. We will be treat -- we'll treat them very fairly. I want to treat them fairly. I'm going to treat everybody fairly. Look at China, $505 billion yearly trade deficit and they go and build a massive military complex in the middle of the South China Sea which they're not allowed to do, and we don't do anything about it. We have so much power over these countries because of our, our -- the power of trade.","And we don't know, we have leaders that don't realize that we have power. So as with Japan, with any of them, but with Japan. I'd say very nicely, listen, we need help. You've got to take care. We don't want you to arm. But you know what, you have to be prepared. You have the maniac, Japan is concerned about him.","You know, there is a school of thought that Japan would be better off taking care of him and let us sit home and watch it on television for a change. Does that make any sense? I mean, you could make the case. You know, we have now nine countries that are nuclear, right? Nine. So they said, oh, Donald Trump.","And now here's the thing. So I said no, no, I'd negotiate with them. I'd be prepared to walk but I'd negotiate with them, and they have to pay a lot more money, and they have to you know -- we got to get our house back in order, right? So I said, I would prepare and I'd much rather take care of them. They have to pay us but I'd much rather take care of them.","But I would be prepared. The question was what? Would you walk? Yeah, I'd be prepared. So I have these phony stories come out in the Washington Post which is, by the way, a total rag. What a rag. And the reason it's there is to protect a company which I'll talk to you about very soon because I'm right a whole big thing about it. Uh, the owner of the Washington Post, you know what he owns?","Amazon. Do you know how little tax Amazon pays? So he uses the Washington Post to protect Amazon from taxes, OK? That's all it is, folks. And they go crazy. They write on average like eight stories a day on me. I have so many stories I can't even read them. I can't even read the good ones when they happen which is seldom, which is seldom.","And the New York Times, I'm telling you, The Washington Post was purchased by a . It's a loser. Losing money hand over fist. The Washington Post was purchased by the gentleman that runs and has a big stake in Amazon, right? You know his name. Correct, Bezos. You know his name. So now he uses that as a political weapon because he doesn't want to pay tax at Amazon.","That's all it is, folks. It's so simple. It's so simple. And every time they hear me say it. Now, watch tomorrow I'll have 15 bad stories in the Washington Post and all I'm doing is wanting to protect you, folks. I get it. I understand it. I get it. So don't worry about them. You know what? Their voices aren't strong enough.","Just lets -- They're trying to protect Bezos. So the story comes out in the New York Times that basically, Donald Trump wants to see an armed Japan. Donald Trump, they don't talk about costs. They don't talk about the fact that they have to pay their way.","It's Donald Trump doesn't mind seeing an armed Japan. Well, I do. But what I say is they have to pay. Does that make sense to you, folks, OK? Does that make sense? These are unbelievably, unbelievably, dishonest people. I'll give you an example. We had one guy upfront. He raised his hand. He said two words.","We had that person in the back who said a couple of words. Tomorrow the headline will be major protest at Trump rallies, there's no protest. We got 10,000 people, we turned away 5,000 or 6,000, unfortunately. And with all these people, we had two people raise their hands. Tomorrow the headline won't even be about defending Japan.","It will be about Trump had a protest. Let me tell you. Our rallies are the safest rallies of anywhere, the safest. We have the safest rallies of anywhere. And you know what's nice about our rallies? Because a lot of these people are agitators. You look at them, they have professionally done signs. They don't have signs done in their basement.","These are professionally done signs. You know what's nice about our rallies? Our people protect themselves. They protect each other. There's something beautiful. That's the way -- it's called teamwork. That's the way our country is supposed to be. We're supposed to love each other and we will love each other.","We'll love them someday, too. But we're supposed to be protective of each other and there's tremendous love in the rooms. When we have these rallies, tremendous love in the rooms. So on June 16th, come down the escalator. Started talking about illegal immigration and man did that hit a button. And now, Sheriff Joe from Arizona, we love Sheriff Joe, Joe Arpaio.","The Border Patrol, 16,500 Border Patrol people endorsed Donald Trump last week. They've never done it before. They've never done it before. So I said you know, let's see what we could do. Because I talked really about trade because we have to make our country rich again. A woman came up to me and said, wonderful woman, incredible woman, 60 years old.","I said how old? She said 60. I said you look great. She said Mr. Trump, don't say we're going to be rich again. I said I have to say that because if we're not rich again, we can't be great again. We have to bring back our money. We have to bring back our jobs. We have to bring back our industry. It's been stripped by these politicians that don't care or are stupid.","I said, so we have to make our country wealthy again, and we have to make our country great again. I'm the only one going to save Social Security, folks. Ted Cruz wants to cut it. Everybody wants to cut it. I'm the one person because I'm going to bring our jobs back. I'm going to bring our wealth back. And believe me, a lot of those jobs are coming back to Rochester.","Believe me. There's going to be incentives and they're coming back to Rochester. A lot of the jobs, just remember I said it. Remember I said it. So here's the story. So I said on June 16th, I talked about trade and I talked about the border. The borders and illegal immigration were met with, at first it was quiet, and about a week later, do you remember the delayed reaction.","A week later everyone said, whoa, what did he say? They were all saying what a good speech that was. A week later all of a sudden, they just went after me and I said, wow. Now, everybody's saying I was right. They're all saying I was right. I also said, we have to be extremely careful with radical Islamic terrorism and we have to look at the Muslims and we have to do something.","We cannot stand by and be the stupid people while our country is destroyed. You see what's happening in Germany with the crime. You see what's happening in Sweden where they have a small little section. You see what's happening in Brussels. Now in Brussels, a number of weeks ago, I said Brussels is a hellhole.","Before, before the accident, before the horrible tragedy. I said Brussels is a total hellhole. Now, I knew Brussels from many years ago, one of the most beautiful cities in the world. But a couple of months ago, I made the statement Brussels is a hellhole. The New York Times wrote a story. How dare Donald Trump say that?","How dare -- then the blow-up happened. Now, they're all saying Trump was right, again. It's amazing, right? I mean, it's amazing. No, we're right. I'm right. I wrote in my book. In the year 2000, the America we deserve. I wrote in the book, the year 2000, right? I told you about Osama bin Laden. So one of the television host didn't believe it. They brought the book into him.","He said, wow, Trump was talking about this two years before the World Trade Center came down. I promise you, I would have taken that guy out, and you would have had the World Trade Center stand. I would have taken him out. I do know. I'm the one that talked about take the oil, right? I said don't go into Iraq.","It's a mistake and I said it. Don't go into Iraq. I was against going into Iraq. But once we were there, you couldn't get out the way Obama did it. And he gave us an exact date. We are leaving on an exact date. And the enemy sat back and they said, wow, they didn't believe him. They thought it was a camouflage of some type.","They didn't believe him. They said wait a minute. He can't be that stupid. He's given us a date. He's given us a date. He adhered to the date. Now, I said don't go into Iraq but you can't get out without leaving some people behind. Not that it's worth it because it's such a, you know, you talk about hellhole.","There's another hellhole. Now, Iraq is being taken over 100% by Iran. They've been wanting to do that for decades and decades and decades, right? But they're taking over Iran -- Iran is taking over Iraq. The second-largest oil reserves and great stuff in the world and they're taking it over. We made it possible by decimating Iraq and their army and their military.","We made it possible. So Iran's wanted it for years. So not only did Iran go and make one of the great deals ever with us but then they made a much better deal because we decimated Iraq and Iran is now taking it over, OK? And let me tell you, they're taking over Yemen. When you look at the border between Yemen and Saudi Arabia, they don't want Yemen, they want Saudi Arabia.","And never was Saudi Arabia in the trouble they're in now, and they don't want Saudi Arabia, they want the oil, OK? And what I'm saying, folks is they're got to pay. They've got to pay. They've got to take care of us. Why are we the dummies all the time? They've got to take care of us. So when this started, I was talking trade, very strong.","I was talking trade and I was talking borders. By the time it finished, we had a thing called Paris. And speaking of Paris, if some of those people in that room had guns and the same thing with California, same thing with California. If some of those people in those rooms in Paris or that room in California where these two radicalized people that worked with them who were given baby showers for their child.","If some of those people on the other side had guns, wouldn't have been the same story, folks. In Paris, 130, toughest gun laws in the world, 130 people killed. Boom, boom, boom, boom. If some of these people were there and they had guns strapped to their waists, strapped to their ankle, would have been a whole different story.","And probably wouldn't have even happened because they would have said wait a minute don't people have guns. Let's leave them alone. Ok? So, so -- Thank you. So, folks, we're going to start winning again. We're going to start winning again, so important. This is a movement. They want to stop the movement but I don't think they're going to be able to. This is a movement.","This is millions of people, no matter where you go, I go to Dallas we had 21,000 people. I go to Mobile, Alabama we had 35,000 people. I -- no matter where we go, we have the biggest crowds by far. Nobody comes close. The biggest problem we have is we can't get them into these massive hangars. We can never get enough people in. But we have a movement going.","It's an incredible movement. It's actually not a movement of hate. It's a movement of love. Remember that, it is. It's a movement of love. It's a movement of people that want to see our country be smart and strong and, and great again. It's a movement of people that want to be taken care of and they want to take care of. They're going to take care.","It's a movement of people really that want to start winning again because we don't win. We never win anymore. We don't win on trade. We don't win on the military. We don't win on education, by the way, we're ending Common Core. Education is going to be good, right? It's going to be local. We end Common. So, so important.","We got to keep it going. And everyone says, oh, you have these great poll numbers. We need a great show of strength in New York State. It's so important. We need a great show of strength. You got to go. Not this Tuesday but the next Tuesday. Nine days, nine days. You've got to go out and you've got a vote in mass.","You've got to bring your friends. You got to tell them about it. You are going to say this was one of the great days of your lives. You're going to say when you cast that vote in nine days on Tuesday, you're going to say it was the greatest single vote you've ever cast. And here's what's going to happen.","We're going to start winning again, folks. We're going to win with our military. We're going to knock the hell out of ISIS. We're going to win at the border. We're going to build the wall and people are going to respect us. We're going to have our country back. We're going to win with education.","We're going to end Common Core and we are going to bring it local. We are going to win with education. We're going to repeal and replace Obamacare. We're going to protect our Second Amendment and we're going to bring jobs back into this country like you've never ever, ever seen before. We're going to have a great, great economy again.","We're going to have a great, great country again. And you're going to be so proud of your President, but I don't care about that. You're going to be so proud of this country. The American Dream, remember this and I've been saying it, the American dream is dead. But I'm going to make it bigger and better and stronger than ever before.","We are going to Make America Great Again. Thank you, Rochester. Thank you. We love you. Thank you. Thank you, everybody."],"text":" Thank you, everybody. This is amazing. This is amazing. Wow. THis is amazing. Thank you very much. And you know, Rochester is a special place. I've known it for a long time. And we're going to make it better, OK? We're going to make it better. I want to thank -- before I begin, I have to thank some friends, Carl. Carl? Carl Paladino. All right. Get him out of here. Boy, oh, boy. Where do they come from? Where do these people come from? Where do they come fr om? Where do they come from? There's nothing like a Trump rally, folks. I want to thank Carl Paladino, James , Bill Nojay and Bill Reilich. Thank you, kids. Great job. Really great job. So let's talk a little bit about Rochester for a second because we're here, we come upstate, I know what's been going on for a long time. This same group including Carl and many others they asked me to run for Governor. Between you and I, I sort of said I'm sorry but I'm doing something else. I didn't want to say. This is what the something else was. And I think it can have a lot bigger effect on upstate New York and on Rochester by doing what I'm doing that I could have even as Governor. Although you would have been fracking by now, a long time ago, you would have been fracking. I tell you that. It is said that when you go at the line and you see in Pennsylvania machines, bomb, bomb, bomb all the way up and down the line. And yet on the right of the line, we can't have those machines because they're bad for the environment, OK? So explain it. We could have wiped out our debt in New York. We could have wiped out our debt, but hey, we will get it straightened out, folks. One way or the other, we're going to get it straightened out. Here's some statistics. I just did this on the way up but I wanted to do it. I have a lot of friends that are here from this area and they're hanging in there, hanging in there. They're not leaving. But in New York State, lost three out of four manufacturing jom -- jobs that existed in 1960. You know when you think of that, three out of four. Rochester which is an amazing place with amazing people which we see today. Has lost more than half of its manufacturing jobs since 1997 due to NAFTA, Asian currency manipulation and China. I mean, you know, give me a break. I've been talking about this for five years, for seven years, forever. Century Safe just left. They moved to Mexico, right? No good. No good. I'm the only one who knows how to stop it. I would stop them so fast your heads would spin. And I guarantee you one thing, I'm not buying Century Safe that's for sure right. I'm not buying the product. The entire country lost one-third of its manufacturing jobs since 1997. Think of that. How sick is that? How sad and how stupid, how stupid is it that we put up with it, one-third of its jobs manufacturing since 1997. Since 1999, Rochester has lost 32% of its transportation jobs, 30% of its building and ground maintenance jobs and 40 -- holy mackerel 43% of its science jobs, 43% gone. All right. You do. You need somebody fast. I know that. We're going to get it straightened out, folks. It's not even going to be that hard, believe me. It's going to go quickly, a lot quicker than people think. They say, oh, he can't do that. I can do it, you watch. I'll just show you. It's going to go fast. I mean, how much longer do we have, right? How much longer? It's going to go fast. TPP, Listen to this, Etsy trade pact which is a disaster. It will be worse for you, for Rochester, for upstate New York, for New England, for the entire country. It will be worse than NAFTA. It will be worse. Ted Cruz is totally in favor of it. OK, think of it. Lying Ted, he's a beauty. I've met a lot tougher people than him over the years but I've never met anybody that could lie like him. Of course, a really good liar doesn't get caught lying, right? He gets caught. Remember with Ben Carson? Ben Carson has left the race he said. Vote for me, he's left. This was during Election Day and Ben Carson endorsed me by the way. He's a great guy. But TP which is a disaster, both of my competitors now are totally endorsing TPP will give 3,000 foreign companies -- think of this one. Nobody even talks about this. The opportunity to sue New York for the differential in payments because of the United States and New York regulations. We have regulations. These companies are now going to come in and they're going to sue us because we're allowing them to come in. The whole thing is crazy and we have politicians, they're not so stupid all of them. Some are stupid and some are being taken care of by, as you know, their lobbyists, their special interest. Me, I'm self-funding my campaign, folks. Nobody's taking care of me. Nobody. No, I mean, think of that. So they're going to come in, we're going to end up with thousands of lawsuits over what? Over the fact that we allow them to come in. Rules and regulations and we have to abide, but we don't have to abide because of them. It's going to end, folks. The stupidity is going to end. Now, Bausch & Lomb, you know all about Bausch Lomb. They moved their headquarters out of Rochester. Xerox is outsourcing to IBM in different locations. The whole thing is a catastrophe. Could I ask you a question? I love loyalty. I love the fact that you stay. Why did you stay? Why? Why? You know why you stayed? Because you know if I get elected, Rochester is going to boom again, OK? It's going to boom again. Our whole country is going to boom again. You know, I'll give you a little example. So I hear about Century safes. So I just heard about it today. They left. They're going to Mexico. They're going to make safes. They're going to let go of 500 people. And here's what's going to happen. And here's what's going to happen, very simply. They're going to make their safe and I'm going to say that's wonderful. It's a wonderful product. Good luck with it. But you're going to pay a nice big tariff for tax when you try and sell that safe to the United States, 100%. And if they know that before they make their decision to move, and before they build their plant, if they know that they're going to be paying a 35% tax, they're not moving, folks. They're going to stay where they are. They'll be fine. And you know, I watched these politicians, corporate inversion, you see about corporate inversions, it's a huge problem where companies are moving out of the United States. They get lower taxes. And by the way, my tax policy, low taxes, I cut it. Some people -- by far the biggest of any of the candidates that ran and that are currently running, but we cut the taxes way, way down for middle-income people because the middle income has been forgotten in this country. It's been forgotten, totally forgotten. And we cut them down for business. We're the highest-taxed nation anywhere in the world. We pay more tax than anybody. We have more rules and regulations than anybody. That's how these TPP countries are going to come in. They probably have clauses where, oh, you don't have to go by the rules and regulations. And they come, they say, oh, you misrepresented because look at all the rules and regulations. Let's sue the United States. Let's sue New York State. Let's sue Rochester, OK? Get your lawyers ready, folks. And TPP is a disaster. End it. All right. So I know how to do this. Now, I watch, I watched these politicians, it's so sad and they don't know how to stop companies from moving. Well, I know how. You just tell those companies, if you move, you're going to be taxed when you sell your product into the United States and they're not going to move. And they don't want to talk about it because I love free trade. The problem is when you have free trade, you need smart dealers. You need smart negotiators. You need smart people running your country. We don't have that. We have just the exact opposite, OK? So I like free trade but free trade is not free trade. It's dumb trade because we lose with China. We lose with Mexico. We lose with Japan and Vietnam and every single country that we deal with. We lose with Canada, big league. Tremendous, tremendous trade deficits with Canada. We lose with everybody. We lose no more is right, no more. It's ended. It's ended. It is ended. And that's why nobody has crowds like this. You know they stopped the buses from coming in an hour ago. There are thousands of people that want to come in and they said they had a fire problem -- look at the size of this hangar. This is a big hangar it's packed. Now the press, the press which is so dishonest, they won't show that. They won't show that. Now, they don't show it. They don't show it. You know, I just went through -- I came up, they asked me a couple of weeks ago. What do I think of -- thank you very much. We love you, too. We love these people. We love each other. We want to make our country great again, right? Make America Great Again. You know and I've been saying it, the American dream is dead but I'm going to make it bigger and better and stronger than ever before. You watch. You watch. And somebody said the other day, well, what is your policy, like on the military? And I said, America first, America first. You know the New York Times just wrote a terrible misrepresentative story which they always do. They've totally -- you know, it's a failing newspaper. It's probably not going to live for another year. But they, they write such negative things. Just so -- and they know it's wrong. They know it's wrong. They don't call for comment. They don't call for anything because I said, when we defend somebody, when we defend the country, we have to be reimbursed. You know, we defend Japan, we defend, we defend everybody. We're like the world's policeman. By the way, speaking of policemen, how great are the police today? How great? How great? And our firefighters are great. We love them. But they wrote a story and they leave things out. For instance, we defend Saudi Arabia. Who has more money than Saudi Arabia? They were making before the oil went down. They were making $1 billion a day, OK? $1 billion a day and we defend them and we pay rent on places that we lease for our military. We pay rent. We take care of everybody. We take care of Germany. We take care of South Korea. We take care of Japan. We take care of everybody and we're not reimbursed on a fair basis. So I said, I said -- whoop, do I hear some people over there? Oh, yeah, oh. I hope so. Hey, camera, they're over there. Get the -- get over there, camera. The only way the cameras move is there's a disrupter. Then, they move. Then, they move. There is no rally like a Trump rally and nobody gets the people. That I can tell you. So we talked about it and -- Thank you. Thank you. Ooh, I love these people. Hey, we're all in this together, folks. You know, we're all in this together. Don't forget. Don't forget. The politicians do what their special interests and their lobbyists tell them to do, OK? Just remember. That's why a Ted Cruz who's totally taken care of by the banks, by all sorts of special interests, all of these guys running including Hillary. You talk about Hillary. I mean the worst. The worst. You saw what Bernie said? They suddenly get angry at each other now. Bernie's saying, she shouldn't be able to be in that position because she's made so many bad decisions, she shouldn't even be running for the position. You saw that. And she has made bad, bad decisions. Boy, has she made -- I look so forward to going after Hillary, finally, after these guys. It's going to be easy. So the problem is that they're all going to be taken care of and they're all taken care of by different people. You have lobbyists in Washington that specialize in Cruz and they specialize in Hillary. It says Hillary on their far head. Hillary, I take care of Hillary and they give them millions of dollars through different people, probably through themselves also. They give millions of dollars. And when there's a problem, you go and you hire those people and you say you know, Cruz has caught on to the fact that Century Safe or whoever it is, is moving and they want to be able to move. They don't want any problems. And you know what, 100%, folks. No problem. With me, they'll come see me and I'm going to say no, no, no. I don't care. Doesn't matter. They're paying they're 35% tariff to get their product. I don't care. And I'm not going to be convinced otherwise. But remember what I just said, a little while ago I said because it's so important. For you, it's more important than for most people because you've been decimated. You know a lot of areas that I go to they've been hurt. Every place has been hurt. But Rochester in upstate New York has been decimated, OK? Decimated. And let me just tell you. That's why it's so important and I guess that's why I'm killing everybody in New York in the polls. Why wouldn't I? Why wouldn't I ? Because these politicians are all talk and they're no action. And they'll tell you and they follow what I say. You know they see what I say and then he'll get here, and they'll all get here, and they'll say we've got to tax them. The other day, I heard Ted Cruz say, we want a wall and we'll build a wall. I said where did that come from all of a sudden out of the blue? Out of the blue. And by the way, speaking of that. We will have strong borders and we will have the wall and Mexico will pay for the wall. Mexico will pay for the wall, believe me. Believe me. See, we're in a -- we're in a really unfair system, folks. I told you, you've been seeing what's going on and we're winning. And I think we should win before we get to the convention. I think we should. But, but let me tell you how crooked the system is. I go to Louisiana, worked hard, make speeches. I made a speech in a hangar just like this. It was packed. We had like 15,000; 16,000 people the night before the election. I left. I wasn't expected to win Louisiana and I left. I wasn't expected to win. I won 22 or 23 places. Now, think of it 22, 22. You ever see Cruz, he gets up, the only one that can beat Donald Trump. You know lying Ted. The only one that can beat Donald Trump and then he holds the Bible up high. But I've been winning with the Evangelicals which is incredible. I mean, they should because they don't like liars. But do you remember in the debate where he said the only one that beats Donald Trump is Ted Cruz, OK? Except for one problem, one problem, what's the problem? He said I beaten him six times. I said yeah, but I beaten you 18 times and he went like, Oh. It was a weird moment, frankly, it was a weird moment. Now, I've won 21 or 22 states. He's won half that number maybe less than half that number. I've won -- here's what's important which they don't even count because it's a crooked system, folks. It's a crooked system. And in all fairness, take a look at what's happening to Bernie. He wins, he wins, he wins, he wins. And I hear he doesn't have a chance. This is a crooked system, folks. This is a crooked -- I'm not a fan of Bernie. I couldn't care less. You know as far as I'm concerned, I couldn't care less about Bernie, but he wins and he wins, and he wins like me. I've won twice as much as Cruz. I've won millions and millions of votes more. People that have never voted are coming out to vote for Trump. People that are Democrats, the Republican primaries, it's up 70, more than 70%, the Democrats are down 35%, surprise me. But the Republicans because of me are up 70%, almost 70%. From four years ago when we had a choke artist named Mitt Romney that should have won that election. No, he's a choke artist but we're up 70% from four years ago. Now, every one of those people if they try and do their little shenanigans which is politics, as usual, every one of those people that are all enthused and look at all the people here today. And to think we had to stop the buses and thousands -- please apologize to them. I'll come back. I'll come back. I'll come back. I'll be back a lot. But think of this. So I watched Bernie. He wins. He wins. He keeps winning, winning, winning. And then I see, he's got no chance. They always say he has no chance. Why doesn't he have a chance? Because the system is corrupt and it's worse on the Republican side because I'm up millions of votes on Cruz, millions. I don't mean like I'm up by two votes. I'm up millions and millions of votes. I'm up by hundreds and hundreds of delegates. I go to Louisiana. I win Louisiana and I say, Isn't that beautiful? I love the people. I sent them a note, thank you very much. I love you, Louisiana. Then I find out that I get less delegates than Cruz because of some nonsense going on. No, I'm telling you. And I say this to the RNC and I say it to the Republican Party. You're going to have a big problem, folks because you're people that don't like what's going on. You know, they don't like what's going on. I mean, I win the state of Arizona and Cruz wins Utah which is far less in terms of, in terms of the number of delegates, right? And then I see Cruz. I won Utah. He doesn't talk about the fact that he got killed in Arizona by a landslide. We've got a corrupt system. It's not right. We're supposed to be a democracy. We're supposed to be, we're supposed to be you vote and the vote means something. All right. You vote and the vote means something. And we've got to do something about it. Now, here's what's going to happen. We're doing fine. We should have won it a long time ago. But you know we keep losing where we're winning. Today, winning votes doesn't mean anything. This is the only job. Have you ever heard anybody say other than me, today, that Donald Trump has millions of votes more than Cruz, OK? I have millions of votes more than Cruz. And nobody talks about that. Delegates, I have I think about 200, maybe more than that, more. But it's not right, folks because what they're doing and whether it's me or whether it's Bernie Sanders when I look at it and I see all these victories that I have, all these victories that he's got, and then you look at the establishment. And I want to tell you, it's a corrupt deal going on in this country and it's not good. It's not good and it's not fair and it's not fair to you people. A reporter, very fair reporter just asked me what do you think would happen if you didn't get it, Mr. Trump. You have all these people, they've never seen -- by the way, there's a record crowd. They've never had a crowd like that in the history of this place. And that's with many thousands of people being turned away. The buses couldn't take them here because obviously, you don't have any room. But with all of that, they said this is a record crowd over 10,000 people. They've never had anything like this. And you know what, folks? You know what? They're taking your vote away. They're disenfranchising people that want to see America be great again. And politicians will never do it. They don't want to do it. They can't do it because they're their lobbyists and special interests are saying we're not going to let you do it. It's no good. And we've got to change the system. And it's got to change fast. So I think we're going to be fine. We're doing really well, but we've got to have a system where voting means something. Doesn't it have to mean something? OK? So Rochester, listen to this beauty, Rochester lost 90,000 jobs since 1970, 4,000 jobs in the last six months, 4,000 jobs in six months. Don't leave. Don't leave, Rochester. I'm telling you I will bring it back so fast. Oh, and then, they have the Rochester unemployment rate is higher than the state and all of that stuff. I mean, it's, it's really, it's really a sad situation. So we're going to make the greatest trade deals ever made by any country. I'm good at that stuff. That's what I do. I built a great company, tremendous assets, some of the great assets of the world Doral, Turnberry, great buildings all over the place. And you know it's funny when I put my papers in. Everyone said, well, he won't file, you know, nobody knows because I'm private. So nobody knows. So I put the papers in. The press goes there. They were so devastated to see how great. And I'm not bragging about, I'm just saying that's the kind of thinking the country needs now. They need thinking like thinking. They need smart thinking. I built a company with some of the greatest assets in the world but tremendous cash flow very, very low debt. And people haven't seen anything like it. And it's you know, it's phenomenal and all filed. They all said, well, maybe he'll take a long time to file. I didn't take a long time. I actually filed ahead of schedule. In fact, if I wasn't going to run, I probably would have filed anyway because it's a form of bragging. That's how good the company is, OK? I think I would have filed anyway. But I made the decision to run. And the reason I did was I just had it. I watched the Iran deal being made which now turns out to be a disaster. And I could have said it was a disaster. When they started negotiating with infinity years. Did you ever see a deal take so long, OK? Now, Kerry did not read the art of the deal by the way. Kerry is an incompetent negotiator, Barack Obama is an incompetent -- Obama is an incompetent negotiator except when he negotiates against Republicans. He gets everything he wants. You know it's interesting, a friend of mine brought up something. They talked about, right? Three or four years ago, they said, if we could only have the House, we got the House. Then they said, if we could only have the Senate, we got the Senate and you know what? It's gotten worse. It's worse. The omnibus budget is a disaster. It lets people come in from Syria, it funds it. It funds illegal immigrations coming across the border. It funds Obamacare which we're going to repeal and replace, OK? But do you ever notice that? I said it the other day. The first time I said, you know Obama's a lousy negotiator for us but he's a great negotiator against the Republicans. It's pretty sad. It's pretty sad. Is it true though? Is it true? He gets everything. He gets everything he wants. I watched Boehner say, we will not shut down the country. Well, I don't want to shut down the country either. You know we're in negotiation for the budget. Just before he got out, Boehner was there and he said, we will not, we will not shut down the country. Now, he may believe that and I believe it, and certainly, I don't want to do it either. But why do you say that? Why do you talk about it? Now once he said that, I said, now the Republicans can't make a good deal because he gave away all the cards. Once he said that I don't want to shut down the country. For the press, I'm saying this because you know they'll say, Trump wants to shut down the country. You know it was amazing. I got to finish the story about the Times. So the Times which is totally dishonest, it totally -- total piece of garbage. That, the Washington Post, these are -- how about that stupid Boston Globe. It's worthless, all for a dollar. Did you see that story? The whole front page state -- they made up a story that Trump, they pretended Trump is the President, and they made up the whole front pages of make-believe story which is really no different from the whole paper for the whole thing. I mean, the whole thing is made up. And I think they're having a big backlash on that one. You know, here's a paper that the New York Times spent $1.3 billion to buy, they spent hundreds of millions of dollars on losses and operations. They re-computerized it, they spent a fortune. Let's assume they're in for $1.5 billion. They sold it for $1, $1 and then, they do editorials telling me what I should be doing about Japan and about Saudi Arabia and about other countries that we defend, OK? So they wrote a totally dishonest story, totally dishonest and they basically knew but they don't put everything in. So we talked about as an example Japan or Saudi Arabia or any of them. And I said no, no, no. We have to go to them. They have to pay their fair share. Now, I don't want them to defend themselves and nobody is stronger and nuclear than I am. It's the biggest single problem that this world has not global warming. You know Obama said, the biggest problem we have is global warming. And by the way, it's supposed to be 70 degrees today, it's freezing here. Speaking of global warming where is we need some global warming? It's freezing, man. In fact, this is a record cold spell on the whole big section of the United States, it's not just Rochester. The whole big sections like record, record cold and I keep hearing about global warming. Now they'll say, he doesn't understand. This is a worldwide problem. Oh no, I don't understand. Let's do IQ tests. So these people. These people. I said basically, no, I want to defend Japan and other countries. You know in South Korea, we have 28,000 soldiers on the line between the maniac and South Korea, North Korea and right. We have 28,000 young, brilliant, beautiful, wonderful soldiers that are in harm's way. That are in harm's way that we love, that parents love, love, love and they're very nervous. And we have this guy over there talking nuclear, talking everything else and talking about you know, you ever see his armies? They're very big and we have our people over there, and we're not properly reimbursed, OK? And Japan is not properly reimbursing and Saudi Arabia again, $1 billion a day. What are we doing, folks? They got to take care -- we got -- if we weren't in Saudi Arabia, if we were protecting them, they wouldn't be there for one week. Believe me not one week and yet they make the money with you. And by the way, this has nothing to do with Saudi Arabia. I have so many friends from Saudi Arabia. So many friends in Japan, so many friends. I have buildings in South Korea. But you know what? What's fair is fair. I'm more interested in our country. These are people, these are countries that are behemoths. Economic Germany, Germany. It's an economic behemoth, by the way, even though she is in the process of destroying Germany with immigration, destroying it. Do you know that she was person of the year? And I would have gotten it, if she didn't get it. And now they're saying, I think we made a mistake in picking Merkel. We should have picked Trump. Time Magazine. The -- who cares. I've been on the cover of Time Magazine a lot lately. You know what they're doing. The reason I've been on so much is because it's a movement. What we have going is a movement. Now, they're trying to subvert the movement. They can't do it with bodies, they can't do it with people because they don't have near the people that we have. So what they're trying to do is subvert the movement with crooked shenanigans, all right? And we're just not going to let it happen. We're not going to let it happen. We can't let it happen because we can bring this country back so fast, so fast. There are so many forces against us. They've been against wage earners for forever it seems. But 17 years, 17 years people have not had an effective wage increase in this area, 17 years, they haven't had. And then, you wonder why are they angry? In fact, a writer came to me and said, Mr. Trump are you angry? I said no, I'm not angry. I know what's fair. Well, you're people are angry. I said, no they're not angry. They're not angry people. You're not angry people but you're tired and you're sick of watching the stupidity and the thefts and you're watching the world take our country away from us. And that's exactly what's happening. Exactly. So I told the New York Times as plainly as you're standing there and I'm sorry we couldn't get your chairs. There are just too many people. But I told the New York Times, I said no, no. They have to pay for these services that something commensurate. Even if we lose something but we can't -- we're losing our shirts on every single deal. We lose on trade. We lose on the military. You know people say, we have a military budget which is true, that's many, many times any budget, anywhere in the world. That's true. You know why? Because we're defending everybody else. We're not taking care of ourselves. We don't take care of ourselves. Now, remember this in a deal and I wrote this in the art of the deal. You always have to be prepared to walk. Kerry, there it is right there. One of the great books of all time. The Bible is the best. One of the great books. But I wrote you always have to be prepared to walk. Now, if Kerry would have gotten up a couple of times from the Iran deal. Like for instance, he should have said, before we start negotiating, we have to have our prisoners back. This is like three, four years ago. They would have said no, great negotiators the Iranians, the Persians are great negotiators, all right? So they would have said no, we won't do that. And I would have said, if it was me, I would have said bye-bye. We're going. And then you double up the sanctions, you'll have your prisoners back within 24 hours 100%, 100%. I then would have gone very, very easily. I would have gone and I would have said listen, the 150 billion, sorry, we don't have it. Do I ever tell you the story -- my father, he thought I was a little bit rough around the edges. He said son, you've got to take the lumps out, the lumps. You've got to be a little softer. So in the old days, I would have said we're not giving you the $150 billion, you know, there'll be a lot of anger and it takes longer to heal. But he would have said differently. He would have said no, no, no we have a problem. Our country owes $19 trillion soon because of the crazy omnibus budget that was just passed by the Republicans, it's going to be $21 trillion. And honestly, we don't have the money. We can't give you the $150 billion. I'm sorry. And you know what they would have done? They would have gotten very angry within two weeks. They would have come back. We would have come back. We would have saved $150 billion. Believe me, 100%, OK? We gave them $150 billion and they go out and buy Airbus. They go out and buy missiles from Russia. They buy from everybody by us, and by the way, we have a prohibition that they can't buy. Now, I think that prohibition's great but when we hand them 150 billion, we should take the prohibition off for a little while. Don't you think? Let them buy from Rochester, New York. We don't care if they're from Iran, right? We'll sell them missiles that don't work correctly, right? Let them sue us. Tell them to sue us. Oh, I'm sorry. They don't work. Gee, that's too bad. We'll take in about $12 billion for missiles and they'll say these missiles are terrible. I said yup, that was the purpose of it. But they're buying missiles that do work, folks, and really because of us. So, so many different things. I talk about Sergeant Bergdahl. We get Bergdahl, a traitor. No, we get a traitor. Who by the way six people at least, but six people five known, but six people were killed looking for him. So we get Bergdahl and they get five of the people that they most coveted in Gitmo which we're keeping open by the way, 100% they will fill it up. So they get five killers that they most coveted, that they most wanted of anything, all right? So look, when I started this on June 16th, and it takes guts to run for president, what do I know about this, OK? It takes guts, not easy. The last thing I ever thought I'd be is a politician. Can you believe I'm a politician, ay. Don't tell me. Don't tell me. But it does. It takes guts to run for President. And I said I've just had it. I've had this stupidity. I've had these trade deals whether it's Century Safe or whether it's Carrier or whether it's Ford moving their big operations to Mexico or whether it's Nabisco closing their plant in Chicago, a place that needs some help and they close their plant in Chicago and they're moving it to Mexico. How stupid are we, folks? How stupid. How stupid are the leaders of this country? We're not going to let them. We're not letting them get away with it anymore. We're not going to let it happen. We're not going to let it happen. So, so we're going to do things and I came down the escalator with Melania and I took a deep breath and I said she'll make a great first lady, I will say. True. I took a deep breath and I said let's go. And there were cameras downstairs I say it all the time. I'm telling you it looked like the Academy Awards. Look at all of them back there. Look, look what we brought to Rochester today. Look at those people. Look at those cameras. Oh, if only when they -- if they were only honest. If they'd only really follow the camera. You know what some of them do? They wait till everybody leaves. Now it's empty. And then they'll say we're here at the arena where Donald -- and everybody looks and they see this big empty space. They don't show it like this. They are really, really bad, dishonest people. But that's OK. You know after a while you learn to live with it, OK? To finish up one thing and then I'm going to tell you where it started and where it's going and then we're going to have a quick thing and then I'm going to just tell you one thing, we're going to start winning again. We're going to start winning again, folks. So when I talked about to the New York Times, when I talked about defense and this and that. I talked about they have to pay and if they don't pay, well, we have to be prepared to walk. So they said, well, would you walk? Well, we may have to be prepared because we cannot continue to go on with this where we're defending Japan. We love Japan. I have many friends in Japan. I love Mexico, many friends in Mexico. Have thousands of people working from me, Hispanics. And in Nevada, when I had the poll, I won Nevada, the state of Nevada in a landslide. They did a poll of Hispanics. I won the Hispanics by a lot, a lot, OK? They're great. They're great but their leaders are too smart for us. Their leaders are too cunning for us. What happens though is when I talk about, anyone of the countries, let's say Japan. I say, no, they have to take care of us. We can't continue to lose the kind of money that we're losing defending all these countries that, by the way, are making a fortune. Look at the cars that come pouring into this country. From Los Angeles you go -- at the largest ships, I've ever seen. They're loaded up with cars from Japan. They come pouring in. And in fact, Obama said, the Japanese are very worried about the rhetoric of Trump. They should be worried, honestly, they've got to pay. They've got to pay. They got to pay. And we don't mean -- I'll tell you what. I would bet that I will get along better with Japan than Obama does. And they rip us off. We will be treat -- we'll treat them very fairly. I want to treat them fairly. I'm going to treat everybody fairly. Look at China, $505 billion yearly trade deficit and they go and build a massive military complex in the middle of the South China Sea which they're not allowed to do, and we don't do anything about it. We have so much power over these countries because of our, our -- the power of trade. And we don't know, we have leaders that don't realize that we have power. So as with Japan, with any of them, but with Japan. I'd say very nicely, listen, we need help. You've got to take care. We don't want you to arm. But you know what, you have to be prepared. You have the maniac, Japan is concerned about him. You know, there is a school of thought that Japan would be better off taking care of him and let us sit home and watch it on television for a change. Does that make any sense? I mean, you could make the case. You know, we have now nine countries that are nuclear, right? Nine. So they said, oh, Donald Trump. And now here's the thing. So I said no, no, I'd negotiate with them. I'd be prepared to walk but I'd negotiate with them, and they have to pay a lot more money, and they have to you know -- we got to get our house back in order, right? So I said, I would prepare and I'd much rather take care of them. They have to pay us but I'd much rather take care of them. But I would be prepared. The question was what? Would you walk? Yeah, I'd be prepared. So I have these phony stories come out in the Washington Post which is, by the way, a total rag. What a rag. And the reason it's there is to protect a company which I'll talk to you about very soon because I'm right a whole big thing about it. Uh, the owner of the Washington Post, you know what he owns? Amazon. Do you know how little tax Amazon pays? So he uses the Washington Post to protect Amazon from taxes, OK? That's all it is, folks. And they go crazy. They write on average like eight stories a day on me. I have so many stories I can't even read them. I can't even read the good ones when they happen which is seldom, which is seldom. And the New York Times, I'm telling you, The Washington Post was purchased by a . It's a loser. Losing money hand over fist. The Washington Post was purchased by the gentleman that runs and has a big stake in Amazon, right? You know his name. Correct, Bezos. You know his name. So now he uses that as a political weapon because he doesn't want to pay tax at Amazon. That's all it is, folks. It's so simple. It's so simple. And every time they hear me say it. Now, watch tomorrow I'll have 15 bad stories in the Washington Post and all I'm doing is wanting to protect you, folks. I get it. I understand it. I get it. So don't worry about them. You know what? Their voices aren't strong enough. Just lets -- They're trying to protect Bezos. So the story comes out in the New York Times that basically, Donald Trump wants to see an armed Japan. Donald Trump, they don't talk about costs. They don't talk about the fact that they have to pay their way. It's Donald Trump doesn't mind seeing an armed Japan. Well, I do. But what I say is they have to pay. Does that make sense to you, folks, OK? Does that make sense? These are unbelievably, unbelievably, dishonest people. I'll give you an example. We had one guy upfront. He raised his hand. He said two words. We had that person in the back who said a couple of words. Tomorrow the headline will be major protest at Trump rallies, there's no protest. We got 10,000 people, we turned away 5,000 or 6,000, unfortunately. And with all these people, we had two people raise their hands. Tomorrow the headline won't even be about defending Japan. It will be about Trump had a protest. Let me tell you. Our rallies are the safest rallies of anywhere, the safest. We have the safest rallies of anywhere. And you know what's nice about our rallies? Because a lot of these people are agitators. You look at them, they have professionally done signs. They don't have signs done in their basement. These are professionally done signs. You know what's nice about our rallies? Our people protect themselves. They protect each other. There's something beautiful. That's the way -- it's called teamwork. That's the way our country is supposed to be. We're supposed to love each other and we will love each other. We'll love them someday, too. But we're supposed to be protective of each other and there's tremendous love in the rooms. When we have these rallies, tremendous love in the rooms. So on June 16th, come down the escalator. Started talking about illegal immigration and man did that hit a button. And now, Sheriff Joe from Arizona, we love Sheriff Joe, Joe Arpaio. The Border Patrol, 16,500 Border Patrol people endorsed Donald Trump last week. They've never done it before. They've never done it before. So I said you know, let's see what we could do. Because I talked really about trade because we have to make our country rich again. A woman came up to me and said, wonderful woman, incredible woman, 60 years old. I said how old? She said 60. I said you look great. She said Mr. Trump, don't say we're going to be rich again. I said I have to say that because if we're not rich again, we can't be great again. We have to bring back our money. We have to bring back our jobs. We have to bring back our industry. It's been stripped by these politicians that don't care or are stupid. I said, so we have to make our country wealthy again, and we have to make our country great again. I'm the only one going to save Social Security, folks. Ted Cruz wants to cut it. Everybody wants to cut it. I'm the one person because I'm going to bring our jobs back. I'm going to bring our wealth back. And believe me, a lot of those jobs are coming back to Rochester. Believe me. There's going to be incentives and they're coming back to Rochester. A lot of the jobs, just remember I said it. Remember I said it. So here's the story. So I said on June 16th, I talked about trade and I talked about the border. The borders and illegal immigration were met with, at first it was quiet, and about a week later, do you remember the delayed reaction. A week later everyone said, whoa, what did he say? They were all saying what a good speech that was. A week later all of a sudden, they just went after me and I said, wow. Now, everybody's saying I was right. They're all saying I was right. I also said, we have to be extremely careful with radical Islamic terrorism and we have to look at the Muslims and we have to do something. We cannot stand by and be the stupid people while our country is destroyed. You see what's happening in Germany with the crime. You see what's happening in Sweden where they have a small little section. You see what's happening in Brussels. Now in Brussels, a number of weeks ago, I said Brussels is a hellhole. Before, before the accident, before the horrible tragedy. I said Brussels is a total hellhole. Now, I knew Brussels from many years ago, one of the most beautiful cities in the world. But a couple of months ago, I made the statement Brussels is a hellhole. The New York Times wrote a story. How dare Donald Trump say that? How dare -- then the blow-up happened. Now, they're all saying Trump was right, again. It's amazing, right? I mean, it's amazing. No, we're right. I'm right. I wrote in my book. In the year 2000, the America we deserve. I wrote in the book, the year 2000, right? I told you about Osama bin Laden. So one of the television host didn't believe it. They brought the book into him. He said, wow, Trump was talking about this two years before the World Trade Center came down. I promise you, I would have taken that guy out, and you would have had the World Trade Center stand. I would have taken him out. I do know. I'm the one that talked about take the oil, right? I said don't go into Iraq. It's a mistake and I said it. Don't go into Iraq. I was against going into Iraq. But once we were there, you couldn't get out the way Obama did it. And he gave us an exact date. We are leaving on an exact date. And the enemy sat back and they said, wow, they didn't believe him. They thought it was a camouflage of some type. They didn't believe him. They said wait a minute. He can't be that stupid. He's given us a date. He's given us a date. He adhered to the date. Now, I said don't go into Iraq but you can't get out without leaving some people behind. Not that it's worth it because it's such a, you know, you talk about hellhole. There's another hellhole. Now, Iraq is being taken over 100% by Iran. They've been wanting to do that for decades and decades and decades, right? But they're taking over Iran -- Iran is taking over Iraq. The second-largest oil reserves and great stuff in the world and they're taking it over. We made it possible by decimating Iraq and their army and their military. We made it possible. So Iran's wanted it for years. So not only did Iran go and make one of the great deals ever with us but then they made a much better deal because we decimated Iraq and Iran is now taking it over, OK? And let me tell you, they're taking over Yemen. When you look at the border between Yemen and Saudi Arabia, they don't want Yemen, they want Saudi Arabia. And never was Saudi Arabia in the trouble they're in now, and they don't want Saudi Arabia, they want the oil, OK? And what I'm saying, folks is they're got to pay. They've got to pay. They've got to take care of us. Why are we the dummies all the time? They've got to take care of us. So when this started, I was talking trade, very strong. I was talking trade and I was talking borders. By the time it finished, we had a thing called Paris. And speaking of Paris, if some of those people in that room had guns and the same thing with California, same thing with California. If some of those people in those rooms in Paris or that room in California where these two radicalized people that worked with them who were given baby showers for their child. If some of those people on the other side had guns, wouldn't have been the same story, folks. In Paris, 130, toughest gun laws in the world, 130 people killed. Boom, boom, boom, boom. If some of these people were there and they had guns strapped to their waists, strapped to their ankle, would have been a whole different story. And probably wouldn't have even happened because they would have said wait a minute don't people have guns. Let's leave them alone. Ok? So, so -- Thank you. So, folks, we're going to start winning again. We're going to start winning again, so important. This is a movement. They want to stop the movement but I don't think they're going to be able to. This is a movement. This is millions of people, no matter where you go, I go to Dallas we had 21,000 people. I go to Mobile, Alabama we had 35,000 people. I -- no matter where we go, we have the biggest crowds by far. Nobody comes close. The biggest problem we have is we can't get them into these massive hangars. We can never get enough people in. But we have a movement going. It's an incredible movement. It's actually not a movement of hate. It's a movement of love. Remember that, it is. It's a movement of love. It's a movement of people that want to see our country be smart and strong and, and great again. It's a movement of people that want to be taken care of and they want to take care of. They're going to take care. It's a movement of people really that want to start winning again because we don't win. We never win anymore. We don't win on trade. We don't win on the military. We don't win on education, by the way, we're ending Common Core. Education is going to be good, right? It's going to be local. We end Common. So, so important. We got to keep it going. And everyone says, oh, you have these great poll numbers. We need a great show of strength in New York State. It's so important. We need a great show of strength. You got to go. Not this Tuesday but the next Tuesday. Nine days, nine days. You've got to go out and you've got a vote in mass. You've got to bring your friends. You got to tell them about it. You are going to say this was one of the great days of your lives. You're going to say when you cast that vote in nine days on Tuesday, you're going to say it was the greatest single vote you've ever cast. And here's what's going to happen. We're going to start winning again, folks. We're going to win with our military. We're going to knock the hell out of ISIS. We're going to win at the border. We're going to build the wall and people are going to respect us. We're going to have our country back. We're going to win with education. We're going to end Common Core and we are going to bring it local. We are going to win with education. We're going to repeal and replace Obamacare. We're going to protect our Second Amendment and we're going to bring jobs back into this country like you've never ever, ever seen before. We're going to have a great, great economy again. We're going to have a great, great country again. And you're going to be so proud of your President, but I don't care about that. You're going to be so proud of this country. The American Dream, remember this and I've been saying it, the American dream is dead. But I'm going to make it bigger and better and stronger than ever before. We are going to Make America Great Again. Thank you, Rochester. Thank you. We love you. Thank you. Thank you, everybody."}