{"id":413,"author":"Donald Trump","title":"Speech: Donald Trump in Bethpage, NY","date":"2016-04-06","link":"https://factba.se/transcript/donald-trump-speech-bethpage-ny-april-6-2016","paragraphs":["Unbelievable. Unbelievable. Thank you so much. Thank you everybody. Thank you very much. Thank you. Thank you very much. First of all, it's great to be home. This is home. It's great to be home. We love New York. We love New York. And we are all together going to make America great again, folks.","So I was driving over from Manhattan and I passed Queens. I love Queens. Do we have a lot of Queens? I love -- I grew up in Queens. I grew up in Queens. And I used to play ba -- you know, I used to get here at, like, 2:00 in the morning to play a round of golf at Bethpage. You all know what I mean, right?","But I love this city and I love this country. And we are going to start winning again with our country because we don't win. We never win. We never ever win anymore. We don't win with our military. We don't win on trade. We don't win on health care. We don't win on anything. We are going to start winning again, folks.","So in coming up, I said to myself and I said to some of the people when we were in the car, I said, you know, I'm self-funding my campaign. I'm putting my own money in, right? And all of these people that are running for office, they're like off the trough. They take money in from all the special interests where they can't make proper transactions for you.","And that's going to stop. It's going to stop. You look -- you look -- you look at what's happening. I love you too. I love -- I love these people. These are my people. Yeah. I've got so many family members here today. Look at that. Boy, oh boy, my sons and my daughter. Did Ivanka do a good job?","You know, she had a baby like five days ago. So she did a good job. So I should not say, \"Ivanka, you're fired,\" right? I promise. I promise. I promise. So I love this. You know, somebody else would say, \"That's a tough crowd.\" It is, for the heart. We love this crowd. We love you people. We love you people.","We love. So -- so here's what we're doing. On June 16th, I came out and I said and it is not easy to do, it takes guts. I came down the escalator with Melania, I said, \"Come on, let's go.\" I took a deep breath. And it was all about trade. It was all about borders. It was all about all sorts of things. And today, it's that, but it's also about our military.","We can beat ISIS. We're going to knock the hell out of ISIS. Believe me. Can you imagine what our great generals, General George Patton, General Douglas MacArthur. Can you imagine what they'd be saying if they saw what's going on with what we're doing and the way we fight? We don't fight like people from Long Island.","We don't fight like people from New York. So we're going to rebuild our military. It's totally depleted. You know it. We know it. They don't like talking about it. We are going to rebuild our military. It's going to be bigger and better and stronger than ever before, and nobody is going to mess with us. Nobody.","And very, very important, we're going to take care of our vets. Our vets are not taken care of. So our country owes now $19 trillion. We owe trillions to China, we owe trillions to Japan. The whole thing is absolutely ridiculous. It's going to change around. It's going to change quickly. We are going to renegotiate our trade deals.","In China, the case of China, $500 billion trade deficit every single year. It's going to end. Mexico. I love the Mexican people. I love Hispanics. I love Hispanics. They're unbelievable people. We have now $58 billion trade deficit with Mexico. And our businesses sadly are leaving our country going to other countries.","They're leaving our jobs in Long Island. You know it better than almost anybody. Our companies are being uprooted, taken out. They're moving to Mexico. They're moving to other countries. Everybody is looking for jobs. And you know what, we're going to end the practice. We're going to keep our companies here, and we're bringing companies back to the United States.","We are going to have a strong border. We are going to build the wall. It will be a real wall. A real wall. Are you ready? Are you ready? Are you ready? Who is going to pay for the wall? Who? By the way, 100%. When these politicians come up, they say, \"You can't really get Mexico to pay.\" I just put out a plan three days ago.","So easy. When we're losing $58 billion a year in trade deficits, and the wall's going to cost $10 billion. Folks, how easy is that? It's going to happen, OK? It's going to happen, 100%. It's going to happen. Go ahead. Never changes. Hey, New York is called New York. All right.","It never ever will change. So what's happened, and very strongly, what's happened? We are going to have those strong borders. Just as you saw last week, the Border Patrol, 16,500 people in the Border Patrol endorsed, and I didn't even ask, endorsed Donald Trump for President. The first time they've ever done it. They've never endorsed anybody for president.","But they want to have strong borders. And you know what, I thought to myself, has anybody heard the Snake? Has anyone heard of it? Have you heard? Should we do it? Should we do it? All right. The main thing -- can you hear me all the way in the back? Can you hear me? Can anybody not hear me clearly? All right.","I want to thank my brother, my cousins, my nephews, my beautiful daughter-in-laws, my son, wonderful Ivanka. As you know, they all came to see this ki -- I mean, she -- they can't even believe it. You know -- you know, lying Ted Cruz came today. He couldn't draw a 100 people. A 100 people. He could -- I'm telling you.","In fact, it was a big headline today in the New York Post. He couldn't draw a 100 people. Now, do you remember -- do you remember -- do you remember during the debate when he started lecturing me on New York values like we're no good -- like we're no good? And I started talking to him about the World Trade Center, the bravery -- the incredible bravery of everybody, our police, our firemen, our everybody.","Better believe it. Better believe it. So I looked at him and started talking about our incredible police, our incredible firefighters, our incredible people, our unbelievable construction workers. Who could have done that? Who could have rebuilt that wall? There was never anything like it in this country.","The worst attack in the history of the United States. The bravery that was shown was incredible. We all lived through it. We all know people that died. And I've got this guy standing over there looking at me talking about New York values with scorn in his face, with hatred, with hatred of New York. So folks, I think you can forget about him, and forget about it. He is lying Ted.","You know, I came up with the idea, but you have to spell it right. It's L-Y-I-N apostrophe, lying Ted. The Bible held high. He puts it down and then he lies. You know the wonderful thing? He lies like crazy. But most of the time, I win the evangelical vote, the evangelicals, the Christians like Donald Trump.","I'm a straight shooter. I shoot straight. Like New Yorkers, we shoot straight. You have another one running. He was in favor of NAFTA. He re -- do you remember that? Kasich -- Kasich. He is now -- he is now O for 32, except he won his state. So he's like one for 33. And he just -- he won't leave, and that's OK. You know what, he's a nice guy.","Let him keep going. It's OK. It's all right. It's OK. But both of them -- and this is so serious. Both of them, we have a deal under negotiation being negotiated by President Obama, which you immediately know it's got to be a bad deal -- a bad deal. Don't forget, Obama negotiated the Iran deal. One of the worst deals ever, ever, ever negotiated.","So what we have -- what -- thank you, darling. I -- I love screaming love -- I love you, Trump. I love you, Trump. Thank you. Thank you. I love you. I love you. I do. So both of them want TPP, which is Trans-Pacific Partnership. It is a disastrous deal. It's going to suck the blood out of New York. It's going to suck the blood out of our country.","Both of them want it to happen. I'm going to fight it, and we're going to stop it. We're not going to let it happen. We have enough bad deals. This deal would be catastrophic. So look, let me -- let me just tell you a couple of things. So we have to bring our jobs back to this country. We have to stop making horrible trade deals.","We have the greatest business people in the world in the United States. I know many of them. I know the good ones, the bad ones, the overrated ones, I know, and the underrated ones. People you've never heard of who are phenomenal. We are going to bring the greatest business minds. We're going to take on new trade deals with China, with Japan, with Mexico, with all of these countries that are ripping us like nobody's ever, ever been ripped before, ever.","So you know, I talk about different deals. Ford is building a huge plant, two and a half billion dollars. Nobody does -- I -- maybe we don't buy Fords anymore. Who knows, right? But -- but look, they're building in Mexico a two-and-a-half-billion-dollar plant. It started two years ago. And now, because nobody did anything like go to see him, find out what's happening.","Nobody did anything. They just announced they're going to double down and build more in Mexico. We want them to stay here. We want them in this country. Now, you heard about Nabisco. Nabisco is leaving Chicago, they're moving to Mexico. You heard about many, many, many companies, they're moving. Recently, Carrier air conditioner -- we won't buy Carriers anymore, folks.","They announced that they're leaving the United States. They fired 1,400 people. Lot of people. They've been there for a long time. They're moving to Mexico. So here's what we do. Should I tell you what we do? Are you ready? My wife and my daughter always say, '\"Darling and dad, please, be more presidential.\" But I want to make this call myself.","If I'm President, we call up Carrier. Can you imagine I'm calling up air conditioning companies? That's OK though, right? Who the hell cares? We say, \"Listen, I hope you enjoy your new plant. I'm sure it's going to be beautiful. Wonderful place. A little bit hot, but that's OK. But just so you understand, you let go of 1,400, and even 1,750 from what I hear, great, great people, and they're right now unemployed in the United States as you make your air conditioners.\" So here's what's going to happen, folks, because the politicians cannot figure it out.","They'll never figure it out. And beside that, they're paid off with campaign contributions. So even if they do figure it out, they're not going to do anything about it, OK? So we say, and I say, \"I hope you enjoy your beautiful new plant in Mexico. But every single time you make an air conditioning unit and you send it across our now very, very powerful and strong border, you're going to pay a 35% tax on that unit.\" OK? 35%. And here's what is going to happen.","If it's not me, if it's somebody else, or how about Hillary? How bad is Hillary? How bad? How bad is Hillary? How bad? So if it's Hillary or if it's Cruz -- it can't be Cruz, it never went any good. By the way, I will beat Hillary so badly in the general election. You heard the other day, members of her team were caught saying the one person she doesn't want to run against is Trump.","Believe me, it will be fun. It will be fun. And we haven't started on her yet. The only time I really started on her was two months ago. And believe me, her and Bill had a bad evening. Believe me. Believe me. That was a bad evening. But I haven't -- I haven't started. If it's Hillary, I don't know that it's going to be Hillary.","Maybe -- maybe something's going to happen. Maybe she's not going to be allowed to run. Maybe she'll be defeated. I don't know what's going on. But with the email scandal, maybe something's going to happen. So here's what -- here's what's going to happen. So if it's Hillary, or if it's Cruz, or if it's anybody, any politician, they will call their lobbyist who has like Cruz written on his face, it's like emblazoned unto his forehead.","It'll say Cruz, I can take care of everything. That's the lobbyist. They'll see Cruz, they'll see Hillary, they'll see whoever it might be, any politician, they'll say, \"You can't do that. They gave you millions of dollars when you ran for President. They gave you millions of dollars when you ran for Senate.","These are good people. You can't do it.\" But see, here's the deal. I don't get money from anybody. So I self-fund, so I can do what's right for you. I'm going to do what's right for you. So with Carrier as an example and I could use Ford or I could use hundreds and hundreds of -- I tell Carrier that they will call me back and they'll put a little pressure, but it's no pressure, no pressure works on me. Pressure doesn't work on me. But I'll tell you what.","What they're going to do is I will say, \"No, you don't understand. It's a 35% tax.\" They're going to say, \"Mr. President, we've decided not to leave the United States.\" That's what it is. So simple. It is so, so simple. So here's what's happening. You know, I've been a pretty good prognos -- I have a lot of fans here, we've been fans together, friends together.","And they've known me for a long time. And you know, a poll came out today that through the roof, my standing in New York. You know what makes me happiest? When the people that know me best, and boy, do you know me well, but when the people that know me the best think so much that it had poll numbers that nobody can believe.","So we're going to do great. And I have to say, in two weeks, meaning two weeks from yesterday, go vote because we have momentum, we have a movement, and we're going to turn this country around so fast, so fast. So you have to get out and vote. So I've been calling a lot of shots right. I wrote a book in 2000. And in 2000, I talked about Osama bin Laden, two years before the World Trade Center . Nobody even understands that every once in a while, one of these political pundits will say, \"That's amazing.","Trump was talking about him before he knocked down the World Trade Center.\" We have to know what we're talking about. I've been talking about take the oil. For what? Five years. Take the oil take, the oil take, take the oil. You know who has the oil now? ISIS has the oil. Iran has the oil. Because our politicians are incompetent.","They don't know what the hell they're doing. And you know, it's -- it's so unfair because the press is so dirty, the press is so bad. I was asked -- they're terrible. Look at them. They are terrible. Now, they're terrible people. And by the way, we have 15,000 people, we have another 5,000 outside, they're never going to show it. They're never going to show it. You'll go home to your families tonight.","You'll say it was unbelievable. And your wife or your husband will say, \"Darling, were there many people there?\" And you know why she won't know because you watched it on television, it's on all the televisions, it's all live. I'm always making these live speeches, it's crazy. I'd love to do it like the other guys.","Nobody covers them, they could just go over and over and boring, but nobody shows up. But you're going to go home tonight and your wife or husband will say, \"Were there many people there?\" Because the cameras never want to scan my audiences because they're so big and so incredible. And by the way, we have so many people.","I -- I want to -- I want to thank, before I for -- before I read the Snake, I want to thank your police and your chief. He was here. I want to thank Big Joe from Nassau. You know Big Joe, right? Where is Joe? Where is he? He's around here. I want to thank Steve, right, from Suffolk. I want to thank all of the incredible politicians we have.","We have -- half of the world is here tonight. But I want to thank all of the political leaders. We have the greatest leaders. We have the greatest leaders in New York State. We have leaders that say we're not going to put up with this stuff any longer. That's what they're saying, folks. So I just want to thank them for being here.","So -- so I've called a lot of shots. And I've gotten credit pretty much for calling a lot of shots. I have an instinct, and I do have a good instinct for it. And we have a thing called the migration. Now, we have illegal immigrants pouring into our country. We don't know what's happening. That'll stop. But we have the migration and we have people coming in by the thousands with no documentation, with no paperwork.","We don't know where they come from. We don't know who they are. You watch what happens. It could be ISIS. I hope it's not. But you watch what happens. You see what happened in Paris. You see what happened in California with the two people. Two young people got married. They worked. They shot 14 people. Killed them.","They became radicalized. And we're not going to -- we're not going to put up with it, folks. We're not going to put up with it. So this was written by the great Al Green. It was a song. And I thought it was great. Now, when you think of this and when you listen to the words, remember what I'm saying.","When you listen to the words, you have to think about people pouring into the country. Thank you. That's all right. You know, out of 17,000 people, I think we have one. That'll be headlines tomorrow. OK, that's all right. That's all right. Forget him. You can't hear him anyway. Forget him.","That's OK, folks. Forget it. Don't worry about it. That's all right. Ready? Are we ready? Or do you want to let him go a little further? You want him out? All right, got to get out him out. Get him out, please. All right. Get him out. Don't hurt the person. Don't hurt the person. Do not hurt the person. Yeah, don't -- don't hurt him.","Don't hurt him. Is the Trump rally the greatest? Is it the greatest? All right, good, get him out. All right, get him out. Thank you. All right, they're gone. You know what it is? I'll tell you. And -- and be very gentle -- very, very gentle. You know I've done it all ways. When I'm -- when I'm like this, they say Trump is getting weaker.","When I'm tough, they say he's too tough. You can't win. You can't win. OK. OK, let's go. Are you ready? You ready? So here's the story. You think of this in terms of the people coming into the country, especially coming in from Syria. We don't know where they are. We don't know who they are. We don't know how they're getting in. They're all over the place.","Believe me, it's going to be a problem. You think of this, all right? This is called the Snake. On her way to work one morning, down the path along the lake, a tender-hearted woman saw a poor, half frozen snake. His pretty colored skin had been all frosted with the dew. Oh well, she cried, I'll take you in and I'll take care of you.","Take me in, oh tender woman. Take me in for heaven's sake. Take me in, oh tender woman, sighed the broken snake. She wrapped him up all cozy in a curvature of silk and then laid him by the fireside with some honey and some milk. Now she hurried home from work that night. As soon as she arrived, she found that pretty snake she'd taken in, finally, finally had been revived.","Take me in, oh tender woman, take me in for heaven's sake. Take me in, oh tender woman, sighed the broken snake. Now she clutched him to her bosom. You're so beautiful, she cried. But if I hadn't brought you in by now, heavens, you might have died. Now she stroked his pretty skin and then she kissed him and held him tight.","But instead of saying thank you, that snake gave her a vicious bite. Take me in, oh tender woman, take me in for heaven's sake. Take me in, oh tender woman, sighed the broken snake. I saved you, cried the woman, and you bit me, heavens, why? You know your bite is poisonous and now I'm going to die. Oh shut up, silly woman, said the reptile with a grin.","You damn well knew I was a snake before you took me in. Believe me, folks. Believe me. Believe me. Now we all understand. Our country has to start getting tough. We have to be vigilant. We have to be vigilant, we have to be smart. We have to know that there's all sorts of traps out there.","We don't want more World Trade Centers. We don't want planes flying into the Pentagon. We don't want planes flying in wherever that other plane was going, and we all think we know, the White House. We had some really brave people in all of those planes, but some brave people took down that plane. We don't want -- right?","Brave, brave people. Brave, better believe it, in their honor. So we're going to be smart. We're going to be tough. We're going to be vigilant. We're not going to be politically correct all the time, politically correct. I love you too, man. I don't say that often to guys, but I love that guy right over there.","So we're going to do a lot of things if I win. We're going to take our budget. We're going to make it good. We're going to make sure that our nations that we're friends with, Japan, and Germany, and South Korea, and many, many nations, Saudi Arabia, so many nations. We pay for their military. We take care of their military.","It's all fine. But you know what, folks, we have 19 trillion in debt. We're going to 21 trillion in debt very soon because of a horrible budget that was made three months ago called the Omnibus Budget, which lets everybody come into our country, which is a disaster, which helps Obamacare, which by the way, we're going to repeal and replace with something great.","So we're going to bring back our country. We're going to make our country strong again. We're going to make our country respected again. We're going to use our finest people, we're going to use our brightest minds. We're going to make great deals, great transactions. We're going to have Apple computer and we're going to have companies like that, many, many companies.","They're going to start making their product not in China, but in the USA, folks. That's where they're going to make their product, 100%, 100%. So here's the story. Here's a story in a nutshell. You're going to look at this night in two years, in four years, in 12 years, in 20 years, and you're going to say this was a great evening.","This was an evening -- this was an evening where, for the first time, we heard somebody say that we're not going to be a scapegoat and stupid people anymore. We're not going to allow the world to continue to rip us off. We are going to get along great with the world. But we're not going to let it happen anymore.","We're going to say, and I say it now, America first. America first. It'll happen too, folks. And it will happen fast. So here's the story. You're going to remember this evening, and hopefully every single person in this room and people that you know that aren't in this room, next Tuesday -- next Tuesday, meaning -- meaning in 12 days, you're going to go out and vote, and you'll get to say it was the most important vote that you've ever cast.","You're going to be proud of your country again. You're going to be proud of your president again. We are going to start winning. We are going to win with our military. We're going to kick the hell out of ISIS. We are going to win with our veterans. We are going to win with health care. We are going to get rid of Common Core, and we're bringing our education locally.","We're going to have local education. We are going to protect and cherish our Second Amendment which is under siege. And we are going to have strong borders. We're going to have our country back. And we are going to have the wall. So let me just tell you. Let me just tell you. We're going to start winning again, folks.","Going to happen, going to happen, going to happen. So remember this evening, you go out and vote. I can only tell you, you'll be so proud, so happy. We are going to win, win, win. We're going to make America great again. I love you. Thank you. Thank you everybody."],"text":" Unbelievable. Unbelievable. Thank you so much. Thank you everybody. Thank you very much. Thank you. Thank you very much. First of all, it's great to be home. This is home. It's great to be home. We love New York. We love New York. And we are all together going to make America great again, folks. So I was driving over from Manhattan and I passed Queens. I love Queens. Do we have a lot of Queens? I love -- I grew up in Queens. I grew up in Queens. And I used to play ba -- you know, I used to get here at, like, 2:00 in the morning to play a round of golf at Bethpage. You all know what I mean, right? But I love this city and I love this country. And we are going to start winning again with our country because we don't win. We never win. We never ever win anymore. We don't win with our military. We don't win on trade. We don't win on health care. We don't win on anything. We are going to start winning again, folks. So in coming up, I said to myself and I said to some of the people when we were in the car, I said, you know, I'm self-funding my campaign. I'm putting my own money in, right? And all of these people that are running for office, they're like off the trough. They take money in from all the special interests where they can't make proper transactions for you. And that's going to stop. It's going to stop. You look -- you look -- you look at what's happening. I love you too. I love -- I love these people. These are my people. Yeah. I've got so many family members here today. Look at that. Boy, oh boy, my sons and my daughter. Did Ivanka do a good job? You know, she had a baby like five days ago. So she did a good job. So I should not say, \"Ivanka, you're fired,\" right? I promise. I promise. I promise. So I love this. You know, somebody else would say, \"That's a tough crowd.\" It is, for the heart. We love this crowd. We love you people. We love you people. We love. So -- so here's what we're doing. On June 16th, I came out and I said and it is not easy to do, it takes guts. I came down the escalator with Melania, I said, \"Come on, let's go.\" I took a deep breath. And it was all about trade. It was all about borders. It was all about all sorts of things. And today, it's that, but it's also about our military. We can beat ISIS. We're going to knock the hell out of ISIS. Believe me. Can you imagine what our great generals, General George Patton, General Douglas MacArthur. Can you imagine what they'd be saying if they saw what's going on with what we're doing and the way we fight? We don't fight like people from Long Island. We don't fight like people from New York. So we're going to rebuild our military. It's totally depleted. You know it. We know it. They don't like talking about it. We are going to rebuild our military. It's going to be bigger and better and stronger than ever before, and nobody is going to mess with us. Nobody. And very, very important, we're going to take care of our vets. Our vets are not taken care of. So our country owes now $19 trillion. We owe trillions to China, we owe trillions to Japan. The whole thing is absolutely ridiculous. It's going to change around. It's going to change quickly. We are going to renegotiate our trade deals. In China, the case of China, $500 billion trade deficit every single year. It's going to end. Mexico. I love the Mexican people. I love Hispanics. I love Hispanics. They're unbelievable people. We have now $58 billion trade deficit with Mexico. And our businesses sadly are leaving our country going to other countries. They're leaving our jobs in Long Island. You know it better than almost anybody. Our companies are being uprooted, taken out. They're moving to Mexico. They're moving to other countries. Everybody is looking for jobs. And you know what, we're going to end the practice. We're going to keep our companies here, and we're bringing companies back to the United States. We are going to have a strong border. We are going to build the wall. It will be a real wall. A real wall. Are you ready? Are you ready? Are you ready? Who is going to pay for the wall? Who? By the way, 100%. When these politicians come up, they say, \"You can't really get Mexico to pay.\" I just put out a plan three days ago. So easy. When we're losing $58 billion a year in trade deficits, and the wall's going to cost $10 billion. Folks, how easy is that? It's going to happen, OK? It's going to happen, 100%. It's going to happen. Go ahead. Never changes. Hey, New York is called New York. All right. It never ever will change. So what's happened, and very strongly, what's happened? We are going to have those strong borders. Just as you saw last week, the Border Patrol, 16,500 people in the Border Patrol endorsed, and I didn't even ask, endorsed Donald Trump for President. The first time they've ever done it. They've never endorsed anybody for president. But they want to have strong borders. And you know what, I thought to myself, has anybody heard the Snake? Has anyone heard of it? Have you heard? Should we do it? Should we do it? All right. The main thing -- can you hear me all the way in the back? Can you hear me? Can anybody not hear me clearly? All right. I want to thank my brother, my cousins, my nephews, my beautiful daughter-in-laws, my son, wonderful Ivanka. As you know, they all came to see this ki -- I mean, she -- they can't even believe it. You know -- you know, lying Ted Cruz came today. He couldn't draw a 100 people. A 100 people. He could -- I'm telling you. In fact, it was a big headline today in the New York Post. He couldn't draw a 100 people. Now, do you remember -- do you remember -- do you remember during the debate when he started lecturing me on New York values like we're no good -- like we're no good? And I started talking to him about the World Trade Center, the bravery -- the incredible bravery of everybody, our police, our firemen, our everybody. Better believe it. Better believe it. So I looked at him and started talking about our incredible police, our incredible firefighters, our incredible people, our unbelievable construction workers. Who could have done that? Who could have rebuilt that wall? There was never anything like it in this country. The worst attack in the history of the United States. The bravery that was shown was incredible. We all lived through it. We all know people that died. And I've got this guy standing over there looking at me talking about New York values with scorn in his face, with hatred, with hatred of New York. So folks, I think you can forget about him, and forget about it. He is lying Ted. You know, I came up with the idea, but you have to spell it right. It's L-Y-I-N apostrophe, lying Ted. The Bible held high. He puts it down and then he lies. You know the wonderful thing? He lies like crazy. But most of the time, I win the evangelical vote, the evangelicals, the Christians like Donald Trump. I'm a straight shooter. I shoot straight. Like New Yorkers, we shoot straight. You have another one running. He was in favor of NAFTA. He re -- do you remember that? Kasich -- Kasich. He is now -- he is now O for 32, except he won his state. So he's like one for 33. And he just -- he won't leave, and that's OK. You know what, he's a nice guy. Let him keep going. It's OK. It's all right. It's OK. But both of them -- and this is so serious. Both of them, we have a deal under negotiation being negotiated by President Obama, which you immediately know it's got to be a bad deal -- a bad deal. Don't forget, Obama negotiated the Iran deal. One of the worst deals ever, ever, ever negotiated. So what we have -- what -- thank you, darling. I -- I love screaming love -- I love you, Trump. I love you, Trump. Thank you. Thank you. I love you. I love you. I do. So both of them want TPP, which is Trans-Pacific Partnership. It is a disastrous deal. It's going to suck the blood out of New York. It's going to suck the blood out of our country. Both of them want it to happen. I'm going to fight it, and we're going to stop it. We're not going to let it happen. We have enough bad deals. This deal would be catastrophic. So look, let me -- let me just tell you a couple of things. So we have to bring our jobs back to this country. We have to stop making horrible trade deals. We have the greatest business people in the world in the United States. I know many of them. I know the good ones, the bad ones, the overrated ones, I know, and the underrated ones. People you've never heard of who are phenomenal. We are going to bring the greatest business minds. We're going to take on new trade deals with China, with Japan, with Mexico, with all of these countries that are ripping us like nobody's ever, ever been ripped before, ever. So you know, I talk about different deals. Ford is building a huge plant, two and a half billion dollars. Nobody does -- I -- maybe we don't buy Fords anymore. Who knows, right? But -- but look, they're building in Mexico a two-and-a-half-billion-dollar plant. It started two years ago. And now, because nobody did anything like go to see him, find out what's happening. Nobody did anything. They just announced they're going to double down and build more in Mexico. We want them to stay here. We want them in this country. Now, you heard about Nabisco. Nabisco is leaving Chicago, they're moving to Mexico. You heard about many, many, many companies, they're moving. Recently, Carrier air conditioner -- we won't buy Carriers anymore, folks. They announced that they're leaving the United States. They fired 1,400 people. Lot of people. They've been there for a long time. They're moving to Mexico. So here's what we do. Should I tell you what we do? Are you ready? My wife and my daughter always say, '\"Darling and dad, please, be more presidential.\" But I want to make this call myself. If I'm President, we call up Carrier. Can you imagine I'm calling up air conditioning companies? That's OK though, right? Who the hell cares? We say, \"Listen, I hope you enjoy your new plant. I'm sure it's going to be beautiful. Wonderful place. A little bit hot, but that's OK. But just so you understand, you let go of 1,400, and even 1,750 from what I hear, great, great people, and they're right now unemployed in the United States as you make your air conditioners.\" So here's what's going to happen, folks, because the politicians cannot figure it out. They'll never figure it out. And beside that, they're paid off with campaign contributions. So even if they do figure it out, they're not going to do anything about it, OK? So we say, and I say, \"I hope you enjoy your beautiful new plant in Mexico. But every single time you make an air conditioning unit and you send it across our now very, very powerful and strong border, you're going to pay a 35% tax on that unit.\" OK? 35%. And here's what is going to happen. If it's not me, if it's somebody else, or how about Hillary? How bad is Hillary? How bad? How bad is Hillary? How bad? So if it's Hillary or if it's Cruz -- it can't be Cruz, it never went any good. By the way, I will beat Hillary so badly in the general election. You heard the other day, members of her team were caught saying the one person she doesn't want to run against is Trump. Believe me, it will be fun. It will be fun. And we haven't started on her yet. The only time I really started on her was two months ago. And believe me, her and Bill had a bad evening. Believe me. Believe me. That was a bad evening. But I haven't -- I haven't started. If it's Hillary, I don't know that it's going to be Hillary. Maybe -- maybe something's going to happen. Maybe she's not going to be allowed to run. Maybe she'll be defeated. I don't know what's going on. But with the email scandal, maybe something's going to happen. So here's what -- here's what's going to happen. So if it's Hillary, or if it's Cruz, or if it's anybody, any politician, they will call their lobbyist who has like Cruz written on his face, it's like emblazoned unto his forehead. It'll say Cruz, I can take care of everything. That's the lobbyist. They'll see Cruz, they'll see Hillary, they'll see whoever it might be, any politician, they'll say, \"You can't do that. They gave you millions of dollars when you ran for President. They gave you millions of dollars when you ran for Senate. These are good people. You can't do it.\" But see, here's the deal. I don't get money from anybody. So I self-fund, so I can do what's right for you. I'm going to do what's right for you. So with Carrier as an example and I could use Ford or I could use hundreds and hundreds of -- I tell Carrier that they will call me back and they'll put a little pressure, but it's no pressure, no pressure works on me. Pressure doesn't work on me. But I'll tell you what. What they're going to do is I will say, \"No, you don't understand. It's a 35% tax.\" They're going to say, \"Mr. President, we've decided not to leave the United States.\" That's what it is. So simple. It is so, so simple. So here's what's happening. You know, I've been a pretty good prognos -- I have a lot of fans here, we've been fans together, friends together. And they've known me for a long time. And you know, a poll came out today that through the roof, my standing in New York. You know what makes me happiest? When the people that know me best, and boy, do you know me well, but when the people that know me the best think so much that it had poll numbers that nobody can believe. So we're going to do great. And I have to say, in two weeks, meaning two weeks from yesterday, go vote because we have momentum, we have a movement, and we're going to turn this country around so fast, so fast. So you have to get out and vote. So I've been calling a lot of shots right. I wrote a book in 2000. And in 2000, I talked about Osama bin Laden, two years before the World Trade Center . Nobody even understands that every once in a while, one of these political pundits will say, \"That's amazing. Trump was talking about him before he knocked down the World Trade Center.\" We have to know what we're talking about. I've been talking about take the oil. For what? Five years. Take the oil take, the oil take, take the oil. You know who has the oil now? ISIS has the oil. Iran has the oil. Because our politicians are incompetent. They don't know what the hell they're doing. And you know, it's -- it's so unfair because the press is so dirty, the press is so bad. I was asked -- they're terrible. Look at them. They are terrible. Now, they're terrible people. And by the way, we have 15,000 people, we have another 5,000 outside, they're never going to show it. They're never going to show it. You'll go home to your families tonight. You'll say it was unbelievable. And your wife or your husband will say, \"Darling, were there many people there?\" And you know why she won't know because you watched it on television, it's on all the televisions, it's all live. I'm always making these live speeches, it's crazy. I'd love to do it like the other guys. Nobody covers them, they could just go over and over and boring, but nobody shows up. But you're going to go home tonight and your wife or husband will say, \"Were there many people there?\" Because the cameras never want to scan my audiences because they're so big and so incredible. And by the way, we have so many people. I -- I want to -- I want to thank, before I for -- before I read the Snake, I want to thank your police and your chief. He was here. I want to thank Big Joe from Nassau. You know Big Joe, right? Where is Joe? Where is he? He's around here. I want to thank Steve, right, from Suffolk. I want to thank all of the incredible politicians we have. We have -- half of the world is here tonight. But I want to thank all of the political leaders. We have the greatest leaders. We have the greatest leaders in New York State. We have leaders that say we're not going to put up with this stuff any longer. That's what they're saying, folks. So I just want to thank them for being here. So -- so I've called a lot of shots. And I've gotten credit pretty much for calling a lot of shots. I have an instinct, and I do have a good instinct for it. And we have a thing called the migration. Now, we have illegal immigrants pouring into our country. We don't know what's happening. That'll stop. But we have the migration and we have people coming in by the thousands with no documentation, with no paperwork. We don't know where they come from. We don't know who they are. You watch what happens. It could be ISIS. I hope it's not. But you watch what happens. You see what happened in Paris. You see what happened in California with the two people. Two young people got married. They worked. They shot 14 people. Killed them. They became radicalized. And we're not going to -- we're not going to put up with it, folks. We're not going to put up with it. So this was written by the great Al Green. It was a song. And I thought it was great. Now, when you think of this and when you listen to the words, remember what I'm saying. When you listen to the words, you have to think about people pouring into the country. Thank you. That's all right. You know, out of 17,000 people, I think we have one. That'll be headlines tomorrow. OK, that's all right. That's all right. Forget him. You can't hear him anyway. Forget him. That's OK, folks. Forget it. Don't worry about it. That's all right. Ready? Are we ready? Or do you want to let him go a little further? You want him out? All right, got to get out him out. Get him out, please. All right. Get him out. Don't hurt the person. Don't hurt the person. Do not hurt the person. Yeah, don't -- don't hurt him. Don't hurt him. Is the Trump rally the greatest? Is it the greatest? All right, good, get him out. All right, get him out. Thank you. All right, they're gone. You know what it is? I'll tell you. And -- and be very gentle -- very, very gentle. You know I've done it all ways. When I'm -- when I'm like this, they say Trump is getting weaker. When I'm tough, they say he's too tough. You can't win. You can't win. OK. OK, let's go. Are you ready? You ready? So here's the story. You think of this in terms of the people coming into the country, especially coming in from Syria. We don't know where they are. We don't know who they are. We don't know how they're getting in. They're all over the place. Believe me, it's going to be a problem. You think of this, all right? This is called the Snake. On her way to work one morning, down the path along the lake, a tender-hearted woman saw a poor, half frozen snake. His pretty colored skin had been all frosted with the dew. Oh well, she cried, I'll take you in and I'll take care of you. Take me in, oh tender woman. Take me in for heaven's sake. Take me in, oh tender woman, sighed the broken snake. She wrapped him up all cozy in a curvature of silk and then laid him by the fireside with some honey and some milk. Now she hurried home from work that night. As soon as she arrived, she found that pretty snake she'd taken in, finally, finally had been revived. Take me in, oh tender woman, take me in for heaven's sake. Take me in, oh tender woman, sighed the broken snake. Now she clutched him to her bosom. You're so beautiful, she cried. But if I hadn't brought you in by now, heavens, you might have died. Now she stroked his pretty skin and then she kissed him and held him tight. But instead of saying thank you, that snake gave her a vicious bite. Take me in, oh tender woman, take me in for heaven's sake. Take me in, oh tender woman, sighed the broken snake. I saved you, cried the woman, and you bit me, heavens, why? You know your bite is poisonous and now I'm going to die. Oh shut up, silly woman, said the reptile with a grin. You damn well knew I was a snake before you took me in. Believe me, folks. Believe me. Believe me. Now we all understand. Our country has to start getting tough. We have to be vigilant. We have to be vigilant, we have to be smart. We have to know that there's all sorts of traps out there. We don't want more World Trade Centers. We don't want planes flying into the Pentagon. We don't want planes flying in wherever that other plane was going, and we all think we know, the White House. We had some really brave people in all of those planes, but some brave people took down that plane. We don't want -- right? Brave, brave people. Brave, better believe it, in their honor. So we're going to be smart. We're going to be tough. We're going to be vigilant. We're not going to be politically correct all the time, politically correct. I love you too, man. I don't say that often to guys, but I love that guy right over there. So we're going to do a lot of things if I win. We're going to take our budget. We're going to make it good. We're going to make sure that our nations that we're friends with, Japan, and Germany, and South Korea, and many, many nations, Saudi Arabia, so many nations. We pay for their military. We take care of their military. It's all fine. But you know what, folks, we have 19 trillion in debt. We're going to 21 trillion in debt very soon because of a horrible budget that was made three months ago called the Omnibus Budget, which lets everybody come into our country, which is a disaster, which helps Obamacare, which by the way, we're going to repeal and replace with something great. So we're going to bring back our country. We're going to make our country strong again. We're going to make our country respected again. We're going to use our finest people, we're going to use our brightest minds. We're going to make great deals, great transactions. We're going to have Apple computer and we're going to have companies like that, many, many companies. They're going to start making their product not in China, but in the USA, folks. That's where they're going to make their product, 100%, 100%. So here's the story. Here's a story in a nutshell. You're going to look at this night in two years, in four years, in 12 years, in 20 years, and you're going to say this was a great evening. This was an evening -- this was an evening where, for the first time, we heard somebody say that we're not going to be a scapegoat and stupid people anymore. We're not going to allow the world to continue to rip us off. We are going to get along great with the world. But we're not going to let it happen anymore. We're going to say, and I say it now, America first. America first. It'll happen too, folks. And it will happen fast. So here's the story. You're going to remember this evening, and hopefully every single person in this room and people that you know that aren't in this room, next Tuesday -- next Tuesday, meaning -- meaning in 12 days, you're going to go out and vote, and you'll get to say it was the most important vote that you've ever cast. You're going to be proud of your country again. You're going to be proud of your president again. We are going to start winning. We are going to win with our military. We're going to kick the hell out of ISIS. We are going to win with our veterans. We are going to win with health care. We are going to get rid of Common Core, and we're bringing our education locally. We're going to have local education. We are going to protect and cherish our Second Amendment which is under siege. And we are going to have strong borders. We're going to have our country back. And we are going to have the wall. So let me just tell you. Let me just tell you. We're going to start winning again, folks. Going to happen, going to happen, going to happen. So remember this evening, you go out and vote. I can only tell you, you'll be so proud, so happy. We are going to win, win, win. We're going to make America great again. I love you. Thank you. Thank you everybody."}