{"id":414,"author":"Donald Trump","title":"Speech: Donald Trump in Superior, WI","date":"2016-04-04","link":"https://factba.se/transcript/donald-trump-speech-superior-wi-april-4-2016","paragraphs":["You know, we have 4,000, 5,000 people trying to get in. I don't know how they're gonna get in anyway. But we have speakers right in the back. Thousands of people trying to get in. Something's going on folks. Something good is going to happen tomorrow. Remember that. Remember I said it. We're tired of being the dummies.","We're tired of being the ones that are just ripped off all over the world. Everybody rips off our taxpayers. They rip off for our people. We're not gonna take it anymore. The big change is coming. So we'll see what happens. Let's see what happens tomorrow. You know, it's sort of interesting I've been watching and discussing a lot of different subjects and a lot of different waste, fraud, abuse you see what's going on with our country.","And one thing I noticed, I went home last night, I'm watching in a very nice hotel room. I don't ask for much, you know, what I want clean, I want clean. And when I'm in Wisconsin, it's clean. Do we like that? It's all I want is clean. But I went home and I see commercials. Oh, millions of dollars worth -- I just like about Trump.","Millions of dollars worth of commercials. And I say, if these people could save their money, give it to charity. The commercials are so false, for the most part, a little truths every once in a while. But so false. And it happened to me in Florida. You know, in Florida, we won in a landslide. They spent $38 million on commercials.","They had thousands of commercials. I turned on the television. I couldn't stand it. I said, turn it off, turn it off. During one of the major golf tournaments, that's my golf tournament. During the commercial, before they gave out the trophy to Adam Scott at Doral. They come up with a commercial, four in a row, anti-Trump.","And you know, I said something, I just wrote it down. It's called never Trump. Did you hear this never Trump? You know what these are? These are establishment people that don't want to see it happen because they're all on the trough. They're all making a lot of money. I don't even think, in many cases, they care who wins.","They want to keep it going. And you know, I just said, never Trump. If they work this hard to stop Obama, Obama wouldn't have had a chance. You know that? Obama wouldn't have had a chance. So I was riding over and it's like my favorite topic because I'm self funding my campaign. I'm putting up my own money, right?","And nobody does this. I guess, the last bite have been Ross Perot. I don't know. I don't know if anybody that does it. I have turned down tens of millions of dollars from special interests and from people and frankly, from friends of mine. They want to give me millions. One guy in Palm Beach recently said, Donald, we'd like to give you $10 million.","Now, for me to turn it down is, you know, it's like against my grain. Because my whole life I've been taking money. I take, take, take. That's what a businessman does, right, or a business woman. We take. We take. And you know, they come up, I'd like to -- and one guy in particular, he's a very rich guy, a member of the Mar-a-Lago Club, and I see him like a few months ago.","Donald, I'd like to make a major contribution to you or your pact. I said, I don't have a pact. I don't have. You know, all these guys have these phony pacts. In fact, I saw where Cruz the other day had an event run by his pact. That's not allowed. You're not allowed to do that. They said, it was paid for and run by his pact.","You're not allowed to do that, which was -- that's a whole other story. But this guy comes up. He said, I'd like to give you whatever money you want for your campaign. I said, I can't take it. He looked at me said, you're kidding, right? You know, he's a business guy. He said, you're kidding. I said, no, I can't take it. I have turned down so much money.","If I would have accepted it -- you know, I think Bush Jeb had the biggest of all the pacts. He had like $148 million or something they raised and I think it even got a lot bigger than that. I could have had that times four or five, if I would have taken the money. And coming over, I said, you know, I don't think it's appreciated.","I really mean it and I'm not knocking you. But when people look at me and then they look at this guy Cruz, who's totally controlled by the people that give him the money. 100% totally controlled. But when they give him that money or when they give -- how about Kasich. Kasich is 1 for 32, OK? You know, what he is? He's a guy just doesn't stop, which I respect in one way because I always say, never quit, never give up. But you know, if you go by that theory -- and by the way, the people from back there are pouring in as we speak.","If you don't mind, unless you want to wait for about two hours, you want to wait? No. I don't think so. But how about Kasich? He's won how many states are there that we've gone through, like 30 or 32, whatever it is. He won one and I would have won that one if I had two more days. I stayed in Florida to campaign because I thought it was close and we won Florida, by the way, in a landslide.","Won by almost 20 points. And I should have left Florida a little bit early, but I didn't want to take a chance on losing Florida. So if I went to Ohio one extra day, maybe two days, I would have won. We came in very close against him and the machine that's in Ohio, which is fine. I understand it. But here's a guy, he's 1 and 32 and the one is his home state.","I mean, give me a break and he's almost lost it. So he's 1 for 32 and he just says, I'm gonna keep running. I'm gonna keep running. I don't care. And he's taking my votes because he's not taking from Cruz. He's taking from me. And I said to myself, it's unfair because Marco could have stayed, he would -- Marco is doing much better than he was.","Marco could have stayed. They all could have stayed. Jeb Bush could have stayed, right? You know, he would have liked to have stayed. Low energy is would stayed, just stay. But they all could have stayed. If you go by that theory. So I think it's unfair. And I will tell you one thing about Kasich. He voted in favor of NAFTA.","He's in favor -- which is a disaster. That sucked, that sucked the businesses from Wisconsin and every place else. You have to see New England. Just took him away. He voted in favor and what he wants now is TPP, Trans Pacific Partnership, a total disaster for our country, led by the special interests, led by the lobbyist, led by countries that want to rip us off and take our jobs, led by people -- this is gonna make NAFTA look like a baby, folks, and you shouldn't allow it. Ted Cruz wants it. Ted Cruz wants it badly because his people that give him money are telling him, we want it. And it's a bad thing for our country.","Believe me, folks, a really bad thing. I love Wisconsin. I love Wisconsin. You know, it's funny. We had a situation where Cruz was gonna win the South, remember? Until I came along. But he was gonna win the South. And he was actually -- they were thinking New Hampshire but somebody else was supposed to win New Hampshire.","It looked like Jeb was gonna win New Hampshire and I came up. We won New Hampshire in a landslide, right, landslide. And by the way, I spent a tiny fraction of the money. Is that nice when you can spend less and come out number one, isn't that good, right? Don't you want that as your president as opposed to let's spend, spend.","So anyway, so I won New Hampshire. We went to South Carolina. And by the way, won Massachusetts, almost 50% in Massachusetts. Now, Tom Brady likes me a lot so that helps, right? And he did say, you have a great quarterback, OK? So that's good. You have a great quarterback? I think so. And you're gonna have a good year too.","You're gonna have a good year. But I will say, so we won Massachusetts. But we went down to South Carolina and that was Ted Cruz's territory, lying Ted Cruz. The Bible held high. Bible held -- did you ever see a guy lie this guy? What he did to -- how about Dr. Ben Carson, one of the great guys, right? So he endorsed me. But how about what he did in Iowa to Ben Carson?","He said, Ben Carson has left the race. That was during the election, not before or after. And thousands of people voted for him as opposed to Ben and he lied. He just lied. He just said they left the room. And then he just lied, lying Ted. Lying Ted. I will say with Cruz and I don't want his endorsement, by the way.","I really don't. You know, you know these politicians, they say never really do this because you want it. What? Look, at this poor Lindsey Graham, this poor, poor guy. He said the other day, I know more about the war. I've been fighting it for many years. That's the problem. Guys like this they fight it for many years.","They don't know how to win. In South Carolina, I was at 42. He was at 2 and he's the sitting senator of South Carolina. So he hates Ted Cruz, right? So he goes out, he goes out and he endorses Ted Cruz because he kissed him. Look, I really I hit him hard. Hey, look, we have to hit hard. We've got to win.","My wife is always saying and Ivanka -- have you heard of Ivanka, right? Right? Just had a baby. She's great. But they said, Darling, be more presidential. Daddy, be more presidential during the debate. I said, I will but got to knock off the final two first, if you don't mind, right? You know what they mean.","I could be presidential. But if I was presidential, we'll only have about 20% of you would be here because it would be boring as hell, I will say. Now let me be unpresidential just for a little while longer and maybe I'll be a little bit unpresidential as I beat Hillary because oh -- we'll beat Hillary so badly.","Don't forget, I haven't started on Hillary yet. I haven't focused on Hillary. So we started off with 17 people. I've now got two left. I call them, the leftovers, right? I now have two left. And we're way up on both of them. I mean, the one guy I told you he's got -- I mean, it's ridiculous. And at least Cruz has got some.","I saw him the other day and it was from the debate. He goes, I'm the only one -- you know, he can't talk normal. He's got always pretend he's debating. Does that bother people? Do you ever have a conversation -- Donald, I say -- I say, what's going on? But he goes, I'm the only one that has a proven record of beating Donald Trump.","I'm the only one. I've beaten Donald Trump. That's true. He said, I beat him six times. Then I looked at him I said, yeah, but I beat you 22 times, right? And it's a famous -- it's true. And it's a famous picture, where he just ends up like he doesn't even say anything because he's lying Ted. Most guys wouldn't really -- you know, he could say, he said it again today.","He said, he's the only one with a proven record of beating and I'm killing the guy. So it's really disgraceful. I tell you what, politicians are a disgrace, in many cases. I've met some that are very good. But the lying, the deception, the viciousness -- but I've met people that are much tougher than Ted Cruz, but I've never ever met anybody that lied like him.","This guy lies so much, right? Do you remember the voter? Remember Iowa? Remember what he said? It looked like he came right out of the IRS. Voter fraud, voter whatever the hell. He puts it up and people saying, what's going on? And said, the way you get out of it is you have to go and you have to vote for Ted Cruz.","I mean, give me a break. So so here's what, here's what, here's what the facts are folks. We have a very, very big deal coming up and I don't know the polls now. A poll just came out where essentially we're even and I'm feeling it. You know, when I went to New Hampshire, I wasn't supposed to win, right? And I went around for about four days.","I've been here for four days and then went home for like two seconds because I had that meeting with the the Republican National Committee, right? Rights. Rights. We'll find out. We'll find out. Don't worry. I have my eyes wide open. My eyes are wide open, right? You all trust me. My eyes are wide open. He's a nice man.","Somebody said, is he a nice man? I said, yes. I said, are they gonna treat you fairly? I said, I have no idea but I'll let you know in six months. But my eyes are wide open, all right? And I'm representing a tremendous number of people and we are not gonna be taken advantage of by people. You know, I'll give you an example.","I go to Louisiana, I worked hard, made speeches all over. Made a final speech in a hangar that was massive. The place was packed. I end up winning and then I didn't get as many delegates as the guy that lost. I said, what kind of a system is this? So we're dealing with a corrupt system. We're dealing with a system that's not fair.","And I said, if -- I don't care what it said. If I won, I should get more delegates. That we agree? I don't care. So we've -- but we're doing well. We have almost 300 delegates more. We have millions of votes more. People don't ever talk about that. They never mentioned a little thing, but we have millions, millions of votes more.","Now here's who you have to be careful of, those people back there because -- no, I don't even know if they're evil. Some of them are. They're unbelievably dishonest. Congratulations. Unbelievably dishonest. Unbelievable. Because every time I say something, for instance, it was asked to me about NATO and -- you know, look, I've made a lot of money.","I've built a great company. I did my filings. Everyone said, oh filings and they were down. They were hoping the company would be a nothing. We would had the biggest story you've ever seen. Frankly, if it would have been a nothing, I would have never ran because you have to file your papers, right? So I filed this like massive, almost 100-page document and it showed not only some of the greatest assets in the world, but tremendous cash flow, very little debt.","A tremendous company. Turnberry in Scotland, Doral, many buildings all over the place, Bank of America building in San Francisco with a great partner. Lots of great deals, right? Great buildings. 1290 Avenue of the Americas, one of the biggest office buildings in Manhattan. Trump Tower, so many buildings, right?","So I have this great company. Again, very little debt, tremendous cash flow, tremendous company and they didn't complain. They couldn't -- they were devastated. They went up the federal elections said they'd never seen so many people wanting to see a report before. And a friend of mine said, I know how successful you are, but I had no idea was that successful.","I said, how did you know? Did you read the papers? He said, no. Because I know you wouldn't have run unless your papers were damn good and that's true. You couldn't run because you have to file everything. I'm a private company. You have to file. So I filed. And the reason I tell you that story is because that's the kind of thinking we need in the United States.","We have to get our house in order, folks. We have to get our house in order. And we can't let China, who I like, Mexico, who I like, Japan, Vietnam, India. Name a country, name any country, name a country, I guarantee you that country is taking advantage of the United States. It's amazing that we have a country that continues to chug along.","You know, we have no GDP. We're like at 0, 0. If China goes to 7% or 8%, it's like a national catastrophe. We have nothing. Last quarter, like zero. It's slightly slightly more than zero but essentially, it was zero. And believe me, they worked hard to make sure it kept out of that negative term. And you don't see it. You don't see numbers like that.","So that means we're losing our jobs. And you look at Carrier, you look at Ford, you look at Nabisco, you look at all of these companies that are leaving our country, leaving jobs. You look at Pfizer, the great pharmaceutical company, they announced they're leaving. They're moving to Ireland. I hope it's next to some of the land I own.","I own a lot land in Ireland, what the hell. I bought it four or five years ago when things were cheap, right? You know, we want to buy it at the right price, right? So I'm sorry, folks. Sorry. International businessman, what can I say. But you know, we want to keep our companies here. We want to keep our jobs here.","And I tell the story and it could apply to any one of them. It could apply to Nabisco, it could apply certainly to Ford. Ford spent $2.5 billion building a plant, a massive plant in Mexico to make cars, trucks and parts. What do we get out of it? Now they make the cars, they make the trucks, they make the parts.","They send them across the border. Probably those cars are driven by illegals, why not? They can get them for the right price. Nobody checks them, so why can't they? The illegals take the Ford car and they drive it right across the border and everybody is happy, especially the Democrats, right? They're happy.","So we're gonna stop it. We're gonna have such a strong border and we're gonna have a wall that's gonna be a real wall. Believe me, we're gonna have a wall. And the drugs aren't gonna be pouring into this country anymore, poisoning our youth and poisoning everybody else. We are going to have a strong border, we're gonna have a wall and Mexico is gonna pay for the wall as sure as you standing here.","Certainly. But you know, the part of it that's so tough and I can't go through the different things I can go quickly because you've all heard me speak. You know what I represent. I represent, very simply, America first, OK? America First, no more. So the question was asked to me the other day by one of the commentators about NATO.","So I said, well, here's the story. You're ready? NATO is obsolete. They all go, what? Oh, Trump doesn't know anything about NATO. Three days later, they're all saying it was genius. Nobody -- you know they study it and they watch it and they look at it and they're so close to it that they don't even see it. It's obsolete.","But then I said something more profound, frankly, as far as I'm concerned. I said, it's obsolete and we pay proportionately way too much. We have 28 countries and some of the countries are along for a free ride or almost a free ride. So what the hell are we doing? So they get attacked and we protect them.","Oh isn't that a great deal? I love that deal. That's great. That's great. So I said, we have to get those countries to pay, number one. Number two -- and they're many of them. There are many of them. I think we're paying 72% the cost, 72%. We're one country. We're stupid. We're led by stupid people, folks.","We can't do it anymore. We can't do it anymore. We have incompetent leadership and we're not gonna stand for it anymore. And we're -- And not only incompetent, remember this. You know, a lot of people come up to me and they say -- they talk about a certain deal. They say, Mr. Trump, our politicians are so stupid.","I said no, they're not stupid. They're taken care of through campaign contributions. They're not stupid. Some are stupid frankly and some deals, many of the deals are stupid. But many of the deals are made because these companies and various other people that want to make the deal are totally controlling of your Ted Cruz's of the world.","Totally controlling. For instance, Cruz has a personal financial statement, the disclosure form, which is a big deal. He forgot to put on -- he said, I forgot. Lying Ted. Lying Ted. He said, I forgot to put that I borrowed a million dollars at almost no interest, an interest rate anybody in this room would be proud of, OK? Because he's a United States senator.","They gave him all the money. He could have gotten it for nothing probably. He probably said, well, at least put something there. You know, we got to make it look a little good, right? So he borrowed a million dollars from Goldman Sachs and Citibank. Didn't put it on his personal financial disclosure form.","Then he goes around and he acts like Robin Hood like he's gonna protect you from the banks. Give me a break, folks, OK? Doesn't work that way. Nobody knows politicians better than me. That's why I'm doing so well. Don't forget with all these people, one after another, they're gone, they're gone, they're gone.","I've been on center stage, you know, center stage of debates. We had like 11 or 12 debates. I skipped the one because I wasn't treated fairly, but that's OK. That might have been a mistake or maybe not. Who knows? Raised a lot of money for the vets. Raised a lot of money for the vets because I skipped, remember that.","And I would have done it again. But here's the thing. So we had like 11 or 12 debates and I've been center stage on every single debate. That meant I'd been in the lead. And you know, it's funny during the debates or before they announce it. I said, are you gonna say that I'm center stage here, therefore, I'm number one?","No, we won't say it. I say, why wouldn't you? Well, we just don't do that. Now some of them did, but some of them wouldn't do it because they refused to acknowledge that I was number one, but that's all right. Every single debate, I've been exactly center. And some of these guys, they're falling off the platform left or right.","Remember Jeb? He will hit me. I said, Jeb, next week you're gonna be off the platform. You're gonna be falling off the platform. And don't forget Jeb and I can only say this because he endorsed -- you know, now all of a sudden, Cruz is becoming establishment even though they all hate him. But he's becoming more establishment because he's taking a lot of money and these people want -- you know, I had one guy come in. It was interesting.","He's a friend of mine. He want to give me tremendous amounts of money. I said, I don't need it. I'm richer than he is. He said, I know you're richer than me Donald, but I want to give you millions. I said, here's the problem. I can't take it because I'm self funding my campaign. You know, I take the little contributions where people send in $250. They send in $17. They send in even $500, $1000. But small contributions, right?","The minimal contributions because I can't send the money back. Number one, it's expensive to send it back. Number two, half the time you don't know where the hell to send it. And number three, if I sent a woman back who sent -- literally, I have a woman wrote a four page letter with a check for $17.50. If you send that back to a woman it's almost like insulting no matter how you put it, right?","No, it really is. But here's a guy, they spend so much money. They're spending money like it's water and it's so against the system. And it's so against what we all stand for. And what it is is it's inverse, it's actually inverse. The more money they spend and some of them, they raise money. They're really good at it. Remember this about politicians.","They're good at two things: Raising money for themselves and getting elected. He said, he's lying. Well, that's true. That's true. So what we're gonna do is we're gonna change the system and we have a movement going. We have a movement. All over the world they're talking about it. It's been on the cover of Time Magazine like four times in a short period of time.","I've been on the cover of Time Magazine a lot over the last six months. But four times over the last short period of time, the cover of Time, the cover of The New York Times, The Washington Post, everything. I mean, the biggest story is what's happening with Trump. Today, there's a story and they were just reading it to me. I don't even know where the story is, but that Trump has made the networks and television a fortune.","They're having the best year they've ever had because everybody wants to watch Trump. Look at this crowd. And by the way, they -- I wish the press would go to the back and see what I'm talking about. I just wave there. And part of the problem is you know you have to go through the machines unfortunately, which is too bad.","But so many people back there. What's going on -- and we have one today later on in the evening. In fact, my wife is flying in for it. We're gonna have one that's so unbelievable. It's gonna be packed. And Bernie was right next door and he canceled his because they can't compete with what we have. They cannot.","It's ture. It's true. They cannot compete with what we have. They can't compete with our crowds. It's a movement. And you know what it is? It's a movement to common sense. It's a movement to say we're not going to allow it to happen anymore. We're not gonna allow our country to be stripped of its jobs, of its factories.","We're not gonna allow it. You know that people in this area and Steve read you some statistics, they're terrible. You know when Scott Walker -- I should have brought it. Maybe I did. Do I have it? Do I have it? Oh tonight, oh, you wouldn't -- I like this crowd so much, no doubt. You'll see it tonight. I'll bring it in tonight.","So no, Scott Walker came up to my office a year ago. He gave me this beautiful plaque because I gave him a lot of money. I figured, what the heck he's fighting. Give him money. What do I know what he's doing. But then when I looked at the numbers when he announced he was running for president and did you notice we got along very well.","And they all said, well, first they said Jeb was gonna win. I took him out, right? I took him out. So he was gone. Then they said Marco was gonna win, the face of the Republican Party. And we had a great time in Florida. So Marco he goes bye bye. Bye bye. Then they said a lot of other guys, everyone is gonna win, right?","They're all gonna win. Then they said, remember the last one who is gonna be Walker. He was -- when he went in and they said, well, this is really this is a great young Republican, which is true. I hope it's true. But you know, he's against me. So as far as I'm concerned, there's no truth to that. But the fact is you're doing very mediocre.","But when when he went out, Walker, everyone thought that well he was gonna win. And I was very nice to him. He was very nice to me. We went along a couple of months. He was doing well. I was doing well. And it was toward the beginning of the pack because, you know, he had this little reputation going. And then they had a fundraiser and his fundraisers, chief fundraiser -- again, fundraisers, always funds, funds.","Money is the root of all evil, right? But they had a fundraiser and his guy said some nasty things about me, like really, really nasty. And I said, thank you so much. And I was reading a magazine and I was reading what was going on Wisconsin, in Wisconsin. And Wisconsin is a much different place. You know, you're losing a lot of jobs, you're not going up, you're going sideways.","You're very average compared to your neighboring states. You're right in the middle, which is fine. But I thought it was like this great thing. So he had this false still going. And I said, look, he just said bad things. Thank goodness. So I got all the information. I started reading it. He went from number one to out of the race.","And you know how quickly he got out? You know why? Because he couldn't fight the statistics. He couldn't fight it and he got out. And if he wouldn't have done this -- now, I never called him and asked for support in all fairness because I felt I couldn't. I hit him too hard. You know, when you hit people, it's like me calling Jeb.","Jeb, I'd love to have your support. How can he do it? How can he do it? And yet, Chris Christie gave me his support. Dr. Ben Carson gave me his support. We have tremendous support. We have tremendous support. We have tremendous support. Sheriff Joe in Arizona, I mean who's tougher? Who's tougher? Do we love -- do we love Sheriff Joe?","Sheriff Joe gave his support. How important -- let me ask you a raise of hands because you're pretty far away from a certain border. How important is border security for this crowd? Right? Right? We're gonna have such a strong border, folks. We are getting ripped off left and right, and the numbers that are coming in are just disgraceful.","And you see what's going on with the crime. So on June 16th, when I announced that I was running for president, I talked about two things primarily, the border and the lack of safety and the death, the death that's been happening. But I talked about illegal immigration. I talked about trade. They were very close to my heart and I shot up to number one in the polls.","And then we had Paris, which was a disaster. And I talked about radical Islamic terrorism. And I said lots of things and I said very very strong things. And we have to be strong. We have to be smart. We have to be strong. We have to be very very vigilant. We cannot be politically correct. I'm sorry, it's not working.","Political correctness is not working. And everybody said, that's the end of Trump. It's over for Trump. Remember I said we have to do a temporary ban on the Muslims until we find out what's going on, right? I don't want to do that. They said, that's the end. You know, how many times I've been given the end like I've been given the last rites.","How many times? Like 10? Every week, it's the end of Trump. Then they walk in, sir, I don't know what happened but your poll numbers just went through the roof. Sir, can you just -- I mean many, many times. And you know what? I don't even care. I have to tell the truth. I speak the truth and I think people get it. And these guys are liars.","But look, look, the press lies. And I'll give you an example. So I talked about NATO. And I said, it's obsolete. And I said, we're paying too much. And I said, they don't really focus on terrorism. They focus on the Soviet Union, which no longer exists, right? That was -- it was set up very, very much for that reason.","And we have Russia, which is a real threat too. It's not as big as the Soviet Union, but a real threat, run by a very smart cookie, much smarter much, more cunning than our president. I will tell you that right now whether we like it or not. And I like him because he called me a genius. He said Trump is the new real leader.","Trump should be the leader and he's a total genius and it got out of the paper. So he called me genius, but it's not gonna happen. Don't worry about it folks. I am not seduced easily, believe me. I don't care what they could -- he call me that or he could call me the word. I still feel the same. It's gonna be, it's gonna be on a fair basis.","But we'll -- you know, it wouldn't be bad to get along with Russia, right? It wouldn't be bad. It wouldn't be bad to get along with some of these countries that we're not -- on our terms. Only on our terms but it wouldn't be bad. But you know, I watch what's going on. I look at that Iran deal, which to me is one of the most disgraceful things I've ever seen signed.","One of the worst deals I've ever seen signed. And what happened yesterday, Obama now is finally, finally, he saw. Because did you see what they did? They captured a ship from Iran, bringing guns into Yemen. And I mean, this was a lot of stuff. This was serious weaponry. But Obama is now saying that -- not because of that alone.","He's saying, he's angry at Iran. He thinks they've essentially violated. I don't think he wants to say it that way. I'll tell you what it is, they've defaulted. That's what the real word is. They've defaulted on a stupid agreement that should have never been signed. We should have had our prisoners out there long before we started negotiating.","We should have had our prisoners out. You leave the room. We want our prisoners and you double up the sanctions. They give you back the prisoners in 24 hours, folks. We are -- should be -- we're ashamed of ourselves for what's been going on with that deal. So Obama yesterday, for the first time, essentially said that he's very unhappy with Iran and the way they're behaving.","I could have told him that three years ago. I could have told him that. Did you all see that? I could have told him that years ago. It's unbelievable. We're run by babies. We're run by either babies or maybe worse. I mean, there's something going on. There's something going on. So a lot of bad things are happening.","So when I talked about NATO and I talked about the cost, I get a big call from somebody. Oh, Donald they're really hitting you in NATO. Why? Well, they said you want NATO broken up. You want NATO to be terminated. You don't like NATO. You want all these countries to protect themselves. It's not what I said.","You know what I said? I said NATO is OK. It's obsolete. But we have to rejigger and change it and we've got to ask them to pay. We owe $19 trillion. We're going to $21 trillion. Your jobs are all being lost. Do you know that in 17 years a lot of the people in this audience have not had a pay increase? Effectively.","You haven't had a pay increase. And then people wonder why do I get 21,000 people to come and see me in Orlando. Why do I get 35,000 in Mobile, Alabama. Why do I have thousands of people standing in the back of this building trying to get in listening to this speech by loudspeaker. Why? Why? And we have a packed airplane hangar.","Why? The reason is we're sick and tired of what's going on. And let me tell you, one of the people, actually, it was sort of interesting. It was the governor of South Carolina, right? You know, who I'm talking about. She came out and she supported Marco Rubio. And I said, oop, that's the end of that. He came out.","And she supported Marco Rubio. And I said, oop, that's the end of that. Governor Haley. These names -- I wonder if those brands will stick forever. I hope not, right? I hope not. Do you think? Lying Ted is gonna stick because he's . Lying Ted. Isn't it amazing I have the evangelicals because they know I'm a straight shooter.","And they also know that I'm gonna do it right. They know I'm gonna do it right. And by the way, Haley, Governor Haley, when she supported Marco, everybody said, oh that's good. That's good. I even figured, hey, that's gonna be a pretty good endorsement. And then I win South Carolina in a landslide. And it reminded me of this, because you have Walker, who can't support because I hit him hard.","But I hit him hard to win and I hit him hard to tell the truth. I just told the truth. I basically read a story. I took one page out of an otherwise wonderful story, but the one page was about like the economics of what's going on and the job losses and everything else that what's going on. And people are saying, oh he shouldn't be fighting the governor.","The governor is popular. He's a nice guy. First of all, he's not popular. Statewide, he's very unpopular. I think, I made him unpopular in the state. You know the truth is he should have supported me. I think he'd be popular. If you want to know the truth. So she supported in that case, Marco. And you know, I won big.","And I think a lot of big things are gonna happen tomorrow. I think a lot of -- I'm seeing people that are professionals. And you know, the polls are pretty even. Right now the polls are pretty even. But I have a feeling we're gonna have a very big day tomorrow, folks. I think so. We're gonna be doing a lot of celebrating because we're bringing our country back.","But I have a feeling it's gonna be an unbelievable day. So when I talk about things. I wish the press would go through the whole scenario. So you heard about Japan. I saw it yesterday about Japan. Donald Trump knows nothing about our defense or he knows nothing about -- and I'm saying to myself, what I said was great.","We defend Japan, right? We defend. Why are we defending Japan? We defend Japan. Now we don't want them to have nuclear. I don't want him to have nuclear. But you know what, it comes a price. There comes a time at which you say, you know, good luck, defend yourself. We're not gonna continue to pay for your defense and lose a tremendous amount of money, all right?","So what happens is here's what my theory is. They've got to pay us a lot of money, all right, because we cannot continue to do this. And if they don't, you have to be prepared to walk. And if they walk and if we walk, they're gonna arm because their primary problem is North Korea. Now, he's a whack job and he's got a problem, all right?","No, no, he's got a problem. And frankly, maybe they're better off defending. What the hell do we have to be over there for, right? I mean, you know, you could make that case. I can -- I could make that case. Now they'll say, Donald Trump knows nothing about the nuclear strategy. Let me talk about the nuclear strategy.","Pakistan has nukes. China has nukes. So many people have nukes now. It's the biggest problem facing the world today, all right? But there's so many countries that have them. But who has them also? North Korea has them. So we have 28,000 on the border between North and South Korea. We have Japan that's making, I mean, we're just doing their military for peanuts.","We have South Korea. I love South Korea. I love Japan. I have great friends in Japan, great friends in South Korea. South Korea, like Japan, is an economic behemoth. Every television set you order, Samsung, LG. They all come from South Korea. I order thousands a year for different projects, right? They come from South Korea.","I wish they came from Wisconsin. I swear, I'd order them. Even if it was a no name, you know? I like Samsung. I like LG. I like games. Even if I was a no name. If you ordered -- I'd love to order right out of Wisconsin, but we don't make televisions anymore. We don't make anything anymore, folks. We don't make things anymore.","We're gonna have a time in the not-too-distant future if I win, where Apple and other companies are gonna make their products here. And we're not gonna have a made in China and Vietnam and all these other places. I'm telling you. And that's gonna happen. And that's going to happen. So the story is that they have to -- the press, the media they have to tell the full story.","So they come out yesterday, Donald Trump wants to see Japan nuked, meaning nuked, meaning they have the nukes, right? Donald Trump thinks it's fine for Japan to have no Well, I don't like that. But look, we cannot continue to be the policeman of the world. We cannot continue to protect every single country.","I know what's probably going to happen, not definitely, I'm prepared to walk. But probably when I say listen, you have to help us out. You have to pay substantially more money because we cannot continue to pay. They will probably say no and I'll probably walk and that meaning I, meaning our country. And they will probably call back and say, let's go or they'll have to defend themselves, folks.","They'll have to defend themselves. And that's the way it goes, OK? That's OK. You have to be prepared to walk. Same thing, same thing with South Korea. I mean, you know, look, we are taking -- we have 28,000 people there on the border, soldiers, young beautiful soldiers. I mean, that's a dangerous border and they're not paying much.","And every time North Korea acts up. Do you ever see the ship start going, the planes start going and they mobilize it? We're always doing attacks, you know, fake attacks, whatever the hell they call it. We're doing them all over the place. We're working with them. I said, wait a minute, at what point do we stop this?","At what point do people either pay us or something or do whatever. We can't let this -- we cannot continue to go on like this. Saudi Arabia. Remember this, Saudi Arabia, they're fine. I have many friends from Saudi Arabia. Saudi Arabia before the oil went down was making $1 billion a day. They have the largest funds in the world.","They're loaded with money to the gills. The United States protects them. We get like practically nothing. Why? You know why? Because our leaders don't have business instinct. They don't have political instinct. They have no instincts whatsoever. Now here's what's gonna happen. We'll say to Saudi Arabia, fellows, you've got to help us out.","They'll say, no. We'll say, bye bye. About two days later, they'll call us, say, get back here fast. We hear somebody is gonna make a raid. We'll go back. They'll pay us so much money. And you know what? That's fine. OK? That's fine. We've got to change our ways. We've got to do something with -- as an example, with NATO because all of these countries that are getting a free ride, they've got to pay up. Why should we be protecting all these people and all these countries and protecting them from what?","We don't even really know. But why should we? Now, one thing, I want them to pay up but I want them to also pay us back for years of delinquency. For years, we've been protecting him. I want the money back. We've got to make our country strong financially again. Now, if we don't do that, we're sitting on top of a very ugly bubble, folks.","We're not gonna have the country that you know pretty soon. We are gonna have an explosion of a bubble like you've never seen before. Believe me. If I'm president that won't happen. It won't happen because we'll equalize things. We'll normalize things. We have these trade imbalances that are massive. If you look at our trade imbalance with Japan, they send us millions of cars, cars.","You look at those boats, the biggest ships I've ever seen in Los Angeles. They come and cars pour off. It's like a highway. Boom. We send them practically nothing and don't want anything. And when we do, when we send them farm products and things, they send them back and they're perishable. They send them back.","They don't want them because their farmers don't want them and we take them. So we send, they send back. You take a look at the balance, the automobiles hundreds of thousands of cars up here. And what we send over? So that's imbalance. China, the same thing. China is a disaster. $500 billion trade deficit.","They've taken our jobs. They've closed our factories. Millions of people are now working in jobs that they don't want because you know we have a lot of bad jobs. Even the other side, meaning the Democrats, they say the jobs are bad jobs. They're not good jobs. They're not like great jobs anymore. We have bad jobs.","It's called bad jobs. We're gonna change that around. We're gonna bring our companies back and we're not gonna let our companies go so easy. When Carrier air conditioner wants to go to Mexico, we're gonna talk to them. We're gonna say, listen, if you want to go. I think, it's great. You're gonna let all these people go that have helped you build the company for many years.","They're great people. I watched -- I looked at that tape and I looked with that -- look like a mid-level management guy who is telling them, we're closing Carrier. We're moving to Mexico and you're all unemployed. And those people were crying and those people were there for years and they do a great job and nobody disputed that.","I ordered Carrier air conditioners, many of them. I'm not gonna order many more, by the way. But here's the story. Somebody from our country has to tell them, we are going to be charging you a big tax, like 35%, every time you send an air conditioning unit from Mexico into the United States. And you know what?","They're not leaving. And they're not leaving. And folks, they won't be leaving. And the same goes for Ford and the same goes for Nabisco and the same goes for all of these companies that think they're being cute and they think they're being smart. Do you ever notice, do you ever notice that the politicians -- thank you, man.","Do you ever notice that the politicians they talk about this and they're trying to stop the countries from moving out. They don't -- well, we might do this and we might do that and let's do that. So you're wasting time, folks. You're wasting time. I'm the only one that understands. They leave. That's fine.","They want to come back. They have to pay a tax, OK? That's all. Now you can say, I'm not a free trader and I am a free trader. But our country has run amuck. Our country has been led by people that don't know what they're doing and it's out of control. Millions of jobs have been lost. Thousands of factories have been closed in Wisconsin and everywhere else, everywhere else.","You have to see New England, it's like -- I mean, it's incredible what's happened up there. But thousands of factories have been closed and we're not going to let it happen any more. So here's the story. Here's the story. We're gonna be strong on the border, very strong. We're gonna be very, very strong on the border.","We're gonna build the wall. Believe me, Mexico is gonna pay for the war. Remember this. You know, one of the politicians on stage said, Donald, come here. There's no way you're gonna get Mexico to pay for the wall. I said, it's easy. I didn't want to really explain because you know these politicians, they copy.","The other day, I heard Ted Cruz says, we are gonna build a wall. Where did that come from? Where's he been? And you know, he's never gonna build a wall because the special interests aren't gonna let him build a wall, OK? He's never building a wall. It's all talk with these guys. They're all talk, no action.","And he's not building a wall, but it sounded good. He sees the response I'm getting. He said, well, let's stop using it. That's all they do. I mean, that's all they do. So here's what we're gonna do. We're gonna start winning again as a country. We don't win anymore. When was the last time we won? We don't win in trade.","We can't beat ISIS with the military. So we're gonna start winning. We're gonna knock the hell out of ISIS. Our military is depleted. Totally depleted. Our military is totally depleted. We're gonna knock the hell out of ISIS and we're gonna build a military bigger and stronger and better than ever before.","And it's the cheapest thing we can do, believe me. And hopefully, we'll never have to use it but nobody is gonna mess around with us, folks. OK? Nobody. Nobody. We're gonna take care of our vets because our vets have been absolutely handled so badly. People that come into our country illegally, illegal immigrants are treated better than our vets in many, many cases.","And believe me, you can look statistically that's a fact. We are gonna take care of our great vets, OK? We're gonna get rid of Common Core and we're gonna bring education local. We're gonna repeal and replace Obamacare, which does not work. It doesn't work. I don't know if you see and I'm sure most of you do, your premiums are going up 35%, 45%, 55%. Your deductibles are so high you'll never get a chance to use it. Hopefully, you don't want to use it. But you'll never get a chance to use it. It's no good.","It doesn't work. We will have alternatives that is so good, that is so much less expensive and that work much better. That work much better. It's like me versus some of these guys. I spent less money and I'm number one. They spend much more money than I do and their way -- forget it. And they're never gonna win.","We are going to protect our Second Amendment, which is under siege. We are going to win on trade. We are getting killed with every single country on trade. We are gonna renegotiate our trade deals and we're gonna have the greatest traders. We're gonna make -- We're gonna be back again. We're gonna be back again.","We're gonna bring our jobs back. We're gonna make great trade deals. I have the greatest people in the world. I have the greatest business people in the world. Many of whom I know. The ones that I don't know, I'm finding out about. I'll tell you, we have the greatest negotiators and the greatest business people in the world and we don't use them.","We use political hacks to negotiate the biggest deals with these massive countries. Those days are over. We're going to make great trade deals and they're not taking our jobs any longer. And we're gonna have a very powerful and very, very strong border. We're gonna have the wall. We're gonna have a strong border.","And by the way, people can come into our country but they come in legally. They come in through a process and they come in legally. No more walking across -- in honor of Wisconsin, you know, we talk about cheese. Now, we'll just talk about a certain kind of cheese. What kind of cheese? Swiss cheese big holes in it. Right now, they walk across -- by the way, I'm very honored because not only Sheriff Joe Arpaio, but yesterday, you saw the U.S. border patrol -- these are great people.","They never endorsed a presidential candidate before. I didn't even ask for their endorsement. We got a call, 16,500 border patrol, they endorsed Donald Trump for president. That tells you, right? I mean that tells you. So folks, I -- it's such an honor being here. It's cold outside and it's cold for you and you waited.","Some of you were waiting three, four hours and some of the folks are still trying to get in. But I'll tell you, I love you all. We're gonna do an amazing job for you. You're gonna look at this afternoon as being -- you'll look back in four years or two years or 20 years and you're gonna say this was one of the most important afternoons you've ever had.","More importantly, tomorrow's vote. You will look back and you will say, it was the single greatest vote you've ever cast. That's when our country became great again. We will make America great again. Thank you, Wisconsin. I love you. Go out and vote."],"text":" You know, we have 4,000, 5,000 people trying to get in. I don't know how they're gonna get in anyway. But we have speakers right in the back. Thousands of people trying to get in. Something's going on folks. Something good is going to happen tomorrow. Remember that. Remember I said it. We're tired of being the dummies. We're tired of being the ones that are just ripped off all over the world. Everybody rips off our taxpayers. They rip off for our people. We're not gonna take it anymore. The big change is coming. So we'll see what happens. Let's see what happens tomorrow. You know, it's sort of interesting I've been watching and discussing a lot of different subjects and a lot of different waste, fraud, abuse you see what's going on with our country. And one thing I noticed, I went home last night, I'm watching in a very nice hotel room. I don't ask for much, you know, what I want clean, I want clean. And when I'm in Wisconsin, it's clean. Do we like that? It's all I want is clean. But I went home and I see commercials. Oh, millions of dollars worth -- I just like about Trump. Millions of dollars worth of commercials. And I say, if these people could save their money, give it to charity. The commercials are so false, for the most part, a little truths every once in a while. But so false. And it happened to me in Florida. You know, in Florida, we won in a landslide. They spent $38 million on commercials. They had thousands of commercials. I turned on the television. I couldn't stand it. I said, turn it off, turn it off. During one of the major golf tournaments, that's my golf tournament. During the commercial, before they gave out the trophy to Adam Scott at Doral. They come up with a commercial, four in a row, anti-Trump. And you know, I said something, I just wrote it down. It's called never Trump. Did you hear this never Trump? You know what these are? These are establishment people that don't want to see it happen because they're all on the trough. They're all making a lot of money. I don't even think, in many cases, they care who wins. They want to keep it going. And you know, I just said, never Trump. If they work this hard to stop Obama, Obama wouldn't have had a chance. You know that? Obama wouldn't have had a chance. So I was riding over and it's like my favorite topic because I'm self funding my campaign. I'm putting up my own money, right? And nobody does this. I guess, the last bite have been Ross Perot. I don't know. I don't know if anybody that does it. I have turned down tens of millions of dollars from special interests and from people and frankly, from friends of mine. They want to give me millions. One guy in Palm Beach recently said, Donald, we'd like to give you $10 million. Now, for me to turn it down is, you know, it's like against my grain. Because my whole life I've been taking money. I take, take, take. That's what a businessman does, right, or a business woman. We take. We take. And you know, they come up, I'd like to -- and one guy in particular, he's a very rich guy, a member of the Mar-a-Lago Club, and I see him like a few months ago. Donald, I'd like to make a major contribution to you or your pact. I said, I don't have a pact. I don't have. You know, all these guys have these phony pacts. In fact, I saw where Cruz the other day had an event run by his pact. That's not allowed. You're not allowed to do that. They said, it was paid for and run by his pact. You're not allowed to do that, which was -- that's a whole other story. But this guy comes up. He said, I'd like to give you whatever money you want for your campaign. I said, I can't take it. He looked at me said, you're kidding, right? You know, he's a business guy. He said, you're kidding. I said, no, I can't take it. I have turned down so much money. If I would have accepted it -- you know, I think Bush Jeb had the biggest of all the pacts. He had like $148 million or something they raised and I think it even got a lot bigger than that. I could have had that times four or five, if I would have taken the money. And coming over, I said, you know, I don't think it's appreciated. I really mean it and I'm not knocking you. But when people look at me and then they look at this guy Cruz, who's totally controlled by the people that give him the money. 100% totally controlled. But when they give him that money or when they give -- how about Kasich. Kasich is 1 for 32, OK? You know, what he is? He's a guy just doesn't stop, which I respect in one way because I always say, never quit, never give up. But you know, if you go by that theory -- and by the way, the people from back there are pouring in as we speak. If you don't mind, unless you want to wait for about two hours, you want to wait? No. I don't think so. But how about Kasich? He's won how many states are there that we've gone through, like 30 or 32, whatever it is. He won one and I would have won that one if I had two more days. I stayed in Florida to campaign because I thought it was close and we won Florida, by the way, in a landslide. Won by almost 20 points. And I should have left Florida a little bit early, but I didn't want to take a chance on losing Florida. So if I went to Ohio one extra day, maybe two days, I would have won. We came in very close against him and the machine that's in Ohio, which is fine. I understand it. But here's a guy, he's 1 and 32 and the one is his home state. I mean, give me a break and he's almost lost it. So he's 1 for 32 and he just says, I'm gonna keep running. I'm gonna keep running. I don't care. And he's taking my votes because he's not taking from Cruz. He's taking from me. And I said to myself, it's unfair because Marco could have stayed, he would -- Marco is doing much better than he was. Marco could have stayed. They all could have stayed. Jeb Bush could have stayed, right? You know, he would have liked to have stayed. Low energy is would stayed, just stay. But they all could have stayed. If you go by that theory. So I think it's unfair. And I will tell you one thing about Kasich. He voted in favor of NAFTA. He's in favor -- which is a disaster. That sucked, that sucked the businesses from Wisconsin and every place else. You have to see New England. Just took him away. He voted in favor and what he wants now is TPP, Trans Pacific Partnership, a total disaster for our country, led by the special interests, led by the lobbyist, led by countries that want to rip us off and take our jobs, led by people -- this is gonna make NAFTA look like a baby, folks, and you shouldn't allow it. Ted Cruz wants it. Ted Cruz wants it badly because his people that give him money are telling him, we want it. And it's a bad thing for our country. Believe me, folks, a really bad thing. I love Wisconsin. I love Wisconsin. You know, it's funny. We had a situation where Cruz was gonna win the South, remember? Until I came along. But he was gonna win the South. And he was actually -- they were thinking New Hampshire but somebody else was supposed to win New Hampshire. It looked like Jeb was gonna win New Hampshire and I came up. We won New Hampshire in a landslide, right, landslide. And by the way, I spent a tiny fraction of the money. Is that nice when you can spend less and come out number one, isn't that good, right? Don't you want that as your president as opposed to let's spend, spend. So anyway, so I won New Hampshire. We went to South Carolina. And by the way, won Massachusetts, almost 50% in Massachusetts. Now, Tom Brady likes me a lot so that helps, right? And he did say, you have a great quarterback, OK? So that's good. You have a great quarterback? I think so. And you're gonna have a good year too. You're gonna have a good year. But I will say, so we won Massachusetts. But we went down to South Carolina and that was Ted Cruz's territory, lying Ted Cruz. The Bible held high. Bible held -- did you ever see a guy lie this guy? What he did to -- how about Dr. Ben Carson, one of the great guys, right? So he endorsed me. But how about what he did in Iowa to Ben Carson? He said, Ben Carson has left the race. That was during the election, not before or after. And thousands of people voted for him as opposed to Ben and he lied. He just lied. He just said they left the room. And then he just lied, lying Ted. Lying Ted. I will say with Cruz and I don't want his endorsement, by the way. I really don't. You know, you know these politicians, they say never really do this because you want it. What? Look, at this poor Lindsey Graham, this poor, poor guy. He said the other day, I know more about the war. I've been fighting it for many years. That's the problem. Guys like this they fight it for many years. They don't know how to win. In South Carolina, I was at 42. He was at 2 and he's the sitting senator of South Carolina. So he hates Ted Cruz, right? So he goes out, he goes out and he endorses Ted Cruz because he kissed him. Look, I really I hit him hard. Hey, look, we have to hit hard. We've got to win. My wife is always saying and Ivanka -- have you heard of Ivanka, right? Right? Just had a baby. She's great. But they said, Darling, be more presidential. Daddy, be more presidential during the debate. I said, I will but got to knock off the final two first, if you don't mind, right? You know what they mean. I could be presidential. But if I was presidential, we'll only have about 20% of you would be here because it would be boring as hell, I will say. Now let me be unpresidential just for a little while longer and maybe I'll be a little bit unpresidential as I beat Hillary because oh -- we'll beat Hillary so badly. Don't forget, I haven't started on Hillary yet. I haven't focused on Hillary. So we started off with 17 people. I've now got two left. I call them, the leftovers, right? I now have two left. And we're way up on both of them. I mean, the one guy I told you he's got -- I mean, it's ridiculous. And at least Cruz has got some. I saw him the other day and it was from the debate. He goes, I'm the only one -- you know, he can't talk normal. He's got always pretend he's debating. Does that bother people? Do you ever have a conversation -- Donald, I say -- I say, what's going on? But he goes, I'm the only one that has a proven record of beating Donald Trump. I'm the only one. I've beaten Donald Trump. That's true. He said, I beat him six times. Then I looked at him I said, yeah, but I beat you 22 times, right? And it's a famous -- it's true. And it's a famous picture, where he just ends up like he doesn't even say anything because he's lying Ted. Most guys wouldn't really -- you know, he could say, he said it again today. He said, he's the only one with a proven record of beating and I'm killing the guy. So it's really disgraceful. I tell you what, politicians are a disgrace, in many cases. I've met some that are very good. But the lying, the deception, the viciousness -- but I've met people that are much tougher than Ted Cruz, but I've never ever met anybody that lied like him. This guy lies so much, right? Do you remember the voter? Remember Iowa? Remember what he said? It looked like he came right out of the IRS. Voter fraud, voter whatever the hell. He puts it up and people saying, what's going on? And said, the way you get out of it is you have to go and you have to vote for Ted Cruz. I mean, give me a break. So so here's what, here's what, here's what the facts are folks. We have a very, very big deal coming up and I don't know the polls now. A poll just came out where essentially we're even and I'm feeling it. You know, when I went to New Hampshire, I wasn't supposed to win, right? And I went around for about four days. I've been here for four days and then went home for like two seconds because I had that meeting with the the Republican National Committee, right? Rights. Rights. We'll find out. We'll find out. Don't worry. I have my eyes wide open. My eyes are wide open, right? You all trust me. My eyes are wide open. He's a nice man. Somebody said, is he a nice man? I said, yes. I said, are they gonna treat you fairly? I said, I have no idea but I'll let you know in six months. But my eyes are wide open, all right? And I'm representing a tremendous number of people and we are not gonna be taken advantage of by people. You know, I'll give you an example. I go to Louisiana, I worked hard, made speeches all over. Made a final speech in a hangar that was massive. The place was packed. I end up winning and then I didn't get as many delegates as the guy that lost. I said, what kind of a system is this? So we're dealing with a corrupt system. We're dealing with a system that's not fair. And I said, if -- I don't care what it said. If I won, I should get more delegates. That we agree? I don't care. So we've -- but we're doing well. We have almost 300 delegates more. We have millions of votes more. People don't ever talk about that. They never mentioned a little thing, but we have millions, millions of votes more. Now here's who you have to be careful of, those people back there because -- no, I don't even know if they're evil. Some of them are. They're unbelievably dishonest. Congratulations. Unbelievably dishonest. Unbelievable. Because every time I say something, for instance, it was asked to me about NATO and -- you know, look, I've made a lot of money. I've built a great company. I did my filings. Everyone said, oh filings and they were down. They were hoping the company would be a nothing. We would had the biggest story you've ever seen. Frankly, if it would have been a nothing, I would have never ran because you have to file your papers, right? So I filed this like massive, almost 100-page document and it showed not only some of the greatest assets in the world, but tremendous cash flow, very little debt. A tremendous company. Turnberry in Scotland, Doral, many buildings all over the place, Bank of America building in San Francisco with a great partner. Lots of great deals, right? Great buildings. 1290 Avenue of the Americas, one of the biggest office buildings in Manhattan. Trump Tower, so many buildings, right? So I have this great company. Again, very little debt, tremendous cash flow, tremendous company and they didn't complain. They couldn't -- they were devastated. They went up the federal elections said they'd never seen so many people wanting to see a report before. And a friend of mine said, I know how successful you are, but I had no idea was that successful. I said, how did you know? Did you read the papers? He said, no. Because I know you wouldn't have run unless your papers were damn good and that's true. You couldn't run because you have to file everything. I'm a private company. You have to file. So I filed. And the reason I tell you that story is because that's the kind of thinking we need in the United States. We have to get our house in order, folks. We have to get our house in order. And we can't let China, who I like, Mexico, who I like, Japan, Vietnam, India. Name a country, name any country, name a country, I guarantee you that country is taking advantage of the United States. It's amazing that we have a country that continues to chug along. You know, we have no GDP. We're like at 0, 0. If China goes to 7% or 8%, it's like a national catastrophe. We have nothing. Last quarter, like zero. It's slightly slightly more than zero but essentially, it was zero. And believe me, they worked hard to make sure it kept out of that negative term. And you don't see it. You don't see numbers like that. So that means we're losing our jobs. And you look at Carrier, you look at Ford, you look at Nabisco, you look at all of these companies that are leaving our country, leaving jobs. You look at Pfizer, the great pharmaceutical company, they announced they're leaving. They're moving to Ireland. I hope it's next to some of the land I own. I own a lot land in Ireland, what the hell. I bought it four or five years ago when things were cheap, right? You know, we want to buy it at the right price, right? So I'm sorry, folks. Sorry. International businessman, what can I say. But you know, we want to keep our companies here. We want to keep our jobs here. And I tell the story and it could apply to any one of them. It could apply to Nabisco, it could apply certainly to Ford. Ford spent $2.5 billion building a plant, a massive plant in Mexico to make cars, trucks and parts. What do we get out of it? Now they make the cars, they make the trucks, they make the parts. They send them across the border. Probably those cars are driven by illegals, why not? They can get them for the right price. Nobody checks them, so why can't they? The illegals take the Ford car and they drive it right across the border and everybody is happy, especially the Democrats, right? They're happy. So we're gonna stop it. We're gonna have such a strong border and we're gonna have a wall that's gonna be a real wall. Believe me, we're gonna have a wall. And the drugs aren't gonna be pouring into this country anymore, poisoning our youth and poisoning everybody else. We are going to have a strong border, we're gonna have a wall and Mexico is gonna pay for the wall as sure as you standing here. Certainly. But you know, the part of it that's so tough and I can't go through the different things I can go quickly because you've all heard me speak. You know what I represent. I represent, very simply, America first, OK? America First, no more. So the question was asked to me the other day by one of the commentators about NATO. So I said, well, here's the story. You're ready? NATO is obsolete. They all go, what? Oh, Trump doesn't know anything about NATO. Three days later, they're all saying it was genius. Nobody -- you know they study it and they watch it and they look at it and they're so close to it that they don't even see it. It's obsolete. But then I said something more profound, frankly, as far as I'm concerned. I said, it's obsolete and we pay proportionately way too much. We have 28 countries and some of the countries are along for a free ride or almost a free ride. So what the hell are we doing? So they get attacked and we protect them. Oh isn't that a great deal? I love that deal. That's great. That's great. So I said, we have to get those countries to pay, number one. Number two -- and they're many of them. There are many of them. I think we're paying 72% the cost, 72%. We're one country. We're stupid. We're led by stupid people, folks. We can't do it anymore. We can't do it anymore. We have incompetent leadership and we're not gonna stand for it anymore. And we're -- And not only incompetent, remember this. You know, a lot of people come up to me and they say -- they talk about a certain deal. They say, Mr. Trump, our politicians are so stupid. I said no, they're not stupid. They're taken care of through campaign contributions. They're not stupid. Some are stupid frankly and some deals, many of the deals are stupid. But many of the deals are made because these companies and various other people that want to make the deal are totally controlling of your Ted Cruz's of the world. Totally controlling. For instance, Cruz has a personal financial statement, the disclosure form, which is a big deal. He forgot to put on -- he said, I forgot. Lying Ted. Lying Ted. He said, I forgot to put that I borrowed a million dollars at almost no interest, an interest rate anybody in this room would be proud of, OK? Because he's a United States senator. They gave him all the money. He could have gotten it for nothing probably. He probably said, well, at least put something there. You know, we got to make it look a little good, right? So he borrowed a million dollars from Goldman Sachs and Citibank. Didn't put it on his personal financial disclosure form. Then he goes around and he acts like Robin Hood like he's gonna protect you from the banks. Give me a break, folks, OK? Doesn't work that way. Nobody knows politicians better than me. That's why I'm doing so well. Don't forget with all these people, one after another, they're gone, they're gone, they're gone. I've been on center stage, you know, center stage of debates. We had like 11 or 12 debates. I skipped the one because I wasn't treated fairly, but that's OK. That might have been a mistake or maybe not. Who knows? Raised a lot of money for the vets. Raised a lot of money for the vets because I skipped, remember that. And I would have done it again. But here's the thing. So we had like 11 or 12 debates and I've been center stage on every single debate. That meant I'd been in the lead. And you know, it's funny during the debates or before they announce it. I said, are you gonna say that I'm center stage here, therefore, I'm number one? No, we won't say it. I say, why wouldn't you? Well, we just don't do that. Now some of them did, but some of them wouldn't do it because they refused to acknowledge that I was number one, but that's all right. Every single debate, I've been exactly center. And some of these guys, they're falling off the platform left or right. Remember Jeb? He will hit me. I said, Jeb, next week you're gonna be off the platform. You're gonna be falling off the platform. And don't forget Jeb and I can only say this because he endorsed -- you know, now all of a sudden, Cruz is becoming establishment even though they all hate him. But he's becoming more establishment because he's taking a lot of money and these people want -- you know, I had one guy come in. It was interesting. He's a friend of mine. He want to give me tremendous amounts of money. I said, I don't need it. I'm richer than he is. He said, I know you're richer than me Donald, but I want to give you millions. I said, here's the problem. I can't take it because I'm self funding my campaign. You know, I take the little contributions where people send in $250. They send in $17. They send in even $500, $1000. But small contributions, right? The minimal contributions because I can't send the money back. Number one, it's expensive to send it back. Number two, half the time you don't know where the hell to send it. And number three, if I sent a woman back who sent -- literally, I have a woman wrote a four page letter with a check for $17.50. If you send that back to a woman it's almost like insulting no matter how you put it, right? No, it really is. But here's a guy, they spend so much money. They're spending money like it's water and it's so against the system. And it's so against what we all stand for. And what it is is it's inverse, it's actually inverse. The more money they spend and some of them, they raise money. They're really good at it. Remember this about politicians. They're good at two things: Raising money for themselves and getting elected. He said, he's lying. Well, that's true. That's true. So what we're gonna do is we're gonna change the system and we have a movement going. We have a movement. All over the world they're talking about it. It's been on the cover of Time Magazine like four times in a short period of time. I've been on the cover of Time Magazine a lot over the last six months. But four times over the last short period of time, the cover of Time, the cover of The New York Times, The Washington Post, everything. I mean, the biggest story is what's happening with Trump. Today, there's a story and they were just reading it to me. I don't even know where the story is, but that Trump has made the networks and television a fortune. They're having the best year they've ever had because everybody wants to watch Trump. Look at this crowd. And by the way, they -- I wish the press would go to the back and see what I'm talking about. I just wave there. And part of the problem is you know you have to go through the machines unfortunately, which is too bad. But so many people back there. What's going on -- and we have one today later on in the evening. In fact, my wife is flying in for it. We're gonna have one that's so unbelievable. It's gonna be packed. And Bernie was right next door and he canceled his because they can't compete with what we have. They cannot. It's ture. It's true. They cannot compete with what we have. They can't compete with our crowds. It's a movement. And you know what it is? It's a movement to common sense. It's a movement to say we're not going to allow it to happen anymore. We're not gonna allow our country to be stripped of its jobs, of its factories. We're not gonna allow it. You know that people in this area and Steve read you some statistics, they're terrible. You know when Scott Walker -- I should have brought it. Maybe I did. Do I have it? Do I have it? Oh tonight, oh, you wouldn't -- I like this crowd so much, no doubt. You'll see it tonight. I'll bring it in tonight. So no, Scott Walker came up to my office a year ago. He gave me this beautiful plaque because I gave him a lot of money. I figured, what the heck he's fighting. Give him money. What do I know what he's doing. But then when I looked at the numbers when he announced he was running for president and did you notice we got along very well. And they all said, well, first they said Jeb was gonna win. I took him out, right? I took him out. So he was gone. Then they said Marco was gonna win, the face of the Republican Party. And we had a great time in Florida. So Marco he goes bye bye. Bye bye. Then they said a lot of other guys, everyone is gonna win, right? They're all gonna win. Then they said, remember the last one who is gonna be Walker. He was -- when he went in and they said, well, this is really this is a great young Republican, which is true. I hope it's true. But you know, he's against me. So as far as I'm concerned, there's no truth to that. But the fact is you're doing very mediocre. But when when he went out, Walker, everyone thought that well he was gonna win. And I was very nice to him. He was very nice to me. We went along a couple of months. He was doing well. I was doing well. And it was toward the beginning of the pack because, you know, he had this little reputation going. And then they had a fundraiser and his fundraisers, chief fundraiser -- again, fundraisers, always funds, funds. Money is the root of all evil, right? But they had a fundraiser and his guy said some nasty things about me, like really, really nasty. And I said, thank you so much. And I was reading a magazine and I was reading what was going on Wisconsin, in Wisconsin. And Wisconsin is a much different place. You know, you're losing a lot of jobs, you're not going up, you're going sideways. You're very average compared to your neighboring states. You're right in the middle, which is fine. But I thought it was like this great thing. So he had this false still going. And I said, look, he just said bad things. Thank goodness. So I got all the information. I started reading it. He went from number one to out of the race. And you know how quickly he got out? You know why? Because he couldn't fight the statistics. He couldn't fight it and he got out. And if he wouldn't have done this -- now, I never called him and asked for support in all fairness because I felt I couldn't. I hit him too hard. You know, when you hit people, it's like me calling Jeb. Jeb, I'd love to have your support. How can he do it? How can he do it? And yet, Chris Christie gave me his support. Dr. Ben Carson gave me his support. We have tremendous support. We have tremendous support. We have tremendous support. Sheriff Joe in Arizona, I mean who's tougher? Who's tougher? Do we love -- do we love Sheriff Joe? Sheriff Joe gave his support. How important -- let me ask you a raise of hands because you're pretty far away from a certain border. How important is border security for this crowd? Right? Right? We're gonna have such a strong border, folks. We are getting ripped off left and right, and the numbers that are coming in are just disgraceful. And you see what's going on with the crime. So on June 16th, when I announced that I was running for president, I talked about two things primarily, the border and the lack of safety and the death, the death that's been happening. But I talked about illegal immigration. I talked about trade. They were very close to my heart and I shot up to number one in the polls. And then we had Paris, which was a disaster. And I talked about radical Islamic terrorism. And I said lots of things and I said very very strong things. And we have to be strong. We have to be smart. We have to be strong. We have to be very very vigilant. We cannot be politically correct. I'm sorry, it's not working. Political correctness is not working. And everybody said, that's the end of Trump. It's over for Trump. Remember I said we have to do a temporary ban on the Muslims until we find out what's going on, right? I don't want to do that. They said, that's the end. You know, how many times I've been given the end like I've been given the last rites. How many times? Like 10? Every week, it's the end of Trump. Then they walk in, sir, I don't know what happened but your poll numbers just went through the roof. Sir, can you just -- I mean many, many times. And you know what? I don't even care. I have to tell the truth. I speak the truth and I think people get it. And these guys are liars. But look, look, the press lies. And I'll give you an example. So I talked about NATO. And I said, it's obsolete. And I said, we're paying too much. And I said, they don't really focus on terrorism. They focus on the Soviet Union, which no longer exists, right? That was -- it was set up very, very much for that reason. And we have Russia, which is a real threat too. It's not as big as the Soviet Union, but a real threat, run by a very smart cookie, much smarter much, more cunning than our president. I will tell you that right now whether we like it or not. And I like him because he called me a genius. He said Trump is the new real leader. Trump should be the leader and he's a total genius and it got out of the paper. So he called me genius, but it's not gonna happen. Don't worry about it folks. I am not seduced easily, believe me. I don't care what they could -- he call me that or he could call me the word. I still feel the same. It's gonna be, it's gonna be on a fair basis. But we'll -- you know, it wouldn't be bad to get along with Russia, right? It wouldn't be bad. It wouldn't be bad to get along with some of these countries that we're not -- on our terms. Only on our terms but it wouldn't be bad. But you know, I watch what's going on. I look at that Iran deal, which to me is one of the most disgraceful things I've ever seen signed. One of the worst deals I've ever seen signed. And what happened yesterday, Obama now is finally, finally, he saw. Because did you see what they did? They captured a ship from Iran, bringing guns into Yemen. And I mean, this was a lot of stuff. This was serious weaponry. But Obama is now saying that -- not because of that alone. He's saying, he's angry at Iran. He thinks they've essentially violated. I don't think he wants to say it that way. I'll tell you what it is, they've defaulted. That's what the real word is. They've defaulted on a stupid agreement that should have never been signed. We should have had our prisoners out there long before we started negotiating. We should have had our prisoners out. You leave the room. We want our prisoners and you double up the sanctions. They give you back the prisoners in 24 hours, folks. We are -- should be -- we're ashamed of ourselves for what's been going on with that deal. So Obama yesterday, for the first time, essentially said that he's very unhappy with Iran and the way they're behaving. I could have told him that three years ago. I could have told him that. Did you all see that? I could have told him that years ago. It's unbelievable. We're run by babies. We're run by either babies or maybe worse. I mean, there's something going on. There's something going on. So a lot of bad things are happening. So when I talked about NATO and I talked about the cost, I get a big call from somebody. Oh, Donald they're really hitting you in NATO. Why? Well, they said you want NATO broken up. You want NATO to be terminated. You don't like NATO. You want all these countries to protect themselves. It's not what I said. You know what I said? I said NATO is OK. It's obsolete. But we have to rejigger and change it and we've got to ask them to pay. We owe $19 trillion. We're going to $21 trillion. Your jobs are all being lost. Do you know that in 17 years a lot of the people in this audience have not had a pay increase? Effectively. You haven't had a pay increase. And then people wonder why do I get 21,000 people to come and see me in Orlando. Why do I get 35,000 in Mobile, Alabama. Why do I have thousands of people standing in the back of this building trying to get in listening to this speech by loudspeaker. Why? Why? And we have a packed airplane hangar. Why? The reason is we're sick and tired of what's going on. And let me tell you, one of the people, actually, it was sort of interesting. It was the governor of South Carolina, right? You know, who I'm talking about. She came out and she supported Marco Rubio. And I said, oop, that's the end of that. He came out. And she supported Marco Rubio. And I said, oop, that's the end of that. Governor Haley. These names -- I wonder if those brands will stick forever. I hope not, right? I hope not. Do you think? Lying Ted is gonna stick because he's . Lying Ted. Isn't it amazing I have the evangelicals because they know I'm a straight shooter. And they also know that I'm gonna do it right. They know I'm gonna do it right. And by the way, Haley, Governor Haley, when she supported Marco, everybody said, oh that's good. That's good. I even figured, hey, that's gonna be a pretty good endorsement. And then I win South Carolina in a landslide. And it reminded me of this, because you have Walker, who can't support because I hit him hard. But I hit him hard to win and I hit him hard to tell the truth. I just told the truth. I basically read a story. I took one page out of an otherwise wonderful story, but the one page was about like the economics of what's going on and the job losses and everything else that what's going on. And people are saying, oh he shouldn't be fighting the governor. The governor is popular. He's a nice guy. First of all, he's not popular. Statewide, he's very unpopular. I think, I made him unpopular in the state. You know the truth is he should have supported me. I think he'd be popular. If you want to know the truth. So she supported in that case, Marco. And you know, I won big. And I think a lot of big things are gonna happen tomorrow. I think a lot of -- I'm seeing people that are professionals. And you know, the polls are pretty even. Right now the polls are pretty even. But I have a feeling we're gonna have a very big day tomorrow, folks. I think so. We're gonna be doing a lot of celebrating because we're bringing our country back. But I have a feeling it's gonna be an unbelievable day. So when I talk about things. I wish the press would go through the whole scenario. So you heard about Japan. I saw it yesterday about Japan. Donald Trump knows nothing about our defense or he knows nothing about -- and I'm saying to myself, what I said was great. We defend Japan, right? We defend. Why are we defending Japan? We defend Japan. Now we don't want them to have nuclear. I don't want him to have nuclear. But you know what, it comes a price. There comes a time at which you say, you know, good luck, defend yourself. We're not gonna continue to pay for your defense and lose a tremendous amount of money, all right? So what happens is here's what my theory is. They've got to pay us a lot of money, all right, because we cannot continue to do this. And if they don't, you have to be prepared to walk. And if they walk and if we walk, they're gonna arm because their primary problem is North Korea. Now, he's a whack job and he's got a problem, all right? No, no, he's got a problem. And frankly, maybe they're better off defending. What the hell do we have to be over there for, right? I mean, you know, you could make that case. I can -- I could make that case. Now they'll say, Donald Trump knows nothing about the nuclear strategy. Let me talk about the nuclear strategy. Pakistan has nukes. China has nukes. So many people have nukes now. It's the biggest problem facing the world today, all right? But there's so many countries that have them. But who has them also? North Korea has them. So we have 28,000 on the border between North and South Korea. We have Japan that's making, I mean, we're just doing their military for peanuts. We have South Korea. I love South Korea. I love Japan. I have great friends in Japan, great friends in South Korea. South Korea, like Japan, is an economic behemoth. Every television set you order, Samsung, LG. They all come from South Korea. I order thousands a year for different projects, right? They come from South Korea. I wish they came from Wisconsin. I swear, I'd order them. Even if it was a no name, you know? I like Samsung. I like LG. I like games. Even if I was a no name. If you ordered -- I'd love to order right out of Wisconsin, but we don't make televisions anymore. We don't make anything anymore, folks. We don't make things anymore. We're gonna have a time in the not-too-distant future if I win, where Apple and other companies are gonna make their products here. And we're not gonna have a made in China and Vietnam and all these other places. I'm telling you. And that's gonna happen. And that's going to happen. So the story is that they have to -- the press, the media they have to tell the full story. So they come out yesterday, Donald Trump wants to see Japan nuked, meaning nuked, meaning they have the nukes, right? Donald Trump thinks it's fine for Japan to have no Well, I don't like that. But look, we cannot continue to be the policeman of the world. We cannot continue to protect every single country. I know what's probably going to happen, not definitely, I'm prepared to walk. But probably when I say listen, you have to help us out. You have to pay substantially more money because we cannot continue to pay. They will probably say no and I'll probably walk and that meaning I, meaning our country. And they will probably call back and say, let's go or they'll have to defend themselves, folks. They'll have to defend themselves. And that's the way it goes, OK? That's OK. You have to be prepared to walk. Same thing, same thing with South Korea. I mean, you know, look, we are taking -- we have 28,000 people there on the border, soldiers, young beautiful soldiers. I mean, that's a dangerous border and they're not paying much. And every time North Korea acts up. Do you ever see the ship start going, the planes start going and they mobilize it? We're always doing attacks, you know, fake attacks, whatever the hell they call it. We're doing them all over the place. We're working with them. I said, wait a minute, at what point do we stop this? At what point do people either pay us or something or do whatever. We can't let this -- we cannot continue to go on like this. Saudi Arabia. Remember this, Saudi Arabia, they're fine. I have many friends from Saudi Arabia. Saudi Arabia before the oil went down was making $1 billion a day. They have the largest funds in the world. They're loaded with money to the gills. The United States protects them. We get like practically nothing. Why? You know why? Because our leaders don't have business instinct. They don't have political instinct. They have no instincts whatsoever. Now here's what's gonna happen. We'll say to Saudi Arabia, fellows, you've got to help us out. They'll say, no. We'll say, bye bye. About two days later, they'll call us, say, get back here fast. We hear somebody is gonna make a raid. We'll go back. They'll pay us so much money. And you know what? That's fine. OK? That's fine. We've got to change our ways. We've got to do something with -- as an example, with NATO because all of these countries that are getting a free ride, they've got to pay up. Why should we be protecting all these people and all these countries and protecting them from what? We don't even really know. But why should we? Now, one thing, I want them to pay up but I want them to also pay us back for years of delinquency. For years, we've been protecting him. I want the money back. We've got to make our country strong financially again. Now, if we don't do that, we're sitting on top of a very ugly bubble, folks. We're not gonna have the country that you know pretty soon. We are gonna have an explosion of a bubble like you've never seen before. Believe me. If I'm president that won't happen. It won't happen because we'll equalize things. We'll normalize things. We have these trade imbalances that are massive. If you look at our trade imbalance with Japan, they send us millions of cars, cars. You look at those boats, the biggest ships I've ever seen in Los Angeles. They come and cars pour off. It's like a highway. Boom. We send them practically nothing and don't want anything. And when we do, when we send them farm products and things, they send them back and they're perishable. They send them back. They don't want them because their farmers don't want them and we take them. So we send, they send back. You take a look at the balance, the automobiles hundreds of thousands of cars up here. And what we send over? So that's imbalance. China, the same thing. China is a disaster. $500 billion trade deficit. They've taken our jobs. They've closed our factories. Millions of people are now working in jobs that they don't want because you know we have a lot of bad jobs. Even the other side, meaning the Democrats, they say the jobs are bad jobs. They're not good jobs. They're not like great jobs anymore. We have bad jobs. It's called bad jobs. We're gonna change that around. We're gonna bring our companies back and we're not gonna let our companies go so easy. When Carrier air conditioner wants to go to Mexico, we're gonna talk to them. We're gonna say, listen, if you want to go. I think, it's great. You're gonna let all these people go that have helped you build the company for many years. They're great people. I watched -- I looked at that tape and I looked with that -- look like a mid-level management guy who is telling them, we're closing Carrier. We're moving to Mexico and you're all unemployed. And those people were crying and those people were there for years and they do a great job and nobody disputed that. I ordered Carrier air conditioners, many of them. I'm not gonna order many more, by the way. But here's the story. Somebody from our country has to tell them, we are going to be charging you a big tax, like 35%, every time you send an air conditioning unit from Mexico into the United States. And you know what? They're not leaving. And they're not leaving. And folks, they won't be leaving. And the same goes for Ford and the same goes for Nabisco and the same goes for all of these companies that think they're being cute and they think they're being smart. Do you ever notice, do you ever notice that the politicians -- thank you, man. Do you ever notice that the politicians they talk about this and they're trying to stop the countries from moving out. They don't -- well, we might do this and we might do that and let's do that. So you're wasting time, folks. You're wasting time. I'm the only one that understands. They leave. That's fine. They want to come back. They have to pay a tax, OK? That's all. Now you can say, I'm not a free trader and I am a free trader. But our country has run amuck. Our country has been led by people that don't know what they're doing and it's out of control. Millions of jobs have been lost. Thousands of factories have been closed in Wisconsin and everywhere else, everywhere else. You have to see New England, it's like -- I mean, it's incredible what's happened up there. But thousands of factories have been closed and we're not going to let it happen any more. So here's the story. Here's the story. We're gonna be strong on the border, very strong. We're gonna be very, very strong on the border. We're gonna build the wall. Believe me, Mexico is gonna pay for the war. Remember this. You know, one of the politicians on stage said, Donald, come here. There's no way you're gonna get Mexico to pay for the wall. I said, it's easy. I didn't want to really explain because you know these politicians, they copy. The other day, I heard Ted Cruz says, we are gonna build a wall. Where did that come from? Where's he been? And you know, he's never gonna build a wall because the special interests aren't gonna let him build a wall, OK? He's never building a wall. It's all talk with these guys. They're all talk, no action. And he's not building a wall, but it sounded good. He sees the response I'm getting. He said, well, let's stop using it. That's all they do. I mean, that's all they do. So here's what we're gonna do. We're gonna start winning again as a country. We don't win anymore. When was the last time we won? We don't win in trade. We can't beat ISIS with the military. So we're gonna start winning. We're gonna knock the hell out of ISIS. Our military is depleted. Totally depleted. Our military is totally depleted. We're gonna knock the hell out of ISIS and we're gonna build a military bigger and stronger and better than ever before. And it's the cheapest thing we can do, believe me. And hopefully, we'll never have to use it but nobody is gonna mess around with us, folks. OK? Nobody. Nobody. We're gonna take care of our vets because our vets have been absolutely handled so badly. People that come into our country illegally, illegal immigrants are treated better than our vets in many, many cases. And believe me, you can look statistically that's a fact. We are gonna take care of our great vets, OK? We're gonna get rid of Common Core and we're gonna bring education local. We're gonna repeal and replace Obamacare, which does not work. It doesn't work. I don't know if you see and I'm sure most of you do, your premiums are going up 35%, 45%, 55%. Your deductibles are so high you'll never get a chance to use it. Hopefully, you don't want to use it. But you'll never get a chance to use it. It's no good. It doesn't work. We will have alternatives that is so good, that is so much less expensive and that work much better. That work much better. It's like me versus some of these guys. I spent less money and I'm number one. They spend much more money than I do and their way -- forget it. And they're never gonna win. We are going to protect our Second Amendment, which is under siege. We are going to win on trade. We are getting killed with every single country on trade. We are gonna renegotiate our trade deals and we're gonna have the greatest traders. We're gonna make -- We're gonna be back again. We're gonna be back again. We're gonna bring our jobs back. We're gonna make great trade deals. I have the greatest people in the world. I have the greatest business people in the world. Many of whom I know. The ones that I don't know, I'm finding out about. I'll tell you, we have the greatest negotiators and the greatest business people in the world and we don't use them. We use political hacks to negotiate the biggest deals with these massive countries. Those days are over. We're going to make great trade deals and they're not taking our jobs any longer. And we're gonna have a very powerful and very, very strong border. We're gonna have the wall. We're gonna have a strong border. And by the way, people can come into our country but they come in legally. They come in through a process and they come in legally. No more walking across -- in honor of Wisconsin, you know, we talk about cheese. Now, we'll just talk about a certain kind of cheese. What kind of cheese? Swiss cheese big holes in it. Right now, they walk across -- by the way, I'm very honored because not only Sheriff Joe Arpaio, but yesterday, you saw the U.S. border patrol -- these are great people. They never endorsed a presidential candidate before. I didn't even ask for their endorsement. We got a call, 16,500 border patrol, they endorsed Donald Trump for president. That tells you, right? I mean that tells you. So folks, I -- it's such an honor being here. It's cold outside and it's cold for you and you waited. Some of you were waiting three, four hours and some of the folks are still trying to get in. But I'll tell you, I love you all. We're gonna do an amazing job for you. You're gonna look at this afternoon as being -- you'll look back in four years or two years or 20 years and you're gonna say this was one of the most important afternoons you've ever had. More importantly, tomorrow's vote. You will look back and you will say, it was the single greatest vote you've ever cast. That's when our country became great again. We will make America great again. Thank you, Wisconsin. I love you. Go out and vote."}