{"id":415,"author":"Donald Trump","title":"Speech: Donald Trump Delivers a Campaign Speech in Milwaukee, WI","date":"2016-04-04","link":"https://factba.se/transcript/donald-trump-speech-milwaukee-wi-april-4-2016","paragraphs":["This is so great. We did this as a quickie. We wanted to come in to this area. We're staying here tonight. And I know you have a baseball game and you have a big basketball game, we're gonna go really quickly tonight. But we're gonna say one thing, we're gonna make America great again. Remember that. Make America great again because that's what matters.","So I brought somebody very, very special along. I wonder who that could be I wonder. I wonder. And she's an incredible woman. She's an incredible mother. She loves her son, Barron, so much and just really something special. And I have to say she will make an unbelievable first lady. So I'd like to introduce my wife, Melania. Come. Thank you. Thank you.","That's so beautiful baby. Thank you. She said, do you mind, I wrote something. Coming out, I wrote something. Do you mind if I say this? I said, not at all. Should I read it, she says. I don't want you to read it. I don't want you to read it. Thank you very much. So I just I really want to thank -- I want to thank Melania for that, that was very special.","You know, Wisconsin is a really special place. And we've been all over today, speeches all over, we had one before thousands and thousands of people standing outside of an airplane hangar because the hangar was packed. And we had another one in the morning, and it's been an amazing day. And some phenomenal results, you see what's happening with the polls?","Boom. Like a rocket ship. It's like a rocket. I guess, I just heard when I walked in. One just came out, there were 10 points up. But don't worry about that. Don't pretend you didn't hear that. Go out and vote tomorrow, OK? Go out and vote tomorrow. You know, I always tell -- I used to say this the politicians that run that be friends of mine.","I say, pretend you're a little bit behind, OK? That way you work hard. You never you never forget. But you know, there's somebody that was -- I saw just a little while ago in the audience. A very special woman, an incredible woman. And Melania just said hello and met her, was so taken. And she represented you so beautifully and some of you know who she is. Many of you know who she is, but she was Miss Wisconsin.","She has one of the most incredible spirits that I've ever seen. She got a husband and a son, and his son is absolutely magnificent. And she loves him more than anything that you can imagine. And she's going through a very hard time and she has been so supportive and so -- like just incredible of what we're all -- what we're trying to do. Not me. I'm a messenger.","What we're trying to do: make America great again and bring it back and stop letting the world take advantage of us, both militarily. I mean, we don't win anymore. We don't win anymore. We don't win a trade. We don't win with the military. We pay for everybody else's military. We don't know what we're doing.","And she saw it and she was here early. And she knows that we're going to take care of our people and it's gonna be America first. It's got to be America first. We have no choice. We have no choice. And she's with a friend of hers, who's very well-known, Chelsea Cooley, who is a tremendous, tremendous woman and just an amazing person, also a great singer.","But I won't even mention that because Chelsea would be the last to want to have people know that. Chelsea is such a great friend of Melissa Young and Melissa Young, I just want to bring her and Chelsea onto the stage and maybe Melissa would like to say something and Chelsea. But just -- this is just a an unbelievable woman.","So could I ask Melissa to come up on stage, please. Thank you. Thank you everybody. Thank you, sweetheart.","I'll tell you that's an amazing story and just an incredible story, and we're gonna make sure that it goes as well as it can. She was so amazing the way she walked up here and just spoke from the heart. And we all have to speak for the heart and from the heart. And you know there's no teleprompters. We don't have teleprompters.","We want to do it right from here and from here and from here. But I just want to -- I saw Melissa and I said, I have to have you up because her story is an amazing story and it's a story of courage. And we're gonna work with her family and we're gonna make sure everything goes well, OK? Thank you all very much.","So -- and coming over today and in going through a few of them. I said to a few of the folks, I've got to explain what's happening because our country is being decimated by stupidity, by bad deals, by horrible trades, by TPP, which Cruz wants badly and it's gonna destroy Wisconsin. This Trans-Pacific Partnership is a disaster.","Cruz is pushing it hard. Kasich, I don't think he's a key player here. I mean, the guy is 1 in 32. He's won and it was his own state. And if I went and campaign there two more days instead of staying in Florida, I would have one, in my opinion. Ohio, he's 1 in 32. Now in all fairness, Jeb Bush was doing a lot better than that.","They were all -- many people were doing better. It's called you get out. He's taken my votes. We have to get over 50%. And how do you do that? Look, at a certain point in life, what you do is you say, I'm 1 in 32. In other words, I've won 1 out of 32 states. And you do what Marco did which was great, which was a -- and you do what Rand Paul did.","And you do what a lot of them did. And you get out. And by the way, if you want you can put your name up and you can say, I want to run and you go to the convention and you run. But it would be nice to see -- because I'll tell you what. He takes my votes away much more than he does Cruz and I don't like it. I don't think it's right.","I don't think it's appropriate. But you know what, if we have to live with them, we still beat them easily. OK, folks? I mean, OK? But you know, Kasich voted for NAFTA. NAFTA was a disaster for Wisconsin and it was a disaster for our country. Ted Cruz wants TPP and it is going to make NAFTA look like peanuts.","What they're doing to us with those documents. And Cruz is the one that insisted that we can't talk about money manipulation, which is devaluation of currencies in the agreement. He wouldn't let him do it. He's the one that fought currency devaluation. That's the single biggest tool that other countries have for taking our business, taking our money and taking our jobs and we can't let this go on any longer.","Now, they're controlled by their PACs. They're controlled by the people that put up their campaign contributions. They're controlled -- you know, the lobbyists in Washington, they have signs in their forehead. It's like stamped into their forehead. I take care of Cruz, the specialists. I take care of Kasich.","I take care of Hillary. Oh Hillary, ayayayay. Take care of Hillary. So we can't let it happen anymore. We can't let it happen anymore. It's time -- well, you know, Obama used to say time for change. I'll say it's time for change, but real change this time. Not that change. Real change. Obama yesterday -- President Obama yesterday, for the first time, he started having reservations about the Iran deal.","I could have told him that six months ago, nine months ago, long before it was signed. The ink isn't even dry and now he's finally starting to understand it was a big beautiful mistake, and it's only gonna get worse. And by the way, Iran is getting worse. They were supposed to come into the community. Remember?","What a bunch of babies. Are we babies? Are we babies? Hello, over there. They were supposed to come into the community and they were supposed to, you know, get involved. Now, you see they just ordered 118 Airbus jets. Those are the big jets. Airbus jets, 100. They didn't order Boeing. The reason -- one of the reasons is we restrict them from spending.","So we give them a $150 billion and they're not even allowed to give us money by investing, by buying our products, OK? How crazy are we? How much longer is it going to last? When are we gonna get smart? When do we get a stop? We as a country are being ripped off. We are being ripped off by virtually every single country in the world, OK? Whether it's militarily or trade, we don't win anymore.","We can't win with the military. We can't beat ISIS. Can you imagine General MacArthur or General George Patton. They say get rid of ISIS. What do you think? Let's say, it's -- what time is it now? It's so sad to see what's happening to our country, and we're gonna turn it around and we're gonna change it. And we're gonna make it rich again.","We're gonna make it strong again. So -- and so many different elements. And I've been talking about trade. I always talk about trade because when I announced on June 16th, coming down the escalator with Melania. It was like the Academy Awards. There was so many cameras. I've never seen anything like it. So many cameras.","And I took a deep breath and I said, let's go. Because we have to do it. You know, it takes guts. Running for president, believe me, it takes guts. It takes a lot of guts. Believe me. And even for the politicians, they run at least they're out on the line. And then you see the dishonesty. You see where I won Louisiana and then I find out that I'm not supposed to get as many delegates as a person that I beat.","What kind of stuff is that? And somebody said, well, it's a rule and another rule. And I don't care about rules, folks. I go out, I campaign. We win. We win. We get the delegates, right? But, in the meantime, we have millions more votes than Cruz. We've beaten him in most of the states. I mean, we're just winning so much and we're winning by almost 300 delegates.","So we're doing great. And I think, we close it out before the, you know, before the convention. I think we actually close it out before the convention. And that's like a prizefighter. You know, they go into unfriendly territory and the champ and he goes in and they say, what do you think? You may have an unfriendly decision.","He says, no. When you're not come out, there's no unfriendly decisions. If we get the delegates, we've pulled out a knockout. And that's the way it's gonna be. And I think I can see that happening because more and more people are calling. They want to get on board. Frankly, when I looked at -- you know, what happened -- a friend of mine, who's a great, one of my great friends, he lives in right down the road.","I mean, not very far from here. And he said, with Wisconsin, you're gonna win. I said, well, what do you think? But I'm not seeing polls that are great. I'm a little bit down. I'm down in some. I'm a little down. And he says, no no. You're gonna win, but you have to be there. You have to come in. You have to talk to the people like we did this afternoon at the hangar.","And he said, you're gonna win. I mean, you're gonna win. He's a very smart guy. I want to tell you, a great guy. But he said, you've got to come in and we've been making -- I've been making speeches, three today, four yesterday, three or four the other day. We're here constantly. You're gonna get so sick of me. You're gonna say, oh, get him the hell out of here.","No, we're gonna -- but we are, we are making so much progress and it's been so inspiring to see the people. I mean look at even you people, you don't sit down. If you want, you can. Let's stay up. Stand up. What the heck. We don't want to sit. Hey, we've got plenty of time to sit down, right? We've got plenty of time.","But I do appreciate that. That's a sign of affection and it's a sign of respect and I really do appreciate. That's really good. So we have to bring our country back and so many different things. With China, we have a trade deficit of $500 billion a year. With Mexico, we will build a wall. We will have strong borders, strong border.","Believe me. We have a trade deficit of $58 billion a year. The wall is gonna cost $10 billion to build. And people, the politicians are saying, how could you possibly get them to pay? Let me tell you something, folks, when you -- and we have some good business people in this audience. When you have a $58 billion deficit and you have a $10 billion, it's real easy.","And that's on a yearly basis, the 58. It's really easy. And they don't understand it. They said, but how do you get them to pay? I said, it's so easy and you understand. Just rely on me, OK? Rely. So easy. That's so easy. And we're gonna have a strong border. You know, two days ago, I was greatly honored because the Border Patrol, the folks that do a great job, and they're told to stand back, but they don't want to stand back.","They want to do their job properly. They're proud people. They're incredible people. Frankly, before the wall goes up, we might not even need the wall, but we're building it anyway, OK? We're building it. Believe me. But the border the Border Patrol people are unbelievable people, and it's 15,500 people gave me an endorsement two days ago.","And I didn't ask for it. I didn't know. First time, first time, they've ever done it, right? First time they've ever done it and they gave me an endorsement. And it's so important. Now Sheriff Joe from Arizona -- you know, I want Arizona really big and Sheriff Joe was with me and it was incredible and we love it. Now, look we have to have strong borders.","We can't let the Syrians come in that we have no idea who they are, where they're coming from. We don't know if they're Syrians. This could be the all time great Trojan horse. Who knows? I have as big a heart as anybody. We want to help them. We want to build safe zones in Syria. I want to get the Gulf states to pay for it. The Gulf states have nothing but money.","We don't have money. We will run it. We will do a good job. We'll get it done. But let somebody else pay for it for a change. We can't do it now. Now -- OK. So who -- I keep getting these requests you know. Al Green, the great Al Green wrote the snake. How many people have heard the snake? How many people?","Oh do you want to hear the snake? Do you want to hear it? I mean, people love it and I love it because it says what's gonna happen to us if we're not careful. And this really pertains to allowing people into our country that we know are going -- we're gonna have problems. We're gonna have huge problems. Allowing people in from areas of the world.","We don't know where they come from. We don't know where their documents are. They say, they don't have documents. There are no papers. No nothing. We let them in. How stupid can we be? So this is called the Snake. And I think it's pretty good. All right. So we'll give it a shot. You ready for this? A couple of you, a couple of you have heard it, but some of you haven't. On her way to work one morning, down the path along the lake, a tender hearted woman saw a poor half frozen snake.","His pretty colored skin had been all frosted with the dew. Oh well, she cried. I'll take you in and I'll take care of you. Take me in oh tender woman. Take me in for heaven's sake. Take me in oh tender woman, cried the broken snake. She wrapped him up all cozy in a curvature of silk and then laid him by the fireside with some honey and some milk.","Now she hurried home from work that night. As soon as she arrived, she found that pretty snake she'd taken in had been revived. Take me in oh tender woman. Take me in for heaven's sake. Take me in oh tender woman, sighed the broken snake. Now she clutched him to her bosom. You're so beautiful, she cried.","But if I hadn't brought you in by now, heaven's sake you might have died. Now she stroked his pretty skin and then she kissed him and held him tight. But instead of saying thank you that snake gave her a vicious bite. Take me in oh tender woman. Take me in for heaven's sake. Take me in oh tender woman, sighed the very, very healthy snake.","I saved you, cried the woman and you bit me. Heavens why? You know your bite is poisonous and now I'm gonna die. Oh shut up silly woman, said the reptile with a grin. You knew damn well I was a snake before you took me in. Right? That's what's happening to our country, folks. That's what's happening to our country, and we can't let it happen.","We have to be smart. We have to be vigilant. We have to be strong. And if we're not, we're not gonna have a country. And we need borders and we're gonna have borders and we need great trade deals. And we're gonna make great trade deals. And we can't let Mexico and I have great respect for Mexico and I respect their leaders, but we can't let Mexico and China and any country you want to name steal our business, steal our jobs.","When you look at what's happening in Wisconsin and you see it. The reason I beat your governor and I beat him badly was I just read off the statistics. I just read. All I did, I stood up and I read statistics. You're losing jobs. You get -- and Stephen came out before me, he gave you some of the information so I'm not gonna bore you with it. But it's doing -- it's very average, OK? It's very average.","Our country is less than average. Our country is doing so badly. And it's just one of those things. And we have to smarten up. We have to get really tough. We have to get so, so, so vigilant and not be so politically correct. We have to do what's right for our country. When the great Ford Motor Company, great company, when they build a $2.5 billion plant in Mexico, when Nabisco moves its massive plant to Mexico from Chicago, we can't let it happen.","When Carrier air conditioners, you know, they just announced they're moving to Mexico. Pfizer is moving to Ireland. But let me just tell you. So I watch the politicians and they have no business instincts. But more importantly, they're taken care of. You know, a lot of friends come up to me and they say, Donald, let me ask you a question.","These politicians are really -- are they that dumb? I said, no. They're not actually that dumb. Some are but they're not actually that dumb. They're all taken care of by the special interests. And when you want something done, you see certain people in Washington. Hey, who is better than me? I mean, take a look at me. I was -- before June 16th, I was a part of the establishment and they will do not what's right for you, but they will do what's right for the company they represent or the country they represent.","And the United States continues to get ripped off, ripped off, ripped off. And a lot of times they'll say, how could a deal be so stupidly made? These people are so stupid. I say they're not stupid. They're doing it for themselves. They're doing it because they want campaign contributions. They're doing it because they want money put in their PACs.","They are totally controlled by the money. Believe me. They're totally controlled by the money. And that's not good for a country, OK? That's not good because terrible things are happening and we're getting weaker and weaker. Hundreds of thousands and even millions of jobs are being taken out. You look at the jobs we have, even in Wisconsin, I mean you see the jobs, the manufacturing, it's all so down and so gloomy and throughout the United States.","And it's a disaster what's going on with our country. We're not gonna have jobs left. And they do it with manipulation of currency. They do it with guile. They do it with so many different elements that our people don't even know what's happening. Our politicians, in most cases, don't even know what's happening.","And when they do know what's happening and they let it happen, it's even worse. So I'm not taking money from anybody. I'm self funding my campaign. And we're gonna get it, we're gonna get it. Stop. Now, I look at this U.S. manufacturing. I mean just look at this. Look at these charts. I just -- you can see them.","I think you can all see. This is where we're going. You know that's not good, right? This is where we're going. There was one that I just saw. I just got this. It's like incredible. Look at this. This is U.S. manufacturing jobs rapidly decline since year 2000. Look at that chart. Another couple years, there won't be any jobs.","And the jobs we have now are bad jobs. These are bad jobs. These aren't good jobs. And everybody admits that even the other side said, we agree they're bad jobs. And the number that they talk about when they say 5% unemployment is a fictitious number. When you stop looking for a job, you're considered statistically employed.","It's a number that was made up years ago probably by presidents, but certainly by politicians to make them look good, to make them look really good. Like the economy, the economy is not good. The economy is bad. We're sitting on a bubble. The banks have money. They give it to you for nothing if you're rich.","If you're not rich, that's when you need the money. They don't loan it to you. So the people can't do jobs. Probably here you have some great companies, some really good smaller companies. You can't get the banks to give you money. The banks are controlled by the regulators. The system that this country is run under is out of control and we're gonna change it. We're gonna bring back the jobs.","We're gonna bring back our companies. And you know, I've had such a response and the reason I've had that response is because of that and then I look at the ads today. I'm in my hotel and I'm looking at the ads. And Cruz makes up this ad, we're gonna bring back jobs. He's using my same language. Here's the problem.","They don't know where to begin. They don't know where to begin. And if they did -- lying Ted, Lying Ted, lie. He comes up. I -- did you ever see a guy like this? Look what he did with Ben Carson. Ben Carson, who endorsed me, by the way, is a great guy. And lying Ted, lying Ted, remember in Iowa? He said Ben has left the race.","He's left the race. He's in the middle. This was on election day. It's not like two days before or a day after. He's left the race. During the election, he left the race. OK? And people believed him and thousands of votes were cast not for Ben but for Ted Cruz. It's pure -- no, no, it's pure deception. It's lying.","And then there were many other things. And actually during one of the debates, Marco Rubio looked over. He says, you're a liar. And I said, you know, I've never heard a politician call another politician lier. So now I can do it. So we call him lying Ted. L-y-i-n apostrophe. It's crazy. I mean what what he does and what he says is just terrible.","And you know I've met a lot tougher people, but I've never met any human being that lied as much as him. And he comes in -- and you notice the tremendous evangelical support I have? I have Jerry Falwell Jr. from Liberty University. I have all of these people. I have such incredible support and the evangelicals.","He thought he was gonna get the evangelicals but they don't like liars and they see he lies so much. You ever see him? He walks up and he walks in with a Bible, held high, right? Held high and then he starts to lie. Boy, he is bad. So anyway, I don't think that you're gonna fall for that. I really don't think that anybody can fall.","He doesn't talk. He debates. Everything's like, you know, so what. I said, Ted, take it easy. Just talk. Talk. Talk. But we are -- we're doing really well. The whole thing is just working out and I loved being here. You know, I've been here for a long time now. I've been here for -- Thank you. I've been here for a long time.","I'm gonna stay -- we're gonna stay tomorrow. We're gonna have some -- I think I'm doing Fox and Friends tomorrow morning. I'm doing some shows tomorrow. We're gonna do some other shows and we're gonna be around, and we're gonna make sure we want to bring this home. If we can -- you know, we have a movement going on, folks.","And it's a movement of intelligence actually. It's a movement of common sense because that's all it is. We're not gonna let Carrier make air conditioners, fire all its people, move to Mexico, make air conditioners, then come in and take the money out of the country. It's not gonna happen anymore. And I'm a free trader.","And you know, they say he is not -- remember, Jeb Bush? He is not a conservative. Say what? I am a conservative. But you know what? I believe in free trade. But when you have free trade, you need smart people running your side of the free trade. If you don't have smart people or if you have people like Ted Cruz that are totally controlled by the people that give him the money and they're controlled by the establishment.","I mean, look, look at the establishment, this guy in his whole life didn't know what the word establishment meant. Now, you have all these people going because they say, oh man, Trump is terrible. He doesn't want any of our money. I had one friend that came into my office. I don't think I've ever said this before.","He came into my office. He want to give me millions of dollars. I said, I can't take your money. I don't want the money. I'm self funding. No, no, no you've got to be kidding. He didn't even know. He thought I was kidding. He want to endorse me. He want to support me. I said, no, no, I don't want. Anyway, he was finally convinced I didn't want his money and he's leaving.","I said, by the way, what are you gonna with it? He said, I'm gonna give it to another candidate. I said, why? They're gamblers. They have to do it. It's like, it's like almost a disease. They have to do it. It's the craziest thing. He loves me. He wants to give me probably close to $10 million, right? I would have had the greatest super PAC in history if I would have taken all the money.","And my whole life, you know, I've said this before, my whole life as a business person is this, right? It's OK. Nothing wrong with it. I take. I keep taking. I take. I take. But now I'm gonna take for the United States. We're gonna take. We're not gonna be the stupid people anymore. We're not gonna be the stupid people anymore.","We can't be. We can't be. And with NATO, when they don't pay -- you know, I said I was asked a question by Wolf Blitzer, very fair question about NATO. Now you know I've been a businessman, world class. I filed my papers. They were phenomenal. Everybody says great, great, great. I built a great company, very little debt, tremendous cash flow, some of the greatest assets in the world.","And I tell you that only for one reason that's the thinking we need in Washington now. We need some of that thinking. And Wolf Blitzer asked me a question on television. He said, let me just ask you about NATO and he asked me about that. And I haven't been asked about NATO a lot, but I understand NATO and I understand common sense and I'm like a smart person like many of the people in this room.","Hopefully, all of the people in this room. But he asked me about NATO. I said, it's obsolete. It's my first day. And you know, I'm the first one. Guys that study NATO and good people but they study NATO and they say, I don't believe it. What he just said, I never thought of that. They study it because they're so into it that they don't realize.","Because it was really put there, you had the Soviet Union and now you have Russia, which is different. But Russia is very powerful so we can sort of say that's a balance. So we'll leave it. But it doesn't really cover terrorism like it's supposed to. Doesn't have the right countries. I mean many of the countries in there aren't that you associate with terrorism.","And so I said, number one, it's obsolete. I said number two, to the best of my knowledge, the United States pays far too much proportionately. And why are we always paying the bills to protect other people? And the press, which is so totally dishonest, the press goes headlines the next day. Trump doesn't want NATO.","Wants to disband it. And that's not what I said. I said you got to pay your bills. And you know what, if they can't pay their bills, honestly, there should be -- they got to go because we can't do this. You know this isn't 68 years ago. This isn't you know when it was originally formed like many, many years ago.","Many decades ago. And you have to we do things. But it is interesting some of the smartest people have said, what Trump said is genius. It's obsolete. And you know what, it's true. There's a lot of people, a lot of countries being given a free ride. We can't have the free rides anymore, folks. Then we had -- then we -- thank you.","Well, we need somebody with that. We need to -- and it is. It's America First, folks. It's America first. So then then, as you know, North Korea is a big problem. North Korea is a problem. A problem could be solved easily by China but they don't want to solve it because they want to tweak us. They're building in the South China Sea.","There's a massive military fort. You know what's going on. They shouldn't be doing that. And they're taking our money and you know, they -- you talk about the imbalance of trade. You talk about the kind of money. How about this, we owe China $1.7 trillion? Now. They take our money. They take our jobs. And I love them.","They're fine. They're great. I'm not angry at China. I'm angry at our people and our leaders for letting it happen. I don't -- I'm not angry at China. If you can get away with it, you do it. But they take our jobs, they take our money. They take our money. They take everything. We owe them $1.7 trillion.","That's like sort of a magic act. Isn't it amazing? Japan. They send cars by the millions. They come off those boats. Los Angeles. I was there at the docks. I looked at the biggest boats you've ever seen. Biggest greatest ships you've ever seen. The cars are pouring off the ships. We owe them $1.5 trillion.","It's like, why? How does this all happen? OK? How does that happen? Here's the story, folks. We're gonna change our thinking. We're gonna be the smart people again. We're gonna be so smart. We're going to be so sharp. So a lot of people don't know we protect Japan. Do you know that? Does anybody know? You might know from list -- because yes, we protect Japan.","We protect Germany. We protect South Korea. When you want a television set. Who do you get it from? South Korea. Samsung, LG, you get it from South Korea. So we protect all. And the big ships they make. These are monster, monster economies. We protect them. They don't pay what they should be paying for not having to have this massive military apparatus that we supply and you know what?","We get that because we have people that don't know what they're doing in Washington for many years. I mean, I'm not even blaming -- Obama is the worst. He is the worst. The worst. I mean when he just realizes -- I mean, he just realized that the Iran deal is a bad deal. It just took him -- realized. I said, oh why didn't you listen to me two years ago?","Just two years ago. If he would have let -- can you imagine. Did you ever see a deal take so long? By the way, usually when a deal takes that long, it's bad automatically. I can usually tell you that. But anyway. But -- so we protect Japan. So it comes out, they say, what do you think of Japan? I said, look, I would have to tell Japan and I'm talking about other nations also because I have great friends from Japan.","I have great friends from South Korea. We have to go see them, talk to them, have a meeting with them. We love protecting you. We don't want them to arm necessarily. But you know, at some point, how long are we gonna do this? So we have to see him. We have to say, you got to help us out. You know, we have this massive, massive amount of money that we have to get rid of or we're -- because we are sitting on one of the worst bubbles you'll ever see, OK? Believe me. We're gonna straighten it out.","We've got to straighten out our trade deals. We've got to straighten out our military deals. We're taking care of all these countries. So we go to Japan and here's what the new say. I said to the people, I was telling the people and they said, wow, that sounds good. We got to take -- you got to take care of us. Now they'll probably say initially no. And we leave and then they're gonna say yes.","But if they don't say yes, you always have to be prepared to make a great deal to walk. You have to be. You can't say, oh -- the problem with the Iran deal was that Secretary Kerry was like an amateur. He's -- I call him amateur night. He refused to walk. They were laughing at him in the streets of Iran.","They were claiming a deal is the greatest deal ever made before it was even made. They're saying this deal is unbelievable. They were laughing at the secretary of state of this country. They were laughing at the United States saying that this deal is so great. And they're dancing, remember? Burning the flag dancing.","When they start dancing about a deal that I'm making. When they start burning the American flag, I'm out of there. Bye bye. Good luck. And he just kept going back. And I kept waiting. I kept -- I wanted to call him. I wanted to call. I was just gonna say walk. Because every single thing he'd say, we would like to get this.","No. Oh, OK. You've got. We would like to get that. No. You know, the Persians are great negotiators. It's an unbelievable deal. But just yesterday, Obama, just yesterday he brought it up that he's very unhappy. And I mean think of it, think of it, $150 billion. It's the worst deal. We didn't get our prisoners back.","We should had the prisoners back before we started negotiating. Increase the sanctions. Don't sit at the table. Say you give our prisoners back or we're not starting. You leave. They'll say no. You leave. And what happens? You double up the sanctions. Within 24 hours, they call you and they say you've got your prisoners.","That could have been years ago, right? So we have people that don't know what they're doing. Here's the story. You need Trump. You do. You need Trump again. You got to have him. You do. I mean, you got to have Trump. You know, it's sort of interesting because I see when I turn on the television, I see these ads about myself by crooked people.","I see these ads and they're mostly wrong. Some a little bit, sometimes are right. But they're all negative, you know. And I'm looking -- I'm watching this television, ad after ad in Florida. They spent $38 million on negative ads and I won in a landslide. I wonder, does anybody read? Does anybody watch television?","You know, there's not much -- it's not much for the advertising community when you think they spent $38 million, a record number, in Florida. They spent thousands and thousands of ads nationwide. Listen to this one. 55,000 negative ads on me. Most of it was made up. I'll give you one good example. We have the Club for Growth, which is -- forget them.","These are among the dumbest people that you'll ever meet. They come to my office. They want me to give him a million dollars. A friend to ask me. Please, see them. I said, who are they? They're Club for Growth. Whatever that means. So they come to my office. They ask me for a million dollars. I say, no, thank you.","And that's it. They then leave. They write me a letter, which I posted, asking me for a million dollars. I said very nicely. I'm not a bad person. I said nicely, no, thank you. You know, you can be rich but you don't have to be stupid, OK? Why am I gonna give them a million dollars. So what happens is, all of a sudden, I see their name all over the place.","Club for Growth and they talk about you know different things, ridiculous things. I mean, it's the worst ads. And by the way, one is a fraudulent ad because they say if Cruz and Kasich got together and you added their delegates and they show the delegates, right? And you add them up and I'm over here with lot.","And they said, and they add them up and they show a graph that goes much higher than mine. And it's much lower than mine. They're a fraud. And what we did is we told them to stop that ad, and that was a week ago. And we tweeted about it. And everybody is talking about it. And I see it last night again. They are crooked.","So here's what they do. It's like a form of extortion, I guess, right? When you think of it. They come to your office. They ask for a million dollars. You don't give him a million dollars. They go out. They do negative ads. These are the people -- you know, if these people about Trump, they call it like no Trump.","What do they call that thing? They call it, never Trump. Oh you need Trump so badly though. I was saying, if they would work, if they would have worked so hard, so diligently against President Barack Hussein Obama, OK? They would have beaten him and they would have had great budgets. They would have had everything they wanted.","But with him, they failed. I always say, Obama is the worst negotiator I've ever seen. You look at their -- No. Except with the Republicans. He gets everything he wants. I mean you look at the omnibus budget from three months ago. He got everything he wanted, fund Obamacare, bring people into the country that shouldn't be here.","He got everything he wanted. So he is the worst negotiator worldwide. We have Sergeant Bergdahl, right? We get Bergdahl, a traitor. No, no, think of it. This is the same. This is a negotiation. We get Bergdahl and they get -- what do they get? Five of their most coveted killers that have been in jail for eight years and get more -- which we're not closing down, by the way, OK? We're gonna run it a lot.","So we get Bergdahl, a traitor, who five or six, probably six people were killed going out to try and get him back. He left. He's a traitor. So we get Bergdahl and that's what we get and they get five people that are right now back on the battlefield or soon to be back on the battlefield, trying to kill everybody in sight, including us, OK? We've got to stop it. We've got to stop it. So with Japan, I said, they got -- maybe we got to walk.","And the next day headlines, Trump doesn't want to defend Japan. Trump wants Japan to get their nukes. OK, so here's the story folks. You have Japan. Japan is very concerned with North Korea. You know, number one, I like the way it is now. But I want them to pay a lot more money and they probably will. But if they don't, it's not so bad if they are at heads.","Maybe we're not supposed to get into that fight. That's a bad fight. Maybe we're not supposed to, OK? OK? Same thing with South Korea. I mean every time he raises his head and he starts talking, every single time he raises his head. Our ships start floating over, our planes start going over. We do all sorts of exercise.","Why don't we get out of this. We have 28,000 soldiers on the line. So we have to be taken care of. Now, I'm talking as a person financially, OK? I'm also talking militarily, but I'm talking financially. We don't have a country that could do this anymore. Saudi Arabia, until the oil went down, and now they're still making a fortune.","But Saudi Arabia Arabia was making a billion dollars a day. We protect Saudi Arabia. If we weren't there, Saudi Arabia wouldn't be there. If Saudi Arabia didn't have us for years protecting them, they would have been gone long ago. And Saudi Arabia, somebody else would have it, probably maybe Iraq because he would have come back.","And by the way, speaking of that. You know, I was against going into Iraq. Everyone says, oh Trump is gonna be very tough. I was against going into Iraq from the very beginning, from the very beginning. And I'm gonna build our military bigger, stronger than ever before. But you know what, hopefully, we'd never have to use it. Nobody is gonna tell us what to do though.","We have to shape it up because our military is totally depleted. But if our politicians would have gone to the beach for the last number of years, many years, we would be much stronger in a sense. We'd be much stronger because the Middle East is a disaster. You see the Great Migration. It's a catastrophe.","You see what's going on in Germany. It's a total mess. What she has done. Can you imagine. She was person of the year. I was supposed to be Person of the Year on Time Magazine. She beat me out and she destroyed Germany. Can you believe this? That's not good. I wonder if Time Magazine had that one to do over again, what they'd say.","I think we'd be in much better shape. Well, they've treated me nice. I've been on the cover a lot. And the reason we're on the cover a lot is because we have a movement, the likes of which people have never seen. So here's a story. Here's a story. You know, one of the great writers called me up. And he said, what you've done is incredible.","I said, no, no, I have to win. He said, no, no. It makes no difference. If you win, if you lose. It doesn't matter. What you've done is down in the history books. You will be covered for all time. It's incredibly. I said, no, sir. No, sir. I have to win. Because if I don't win, to me, I will consider it a tremendous waste of time and a waste of money, but a tremendous waste of time.","So here is a story, here is a story. We're gonna take care of our Second Amendment. It's being chipped and chipped and -- We're gonna get rid of Common Core. We're gonna bring education back local. We're gonna repeal and replace Obamacare, which is a total catastrophe. You're gonna have great health insurance.","We're gonna save your Social Security and we're gonna save your Medicare. We are going to save it because we're gonna make our country rich again. We're gonna bring back our jobs. We're not gonna let our jobs go. And we're gonna be able to afford it. You've been paying in it for a long time and a lot of these guys wanted to be knocked to hell.","It's not gonna happen, OK? Remember that. It's not gonna happen. We're gonna start winning again, folks. We don't win anymore. We don't win anymore. We don't win with our military. We can't beat ISIS. We're gonna win. We're gonna knock the hell out of ISIS. We're -- we don't win with our vets. Our vets are being treated worse than illegal immigrants.","Our vets are being treated so unfairly. There are our great people and other people. You know, the vets have endorsed me virtually unanimously. And a lot of the vets will come up to me, say, you know, Mr. Trump, we follow closely what's going on. You're the only person that ever mentions the vets, right?","And Hillary Clinton recently said about the vets that they're being taken care of just fine. They're not being taken care of fine. They're not being taken. She said they're being taken care of just fine. I know the vets. Nobody spent more time with the vets that are running and we're gonna take care of our vets, OK? We are going to tear up and make great and very lucrative and everybody's gonna be happy, including the other side, trade deals.","I have the greatest people in the world for dealing. We use political hacks. They don't know what they're doing. They're dealing against the smartest people in China, the smartest people in Japan, the smartest people from all over the world and our negotiators are political hacks and we're not using them anymore.","We're using the greatest business people in the world and we have them in this country, and they're endorsing me. And I know the best ones from the not so great ones and we're gonna have great, great trade deals. We're gonna have a strong border. We're gonna have a real border, OK? We're gonna have a wall.","Mexico is paying for it. We're gonna have a wall. And we're gonna stop bad, bad things from happening in this country. Because if you look at what's going on and you look at the tremendous crime and you look at the drugs that are pouring across the border, it's -- the drugs are pouring like water. They're pouring across.","You know, when I won New Hampshire. It's a special place to me because they were the first victory I had. And I won New Hampshire, I wasn't expected to win it. Jeb was expected to win it. And I won in a landslide. And I'd go around, I'd see the people of New Hampshire and they'd tell me, Mr. Trump, our biggest problem is heroin.","And I say, heroin? It doesn't make sense. You know, you look at the beautiful trees, the woods and the roadways and the lakes. I say, heroin? It just doesn't work. It's incongruous, right? It doesn't work. But it was heroin. And I said, if I get in, we're gonna stop that problem. And I said where does it come from?","They said, it comes from the southern border. They come right in. Now, New Hampshire, would rate it their number one problem. They have a tremendous problem. But many other communities including you, but many other communities have this problem. We're gonna stop it cold, folks. We're gonna stop it cold. The bottom line is this.","Look, we have a big, big day. You're gonna look back on this evening and you're gonna say that was one of the great evenings of your life because we love the country. We love the country. This was one of -- I love you too. Thank you. I really do. I do love the people. I love the people. You know they say that Donald Trump, my base is so -- They say Donald Trump can do almost anything.","In fact, one person today said anything. And they interviewed a woman, I saw it last night on television, sitting in a hotel room, which was not the most beautiful room I've ever been. It was very clean and I only want clean. I don't care about the room. I want clean. But they were sitting there and they said to a woman, a wonderful woman probably 55 years old and her friends were there.","And they said, what would it take to get you to vote for somebody other than Donald Trump? She said don't play that game. There's nothing he can do that would get me to vote against him. And I wanted to go up and I wanted to hug that television set. I wanted -- I wish I could find out who she is, but we have so many people like that.","We're all like that. I mean a big chunk of the country is like that because we're tired of stupidity. We're tired of seeing what's happening to our great country. So here's the deal. You're gonna go home and you're gonna remember this. But much more importantly tomorrow, you get everybody you can. And I promise you you're gonna be so proud of your country.","You're gonna go out and vote. You're gonna be so proud of your president. But forget that, you're gonna be so proud of this country again and you're gonna remember the evening because we're gonna start winning again. We're gonna win on trade. We're gonna win with our military. We're gonna knock out the ISIS.","We're gonna win. We're gonna win with the military. I tell you. We're gonna knock out ISIS. We're gonna knock them out. We're gonna win for our vets because our vets have been treated too badly. It's not gonna happen anymore. We're gonna win at the border. We're gonna win with education. We're gonna win with our Second Amendment.","So many people talk to me about the Second Amendment. We're gonna win at every single element of what we're doing. In every single thing we're gonna win, win, win. And you're gonna say that was the single greatest vote that I have ever cast. And you're gonna look back and you're gonna be proud of yourselves, and you're gonna be proud of your country again.","So thank you very much, everybody. This is a great, great honor. Thank you. Get out and vote. I love you all. Thank you. Thank you very much. Thank you."],"text":" This is so great. We did this as a quickie. We wanted to come in to this area. We're staying here tonight. And I know you have a baseball game and you have a big basketball game, we're gonna go really quickly tonight. But we're gonna say one thing, we're gonna make America great again. Remember that. Make America great again because that's what matters. So I brought somebody very, very special along. I wonder who that could be I wonder. I wonder. And she's an incredible woman. She's an incredible mother. She loves her son, Barron, so much and just really something special. And I have to say she will make an unbelievable first lady. So I'd like to introduce my wife, Melania. Come. Thank you. Thank you. Hello. It is wonderful. Thank you. We love you too. It is wonderful to be here today with you and with my husband. I'm very proud of him. He's a hard worker. He's kind. He has a great heart. He's tough. He's smart. He's a great communicator. He's a great negotiator. He's telling the truth. He's a great leader. He's fair. As you may know by now, when you attack him, he will punch back 10 times harder. No matter who you are, a man or a woman, he treats everyone equal. He is a fighter. And if you elect him to be your president, he will fight for you and for our country. He will work for you and with you. And together, we will make America strong and great again. Thank you. That's so beautiful baby. Thank you. She said, do you mind, I wrote something. Coming out, I wrote something. Do you mind if I say this? I said, not at all. Should I read it, she says. I don't want you to read it. I don't want you to read it. Thank you very much. So I just I really want to thank -- I want to thank Melania for that, that was very special. You know, Wisconsin is a really special place. And we've been all over today, speeches all over, we had one before thousands and thousands of people standing outside of an airplane hangar because the hangar was packed. And we had another one in the morning, and it's been an amazing day. And some phenomenal results, you see what's happening with the polls? Boom. Like a rocket ship. It's like a rocket. I guess, I just heard when I walked in. One just came out, there were 10 points up. But don't worry about that. Don't pretend you didn't hear that. Go out and vote tomorrow, OK? Go out and vote tomorrow. You know, I always tell -- I used to say this the politicians that run that be friends of mine. I say, pretend you're a little bit behind, OK? That way you work hard. You never you never forget. But you know, there's somebody that was -- I saw just a little while ago in the audience. A very special woman, an incredible woman. And Melania just said hello and met her, was so taken. And she represented you so beautifully and some of you know who she is. Many of you know who she is, but she was Miss Wisconsin. She has one of the most incredible spirits that I've ever seen. She got a husband and a son, and his son is absolutely magnificent. And she loves him more than anything that you can imagine. And she's going through a very hard time and she has been so supportive and so -- like just incredible of what we're all -- what we're trying to do. Not me. I'm a messenger. What we're trying to do: make America great again and bring it back and stop letting the world take advantage of us, both militarily. I mean, we don't win anymore. We don't win anymore. We don't win a trade. We don't win with the military. We pay for everybody else's military. We don't know what we're doing. And she saw it and she was here early. And she knows that we're going to take care of our people and it's gonna be America first. It's got to be America first. We have no choice. We have no choice. And she's with a friend of hers, who's very well-known, Chelsea Cooley, who is a tremendous, tremendous woman and just an amazing person, also a great singer. But I won't even mention that because Chelsea would be the last to want to have people know that. Chelsea is such a great friend of Melissa Young and Melissa Young, I just want to bring her and Chelsea onto the stage and maybe Melissa would like to say something and Chelsea. But just -- this is just a an unbelievable woman. So could I ask Melissa to come up on stage, please. Thank you. Thank you everybody. Thank you, sweetheart. Oh, I love you guys, too. Most of all, I love this man. I promise I won't cry this time. I'm a pull it together. This is the greatest man I have ever met. His heart is made of pure gold. He saved me in so many ways and changed my world. Yes. He gave he gave me a lot of gifts in my life. A gift of compassion and showing my son how to pay it forward. But above that, if this man becomes president of the United States of America, he is going to give me the best gift ever. And that is, I know that when I leave this world. I won't be here to watch my son grow. I'll know that he is gonna grow up in a country that is safe, that's what every mother wishes for. Please. My fellow Wisconsinites, please, tomorrow, vote for Mr. Trump. Give yourselves that sense of peace. Give that to your children. This is the greatest men I have ever met, and he is going to make America great again. Thank you all so much. God bless you. I'll tell you that's an amazing story and just an incredible story, and we're gonna make sure that it goes as well as it can. She was so amazing the way she walked up here and just spoke from the heart. And we all have to speak for the heart and from the heart. And you know there's no teleprompters. We don't have teleprompters. We want to do it right from here and from here and from here. But I just want to -- I saw Melissa and I said, I have to have you up because her story is an amazing story and it's a story of courage. And we're gonna work with her family and we're gonna make sure everything goes well, OK? Thank you all very much. So -- and coming over today and in going through a few of them. I said to a few of the folks, I've got to explain what's happening because our country is being decimated by stupidity, by bad deals, by horrible trades, by TPP, which Cruz wants badly and it's gonna destroy Wisconsin. This Trans-Pacific Partnership is a disaster. Cruz is pushing it hard. Kasich, I don't think he's a key player here. I mean, the guy is 1 in 32. He's won and it was his own state. And if I went and campaign there two more days instead of staying in Florida, I would have one, in my opinion. Ohio, he's 1 in 32. Now in all fairness, Jeb Bush was doing a lot better than that. They were all -- many people were doing better. It's called you get out. He's taken my votes. We have to get over 50%. And how do you do that? Look, at a certain point in life, what you do is you say, I'm 1 in 32. In other words, I've won 1 out of 32 states. And you do what Marco did which was great, which was a -- and you do what Rand Paul did. And you do what a lot of them did. And you get out. And by the way, if you want you can put your name up and you can say, I want to run and you go to the convention and you run. But it would be nice to see -- because I'll tell you what. He takes my votes away much more than he does Cruz and I don't like it. I don't think it's right. I don't think it's appropriate. But you know what, if we have to live with them, we still beat them easily. OK, folks? I mean, OK? But you know, Kasich voted for NAFTA. NAFTA was a disaster for Wisconsin and it was a disaster for our country. Ted Cruz wants TPP and it is going to make NAFTA look like peanuts. What they're doing to us with those documents. And Cruz is the one that insisted that we can't talk about money manipulation, which is devaluation of currencies in the agreement. He wouldn't let him do it. He's the one that fought currency devaluation. That's the single biggest tool that other countries have for taking our business, taking our money and taking our jobs and we can't let this go on any longer. Now, they're controlled by their PACs. They're controlled by the people that put up their campaign contributions. They're controlled -- you know, the lobbyists in Washington, they have signs in their forehead. It's like stamped into their forehead. I take care of Cruz, the specialists. I take care of Kasich. I take care of Hillary. Oh Hillary, ayayayay. Take care of Hillary. So we can't let it happen anymore. We can't let it happen anymore. It's time -- well, you know, Obama used to say time for change. I'll say it's time for change, but real change this time. Not that change. Real change. Obama yesterday -- President Obama yesterday, for the first time, he started having reservations about the Iran deal. I could have told him that six months ago, nine months ago, long before it was signed. The ink isn't even dry and now he's finally starting to understand it was a big beautiful mistake, and it's only gonna get worse. And by the way, Iran is getting worse. They were supposed to come into the community. Remember? What a bunch of babies. Are we babies? Are we babies? Hello, over there. They were supposed to come into the community and they were supposed to, you know, get involved. Now, you see they just ordered 118 Airbus jets. Those are the big jets. Airbus jets, 100. They didn't order Boeing. The reason -- one of the reasons is we restrict them from spending. So we give them a $150 billion and they're not even allowed to give us money by investing, by buying our products, OK? How crazy are we? How much longer is it going to last? When are we gonna get smart? When do we get a stop? We as a country are being ripped off. We are being ripped off by virtually every single country in the world, OK? Whether it's militarily or trade, we don't win anymore. We can't win with the military. We can't beat ISIS. Can you imagine General MacArthur or General George Patton. They say get rid of ISIS. What do you think? Let's say, it's -- what time is it now? It's so sad to see what's happening to our country, and we're gonna turn it around and we're gonna change it. And we're gonna make it rich again. We're gonna make it strong again. So -- and so many different elements. And I've been talking about trade. I always talk about trade because when I announced on June 16th, coming down the escalator with Melania. It was like the Academy Awards. There was so many cameras. I've never seen anything like it. So many cameras. And I took a deep breath and I said, let's go. Because we have to do it. You know, it takes guts. Running for president, believe me, it takes guts. It takes a lot of guts. Believe me. And even for the politicians, they run at least they're out on the line. And then you see the dishonesty. You see where I won Louisiana and then I find out that I'm not supposed to get as many delegates as a person that I beat. What kind of stuff is that? And somebody said, well, it's a rule and another rule. And I don't care about rules, folks. I go out, I campaign. We win. We win. We get the delegates, right? But, in the meantime, we have millions more votes than Cruz. We've beaten him in most of the states. I mean, we're just winning so much and we're winning by almost 300 delegates. So we're doing great. And I think, we close it out before the, you know, before the convention. I think we actually close it out before the convention. And that's like a prizefighter. You know, they go into unfriendly territory and the champ and he goes in and they say, what do you think? You may have an unfriendly decision. He says, no. When you're not come out, there's no unfriendly decisions. If we get the delegates, we've pulled out a knockout. And that's the way it's gonna be. And I think I can see that happening because more and more people are calling. They want to get on board. Frankly, when I looked at -- you know, what happened -- a friend of mine, who's a great, one of my great friends, he lives in right down the road. I mean, not very far from here. And he said, with Wisconsin, you're gonna win. I said, well, what do you think? But I'm not seeing polls that are great. I'm a little bit down. I'm down in some. I'm a little down. And he says, no no. You're gonna win, but you have to be there. You have to come in. You have to talk to the people like we did this afternoon at the hangar. And he said, you're gonna win. I mean, you're gonna win. He's a very smart guy. I want to tell you, a great guy. But he said, you've got to come in and we've been making -- I've been making speeches, three today, four yesterday, three or four the other day. We're here constantly. You're gonna get so sick of me. You're gonna say, oh, get him the hell out of here. No, we're gonna -- but we are, we are making so much progress and it's been so inspiring to see the people. I mean look at even you people, you don't sit down. If you want, you can. Let's stay up. Stand up. What the heck. We don't want to sit. Hey, we've got plenty of time to sit down, right? We've got plenty of time. But I do appreciate that. That's a sign of affection and it's a sign of respect and I really do appreciate. That's really good. So we have to bring our country back and so many different things. With China, we have a trade deficit of $500 billion a year. With Mexico, we will build a wall. We will have strong borders, strong border. Believe me. We have a trade deficit of $58 billion a year. The wall is gonna cost $10 billion to build. And people, the politicians are saying, how could you possibly get them to pay? Let me tell you something, folks, when you -- and we have some good business people in this audience. When you have a $58 billion deficit and you have a $10 billion, it's real easy. And that's on a yearly basis, the 58. It's really easy. And they don't understand it. They said, but how do you get them to pay? I said, it's so easy and you understand. Just rely on me, OK? Rely. So easy. That's so easy. And we're gonna have a strong border. You know, two days ago, I was greatly honored because the Border Patrol, the folks that do a great job, and they're told to stand back, but they don't want to stand back. They want to do their job properly. They're proud people. They're incredible people. Frankly, before the wall goes up, we might not even need the wall, but we're building it anyway, OK? We're building it. Believe me. But the border the Border Patrol people are unbelievable people, and it's 15,500 people gave me an endorsement two days ago. And I didn't ask for it. I didn't know. First time, first time, they've ever done it, right? First time they've ever done it and they gave me an endorsement. And it's so important. Now Sheriff Joe from Arizona -- you know, I want Arizona really big and Sheriff Joe was with me and it was incredible and we love it. Now, look we have to have strong borders. We can't let the Syrians come in that we have no idea who they are, where they're coming from. We don't know if they're Syrians. This could be the all time great Trojan horse. Who knows? I have as big a heart as anybody. We want to help them. We want to build safe zones in Syria. I want to get the Gulf states to pay for it. The Gulf states have nothing but money. We don't have money. We will run it. We will do a good job. We'll get it done. But let somebody else pay for it for a change. We can't do it now. Now -- OK. So who -- I keep getting these requests you know. Al Green, the great Al Green wrote the snake. How many people have heard the snake? How many people? Oh do you want to hear the snake? Do you want to hear it? I mean, people love it and I love it because it says what's gonna happen to us if we're not careful. And this really pertains to allowing people into our country that we know are going -- we're gonna have problems. We're gonna have huge problems. Allowing people in from areas of the world. We don't know where they come from. We don't know where their documents are. They say, they don't have documents. There are no papers. No nothing. We let them in. How stupid can we be? So this is called the Snake. And I think it's pretty good. All right. So we'll give it a shot. You ready for this? A couple of you, a couple of you have heard it, but some of you haven't. On her way to work one morning, down the path along the lake, a tender hearted woman saw a poor half frozen snake. His pretty colored skin had been all frosted with the dew. Oh well, she cried. I'll take you in and I'll take care of you. Take me in oh tender woman. Take me in for heaven's sake. Take me in oh tender woman, cried the broken snake. She wrapped him up all cozy in a curvature of silk and then laid him by the fireside with some honey and some milk. Now she hurried home from work that night. As soon as she arrived, she found that pretty snake she'd taken in had been revived. Take me in oh tender woman. Take me in for heaven's sake. Take me in oh tender woman, sighed the broken snake. Now she clutched him to her bosom. You're so beautiful, she cried. But if I hadn't brought you in by now, heaven's sake you might have died. Now she stroked his pretty skin and then she kissed him and held him tight. But instead of saying thank you that snake gave her a vicious bite. Take me in oh tender woman. Take me in for heaven's sake. Take me in oh tender woman, sighed the very, very healthy snake. I saved you, cried the woman and you bit me. Heavens why? You know your bite is poisonous and now I'm gonna die. Oh shut up silly woman, said the reptile with a grin. You knew damn well I was a snake before you took me in. Right? That's what's happening to our country, folks. That's what's happening to our country, and we can't let it happen. We have to be smart. We have to be vigilant. We have to be strong. And if we're not, we're not gonna have a country. And we need borders and we're gonna have borders and we need great trade deals. And we're gonna make great trade deals. And we can't let Mexico and I have great respect for Mexico and I respect their leaders, but we can't let Mexico and China and any country you want to name steal our business, steal our jobs. When you look at what's happening in Wisconsin and you see it. The reason I beat your governor and I beat him badly was I just read off the statistics. I just read. All I did, I stood up and I read statistics. You're losing jobs. You get -- and Stephen came out before me, he gave you some of the information so I'm not gonna bore you with it. But it's doing -- it's very average, OK? It's very average. Our country is less than average. Our country is doing so badly. And it's just one of those things. And we have to smarten up. We have to get really tough. We have to get so, so, so vigilant and not be so politically correct. We have to do what's right for our country. When the great Ford Motor Company, great company, when they build a $2.5 billion plant in Mexico, when Nabisco moves its massive plant to Mexico from Chicago, we can't let it happen. When Carrier air conditioners, you know, they just announced they're moving to Mexico. Pfizer is moving to Ireland. But let me just tell you. So I watch the politicians and they have no business instincts. But more importantly, they're taken care of. You know, a lot of friends come up to me and they say, Donald, let me ask you a question. These politicians are really -- are they that dumb? I said, no. They're not actually that dumb. Some are but they're not actually that dumb. They're all taken care of by the special interests. And when you want something done, you see certain people in Washington. Hey, who is better than me? I mean, take a look at me. I was -- before June 16th, I was a part of the establishment and they will do not what's right for you, but they will do what's right for the company they represent or the country they represent. And the United States continues to get ripped off, ripped off, ripped off. And a lot of times they'll say, how could a deal be so stupidly made? These people are so stupid. I say they're not stupid. They're doing it for themselves. They're doing it because they want campaign contributions. They're doing it because they want money put in their PACs. They are totally controlled by the money. Believe me. They're totally controlled by the money. And that's not good for a country, OK? That's not good because terrible things are happening and we're getting weaker and weaker. Hundreds of thousands and even millions of jobs are being taken out. You look at the jobs we have, even in Wisconsin, I mean you see the jobs, the manufacturing, it's all so down and so gloomy and throughout the United States. And it's a disaster what's going on with our country. We're not gonna have jobs left. And they do it with manipulation of currency. They do it with guile. They do it with so many different elements that our people don't even know what's happening. Our politicians, in most cases, don't even know what's happening. And when they do know what's happening and they let it happen, it's even worse. So I'm not taking money from anybody. I'm self funding my campaign. And we're gonna get it, we're gonna get it. Stop. Now, I look at this U.S. manufacturing. I mean just look at this. Look at these charts. I just -- you can see them. I think you can all see. This is where we're going. You know that's not good, right? This is where we're going. There was one that I just saw. I just got this. It's like incredible. Look at this. This is U.S. manufacturing jobs rapidly decline since year 2000. Look at that chart. Another couple years, there won't be any jobs. And the jobs we have now are bad jobs. These are bad jobs. These aren't good jobs. And everybody admits that even the other side said, we agree they're bad jobs. And the number that they talk about when they say 5% unemployment is a fictitious number. When you stop looking for a job, you're considered statistically employed. It's a number that was made up years ago probably by presidents, but certainly by politicians to make them look good, to make them look really good. Like the economy, the economy is not good. The economy is bad. We're sitting on a bubble. The banks have money. They give it to you for nothing if you're rich. If you're not rich, that's when you need the money. They don't loan it to you. So the people can't do jobs. Probably here you have some great companies, some really good smaller companies. You can't get the banks to give you money. The banks are controlled by the regulators. The system that this country is run under is out of control and we're gonna change it. We're gonna bring back the jobs. We're gonna bring back our companies. And you know, I've had such a response and the reason I've had that response is because of that and then I look at the ads today. I'm in my hotel and I'm looking at the ads. And Cruz makes up this ad, we're gonna bring back jobs. He's using my same language. Here's the problem. They don't know where to begin. They don't know where to begin. And if they did -- lying Ted, Lying Ted, lie. He comes up. I -- did you ever see a guy like this? Look what he did with Ben Carson. Ben Carson, who endorsed me, by the way, is a great guy. And lying Ted, lying Ted, remember in Iowa? He said Ben has left the race. He's left the race. He's in the middle. This was on election day. It's not like two days before or a day after. He's left the race. During the election, he left the race. OK? And people believed him and thousands of votes were cast not for Ben but for Ted Cruz. It's pure -- no, no, it's pure deception. It's lying. And then there were many other things. And actually during one of the debates, Marco Rubio looked over. He says, you're a liar. And I said, you know, I've never heard a politician call another politician lier. So now I can do it. So we call him lying Ted. L-y-i-n apostrophe. It's crazy. I mean what what he does and what he says is just terrible. And you know I've met a lot tougher people, but I've never met any human being that lied as much as him. And he comes in -- and you notice the tremendous evangelical support I have? I have Jerry Falwell Jr. from Liberty University. I have all of these people. I have such incredible support and the evangelicals. He thought he was gonna get the evangelicals but they don't like liars and they see he lies so much. You ever see him? He walks up and he walks in with a Bible, held high, right? Held high and then he starts to lie. Boy, he is bad. So anyway, I don't think that you're gonna fall for that. I really don't think that anybody can fall. He doesn't talk. He debates. Everything's like, you know, so what. I said, Ted, take it easy. Just talk. Talk. Talk. But we are -- we're doing really well. The whole thing is just working out and I loved being here. You know, I've been here for a long time now. I've been here for -- Thank you. I've been here for a long time. I'm gonna stay -- we're gonna stay tomorrow. We're gonna have some -- I think I'm doing Fox and Friends tomorrow morning. I'm doing some shows tomorrow. We're gonna do some other shows and we're gonna be around, and we're gonna make sure we want to bring this home. If we can -- you know, we have a movement going on, folks. And it's a movement of intelligence actually. It's a movement of common sense because that's all it is. We're not gonna let Carrier make air conditioners, fire all its people, move to Mexico, make air conditioners, then come in and take the money out of the country. It's not gonna happen anymore. And I'm a free trader. And you know, they say he is not -- remember, Jeb Bush? He is not a conservative. Say what? I am a conservative. But you know what? I believe in free trade. But when you have free trade, you need smart people running your side of the free trade. If you don't have smart people or if you have people like Ted Cruz that are totally controlled by the people that give him the money and they're controlled by the establishment. I mean, look, look at the establishment, this guy in his whole life didn't know what the word establishment meant. Now, you have all these people going because they say, oh man, Trump is terrible. He doesn't want any of our money. I had one friend that came into my office. I don't think I've ever said this before. He came into my office. He want to give me millions of dollars. I said, I can't take your money. I don't want the money. I'm self funding. No, no, no you've got to be kidding. He didn't even know. He thought I was kidding. He want to endorse me. He want to support me. I said, no, no, I don't want. Anyway, he was finally convinced I didn't want his money and he's leaving. I said, by the way, what are you gonna with it? He said, I'm gonna give it to another candidate. I said, why? They're gamblers. They have to do it. It's like, it's like almost a disease. They have to do it. It's the craziest thing. He loves me. He wants to give me probably close to $10 million, right? I would have had the greatest super PAC in history if I would have taken all the money. And my whole life, you know, I've said this before, my whole life as a business person is this, right? It's OK. Nothing wrong with it. I take. I keep taking. I take. I take. But now I'm gonna take for the United States. We're gonna take. We're not gonna be the stupid people anymore. We're not gonna be the stupid people anymore. We can't be. We can't be. And with NATO, when they don't pay -- you know, I said I was asked a question by Wolf Blitzer, very fair question about NATO. Now you know I've been a businessman, world class. I filed my papers. They were phenomenal. Everybody says great, great, great. I built a great company, very little debt, tremendous cash flow, some of the greatest assets in the world. And I tell you that only for one reason that's the thinking we need in Washington now. We need some of that thinking. And Wolf Blitzer asked me a question on television. He said, let me just ask you about NATO and he asked me about that. And I haven't been asked about NATO a lot, but I understand NATO and I understand common sense and I'm like a smart person like many of the people in this room. Hopefully, all of the people in this room. But he asked me about NATO. I said, it's obsolete. It's my first day. And you know, I'm the first one. Guys that study NATO and good people but they study NATO and they say, I don't believe it. What he just said, I never thought of that. They study it because they're so into it that they don't realize. Because it was really put there, you had the Soviet Union and now you have Russia, which is different. But Russia is very powerful so we can sort of say that's a balance. So we'll leave it. But it doesn't really cover terrorism like it's supposed to. Doesn't have the right countries. I mean many of the countries in there aren't that you associate with terrorism. And so I said, number one, it's obsolete. I said number two, to the best of my knowledge, the United States pays far too much proportionately. And why are we always paying the bills to protect other people? And the press, which is so totally dishonest, the press goes headlines the next day. Trump doesn't want NATO. Wants to disband it. And that's not what I said. I said you got to pay your bills. And you know what, if they can't pay their bills, honestly, there should be -- they got to go because we can't do this. You know this isn't 68 years ago. This isn't you know when it was originally formed like many, many years ago. Many decades ago. And you have to we do things. But it is interesting some of the smartest people have said, what Trump said is genius. It's obsolete. And you know what, it's true. There's a lot of people, a lot of countries being given a free ride. We can't have the free rides anymore, folks. Then we had -- then we -- thank you. Well, we need somebody with that. We need to -- and it is. It's America First, folks. It's America first. So then then, as you know, North Korea is a big problem. North Korea is a problem. A problem could be solved easily by China but they don't want to solve it because they want to tweak us. They're building in the South China Sea. There's a massive military fort. You know what's going on. They shouldn't be doing that. And they're taking our money and you know, they -- you talk about the imbalance of trade. You talk about the kind of money. How about this, we owe China $1.7 trillion? Now. They take our money. They take our jobs. And I love them. They're fine. They're great. I'm not angry at China. I'm angry at our people and our leaders for letting it happen. I don't -- I'm not angry at China. If you can get away with it, you do it. But they take our jobs, they take our money. They take our money. They take everything. We owe them $1.7 trillion. That's like sort of a magic act. Isn't it amazing? Japan. They send cars by the millions. They come off those boats. Los Angeles. I was there at the docks. I looked at the biggest boats you've ever seen. Biggest greatest ships you've ever seen. The cars are pouring off the ships. We owe them $1.5 trillion. It's like, why? How does this all happen? OK? How does that happen? Here's the story, folks. We're gonna change our thinking. We're gonna be the smart people again. We're gonna be so smart. We're going to be so sharp. So a lot of people don't know we protect Japan. Do you know that? Does anybody know? You might know from list -- because yes, we protect Japan. We protect Germany. We protect South Korea. When you want a television set. Who do you get it from? South Korea. Samsung, LG, you get it from South Korea. So we protect all. And the big ships they make. These are monster, monster economies. We protect them. They don't pay what they should be paying for not having to have this massive military apparatus that we supply and you know what? We get that because we have people that don't know what they're doing in Washington for many years. I mean, I'm not even blaming -- Obama is the worst. He is the worst. The worst. I mean when he just realizes -- I mean, he just realized that the Iran deal is a bad deal. It just took him -- realized. I said, oh why didn't you listen to me two years ago? Just two years ago. If he would have let -- can you imagine. Did you ever see a deal take so long? By the way, usually when a deal takes that long, it's bad automatically. I can usually tell you that. But anyway. But -- so we protect Japan. So it comes out, they say, what do you think of Japan? I said, look, I would have to tell Japan and I'm talking about other nations also because I have great friends from Japan. I have great friends from South Korea. We have to go see them, talk to them, have a meeting with them. We love protecting you. We don't want them to arm necessarily. But you know, at some point, how long are we gonna do this? So we have to see him. We have to say, you got to help us out. You know, we have this massive, massive amount of money that we have to get rid of or we're -- because we are sitting on one of the worst bubbles you'll ever see, OK? Believe me. We're gonna straighten it out. We've got to straighten out our trade deals. We've got to straighten out our military deals. We're taking care of all these countries. So we go to Japan and here's what the new say. I said to the people, I was telling the people and they said, wow, that sounds good. We got to take -- you got to take care of us. Now they'll probably say initially no. And we leave and then they're gonna say yes. But if they don't say yes, you always have to be prepared to make a great deal to walk. You have to be. You can't say, oh -- the problem with the Iran deal was that Secretary Kerry was like an amateur. He's -- I call him amateur night. He refused to walk. They were laughing at him in the streets of Iran. They were claiming a deal is the greatest deal ever made before it was even made. They're saying this deal is unbelievable. They were laughing at the secretary of state of this country. They were laughing at the United States saying that this deal is so great. And they're dancing, remember? Burning the flag dancing. When they start dancing about a deal that I'm making. When they start burning the American flag, I'm out of there. Bye bye. Good luck. And he just kept going back. And I kept waiting. I kept -- I wanted to call him. I wanted to call. I was just gonna say walk. Because every single thing he'd say, we would like to get this. No. Oh, OK. You've got. We would like to get that. No. You know, the Persians are great negotiators. It's an unbelievable deal. But just yesterday, Obama, just yesterday he brought it up that he's very unhappy. And I mean think of it, think of it, $150 billion. It's the worst deal. We didn't get our prisoners back. We should had the prisoners back before we started negotiating. Increase the sanctions. Don't sit at the table. Say you give our prisoners back or we're not starting. You leave. They'll say no. You leave. And what happens? You double up the sanctions. Within 24 hours, they call you and they say you've got your prisoners. That could have been years ago, right? So we have people that don't know what they're doing. Here's the story. You need Trump. You do. You need Trump again. You got to have him. You do. I mean, you got to have Trump. You know, it's sort of interesting because I see when I turn on the television, I see these ads about myself by crooked people. I see these ads and they're mostly wrong. Some a little bit, sometimes are right. But they're all negative, you know. And I'm looking -- I'm watching this television, ad after ad in Florida. They spent $38 million on negative ads and I won in a landslide. I wonder, does anybody read? Does anybody watch television? You know, there's not much -- it's not much for the advertising community when you think they spent $38 million, a record number, in Florida. They spent thousands and thousands of ads nationwide. Listen to this one. 55,000 negative ads on me. Most of it was made up. I'll give you one good example. We have the Club for Growth, which is -- forget them. These are among the dumbest people that you'll ever meet. They come to my office. They want me to give him a million dollars. A friend to ask me. Please, see them. I said, who are they? They're Club for Growth. Whatever that means. So they come to my office. They ask me for a million dollars. I say, no, thank you. And that's it. They then leave. They write me a letter, which I posted, asking me for a million dollars. I said very nicely. I'm not a bad person. I said nicely, no, thank you. You know, you can be rich but you don't have to be stupid, OK? Why am I gonna give them a million dollars. So what happens is, all of a sudden, I see their name all over the place. Club for Growth and they talk about you know different things, ridiculous things. I mean, it's the worst ads. And by the way, one is a fraudulent ad because they say if Cruz and Kasich got together and you added their delegates and they show the delegates, right? And you add them up and I'm over here with lot. And they said, and they add them up and they show a graph that goes much higher than mine. And it's much lower than mine. They're a fraud. And what we did is we told them to stop that ad, and that was a week ago. And we tweeted about it. And everybody is talking about it. And I see it last night again. They are crooked. So here's what they do. It's like a form of extortion, I guess, right? When you think of it. They come to your office. They ask for a million dollars. You don't give him a million dollars. They go out. They do negative ads. These are the people -- you know, if these people about Trump, they call it like no Trump. What do they call that thing? They call it, never Trump. Oh you need Trump so badly though. I was saying, if they would work, if they would have worked so hard, so diligently against President Barack Hussein Obama, OK? They would have beaten him and they would have had great budgets. They would have had everything they wanted. But with him, they failed. I always say, Obama is the worst negotiator I've ever seen. You look at their -- No. Except with the Republicans. He gets everything he wants. I mean you look at the omnibus budget from three months ago. He got everything he wanted, fund Obamacare, bring people into the country that shouldn't be here. He got everything he wanted. So he is the worst negotiator worldwide. We have Sergeant Bergdahl, right? We get Bergdahl, a traitor. No, no, think of it. This is the same. This is a negotiation. We get Bergdahl and they get -- what do they get? Five of their most coveted killers that have been in jail for eight years and get more -- which we're not closing down, by the way, OK? We're gonna run it a lot. So we get Bergdahl, a traitor, who five or six, probably six people were killed going out to try and get him back. He left. He's a traitor. So we get Bergdahl and that's what we get and they get five people that are right now back on the battlefield or soon to be back on the battlefield, trying to kill everybody in sight, including us, OK? We've got to stop it. We've got to stop it. So with Japan, I said, they got -- maybe we got to walk. And the next day headlines, Trump doesn't want to defend Japan. Trump wants Japan to get their nukes. OK, so here's the story folks. You have Japan. Japan is very concerned with North Korea. You know, number one, I like the way it is now. But I want them to pay a lot more money and they probably will. But if they don't, it's not so bad if they are at heads. Maybe we're not supposed to get into that fight. That's a bad fight. Maybe we're not supposed to, OK? OK? Same thing with South Korea. I mean every time he raises his head and he starts talking, every single time he raises his head. Our ships start floating over, our planes start going over. We do all sorts of exercise. Why don't we get out of this. We have 28,000 soldiers on the line. So we have to be taken care of. Now, I'm talking as a person financially, OK? I'm also talking militarily, but I'm talking financially. We don't have a country that could do this anymore. Saudi Arabia, until the oil went down, and now they're still making a fortune. But Saudi Arabia Arabia was making a billion dollars a day. We protect Saudi Arabia. If we weren't there, Saudi Arabia wouldn't be there. If Saudi Arabia didn't have us for years protecting them, they would have been gone long ago. And Saudi Arabia, somebody else would have it, probably maybe Iraq because he would have come back. And by the way, speaking of that. You know, I was against going into Iraq. Everyone says, oh Trump is gonna be very tough. I was against going into Iraq from the very beginning, from the very beginning. And I'm gonna build our military bigger, stronger than ever before. But you know what, hopefully, we'd never have to use it. Nobody is gonna tell us what to do though. We have to shape it up because our military is totally depleted. But if our politicians would have gone to the beach for the last number of years, many years, we would be much stronger in a sense. We'd be much stronger because the Middle East is a disaster. You see the Great Migration. It's a catastrophe. You see what's going on in Germany. It's a total mess. What she has done. Can you imagine. She was person of the year. I was supposed to be Person of the Year on Time Magazine. She beat me out and she destroyed Germany. Can you believe this? That's not good. I wonder if Time Magazine had that one to do over again, what they'd say. I think we'd be in much better shape. Well, they've treated me nice. I've been on the cover a lot. And the reason we're on the cover a lot is because we have a movement, the likes of which people have never seen. So here's a story. Here's a story. You know, one of the great writers called me up. And he said, what you've done is incredible. I said, no, no, I have to win. He said, no, no. It makes no difference. If you win, if you lose. It doesn't matter. What you've done is down in the history books. You will be covered for all time. It's incredibly. I said, no, sir. No, sir. I have to win. Because if I don't win, to me, I will consider it a tremendous waste of time and a waste of money, but a tremendous waste of time. So here is a story, here is a story. We're gonna take care of our Second Amendment. It's being chipped and chipped and -- We're gonna get rid of Common Core. We're gonna bring education back local. We're gonna repeal and replace Obamacare, which is a total catastrophe. You're gonna have great health insurance. We're gonna save your Social Security and we're gonna save your Medicare. We are going to save it because we're gonna make our country rich again. We're gonna bring back our jobs. We're not gonna let our jobs go. And we're gonna be able to afford it. You've been paying in it for a long time and a lot of these guys wanted to be knocked to hell. It's not gonna happen, OK? Remember that. It's not gonna happen. We're gonna start winning again, folks. We don't win anymore. We don't win anymore. We don't win with our military. We can't beat ISIS. We're gonna win. We're gonna knock the hell out of ISIS. We're -- we don't win with our vets. Our vets are being treated worse than illegal immigrants. Our vets are being treated so unfairly. There are our great people and other people. You know, the vets have endorsed me virtually unanimously. And a lot of the vets will come up to me, say, you know, Mr. Trump, we follow closely what's going on. You're the only person that ever mentions the vets, right? And Hillary Clinton recently said about the vets that they're being taken care of just fine. They're not being taken care of fine. They're not being taken. She said they're being taken care of just fine. I know the vets. Nobody spent more time with the vets that are running and we're gonna take care of our vets, OK? We are going to tear up and make great and very lucrative and everybody's gonna be happy, including the other side, trade deals. I have the greatest people in the world for dealing. We use political hacks. They don't know what they're doing. They're dealing against the smartest people in China, the smartest people in Japan, the smartest people from all over the world and our negotiators are political hacks and we're not using them anymore. We're using the greatest business people in the world and we have them in this country, and they're endorsing me. And I know the best ones from the not so great ones and we're gonna have great, great trade deals. We're gonna have a strong border. We're gonna have a real border, OK? We're gonna have a wall. Mexico is paying for it. We're gonna have a wall. And we're gonna stop bad, bad things from happening in this country. Because if you look at what's going on and you look at the tremendous crime and you look at the drugs that are pouring across the border, it's -- the drugs are pouring like water. They're pouring across. You know, when I won New Hampshire. It's a special place to me because they were the first victory I had. And I won New Hampshire, I wasn't expected to win it. Jeb was expected to win it. And I won in a landslide. And I'd go around, I'd see the people of New Hampshire and they'd tell me, Mr. Trump, our biggest problem is heroin. And I say, heroin? It doesn't make sense. You know, you look at the beautiful trees, the woods and the roadways and the lakes. I say, heroin? It just doesn't work. It's incongruous, right? It doesn't work. But it was heroin. And I said, if I get in, we're gonna stop that problem. And I said where does it come from? They said, it comes from the southern border. They come right in. Now, New Hampshire, would rate it their number one problem. They have a tremendous problem. But many other communities including you, but many other communities have this problem. We're gonna stop it cold, folks. We're gonna stop it cold. The bottom line is this. Look, we have a big, big day. You're gonna look back on this evening and you're gonna say that was one of the great evenings of your life because we love the country. We love the country. This was one of -- I love you too. Thank you. I really do. I do love the people. I love the people. You know they say that Donald Trump, my base is so -- They say Donald Trump can do almost anything. In fact, one person today said anything. And they interviewed a woman, I saw it last night on television, sitting in a hotel room, which was not the most beautiful room I've ever been. It was very clean and I only want clean. I don't care about the room. I want clean. But they were sitting there and they said to a woman, a wonderful woman probably 55 years old and her friends were there. And they said, what would it take to get you to vote for somebody other than Donald Trump? She said don't play that game. There's nothing he can do that would get me to vote against him. And I wanted to go up and I wanted to hug that television set. I wanted -- I wish I could find out who she is, but we have so many people like that. We're all like that. I mean a big chunk of the country is like that because we're tired of stupidity. We're tired of seeing what's happening to our great country. So here's the deal. You're gonna go home and you're gonna remember this. But much more importantly tomorrow, you get everybody you can. And I promise you you're gonna be so proud of your country. You're gonna go out and vote. You're gonna be so proud of your president. But forget that, you're gonna be so proud of this country again and you're gonna remember the evening because we're gonna start winning again. We're gonna win on trade. We're gonna win with our military. We're gonna knock out the ISIS. We're gonna win. We're gonna win with the military. I tell you. We're gonna knock out ISIS. We're gonna knock them out. We're gonna win for our vets because our vets have been treated too badly. It's not gonna happen anymore. We're gonna win at the border. We're gonna win with education. We're gonna win with our Second Amendment. So many people talk to me about the Second Amendment. We're gonna win at every single element of what we're doing. In every single thing we're gonna win, win, win. And you're gonna say that was the single greatest vote that I have ever cast. And you're gonna look back and you're gonna be proud of yourselves, and you're gonna be proud of your country again. So thank you very much, everybody. This is a great, great honor. Thank you. Get out and vote. I love you all. Thank you. Thank you very much. Thank you."}