{"id":416,"author":"Donald Trump","title":"Speech: Donald Trump in Eau Claire, WI","date":"2016-04-02","link":"https://factba.se/transcript/donald-trump-speech-eau-claire-wi-april-2-2016","paragraphs":["Oh, we're going to have fun. We're going to have a lot of fun. We're going to have a lot of fun. Thank you, everybody. You know we have thousands of people outside. I feel guilt. Oh, that's so nice. So nice. Yay. Yay. They're outside you're inside. So beautiful. They're outside freezing. But we have thousands and I just want to say it's amazing.","I tell you something's going on in Wisconsin. I think we're going to have a very good day on Tuesday. We're going to have a very, very good day. We're going to have -- we had big crowds we've done. This is the third one. We've been packed at every place. On Monday, actually, we're going to have, I guess, 20,000 at one and 66,000 or 7,000 at another.","And we would have had 7,000 or 8,000 here or 10,000 if we could have found a bigger place. I don't know. Is there a bigger place around? Let's go find one, right? Well, I want to thank you all for being here. You know it's all about making America great again, right? Make America Great Again. Our country is suffering.","We're suffering. We see what's going on and you know I look at numbers, and I must tell you, Scott Walker has been a nice guy and I've been nice to him. I gave game like about 50,000 or 100,000 in his campaign. He gave me a plaque a little more than a year ago. No, he gave me a plaque. I wish I had the money back, right?","Give me the money back, Scott. But he didn't like the way I treated him. He ran for President. I ran for President. I won. So, therefore, you want to have Trump, right? I mean, we want to have Trump. And you know the reason I won, to be honest, he was very nice to me. He was very nice to me. Then he had a fundraiser.","Hence, his fundraising person made a mistake. He said very nasty things about me. Come on. We're going to have a fundraiser for Scott and he said some really nasty things like -- so, I called Scott because I always like to sort of watch to see what happens. And then, I call and say, I'm sorry, Scott. That wasn't nice what you're guy did.","And I started talking about the problems that they have in Wisconsin. Now you know, I have a lot of friends in Wisconsin. It's an amazing place and a great place. But they have difficulties. I just wrote down 20% of the manufacturing jobs have left since the year 2000. People don't know this stuff. And you know when Scott came out he was in first place and after I went after him he left.","That was the other Scott. That's the way it should be. Don't you want that for your President? I mean, you know -- now the Journal Sentinel. I don't know if you like it or don't like it but Wisconsin is chronic -- it chronically lags the rest of the United States in job creation. So in job creation, Wisconsin lags.","Also, Journal Sentinel, let's say he keeps wages depressed because of other jobs, they're depressed at wages. Also a lot of the work and a lot of the jobs they pay a very small amount and a lot are in the healthcare industry which really is not a lot of high-end jobs. Because we're losing our jobs to Japan to China to Mexico.","You know all about it. We're losing our jobs, our good, jobs we're losing to other places. Sort of interesting, I'm a big buyer of things and I buy Wausau Window, it's not so far from here. But Wausau Window they do a great job. They charged me a lot of money for their windows but that's OK, in the meantime, they don't leak.","I put -- I bought I guess close to 4,000 maybe even more than that, 4,000 windows for 40 Wall Street which is a 72-story building and it's actually one of the tallest buildings in downtown Manhattan right on Wall Street. Great location. Great building, 100% occupied and I bought Wausau Windows, OK? And boy, do I buy Kohl -- I buy Kohler products, OK? Kohler, Herb Kohler is a friend of mine, so, we buy a lot of Kohler products so you know.","So, it's good stuff. So we keep a lot of money in the state. I don't feel guilty at all. And I've been here now for -- wow, we've done three today. We're going to do three tomorrow. We're going to be here Monday. I'm staying on Tuesday. If I -- if I feel I'm going to lose I'll be out of here. I'll go like this.","And I'm -- If I feel I'm going to win, we'll all get together. We'll celebrate together on Tuesday morning, all right? In Wisconsin, household income has declined since the year 2000. Its not good. It's not good. Look, the bottom line it's like the country and you're in the middle of the pack for the states around the area, you're in the middle.","So when Scott, you know, goes out and endorses Cruz, I understand that. Cruz will never bring you to greatness. Let me tell you. He's a politician. He has money coming in through all sorts of different people that he thinks, you know, like on his financial disclosure form he didn't disclose that he had $1 million in loans from Citibank and from Goldman Sachs.","He isn't disclosing. He forgot to put it on. He said he forgot. Lying Ted, lying Ted, lying Ted. What does he hold up high before he lies? the Bible. He holds the Bible high. He puts the Bible down and then he lies, lying ted. No, he's a liar.","I tell you. I've met a lot tougher than Ted but I've never met one that would lie as much. Not a good liar though he always gets caught. You know a good liar doesn't get caught. What he did, as an example, to Ben Carson. I think that was terrible, in Iowa. Ben endorsed me. Great guy and Ben is, you know, in Iowa, and Ted said, he has left the race.","He said this on election day, folks. You know I mean, they're voting and he let everybody know and it's a caucus. So it's not what you just what -- they walk in. They sat down they explained that he left the race and thousands of votes were taken away from Ben Carson by lying. And then Cruz called up later and apologized, excuse me, about 10 minutes after the election ended.","That somehow doesn't help, right? It doesn't help. So look, this is what we have. These politicians are never going to take us to the promised land. And certainly, Cruz is and he doesn't get along with anybody. Nobody likes him. I mean, think of it, the set -- the Senator that he most respects in the world is Jeff Sessions, a great, great guy from Alabama, right?","Senator Jeff Sessions. And in the first part of the race he kept talking about Jeff Sessions, Senator Sessions, and then, Senator Sessions endorsed me, and he said, and you know, look, he knows because he understands we have right now $19 trillion in debt going up to $21 trillion because of the crazy omnibus plan that was just passed.","The budget that was just passed which is one of the worst budgets I've ever seen. And it went so fast. Three months ago they passed the omnibus. Does everyone know what I'm talking about? One of the worst. It funds illegal immigration. It funds ISIS coming in or whoever comes in because we don't even know who is coming in. We have people coming in from Syria on the migration, thousands and thousands of people.","We have no idea who they are, where they come from, there's no documentation. We have to be crazy. No, no, I will tell you. They're going home. If I become President, we have to, we have to, we have no choice. Where are these people coming from? I mean, you know, where are our leaders coming from? What are we doing?","We have no documentation and you see what's going on in Germany. You see what's going on in Sweden, a small part of Sweden where they took a lot of people in. It's like a disaster. You see what's going on in Brussels. Brussels 25 years ago was incredible. I made a statement about Brussels recently and it was very harsh.","I said it's like living in a hellhole. Because I have a lot of friends who go to Brussels. It's a financial capital. And they tell me what's going on. I've been there years ago and it was beautiful, one of the most beautiful cities in the world actually. And a friend of mine came back, and he said, another friend said, oh, it's like an armed camp.","And this is because people came in, and frankly, those people weren't vetted and they're -- it was it's a disaster. So I made this statement and New York Times did a major story, how dare Donald Trump criticize a place like he did Brussels. And it was like that, you know, he's excoriated. Then two months later, which was a week ago, they had the horrible problem in Brussels.","And now, Brussels, they realize they have no control over the place whatsoever. And we can't be the stupid people. We can't be. We just can't be. We can't be and we're not going to be. You know speaking of that, I have, I mean, we'll get off -- and really, I want to talk about trade. I want to talk about keeping our jobs here and I want to talk about bringing jobs here, OK? So that we can fill up lots of different places like this.","I'm telling you. I want to talk about that because that's really -- but speaking of illegal immigration and Syria or wherever these people are coming from, and you know what, I have a big heart. I have as big a heart as anybody. A big, big heart. And we should build, we should build in Syria safe zones. We should do it and we'll get the Gulf states to put up the money.","I don't want to put up money anymore. We're putting up enough money. We don't have any money. This country has no money and we'll talk about that in a minute. But I thought I'd tell you this. This was written by a fantastic guy and a rock and roller actually who did something. And it talks about illegal immigration and just think about this.","We don't know who's coming in. We don't know anything about -- we know something bad is going to happen, OK? Something bad is going to happen. This is like you know the story of the Trojan horse, right? This could be the ultimate Trojan horse and don't forget, we have thousands and thousands of people on -- did you ever know the migration line, did you ever see it? They have a lot of young people, young, strong men.","I said where are the women? Where are the children? There are some but there aren't very many. And I mean, seriously, I -- maybe it's not but this could be the Trojan Horse. So I thought I'd say this to you. I don't do it often but it's a sort of thing that was written years ago and it's very -- it's called the Snake.","Do you like it? So who's heard the snake before? Does anybody want to hear it one more time, huh? Because people love it. You know great art it's interesting. A friend of mine's a great, great art collector and if you look at the Mona Lisa, right? The Mona Lisa, one of the great paintings.","You don't like it that much at the beginning. You really don't and then you look at it again. I like it a little bit more again and agin. And by the time they reach a certain age, it's like captivating. It's -- the people are just crazed. They can't look at anything else, right? That's called great art. With other paintings, you say, oh, I love it, I love it, I love it and then two weeks later, you don't like it anymore.","There is something very special about greats. So this is very descriptive and people like it and it's a little bit tough but it's very true. And think of this with allowing people in. We know it's going to be a problem. We know it's going to be a problem. It's going to be a big problem. You're going to have things happening.","Look what happened to the two radicalized people in California recently where the 14 people that they killed. Their co-workers, they killed their co-workers out of nowhere, their co-workers gave them a baby shower, and they had a party for them and they went in and they kill 14 of them and others badly wounded.","You look at Paris where 130 people killed and tremendous numbers of people in the hospital. They'll be in hospitals for the rest of their lives and many will die. What are we doing, folks? What are we doing? So this is called The Snake, on her way to work one morning down the path along the lake, a tender-hearted woman saw a poor half-frozen snake.","His pretty colored skin had been all frosted with the dew. Oh, well, she cried, I'll take you in and I'll take care of you. Take me in, oh, tender woman. Take me in for heaven's sake. Take me in, oh, tender woman, sighed the broken snake. She wrapped him up all cozy in a curvature of silk and then laid him by the fireside with honey and some milk.","Now, she hurried home from work that night as soon as she arrived, she found that pretty snake. She'd taken, had been revived. Take me in, oh, tender woman. Take me in for heaven's sake. Take me in, oh, tender woman, sighed the broken snake. She then clutched him to her bosom. You're so beautiful she cried but if I hadn't brought you in by now, oh heavens, oh heavens, you definitely, you just definitely would have died.","Now she stroked his pretty skin and then she kissed him and held him tight. But instead of saying thank you. That's they gave her a vicious bite. Take me in, oh, tender woman. Take me in for heaven's sake. Take me in, oh, tender woman, sighed the vicious snake. I saved you, cried the woman, and you've bit me, heavens why?","You know your bite is poisonous and now I'm going to die. Oh, shut up silly woman, said the reptile with a grin. You knew damn well I was a snake before you took me in. Right? Right? No, I don't think so. You think Kasich does that? I don't think so. I don't think so. You think Ted Cruz does that? I don't think so. No, I don't think so. So, I just -- look, look, we have so many -- it's such a downer.","You have seats and yet you're standing. That's excitement, right? Look at this guy. I won't tell you. I won't tell you. You know it's interesting. The last time, a couple of days ago, I gave -- I love you too, darling. Who said that? Some -- awww so beautiful. Thank you, honey. I love you too.","That's why I'm doing this to protect people like you. Ivanka just had a beautiful grand -- you know, a grandson from me. And that's why I'm doing it. People say, actually, I was on a great radio show this morning, and he said to me, we had a great talk and then he said, Mr. Trump, can I ask you one more question?","Why are you doing this? You've built up a $10 billion net worth. You have a great company. You have a great family. And here you are on Saturday morning at 6:30 in the morning talking to a radio show. Why are you doing this? I actually said, good question, right. But I said you know what? My whole theme is Make America Great Again.","True. Make America Great Again. We're going to make our country so great again. We're going to make it so strong again. I've gotten to see so many people. I mean, like today, thousands at least 5,000 people are outside. I feel terribly about it and we'll come back but at least 5,000 people outside. The last time it was worse.","We had 7,000 or 8,000 people that were in this hall that was like a secondary hall and we had, you know, loudspeakers and stuff but there's something going on. There's like a movement. It's been on Time Magazine four times now over the period of -- a short period of time. And it's a movement. What's going on is a movement.","I'll tell you Wisconsin is very important because I think we're going to win before we get to the convention. But if we get to the convention, if we get to the convention, the Establishment politicians who want to protect their jobs, who want to protect their paychecks, who want to protect all of the different things, like the lobbyists, and the special interests, they don't like me. Now, I used to be a part of the Establishment.","I was at the highest level. I gave lots of money, #350,000 to the Republican Governors Association. I gave a tremendous amount of money. I was Establishment. I was like the King of the Establishment in a certain way. And then I ran and I wasn't the establish -- you know, somebody said you know, Trump, I don't think he wants our money.","And then I announced some self-funding. You know, I'm totally self-funding. So, I'm not -- I'm not asking. And you know, coming over here I said to -- actually, this morning when we were in the car. I said, you know, I don't think that I'm getting any credit for self-funding, OK? I'm not getting credit for turning down tens of millions of dollars.","Bush had $148 million that he raised which is very impressive. Unfortunately, he couldn't get anybody to vote for him. That's the problem. That's, that's a big problem. It says -- who said that? See? I won't repeat that. You know, I just get my -- I just get myself in trouble. But you know, it's very funny actually.","It's called branding, right? Branding. Forever branded. But Bush, Bush had $148 million, and you know, like in New Hampshire he's spent like tens of millions of dollars. I spend very little I came in first. Then in South Carolina, other guys spent tens of millions, just so much more money. We came in first.","And -- but you know, I'm self-funding and I don't know that I get the credit for it. I don't know. When you go and you say, well, Cruz is OK. He's not by the way but let me tell you. No, he is not. He's not, OK? He would do such a terrible job. You know, here's a guy who filibusters in the Senate. Now, you know, say what you want about these Senators.","These guys have been there a long time. They're professionals. They're not, you know, stupid people. And he stands up and he filibusters and he reads poems and he reads everything else and he's filibustering a -- what good -- a day and a half. He's never done anything. He never gets anything approved. Then he says, Donald Trump will negotiate.","He will only go -- of course, you've got to. That's the way it was -- our founders sort of had in mind. You got to negotiate but I'll negotiate well. I'm not going to be -- you know Cruz thinks he's going to take this hardline position and everybody's going to eventually come. It doesn't work that way, folks.","It doesn't work. So he stood up for what a day and a half? And he filibustered and he left and these Senators are sitting back and they're saying, when's he going to leave? Let's see, OK. He's still talking, right? He's still talking. OK, and then they, you know, that's, that's the way it works. Look, you're not dealing with babies.","So what happens is he never did anything. He never accomplish anything. Hasn't done anything. And folks, he's in favor of Trans-Pacific Partnership which is a disaster. And worse than being in favor, and he really pushed it, but worse than being in favor, the single greatest weapon used against you and everybody.","I mean, used against our country is currency devaluation and currency manipulation. That's the big weapon. And when I started talking about it a year and a half ago, when it was conceived. As -- you got to talk about currency manipulation because if you look at China, what they do is they devalue their currency and they kill us. You look at other countries like Japan and others, they devalue their currency and they absolutely kill us. So you have to go out and you have to look at currency manipulation.","And if you're not going to put that in -- Well, Cruz would not hear of currency manipulation. Now somebody told them you can't do it. One of his people that give him a lot of money. They said you can't do it. Why would he not allow currency manipulation? In other words, having clauses that you can't do that.","In other words, it's a violation, right, or to default? It's no good. So Cruz, not only is he pushing it which is terrible, but he won't allow the single biggest thing a block on the single biggest problem that we have which is currency devaluations and currency manipulation. Now, you tell me that's going to be good for you?","He's going to be a disaster, OK? I don't care. Somebody said, oh, you shouldn't say such bad things about his Republican. Give me a break, OK. I'm here. Hey, if it works. Great. If it doesn't work. Great. I'm going to either do a great job or I'll be waving hello. I'll be coming to Wisconsin to see my friends.","I don't care. But look, they asked me, they said why, why are you doing it? So many people, even my family they say dad why do you want to do this? I want to do it because this country has given me so much and I hate watching what I'm watching on television. I hate seeing President Obama -- True, true. I hate seeing President Obama, today, seeing saying that Iran has violated our agreement.","I mean, what did he think? He's now complaining about Iran violating the agreement. What the hell did he think? He's like a baby. He's like a baby. No, can you imagine? I mean what the agreement's two seconds old. This -- the ink isn't even dry. But they did it weeks ago. They were buying missiles from Russia.","They were testing missiles. They don't care about him and now they take the $150 billion. They don't spend it in Boeing. They buy 118 Airbuses. They don't want to buy Boeing. Then somebody on top of that says, well, they have a restriction. They're not allowed to buy in this country. Who the hell put that restriction on after we give them $150 billion?","We give them $150 billion, I want to take the restriction off, right, fast because I want the money. I mean these are people -- these people are just terrible. It's like amateur hour. So then today, I hear Obama is very unhappy with Iran because he feels that they haven't lived up to the spirit of the agreement.","What the hell did he think was going to happen? They defaulted on day one, I mean, they were doing things on day one, and everyone was telling them, he said that can't be possible. That's the way life works. These are vicious people. These are great negotiators. You know the Persians are great negotiators.","When John Kerry went in I'll tell you. I saw on Charlie Rose, I was watching the -- Charlie Rose was nego -- was talking to this guy, the head negotiator for Iran and after watching for five minutes, I said, no, Kerry can't handle this guy. The guy's too smart, too shrewd, too slick, too cunning, too smart.","But I have guys that are much smarter than him, including me by the way, but that's OK. No, no, I have guys that are much better than him. But the saddest part of that deal is that so much of this money is already gone. Just gone, $150 billion, right out the tube. And what do we get? We got nothing. We got nothing.","They got the money and the prisoners should have been released years ago before we started negotiating, years ago. We got nothing and you know, I used to say that was a great deal but it's not a great deal. The great deal is they got Iraq for nothing because they've been fighting forever to get Iraq. And now, they have -- you know, Iraq has among the greatest oil reserves in the world which a lot of people don't even know.","Great quality oil too, but among the greatest oil reserves in the world. Iran has that we gave it to them. For years, decades and decades they fight, and they had the same army, the same strength. Basically, they're almost identical and they go 10 feet left, 10 feet right, 10 feet left, thousands killed, horrible.","Saddam Hussein gas, right? Remember the gas? People would be killed and they'd complain, then they'd throw gas at him. Then they'd rest. Then they'd start a fight a couple of years later but they were the same. Nobody would move. It would be like this. It was called checks. Check and bound, takes years, takes centuries to create them, right?","We go in and destroy one side and I said I was against it. Everyone says Donald Trump would be too quick with the trigger. I'm the one that didn't want to do it. I want to build our military so strong, so powerful that we never have to use it. I hope nobody is going to mess with us. It's, it's so -- it's so sad, it is so sad to see.","I'm telling you it's amateur hour. So then today, I find out, and Hillary Clinton's a disaster, by the way, she is so incompetent. She is so incompetent. You look at what's happening. Take a look at Libya. You know who has Libya oil now? Tell me who has Libya oil? ISIS. ISIS has Libya oil.","That was Hillary Clinton. Let's knock the hell out of this guy. So you have Gaddafi. Let's knock Gaddafi out. Now Gaddafi and Saddam Hussein had one thing in common, they loved to kill terrorists. They were so good at it. They were as good as you could get at killing terrorists. Now the terrorists go to Iraq where they want to -- it's like Harvard.","If you want to be a terrorist you go to Iraq. That's Harvard, Harvard University. You go to Iraq and you become a terrorist. You go to Libya. You go to these countries that we've destroyed. So look, look, Hillary did this whole thing. Remember the sign, remember the ambassador in the Humvee riding into town with the flag and waving the flag and then the people killed him a little while later, right?","They killed him and other people, four people and they killed the Ambassador viciously. Nobody wants to say how the Ambassador was killed, viciously, viciously, and he's on their side. And that was Benghazi, OK? And remember Hillary with the phony phone call? When you get a call at 3:00 in the morning, don't you want her?","No, I don't think so. I don't think so. She was sleeping. She only answers her friends at 3:00 in the morning you know. So it's -- I mean the whole thing, it's so crazy. But I will do a great job now. So what happens is I'm on this big show about a week and a half ago, and I get asked about NATO. I get asked about NATO and the announcer's a very good man.","I mean, Wolf Blitzer, a very good man. And he said, Mr. Trump, what do you think about that? Now just so you understand, I'm not a big NATO expert. I've been building buildings and doing deals all my life. You know that's what I've made over $10 billion doing this stuff and I got -- I built a great company and I filed a company.","I put the company in with the federal elections and the press, these guys they went just absolutely crazy because they were hoping, oh, you know, I'm a private guy. So they didn't know and it turned out to be much bigger much strong. I mean, it's a company with some of the greatest assets in the world. Some of the greatest, I mean, Doral, Turnberry in Scotland, I own things that are phenomenal buildings in Manhattan, great stuff.","I mean, the largest bank in the world is a tenant of mine in one of my buildings in Manhattan and that bank happens to come from China. They have 400 million customers, OK? I said to the Chairman, I said so when we signed the lease. I said so, how do you compare let's say in size to Citibank? He said Citibank is like a small subsidiary that it's just a little bank, it's like forget it. This is a monster bank, and you know, and by the way, China, they're Great.","Mexico, great. All of these countries are great. I'm not angry at them. I'm angry that our leaders are so stupid that these countries can take advantage of us. I'm not angry at those countries. I mean, I made a tremendous amount of money dealing with China. And you know, and as far as Hispanics are concerned, I won the state of Nevada.","I won, I think, 21 or 22 states. Can you imagine that? 22 states, can you imagine that? And how about Cruz, did you see him? He got up during one of the debates. I'm the only one that's beaten Donald Trump. I won. I think it was five at that time five or six. I won five states. I beat Donald Trump. I'm the only one, and then I said, yeah, but I won 22. And he goes he didn't even answer.","Do you remember that? His expression, do you remember this expression? I was in the Senate because actually, I've been in the Senate from the very beginning, right? From the -- there's never been a debate where I haven't been in the Senate. The center is number one. I keep telling the press, will you announce that I'm number one?","Because a lot of people don't know that. You know when you're in the center that means you number one. When some of these guys, like Rand and Jeb, they were falling off the edges, I'd say, by next week you guys are going to be gone. But I was always in the center. So, he was over here and he was talking about I'm the only one, the only one.","I see -- but I mean, and that turned out to be a very famous internet picture. He didn't even argue with me. He just looked at me like this. Remember? It was the weirdest thing. He's a weird guy I'm telling you. He is a weird guy and he would get -- he would get absolutely defeated. You know, I haven't even started on Hillary yet and I don't care about Hillary right now.","I only care about the two. I only care about the two leftovers. I -- I look -- I started at 17. We had 17 people, all Senators and this, Ben Carson, great guy, very accomplished guy, who, who by the way, endorsed me, and he's phenomenal. He's in North Dakota right now making a speech for us and Chris Christie who endorsed me. Great guy.","And Sarah Palin who just left, she was here. Sarah Palin. She just made two speeches. She was at the other two places. I said look, this group is so great. You don't have to bother with them, Sarah. Go home. Go home. See? See what I do? That's called taking advantage of people that I know love me. But that's OK. I said go home, Sarah.","But you know, we have some great -- Sheriff Joe of Arizona, right? I got to tell you a story about life, about toughness. You know, like the Green Bay Packers, great Vince Lombardi. I've always been a big fan. He was --","-- being interviewed this morning on CNN. He was so bad. He was talking about the abortion issue.","He was so bad and I said if I ever said that, I'd be -- it would be headlines all over the world. It was incredible. And I said OK, has any, I just asked. It's like seven hours later. I said, did they write anything? No, nobody writes anything. Nobody writes. Do you think it's a double -- he likes the word leftover.","That's an interesting name isn't it the two leftovers? But you know what, if I said it, it would be a whole different story, so it's not a fair thing. But at the same time, I guess, you can't complain because we're getting a lot of coverage. I said I got almost $2 billion worth of free coverage, right? And the other guy's got a lot less.","You know, so, I've spent $35 million to $40 million of my own money. Now, if I advertise like these other guys do I would've spent a lot more. So I can't complain that much. Do we agree? We shouldn't complain. But I'll tell you, we're going to make this country so incredible. There are so many things we can do. So let me just tell you what happened.","Trade, you all trust me. Believe me, China is going to have a trade -- we're going to have a trade deficit with China this year, $500 billion. Then, somebody, these stupid people -- you know I'm a conservative but I'm a commonsense conservative. You know, Walker copied my term. He said he's a commonsense conservative.","I've been using this term for the last -- he also copied Make America Great Again when he was running I made a speech and got this fantastic standing ovation from a big crowd. He saw it and I said, Make America Great Again but see I copyrighted the name so it's very important. And it isn't -- Ronald Reagan actually had a similar thing.","He said let's make America great. That was his term because people said, oh, Ronald Reagan. You know, I don't really copy but it's like Make America Great Again. So walk a sword and he goes Make America Great Again. He didn't get much of an applause and then shortly, shortly after that he was out he was gone.","You know, but -- and I'm going to bring tomorrow, to one of the, one of the meetings or maybe the next day, I'm going to bring the plaque that he gave me. I actually brought it. I'm going to hold it up. I would've brought a few but I don't know should I? I should have brought it for this crowd. What the hell?","Why didn't I bring it tonight? But I'm going to bring the plaque where he's got this beautiful inscription down there. It's incredible. But what's going to happen is this, I'm being interviewed by Wolf Blitzer and he asked me about NATO. Now, I know about NATO. I'm not an expert on NATO but I have a lot of common sense and I have great business instincts.","That's what you need. When you have $19 trillion, you need somebody that we have to stop this, right? So you know, I said where did this come from? Nobody ever asked me about NATO and nobody ever asked me a lot of these questions because now I'm all of a sudden the politician. He asked me about NATO, I said two things.","I said number one, it's obsolete. It was, you know, really developed for the Soviet Union which doesn't even exist now. But Russia's plenty of problems. I mean, Russia's big stuff, and you know, it's good. But today, we have a different -- we have a problem with terrorism, right? We have a big problem with terrorism.","Well, we have 28 countries, they're the wrong countries in terms of terrorism, many of them are the wrong countries. And I said we have to rejigger NATO. We've got to make it modernized. It's old bureaucratic and we spend most of the money. You know we spend money on all these countries and they're not reimbursing us anywhere fairly.","And they're way in default and we keep spending and spending and one of the things I do is I'd say to people and I'd said to him and I got terrible press. And then two or three days later some of the experts said, you know, we've been studying NATO for 25 years, we never thought of the things that Trump said like it's obsolete.","You know, it's funny when you study something so closely a lot of times you don't see the forest for the trees you've heard that, right? But you study something -- what does that mean? Oh, that's positive, right? Come and take it. Wow. Oh, that's good. Come and take. I love it. I love it. Oh, that's very nice.","That's very nice. I figured it was a protester. It was actually a -- oh, that's beautiful. Thank you very much. Oh, I love that. The Marines. Wow. I love that. Thank you, darling. That's beautiful. You know when I see somebody stand up with a flag usually that's a protester and they have a lot of foul language.","You know it's all professionally done. Just so you understand. But that's really fantastic, thank you. Thank you. Thank you, folks. I love it. I'll come over and shake your hand in a little while. No, no, flags come up and I go whoa, whoa, protester. Get them out of here and then I say wait a minute, that's friends.","We can't do that. So with NATO. So what happened is I said obsolete and we spend too much money on NATO because we're really defending other things, like as an example, the Ukraine. I love the Ukraine. I have many people that are friends of mine that live in the Ukraine. Just like I have many people that are great, great friends of mine that live in Wisconsin.","They tell me all about Wisconsin and I'm here, and I mean, I saw one just a little while ago, and he said, I'm doing great by the way. I think we're doing great. I think we're going to win Wisconsin. I think, yeah. A poll just came out, Public Policy Polling just came out and it has me just about even one point down.","I can't believe I'm losing to Cruz. You can't let this happen, folks, one point down. But I think we're going to do great. And I tell you what. When I looked at the thousands of people outside and the same thing today when we had 7,000 people next door in a sec -- said -- you know, like a separate room, I said this is really -- this isn't in second place.","This isn't like a second-place feeling. And these other guys go and they have 200 and 150 people and 300 people and we come in, we have 8,000 people and 5,000 people outside and you had to see that second place was unbelievable today. And we're going to have 15,000 or 20,000 people on Monday at one of the venues where we have this massive venue which is good.","And we're going to have, I think, 6,000 or 7,000 at the other one. I said that doesn't sound like second place. And the other guys go literally, they have 300, 400 people, 200 people. And I said, you know, I know pretty much, I -- when I went to South Carolina I was supposed to come in second place. And I said that's not second place because I'd have a crowd and it would be thousands and thousands of people more might -- far more than anybody else had and the same thing in New Hampshire.","I went to New Hampshire and I was supposed to come in second place. And I'd go out and there'd be people, thousands of people outside of the building trying to get in, and I said, you know, I guess, you know, what do I know? But it doesn't seem like second place. And then, I ended up winning one in a landslide.","Then, we go to the other one we win that in a landslide. I think we're going to have a big, big victory in Wisconsin. I really do. So, so with NATO I said, I said look, look, it's obsolete, it's old. We have to focus on terrorism and we're spending money and people aren't paying. You know, we have 28 countries and a lot of those countries aren't paying.","They're supposed to pay 2% of certain figures and the numbers are, you know, the numbers are just absolutely -- they're not being met. They're not even paying, OK? So we're giving many of these countries, many I don't want to say who which I know and I don't want to say how many but it's a vast majority of these countries.","We're giving them practically a free ride. Why are we always the dummies? Why are we policing the entire world and when the Ukraine problem came up we were complaining. Obama, we've got to get out -- you know, we're going to start World War III over the Ukraine, right? OK. But we're the ones complaining, we're the ones complaining.","I say, why aren't the nations surrounding Ukraine? They're not complaining -- with Russia. They're not complaining. Why aren't they complaining? Why aren't they saying we don't want you to do this? Why isn't Germany complaining? Why aren't the other countries complaining? Why are we always the one that's upfront and we're paying like 73%, we're paying, we're one country out of the 28? Why are we paying 73%? Why?","Because it just got that way, got that way, got -- so one of these experts was good. He said, you know, I've been doing this for a long time and I've been studying. I never thought of it, it's obsolete. Trump is right. And you know what else? It's unfair because the United States is paying disproportionately by a lot, disproportionately too much.","We owe $19 trillion going into $21 trillion. I'm going to get that down so fast there's so many different things, there's so many different things. That's just one. But then, I was asked a question by Anderson Cooper. He's a great guy. We did a town hall it was really good. I really enjoyed it and he's terrific.","And I got tremendous ratings, and by the way, it got -- it won the evening. You heard about that, right? It won the evening. And who did it just beat by millions? Do you know who it beat by millions? Same time slot. Same timeslot. Beat by millions and millions of people, oh, gee, I'm so surprised to hear that.","But it was a great thing and we talked about Japan and he said, well, what do you think about Japan? I said look, here's the story. We defend Japan. Does anyone know that? We defend Japan. They do now because I've been talking about it to everybody because I find it amazing and it's fine. And I know we don't want Japan to arm ideally, but in the meantime, we have this maniac in North Korea that's armed.","So, you say, well, where does it all stop? So we defend Japan. We defend Germany, right? Did you know that? We defend Germany. Now, here's the thing. They pay us but it's a fraction of what we should be paid and it's not a winner, OK? But we defend all these countries. We defend South Korea. We have 28,000 soldiers.","I wouldn't want to be one of those soldiers to be honest. With this maniac with nuclear weapons, you know, we're sitting there like, like, not good. But we have 28,000 soldiers on the border. We get peanuts. Now, what's going on? Saudi Arabia wouldn't exist except that we defend them. Saudi Arabia, until the oil price went down, and now they're still making a fortune.","But they were making $1 billion a day a year ago, $1 billion a day. We defend Saudi Arabia. We have bases, we have to pay the rent. Why are we paying rent? The rent isn't a big thing but the concept of why are we paying rent? We're defending them. Why are we paying rent? OK. If we left Saudi Arabia, if we left, they would fall.","OK, they would fall whether internally or externally, probably externally, probably Iran because Iran took over Yemen. And Yemen has one thing that looks very, very enticing. It's a massive long border. I mean, one of the longest borders you'll ever see with Saudi Arabia. And Iran wants to get the oil. Look, now they're taking over Iraq.","They're taking over Yemen. They don't really want Yemen but they like the border because they want to take over the oil in Saudi Arabia. So, I'm really good at this stuff. You know, it's sort of amazing. These guys don't give you credit because they'll give you like a quarter of a sentence. So here's what they did.","So, the question was asked about Japan. I said look, you always have to be prepared to walk. If you can't say you're going to walk, you can't make a good deal, OK? It's called The Art of the deal, right? John Kerry should have walked at least two to three times with Iran. When they say, when John Kerry went to Iran, when John Kerry went to Iran, he should have said you have to release our prisoners before we start talking.","And they would have said no, and then, he should have walked, doubled up the sanctions, and within 24 hours, he would have gotten a phone call. Come on back we're releasing the prisoners and that would have been four years ago, OK? That's what would have happened. But this guy never walked. He never walked.","They abused him mentally. They abused him like he was a child. They took advantage of him like he was a baby. They made an unbelievable deal for themselves. We got nothing. And on top of it, we now have a President that say, it's not good what they are doing. And that just happened today and I -- it's so embarrassing.","How we have this man as a President is so embarrassing. He is now after just a short while, in the meantime, they've taken much of the money, the $150 billion. They've taken the money. They've spent a lot of the money in Italy and all over Europe, in Russia. Do you know what they're doing with Russia? They're buying missiles.","And we have Obama, today for the first time, he said he's not happy. He's not happy with Iran. He didn't say it as strong as he should. But the real truth is they're in default. They are in total default. The problem is, the money is gone. Oh, it's -- I wish -- oh, the $150 billion. Now you know I've said a number of times what I would have done with that, right?","The $150 billion? First, I would have gotten our prisoners back. I would have said listen, we got to before we start negotiating, fellas, you got to do this. The prisoners have to come back. They'll say no. I'll say bye-bye. You get up, you leave. Then you double up the sanctions. They'll call you. They'll say, you have your prisoners tomorrow.","Thank you very much. OK. Now you go back in. Now just do one other thing. You only want to walk a couple of times. You know you don't want to keep walking, too much work, right? Now you say one more thing. Listen, listen, the $150 billion, we have no money. We owe $19 trillion soon to be $21 trillion. We have no money.","We can't pay. They'll go crazy after a week or so. They'll be OK with it. We saved the $150 billion, OK? That's what we have to do. That's what we have to do. On top of it, the deal is no good. How would you like to make a deal when during the deal, they're over in Iran celebrating in the streets, burning the American flag, and screaming about how stupid we are that this deal is so good and we just keep going.","But the greatest was today. And I hate to say it. I mean, I wish Obama didn't even say it. It must have been hard for him to say it. The man is incompetent, OK? He's incompetent and it's sad to see. I mean, here's the deal that's a few weeks old literally, and he's out there now saying, he's upset with them and anybody in their right mind would have known what he was getting into.","He has no idea. He has no idea what's happening. And then today, they talk to him about Trump, about nuclear weapons. He said, well obviously, he doesn't know about nuclear weapons. I know more about nuclear weapons and he'll never know. I know what's going -- I know what's right and wrong. So, here's what happens.","So I said Japan, they said, now you have a maniac with nuclear weapons. He doesn't have a carrier system but he's got nuclear weapons, right? And that's North Korea. And you have South Korea that's really, you know, we're defending them. We're not getting what we should get and we're losing a fortune but we're defending them.","We're defending Japan. We're defending Germany and all these countries. So with Japan, I'd say look, fellas, you got to pay up. We love you. We're your friends. We want to take care of you and that would be my first. And we might even walk once or twice but that would be my first. And we'll also be prepared maybe it's better to let them defend themselves because we cannot afford to defend all these people, the world, the whole world, the whole world.","-- and we'll defend them and all that stuff because it's good because, you know, nuclear is a big problem. I don't want to see nuclear all over the place but already, if you think about it, ISIS probably wants -- we got to knock the hell out of them fast by the way. We have no choice. We have no choice.","You know, ISIS. I don't want to go into Iraq but now with ISIS you have no choice, cutting off the heads and drowning people. This is a group of people that we have to beat them fast. Can you imagine we have a military? Can you imagine? I always say because I was a big fan of General Douglas MacArthur. I was a big fan of General George Patton.","These were tough cookies. These were smart tough guys. These were Vince Lombardi's of that world, OK? And these were tough. Could you imagine telling General Patton about ISIS that we can't beat ISIS? He'd have them knocked out in a week. I mean, literally, it would be over in a week. This is crazy. What's going on is crazy.","And let me tell you. They get a nuke or they get a weapon of destruction. I don't want to say what I'm saying here. If they get a weapon of mass destruction, they won't even think about it. They wouldn't even think about it. We got to knock them off fast. We can't play games. We can't play games. Because the single biggest problem we have is nuclear.","The single biggest problem this world has, frankly, is nuclear. This is no more little, you know, we're going to ship. We have an army, two different uniforms, they have their M1 rifles and they're shooting each other. This isn't -- we're not in that anymore. We're into weapon --","-- with each other.","Because frankly, what's going on over there is disgraceful. But we can't allow this to happen. And you know, I don't know if you know this story, but they cut the Christians' heads off and they cut others. But if you're Christian, boom, your head comes off and if you are a Christian from Syria it was -- this is during the old days, five years ago.","If you were a Christian from Syria you couldn't get into this country. It was almost impossible. If you were a Muslim from Syria, no problem, it was one of the easiest places to come into the United States if you were a Muslim from Syria. But if you were Christian from Syria and they're the ones that needed the protection, much more so, you couldn't get into this country.","So you think maybe something's going on that's not so good, all right? That's not so good. So, I talked about Japan and I talked about many aspects of it. I talked about the business debt. If we left Saudi Arabia, it would be, it would be, a terrible thing would happen to them. It'll be very fast. Nobody's going to attack them now because we're protecting them.","Now here's what will happen and they're great negotiators too. If we left, we would say you got to pay which is a fortune by the way. You've got to pay. It doesn't matter. They have so much money. They have funds that are so big they don't know what to do with all their money. I know. Their funds are the biggest funds among the biggest funds in the world.","They have so much money. Money is the thing they don't worry about, money and oil. What they worry about is how long will they keep it, OK? So, what you do is you negotiate. You're going to leave. You're going to leave. You have to be prepared to leave. Otherwise, you can't make a good deal. See we're not prepared to leave.","We weren't prepared to leave the negotiations with Iran. If Kerry would have gotten up and said we're leaving and been tough. We would have made a much better deal, much better deal. I mean, we made one of the worst deals ever. Basically, they got $150 billion and that's it. And they'll have nuclear weapons and everything else and you know it's so, so bad.","So, we have to be prepared to leave. We have to be prepared to leave Japan. We have to say, I'm sorry, we can't do that deal and it's possible we won't get back. And it's possible they will arm and they will then, you know, well, have to take this guy, and they'll have to deal with them. We don't have to deal with them, OK? Is that so bad?","No, ideally that doesn't happen. Ideally, they're going to pay and they're going to pay a lot and we'll be good because I don't love them arming. But you know there's a point at which we just can't do it. When our infrastructure is dying, when our country is dying, when our airports are like hell. I go to Qatar, I go to Dubai, you go to China, different places, you go to places.","They have airports the likes of which you've never ever, ever, ever seen. Then, I land at La Guardia there are potholes all over the place. The places is like a third world airport or Kennedy or LAX or Newark. You look at these airports, they're like from a different time. It's like a time -- it's like a time warp.","They're third world. But you go to some of these -- my pilot lands at Dubai. He said, oh, Mr, Trump, that was the most incredible thing I've ever seen. The runways twice as long as anything he's ever seen like a piece of glass. And we land at La Guardia, huh. What's wrong? Are we OK? We're stupid. We have stupid people leading our country.","So what I said, I talked about the economics that I talked about this. I also said I'd rather not see Japan armed but if they have to that's OK. You always have to be prepared for that and it is a possibility they would be able to arm because we may leave. Because we just can't afford to be the policeman of the world and lose all of this tremendous amount of money.","And it's possible that we're going to have to let NATO go because, you know, nobody's paying up. I mean, when we're paying and nobody else is really paying, a couple of countries are up, but nobody else is really paying. You feel like, you feel like the jerk. One of the things I do early on, I'd call up all of those countries.","I need to get myself Carl Icahn or somebody else that's very good at this stuff, OK. I call him up and say, fellas, you haven't paid for years. Give us the money or get the hell out. Get out. You haven't paid for years. They have agreements. They have agreements. It's all agreements and they haven't paid for years.","I'd say you've got to pay us or get out. You're out, out, out and I'll be nice to them. I'll be a little softer than those and say I'm sorry but you're no longer NATO. And maybe, NATO will dissolve and that's OK. Not the worst thing in the world. But I'm telling you, NATO experts are saying, this guy Trump has got -- they studied this so close to the situation that they never thought that it's obsolete.","They're so close that they never realized that all these people don't pay and that we're like the big stupid sucker that's paying for NATO and we're paying for the United Nations. We're paying for the United Nations. You know many countries don't pay for the United Nations. They come in. They don't pay their bills it's the same thing because they think we're stupid and that's the end.","How often do you see the nation -- United Nations settle anything. You don't see them ever. I mean, things are settled. You know it used to be where the United Nations would be involved but they're not really involved anymore. Do they ever settle anything?? It's like, you know what it's like, it's a political club.","I could tell you so many stories. I would've built their building for billions of dollars less money. I told them. When they renovated the United Nations, I was before the United States Senate, and I told them that I would build that building for billions less. And they said, no, we want to build it ourselves.","Not only did it cost more but it cost much more than even they said. And they said, well, but what would be the difference? I said for billions of less and it would be much better. I'll use marble. You're going to use linoleum. I really mean it too. They didn't have any idea what they were doing and they're thieves and crooks.","And you know to think it'd cost billions of dollars to renovate, to renovate a building cost billions. How many guys are in the real estate business or construction, right? You are. You are? Wow. Huh. Never seen a real estate person that looked like that. Very good. Beautiful. So, so I would have done -- I would have saved him billions, they don't want it. Senator Sessions remembered the meeting we had years ago at the United Nations, six, seven years ago.","I built a building across the street for $360 million. Everyone's now looking over that guy. Do you see that? You'll be gone -- you'll be famous. But you know, I built a building for $360 million right across the street from the United Nations and the Ambassador from Sweden called and he said, how could your building -- 92 stories, how could your building cost $360 million and we're spending billions to renovate a building that's 35 stories tall?","I say, well, number one, lack of knowledge. Number two, everyone's a crook over there. They made a fortune, he said but we're going to spend $1.5 billion. He said to me we're going to spend $1.5 billion. I said no, no, no, you're not going to. But you got to spend $3 billion or $4 billion by the time they're finished with you.","And I was right. I'm really good at this stuff, OK? Of course billions, $3.5 billion, $4 billion. It costs so much money and it was such a bad job, such a bad job. They used floors. They used the Rasa -- really just a terrible, terrible, terrible job. Somebody made so much money. Somebody made so much. It's so sad.","And we pay largely the bills. So, the United Nations is another one and there are so many others. So here's what I'm doing. I'm going to bring our jobs back. I'm going to bring them back to Wisconsin. I'm going to bring our jobs back. I'm not going to let our companies leave. And I tell the story. You know Carrier I tell all the time.","I love the Carrier story because it's so obvious. Two months ago, they announced they're leaving the United States. They're moving to Mexico. I said, oh, that's all right. Moving to Mexico just like that, 1,400 people gone, great jobs. They did a great job for 30 years. They did a great job making air conditioners these people.","Now they're wiped out. So, the Conservative dopes, you know, the guys from the National Review and these dopey people. They think, oh, we're conservative. Well, I'm more conservative than them on virtually every subject but on trade I'm a free trader. But you can only be a free trader if your leaders are smart.","If your leaders are stupid, you can't be a free trader because they're going to, you know, do numbers on us. So Carrier is leaving. So Carrier said they're moving in Mexico. That's great. So I tell the story all the time. I call up Gary. I say listen here's the story, meaning I or one of my people that I have all the best people, right?","I call up, say Mr. President, and my wife wouldn't let me call Carrier because she says it's not Presidential. I'm not supposed to be calling as President an air conditioning company but I'll do it anyway. It's so easy. It's just five minutes, darling. I love doing it. I love it. And I said, oh listen, good luck with your plant.","I hope you do really well. I hope you sell lots of air conditioners. But now we have a real border. You know we have a real, real border and every air conditioner that comes into the United States, you're going to pay a 35% tax on that air conditioner, OK? And because I'm not Ted Cruz who's controlled by his lobbyists and special interests and they'll find the lobbyist that says Cruz.","You know it's blazing into his forehead. The lobbyist, it'll say Cruz. In other words, he takes care of Cruz. Another one takes care of Hillary. Another one takes care of Kasich. Another one takes -- you know that's what it is, folks. These are people, they're really smart, really good, they raised millions of dollars for these guys.","Look at their PACs they have all this money. They have PACs. I put up my own money it's so stupid. I don't think I get any credit for it really. I feel so stupid. My whole life I've taken you know. I take, I keep taking, taking and now I'm telling people they want to give you $10 million. One guy, Donald, I want to give you $10 million.","I say, this is so foreign to me. It's like, I say, I can't take it. He goes what? He doesn't -- he says, of course, you can take it. I said I can't. Another guy wants to give me $5 million. I'm turning down all this money, all of this money, and my whole life has been the opposite. I take, take, take, and I say it I take.","I keep taking. But now I'm going to take for you. I'm going to take for the United States. I'm going to take. I'm going to take. But these lobbyists, these lobbyists, these lobbyists, have total control over these people. And they'll go to Cruz and they'll say, no, you have to do this, you have to do that.","So if Cruz is -- number one he wouldn't make the call because it's up from even making the call because it would never happen. With me, I'll have people call us saying, hey, you know what? You didn't give me anything. I'm not doing anything. I just want to do what's right. The only people I'm working for, you.","Believe me. Believe me. Believe me. I don't need money. I don't want your money. I want you to vote on Tuesday. That's all I want you to do. The only thing. And I've told the story and this is true for Ford and it's true for Nabisco. I'm just using Carrier as an example but it's true for all these country -- companies.","So look, here's what happens. So call, I say call me back. He'll call me back. I will have been approached by lobbyists, by special interest groups. I will have been approached by everybody. I'll say call me back. He'll call me back within 24 hours he'll say, Mr. President, we're staying in the United States.","That's what's going to happen, 100%, 100%, 100%. Now, I guarantee you that nobody from the United States ever called Carrier Corporation. Nobody from the United States ever put pressure on Ford that we can't do this. You can't build a $2.5 billion plant in Mexico we got to keep you in the United States. Nobody ever told Nabisco that you can't move your factory from Chicago into Mexico.","Nobody ever said that. Nobody told Pfizer you can't move to Ireland. You know Pfizer, great pharmaceutical company, 6,000 jobs, the best jobs. They're leaving the United States. They're going to move to Ireland which is great. I have a lot of property over in Ireland. But you know what are you going to do? But they're moving to Ireland.","Nobody ever -- did anybody talk to them? Negotiate with them? Nobody talks. They leave thousands of jobs, gone. Me, I'm going to talk to them. Me, when they send their product in, believe me, their product doesn't get freebies anymore. There's no more freebies. And all these politicians because they're all taken care of. They're all taken care of through campaign contributions all of them and probably other ways.","But I don't want to talk about that. But they're all taken care of, right? And they don't do anything to keep these people because they're told you can't. Pfizer has some of the greatest lobbyists in the world so they get left alone. But let me tell you when they send their products in, if they had to pay a fee, a tax, you know, China would call it a tax.","China would call it a tariff because it sounds like a little better. You know I have a friend who's a great manufacturer, great, great manufacturer. He calls me all the time and says I can't do business in China. You can't get your product in there. They don't want it. They don't want anything made in this country.","You know we talk about free trade. That's why I talk about these stupid people. They say they're conservatives. Do you remember Jeb? He is not a conservative. He is not a conservative. It's so sad. Bye-bye Jeb. Bye-bye. But these are the people we have. I mean, Scott Walker, he was number one, he came out, the future of the Republican Party.","No one comes out. He goes to number one and then I start attacking him. He goes -- he leaves the race. Who do you want as your President? I mean, in all fairness, OK? And you know what? I wouldn't be hitting him. I wouldn't be hitting him. But number one, he hasn't done a great job. Number two, there's nothing but turmoil.","If you are outside of Wisconsin, you take a look at the turmoil, it's always turmoil, and you know what? I'd get a better result without the turmoil. You know there's nothing wrong with no turmoil. But I'll tell you what, the numbers aren't good. But Scott Walker comes out. He was going to be number one.","He started off as number one. Jeb started off at number one. I like, all these guys were going to be number one. Finally, they said Trump is number one, OK? It took a long time. It took them a long time to realize it, right? We had Rand Paul. We had Walker. We had Jeb. We had all of these people that were going to be -- I mean, Marco was -- look Marco is the future of the Republican Party.","He's a nice guy. LIL, no, Marco was going to be the future of the -- and I beat him almost by 20 points, by like 20 points in Florida but soon they'll say, Trump, is the future of the Republican Party. You watch. You watch. But here's, here's what we have to do. We're going to make great trade deals.","We're going to make so much money. We're going to bring our jobs back from China. We're going to bring our jobs back from Mexico. We're not going to lose our manufacturing anymore. These numbers and these numbers that you have right here, look at this chart, I mean, this chart is incredible. Look, U.S. manufacturing jobs since 2000. Do you see what that says?","Do you see the line? You have to see what it says. Do you see the line? Slightly. If we keep going we're going to have nothing. I'm telling you there'll be nothing left. Look at that. Can you see that? I didn't exactly do this and be so proud of this country. We're going to build up our military.","We're going to knock out ISIS. We're going to take care of our vets. We're going to have a strong border. We're going to have a great wall that Mexico is going to pay for. We're going to get rid of Common Core. We're going to have local education. We're going to repeal and replace that horrible, horrible Obamacare.","And I'll tell you, look, I'll tell you here's a story. So it's sort of like you know, why do you do it? I didn't need this. I didn't need this although I enjoy it because we have a movement going. You look at Time Magazine, there's a movement. This isn't like a normal thing. This isn't -- this probably never happened before.","Millions and millions of votes. Now, the Republican Party, they view me as you know a guy. They don't want me because I don't want money. I don't want their money. I don't want the lobbyist money. I don't want -- all these people, they're going to be saying, like, you know, we can't get to Trump because it's a crooked system.","We can't get to Trump. So I get all these people against me. That's why it's important that I win. I don't want to go in there looking at the second ballot because it's probably, you know, with the way, the thing is, it's crooked as hell. Hey, look. What happens? What happens? I win the state of Louisiana, OK? Now, I'm a little bit younger then because it was a couple of months ago.","I learned, I learned. I go in I made speeches. I had a speech the final night of this massive hanger. I pull up my plane. I get out of my plane, thousands and thousands of people in Louisiana. Great place, great people. I go into Louisiana. I make a speech. I make another speech. I'm all over. The election and gets held.","I win. Donald Trump wins the state of Louisiana, right? That's the good news. The bad news is because it's a -- I don't want to. Should I use the word crooked system? Crooked? The bad news is because it's a certain type of system. I win the state. I get thousands of more votes than Cruz. Thousands.","I got fewer delegates than him. So I said think of it. So I said wait a minute because I'm looking at the delegates. I said wait, wait, why does he have more delegates than me? I won the state. I won the state. By the way, I just won Missouri, by the way, I'm sure you -- but I win Louisiana.","I'm speaking in front of thousands of people for a week. I win and I get fewer delegates than he's got, OK? It's not fair, folks. It's not fair because I'm the outsider. And what they do is they want to knock out the outsider because they want to keep their little party going. And the reason our country owes $21 trillion, soon $21 trillion not billion, trillion dollars, OK? The reason we owe all of this money is because of this system.","So here's what we got to do. We're going to win so much. What you have to do is go out and vote. Get every person you know. You can cross lines. If you're a Democrat, if you're Independent, if you're, you know, the people that are voting for me a lot, people that never voted before. We have a huge -- I never realized.","When I do, you know, the scrum, I do the signing. I do whatever. You know I shake hands with people. So many people say, Mr. Trump, I mean, they're 30, 40, 50, 60, one woman is 93 years old from Tennessee. Like this great woman, beautiful woman, she's incredible. She's going to vote for the first time and she voted for the first time because I won the state of Tennessee.","I mean, I'm winning all these states. But, but -- won Alabama, won Arkansas. I mean, we win these incredible states. In fact, I did so well in the South. Don't forget, lying Ted Cruz was supposed to win the South, right? Lying and Ted, he's going to win the South. I will win the South. I win Alabama. I won Florida.","I won everything. I won everything. And the Evangelicals, they know he's a liar and Evangelicals like me and Evangelicals don't like liars. They don't like lying Ted. And I won all these Evangelical places which I fully understand. I have a great relationship there. So here's the story. You are going to remember this evening and you are going to say that this was one of the great evenings of your life.","And more importantly, on Tuesday, you're going to say it was the greatest vote you've ever cast because you're going to be really proud of your President and you're going to be so proud of your country again. We're not going to have a President that said, oh gee, I shouldn't have done the deal with Iran because it's not working out two weeks after.","I mean, the ink isn't even dry. I told him it wasn't going to work out. That's what I do. I'm so good at this stuff. I'm so good. Remember I said keep the oil, right? Keep the oil. There. We're there, don't leave. Keep the oil surrounded. Keep it. We didn't keep it. ISIS now has Libya's oil. Why aren't we doing a blockade?","Why aren't we doing a blockade? ISIS has the Libyan oil. Hillary Clinton, let's free Libya. Benghazi, the Ambassador killed, her friend, OK? Keep the oil. Why aren't we doing blockades? So many things so here's the story. You're going to be so proud of your President. You're going to be so proud of your country.","You're going to be so proud of your country. You're going to love your country so much. You love it anyway. But you're so disappointed at it right now and you're so disappointed in the leaders. You're going to view tonight as very important. You're going to view Tuesday as very, very important. Here's what's going to happen.","We're going to start winning again. We're going to win on trade. We're going to win with our military. We're going to knock the hell out of ISIS. We're going to win for our vets. We've got to take care of our vets. We're going to win at the border. People come in but they've got to come in legally, right?","Legally. They come in through a legal system and we get to win in every aspect. And you're going to say that was a great day when I voted for Donald Trump. So, folks, I want to thank you. So important, winning Wisconsin. If we win Wisconsin I think it's over. If I don't win it, if I don't win it, I don't think it's -- I think, you know, we have a good chance because we're way up in New York, way up in New Jersey, way up in Pennsylvania.","But I want Wisconsin to win it for me, OK? So go out and vote on Tuesday and I promise you, you will be so proud of this country again. Thank you, everybody. Thank you. I love you. Thank you. Thank you, everybody."],"text":" Oh, we're going to have fun. We're going to have a lot of fun. We're going to have a lot of fun. Thank you, everybody. You know we have thousands of people outside. I feel guilt. Oh, that's so nice. So nice. Yay. Yay. They're outside you're inside. So beautiful. They're outside freezing. But we have thousands and I just want to say it's amazing. I tell you something's going on in Wisconsin. I think we're going to have a very good day on Tuesday. We're going to have a very, very good day. We're going to have -- we had big crowds we've done. This is the third one. We've been packed at every place. On Monday, actually, we're going to have, I guess, 20,000 at one and 66,000 or 7,000 at another. And we would have had 7,000 or 8,000 here or 10,000 if we could have found a bigger place. I don't know. Is there a bigger place around? Let's go find one, right? Well, I want to thank you all for being here. You know it's all about making America great again, right? Make America Great Again. Our country is suffering. We're suffering. We see what's going on and you know I look at numbers, and I must tell you, Scott Walker has been a nice guy and I've been nice to him. I gave game like about 50,000 or 100,000 in his campaign. He gave me a plaque a little more than a year ago. No, he gave me a plaque. I wish I had the money back, right? Give me the money back, Scott. But he didn't like the way I treated him. He ran for President. I ran for President. I won. So, therefore, you want to have Trump, right? I mean, we want to have Trump. And you know the reason I won, to be honest, he was very nice to me. He was very nice to me. Then he had a fundraiser. Hence, his fundraising person made a mistake. He said very nasty things about me. Come on. We're going to have a fundraiser for Scott and he said some really nasty things like -- so, I called Scott because I always like to sort of watch to see what happens. And then, I call and say, I'm sorry, Scott. That wasn't nice what you're guy did. And I started talking about the problems that they have in Wisconsin. Now you know, I have a lot of friends in Wisconsin. It's an amazing place and a great place. But they have difficulties. I just wrote down 20% of the manufacturing jobs have left since the year 2000. People don't know this stuff. And you know when Scott came out he was in first place and after I went after him he left. That was the other Scott. That's the way it should be. Don't you want that for your President? I mean, you know -- now the Journal Sentinel. I don't know if you like it or don't like it but Wisconsin is chronic -- it chronically lags the rest of the United States in job creation. So in job creation, Wisconsin lags. Also, Journal Sentinel, let's say he keeps wages depressed because of other jobs, they're depressed at wages. Also a lot of the work and a lot of the jobs they pay a very small amount and a lot are in the healthcare industry which really is not a lot of high-end jobs. Because we're losing our jobs to Japan to China to Mexico. You know all about it. We're losing our jobs, our good, jobs we're losing to other places. Sort of interesting, I'm a big buyer of things and I buy Wausau Window, it's not so far from here. But Wausau Window they do a great job. They charged me a lot of money for their windows but that's OK, in the meantime, they don't leak. I put -- I bought I guess close to 4,000 maybe even more than that, 4,000 windows for 40 Wall Street which is a 72-story building and it's actually one of the tallest buildings in downtown Manhattan right on Wall Street. Great location. Great building, 100% occupied and I bought Wausau Windows, OK? And boy, do I buy Kohl -- I buy Kohler products, OK? Kohler, Herb Kohler is a friend of mine, so, we buy a lot of Kohler products so you know. So, it's good stuff. So we keep a lot of money in the state. I don't feel guilty at all. And I've been here now for -- wow, we've done three today. We're going to do three tomorrow. We're going to be here Monday. I'm staying on Tuesday. If I -- if I feel I'm going to lose I'll be out of here. I'll go like this. And I'm -- If I feel I'm going to win, we'll all get together. We'll celebrate together on Tuesday morning, all right? In Wisconsin, household income has declined since the year 2000. Its not good. It's not good. Look, the bottom line it's like the country and you're in the middle of the pack for the states around the area, you're in the middle. So when Scott, you know, goes out and endorses Cruz, I understand that. Cruz will never bring you to greatness. Let me tell you. He's a politician. He has money coming in through all sorts of different people that he thinks, you know, like on his financial disclosure form he didn't disclose that he had $1 million in loans from Citibank and from Goldman Sachs. He isn't disclosing. He forgot to put it on. He said he forgot. Lying Ted, lying Ted, lying Ted. What does he hold up high before he lies? the Bible. He holds the Bible high. He puts the Bible down and then he lies, lying ted. No, he's a liar. I tell you. I've met a lot tougher than Ted but I've never met one that would lie as much. Not a good liar though he always gets caught. You know a good liar doesn't get caught. What he did, as an example, to Ben Carson. I think that was terrible, in Iowa. Ben endorsed me. Great guy and Ben is, you know, in Iowa, and Ted said, he has left the race. He said this on election day, folks. You know I mean, they're voting and he let everybody know and it's a caucus. So it's not what you just what -- they walk in. They sat down they explained that he left the race and thousands of votes were taken away from Ben Carson by lying. And then Cruz called up later and apologized, excuse me, about 10 minutes after the election ended. That somehow doesn't help, right? It doesn't help. So look, this is what we have. These politicians are never going to take us to the promised land. And certainly, Cruz is and he doesn't get along with anybody. Nobody likes him. I mean, think of it, the set -- the Senator that he most respects in the world is Jeff Sessions, a great, great guy from Alabama, right? Senator Jeff Sessions. And in the first part of the race he kept talking about Jeff Sessions, Senator Sessions, and then, Senator Sessions endorsed me, and he said, and you know, look, he knows because he understands we have right now $19 trillion in debt going up to $21 trillion because of the crazy omnibus plan that was just passed. The budget that was just passed which is one of the worst budgets I've ever seen. And it went so fast. Three months ago they passed the omnibus. Does everyone know what I'm talking about? One of the worst. It funds illegal immigration. It funds ISIS coming in or whoever comes in because we don't even know who is coming in. We have people coming in from Syria on the migration, thousands and thousands of people. We have no idea who they are, where they come from, there's no documentation. We have to be crazy. No, no, I will tell you. They're going home. If I become President, we have to, we have to, we have no choice. Where are these people coming from? I mean, you know, where are our leaders coming from? What are we doing? We have no documentation and you see what's going on in Germany. You see what's going on in Sweden, a small part of Sweden where they took a lot of people in. It's like a disaster. You see what's going on in Brussels. Brussels 25 years ago was incredible. I made a statement about Brussels recently and it was very harsh. I said it's like living in a hellhole. Because I have a lot of friends who go to Brussels. It's a financial capital. And they tell me what's going on. I've been there years ago and it was beautiful, one of the most beautiful cities in the world actually. And a friend of mine came back, and he said, another friend said, oh, it's like an armed camp. And this is because people came in, and frankly, those people weren't vetted and they're -- it was it's a disaster. So I made this statement and New York Times did a major story, how dare Donald Trump criticize a place like he did Brussels. And it was like that, you know, he's excoriated. Then two months later, which was a week ago, they had the horrible problem in Brussels. And now, Brussels, they realize they have no control over the place whatsoever. And we can't be the stupid people. We can't be. We just can't be. We can't be and we're not going to be. You know speaking of that, I have, I mean, we'll get off -- and really, I want to talk about trade. I want to talk about keeping our jobs here and I want to talk about bringing jobs here, OK? So that we can fill up lots of different places like this. I'm telling you. I want to talk about that because that's really -- but speaking of illegal immigration and Syria or wherever these people are coming from, and you know what, I have a big heart. I have as big a heart as anybody. A big, big heart. And we should build, we should build in Syria safe zones. We should do it and we'll get the Gulf states to put up the money. I don't want to put up money anymore. We're putting up enough money. We don't have any money. This country has no money and we'll talk about that in a minute. But I thought I'd tell you this. This was written by a fantastic guy and a rock and roller actually who did something. And it talks about illegal immigration and just think about this. We don't know who's coming in. We don't know anything about -- we know something bad is going to happen, OK? Something bad is going to happen. This is like you know the story of the Trojan horse, right? This could be the ultimate Trojan horse and don't forget, we have thousands and thousands of people on -- did you ever know the migration line, did you ever see it? They have a lot of young people, young, strong men. I said where are the women? Where are the children? There are some but there aren't very many. And I mean, seriously, I -- maybe it's not but this could be the Trojan Horse. So I thought I'd say this to you. I don't do it often but it's a sort of thing that was written years ago and it's very -- it's called the Snake. Do you like it? So who's heard the snake before? Does anybody want to hear it one more time, huh? Because people love it. You know great art it's interesting. A friend of mine's a great, great art collector and if you look at the Mona Lisa, right? The Mona Lisa, one of the great paintings. You don't like it that much at the beginning. You really don't and then you look at it again. I like it a little bit more again and agin. And by the time they reach a certain age, it's like captivating. It's -- the people are just crazed. They can't look at anything else, right? That's called great art. With other paintings, you say, oh, I love it, I love it, I love it and then two weeks later, you don't like it anymore. There is something very special about greats. So this is very descriptive and people like it and it's a little bit tough but it's very true. And think of this with allowing people in. We know it's going to be a problem. We know it's going to be a problem. It's going to be a big problem. You're going to have things happening. Look what happened to the two radicalized people in California recently where the 14 people that they killed. Their co-workers, they killed their co-workers out of nowhere, their co-workers gave them a baby shower, and they had a party for them and they went in and they kill 14 of them and others badly wounded. You look at Paris where 130 people killed and tremendous numbers of people in the hospital. They'll be in hospitals for the rest of their lives and many will die. What are we doing, folks? What are we doing? So this is called The Snake, on her way to work one morning down the path along the lake, a tender-hearted woman saw a poor half-frozen snake. His pretty colored skin had been all frosted with the dew. Oh, well, she cried, I'll take you in and I'll take care of you. Take me in, oh, tender woman. Take me in for heaven's sake. Take me in, oh, tender woman, sighed the broken snake. She wrapped him up all cozy in a curvature of silk and then laid him by the fireside with honey and some milk. Now, she hurried home from work that night as soon as she arrived, she found that pretty snake. She'd taken, had been revived. Take me in, oh, tender woman. Take me in for heaven's sake. Take me in, oh, tender woman, sighed the broken snake. She then clutched him to her bosom. You're so beautiful she cried but if I hadn't brought you in by now, oh heavens, oh heavens, you definitely, you just definitely would have died. Now she stroked his pretty skin and then she kissed him and held him tight. But instead of saying thank you. That's they gave her a vicious bite. Take me in, oh, tender woman. Take me in for heaven's sake. Take me in, oh, tender woman, sighed the vicious snake. I saved you, cried the woman, and you've bit me, heavens why? You know your bite is poisonous and now I'm going to die. Oh, shut up silly woman, said the reptile with a grin. You knew damn well I was a snake before you took me in. Right? Right? No, I don't think so. You think Kasich does that? I don't think so. I don't think so. You think Ted Cruz does that? I don't think so. No, I don't think so. So, I just -- look, look, we have so many -- it's such a downer. You have seats and yet you're standing. That's excitement, right? Look at this guy. I won't tell you. I won't tell you. You know it's interesting. The last time, a couple of days ago, I gave -- I love you too, darling. Who said that? Some -- awww so beautiful. Thank you, honey. I love you too. That's why I'm doing this to protect people like you. Ivanka just had a beautiful grand -- you know, a grandson from me. And that's why I'm doing it. People say, actually, I was on a great radio show this morning, and he said to me, we had a great talk and then he said, Mr. Trump, can I ask you one more question? Why are you doing this? You've built up a $10 billion net worth. You have a great company. You have a great family. And here you are on Saturday morning at 6:30 in the morning talking to a radio show. Why are you doing this? I actually said, good question, right. But I said you know what? My whole theme is Make America Great Again. True. Make America Great Again. We're going to make our country so great again. We're going to make it so strong again. I've gotten to see so many people. I mean, like today, thousands at least 5,000 people are outside. I feel terribly about it and we'll come back but at least 5,000 people outside. The last time it was worse. We had 7,000 or 8,000 people that were in this hall that was like a secondary hall and we had, you know, loudspeakers and stuff but there's something going on. There's like a movement. It's been on Time Magazine four times now over the period of -- a short period of time. And it's a movement. What's going on is a movement. I'll tell you Wisconsin is very important because I think we're going to win before we get to the convention. But if we get to the convention, if we get to the convention, the Establishment politicians who want to protect their jobs, who want to protect their paychecks, who want to protect all of the different things, like the lobbyists, and the special interests, they don't like me. Now, I used to be a part of the Establishment. I was at the highest level. I gave lots of money, #350,000 to the Republican Governors Association. I gave a tremendous amount of money. I was Establishment. I was like the King of the Establishment in a certain way. And then I ran and I wasn't the establish -- you know, somebody said you know, Trump, I don't think he wants our money. And then I announced some self-funding. You know, I'm totally self-funding. So, I'm not -- I'm not asking. And you know, coming over here I said to -- actually, this morning when we were in the car. I said, you know, I don't think that I'm getting any credit for self-funding, OK? I'm not getting credit for turning down tens of millions of dollars. Bush had $148 million that he raised which is very impressive. Unfortunately, he couldn't get anybody to vote for him. That's the problem. That's, that's a big problem. It says -- who said that? See? I won't repeat that. You know, I just get my -- I just get myself in trouble. But you know, it's very funny actually. It's called branding, right? Branding. Forever branded. But Bush, Bush had $148 million, and you know, like in New Hampshire he's spent like tens of millions of dollars. I spend very little I came in first. Then in South Carolina, other guys spent tens of millions, just so much more money. We came in first. And -- but you know, I'm self-funding and I don't know that I get the credit for it. I don't know. When you go and you say, well, Cruz is OK. He's not by the way but let me tell you. No, he is not. He's not, OK? He would do such a terrible job. You know, here's a guy who filibusters in the Senate. Now, you know, say what you want about these Senators. These guys have been there a long time. They're professionals. They're not, you know, stupid people. And he stands up and he filibusters and he reads poems and he reads everything else and he's filibustering a -- what good -- a day and a half. He's never done anything. He never gets anything approved. Then he says, Donald Trump will negotiate. He will only go -- of course, you've got to. That's the way it was -- our founders sort of had in mind. You got to negotiate but I'll negotiate well. I'm not going to be -- you know Cruz thinks he's going to take this hardline position and everybody's going to eventually come. It doesn't work that way, folks. It doesn't work. So he stood up for what a day and a half? And he filibustered and he left and these Senators are sitting back and they're saying, when's he going to leave? Let's see, OK. He's still talking, right? He's still talking. OK, and then they, you know, that's, that's the way it works. Look, you're not dealing with babies. So what happens is he never did anything. He never accomplish anything. Hasn't done anything. And folks, he's in favor of Trans-Pacific Partnership which is a disaster. And worse than being in favor, and he really pushed it, but worse than being in favor, the single greatest weapon used against you and everybody. I mean, used against our country is currency devaluation and currency manipulation. That's the big weapon. And when I started talking about it a year and a half ago, when it was conceived. As -- you got to talk about currency manipulation because if you look at China, what they do is they devalue their currency and they kill us. You look at other countries like Japan and others, they devalue their currency and they absolutely kill us. So you have to go out and you have to look at currency manipulation. And if you're not going to put that in -- Well, Cruz would not hear of currency manipulation. Now somebody told them you can't do it. One of his people that give him a lot of money. They said you can't do it. Why would he not allow currency manipulation? In other words, having clauses that you can't do that. In other words, it's a violation, right, or to default? It's no good. So Cruz, not only is he pushing it which is terrible, but he won't allow the single biggest thing a block on the single biggest problem that we have which is currency devaluations and currency manipulation. Now, you tell me that's going to be good for you? He's going to be a disaster, OK? I don't care. Somebody said, oh, you shouldn't say such bad things about his Republican. Give me a break, OK. I'm here. Hey, if it works. Great. If it doesn't work. Great. I'm going to either do a great job or I'll be waving hello. I'll be coming to Wisconsin to see my friends. I don't care. But look, they asked me, they said why, why are you doing it? So many people, even my family they say dad why do you want to do this? I want to do it because this country has given me so much and I hate watching what I'm watching on television. I hate seeing President Obama -- True, true. I hate seeing President Obama, today, seeing saying that Iran has violated our agreement. I mean, what did he think? He's now complaining about Iran violating the agreement. What the hell did he think? He's like a baby. He's like a baby. No, can you imagine? I mean what the agreement's two seconds old. This -- the ink isn't even dry. But they did it weeks ago. They were buying missiles from Russia. They were testing missiles. They don't care about him and now they take the $150 billion. They don't spend it in Boeing. They buy 118 Airbuses. They don't want to buy Boeing. Then somebody on top of that says, well, they have a restriction. They're not allowed to buy in this country. Who the hell put that restriction on after we give them $150 billion? We give them $150 billion, I want to take the restriction off, right, fast because I want the money. I mean these are people -- these people are just terrible. It's like amateur hour. So then today, I hear Obama is very unhappy with Iran because he feels that they haven't lived up to the spirit of the agreement. What the hell did he think was going to happen? They defaulted on day one, I mean, they were doing things on day one, and everyone was telling them, he said that can't be possible. That's the way life works. These are vicious people. These are great negotiators. You know the Persians are great negotiators. When John Kerry went in I'll tell you. I saw on Charlie Rose, I was watching the -- Charlie Rose was nego -- was talking to this guy, the head negotiator for Iran and after watching for five minutes, I said, no, Kerry can't handle this guy. The guy's too smart, too shrewd, too slick, too cunning, too smart. But I have guys that are much smarter than him, including me by the way, but that's OK. No, no, I have guys that are much better than him. But the saddest part of that deal is that so much of this money is already gone. Just gone, $150 billion, right out the tube. And what do we get? We got nothing. We got nothing. They got the money and the prisoners should have been released years ago before we started negotiating, years ago. We got nothing and you know, I used to say that was a great deal but it's not a great deal. The great deal is they got Iraq for nothing because they've been fighting forever to get Iraq. And now, they have -- you know, Iraq has among the greatest oil reserves in the world which a lot of people don't even know. Great quality oil too, but among the greatest oil reserves in the world. Iran has that we gave it to them. For years, decades and decades they fight, and they had the same army, the same strength. Basically, they're almost identical and they go 10 feet left, 10 feet right, 10 feet left, thousands killed, horrible. Saddam Hussein gas, right? Remember the gas? People would be killed and they'd complain, then they'd throw gas at him. Then they'd rest. Then they'd start a fight a couple of years later but they were the same. Nobody would move. It would be like this. It was called checks. Check and bound, takes years, takes centuries to create them, right? We go in and destroy one side and I said I was against it. Everyone says Donald Trump would be too quick with the trigger. I'm the one that didn't want to do it. I want to build our military so strong, so powerful that we never have to use it. I hope nobody is going to mess with us. It's, it's so -- it's so sad, it is so sad to see. I'm telling you it's amateur hour. So then today, I find out, and Hillary Clinton's a disaster, by the way, she is so incompetent. She is so incompetent. You look at what's happening. Take a look at Libya. You know who has Libya oil now? Tell me who has Libya oil? ISIS. ISIS has Libya oil. That was Hillary Clinton. Let's knock the hell out of this guy. So you have Gaddafi. Let's knock Gaddafi out. Now Gaddafi and Saddam Hussein had one thing in common, they loved to kill terrorists. They were so good at it. They were as good as you could get at killing terrorists. Now the terrorists go to Iraq where they want to -- it's like Harvard. If you want to be a terrorist you go to Iraq. That's Harvard, Harvard University. You go to Iraq and you become a terrorist. You go to Libya. You go to these countries that we've destroyed. So look, look, Hillary did this whole thing. Remember the sign, remember the ambassador in the Humvee riding into town with the flag and waving the flag and then the people killed him a little while later, right? They killed him and other people, four people and they killed the Ambassador viciously. Nobody wants to say how the Ambassador was killed, viciously, viciously, and he's on their side. And that was Benghazi, OK? And remember Hillary with the phony phone call? When you get a call at 3:00 in the morning, don't you want her? No, I don't think so. I don't think so. She was sleeping. She only answers her friends at 3:00 in the morning you know. So it's -- I mean the whole thing, it's so crazy. But I will do a great job now. So what happens is I'm on this big show about a week and a half ago, and I get asked about NATO. I get asked about NATO and the announcer's a very good man. I mean, Wolf Blitzer, a very good man. And he said, Mr. Trump, what do you think about that? Now just so you understand, I'm not a big NATO expert. I've been building buildings and doing deals all my life. You know that's what I've made over $10 billion doing this stuff and I got -- I built a great company and I filed a company. I put the company in with the federal elections and the press, these guys they went just absolutely crazy because they were hoping, oh, you know, I'm a private guy. So they didn't know and it turned out to be much bigger much strong. I mean, it's a company with some of the greatest assets in the world. Some of the greatest, I mean, Doral, Turnberry in Scotland, I own things that are phenomenal buildings in Manhattan, great stuff. I mean, the largest bank in the world is a tenant of mine in one of my buildings in Manhattan and that bank happens to come from China. They have 400 million customers, OK? I said to the Chairman, I said so when we signed the lease. I said so, how do you compare let's say in size to Citibank? He said Citibank is like a small subsidiary that it's just a little bank, it's like forget it. This is a monster bank, and you know, and by the way, China, they're Great. Mexico, great. All of these countries are great. I'm not angry at them. I'm angry that our leaders are so stupid that these countries can take advantage of us. I'm not angry at those countries. I mean, I made a tremendous amount of money dealing with China. And you know, and as far as Hispanics are concerned, I won the state of Nevada. I won, I think, 21 or 22 states. Can you imagine that? 22 states, can you imagine that? And how about Cruz, did you see him? He got up during one of the debates. I'm the only one that's beaten Donald Trump. I won. I think it was five at that time five or six. I won five states. I beat Donald Trump. I'm the only one, and then I said, yeah, but I won 22. And he goes he didn't even answer. Do you remember that? His expression, do you remember this expression? I was in the Senate because actually, I've been in the Senate from the very beginning, right? From the -- there's never been a debate where I haven't been in the Senate. The center is number one. I keep telling the press, will you announce that I'm number one? Because a lot of people don't know that. You know when you're in the center that means you number one. When some of these guys, like Rand and Jeb, they were falling off the edges, I'd say, by next week you guys are going to be gone. But I was always in the center. So, he was over here and he was talking about I'm the only one, the only one. I see -- but I mean, and that turned out to be a very famous internet picture. He didn't even argue with me. He just looked at me like this. Remember? It was the weirdest thing. He's a weird guy I'm telling you. He is a weird guy and he would get -- he would get absolutely defeated. You know, I haven't even started on Hillary yet and I don't care about Hillary right now. I only care about the two. I only care about the two leftovers. I -- I look -- I started at 17. We had 17 people, all Senators and this, Ben Carson, great guy, very accomplished guy, who, who by the way, endorsed me, and he's phenomenal. He's in North Dakota right now making a speech for us and Chris Christie who endorsed me. Great guy. And Sarah Palin who just left, she was here. Sarah Palin. She just made two speeches. She was at the other two places. I said look, this group is so great. You don't have to bother with them, Sarah. Go home. Go home. See? See what I do? That's called taking advantage of people that I know love me. But that's OK. I said go home, Sarah. But you know, we have some great -- Sheriff Joe of Arizona, right? I got to tell you a story about life, about toughness. You know, like the Green Bay Packers, great Vince Lombardi. I've always been a big fan. He was -- -- being interviewed this morning on CNN. He was so bad. He was talking about the abortion issue. He was so bad and I said if I ever said that, I'd be -- it would be headlines all over the world. It was incredible. And I said OK, has any, I just asked. It's like seven hours later. I said, did they write anything? No, nobody writes anything. Nobody writes. Do you think it's a double -- he likes the word leftover. That's an interesting name isn't it the two leftovers? But you know what, if I said it, it would be a whole different story, so it's not a fair thing. But at the same time, I guess, you can't complain because we're getting a lot of coverage. I said I got almost $2 billion worth of free coverage, right? And the other guy's got a lot less. You know, so, I've spent $35 million to $40 million of my own money. Now, if I advertise like these other guys do I would've spent a lot more. So I can't complain that much. Do we agree? We shouldn't complain. But I'll tell you, we're going to make this country so incredible. There are so many things we can do. So let me just tell you what happened. Trade, you all trust me. Believe me, China is going to have a trade -- we're going to have a trade deficit with China this year, $500 billion. Then, somebody, these stupid people -- you know I'm a conservative but I'm a commonsense conservative. You know, Walker copied my term. He said he's a commonsense conservative. I've been using this term for the last -- he also copied Make America Great Again when he was running I made a speech and got this fantastic standing ovation from a big crowd. He saw it and I said, Make America Great Again but see I copyrighted the name so it's very important. And it isn't -- Ronald Reagan actually had a similar thing. He said let's make America great. That was his term because people said, oh, Ronald Reagan. You know, I don't really copy but it's like Make America Great Again. So walk a sword and he goes Make America Great Again. He didn't get much of an applause and then shortly, shortly after that he was out he was gone. You know, but -- and I'm going to bring tomorrow, to one of the, one of the meetings or maybe the next day, I'm going to bring the plaque that he gave me. I actually brought it. I'm going to hold it up. I would've brought a few but I don't know should I? I should have brought it for this crowd. What the hell? Why didn't I bring it tonight? But I'm going to bring the plaque where he's got this beautiful inscription down there. It's incredible. But what's going to happen is this, I'm being interviewed by Wolf Blitzer and he asked me about NATO. Now, I know about NATO. I'm not an expert on NATO but I have a lot of common sense and I have great business instincts. That's what you need. When you have $19 trillion, you need somebody that we have to stop this, right? So you know, I said where did this come from? Nobody ever asked me about NATO and nobody ever asked me a lot of these questions because now I'm all of a sudden the politician. He asked me about NATO, I said two things. I said number one, it's obsolete. It was, you know, really developed for the Soviet Union which doesn't even exist now. But Russia's plenty of problems. I mean, Russia's big stuff, and you know, it's good. But today, we have a different -- we have a problem with terrorism, right? We have a big problem with terrorism. Well, we have 28 countries, they're the wrong countries in terms of terrorism, many of them are the wrong countries. And I said we have to rejigger NATO. We've got to make it modernized. It's old bureaucratic and we spend most of the money. You know we spend money on all these countries and they're not reimbursing us anywhere fairly. And they're way in default and we keep spending and spending and one of the things I do is I'd say to people and I'd said to him and I got terrible press. And then two or three days later some of the experts said, you know, we've been studying NATO for 25 years, we never thought of the things that Trump said like it's obsolete. You know, it's funny when you study something so closely a lot of times you don't see the forest for the trees you've heard that, right? But you study something -- what does that mean? Oh, that's positive, right? Come and take it. Wow. Oh, that's good. Come and take. I love it. I love it. Oh, that's very nice. That's very nice. I figured it was a protester. It was actually a -- oh, that's beautiful. Thank you very much. Oh, I love that. The Marines. Wow. I love that. Thank you, darling. That's beautiful. You know when I see somebody stand up with a flag usually that's a protester and they have a lot of foul language. You know it's all professionally done. Just so you understand. But that's really fantastic, thank you. Thank you. Thank you, folks. I love it. I'll come over and shake your hand in a little while. No, no, flags come up and I go whoa, whoa, protester. Get them out of here and then I say wait a minute, that's friends. We can't do that. So with NATO. So what happened is I said obsolete and we spend too much money on NATO because we're really defending other things, like as an example, the Ukraine. I love the Ukraine. I have many people that are friends of mine that live in the Ukraine. Just like I have many people that are great, great friends of mine that live in Wisconsin. They tell me all about Wisconsin and I'm here, and I mean, I saw one just a little while ago, and he said, I'm doing great by the way. I think we're doing great. I think we're going to win Wisconsin. I think, yeah. A poll just came out, Public Policy Polling just came out and it has me just about even one point down. I can't believe I'm losing to Cruz. You can't let this happen, folks, one point down. But I think we're going to do great. And I tell you what. When I looked at the thousands of people outside and the same thing today when we had 7,000 people next door in a sec -- said -- you know, like a separate room, I said this is really -- this isn't in second place. This isn't like a second-place feeling. And these other guys go and they have 200 and 150 people and 300 people and we come in, we have 8,000 people and 5,000 people outside and you had to see that second place was unbelievable today. And we're going to have 15,000 or 20,000 people on Monday at one of the venues where we have this massive venue which is good. And we're going to have, I think, 6,000 or 7,000 at the other one. I said that doesn't sound like second place. And the other guys go literally, they have 300, 400 people, 200 people. And I said, you know, I know pretty much, I -- when I went to South Carolina I was supposed to come in second place. And I said that's not second place because I'd have a crowd and it would be thousands and thousands of people more might -- far more than anybody else had and the same thing in New Hampshire. I went to New Hampshire and I was supposed to come in second place. And I'd go out and there'd be people, thousands of people outside of the building trying to get in, and I said, you know, I guess, you know, what do I know? But it doesn't seem like second place. And then, I ended up winning one in a landslide. Then, we go to the other one we win that in a landslide. I think we're going to have a big, big victory in Wisconsin. I really do. So, so with NATO I said, I said look, look, it's obsolete, it's old. We have to focus on terrorism and we're spending money and people aren't paying. You know, we have 28 countries and a lot of those countries aren't paying. They're supposed to pay 2% of certain figures and the numbers are, you know, the numbers are just absolutely -- they're not being met. They're not even paying, OK? So we're giving many of these countries, many I don't want to say who which I know and I don't want to say how many but it's a vast majority of these countries. We're giving them practically a free ride. Why are we always the dummies? Why are we policing the entire world and when the Ukraine problem came up we were complaining. Obama, we've got to get out -- you know, we're going to start World War III over the Ukraine, right? OK. But we're the ones complaining, we're the ones complaining. I say, why aren't the nations surrounding Ukraine? They're not complaining -- with Russia. They're not complaining. Why aren't they complaining? Why aren't they saying we don't want you to do this? Why isn't Germany complaining? Why aren't the other countries complaining? Why are we always the one that's upfront and we're paying like 73%, we're paying, we're one country out of the 28? Why are we paying 73%? Why? Because it just got that way, got that way, got -- so one of these experts was good. He said, you know, I've been doing this for a long time and I've been studying. I never thought of it, it's obsolete. Trump is right. And you know what else? It's unfair because the United States is paying disproportionately by a lot, disproportionately too much. We owe $19 trillion going into $21 trillion. I'm going to get that down so fast there's so many different things, there's so many different things. That's just one. But then, I was asked a question by Anderson Cooper. He's a great guy. We did a town hall it was really good. I really enjoyed it and he's terrific. And I got tremendous ratings, and by the way, it got -- it won the evening. You heard about that, right? It won the evening. And who did it just beat by millions? Do you know who it beat by millions? Same time slot. Same timeslot. Beat by millions and millions of people, oh, gee, I'm so surprised to hear that. But it was a great thing and we talked about Japan and he said, well, what do you think about Japan? I said look, here's the story. We defend Japan. Does anyone know that? We defend Japan. They do now because I've been talking about it to everybody because I find it amazing and it's fine. And I know we don't want Japan to arm ideally, but in the meantime, we have this maniac in North Korea that's armed. So, you say, well, where does it all stop? So we defend Japan. We defend Germany, right? Did you know that? We defend Germany. Now, here's the thing. They pay us but it's a fraction of what we should be paid and it's not a winner, OK? But we defend all these countries. We defend South Korea. We have 28,000 soldiers. I wouldn't want to be one of those soldiers to be honest. With this maniac with nuclear weapons, you know, we're sitting there like, like, not good. But we have 28,000 soldiers on the border. We get peanuts. Now, what's going on? Saudi Arabia wouldn't exist except that we defend them. Saudi Arabia, until the oil price went down, and now they're still making a fortune. But they were making $1 billion a day a year ago, $1 billion a day. We defend Saudi Arabia. We have bases, we have to pay the rent. Why are we paying rent? The rent isn't a big thing but the concept of why are we paying rent? We're defending them. Why are we paying rent? OK. If we left Saudi Arabia, if we left, they would fall. OK, they would fall whether internally or externally, probably externally, probably Iran because Iran took over Yemen. And Yemen has one thing that looks very, very enticing. It's a massive long border. I mean, one of the longest borders you'll ever see with Saudi Arabia. And Iran wants to get the oil. Look, now they're taking over Iraq. They're taking over Yemen. They don't really want Yemen but they like the border because they want to take over the oil in Saudi Arabia. So, I'm really good at this stuff. You know, it's sort of amazing. These guys don't give you credit because they'll give you like a quarter of a sentence. So here's what they did. So, the question was asked about Japan. I said look, you always have to be prepared to walk. If you can't say you're going to walk, you can't make a good deal, OK? It's called The Art of the deal, right? John Kerry should have walked at least two to three times with Iran. When they say, when John Kerry went to Iran, when John Kerry went to Iran, he should have said you have to release our prisoners before we start talking. And they would have said no, and then, he should have walked, doubled up the sanctions, and within 24 hours, he would have gotten a phone call. Come on back we're releasing the prisoners and that would have been four years ago, OK? That's what would have happened. But this guy never walked. He never walked. They abused him mentally. They abused him like he was a child. They took advantage of him like he was a baby. They made an unbelievable deal for themselves. We got nothing. And on top of it, we now have a President that say, it's not good what they are doing. And that just happened today and I -- it's so embarrassing. How we have this man as a President is so embarrassing. He is now after just a short while, in the meantime, they've taken much of the money, the $150 billion. They've taken the money. They've spent a lot of the money in Italy and all over Europe, in Russia. Do you know what they're doing with Russia? They're buying missiles. And we have Obama, today for the first time, he said he's not happy. He's not happy with Iran. He didn't say it as strong as he should. But the real truth is they're in default. They are in total default. The problem is, the money is gone. Oh, it's -- I wish -- oh, the $150 billion. Now you know I've said a number of times what I would have done with that, right? The $150 billion? First, I would have gotten our prisoners back. I would have said listen, we got to before we start negotiating, fellas, you got to do this. The prisoners have to come back. They'll say no. I'll say bye-bye. You get up, you leave. Then you double up the sanctions. They'll call you. They'll say, you have your prisoners tomorrow. Thank you very much. OK. Now you go back in. Now just do one other thing. You only want to walk a couple of times. You know you don't want to keep walking, too much work, right? Now you say one more thing. Listen, listen, the $150 billion, we have no money. We owe $19 trillion soon to be $21 trillion. We have no money. We can't pay. They'll go crazy after a week or so. They'll be OK with it. We saved the $150 billion, OK? That's what we have to do. That's what we have to do. On top of it, the deal is no good. How would you like to make a deal when during the deal, they're over in Iran celebrating in the streets, burning the American flag, and screaming about how stupid we are that this deal is so good and we just keep going. But the greatest was today. And I hate to say it. I mean, I wish Obama didn't even say it. It must have been hard for him to say it. The man is incompetent, OK? He's incompetent and it's sad to see. I mean, here's the deal that's a few weeks old literally, and he's out there now saying, he's upset with them and anybody in their right mind would have known what he was getting into. He has no idea. He has no idea what's happening. And then today, they talk to him about Trump, about nuclear weapons. He said, well obviously, he doesn't know about nuclear weapons. I know more about nuclear weapons and he'll never know. I know what's going -- I know what's right and wrong. So, here's what happens. So I said Japan, they said, now you have a maniac with nuclear weapons. He doesn't have a carrier system but he's got nuclear weapons, right? And that's North Korea. And you have South Korea that's really, you know, we're defending them. We're not getting what we should get and we're losing a fortune but we're defending them. We're defending Japan. We're defending Germany and all these countries. So with Japan, I'd say look, fellas, you got to pay up. We love you. We're your friends. We want to take care of you and that would be my first. And we might even walk once or twice but that would be my first. And we'll also be prepared maybe it's better to let them defend themselves because we cannot afford to defend all these people, the world, the whole world, the whole world. -- and we'll defend them and all that stuff because it's good because, you know, nuclear is a big problem. I don't want to see nuclear all over the place but already, if you think about it, ISIS probably wants -- we got to knock the hell out of them fast by the way. We have no choice. We have no choice. You know, ISIS. I don't want to go into Iraq but now with ISIS you have no choice, cutting off the heads and drowning people. This is a group of people that we have to beat them fast. Can you imagine we have a military? Can you imagine? I always say because I was a big fan of General Douglas MacArthur. I was a big fan of General George Patton. These were tough cookies. These were smart tough guys. These were Vince Lombardi's of that world, OK? And these were tough. Could you imagine telling General Patton about ISIS that we can't beat ISIS? He'd have them knocked out in a week. I mean, literally, it would be over in a week. This is crazy. What's going on is crazy. And let me tell you. They get a nuke or they get a weapon of destruction. I don't want to say what I'm saying here. If they get a weapon of mass destruction, they won't even think about it. They wouldn't even think about it. We got to knock them off fast. We can't play games. We can't play games. Because the single biggest problem we have is nuclear. The single biggest problem this world has, frankly, is nuclear. This is no more little, you know, we're going to ship. We have an army, two different uniforms, they have their M1 rifles and they're shooting each other. This isn't -- we're not in that anymore. We're into weapon -- -- with each other. Because frankly, what's going on over there is disgraceful. But we can't allow this to happen. And you know, I don't know if you know this story, but they cut the Christians' heads off and they cut others. But if you're Christian, boom, your head comes off and if you are a Christian from Syria it was -- this is during the old days, five years ago. If you were a Christian from Syria you couldn't get into this country. It was almost impossible. If you were a Muslim from Syria, no problem, it was one of the easiest places to come into the United States if you were a Muslim from Syria. But if you were Christian from Syria and they're the ones that needed the protection, much more so, you couldn't get into this country. So you think maybe something's going on that's not so good, all right? That's not so good. So, I talked about Japan and I talked about many aspects of it. I talked about the business debt. If we left Saudi Arabia, it would be, it would be, a terrible thing would happen to them. It'll be very fast. Nobody's going to attack them now because we're protecting them. Now here's what will happen and they're great negotiators too. If we left, we would say you got to pay which is a fortune by the way. You've got to pay. It doesn't matter. They have so much money. They have funds that are so big they don't know what to do with all their money. I know. Their funds are the biggest funds among the biggest funds in the world. They have so much money. Money is the thing they don't worry about, money and oil. What they worry about is how long will they keep it, OK? So, what you do is you negotiate. You're going to leave. You're going to leave. You have to be prepared to leave. Otherwise, you can't make a good deal. See we're not prepared to leave. We weren't prepared to leave the negotiations with Iran. If Kerry would have gotten up and said we're leaving and been tough. We would have made a much better deal, much better deal. I mean, we made one of the worst deals ever. Basically, they got $150 billion and that's it. And they'll have nuclear weapons and everything else and you know it's so, so bad. So, we have to be prepared to leave. We have to be prepared to leave Japan. We have to say, I'm sorry, we can't do that deal and it's possible we won't get back. And it's possible they will arm and they will then, you know, well, have to take this guy, and they'll have to deal with them. We don't have to deal with them, OK? Is that so bad? No, ideally that doesn't happen. Ideally, they're going to pay and they're going to pay a lot and we'll be good because I don't love them arming. But you know there's a point at which we just can't do it. When our infrastructure is dying, when our country is dying, when our airports are like hell. I go to Qatar, I go to Dubai, you go to China, different places, you go to places. They have airports the likes of which you've never ever, ever, ever seen. Then, I land at La Guardia there are potholes all over the place. The places is like a third world airport or Kennedy or LAX or Newark. You look at these airports, they're like from a different time. It's like a time -- it's like a time warp. They're third world. But you go to some of these -- my pilot lands at Dubai. He said, oh, Mr, Trump, that was the most incredible thing I've ever seen. The runways twice as long as anything he's ever seen like a piece of glass. And we land at La Guardia, huh. What's wrong? Are we OK? We're stupid. We have stupid people leading our country. So what I said, I talked about the economics that I talked about this. I also said I'd rather not see Japan armed but if they have to that's OK. You always have to be prepared for that and it is a possibility they would be able to arm because we may leave. Because we just can't afford to be the policeman of the world and lose all of this tremendous amount of money. And it's possible that we're going to have to let NATO go because, you know, nobody's paying up. I mean, when we're paying and nobody else is really paying, a couple of countries are up, but nobody else is really paying. You feel like, you feel like the jerk. One of the things I do early on, I'd call up all of those countries. I need to get myself Carl Icahn or somebody else that's very good at this stuff, OK. I call him up and say, fellas, you haven't paid for years. Give us the money or get the hell out. Get out. You haven't paid for years. They have agreements. They have agreements. It's all agreements and they haven't paid for years. I'd say you've got to pay us or get out. You're out, out, out and I'll be nice to them. I'll be a little softer than those and say I'm sorry but you're no longer NATO. And maybe, NATO will dissolve and that's OK. Not the worst thing in the world. But I'm telling you, NATO experts are saying, this guy Trump has got -- they studied this so close to the situation that they never thought that it's obsolete. They're so close that they never realized that all these people don't pay and that we're like the big stupid sucker that's paying for NATO and we're paying for the United Nations. We're paying for the United Nations. You know many countries don't pay for the United Nations. They come in. They don't pay their bills it's the same thing because they think we're stupid and that's the end. How often do you see the nation -- United Nations settle anything. You don't see them ever. I mean, things are settled. You know it used to be where the United Nations would be involved but they're not really involved anymore. Do they ever settle anything?? It's like, you know what it's like, it's a political club. I could tell you so many stories. I would've built their building for billions of dollars less money. I told them. When they renovated the United Nations, I was before the United States Senate, and I told them that I would build that building for billions less. And they said, no, we want to build it ourselves. Not only did it cost more but it cost much more than even they said. And they said, well, but what would be the difference? I said for billions of less and it would be much better. I'll use marble. You're going to use linoleum. I really mean it too. They didn't have any idea what they were doing and they're thieves and crooks. And you know to think it'd cost billions of dollars to renovate, to renovate a building cost billions. How many guys are in the real estate business or construction, right? You are. You are? Wow. Huh. Never seen a real estate person that looked like that. Very good. Beautiful. So, so I would have done -- I would have saved him billions, they don't want it. Senator Sessions remembered the meeting we had years ago at the United Nations, six, seven years ago. I built a building across the street for $360 million. Everyone's now looking over that guy. Do you see that? You'll be gone -- you'll be famous. But you know, I built a building for $360 million right across the street from the United Nations and the Ambassador from Sweden called and he said, how could your building -- 92 stories, how could your building cost $360 million and we're spending billions to renovate a building that's 35 stories tall? I say, well, number one, lack of knowledge. Number two, everyone's a crook over there. They made a fortune, he said but we're going to spend $1.5 billion. He said to me we're going to spend $1.5 billion. I said no, no, no, you're not going to. But you got to spend $3 billion or $4 billion by the time they're finished with you. And I was right. I'm really good at this stuff, OK? Of course billions, $3.5 billion, $4 billion. It costs so much money and it was such a bad job, such a bad job. They used floors. They used the Rasa -- really just a terrible, terrible, terrible job. Somebody made so much money. Somebody made so much. It's so sad. And we pay largely the bills. So, the United Nations is another one and there are so many others. So here's what I'm doing. I'm going to bring our jobs back. I'm going to bring them back to Wisconsin. I'm going to bring our jobs back. I'm not going to let our companies leave. And I tell the story. You know Carrier I tell all the time. I love the Carrier story because it's so obvious. Two months ago, they announced they're leaving the United States. They're moving to Mexico. I said, oh, that's all right. Moving to Mexico just like that, 1,400 people gone, great jobs. They did a great job for 30 years. They did a great job making air conditioners these people. Now they're wiped out. So, the Conservative dopes, you know, the guys from the National Review and these dopey people. They think, oh, we're conservative. Well, I'm more conservative than them on virtually every subject but on trade I'm a free trader. But you can only be a free trader if your leaders are smart. If your leaders are stupid, you can't be a free trader because they're going to, you know, do numbers on us. So Carrier is leaving. So Carrier said they're moving in Mexico. That's great. So I tell the story all the time. I call up Gary. I say listen here's the story, meaning I or one of my people that I have all the best people, right? I call up, say Mr. President, and my wife wouldn't let me call Carrier because she says it's not Presidential. I'm not supposed to be calling as President an air conditioning company but I'll do it anyway. It's so easy. It's just five minutes, darling. I love doing it. I love it. And I said, oh listen, good luck with your plant. I hope you do really well. I hope you sell lots of air conditioners. But now we have a real border. You know we have a real, real border and every air conditioner that comes into the United States, you're going to pay a 35% tax on that air conditioner, OK? And because I'm not Ted Cruz who's controlled by his lobbyists and special interests and they'll find the lobbyist that says Cruz. You know it's blazing into his forehead. The lobbyist, it'll say Cruz. In other words, he takes care of Cruz. Another one takes care of Hillary. Another one takes care of Kasich. Another one takes -- you know that's what it is, folks. These are people, they're really smart, really good, they raised millions of dollars for these guys. Look at their PACs they have all this money. They have PACs. I put up my own money it's so stupid. I don't think I get any credit for it really. I feel so stupid. My whole life I've taken you know. I take, I keep taking, taking and now I'm telling people they want to give you $10 million. One guy, Donald, I want to give you $10 million. I say, this is so foreign to me. It's like, I say, I can't take it. He goes what? He doesn't -- he says, of course, you can take it. I said I can't. Another guy wants to give me $5 million. I'm turning down all this money, all of this money, and my whole life has been the opposite. I take, take, take, and I say it I take. I keep taking. But now I'm going to take for you. I'm going to take for the United States. I'm going to take. I'm going to take. But these lobbyists, these lobbyists, these lobbyists, have total control over these people. And they'll go to Cruz and they'll say, no, you have to do this, you have to do that. So if Cruz is -- number one he wouldn't make the call because it's up from even making the call because it would never happen. With me, I'll have people call us saying, hey, you know what? You didn't give me anything. I'm not doing anything. I just want to do what's right. The only people I'm working for, you. Believe me. Believe me. Believe me. I don't need money. I don't want your money. I want you to vote on Tuesday. That's all I want you to do. The only thing. And I've told the story and this is true for Ford and it's true for Nabisco. I'm just using Carrier as an example but it's true for all these country -- companies. So look, here's what happens. So call, I say call me back. He'll call me back. I will have been approached by lobbyists, by special interest groups. I will have been approached by everybody. I'll say call me back. He'll call me back within 24 hours he'll say, Mr. President, we're staying in the United States. That's what's going to happen, 100%, 100%, 100%. Now, I guarantee you that nobody from the United States ever called Carrier Corporation. Nobody from the United States ever put pressure on Ford that we can't do this. You can't build a $2.5 billion plant in Mexico we got to keep you in the United States. Nobody ever told Nabisco that you can't move your factory from Chicago into Mexico. Nobody ever said that. Nobody told Pfizer you can't move to Ireland. You know Pfizer, great pharmaceutical company, 6,000 jobs, the best jobs. They're leaving the United States. They're going to move to Ireland which is great. I have a lot of property over in Ireland. But you know what are you going to do? But they're moving to Ireland. Nobody ever -- did anybody talk to them? Negotiate with them? Nobody talks. They leave thousands of jobs, gone. Me, I'm going to talk to them. Me, when they send their product in, believe me, their product doesn't get freebies anymore. There's no more freebies. And all these politicians because they're all taken care of. They're all taken care of through campaign contributions all of them and probably other ways. But I don't want to talk about that. But they're all taken care of, right? And they don't do anything to keep these people because they're told you can't. Pfizer has some of the greatest lobbyists in the world so they get left alone. But let me tell you when they send their products in, if they had to pay a fee, a tax, you know, China would call it a tax. China would call it a tariff because it sounds like a little better. You know I have a friend who's a great manufacturer, great, great manufacturer. He calls me all the time and says I can't do business in China. You can't get your product in there. They don't want it. They don't want anything made in this country. You know we talk about free trade. That's why I talk about these stupid people. They say they're conservatives. Do you remember Jeb? He is not a conservative. He is not a conservative. It's so sad. Bye-bye Jeb. Bye-bye. But these are the people we have. I mean, Scott Walker, he was number one, he came out, the future of the Republican Party. No one comes out. He goes to number one and then I start attacking him. He goes -- he leaves the race. Who do you want as your President? I mean, in all fairness, OK? And you know what? I wouldn't be hitting him. I wouldn't be hitting him. But number one, he hasn't done a great job. Number two, there's nothing but turmoil. If you are outside of Wisconsin, you take a look at the turmoil, it's always turmoil, and you know what? I'd get a better result without the turmoil. You know there's nothing wrong with no turmoil. But I'll tell you what, the numbers aren't good. But Scott Walker comes out. He was going to be number one. He started off as number one. Jeb started off at number one. I like, all these guys were going to be number one. Finally, they said Trump is number one, OK? It took a long time. It took them a long time to realize it, right? We had Rand Paul. We had Walker. We had Jeb. We had all of these people that were going to be -- I mean, Marco was -- look Marco is the future of the Republican Party. He's a nice guy. LIL, no, Marco was going to be the future of the -- and I beat him almost by 20 points, by like 20 points in Florida but soon they'll say, Trump, is the future of the Republican Party. You watch. You watch. But here's, here's what we have to do. We're going to make great trade deals. We're going to make so much money. We're going to bring our jobs back from China. We're going to bring our jobs back from Mexico. We're not going to lose our manufacturing anymore. These numbers and these numbers that you have right here, look at this chart, I mean, this chart is incredible. Look, U.S. manufacturing jobs since 2000. Do you see what that says? Do you see the line? You have to see what it says. Do you see the line? Slightly. If we keep going we're going to have nothing. I'm telling you there'll be nothing left. Look at that. Can you see that? I didn't exactly do this and be so proud of this country. We're going to build up our military. We're going to knock out ISIS. We're going to take care of our vets. We're going to have a strong border. We're going to have a great wall that Mexico is going to pay for. We're going to get rid of Common Core. We're going to have local education. We're going to repeal and replace that horrible, horrible Obamacare. And I'll tell you, look, I'll tell you here's a story. So it's sort of like you know, why do you do it? I didn't need this. I didn't need this although I enjoy it because we have a movement going. You look at Time Magazine, there's a movement. This isn't like a normal thing. This isn't -- this probably never happened before. Millions and millions of votes. Now, the Republican Party, they view me as you know a guy. They don't want me because I don't want money. I don't want their money. I don't want the lobbyist money. I don't want -- all these people, they're going to be saying, like, you know, we can't get to Trump because it's a crooked system. We can't get to Trump. So I get all these people against me. That's why it's important that I win. I don't want to go in there looking at the second ballot because it's probably, you know, with the way, the thing is, it's crooked as hell. Hey, look. What happens? What happens? I win the state of Louisiana, OK? Now, I'm a little bit younger then because it was a couple of months ago. I learned, I learned. I go in I made speeches. I had a speech the final night of this massive hanger. I pull up my plane. I get out of my plane, thousands and thousands of people in Louisiana. Great place, great people. I go into Louisiana. I make a speech. I make another speech. I'm all over. The election and gets held. I win. Donald Trump wins the state of Louisiana, right? That's the good news. The bad news is because it's a -- I don't want to. Should I use the word crooked system? Crooked? The bad news is because it's a certain type of system. I win the state. I get thousands of more votes than Cruz. Thousands. I got fewer delegates than him. So I said think of it. So I said wait a minute because I'm looking at the delegates. I said wait, wait, why does he have more delegates than me? I won the state. I won the state. By the way, I just won Missouri, by the way, I'm sure you -- but I win Louisiana. I'm speaking in front of thousands of people for a week. I win and I get fewer delegates than he's got, OK? It's not fair, folks. It's not fair because I'm the outsider. And what they do is they want to knock out the outsider because they want to keep their little party going. And the reason our country owes $21 trillion, soon $21 trillion not billion, trillion dollars, OK? The reason we owe all of this money is because of this system. So here's what we got to do. We're going to win so much. What you have to do is go out and vote. Get every person you know. You can cross lines. If you're a Democrat, if you're Independent, if you're, you know, the people that are voting for me a lot, people that never voted before. We have a huge -- I never realized. When I do, you know, the scrum, I do the signing. I do whatever. You know I shake hands with people. So many people say, Mr. Trump, I mean, they're 30, 40, 50, 60, one woman is 93 years old from Tennessee. Like this great woman, beautiful woman, she's incredible. She's going to vote for the first time and she voted for the first time because I won the state of Tennessee. I mean, I'm winning all these states. But, but -- won Alabama, won Arkansas. I mean, we win these incredible states. In fact, I did so well in the South. Don't forget, lying Ted Cruz was supposed to win the South, right? Lying and Ted, he's going to win the South. I will win the South. I win Alabama. I won Florida. I won everything. I won everything. And the Evangelicals, they know he's a liar and Evangelicals like me and Evangelicals don't like liars. They don't like lying Ted. And I won all these Evangelical places which I fully understand. I have a great relationship there. So here's the story. You are going to remember this evening and you are going to say that this was one of the great evenings of your life. And more importantly, on Tuesday, you're going to say it was the greatest vote you've ever cast because you're going to be really proud of your President and you're going to be so proud of your country again. We're not going to have a President that said, oh gee, I shouldn't have done the deal with Iran because it's not working out two weeks after. I mean, the ink isn't even dry. I told him it wasn't going to work out. That's what I do. I'm so good at this stuff. I'm so good. Remember I said keep the oil, right? Keep the oil. There. We're there, don't leave. Keep the oil surrounded. Keep it. We didn't keep it. ISIS now has Libya's oil. Why aren't we doing a blockade? Why aren't we doing a blockade? ISIS has the Libyan oil. Hillary Clinton, let's free Libya. Benghazi, the Ambassador killed, her friend, OK? Keep the oil. Why aren't we doing blockades? So many things so here's the story. You're going to be so proud of your President. You're going to be so proud of your country. You're going to be so proud of your country. You're going to love your country so much. You love it anyway. But you're so disappointed at it right now and you're so disappointed in the leaders. You're going to view tonight as very important. You're going to view Tuesday as very, very important. Here's what's going to happen. We're going to start winning again. We're going to win on trade. We're going to win with our military. We're going to knock the hell out of ISIS. We're going to win for our vets. We've got to take care of our vets. We're going to win at the border. People come in but they've got to come in legally, right? Legally. They come in through a legal system and we get to win in every aspect. And you're going to say that was a great day when I voted for Donald Trump. So, folks, I want to thank you. So important, winning Wisconsin. If we win Wisconsin I think it's over. If I don't win it, if I don't win it, I don't think it's -- I think, you know, we have a good chance because we're way up in New York, way up in New Jersey, way up in Pennsylvania. But I want Wisconsin to win it for me, OK? So go out and vote on Tuesday and I promise you, you will be so proud of this country again. Thank you, everybody. Thank you. I love you. Thank you. Thank you, everybody."}