{"id":417,"author":"Donald Trump","title":"Speech: Donald Trump Holds a Town Hall Event in Rothschild, WI","date":"2016-04-02","link":"https://factba.se/transcript/donald-trump-speech-rothschild-wi-april-2-2016","paragraphs":["Thank you so much, everybody. And Sarah, thank you very much. She is -- is she great. How good is she? She's a special -- oh, there's a lot of people here. Thank you very much, Sarah. We landed. That snow is pouring in. It was so beautiful. In fact, I thought we were landing in Alaska. I was going to tell Sarah.","We've got you home in Alaska. This is beautiful and I want to thank everybody, such an incredible turnout. We've had really amazing turnouts. And we're doing so well and we're so proud of it. And we love Wisconsin, it's a special place, and I think we're going to do really well. I think we're going to do really well, really well.","Look at these young people. You know something I said on the way up and I was saying it before that I'm self-funding my campaign. I'm putting up my own money. I don't know if it's worth it. I'll let you know in about a year from now or less. But I think it means a lot. And the reason is, all of these people that I'm running against, and that includes the Republicans and the Democrats, they're not doing it the way I'm doing it. When Hillary gets money from the oil industry and all the other industries, when the case it gets money from the people he's getting money, they totally control him.","Believe me. When Cruz, lying Ted, when he gets money. Believe me lying Ted, bible, bible. He lies. I never saw a guy lie like him. I've met a lot tougher than him but I've never seen anyone lie like lying Ted. But you know, but when he -- when he gets money from the banks and he gets money from oil and gas, and he gets money from everything.","Believe me, they have him, folks. They have him. I get money from me. I really am here for one reason to represent you, to represent you, believe me. And it's -- it's so great. When I come to places and I like the little thing in the round. I told my people they said let's keep them smaller because you know we had protesters, right?","So they said let's keep them smaller. This way, we can check everybody that comes in. I said, yeah, but I like the big, I like the big. You know we have 5,000 -- where's the mall here? where's the mall? We have 5,000 people in the mall. So I told my people enough with this stuff. Let them have protesters, who cares, right?","Who cares? We have 5,000 people on the other side of the wall. And I feel so guilty. We love you. Let's all say we love you over there. But you wouldn't swap seats I guarantee you that. So -- and I hope you can hear well back there. Can you hear well? Everyone? Good.","Thank you. And can the mall hear well? Let's see if we can hear -- can the mall hear well? I think they can hear well. I hope they can. Anyway, this is amazing. So look, I'm doing this to Make America Great Again. That's our theme. All these hats, look at all these hats, but we're doing this.","We're doing this to make -- look at that guy, stand up, look at this guy. Do I look like that? Can you believe it? Can you believe it? Look at that car. All right. Well, I think it looks great. I like it. Good job. But you know it's a simple -- it really is. It's a simple, beautiful theme. Make America Great Again.","We have so many problems. We're doing so poorly, far worse than you understand. And in Wisconsin, you know, I know the numbers. The Governor gave me a plaque a year ago when he thought I liked him and I do he's a nice person. He's a doing -- he came up to my office, he gave me a plaque. I bet he wished he had that one to do over again, right?","I think I have to show that plaque before I leave, right? I keep saying no, no, let's not bring it -- I should have brought it for this group. But I'll do it somewhere before the time I leave. I'm going to be here right until the end. We're going to be here right until election and I think it's going to be an amazing couple of days.","And I can tell you, I think, we're going to win. I really do. I think we're going to win. I think, I think that people are going to be surprised at how well I see the kind of outpouring we've had and somebody else, I won't mention the name, was here not so long ago, and they had 300 people, and we have 5,000 out there, and what?","Thousands in here. I don't know what it is a couple of thousand at least. So I think we're good -- it's more than 2,000 even, right? So I think we're going to win and I think we're going to win maybe substantially. But let's just see what happens. But I know one thing, I know one thing, we're going to do well.","But you know, well does it mean anything, right? You know Vince Lombardi, right? You -- did you ever hear of a man named Vince Lombardi? Huh? In this neck of the woods, did you ever hear the great Vince Lombardi? So you know what? You -- OK. What did he say about winning? Right? Right. He knows. He's a plays -- he's a fan.","I met Vince Lombardi once, I mean a number of times, but I met him once, and he was three -- with three of his players. I was a very young guy. It was at a restaurant and these three players were tough, tough cookies. I better not mention their names and two of them are friends of mine and they played for your team.","And I'll tell you they were great players. And Vince Lombardi was not a big guy and he walked in and he was angry and he was just so angry you could see. And he was -- he came over to the table and he saw these three big guys. They were like twice his size. They could have swatted him and he looked at them.","I won't tell you what he did because he actually grabbed one by the shirt but I won't say that. See, today you're not allowed to do that, right? And then he left. He gave them a little bit of an earful and then he left. And I want to tell you, this big strong friend of mine, he weighed like 250 then which 250 then is big.","That's like 310 now, right? This was a long time ago and he left, stormed out and this guy was sitting here shaking. And I said, you know, I said to myself, the reason that Vince was able -- and I had great respect for him as a coach, and I love Bill Belichick, I love -- there are certain people you have to respect, these coaches, right?","They have to respect and I said it at one of my other meetings. Tom Brady's a friend of mine. He thinks your quarterback is great, OK? Nice, right? Do you think he's great too? Do you think your quarterback is great, right? So Tom told me that. So I think that's a nice thing to say. But Vince Lombardi, the reason he got away with it is winning.","He won. If he didn't win he couldn't get away with it. If he didn't win he wouldn't be able to get that kind of almost fear, but respect, but fear from big, strong, powerful players. But he won. By that time he had won many times and the respect that they had for him was incredible. Now, we don't win. The United States doesn't win anymore.","We don't win a war. We can't beat ISIS. We don't win a trade. China's cleaning our clock. Mexico, they laugh at us. They think we're all stupid because our leaders do such stupid things. Mexico, Japan, Vietnam, India any nation, name a nation, they do well. Name a nation, doesn't make any difference, and they do well, and more and more I think about it, the more I realize, they do well for a very specific reason.","Not that the politicians are so stupid and many of them are but many of them aren't. But because the politicians take tremendous campaign contributions from people representing certain other parts of the world or certain companies that are involved in certain other parts of the world and they do things that are not in your best interests.","So when I say I'm self-funding, I don't take money. I have turned down more money. I'll bet that any human being has ever turned down for a political run. I mean, it has to be because frankly, everybody takes money. When you think of it, not a big deal because everybody takes money for years, probably. I don't know, I may be wrong about this.","I would -- I would say the only one would be Ross Perot, right? Many years ago, that was a long time ago, but he didn't take money. But I have turned down so much. People coming up, $10 million. Donald, we want to give you $10 million for your campaign. We want to give you $5 million, $2 million, $1 million.","Jeb Bush raised $148 million or so. I would have done that times five. And honestly, and I said coming up, I don't know if I get credit for it. Honestly, I don't know. Nobody's going in saying, you know, I like Trump and I like Cruz which is really not even a fair comparison, folks. I'm so much better. I will do so much better job.","I will do so much better. Not, not even close but I will do so much better. You know why? Because I'm working for you. They're not working for you. They talk about working for you but they're not working for you. They're working for their next election. They're working for campaign contributions. Who knows what else they take?","And I don't care. I mean, that's not my business, right? It's your business. But who knows what else they work for? But they're working at a minimum for campaign contributions. And I say it all the time, people come up to me, our leaders are so stupid, our politicians are so stupid. Why would they make deals like that?","Why would they do this deal or that deal? There was a deal recently, a company made this incredible deal, and the politicians approved it. And people say, oh, our politicians are so stupid. Well, they're not so stupid. Those people are represented by the smartest people you've ever seen. Special interest groups, lobbyists, I mean, some of these guys they have like one there -- it says Cruz, right on -- the lobbyists.","It's tattooed right on their forehead. I can deal with Cruz. They raise a lot of money for them. And when they go in they need a vote. No, I'm not going to vote for that. No, no, you have to. They gave you $2 million for your campaign when nobody else would put up the money. Hey, do I know the system better than anybody ever in history?","I mean, you know, I was on June 16th -- I only started this political stuff on June 16th before that I mean, I was a very big contributor. It's a system. It's the system. It's not good but it's the system, it's what we have. But you have guys with its -- it's blazing -- Hillary. It says Hillary on that guy's forehead.","They -- it's like a branding iron, right? You go to him, you want Hillary. You go to another guy if you want Kasich. You go to another guy if you want Cruz. By the way, 100%, 100%, now, they won't always get what they want. Maybe only 90%, you know, there's some things you can't do but they get what they want a lot.","They're tremendous professionals. So what they do is they're very good at it. So when I'm self-funding I hope people appreciate it because it means a lot. I mean, it means a lot. It means I don't owe anybody anything. I don't owe them. I don't owe them. I said on the way up, you know so far, I've invested $35 million, maybe $40 million.","I don't know. Something like that. My money, my money and you know what? It has no impact on me which is -- lucky. I built a great company. By the way, you saw I filed, I built an amazing company, tremendous cash flow, some of the greatest assets in the world, worth over $10 billion and I started with really just a very, very small loan and built a great company.","Some of the great, great assets, tremendously low debt. And the reason I tell you that is that's the kind of thinking we need in our country to solve many of our problems. Many because folks, and they have all those cameras back there, we are right now sitting on a bubble that's going to explode and it's going to be a real bad situation.","And we better get rid of the debt and we better straighten ourselves out because we have debt on debt on debt. And one of the things -- we're going to talk about a few of those things because it affects you very much and I know you have a lot of small business owners here. Probably a couple of big business owners here but we have to get rid of it. We're going to start with Obamacare too.","Obamacare is a killer for you and for the country. It's a killer. Obamacare is too expensive for the country to afford and it doesn't work. By the way, for you, it doesn't work, for anybody. You go 45%, 55% increases this year, people are telling me they've never seen anything like it. It falls. It closes up, Obamacare in the year '17 will close up. We can't make it. So when you have it just remember, it's no good anyway, but we'll terminate it far before that and we will end up with a great, great healthcare plan that will cost you less money, and be much, much better.","I love these young kids. Look at these beautiful kids. They're going crazy. They're clapping about Obamacare. They don't know what Obamacare is, but hopefully, they won't need any healthcare for 40 years, OK? So you know, but they're still very enthusiastic, right? Great, kids. Great. They don't like Obamacare.","Hopefully, they don't have to worry. They don't have to worry about healthcare. But ultimately, they do have to worry about the costs because the cost is unbearable by the country. The kind of money that we're talking about is unbearable. OK. So we start with that. We're going to bring Common Core. We're going to end it. We're going to bring education local, right?","We're going to protect our Second Amendment. We're going to do all the things that you've heard me saying, all of them. But here's what I wanted to talk to you about because we're going to talk down big, big, big numbers, right? When you have $19 trillion, fellows. We can't talk peanuts, right? We can't talk like the little stuff.","There's going to be tremendous fraud waste abuse. We'll cut things that you won't even believe, OK? We're going to save you Social Security as is. We're going to cut all of the waste and all of the fraud. You don't mind cutting the fraud out, right? There's plenty of it. We're going to take care of your vets and we're going to build a military bigger, stronger, better than ever before.","Beautiful. Great. That's -- isn't that great? When you see young people like that, that's so great. Oh, they're going to be very successful. Don't forget they're after our jobs pretty soon. Hey, the problem is we're losing all our jobs. They have no choice. They have to take it away from us. That's all right.","You'll treat us nicely though, right? You'll treat us -- that's the next Trump. Bigger and better than Trump. Not even a contest. Good luck, kids. We think it's fantastic. What about the one in the middle? You're going to be the most successful of them all, huh? Beautiful. Great. Great job. That's what we love to see.","That's what we're fighting for. My daughter Ivanka just had a beautiful, beautiful son. And ultimately, that's what we fight for that and the grandchildren and all that. We're going to and we're going to turn this thing around. We're going to turn around fast. So let's talk about a couple of things that are big dollars.","So we are the police department for the entire world, and the entire world, many of these places that we're taking care of are very, very rich. We take care of Saudi Arabia. They made $1 billion a day when the oil prices were up. Now, they make a little less, OK, big deal. What? And the imports. He's right.","He's right. You never know. Is that a protester or is he on our side? You're right though. But we take care of Saudi Arabia. Now, nobody's going to mess with Saudi Arabia because we're watching them. They're the richest, one of the richest, I mean, they have a fund that' so big nobody's ever seen a fund like that, right?","They have oil pouring out of the ground. They have very high oil, very high-quality oil. They have very expensive oil and they have very cheap oil to get. So they make nothing but money. If it weren't for us they wouldn't be there very long. And I do business with the Saudis, they're good people, they're fine.","Everyone's fine but we're losing a fortune, OK? And if we had a person like me, like a few people in this room, maybe some, not all, right? We have to know our strengths and our weaknesses. But you have some people in the room would be -- do a great job. You have other people that wouldn't do so good. They do like the people that we have right now.","Nobody could do worse. That's the only thing I will say. So we're protecting Saudi Arabia. They're not paying us a fair price. We're losing our shirt, OK? You know, we have military bases that we pay rent on? Why, why are we paying rent? We're protecting and we're renting land and we're paying. Why are we paying rent?","Why do we have any rent? But we -- I'm not even talking about rent. I'm talking and that's big numbers but I'm talking about really big numbers. So Japan great country. They make the cars, they sell them. You know, we have an imbalance with Japan like you wouldn't believe. Billions and billions of dollars.","They sell us cars. We sell them practically nothing by comparison. They call it a trade imbalance. They're like up here, we're like down here, OK? One of the great imbalances of all time. I was in Los Angeles, I see these massive ships come in. It's like NASCAR. You know, by the way, the owner of NASCAR and a lot of the drivers they endorse Trump.","You know about that, right? We love NASCAR. I love NASCAR. Brian France, the great Brian France. And they do a great job. Thank you, man. They do a great job but they endorse. Brian came up he said, I want to endorse you for President. I said, boy that's cool and he did it like in North Carolina. A good place to endorse, right?","North or South. And it wouldn't be bad up here either but we have it. And we have so many, not only Sarah, we have Jerry Falwell, Jr., from Liberty University. We have Joe from Arizona, Sheriff Joe. How about Sheriff Joe? OK? Chris Christie has been fantastic. He's been great. We have Dr. Ben Carson who has been amazing.","He's been amazing. What a great guy. And we have so many others. We have Congressman now. Senator Jeff Sessions, one of the most respected people in the United States Senate, who Cruz thought he had. Cruz kept talking about Session, session, and you know, he'd say Sessions, Senator Sessions, and then Senator Sessions announced about two months ago, he's endorsing Trump.","And all of a sudden, Cruz doesn't talk about him so much anymore, I guess. But look, whether it's even the young kids with it. But -- so a lot of things are going to happen. So one thing we're going to do is the military. So we're like the policeman to the world, right? And that's fine. That's fine and everything's good.","But these are really, really wealthy countries. None as very powerful because we protect them and that's OK that we protect. They got to pay us, folks. And you know what? When they start paying us and then we do good trade deals, and then we do -- this country's already turned around, it's turned around.","Because we're talking big, big dollars. And lying Ted can't do it. He can't. In all fairness, number one, they're going to find out he's a liar. They're not going to trust him, OK? But he can't. You know the Evangelicals they're with me. The Evangelicals. Remember South Carolina that was going to be Ted, lying Ted was going to win that one easy because the Evangelicals, I think it's 68% Evangelical, right?","I think you guys are only 28%. Let's get going, start going to church a little bit more. Go to church. There are the ones I want to get going. Go -- do you go to church on Sundays? Any time you can go. Do you go to church? OK, good. But 68% Evangelical so he was going to win. I won in a landslide. We won North and we won everything.","I mean, we've won so much. In fact, just to show you. So Ted, during one of the debates, did you see it? I'm the only one that can beat Donald Trump. I've done it many times. I've beaten him like five times, six times, what I -- I beat him five times and he's screaming at the top of his lungs you know. He wished he had the Bible in his hand but he didn't happen to have one for the debate.","But he picks up the Bible, puts it down, and then he lies. But he said I beaten him six times. So everyone's saying, oh well, that's great. And then I looked at him and said, yeah, but I've beaten you 22 times and do you remember the face? It's true. I've beaten you 22 times. I think, I think we have like 21 or 22 states already but this is an important one, by the way, you got to do me a favor, folks.","You got a vote. I will do such a good job for you. Do yourselves a favor. Don't do me -- you're probably doing me a favor if you don't vote for me. I'll go home. I'll relax. So many people have asked me the question. This morning I was interviewed by very good radio guy, not the whack job that interviewed me. His name is Sykes and a couple of them, oh, he's the worst.","You know what? Sure, there was actually a good interview but he only plays one little sentence, half a sentence. You know, listen to the whole interview. Everybody that listened to that show would vote for me. Believe me. And most people would say, oh, let's hang up now. Don't hang up. You take on the enemy.","You take them on. You absolutely take them on. But remember, but he's not a very talented guy. He's not a very smart guy. But the guy that interviewed me today was a smart cookie. Radio host, a big one, and national and he interviews me, and at the end he said, you know, we're on the phone, it's early Saturday morning, and I said just before I left for here I said, thank you very much.","He said Mr. Trump, can I ask you one final question? What? You're worth a fortune. You have a beautiful family. You can do anything you want. Why are you doing this? Why would you do this? And that question has been asked of me more than any other question other than student debt. When I'm around the students, I get tremendous, you know, they're choked up to here, and then they graduate, they can't get a job.","Well, I mean, it's a serious problem. But that question gets asked to me so much. And I said you know what? I've been so lucky in this country, I've done so well, I've made so much money and had such success, and enjoyed my life. And I have some hopefully, some really good years left and I want to give back to the country.","I just want to give something back. That's all it is. It's all it is. Thank you. And you know our theme Make America Great Again. Folks, we're going to make it so great. But here's what I want to explain. We always have a problem. It's a problem in translation because the press is so totally dishonest.","I mean, you have no idea. No, no, you have no idea. It's amazing how smart the people are. They added -- he said you got that right. Look, the people get it. They are really, really dishonest. They'll put like one-tenth of a sentence in. They'll cut you off and worse are cameras. You know, I always used to say, I love doing television because if you do television, it's that.","Well, then they show like a tiny piece of a clip. It's almost worse than the way they write. But the press is very dishonest. So let me just tell you what happened. So you know, NAFTA's been a total disaster, right? It's drained businesses. Well, now we have a new one called TPP, Trans-Pacific Partnership.","It is so bad. It's worse than NAFTA. It will -- it's worse than NAFTA. It will drain Wisconsin. It will drain the United States. We're doing it with various countries all put together, a 7,000-page document that I almost guarantee you nobody in our country has ever read. And those countries from Asia mostly, are all -- every word is like studied and analyzed and we just sign it. First of all, we shouldn't sign with 12 countries.","We should sign one, two, three, four, and we reward the good countries. This way, the bad countries come in, and they take advantage of the good countries. It's too complicated. It's a stupid deal. Ted Cruz is totally in favor of it because people want him to be in favor of it. Kasich who voted for NAFTA is in favor of it because people say you're going to vote for that deal.","You're in favor of it because they support him and he has no choice. And that deal is a horrible deal. And you have Liberals that want it. And you have Conservatives and then you have plenty of people in Congress that don't want it, OK? But those are the ones that are being honest. And the biggest single point of the deal is monetary manipulation, devaluation of the currency.","And that's how China and many other countries take the most advantage of is devaluation of their currency. They kill us. This year we're going to have a $500 billion trade deficit with China. Then, somebody will say, so look, I'm really a good businessman. I'm so good at business. Oh, you people are going to be so rich so fast you don't even -- you don't know how rich you're going to be. You're going to go from a debtor nation.","It's going to phew and you're going to say, wow, what happened? But look, look, you have Ted Cruz that refused to approve any language on devaluation. Any language on monetary manipulation. That's where they beat us, folks. They devalue their currency so much and then we see our dollar holding and going up. They want our dollar to go up, it sounds good.","But in the meantime, Komatsu is killing Caterpillar. In the meantime, China, look what they're doing. They're draining our businesses. Look at what's going on and look at what's going on with Mexico. Mexico is taking our business. It's not only for devaluation, for a lot of other reasons. The biggest is that our politicians don't know what the hell they're doing or contributions, OK? So look, look, we are going to change things and that's big money.","Those are trade deals. I have Carl Icahn, great, great businessman. We have the greatest businesspeople in the world in this country. We don't use them. We use political hacks, third rate political slobs to negotiate with the smartest people in China, the smartest people in Japan, and we have all the cards.","People don't realize it. Without our money, without this big pot of money that's being drained out of your pocket, and by the way, just -- I have to do this because I just feel I have to. I want to read you some statistics. You know, you're going to say, oh well, you're going to know about it. So where am I talking about?","20% of the manufacturing jobs have left since 2000. Do you know where that is? Wisconsin. According to the Journal, the Journal Sentinel, Wisconsin chronically logs -- Now, look at this. Wisconsin chronically lags the rest of the United States in job creation. That's not what you hear. Here's what happened with Scott Walker and I can only say this because I couldn't ask for his endorsement.","I mean what I did to that poor guy, man. No, what I did to him. And he's a nice person but who cares? I don't care if he's nice. I want to make the country rich and good again. OK. Chronically lags the rest of the United States. So remember when Scott announced, I'm running for President. I don't know, he was standing on a motorcycle or something.","He doesn't look like the bikers that are supporting me. I got to tell you. Every time I go someplace these bikers are all over the place. The bikers love me. Are any bikers in here? Right? The bikers love me and I've always liked the limousine. I've never quite gotten it but that's OK. Maybe I don't have the guts to ride those bikes.","But you know what? They're great people. I was at I think Hilton had one of the places and we had hundreds with close to probably, close to probably a thousand bikes. I said what's going on over here? In fact, I was a little bit concerned actually. They're tough cookies and they're out there waiting for hours.","I was making a speech to a group, a great group. I won the state big. It was incredible but they were -- it had to be a thousand bikes, mostly Harley's, in all fairness, we love Harley. I love Harley, right? But -- and I buy Wausau windows. Does anybody know Wausau? Wausau, Wisconsin, right? One of the great windows of the world.","You know, I'm really good at that stuff. I'm building on Pennsylvania Avenue, the big hotel. I got it. Everybody wanted it. I got it in the Obama administration. We're building one of the great hotels of the world. It's on time under budget. In fact, in fact, it's way ahead of schedule, and it's under budget.","So you don't hear that too often. Do you ever hear these projects that we have in this country? Yes. That's a 3,000% cost over, 3,000%. Do you think those people building are making a couple of bucks, folks? Do you think they're making a couple of dollars? But Wausau windows, I did 40 Wall Street using Wausau windows.","Great company. Say hello to Wausau windows for me, OK? Say hello. It's a great window. One actually, truthfully, it's one of the best windows made anywhere in the world. So it's good. Wausau, I saw Wausau, I said oh, I wonder that's probably where they make the windows because I order a lot of them and they come -- but we did a whole building, 40 Wall Street, a big 72-story building using I think, 3,500 Wausau windows.","That's a lot of windows, right? Anyway, and there are no leaks. We have no leaks. Explain to them they have no leaks so that's good. I should say, they leak like hell and get a refund, right? I do that too sometimes. So anyway, so we have to make our country so strong, and the way we do it is with the big stuff, but when you look at your area, Wisconsin has to keep wages depressed in order to hold jobs.","That's because of foreign competition. That's good. That's fine. It's no good for you. You know, the people, the blue-collar people, great people in this country. They haven't had an effective wage increase in 20 years, OK? And then people wonder why I have a room filled like this and you have another candidate that just left here you know that.","They had like 300 people but why do we have a room with thousands of people and thousands of people outside listening to a speaker? Because people are angry and they're disgusted at what's going on. So we have thousands, right now, we have people all over this country that are working hard, and a lot of people are getting part-time jobs.","They never had a part-time job in their life. But because of Obamacare it makes sense for the company to make everything part-time for reporting requirements. So you can't do it. It's terrible. Then job growth is coming from largely from the healthcare jobs and new jobs which are very, very low paying jobs, about $525 a week.","That's not good. Then wages in manufacturing are stalled. Oh, man, that's terrible. I just got this, wages and manufacturing are stalled. Low wage -- we're like a low-wage nation in Wisconsin, OK? And I've heard this household income has had a major decline, this is Wisconsin. By the way, this is largely the country just so you understand.","Large, large decline in household income and that took place since the year 2000. So since the year 2000, you've had a decline. Now -- and Wisconsin is just in the middle of the pack. So and I only say that because you have a Governor that endorsed them and people like the Governor. So do I. So he gave me a plaque.","I think I gave him $50,000 or $100,000. You know why? Because he was a fight -- you know, he's fighting, fighting, fighting. I said get somebody to call me up, what the hell difference does it make? If I didn't run against him. Here's a case, I think I gave him $50,000 or $100,000 and he ran. Now, let's say I didn't run against him, OK? And let's say, I wanted something in Wisconsin, and I call him up, Governor.","How are you doing, Governor? Remember me? I gave you $100,000 a couple of years ago when you call -- you -- listen, just out of curiosity, I want to build something in Wisconsin. Do you think he'd be happy about it? I think so, right? But that's the way, I mean, I don't know if it's good. I don't know if it's bad but believe me it's wrong because it's wrong for the people.","That's why when you see -- people haven't had an increase in wages countrywide, nationwide, the blue collars. They haven't. Now, Wall Street's doing fine. I know the Wall Street guys so well. Many of them I don't like it all, OK? They have carried interest provisions. They have provisions that nobody in this room even understands or wants to understand.","I understand them. We're going to end it, folks. We're going to end it because they're doing well. I'm doing well. I'm doing well. I don't want to do that well. You know, I don't really want to do that well. It doesn't matter. Somebody said, oh well, how -- what would you do? Would you run your business?","Somebody said would you run your business and be President at the same time? Are you kidding me? No matter how good a business -- what this is, this is an opportunity that is so awe-inspiring to be President the United States, to make our country so strong again because we have to make it strong. We have to make it rich.","A woman said to me, Mr. Trump, I love you. I'm going to vote for you. You're great but please don't say you're going to make our country rich again. It doesn't sound good. I said you're right but I have to say it because if I'm not going to make the country rich again you're going to start having your Social Security cut by Cruz and by Kasich, you're going to have lots of problems with your Medicare.","I'm giving you a huge tax decrease, by far the biggest you know, coming up, Sarah said she heard a great ad, and it was an ad that I put on, and I don't do that much ad. You know that's why I'm at $35 million, I spent $35 million or $40 million, and other guys have spent $150 million. I mean, Jeb had $148 million.","I'm number one. Will anybody ever forgive me for that term? That term is a killer. There's a lot of terms I made up. Ain't it nice? I've had 17, I'm down now to the two leftovers. Think of it. I've had 17, 17 people, and now, we're down to two. Isn't it nice when you think of it? Wouldn't it be nice? And we're leading big with the two.","I mean, we'll see how it turns out who knows? Do you know who knows? But Wisconsin is very important because if I can win Wisconsin, you people are going to have low taxes. You're going to have jobs. We're going to bring jobs back. You're going to have your pick of jobs. You're not going to just take a job because you have no choice.","You're going to bring jobs back into this country. We're not going to have places moving to Mexico like Nabisco and Ford and all these places they move into Mexico. You saw Carrier air conditioners two months ago. They're moving it to Mexico. They're not going to happen. You're not going to have Pfizer moving to Ireland.","I'm telling you our companies are all leaving and they're leaving because taxes are so high and environment isn't good and regulations -- we'll knock out the regulations because a lot of you people -- who's troubled by the regulations in this country, right? It's terrible. I have friends that are farmers.","They can't even farm their land. The regulations, they spend more on regulation than they do on like how to shovel it out of the ground. So we're going to end all that. We're going to end all that but it's so important. So here's the thing. We've got to go out. We've got to vote. Let me give you one other item because I think it's so, so important.","So I've been criticized. Did you hear today where they're saying nuclear? Now, I've been a businessman and I've had a lot of common sense. I made a lot of money, made a lot of money against China, tremendous deals against China. They could be beaten, folks. They can be beaten. I'm talking on trade. They can be beaten.","They're fine. I like China. I love the people. They can't believe what they get away with. Do you know the richest people in China, friends of mine, they say, Donald, we can't believe what we get away with? Now, they said that before they knew I was running for President, in all fairness. Now, they say I never said that.","But they said it. They can't believe it. But I'll tell you, big league. They said today coming up, I'm watching television and I'm saying, wow, isn't that terrible? They were talking about nuclear and my state, Japan should have nuclear. That's what I said supposedly. I didn't say that. The question was asked to me on television recently by a very good announcer, very good guy.","He said what about -- what about NATO, right? Now, in all fairness, I've been an entrepreneur, really good entrepreneur but for a long time. Nobody ever talked to me about NATO. Nobody ever talked to me about many of the things we talk about now but I know something about NATO and I have a lot of common sense.","I said here's the problem with NATO, it's obsolete. Big statement to make when you don't know that much about it. But I learn quickly. But I knew it was true. It's 68 years old. It was formed to look over the Soviet Union which doesn't even exist anymore. And I know what happens, he gets big and bureaucratic, I said it's obsolete, and we pay too much money.","Now, when I made the statement, I thought I read it somewhere. But when I made the statement, it was really a statement that a lot of people said like, how would you know a thing like that? So it turns out that it's even worse than anybody would have thought. We are paying so much money, 28 countries, we're spending so much money disproportionate, the United States, which is you, all of us. We're not talking about small money, folks.","We're talking about serious, serious money, OK? We're not only taking care of Germany, we're not only taking care of Japan, This that that, and so many. But NATO, many countries, and they're not paying their bills, and why should they? Because nobody asks them to pay. Nobody is going to -- I'm going to say pay up. You got to pay up. One of the early things I'm going to do with, and I'll do it nicely, I promise.","I'll be nice. I'll be presidential. I'm going to be as presidential as I can be, and at the same time, get the money, OK? You know, if you're too presidential, if you're too presidential, you won't get the money, OK? You'll say hello, to one of the countries, I won't use names, one of the countries that owes us. Forget it. Would it be possible to pay the money that you owe?","No, we can't do that. Oh, that's OK. Whenever you get a chance. No. No. I'm like a really smart person. I could be the most presidential President. I could be boring but that's OK. But look, we're going to get these countries to pay, and not only to pay, not only to pay but to pay all the money they owe us for many years.","We've been carrying these countries, many of them are rich countries, some aren't. But many of them have the money to pay. And then you say to yourself, what are we getting out of it? Now, you look at the Ukraine. I have friends in the Ukraine. It's great. They're great people but we're always the ones fighting for the Ukraine.","You never hear Germany and these other countries that surround, you know, you have countries they surround the Ukraine. Do you ever hear them complaining? They don't complain. We want to get in World War 3. You know, we're going to fight over the Ukraine. And you have the people that are the neighbors. I don't think they care or they don't care much.","But here's the thing, when I talk about armament and when I talk about protection, and when I talk about the military, all of these countries which is much of the world that we're taking care of, they have to pay. And I don't want to be like a greedy person but we're losing a fortune everywhere. We take care of South Korea.","We have 28,000 soldiers on the line between North and South, the maniac. We have 28,000 soldiers on the line. States as stupid, stupid people with even dumber leaders. We got to stop. We've got to stop. So Japan is a very big, very rich country, right? And we take care of Japan and Germany. I mean with the Mercedes and the this and the that.","They're fantastic. It's a juggernaut. It's a phenomenal, powerful rich country, very rich country. And Saudi Arabia I told you, OK. So here's the story. Look, these people have to pay for our services. And what I said about Japan is this, we're protecting Japan from many countries, but we're protecting Japan from North Korea.","And he's always talking about Japan, Japan, Japan. We protect them. We get a tiny fraction of what we should be getting but we're protecting Japan. So I said something to the effect that I would see Japan with great respect. I get along great with Japanese. I have Japanese friends. They're great people. With great respect, you know, believe it or not, I'm a unifier.","Nobody's going to think that. You will in four years. You'll say that guy turned out to be a great unifier. Maybe eight years would even be better, OK? But you'll start saying it in two years. You'll start saying it in two years. Believe me. You'll see a big difference because right now, we are a great divide.","Right now, we have a man who's a great divider as our President, OK? He's a great divider. So I would say to Japan, you got to help us out. We want to help you. And I would rather have them not arm but I'm not going to continue to lose this tremendous amount of money. And frankly, the case could be made that let them protect themselves against North Korea.","They'd probably wipe them out pretty quick. And if they fight, you know what? That'll be a terrible thing. Terrible. Good luck, folks. Enjoy yourself. If they fight that would be terrible, right? But if they do, they do. But we can't be the policeman to the world and have $19 trillion in debt going up to $21 trillion, and we're sitting on a bubble, and it's going to explode, and we're going to all end up nowhere, OK? Can't do it. So I said, I think very intelligently because what did happen is after I made my statements about NATO, the next day you saw it last week.","Donald Trump wants to disband the NATO. He want -- I mean, right? Look, she's smile -- isn't it true? Like, I'm some kind of a dopey guy. I'm really smart, really, really, really smart. I know what I'm doing. I know what I'm doing. Now, there will be a point with some of these countries, where we're going to walk, and we won't be gone for long because they're going to call and they're going to say come back.","Now, I would much rather protect Japan because I don't like them arming. But you know what? It's possible that they will and let them take care of themselves here. But probably more likely, they'll pay us a lot more money, and we won't be losing all of the vast billions and billions and billions of dollars that we're losing right now.","Just take a look at NATO. I was so right. And now people, these great US experts, they've studied NATO for 30 years. And now, they're saying that was a brilliant suggestion. One guy was saying, wow, here's a guy studying NATO, and he never thought of it. He said you know, it is obsolete and we don't pay too much.","They don't even think of it because I have a natural instinct for this. By the way, United Nations, same thing smaller numbers, United Nations. Believe me. And many other things, many other things. Where do you ever see the United Nations? I love the United Nations. In New York, they're wonderful. Do they ever settle anything?","It's just like a political gang, the United Nations. We pay for a vast, I mean, the money we spend on the United Nations. I'll tell you a story. So years ago, four or five years ago, I was called before the United States Senate. They wanted to do and it was Senator Sessions, interesting, but it is a large group of senators.","And they were doing a study on the United Nations buildings. They were doing a renovation. So the Ambassador to Sweden at the time, I believe it was Sweden, called me, and I built a building across the street, 92 stories for about $360 million, right across of the United Nations. And he called me and he was very nice, he said, Mr. Trump, I mean, there's a good man because he said, Mr. Trump, I heard you spent $360 million on the building across the street and that building's 92 stories and the United Nations is one third that height and we're going to spend $1.5 billion on renovating our building.","He said could I ask you a question why? I said two reasons. Number one is they're crooked and number two is lack of knowledge. He said could I call you to the United Nations? Yes, I went to the United Nations. I met with Kofi Annan and I told them I will do the whole job for $700 million. They said, yeah, but it won't be the same job.","I said you're right. It'll be much better. No, it's true. It'll be much better. I explained to him. I said I use marble and you'll use linoleum, OK? I said it'll be much better. It'll be 100% but anyway, bottom line took pictures with this guy you know everything. I never heard from him again. Then the United States Senate called me up before they started, and they said how come you can do it for and really the number was $500 million in my own head, for $500 million to $700 million.","Why can you do that and it's going to cost them $1.5 billion? I said it's not going to cost them $1.5 billion. They say it's going to cost them $1.5 billion, it's going to cost them $3 billion maybe more than that. And they said what do you mean? I said that's what's going to cost. That was years ago. Cost them much more than even what I said.","It was one of the great messes that you've ever seen. And I asked a hitman in charge of construction. In my first meeting I said so let me ask you, are you going to use New York's steam? That's a very complex system of steam under the streets of New York. What's that? I said wait a minute, you're in charge of the building, you don't know what you're -- are you going to use a boiler system?","Are you going to use a four-pipe system, a five-pipe system or two-pipe system? He had no idea what I was talking about. I said how can you be in charge of a massive construction problem when you don't know what a five-pipe and a four-pipe into two-pipe system is? How can it be possible? But then I realized this guy made a fortune I'm sure.","I'm sure the guy made a fortune. So here's the story. We're going to rebuild our country. We need roads. We need bridges. You know what? Our bridges are falling down. We're going to save so much money on waste, fraud, and abuse. We're going to save so much. You're going to go out and vote but you're going to be so proud of what took place today.","And you're going to be even more proud of what's going to take place on Tuesday. And a lot of people they say, you know, these politicians they get up -- no, but you know that. You're going to be very proud. You know a lot of these politicians, a lot of these politicians, they get up and they say, oh, you're Americans.","You're great, great people of our country. It doesn't matter whether you vote for me or whether you vote for my opponent. What's important is to get out and vote. I don't say that. I say, if you're going to vote for me, go vote. If you're going to vote for my opponent, don't bother, OK? All right? Don't bother.","Don't bother. But, you know, I do laugh though because I understand nature. I'm like a preacher. I -- you know, I just -- I appreciate life. And we're all angry but we're good people and we're not really angry people, but we're angry about the way our country is being run. We love our country. It's being run by idiots.","We have -- they have no idea what they're doing. And just to finish on the nuclear thing, I told you I was going to go in and negotiate with Japan and negotiate with Germany, and negotiate -- I have the best negotiators in the world. Carl Icahn endorsed me. I have many of the people that want to come in. They want to help us. These are the greatest minds and the greatest businesspeople, and the greatest period negotiators.","They all read the art of the deal, OK? So I say to myself, look at this. Look at these people and look at this negotiation. What's going to happen? What's going to happen? And I'll tell you what's going to happen. Our country, if we don't do this deal if we don't get the proper people in office and we don't get them in office soon, we're not going to have a country left.","I'm telling you. We're not going to have a country left. Just not going to happen. And I'm a person with common sense and I used to tell you, OK. Remember the beginning of the campaign? Bush and Rubio, they're nice guys. They're both nice guys, OK? Everyone's nice after you've won. But let me just tell you.","Remember when Marco would never run because Bush was his mentor. Did anyone ever hear that? So Marco is never going to run, and then, he did run. And then, I kept saying they hate each other and everyone said no they don't. They're good friends. And Bush would stand up and said Marco is my dear, dear friend.","And then Marco would stand up, Jeb is my dear, dear friend. And I'd say, they hate each other. Remember at the debate Jeb would say, I'd like to congratulate Marco, he's my dear, dear friend. And he'd say also and Donald Trump is a gifted politician. My wife actually said, why does he keep calling you a gifted, gifted politician, he'd say it twice sometimes, Donald Trump is a gifted, gifted politician if he's your enemy?","I said I don't want to give you the answer to that. I don't want to give you the answer, not on live television, I don't want to. But look, I understand what's going on. I will do such a great job. We will cut our expenses. We will build up our numbers. We will become rich. We will become strong. We will become great again.","We will become so great. We will start winning again. We don't win anymore. We don't win a war. We can't beat ISIS. We don't win with our great veterans. We can't take care of them. We don't know how. It's a corrupt system, the whole VA is corrupt. We're going to take care of our veterans. We're going to win with trade so big.","We're going to have money pouring back in. We're going to have jobs pouring back into our country, folks. There's not going to be anybody saying, Donald, please don't do that, please don't do that, these are clients, they represent me, please. I say that's OK, they can represent you, lots of luck. They don't represent me. They gave me nothing.","So we're going to have great things happen with trade with China, with Mexico, with all of these. We're going to have a strong border on the Southern side. That border is going to be so strong. You know, they'll build a wall. We're going to build them. So yesterday, I had a great honor because I never asked for this.","The Border Patrol people, 16,500 people, they called up and they said we'd like to endorse Mr. Trump. We have never endorsed a Presidential candidate before. They said, we want to endorse. That tells you. Between Sheriff Joe and the Border Patrol, we understand who's strong on that. We are by far the strongest on border.","We will build a wall. And who's going to pay for the wall? Who? . Mexico, now, by the way, sure as you're sitting here, Mexico will pay for the wall. They have a trade deficit we have with them, $58 billion a year. Now, think of it. The wall is -- now, think of it. And can you believe?","That's not including the drugs that are pouring across the border. That's exclusive. That's exclusive of the fact that our kids are being poisoned. Don't take drugs, OK? Raise your hand. Raise your hand. Come here. Raise your hand. Raise it. Come here. You know, this is what people ask, why do I -- I said to my kids, no drugs, no alcohol, no cigarettes.","Raise your hands, kids. I promise Donald J. Trump that I will never take drugs. I don't want to say no alcohol but take it easy on the alcohol, right? And you know what else? No cigarettes, right? All right, kids. Come here. Come here. Come here. Look. No, they're beautiful kids. But you know what happens once you get hooked on the alcohol or the drugs?","It makes your life very hard. And the one thing I can tell you if you don't ever take it, you'll never get hooked. You know you'll never get hooked. So that's good. That maybe be the most important thing I've done today. So look, folks. We're going to have a strong border. We're going to start winning again.","I hope on Tuesday you go out, you vote for me. I will not let you down. I promise. You will never see anything like you're going to see. I promise. So on Tuesday go out and vote. It'll be the greatest vote you've ever made. And we are going to start winning again. We will Make America Great Again. I love you. Thank you. Thank you. Thank you. Thank you, everybody. Thank you."],"text":" Thank you so much, everybody. And Sarah, thank you very much. She is -- is she great. How good is she? She's a special -- oh, there's a lot of people here. Thank you very much, Sarah. We landed. That snow is pouring in. It was so beautiful. In fact, I thought we were landing in Alaska. I was going to tell Sarah. We've got you home in Alaska. This is beautiful and I want to thank everybody, such an incredible turnout. We've had really amazing turnouts. And we're doing so well and we're so proud of it. And we love Wisconsin, it's a special place, and I think we're going to do really well. I think we're going to do really well, really well. Look at these young people. You know something I said on the way up and I was saying it before that I'm self-funding my campaign. I'm putting up my own money. I don't know if it's worth it. I'll let you know in about a year from now or less. But I think it means a lot. And the reason is, all of these people that I'm running against, and that includes the Republicans and the Democrats, they're not doing it the way I'm doing it. When Hillary gets money from the oil industry and all the other industries, when the case it gets money from the people he's getting money, they totally control him. Believe me. When Cruz, lying Ted, when he gets money. Believe me lying Ted, bible, bible. He lies. I never saw a guy lie like him. I've met a lot tougher than him but I've never seen anyone lie like lying Ted. But you know, but when he -- when he gets money from the banks and he gets money from oil and gas, and he gets money from everything. Believe me, they have him, folks. They have him. I get money from me. I really am here for one reason to represent you, to represent you, believe me. And it's -- it's so great. When I come to places and I like the little thing in the round. I told my people they said let's keep them smaller because you know we had protesters, right? So they said let's keep them smaller. This way, we can check everybody that comes in. I said, yeah, but I like the big, I like the big. You know we have 5,000 -- where's the mall here? where's the mall? We have 5,000 people in the mall. So I told my people enough with this stuff. Let them have protesters, who cares, right? Who cares? We have 5,000 people on the other side of the wall. And I feel so guilty. We love you. Let's all say we love you over there. But you wouldn't swap seats I guarantee you that. So -- and I hope you can hear well back there. Can you hear well? Everyone? Good. Thank you. And can the mall hear well? Let's see if we can hear -- can the mall hear well? I think they can hear well. I hope they can. Anyway, this is amazing. So look, I'm doing this to Make America Great Again. That's our theme. All these hats, look at all these hats, but we're doing this. We're doing this to make -- look at that guy, stand up, look at this guy. Do I look like that? Can you believe it? Can you believe it? Look at that car. All right. Well, I think it looks great. I like it. Good job. But you know it's a simple -- it really is. It's a simple, beautiful theme. Make America Great Again. We have so many problems. We're doing so poorly, far worse than you understand. And in Wisconsin, you know, I know the numbers. The Governor gave me a plaque a year ago when he thought I liked him and I do he's a nice person. He's a doing -- he came up to my office, he gave me a plaque. I bet he wished he had that one to do over again, right? I think I have to show that plaque before I leave, right? I keep saying no, no, let's not bring it -- I should have brought it for this group. But I'll do it somewhere before the time I leave. I'm going to be here right until the end. We're going to be here right until election and I think it's going to be an amazing couple of days. And I can tell you, I think, we're going to win. I really do. I think we're going to win. I think, I think that people are going to be surprised at how well I see the kind of outpouring we've had and somebody else, I won't mention the name, was here not so long ago, and they had 300 people, and we have 5,000 out there, and what? Thousands in here. I don't know what it is a couple of thousand at least. So I think we're good -- it's more than 2,000 even, right? So I think we're going to win and I think we're going to win maybe substantially. But let's just see what happens. But I know one thing, I know one thing, we're going to do well. But you know, well does it mean anything, right? You know Vince Lombardi, right? You -- did you ever hear of a man named Vince Lombardi? Huh? In this neck of the woods, did you ever hear the great Vince Lombardi? So you know what? You -- OK. What did he say about winning? Right? Right. He knows. He's a plays -- he's a fan. I met Vince Lombardi once, I mean a number of times, but I met him once, and he was three -- with three of his players. I was a very young guy. It was at a restaurant and these three players were tough, tough cookies. I better not mention their names and two of them are friends of mine and they played for your team. And I'll tell you they were great players. And Vince Lombardi was not a big guy and he walked in and he was angry and he was just so angry you could see. And he was -- he came over to the table and he saw these three big guys. They were like twice his size. They could have swatted him and he looked at them. I won't tell you what he did because he actually grabbed one by the shirt but I won't say that. See, today you're not allowed to do that, right? And then he left. He gave them a little bit of an earful and then he left. And I want to tell you, this big strong friend of mine, he weighed like 250 then which 250 then is big. That's like 310 now, right? This was a long time ago and he left, stormed out and this guy was sitting here shaking. And I said, you know, I said to myself, the reason that Vince was able -- and I had great respect for him as a coach, and I love Bill Belichick, I love -- there are certain people you have to respect, these coaches, right? They have to respect and I said it at one of my other meetings. Tom Brady's a friend of mine. He thinks your quarterback is great, OK? Nice, right? Do you think he's great too? Do you think your quarterback is great, right? So Tom told me that. So I think that's a nice thing to say. But Vince Lombardi, the reason he got away with it is winning. He won. If he didn't win he couldn't get away with it. If he didn't win he wouldn't be able to get that kind of almost fear, but respect, but fear from big, strong, powerful players. But he won. By that time he had won many times and the respect that they had for him was incredible. Now, we don't win. The United States doesn't win anymore. We don't win a war. We can't beat ISIS. We don't win a trade. China's cleaning our clock. Mexico, they laugh at us. They think we're all stupid because our leaders do such stupid things. Mexico, Japan, Vietnam, India any nation, name a nation, they do well. Name a nation, doesn't make any difference, and they do well, and more and more I think about it, the more I realize, they do well for a very specific reason. Not that the politicians are so stupid and many of them are but many of them aren't. But because the politicians take tremendous campaign contributions from people representing certain other parts of the world or certain companies that are involved in certain other parts of the world and they do things that are not in your best interests. So when I say I'm self-funding, I don't take money. I have turned down more money. I'll bet that any human being has ever turned down for a political run. I mean, it has to be because frankly, everybody takes money. When you think of it, not a big deal because everybody takes money for years, probably. I don't know, I may be wrong about this. I would -- I would say the only one would be Ross Perot, right? Many years ago, that was a long time ago, but he didn't take money. But I have turned down so much. People coming up, $10 million. Donald, we want to give you $10 million for your campaign. We want to give you $5 million, $2 million, $1 million. Jeb Bush raised $148 million or so. I would have done that times five. And honestly, and I said coming up, I don't know if I get credit for it. Honestly, I don't know. Nobody's going in saying, you know, I like Trump and I like Cruz which is really not even a fair comparison, folks. I'm so much better. I will do so much better job. I will do so much better. Not, not even close but I will do so much better. You know why? Because I'm working for you. They're not working for you. They talk about working for you but they're not working for you. They're working for their next election. They're working for campaign contributions. Who knows what else they take? And I don't care. I mean, that's not my business, right? It's your business. But who knows what else they work for? But they're working at a minimum for campaign contributions. And I say it all the time, people come up to me, our leaders are so stupid, our politicians are so stupid. Why would they make deals like that? Why would they do this deal or that deal? There was a deal recently, a company made this incredible deal, and the politicians approved it. And people say, oh, our politicians are so stupid. Well, they're not so stupid. Those people are represented by the smartest people you've ever seen. Special interest groups, lobbyists, I mean, some of these guys they have like one there -- it says Cruz, right on -- the lobbyists. It's tattooed right on their forehead. I can deal with Cruz. They raise a lot of money for them. And when they go in they need a vote. No, I'm not going to vote for that. No, no, you have to. They gave you $2 million for your campaign when nobody else would put up the money. Hey, do I know the system better than anybody ever in history? I mean, you know, I was on June 16th -- I only started this political stuff on June 16th before that I mean, I was a very big contributor. It's a system. It's the system. It's not good but it's the system, it's what we have. But you have guys with its -- it's blazing -- Hillary. It says Hillary on that guy's forehead. They -- it's like a branding iron, right? You go to him, you want Hillary. You go to another guy if you want Kasich. You go to another guy if you want Cruz. By the way, 100%, 100%, now, they won't always get what they want. Maybe only 90%, you know, there's some things you can't do but they get what they want a lot. They're tremendous professionals. So what they do is they're very good at it. So when I'm self-funding I hope people appreciate it because it means a lot. I mean, it means a lot. It means I don't owe anybody anything. I don't owe them. I don't owe them. I said on the way up, you know so far, I've invested $35 million, maybe $40 million. I don't know. Something like that. My money, my money and you know what? It has no impact on me which is -- lucky. I built a great company. By the way, you saw I filed, I built an amazing company, tremendous cash flow, some of the greatest assets in the world, worth over $10 billion and I started with really just a very, very small loan and built a great company. Some of the great, great assets, tremendously low debt. And the reason I tell you that is that's the kind of thinking we need in our country to solve many of our problems. Many because folks, and they have all those cameras back there, we are right now sitting on a bubble that's going to explode and it's going to be a real bad situation. And we better get rid of the debt and we better straighten ourselves out because we have debt on debt on debt. And one of the things -- we're going to talk about a few of those things because it affects you very much and I know you have a lot of small business owners here. Probably a couple of big business owners here but we have to get rid of it. We're going to start with Obamacare too. Obamacare is a killer for you and for the country. It's a killer. Obamacare is too expensive for the country to afford and it doesn't work. By the way, for you, it doesn't work, for anybody. You go 45%, 55% increases this year, people are telling me they've never seen anything like it. It falls. It closes up, Obamacare in the year '17 will close up. We can't make it. So when you have it just remember, it's no good anyway, but we'll terminate it far before that and we will end up with a great, great healthcare plan that will cost you less money, and be much, much better. I love these young kids. Look at these beautiful kids. They're going crazy. They're clapping about Obamacare. They don't know what Obamacare is, but hopefully, they won't need any healthcare for 40 years, OK? So you know, but they're still very enthusiastic, right? Great, kids. Great. They don't like Obamacare. Hopefully, they don't have to worry. They don't have to worry about healthcare. But ultimately, they do have to worry about the costs because the cost is unbearable by the country. The kind of money that we're talking about is unbearable. OK. So we start with that. We're going to bring Common Core. We're going to end it. We're going to bring education local, right? We're going to protect our Second Amendment. We're going to do all the things that you've heard me saying, all of them. But here's what I wanted to talk to you about because we're going to talk down big, big, big numbers, right? When you have $19 trillion, fellows. We can't talk peanuts, right? We can't talk like the little stuff. There's going to be tremendous fraud waste abuse. We'll cut things that you won't even believe, OK? We're going to save you Social Security as is. We're going to cut all of the waste and all of the fraud. You don't mind cutting the fraud out, right? There's plenty of it. We're going to take care of your vets and we're going to build a military bigger, stronger, better than ever before. Beautiful. Great. That's -- isn't that great? When you see young people like that, that's so great. Oh, they're going to be very successful. Don't forget they're after our jobs pretty soon. Hey, the problem is we're losing all our jobs. They have no choice. They have to take it away from us. That's all right. You'll treat us nicely though, right? You'll treat us -- that's the next Trump. Bigger and better than Trump. Not even a contest. Good luck, kids. We think it's fantastic. What about the one in the middle? You're going to be the most successful of them all, huh? Beautiful. Great. Great job. That's what we love to see. That's what we're fighting for. My daughter Ivanka just had a beautiful, beautiful son. And ultimately, that's what we fight for that and the grandchildren and all that. We're going to and we're going to turn this thing around. We're going to turn around fast. So let's talk about a couple of things that are big dollars. So we are the police department for the entire world, and the entire world, many of these places that we're taking care of are very, very rich. We take care of Saudi Arabia. They made $1 billion a day when the oil prices were up. Now, they make a little less, OK, big deal. What? And the imports. He's right. He's right. You never know. Is that a protester or is he on our side? You're right though. But we take care of Saudi Arabia. Now, nobody's going to mess with Saudi Arabia because we're watching them. They're the richest, one of the richest, I mean, they have a fund that' so big nobody's ever seen a fund like that, right? They have oil pouring out of the ground. They have very high oil, very high-quality oil. They have very expensive oil and they have very cheap oil to get. So they make nothing but money. If it weren't for us they wouldn't be there very long. And I do business with the Saudis, they're good people, they're fine. Everyone's fine but we're losing a fortune, OK? And if we had a person like me, like a few people in this room, maybe some, not all, right? We have to know our strengths and our weaknesses. But you have some people in the room would be -- do a great job. You have other people that wouldn't do so good. They do like the people that we have right now. Nobody could do worse. That's the only thing I will say. So we're protecting Saudi Arabia. They're not paying us a fair price. We're losing our shirt, OK? You know, we have military bases that we pay rent on? Why, why are we paying rent? We're protecting and we're renting land and we're paying. Why are we paying rent? Why do we have any rent? But we -- I'm not even talking about rent. I'm talking and that's big numbers but I'm talking about really big numbers. So Japan great country. They make the cars, they sell them. You know, we have an imbalance with Japan like you wouldn't believe. Billions and billions of dollars. They sell us cars. We sell them practically nothing by comparison. They call it a trade imbalance. They're like up here, we're like down here, OK? One of the great imbalances of all time. I was in Los Angeles, I see these massive ships come in. It's like NASCAR. You know, by the way, the owner of NASCAR and a lot of the drivers they endorse Trump. You know about that, right? We love NASCAR. I love NASCAR. Brian France, the great Brian France. And they do a great job. Thank you, man. They do a great job but they endorse. Brian came up he said, I want to endorse you for President. I said, boy that's cool and he did it like in North Carolina. A good place to endorse, right? North or South. And it wouldn't be bad up here either but we have it. And we have so many, not only Sarah, we have Jerry Falwell, Jr., from Liberty University. We have Joe from Arizona, Sheriff Joe. How about Sheriff Joe? OK? Chris Christie has been fantastic. He's been great. We have Dr. Ben Carson who has been amazing. He's been amazing. What a great guy. And we have so many others. We have Congressman now. Senator Jeff Sessions, one of the most respected people in the United States Senate, who Cruz thought he had. Cruz kept talking about Session, session, and you know, he'd say Sessions, Senator Sessions, and then Senator Sessions announced about two months ago, he's endorsing Trump. And all of a sudden, Cruz doesn't talk about him so much anymore, I guess. But look, whether it's even the young kids with it. But -- so a lot of things are going to happen. So one thing we're going to do is the military. So we're like the policeman to the world, right? And that's fine. That's fine and everything's good. But these are really, really wealthy countries. None as very powerful because we protect them and that's OK that we protect. They got to pay us, folks. And you know what? When they start paying us and then we do good trade deals, and then we do -- this country's already turned around, it's turned around. Because we're talking big, big dollars. And lying Ted can't do it. He can't. In all fairness, number one, they're going to find out he's a liar. They're not going to trust him, OK? But he can't. You know the Evangelicals they're with me. The Evangelicals. Remember South Carolina that was going to be Ted, lying Ted was going to win that one easy because the Evangelicals, I think it's 68% Evangelical, right? I think you guys are only 28%. Let's get going, start going to church a little bit more. Go to church. There are the ones I want to get going. Go -- do you go to church on Sundays? Any time you can go. Do you go to church? OK, good. But 68% Evangelical so he was going to win. I won in a landslide. We won North and we won everything. I mean, we've won so much. In fact, just to show you. So Ted, during one of the debates, did you see it? I'm the only one that can beat Donald Trump. I've done it many times. I've beaten him like five times, six times, what I -- I beat him five times and he's screaming at the top of his lungs you know. He wished he had the Bible in his hand but he didn't happen to have one for the debate. But he picks up the Bible, puts it down, and then he lies. But he said I beaten him six times. So everyone's saying, oh well, that's great. And then I looked at him and said, yeah, but I've beaten you 22 times and do you remember the face? It's true. I've beaten you 22 times. I think, I think we have like 21 or 22 states already but this is an important one, by the way, you got to do me a favor, folks. You got a vote. I will do such a good job for you. Do yourselves a favor. Don't do me -- you're probably doing me a favor if you don't vote for me. I'll go home. I'll relax. So many people have asked me the question. This morning I was interviewed by very good radio guy, not the whack job that interviewed me. His name is Sykes and a couple of them, oh, he's the worst. You know what? Sure, there was actually a good interview but he only plays one little sentence, half a sentence. You know, listen to the whole interview. Everybody that listened to that show would vote for me. Believe me. And most people would say, oh, let's hang up now. Don't hang up. You take on the enemy. You take them on. You absolutely take them on. But remember, but he's not a very talented guy. He's not a very smart guy. But the guy that interviewed me today was a smart cookie. Radio host, a big one, and national and he interviews me, and at the end he said, you know, we're on the phone, it's early Saturday morning, and I said just before I left for here I said, thank you very much. He said Mr. Trump, can I ask you one final question? What? You're worth a fortune. You have a beautiful family. You can do anything you want. Why are you doing this? Why would you do this? And that question has been asked of me more than any other question other than student debt. When I'm around the students, I get tremendous, you know, they're choked up to here, and then they graduate, they can't get a job. Well, I mean, it's a serious problem. But that question gets asked to me so much. And I said you know what? I've been so lucky in this country, I've done so well, I've made so much money and had such success, and enjoyed my life. And I have some hopefully, some really good years left and I want to give back to the country. I just want to give something back. That's all it is. It's all it is. Thank you. And you know our theme Make America Great Again. Folks, we're going to make it so great. But here's what I want to explain. We always have a problem. It's a problem in translation because the press is so totally dishonest. I mean, you have no idea. No, no, you have no idea. It's amazing how smart the people are. They added -- he said you got that right. Look, the people get it. They are really, really dishonest. They'll put like one-tenth of a sentence in. They'll cut you off and worse are cameras. You know, I always used to say, I love doing television because if you do television, it's that. Well, then they show like a tiny piece of a clip. It's almost worse than the way they write. But the press is very dishonest. So let me just tell you what happened. So you know, NAFTA's been a total disaster, right? It's drained businesses. Well, now we have a new one called TPP, Trans-Pacific Partnership. It is so bad. It's worse than NAFTA. It will -- it's worse than NAFTA. It will drain Wisconsin. It will drain the United States. We're doing it with various countries all put together, a 7,000-page document that I almost guarantee you nobody in our country has ever read. And those countries from Asia mostly, are all -- every word is like studied and analyzed and we just sign it. First of all, we shouldn't sign with 12 countries. We should sign one, two, three, four, and we reward the good countries. This way, the bad countries come in, and they take advantage of the good countries. It's too complicated. It's a stupid deal. Ted Cruz is totally in favor of it because people want him to be in favor of it. Kasich who voted for NAFTA is in favor of it because people say you're going to vote for that deal. You're in favor of it because they support him and he has no choice. And that deal is a horrible deal. And you have Liberals that want it. And you have Conservatives and then you have plenty of people in Congress that don't want it, OK? But those are the ones that are being honest. And the biggest single point of the deal is monetary manipulation, devaluation of the currency. And that's how China and many other countries take the most advantage of is devaluation of their currency. They kill us. This year we're going to have a $500 billion trade deficit with China. Then, somebody will say, so look, I'm really a good businessman. I'm so good at business. Oh, you people are going to be so rich so fast you don't even -- you don't know how rich you're going to be. You're going to go from a debtor nation. It's going to phew and you're going to say, wow, what happened? But look, look, you have Ted Cruz that refused to approve any language on devaluation. Any language on monetary manipulation. That's where they beat us, folks. They devalue their currency so much and then we see our dollar holding and going up. They want our dollar to go up, it sounds good. But in the meantime, Komatsu is killing Caterpillar. In the meantime, China, look what they're doing. They're draining our businesses. Look at what's going on and look at what's going on with Mexico. Mexico is taking our business. It's not only for devaluation, for a lot of other reasons. The biggest is that our politicians don't know what the hell they're doing or contributions, OK? So look, look, we are going to change things and that's big money. Those are trade deals. I have Carl Icahn, great, great businessman. We have the greatest businesspeople in the world in this country. We don't use them. We use political hacks, third rate political slobs to negotiate with the smartest people in China, the smartest people in Japan, and we have all the cards. People don't realize it. Without our money, without this big pot of money that's being drained out of your pocket, and by the way, just -- I have to do this because I just feel I have to. I want to read you some statistics. You know, you're going to say, oh well, you're going to know about it. So where am I talking about? 20% of the manufacturing jobs have left since 2000. Do you know where that is? Wisconsin. According to the Journal, the Journal Sentinel, Wisconsin chronically logs -- Now, look at this. Wisconsin chronically lags the rest of the United States in job creation. That's not what you hear. Here's what happened with Scott Walker and I can only say this because I couldn't ask for his endorsement. I mean what I did to that poor guy, man. No, what I did to him. And he's a nice person but who cares? I don't care if he's nice. I want to make the country rich and good again. OK. Chronically lags the rest of the United States. So remember when Scott announced, I'm running for President. I don't know, he was standing on a motorcycle or something. He doesn't look like the bikers that are supporting me. I got to tell you. Every time I go someplace these bikers are all over the place. The bikers love me. Are any bikers in here? Right? The bikers love me and I've always liked the limousine. I've never quite gotten it but that's OK. Maybe I don't have the guts to ride those bikes. But you know what? They're great people. I was at I think Hilton had one of the places and we had hundreds with close to probably, close to probably a thousand bikes. I said what's going on over here? In fact, I was a little bit concerned actually. They're tough cookies and they're out there waiting for hours. I was making a speech to a group, a great group. I won the state big. It was incredible but they were -- it had to be a thousand bikes, mostly Harley's, in all fairness, we love Harley. I love Harley, right? But -- and I buy Wausau windows. Does anybody know Wausau? Wausau, Wisconsin, right? One of the great windows of the world. You know, I'm really good at that stuff. I'm building on Pennsylvania Avenue, the big hotel. I got it. Everybody wanted it. I got it in the Obama administration. We're building one of the great hotels of the world. It's on time under budget. In fact, in fact, it's way ahead of schedule, and it's under budget. So you don't hear that too often. Do you ever hear these projects that we have in this country? Yes. That's a 3,000% cost over, 3,000%. Do you think those people building are making a couple of bucks, folks? Do you think they're making a couple of dollars? But Wausau windows, I did 40 Wall Street using Wausau windows. Great company. Say hello to Wausau windows for me, OK? Say hello. It's a great window. One actually, truthfully, it's one of the best windows made anywhere in the world. So it's good. Wausau, I saw Wausau, I said oh, I wonder that's probably where they make the windows because I order a lot of them and they come -- but we did a whole building, 40 Wall Street, a big 72-story building using I think, 3,500 Wausau windows. That's a lot of windows, right? Anyway, and there are no leaks. We have no leaks. Explain to them they have no leaks so that's good. I should say, they leak like hell and get a refund, right? I do that too sometimes. So anyway, so we have to make our country so strong, and the way we do it is with the big stuff, but when you look at your area, Wisconsin has to keep wages depressed in order to hold jobs. That's because of foreign competition. That's good. That's fine. It's no good for you. You know, the people, the blue-collar people, great people in this country. They haven't had an effective wage increase in 20 years, OK? And then people wonder why I have a room filled like this and you have another candidate that just left here you know that. They had like 300 people but why do we have a room with thousands of people and thousands of people outside listening to a speaker? Because people are angry and they're disgusted at what's going on. So we have thousands, right now, we have people all over this country that are working hard, and a lot of people are getting part-time jobs. They never had a part-time job in their life. But because of Obamacare it makes sense for the company to make everything part-time for reporting requirements. So you can't do it. It's terrible. Then job growth is coming from largely from the healthcare jobs and new jobs which are very, very low paying jobs, about $525 a week. That's not good. Then wages in manufacturing are stalled. Oh, man, that's terrible. I just got this, wages and manufacturing are stalled. Low wage -- we're like a low-wage nation in Wisconsin, OK? And I've heard this household income has had a major decline, this is Wisconsin. By the way, this is largely the country just so you understand. Large, large decline in household income and that took place since the year 2000. So since the year 2000, you've had a decline. Now -- and Wisconsin is just in the middle of the pack. So and I only say that because you have a Governor that endorsed them and people like the Governor. So do I. So he gave me a plaque. I think I gave him $50,000 or $100,000. You know why? Because he was a fight -- you know, he's fighting, fighting, fighting. I said get somebody to call me up, what the hell difference does it make? If I didn't run against him. Here's a case, I think I gave him $50,000 or $100,000 and he ran. Now, let's say I didn't run against him, OK? And let's say, I wanted something in Wisconsin, and I call him up, Governor. How are you doing, Governor? Remember me? I gave you $100,000 a couple of years ago when you call -- you -- listen, just out of curiosity, I want to build something in Wisconsin. Do you think he'd be happy about it? I think so, right? But that's the way, I mean, I don't know if it's good. I don't know if it's bad but believe me it's wrong because it's wrong for the people. That's why when you see -- people haven't had an increase in wages countrywide, nationwide, the blue collars. They haven't. Now, Wall Street's doing fine. I know the Wall Street guys so well. Many of them I don't like it all, OK? They have carried interest provisions. They have provisions that nobody in this room even understands or wants to understand. I understand them. We're going to end it, folks. We're going to end it because they're doing well. I'm doing well. I'm doing well. I don't want to do that well. You know, I don't really want to do that well. It doesn't matter. Somebody said, oh well, how -- what would you do? Would you run your business? Somebody said would you run your business and be President at the same time? Are you kidding me? No matter how good a business -- what this is, this is an opportunity that is so awe-inspiring to be President the United States, to make our country so strong again because we have to make it strong. We have to make it rich. A woman said to me, Mr. Trump, I love you. I'm going to vote for you. You're great but please don't say you're going to make our country rich again. It doesn't sound good. I said you're right but I have to say it because if I'm not going to make the country rich again you're going to start having your Social Security cut by Cruz and by Kasich, you're going to have lots of problems with your Medicare. I'm giving you a huge tax decrease, by far the biggest you know, coming up, Sarah said she heard a great ad, and it was an ad that I put on, and I don't do that much ad. You know that's why I'm at $35 million, I spent $35 million or $40 million, and other guys have spent $150 million. I mean, Jeb had $148 million. I'm number one. Will anybody ever forgive me for that term? That term is a killer. There's a lot of terms I made up. Ain't it nice? I've had 17, I'm down now to the two leftovers. Think of it. I've had 17, 17 people, and now, we're down to two. Isn't it nice when you think of it? Wouldn't it be nice? And we're leading big with the two. I mean, we'll see how it turns out who knows? Do you know who knows? But Wisconsin is very important because if I can win Wisconsin, you people are going to have low taxes. You're going to have jobs. We're going to bring jobs back. You're going to have your pick of jobs. You're not going to just take a job because you have no choice. You're going to bring jobs back into this country. We're not going to have places moving to Mexico like Nabisco and Ford and all these places they move into Mexico. You saw Carrier air conditioners two months ago. They're moving it to Mexico. They're not going to happen. You're not going to have Pfizer moving to Ireland. I'm telling you our companies are all leaving and they're leaving because taxes are so high and environment isn't good and regulations -- we'll knock out the regulations because a lot of you people -- who's troubled by the regulations in this country, right? It's terrible. I have friends that are farmers. They can't even farm their land. The regulations, they spend more on regulation than they do on like how to shovel it out of the ground. So we're going to end all that. We're going to end all that but it's so important. So here's the thing. We've got to go out. We've got to vote. Let me give you one other item because I think it's so, so important. So I've been criticized. Did you hear today where they're saying nuclear? Now, I've been a businessman and I've had a lot of common sense. I made a lot of money, made a lot of money against China, tremendous deals against China. They could be beaten, folks. They can be beaten. I'm talking on trade. They can be beaten. They're fine. I like China. I love the people. They can't believe what they get away with. Do you know the richest people in China, friends of mine, they say, Donald, we can't believe what we get away with? Now, they said that before they knew I was running for President, in all fairness. Now, they say I never said that. But they said it. They can't believe it. But I'll tell you, big league. They said today coming up, I'm watching television and I'm saying, wow, isn't that terrible? They were talking about nuclear and my state, Japan should have nuclear. That's what I said supposedly. I didn't say that. The question was asked to me on television recently by a very good announcer, very good guy. He said what about -- what about NATO, right? Now, in all fairness, I've been an entrepreneur, really good entrepreneur but for a long time. Nobody ever talked to me about NATO. Nobody ever talked to me about many of the things we talk about now but I know something about NATO and I have a lot of common sense. I said here's the problem with NATO, it's obsolete. Big statement to make when you don't know that much about it. But I learn quickly. But I knew it was true. It's 68 years old. It was formed to look over the Soviet Union which doesn't even exist anymore. And I know what happens, he gets big and bureaucratic, I said it's obsolete, and we pay too much money. Now, when I made the statement, I thought I read it somewhere. But when I made the statement, it was really a statement that a lot of people said like, how would you know a thing like that? So it turns out that it's even worse than anybody would have thought. We are paying so much money, 28 countries, we're spending so much money disproportionate, the United States, which is you, all of us. We're not talking about small money, folks. We're talking about serious, serious money, OK? We're not only taking care of Germany, we're not only taking care of Japan, This that that, and so many. But NATO, many countries, and they're not paying their bills, and why should they? Because nobody asks them to pay. Nobody is going to -- I'm going to say pay up. You got to pay up. One of the early things I'm going to do with, and I'll do it nicely, I promise. I'll be nice. I'll be presidential. I'm going to be as presidential as I can be, and at the same time, get the money, OK? You know, if you're too presidential, if you're too presidential, you won't get the money, OK? You'll say hello, to one of the countries, I won't use names, one of the countries that owes us. Forget it. Would it be possible to pay the money that you owe? No, we can't do that. Oh, that's OK. Whenever you get a chance. No. No. I'm like a really smart person. I could be the most presidential President. I could be boring but that's OK. But look, we're going to get these countries to pay, and not only to pay, not only to pay but to pay all the money they owe us for many years. We've been carrying these countries, many of them are rich countries, some aren't. But many of them have the money to pay. And then you say to yourself, what are we getting out of it? Now, you look at the Ukraine. I have friends in the Ukraine. It's great. They're great people but we're always the ones fighting for the Ukraine. You never hear Germany and these other countries that surround, you know, you have countries they surround the Ukraine. Do you ever hear them complaining? They don't complain. We want to get in World War 3. You know, we're going to fight over the Ukraine. And you have the people that are the neighbors. I don't think they care or they don't care much. But here's the thing, when I talk about armament and when I talk about protection, and when I talk about the military, all of these countries which is much of the world that we're taking care of, they have to pay. And I don't want to be like a greedy person but we're losing a fortune everywhere. We take care of South Korea. We have 28,000 soldiers on the line between North and South, the maniac. We have 28,000 soldiers on the line. States as stupid, stupid people with even dumber leaders. We got to stop. We've got to stop. So Japan is a very big, very rich country, right? And we take care of Japan and Germany. I mean with the Mercedes and the this and the that. They're fantastic. It's a juggernaut. It's a phenomenal, powerful rich country, very rich country. And Saudi Arabia I told you, OK. So here's the story. Look, these people have to pay for our services. And what I said about Japan is this, we're protecting Japan from many countries, but we're protecting Japan from North Korea. And he's always talking about Japan, Japan, Japan. We protect them. We get a tiny fraction of what we should be getting but we're protecting Japan. So I said something to the effect that I would see Japan with great respect. I get along great with Japanese. I have Japanese friends. They're great people. With great respect, you know, believe it or not, I'm a unifier. Nobody's going to think that. You will in four years. You'll say that guy turned out to be a great unifier. Maybe eight years would even be better, OK? But you'll start saying it in two years. You'll start saying it in two years. Believe me. You'll see a big difference because right now, we are a great divide. Right now, we have a man who's a great divider as our President, OK? He's a great divider. So I would say to Japan, you got to help us out. We want to help you. And I would rather have them not arm but I'm not going to continue to lose this tremendous amount of money. And frankly, the case could be made that let them protect themselves against North Korea. They'd probably wipe them out pretty quick. And if they fight, you know what? That'll be a terrible thing. Terrible. Good luck, folks. Enjoy yourself. If they fight that would be terrible, right? But if they do, they do. But we can't be the policeman to the world and have $19 trillion in debt going up to $21 trillion, and we're sitting on a bubble, and it's going to explode, and we're going to all end up nowhere, OK? Can't do it. So I said, I think very intelligently because what did happen is after I made my statements about NATO, the next day you saw it last week. Donald Trump wants to disband the NATO. He want -- I mean, right? Look, she's smile -- isn't it true? Like, I'm some kind of a dopey guy. I'm really smart, really, really, really smart. I know what I'm doing. I know what I'm doing. Now, there will be a point with some of these countries, where we're going to walk, and we won't be gone for long because they're going to call and they're going to say come back. Now, I would much rather protect Japan because I don't like them arming. But you know what? It's possible that they will and let them take care of themselves here. But probably more likely, they'll pay us a lot more money, and we won't be losing all of the vast billions and billions and billions of dollars that we're losing right now. Just take a look at NATO. I was so right. And now people, these great US experts, they've studied NATO for 30 years. And now, they're saying that was a brilliant suggestion. One guy was saying, wow, here's a guy studying NATO, and he never thought of it. He said you know, it is obsolete and we don't pay too much. They don't even think of it because I have a natural instinct for this. By the way, United Nations, same thing smaller numbers, United Nations. Believe me. And many other things, many other things. Where do you ever see the United Nations? I love the United Nations. In New York, they're wonderful. Do they ever settle anything? It's just like a political gang, the United Nations. We pay for a vast, I mean, the money we spend on the United Nations. I'll tell you a story. So years ago, four or five years ago, I was called before the United States Senate. They wanted to do and it was Senator Sessions, interesting, but it is a large group of senators. And they were doing a study on the United Nations buildings. They were doing a renovation. So the Ambassador to Sweden at the time, I believe it was Sweden, called me, and I built a building across the street, 92 stories for about $360 million, right across of the United Nations. And he called me and he was very nice, he said, Mr. Trump, I mean, there's a good man because he said, Mr. Trump, I heard you spent $360 million on the building across the street and that building's 92 stories and the United Nations is one third that height and we're going to spend $1.5 billion on renovating our building. He said could I ask you a question why? I said two reasons. Number one is they're crooked and number two is lack of knowledge. He said could I call you to the United Nations? Yes, I went to the United Nations. I met with Kofi Annan and I told them I will do the whole job for $700 million. They said, yeah, but it won't be the same job. I said you're right. It'll be much better. No, it's true. It'll be much better. I explained to him. I said I use marble and you'll use linoleum, OK? I said it'll be much better. It'll be 100% but anyway, bottom line took pictures with this guy you know everything. I never heard from him again. Then the United States Senate called me up before they started, and they said how come you can do it for and really the number was $500 million in my own head, for $500 million to $700 million. Why can you do that and it's going to cost them $1.5 billion? I said it's not going to cost them $1.5 billion. They say it's going to cost them $1.5 billion, it's going to cost them $3 billion maybe more than that. And they said what do you mean? I said that's what's going to cost. That was years ago. Cost them much more than even what I said. It was one of the great messes that you've ever seen. And I asked a hitman in charge of construction. In my first meeting I said so let me ask you, are you going to use New York's steam? That's a very complex system of steam under the streets of New York. What's that? I said wait a minute, you're in charge of the building, you don't know what you're -- are you going to use a boiler system? Are you going to use a four-pipe system, a five-pipe system or two-pipe system? He had no idea what I was talking about. I said how can you be in charge of a massive construction problem when you don't know what a five-pipe and a four-pipe into two-pipe system is? How can it be possible? But then I realized this guy made a fortune I'm sure. I'm sure the guy made a fortune. So here's the story. We're going to rebuild our country. We need roads. We need bridges. You know what? Our bridges are falling down. We're going to save so much money on waste, fraud, and abuse. We're going to save so much. You're going to go out and vote but you're going to be so proud of what took place today. And you're going to be even more proud of what's going to take place on Tuesday. And a lot of people they say, you know, these politicians they get up -- no, but you know that. You're going to be very proud. You know a lot of these politicians, a lot of these politicians, they get up and they say, oh, you're Americans. You're great, great people of our country. It doesn't matter whether you vote for me or whether you vote for my opponent. What's important is to get out and vote. I don't say that. I say, if you're going to vote for me, go vote. If you're going to vote for my opponent, don't bother, OK? All right? Don't bother. Don't bother. But, you know, I do laugh though because I understand nature. I'm like a preacher. I -- you know, I just -- I appreciate life. And we're all angry but we're good people and we're not really angry people, but we're angry about the way our country is being run. We love our country. It's being run by idiots. We have -- they have no idea what they're doing. And just to finish on the nuclear thing, I told you I was going to go in and negotiate with Japan and negotiate with Germany, and negotiate -- I have the best negotiators in the world. Carl Icahn endorsed me. I have many of the people that want to come in. They want to help us. These are the greatest minds and the greatest businesspeople, and the greatest period negotiators. They all read the art of the deal, OK? So I say to myself, look at this. Look at these people and look at this negotiation. What's going to happen? What's going to happen? And I'll tell you what's going to happen. Our country, if we don't do this deal if we don't get the proper people in office and we don't get them in office soon, we're not going to have a country left. I'm telling you. We're not going to have a country left. Just not going to happen. And I'm a person with common sense and I used to tell you, OK. Remember the beginning of the campaign? Bush and Rubio, they're nice guys. They're both nice guys, OK? Everyone's nice after you've won. But let me just tell you. Remember when Marco would never run because Bush was his mentor. Did anyone ever hear that? So Marco is never going to run, and then, he did run. And then, I kept saying they hate each other and everyone said no they don't. They're good friends. And Bush would stand up and said Marco is my dear, dear friend. And then Marco would stand up, Jeb is my dear, dear friend. And I'd say, they hate each other. Remember at the debate Jeb would say, I'd like to congratulate Marco, he's my dear, dear friend. And he'd say also and Donald Trump is a gifted politician. My wife actually said, why does he keep calling you a gifted, gifted politician, he'd say it twice sometimes, Donald Trump is a gifted, gifted politician if he's your enemy? I said I don't want to give you the answer to that. I don't want to give you the answer, not on live television, I don't want to. But look, I understand what's going on. I will do such a great job. We will cut our expenses. We will build up our numbers. We will become rich. We will become strong. We will become great again. We will become so great. We will start winning again. We don't win anymore. We don't win a war. We can't beat ISIS. We don't win with our great veterans. We can't take care of them. We don't know how. It's a corrupt system, the whole VA is corrupt. We're going to take care of our veterans. We're going to win with trade so big. We're going to have money pouring back in. We're going to have jobs pouring back into our country, folks. There's not going to be anybody saying, Donald, please don't do that, please don't do that, these are clients, they represent me, please. I say that's OK, they can represent you, lots of luck. They don't represent me. They gave me nothing. So we're going to have great things happen with trade with China, with Mexico, with all of these. We're going to have a strong border on the Southern side. That border is going to be so strong. You know, they'll build a wall. We're going to build them. So yesterday, I had a great honor because I never asked for this. The Border Patrol people, 16,500 people, they called up and they said we'd like to endorse Mr. Trump. We have never endorsed a Presidential candidate before. They said, we want to endorse. That tells you. Between Sheriff Joe and the Border Patrol, we understand who's strong on that. We are by far the strongest on border. We will build a wall. And who's going to pay for the wall? Who? . Mexico, now, by the way, sure as you're sitting here, Mexico will pay for the wall. They have a trade deficit we have with them, $58 billion a year. Now, think of it. The wall is -- now, think of it. And can you believe? That's not including the drugs that are pouring across the border. That's exclusive. That's exclusive of the fact that our kids are being poisoned. Don't take drugs, OK? Raise your hand. Raise your hand. Come here. Raise your hand. Raise it. Come here. You know, this is what people ask, why do I -- I said to my kids, no drugs, no alcohol, no cigarettes. Raise your hands, kids. I promise Donald J. Trump that I will never take drugs. I don't want to say no alcohol but take it easy on the alcohol, right? And you know what else? No cigarettes, right? All right, kids. Come here. Come here. Come here. Look. No, they're beautiful kids. But you know what happens once you get hooked on the alcohol or the drugs? It makes your life very hard. And the one thing I can tell you if you don't ever take it, you'll never get hooked. You know you'll never get hooked. So that's good. That maybe be the most important thing I've done today. So look, folks. We're going to have a strong border. We're going to start winning again. I hope on Tuesday you go out, you vote for me. I will not let you down. I promise. You will never see anything like you're going to see. I promise. So on Tuesday go out and vote. It'll be the greatest vote you've ever made. And we are going to start winning again. We will Make America Great Again. I love you. Thank you. Thank you. Thank you. Thank you, everybody. Thank you."}