{"id":418,"author":"Donald Trump","title":"Speech: Donald Trump in De Pere, WI","date":"2016-03-30","link":"https://factba.se/transcript/donald-trump-speech-de-pere-wi-march-30-2016","paragraphs":["Thank you. Thank you so much. Oh, what a group. And we love Green Bay, and I have to tell you, you have a really properly run team. Don't we agree? And Tom Brady's a great friend of mine from New England, OK? But -- but he said you have a great quarterback. That's nice right? When Tom Brady says it. That's nice.","And Tom -- Tom is a terrific guy, and he really does, he says the team is a great, really well-run team. So, for whatever that's worth, that's nice. Sit down everybody, let's have a little fun. Let's have a little fun. Thank you very much. I see so many young people in here but I see a couple of guys my age, right?","There's one right there. But I see a couple of guys my age. And I thought we'd do something a little different. We could talk a little bit about success for all the young people. The old people, who knows, maybe you'll become more successful. Maybe it'll give you -- you know we have thousands of people outside trying to get in. Does anybody want to leave?","We'll talk about -- does anybody want to leave? No, I'm only kidding. But -- but we have a lot of people. We have loudspeakers set up outside because they're hearing, so I really appreciate this incredible turnout. Wisconsin is very important. It's becoming more and more important. We can get there.","We have a movement going on. It's an incredible movement. It's a movement like they haven't seen in this country, maybe for a long, long time. It's been covered, recently, on the covers of Time magazine numerous times. It's been covered by everybody. Front page of The New York Times, front page of The Washington Post, front page of everything.","And it's an amazing thing to see. If you look, and I was just seeing -- even this morning, and I've known this statistic for a long time. But workers, people that work, people that work very hard, blue collar workers, for 12 years they haven't had an increase, an effective increase. And it could be a lot longer than that.","But you know, there's a lot of anger out there. There's a lot of anger from people that aren't angry people but they're upset with the way our country is run. You know, recently, I was interviewed by The New York Times, and to a certain extent, to The Washington Post. And they were asking me different foreign policy questions and one of the things that was brought up was NATO.","Now, I'm an entrepreneur. I've been very very successful. I built a great, great company. I posted numbers that were incredible numbers and all of that stuff. But you know, I haven't been big into NATO. But we also have instincts and we also have common sense and -- and I have, you know, studied it over the years and certainly read a lot about it. And I said it's obsolete.","And it is. It's obsolete. It's 68 years old it's -- it was done at a different time. It was done at a time when you had the Soviet Union, which was different than Russia, it was bigger than Russia. And Russia's plenty of problem but the Soviet Union was a bigger problem. And it was done before terrorism as we know it today.","And I said it's obsolete and I said we pay too much. You know, our country pays too much. Because a lot of you kids are going to go out looking for jobs. We don't have good jobs anymore. Our economy is -- is -- all of our good stuff is being taken. It's being taken over by China. The great jobs are being taken over by Mexico.","You look at Nabisco, you look at Carrier air conditioner, you look at Ford. They're moving into Mexico. And I said, look, with NATO and with so many other things, we pay too much. We're paying for such a big proportion. We have about 28 countries in NATO and we're paying a far disproportionate share. Well, we owe $19 trillion as a country.","We owe $19 trillion. We made a terrible, terrible budget deal. Like a disgusting budget deal. A budget deal that gave -- Obama gave people coming in from Syria, gave people coming in -- illegal immigration, all of the funding they need. And we get nothing out of it. I don't -- I don't get why we made the deal but we made it. But we're not going to make deals like that anymore.","But what happens is we're not keeping our great jobs, and frankly from the standpoint of all of the youth that I see before me, when you graduate from this great college -- I just met the heads of your college and they're amazing people and they love this place, and I could just see by the way they were talking, they have such pride in it. But when you graduate, you want to get great jobs.","You don't want to get bad jobs. What they call bad jobs. And even the people that talk about employment in this country, they agree that it's bad jobs. That's what we have now. We don't have the good jobs anymore. We have the bad jobs. And we don't want the bad jobs. Because the good jobs are away, they're not in this country.","And you know, they talk about a five percent unemployment rate. That was a statistic that was devised -- in terms of the way they devised the number and come to the number, the final conclusion, that was arrived at very, very simply. That was arrived at so that Presidents and politicians look good. It bears no relation -- in fact, when you say a five percent unemployment rate -- they even say it's less.","But that doesn't count all the people that looked and gave up looking for jobs. And you folks understand what I'm talking about. I have -- I do so many college tours now. This is different for me because, eight months ago, I wasn't a politician. I like that -- just great. I never thought I'd be a politician.","I can't believe I'm doing this to be honest with you. I dealt with politicians all my life. The last thing I wanted to do is be a politician. But we also want to make America great again. We're going to make America great again. It's not even a question. We're going to make America great again and that's why I'm doing it. And so I look at what's happening and I look at what's happening, just with one example, NATO, the billions of dollars that we spend.","All of that money that we spend and other countries have taking advantage of us. They're just taking advantage. They're not putting up their fair share. You look at the United Nations, same thing. I mean, what do we ever get out of the United Nations? You ever hear that the United Nations solved a problem?","It's become a political hornet's nest. We spent a fortune on it, disproportionate. Always disproportionate. You know it's never disproportionate in our favor. It's always disproportionate where the United States pays much more than anybody else, even though other people benefit much more than we do. So we're going to get it stopped.","We're going to get it stopped. And this is so important, what's happening now. And I'm here for the week and I've got a lot of stops. We had a great time yesterday. At CNN, we did a town hall last night, which was well-received and well reviewed. We have another one today and we have another one on Monday with Sean Hannity, and we have we have a lot of different things planned but I'm going to be here for a period of -- the week.","I have many friends in Wisconsin. I fully understand Wisconsin. I wouldn't say that your Governor loves me because -- no, I knocked him out. I mean, you know, he endorsed lying Ted Cruz. Lying Ted. A liar. He's a liar. Oh, Bible high. Bible high, puts it down and then he lies. You know he's a liar. I never met a liar like him.","I met a lot tougher people than him but I never met a guy that lied as much. Remember what he did to Ben Carson in Iowa? Ben has left the race. He has left the race. This is during the election. Election day. The votes are being cast. Ben has left the race. And you know, a lot of those people voted for Cruz.","And then after the election was over he called Ben, oh Ben, I didn't know anything about it. I didn't know but -- but I would -- I'd like to apologize. Oh, great that makes you feel better, right? No, I've never quite seen it. These politicians are bad dudes, right? I mean they're bad. What?","What'd he -- I think that was a -- Oh OK. I thought that was -- I know. I thought that was a positive statement. I said, oh no, not another agitator. I call them agitators, as opposed to protesters. Protesters are fine. Agitators are people that do it sort of semi-professionally.","And we have some professionals also. But -- but we're doing well. We have millions of votes more than Cruz. Millions of votes more than Kasich. Yesterday was certified. The numbers were certified in Missouri. So we won Missouri also. You know, they had a recount in Missouri, which we won. And now it was just certified.","We actually got 300 and something more votes, which didn't matter because we won the state. But we won Missouri. We had an interesting one, where we won Louisiana. But because of the -- let's call it politics. Let's not use any word other than politics. But I get less votes. I win it -- how would you like to be in a position like this?","You go out, you campaign, you go around, you make speeches, I went -- made a lot speeches in Louisiana, made -- the final speech was amazing. We were at airport, we're at a hangar. The hangar was like for massive airplanes, like 747s. The place was packed. And what did I do? I won. And then I found out, even though I won, I get less delegates than the guy that doesn't win.","You think that's fair? I mean, honestly, you think it's fair? Somebody said, well, you have to know -- you have to know anything. I got the most votes. I should win. I mean, it's very simple. I got the most votes and I didn't get the most delegates, right? So, the Republican Party hasn't treated me properly, in my opinion.","And they haven't. They haven't treated me fairly. But I've got millions of more votes and we have a movement going on. Millions of people are voting they didn't vote before, in Republicans. And many of them are voting for me, in all fairness. And the people that are coming across are Republicans but tremendous numbers of Democrats that like Trump, tremendous numbers of independents, and something that I love, people that have never voted before.","People that have never voted before because they've never had anybody they wanted to vote for. We're getting tremendous numbers of -- I didn't know there were so many people. But when I do handshaking and signings and things, I tell you what, every 20th person says to me, Mr. Trump, I've never voted before.","And these are 30-year old people, 40, 50, 60, 70, 80. In Tennessee we had one that was 93 years old, a woman. So beautiful. She was an incredible woman. So beautifully dressed, everything, and she had a trump sticker right on her -- on her dress. And I said, that's unbelievable. And she's 93 and everybody knew about it. It's actually a big story in Tennessee.","And she said she's voting for the first time because she really believes in what I'm saying. And what I'm saying is borders and I'm strengthening the military and taking care of our vets. Our vets are being treated horribly folks. I mean, without our vets, we would be nowhere. They're being treated horribly.","But all of these things, and millions and millions of people are coming in and voting in the Republican primaries. Some of the states are up 102 and 107%. I saw two of them. Massachusetts was up way up and that was -- I got almost 50% of the vote. Remember, when I get 50% or 48% but there are seven or eight or 10 people running, that's pretty amazing.","You know somebody said, he doesn't break for -- I watch some of these pundits on television. It's so sad to watch them. You know? Because the hatred is just -- I watch this guy, Krauthammer, he doesn't get 50%. He doesn't break 50%. I watch Karl Rove. He always talks about -- he's not breaking 50%. Well, it's hard to break 50% when you have 17 people running.","OK? I can't explain it to these people. You know, when you have 17 people -- we started off with 17 -- actually, truly, 18. But there were 17. And of the 17, I mean, you had senators, you had governors. You have guys like Ben Carson, who's a fantastic guy, who's a very accomplished guy and he's running, and Carly is running.","And you know -- but you had 17 really accomplished people. Most of them politicians. Most of them governors and senators. And they're going to have their three percent, they're four percent. You had Lindsey Graham. You had all of these people and they're taking votes, and then they say, Donald Trump has only hit 48%. I said, 48%? I mean, 48% is good if you have three people.","But I don't like it if you have two people but I like it if you have three. But -- but -- so we're doing amazingly well. A good poll came out the other day from NBC, which was at -- we were at 48%. You know? And I think they had three or four people in the poll but we were at 48%. So it's going really well.","Wisconsin is really important because, if we win Wisconsin, I think it's going to be very close. We're going to do really well in New York. We're going to do really well in New Jersey. I think we're going to do great in Pennsylvania. I went to school in Pennsylvania, the Wharton School of Finance, and I think we're going to do fantastically there.","But I just want to tell -- -- really love what you do in a good on business but you know what? If it's not necessarily that good, the loving is more important than having that good business. Some people want to be teachers. I mean, some of the happiest people and the most successful people that I know are people that aren't the richest at all.","They don't make, at all, the most money. They're teachers, they're scientists. I know people that are scientists, that are -- like they can't wait to get to work. They can't wait. Policemen. You know, our police departments are, I think, terribly disrespected. I think they're not given the credit for the great job they do. I have to be honest with you.","So true. And our vets and our our people, our military. But -- but I will tell you that the -- the happy people are the people -- number one, the people with the great families, people that have great relationships with their wives, their husband, very, very important towards success. Because I don't consider success necessarily monetary.","Because I know the most successful people in the world and many of these people are really miserable people. OK? No matter what -- and perhaps I'm in that category. OK? But I'm pretty happy. At least I'm very content, I can tell you. But some of the most successful people in the world -- I know, like, many of them.","I don't know all, I guess, but I know -- I seem to know all. And they cross my path a lot. And they're not necessarily happy people. They're very wealthy people but they're, in many cases, extremely unhappy. Now, with all of that, I don't want to talk you out of things because we're talking about success.","Most people think success is measured in the form of monetary success. It's not -- really. I mean, to me a successful person has a great family, who loves the family, loves the children and the children love him or her. To me that's a much more successful person than a person that's made a billion dollars or $10 billion, and is miserable and doesn't have a good family, and nobody likes the person and -- you know, I've seen them.","I've seen every -- I think I've seen every type of person there is that God created, if you want to know the truth. And the people are the happiest are not necessarily the people that are wealthiest, OK? But in terms of monetary success, it does make life easier. You don't have to worry about food and housing and education and sickness.","Your doctors, you go to the best doctors and hopefully that solves the problems. But they are -- it does make life easier. And I tell -- told so many stories about different types of people. For instance, you got to love what you do. You're going to never ever quit or give up. Never quit. You're going to be so close.","My father used to tell a story. He thought it was funny but I actually thought it was more of a lesson. He viewed it as funny and it was about a man who loved the cola business. He loved soft drinks. That's what he loved. He just loved the business. Isn't this strange, how people like different businesses?","Look at all these geniuses, the heads of your college. And I think you like this better than politics too. Don't we like this better? This politics, ugh. So what happens is -- he loved the cola business and he founded a company, it was called 3 Up. And my father would tell this story, he'd laugh, he'd laugh.","But I'd listen and I'd say, I don't want to laugh, it's a lesson. And he found his company, Three Up, and he was very proud but the company wasn't make it. It didn't work and he gave up and it was just not good and it went out of business. But he never wanted to quit. And he did another one. It was 4 Up and he did 5 Up and he did 6 Up. And they would all fail and he just kept failing, failing, failing and finally he gave up. And my father would say, if he only came up -- if he just worked a little bit harder, just one more, he would have had 7 Up and he would have been a tremendous success.","And I laughed because I think of my father telling me that story -- and we viewed it differently. And what I viewed it is not as comedy, I viewed it as never ever give up. You know? Just never give up. You can't. I view another word that you never hear when you're talking about success, and that's momentum.","Some people -- and you have to know. You have to know about yourself. You have to know about momentum. Some people have a great momentum. It's even like me on the campaign trail. I took off three or four days, which is a lot because I've been going for months without any -- a lot of people say, unlike Jeb, you are very high energy, right?","It's true. But you know, you take three or four days off and that first day or two back, it's like -- you know, you got to get going. You got to get going. It's almost like -- don't take any time off. Vacation, if you want vacations, you're not really in the right business. I hardly ever take time off because I love what I'm doing, whether it's my business or whether it's now this.","We're gonna make America great again. And whether it's this, no matter what. But the word momentum is a very important word, and you have to understand it and you have to understand how to think about momentum. And it's a word you never hear when you hear about success but it's so important. Now what happens is -- there was a man named William Levitt and I had great respect for him.","He was a great real estate person and he was a young man and he built Levittown. Has anyone ever heard of Levittown? Well, Levittown where these massive housing developments, largely in Long Island, Pennsylvania, different places but massive. He was really the first of the massive builders of homes. And he was a young man, he did unbelievably -- became very, very rich and everything he touched turned to gold and it was incredible.","And then what happened is he was offered a lot of money by Gulf and Western, it was a big conglomerate, to buy his company. And you have to understand, William Levitt used to go around looking for nails, looking for sawdust. He'd sell the sawdust. He'd save the nails and use them again. He'd save chips of wood and use them for different things.","Everything was perfect. He knew how to get zoning. He'd have lunch with the mayor. He'd have lunch with the council. he'd have dinner with everybody. He was a -- the ultimate professional real estate developer and he built Levittown. Remember, he was the first really large scale housing sprawl all over.","All over the country. Actually, they went all over the world. So Gulf and Western came to him and they offered him a lot of money. More money than he ever thought possible. And he took it and he said, oh boy, this is great. He then retired at a very young age. Very, very young. But he was going crazy. He was so bored.","He was going absolutely crazy. But they had a restrictive covenant, he couldn't compete. He couldn't do what he knew best, which was building housing. And so he was retired. He moved to the south of France. He bought a magnificent yacht. Unfortunately, he got divorced and he did a trophy wife thing. And you know, one of those things and -- terrible.","Terrible person to do that but he did it and -- but he had a wife who was a good wife, La Belle, and he named the boat after her, the yacht. And he was riding high. Everything was good. Now, he's getting a little older, he's still in retirement, lost his momentum. Remember the word. And Gulf and Western comes back and they're dying.","This is a big company but they're dying because they don't send people to pick up nails. They don't send people to sell the sawdust. They don't send people to take the little scraps of lumber and bring them down and sell them and get very small amounts of money but it all adds up. And they're losing their shirt with this company they bought.","They couldn't get zoning because they don't take the mayor out to dinner and they don't do the things that you have to do. And they couldn't get zoning, they had all this land, they went crazy with buying land. And they couldn't sell the company because it was a mess and they destroyed the company. And they went to William Levitt and they said, we'd love to sell you the company back.","He said, oh -- I think it was about 12 years -- he was out. He lost that -- whatever it is. And after 12 years they came to him, they said, we'd love to sell you the company back. Would you have any interest? Yes I would. I'd love to buy it back. So he bought this big company back. Bigger than what he sold.","He had all this land that was un-zoned and all. And he worked like crazy. He worked 24 hours a day. Work, work, work, work. And he went bankrupt. Out of business. Totally bankrupt. The biggest. He went bankrupt. And by this time he was an old guy and I was at a party and I was the new hot guy in New York.","I was doing great with real estate and I was on the covers of Businessweek magazine and Fortune magazine. I was doing really well. And there was a man named Steve Ross, and a lot of you folks would know, from Warner Communications. And he was a hot guy in entertainment. He built Time Warner and he was a great guy.","Passed away from from cancer, unfortunately, but he was an amazing guy. One of the great people in the history of the entertainment business. And he was giving a cocktail party, he had 50 people on his Fifth Avenue apartment. And I walk into the apartment. I was invited and I see 50 people, and most of them are in the entertainment business.","And I saw one person, pretty old guy and he was sitting in the corner, and his name was William Levitt. And I went over to him because I was attracted to him, because he was in my business. I didn't care about the entertainment people, I cared about him. And I said, Mr. Levitt, how are you doing? Donald Trump.","He said, yes, I know. He said, I'm not doing well. I'm not doing well at all. I said, I read that and it's too bad. What went wrong? And I'll never forget the expression of the statement. He said, Donald, I totally lost my momentum. So, the thing you probably never heard. He lost his momentum. He took that time off, he came back and it was a different world, and he lost his momentum.","Now, the real lesson there is, you have to know if you've lost your momentum, so that you don't get hurt. And it's just something that I talk about because it's so different. And I watched him sitting in this corner. I don't even know why he was there because he was no longer successful. But I guess Steve knew him and respected him for what he had accomplished.","Because what he had accomplished was amazing. He was the forerunner to so many massive developments that you see all over. But he said, I lost my momentum, Donald. I lost my momentum. I've never ever forgotten those words and I've always remembered them. And what you want to do is you want to keep going, keep going, keep going.","But if you think you lost your momentum, slow down and refocus on maybe something else. Because it's so important to keep the momentum going. OK? So important. So that's one of the many, many elements or stories. And one quick one that we also talk about, and that I talk about. There's a certain amount of luck.","Does anybody believe in luck? Does -- raise your hand. Who believes that some people are luckier than others, right? So I have a friend who's just an unlucky guy. Just an unlucky guy. He's smart. He went to the Wharton School of Finance. He's a very -- actually, he's a brilliant guy but he's always been unlucky, and no matter what happens, it just works that way.","And he never really succeeded. And you'll find, when you become very successful, the people that you will like best are the people that are less successful than you. Because when you go to a table, you can tell them all these wonderful stories and they'll sit back and listen. Does that make sense to you.","OK? Always be around unsuccessful people because everybody will respect you. Do you understand that? Anyway. But this guy, he had a thing and he just would be -- he was just like struck. He was unlucky. And no matter what he did, he'd always -- he was -- I call him injury-bound or he was just -- always something would happen.","So he'd be injured. I said, what happened? I broke my shoulder. How do you break your shoulder? Are you a football player? He goes, no, no I strip -- I slipped. I went down the stairs. So he's in the hospital and he's recovering in Long Island, and he comes back and he's being driven back -- and again, he's always injured.","He's injury-prone. You know the expression? Some people are injury-prone. Is anybody in this room injury-prone? Raise your -- oh, don't raise your hand. I don't even want to see. Don't do it because you'll convince yourself -- stand up, stand up, stand up back there. Are you really injury -- why, you're a big strong guy.","Are you a football player or something? You are? Oh, come on. OK, here's what you do. Tell yourself you're not injury-prone. Sit down, OK? Look at the size of that guy. How can he be injury-prone? Looks like he's on the Green Bay Packers. I mean, you know, give me a break.","But this guy was totally injury-prone. No matter what happened, totally injury-prone, and he'd always be ill. I'd always -- I'd call his wife and she'd say, oh no, he's very sick. What's wrong with him? And he -- tell me something. I'd say, all right. So he had a broken shoulder and now he's coming home.","Think of this. He's coming home from the hospital and he's riding on the Long Island Expressway, which is the longest parking lot in the world by the way, he's riding on the Long -- because it's so crowded. He's riding along the Long Island Expressway and an 18-wheeler hits the signs that say, to New York City, 10 miles, right?","Knocks over a sign. Think of this. He didn't get hit by the truck. He got hit by a sign. And I call up to make sure he's OK from the previous injury, and the wife says, no, no. We were taking him home and what happened is a big truck hit the big sign, the big stanchion, and the sign came down on the road and hit his car and now he's really in trouble, and now he's back in the hospital.","Well, just like that, there is a certain amount of luck. But the greatest story to me is Gary Player. Gary Player was a golfer. A great golfer. One of the great golfers of all-time. And he was -- they used to say he's diminutive. He was small. He worked harder than any human being. He worked harder than any other golfer but he was a small guy and he -- but he hit it good, he hit it far.","Great, great golfer. Everybody's heard of Gary Player, from South Africa. Still a great guy. Always kept himself in shape. I saw him the other day. He's like 80 years old. He's phenomenal. He still looks like he did 20 years ago. But Gary Player worked hard, and he was the first time -- maybe I've heard it again but he was the one -- the harder I work, the luckier I get.","That was Gary Player. He worked so hard. And they'd say to him -- he'd win the U.S. Open and they say, where are you going tonight? I'm going to practice. I mean, you just won a tournament and you're going to practice. And I have seen people that work really, really hard. They create, to a certain extent -- because I do believe there could be something with the whole luck thing.","But there are people that work hard. Remember that expression. The harder I work, the luckier I get. The harder he worked, he got stronger, stronger, longer, longer. He practiced putting, he practiced chipping. The guy was unbelievable. He won 18 majors, senior and regular. He won like 175 tournaments worldwide, which I think is the record.","But he was a hard worker. And he used to say -- they'd ask, how do you do this? How do you -- how are you so successful? He says, well you know the harder I work, the luckier I get. And I just think it's a great thing for all of the young people out here, and the older people. Hey I'm still working just as -- I think I work hard -- I think I'm working harder in the last eight months than I've ever worked before in my life.","Believe me. But I enjoy it. You have to really work. The harder you work -- remember, the harder you work, the luckier you get. So just remember those few little things. Momentum. Love what you do. Always love what you do. Always. One final story on success because I think it's a great thing. I have a friend who's a guy who was born to a very, very successful Wall Street Baron.","And the Wall Street Baron is a vicious ruthless horrible human being. OK? You would not like him for dinner. You'd respect him but you wouldn't like him. I mean, most of the people in the room would know who he is. One of the big barons of Wall Street. Very, very smart. Very vicious. Very ruthless. More so than you'd ever see in -- in a movie.","You know they can't make movies about guys like this. And he had a son who's a really nice guy. I have no idea how he produced this son. This son is the nicest human being. And the son was in the father's firm on Wall Street and the firm is a massive firm. And he was unable to compete, really, with all the young guns in the firm.","And the father sort of understood it. Loved his son but drove his son really terribly. And what happened is the son is at a club, he's a member of a country club out in Westchester, and they were doing a major, major renovation of the clubhouse and the greens and the golf course. A big, big renovation. And people sort of semi felt sorry for him almost.","And they made him -- they put him in charge. And he was fantastic. He was there at six in the morning and five in the morning, and he wouldn't leave till nine in the evening. And the job came in under-budget, ahead of schedule. The job turned out to be 10 times better than anyone ever thought. And he was so happy.","His wife called me, she said, he's like a new man. He's so, so happy. He's doing this and he's so happy. But he doesn't want to leave the firm because -- -- and he wouldn't leave. And I went and met with him, and I met with him and his wife, and not so long ago. And I said, so what are you going to do? He said, I've got to stay with the firm.","I said, you're making a huge mistake. Two years later he left the firm. He opened a construction company. He can never do what his father did but he's so happy. He's doing nicely. He's happy. His family loves him again. They couldn't stand him. He was a miserable unhappy guy. He could not compete. And he now goes around and renovates buildings -- he's the happiest guy in the world.","And in his own way, his father's too tough to say it, but in his own way his father is proud of what the son is doing. So I only say, really, love what you do and remember those other little things I told you, OK? So that's enough of success. Do we agree? Do we agree? Is that OK Mr. instructors. OK? I really wanted to -- I wanted to go into it. I don't think I've done that once.","I love speeches on success. I mean, to me, they're they're great and sometimes -- but I think that might be the first time I've ever done it on the political scene. And a couple of the older guys sitting in front, they've already made their millions. They're so rich. I don't know, right? You with the red -- stand up, stand up. With a red cap.","Look at that guy. Handsome guy. You've made millions, right? Millions or maybe less. But you're happy? Oh, U.S. Marine Corps. Are you -- were you in the Marines? Well see, that's success. And you're very proud of that, right? Same thing. It's all the same folks. It's all the same.","That's fantastic. Go ahead. Go ahead. Right. Well, are a lot of people are asking that question. A lot of people are asking that question. And he said something. He said when he was working -- and when he was not working, he had to go and work. No matter what. Even if it was part-time, you had to supplement your income.","Now you have people that aren't working. Look, it's all about incentive. People have to want to go out. They have to want to -- we have no incentive in our country anymore. We're losing in every way. We're losing in that way because we have so many people that don't want to work. We have so many people that, if given the right incentive, would love to work.","They'd love to do it. We don't have incentives anymore. We don't have spirit anymore. Our country doesn't have spirit. We lose in so many ways. Sit down. Thank you very much. I'll give you an example. When Scott Walker came out and ran for President, he was expected to win. I mean, during the course of my term, Jeb Bush expected to win.","Gone, right? Scott Walker expected to win. Gone. Rand Paul expected to win. Gone. They're all gone. I miss them. I'm like lonely. No, I'm lonely. And during debates -- we had 11 or 12 debates. And during the debates, every single debate that I participated in I've been at the center. The center means that you're number one.","And I used to say to CNN and Fox and the people that would have the debates, I'd say, well are you going to announce that center is number one? No, we don't do that. Why? Because nobody knows that. But some of them would do it. But I was at the center and I debated these people and -- I guess, won the debates because every single poll -- they have debate polls.","They have polls on everything. One thing. I think I've been polls hot. You know? I think I really have. Nobody used to talk about polls. Now everybody talks about polls. But every single online poll -- they Drudge, who's a fantastic guy by the way, Drudge. They have a Drudge poll, they have a Time magazine poll, they had a -- many, many polls and they'd have, who won the debate?","And I won the debate. And I would win every -- I think every single one of them, I won, according to the online polls. And the last poll, my wife said to me -- the last debate, she said, will you do me a favor? Be presidential. Don't be so vicious. Don't be so hard. Don't call him little Marco. Don't call him low energy Jeb.","Be nice. I said, but if I'm nice, I'll be presidential but I'm going to lose, right? I mean, I'm going to lose. And they were hitting me with everything. And the bottom line is, the last debate, I was -- I said, in fact Ivanka called me and my wife called me. They said, be president. I said, so what happens when they come and they say really nasty things and they lie and -- we don't care.","Be presidential. So I was pretty presidential in the last debate. Now, I actually thought that the other debates were much better. Personally. I think they were much more interesting. But I was presidential and I won that debate too. So you can win them all different ways. But look, we have a country that is in a lot of trouble.","We have people that are running that won't do a great job. I'm telling you, Hillary's a disaster. Hillary's a disaster. Hillary Clinton will be a disaster. A disaster as President and I will beat Hillary -- Ted -- Ted cannot beat Hillary. He will not be able to beat her with his strident manner. He will not be able to beat Hillary.","And believe me, the one person she doesn't want to run -- and I know this for a fact. The one person she does not want to run against is Donald Trump. But -- the one person, you know? A little while ago -- a couple of months ago she hit me with something. Even today she put an ad in. Did you see the ad? It's a New York City ad. It's talking about New York.","Except for one problem. She used a sign that's on Pennsylvania Avenue. I'm building a big hotel on Pennsylvania Avenue. A big beautiful hotel on Pennsylvania Avenue. You know why I'm building it? Because, if for some reason this doesn't work out, I'm going to live in Pennsylvania Avenue no matter what happens.","I don't care, OK? I don't care. No I'm building a big -- and she's got this sign. She's talking about New York but she's got the sign on Pennsylvania Avenue, which is sort of an interesting thing. Hillary's not going to win. Hillary's got so many problems and she's created so many problems. You look at Libya.","You look at what's going on there. You know that ISIS -- people don't talk about this. The press, I don't think they want to write again -- about it because it's so bad. In Libya, the oil, it's taken by ISIS. ISIS has the oil. So we had Gaddafi with the oil, and that was bad, but at least he killed terrorists, right?","Now we have Libya taking the oil. We have -- Libya is -- massive amounts of oil is going out. Why aren't we stopping this? Why do we allow this to happen? So ISIS has the oil. ISIS has some of the Iraq oil. They have some of the Syria oil. They don't have that much oil in Syria but they have what they have.","But you see what's going on. And you say, how is it possible that this isn't stopped? Can you imagine General Douglas MacArthur or General George Patton saying we can't do anything about it. We lose at everything. We lose with our military. We can't beat ISIS. We can't beat ISIS. We lose on education. Common Core is a disaster by the way.","It's a disaster. We have to bring education locally. We lose with health care. Obamacare is horrendous. Premiums are up 35, 45, 55%. The deductibles are so high you'll never get to use it. We lose with everything. Our Second Amendment is totally under siege, which we're not going to allow to happen. We lose with everything.","And when I watched Scott Walker endorse yesterday -- Although a lot of people didn't hear too much about his endorsement because of my manager. And I looked at the tapes I say, I don't know. Am I wrong? I looked at -- raise your hand. Did anything look very, I mean, strident? Did anything look -- did everybody see that tape?","Raise your hand if you saw that tape yesterday. Well, that's not that many people because it's a big story. How many thought it looked terrible? What he did. I mean, to me, it was breaking up. She's grabbing me. Grabbing. Did anybody think it was really terrible when he -- I mean where he should be fired, lose his job.","No, you know what I mean, right? They wanted me to fire him and destroy him and lose his job. Does anybody -- OK so a lot of people saw the tape. Who thought that it was terrible what he did? I mean, you know, it's lucky I had the tape. That was my tape. It's one of my places. I have cameras all over the place.","It wasn't meant for this stuff. It was meant for other things. Security. But -- but we have great cameras. Did -- OK so a lot of you saw the tape. Did anybody think it was a horrible thing what happened? I don't get it. I mean, we have -- we have people whose heads are big chopped off because they're Christian and for other reasons, in Syria, all over the Middle East.","We have people that are being drowned in cages, 50 at a time, in big steel cages. They're being dropped in to the waters and lifted up an hour later. And I'm trying to figure out -- and then you have Ted Cruz. He should be fired. I say, why? I don't do that. I'm loyal. He did a good job. Now, the girl made statements.","Actually, she made some terrible statements because she said that she was -- I mean I could read. Should I read the statement? Should I read? Does anybody want me to read it? Yes? I'll just read it quickly. Listen to this. This -- this young woman, reporter, who shouldn't have been where she was and she grabbed me twice.","She said, I was jolted backwards. She wasn't right. Did anyone disagree? Someone had grabbed me tightly by the arm and yanked me down. Did she go down? Did she even go a little down? Like a little. Like a couple of inches. Did she have any facial expression? If I bring one of these big strong guys up here, of which we have a lot in this room -- that's called Wisconsin, right?","Strong. Hey, if I bring a Green Bay Packer up here and if I give him a whack, he's going to go, ahh, and then he'll knock the hell out of you, right? After he recovers from shock. But -- but you know, you have a -- there's no facial expression. No nothing. So she said -- this the exact quote. I was jolted backwards.","Someone had grabbed me tightly by the arm and yanked me down. She didn't go down. I almost fell to the ground. She didn't almost fall to the ground. But was able to maintain my balance nonetheless. But I was shaken. Then she goes, campaign managers aren't supposed to try to forcibly throw reporters to the ground.","He didn't do that. And they put out a warrant. I mean what -- what do we -- what kind of a country are we in to destroy somebody? And what kind of a country are we in, when they go to Kasich, what would you do? I would fire him. They go to Ted Cruz, I would fire him. Folks, as your President -- you need somebody that's gonna be loyal to the country and to yourselves.","You need somebody that's gonna fight you. Now if she really did go down. If he did something like that. He would have been fired before she ever got up. OK? That I can tell you. If she were like -- if this stuff were so, I would have -- I but I looked at the tape and I'm trying to figure it out. So all of the people that saw the tape, do we agree with this?","Does anybody disagree? Could you stand up if you disagree with me? Because most of you saw it. Not one person in the room. It's a very, very -- and that's risky for me to do. You know, when I do that, the whole room stands up. Believe me that's going to be the number one story on television. Here's the bad news.","Because I have a room loaded with people and nobody stood up. It won't even be on television. Right folks? They won't even talk about it. They won't even talk about it. So I want to tell you a little bit about Wisconsin because people don't understand, and I wouldn't have done this except, Scott -- I've done it twice now.","I did it when he got out of the race. Because, you know, everyone thought he was doing a good job as Governor. And then what happened is -- didn't work out to be so good. And when I gave the numbers, he went from 22 or 24%, down to zero and he quit the race. He was one of the first people to quit. And I wouldn't do this except that he endorsed this guy Cruz.","And Cruz would be a terrible President. OK. So -- but he endorsed Cruz. So let me give you the story on Wisconsin. And by the way, Scott Walker was up to my office, about a year ago, handing me a plaque. He regrets that because I actually supported him. I gave him a lot of money. Like 50 or $100 thousand for his campaign or something.","I gave him a lot. I don't know what it was but it was a lot. In that vicinity. And he came up to my office, he gave me a plaque. We're trying to find it. It's on the bottom of a pile of plaques. I'm pretty sure I can find it. Actually, I got word that they found it. I'll have to how you. But look, I wrote these stats down.","I just write them down. And these are -- this is not Donald Trump doing numbers or anything. This is a straight -- if you know, right out of the book. By the summer of 2015 -- remember, this is your state that you love. That I love too. I have a lot of friends in Wisconsin. It's an amazing place. By the summer of 2015 Wisconsin was facing a $2.2 billion two-year budget deficit.","OK. That's bad. That's bad. Total state debt is $45 billion. Went up a lot. That's bad. That's a lot. That's at the higher end. That's really up there. I don't know if you folks know that. 20,000 fewer people in the labor force in Wisconsin than seven years ago, even though population has grown by 100,000. So you have 20,000 fewer people working, even though population growth has been increased by 100,000. I -- you know.","I see this guy in his Harley. He's always on a Harley. Rrr, rrr, rrr. I love the bikers. You know, the bikers love me. I was saying it. Do you know that? Do we have any bikers in this room? The bikers, right? The bikers love Trump. I went to Hilton Head and a couple of other -- there were hundreds and hundreds of bikers.","And the Secret Service says, stay away. I said, don't stay away. These are the greatest people. These people are amazing. For some reason, the bikers love me. I'm not a huge biker, I have to be honest with you, OK? I always like the limo better, right? The limo. But -- but the bikers love me. You know why they love me? And I asked a couple of them, why?","They say security, military, borders. You're the only guy that's going to do it. Sheriff Joe Arpaio, from -- as you know, from Arizona, the toughest. He endorsed me. Nobody tougher on the borders than Sheriff Joe. He endorsed me. So many people endorsed me. Such great endorsement. OK. 800,000 food stamp recipients.","Middle class hit hard due to job loss of manufacturing. The job loss. Now, both Ted Cruz and your Governor, and Kasich, are trying to approve TPP. Kasich approved NAFTA. He was a Congressman. He raised his hand. NAFTA has been a disaster for Wisconsin. It's been a disaster for the whole United States. We have lost so many companies and so many jobs.","Wisconsin has lost 15,000 net jobs to Mexico. You know about that right? Do you feel that? Can you feel it? Right? When I say that, that's a hell of a number. Since NAFTA, 15,000 jobs. 70,000 jobs you've lost to China. 100,000 illegal immigrants living in Wisconsin costing taxpayers $883 million a year. Now, this is out of the books.","I mean, you know. $883 million per year. Now, what happened is -- everybody thought Scott Walker was tough and doing a good job, and you know, he was fighting people and -- always fighting, fighting. It's better if you can do it without the fighting so much. You know, it's wonderful to fight. Let's fight.","But you know, how many times can you fight? I looked at your capital, every time they're throwing, they're going crazy. Be cooler if you could do -- get better results. How about getting a better result without the fighting? Wouldn't that be nice? It's like in New Hampshire. I spent $2 million and won. Jeb Bush spent $48 million.","He got beaten badly. Don't you want me as your President. Is that -- isn't that true? You know? I mean, I think, right? But Scott Walker was doing really well. He was leading the pack and I couldn't hit him because I'm a counter-puncher, I don't -- I cannot do it because I'm actually a nice person.","I cannot hit a person first. I've got to let them hit me first. So I was going along and I was really nice to Scott Walker. And then one of his people -- they had a fundraiser and he was calling me names. Come on to the Scott Walker fundraiser -- and I was so happy to hear it. He called me really terrible names, said horrible things about me, and they had a fundraiser.","And I said, Scott, your people shouldn't say that. They just shouldn't say it. And I did my number. I did, basically, what I'm doing now, except with much more vigor. OK? And within a matter of weeks, he was gone. Because nobody knew that. I'm sure a lot of the people in the audience didn't know these statistics, OK? But they're no good.","They're no good. Wisconsin's in the middle of the pack in terms of states from around the area. Wisconsin is not doing well. So he would have been better off if he didn't endorse Ted Cruz because now I'm just letting out facts that nobody would have even known. I'm telling you, nobody even knows these facts folks.","So winning Wisconsin is very important. On April 5th, you have the date. I hope you'll understand that this is a very important thing because we're -- I have far more delegates than anybody else. I have far -- do you ever hear Cruz get up say, I'm the only one that's proven that I can beat Donald Trump. I beat him here.","I won last night on the town hall. He said, we won the state of Utah in a tremendous victory. He didn't say that the same night I won the state of Arizona and got many, many more delegates, right? He didn't say it. He said, I'm the only one. So I think I have 21 or 22 states and he has, what, seven? But he'll say, I'm the only one.","I've proven -- and he uses this expression, I've proven time and time again that I can be Donald Trump. I've beaten -- I've killed this guy. I've killed him. I mean, it's really incredible. So lying Ted. He's lying Ted. But here's the thing, here's the thing. It's a very unfair situation though, because as I said before, getting to the 1,237 delegates is -- and by the way, Missouri just came in and it was certified, I won Missouri.","That happened yesterday so I'm very good. They were actually going over the numbers. He was supposed to win Missouri. So, probably, they went over the numbers. But he was supposed to win Missouri. So, probably, when I went they said, oh we want a recount, so they had a recount. You know what happened?","They found more than 300 more votes for me. So anyway -- so I won the state of Missouri, so that's good. And we picked up, I think, an extra 12 or so delegates, which is great. And they're great people. And I thought I'd win there. You know, I was told that I was going to lose there. I was told I was going to lose South Carolina.","I won in a landslide. I was told that I wouldn't win in New Hampshire. We won in a landslide. I was told that Nevada would be very, very difficult for me to win. I won in a landslide. And by the way, in the polls, I won all of the Hispanic -- I won the Hispanic by a lot. You know, because the Hispanics, they want jobs.","They want jobs to come into our country. They're smart. And one poll had me 25% with African-Americans, and one of the announcers said, if Trump got 25% with African-Americans, this election is over. You might as well not even have it. He wins. And I think I'll do great with African-Americans. So, we're going to have something special.","But really important is next week, on Tuesday the 5th, to get out and to vote. Because a movement is only a movement if the movement ends in greatness. Meaning, ends in making sure that our country really becomes great again. And we have so much room -- when I told you about NATO, when I told you about the United Nations, when I tell you about the waste, fraud and abuse all over the place -- when I tell you these other candidates, they want to knock out your Social Security, they want to knock out your Medicare.","You know Medicare is a program that works. There's a lot of waste fraud and abuse but it's a program that works. These people want to knock it out. I want to make our country rich again so that we can have it without knocking it out, and without doing anything to it other than running it better. So I just want to say that it's an honor to be here.","I love this school. This school is beautiful. And I want to thank you, I want to thank everybody for allowing us to use the auditorium. I wish you had a much bigger auditorium so we could take care of all the thousands of people outside, but that'll be next time, right? But go out, do a fantastic job for yourselves, especially the young folks.","And just remember this, we have a country that doesn't win anymore. If I'm elected President, we're going to win, win, win. We're going to win so much. I jokingly say, we're going to win so much you're going to get absolutely sick and tired of it. You're going to say please, please Mr. President, we can't stand it. We're winning too much.","And I'm going to say, sorry folks. We're going to keep winning because we're going to make America great again, OK? So I love you all and go out and do a great job, and good luck with your lives. Good luck with your lives. Thank you. Great school. Thank you. Thank you very much fellows. Thank you everybody."],"text":" Thank you. Thank you so much. Oh, what a group. And we love Green Bay, and I have to tell you, you have a really properly run team. Don't we agree? And Tom Brady's a great friend of mine from New England, OK? But -- but he said you have a great quarterback. That's nice right? When Tom Brady says it. That's nice. And Tom -- Tom is a terrific guy, and he really does, he says the team is a great, really well-run team. So, for whatever that's worth, that's nice. Sit down everybody, let's have a little fun. Let's have a little fun. Thank you very much. I see so many young people in here but I see a couple of guys my age, right? There's one right there. But I see a couple of guys my age. And I thought we'd do something a little different. We could talk a little bit about success for all the young people. The old people, who knows, maybe you'll become more successful. Maybe it'll give you -- you know we have thousands of people outside trying to get in. Does anybody want to leave? We'll talk about -- does anybody want to leave? No, I'm only kidding. But -- but we have a lot of people. We have loudspeakers set up outside because they're hearing, so I really appreciate this incredible turnout. Wisconsin is very important. It's becoming more and more important. We can get there. We have a movement going on. It's an incredible movement. It's a movement like they haven't seen in this country, maybe for a long, long time. It's been covered, recently, on the covers of Time magazine numerous times. It's been covered by everybody. Front page of The New York Times, front page of The Washington Post, front page of everything. And it's an amazing thing to see. If you look, and I was just seeing -- even this morning, and I've known this statistic for a long time. But workers, people that work, people that work very hard, blue collar workers, for 12 years they haven't had an increase, an effective increase. And it could be a lot longer than that. But you know, there's a lot of anger out there. There's a lot of anger from people that aren't angry people but they're upset with the way our country is run. You know, recently, I was interviewed by The New York Times, and to a certain extent, to The Washington Post. And they were asking me different foreign policy questions and one of the things that was brought up was NATO. Now, I'm an entrepreneur. I've been very very successful. I built a great, great company. I posted numbers that were incredible numbers and all of that stuff. But you know, I haven't been big into NATO. But we also have instincts and we also have common sense and -- and I have, you know, studied it over the years and certainly read a lot about it. And I said it's obsolete. And it is. It's obsolete. It's 68 years old it's -- it was done at a different time. It was done at a time when you had the Soviet Union, which was different than Russia, it was bigger than Russia. And Russia's plenty of problem but the Soviet Union was a bigger problem. And it was done before terrorism as we know it today. And I said it's obsolete and I said we pay too much. You know, our country pays too much. Because a lot of you kids are going to go out looking for jobs. We don't have good jobs anymore. Our economy is -- is -- all of our good stuff is being taken. It's being taken over by China. The great jobs are being taken over by Mexico. You look at Nabisco, you look at Carrier air conditioner, you look at Ford. They're moving into Mexico. And I said, look, with NATO and with so many other things, we pay too much. We're paying for such a big proportion. We have about 28 countries in NATO and we're paying a far disproportionate share. Well, we owe $19 trillion as a country. We owe $19 trillion. We made a terrible, terrible budget deal. Like a disgusting budget deal. A budget deal that gave -- Obama gave people coming in from Syria, gave people coming in -- illegal immigration, all of the funding they need. And we get nothing out of it. I don't -- I don't get why we made the deal but we made it. But we're not going to make deals like that anymore. But what happens is we're not keeping our great jobs, and frankly from the standpoint of all of the youth that I see before me, when you graduate from this great college -- I just met the heads of your college and they're amazing people and they love this place, and I could just see by the way they were talking, they have such pride in it. But when you graduate, you want to get great jobs. You don't want to get bad jobs. What they call bad jobs. And even the people that talk about employment in this country, they agree that it's bad jobs. That's what we have now. We don't have the good jobs anymore. We have the bad jobs. And we don't want the bad jobs. Because the good jobs are away, they're not in this country. And you know, they talk about a five percent unemployment rate. That was a statistic that was devised -- in terms of the way they devised the number and come to the number, the final conclusion, that was arrived at very, very simply. That was arrived at so that Presidents and politicians look good. It bears no relation -- in fact, when you say a five percent unemployment rate -- they even say it's less. But that doesn't count all the people that looked and gave up looking for jobs. And you folks understand what I'm talking about. I have -- I do so many college tours now. This is different for me because, eight months ago, I wasn't a politician. I like that -- just great. I never thought I'd be a politician. I can't believe I'm doing this to be honest with you. I dealt with politicians all my life. The last thing I wanted to do is be a politician. But we also want to make America great again. We're going to make America great again. It's not even a question. We're going to make America great again and that's why I'm doing it. And so I look at what's happening and I look at what's happening, just with one example, NATO, the billions of dollars that we spend. All of that money that we spend and other countries have taking advantage of us. They're just taking advantage. They're not putting up their fair share. You look at the United Nations, same thing. I mean, what do we ever get out of the United Nations? You ever hear that the United Nations solved a problem? It's become a political hornet's nest. We spent a fortune on it, disproportionate. Always disproportionate. You know it's never disproportionate in our favor. It's always disproportionate where the United States pays much more than anybody else, even though other people benefit much more than we do. So we're going to get it stopped. We're going to get it stopped. And this is so important, what's happening now. And I'm here for the week and I've got a lot of stops. We had a great time yesterday. At CNN, we did a town hall last night, which was well-received and well reviewed. We have another one today and we have another one on Monday with Sean Hannity, and we have we have a lot of different things planned but I'm going to be here for a period of -- the week. I have many friends in Wisconsin. I fully understand Wisconsin. I wouldn't say that your Governor loves me because -- no, I knocked him out. I mean, you know, he endorsed lying Ted Cruz. Lying Ted. A liar. He's a liar. Oh, Bible high. Bible high, puts it down and then he lies. You know he's a liar. I never met a liar like him. I met a lot tougher people than him but I never met a guy that lied as much. Remember what he did to Ben Carson in Iowa? Ben has left the race. He has left the race. This is during the election. Election day. The votes are being cast. Ben has left the race. And you know, a lot of those people voted for Cruz. And then after the election was over he called Ben, oh Ben, I didn't know anything about it. I didn't know but -- but I would -- I'd like to apologize. Oh, great that makes you feel better, right? No, I've never quite seen it. These politicians are bad dudes, right? I mean they're bad. What? What'd he -- I think that was a -- Oh OK. I thought that was -- I know. I thought that was a positive statement. I said, oh no, not another agitator. I call them agitators, as opposed to protesters. Protesters are fine. Agitators are people that do it sort of semi-professionally. And we have some professionals also. But -- but we're doing well. We have millions of votes more than Cruz. Millions of votes more than Kasich. Yesterday was certified. The numbers were certified in Missouri. So we won Missouri also. You know, they had a recount in Missouri, which we won. And now it was just certified. We actually got 300 and something more votes, which didn't matter because we won the state. But we won Missouri. We had an interesting one, where we won Louisiana. But because of the -- let's call it politics. Let's not use any word other than politics. But I get less votes. I win it -- how would you like to be in a position like this? You go out, you campaign, you go around, you make speeches, I went -- made a lot speeches in Louisiana, made -- the final speech was amazing. We were at airport, we're at a hangar. The hangar was like for massive airplanes, like 747s. The place was packed. And what did I do? I won. And then I found out, even though I won, I get less delegates than the guy that doesn't win. You think that's fair? I mean, honestly, you think it's fair? Somebody said, well, you have to know -- you have to know anything. I got the most votes. I should win. I mean, it's very simple. I got the most votes and I didn't get the most delegates, right? So, the Republican Party hasn't treated me properly, in my opinion. And they haven't. They haven't treated me fairly. But I've got millions of more votes and we have a movement going on. Millions of people are voting they didn't vote before, in Republicans. And many of them are voting for me, in all fairness. And the people that are coming across are Republicans but tremendous numbers of Democrats that like Trump, tremendous numbers of independents, and something that I love, people that have never voted before. People that have never voted before because they've never had anybody they wanted to vote for. We're getting tremendous numbers of -- I didn't know there were so many people. But when I do handshaking and signings and things, I tell you what, every 20th person says to me, Mr. Trump, I've never voted before. And these are 30-year old people, 40, 50, 60, 70, 80. In Tennessee we had one that was 93 years old, a woman. So beautiful. She was an incredible woman. So beautifully dressed, everything, and she had a trump sticker right on her -- on her dress. And I said, that's unbelievable. And she's 93 and everybody knew about it. It's actually a big story in Tennessee. And she said she's voting for the first time because she really believes in what I'm saying. And what I'm saying is borders and I'm strengthening the military and taking care of our vets. Our vets are being treated horribly folks. I mean, without our vets, we would be nowhere. They're being treated horribly. But all of these things, and millions and millions of people are coming in and voting in the Republican primaries. Some of the states are up 102 and 107%. I saw two of them. Massachusetts was up way up and that was -- I got almost 50% of the vote. Remember, when I get 50% or 48% but there are seven or eight or 10 people running, that's pretty amazing. You know somebody said, he doesn't break for -- I watch some of these pundits on television. It's so sad to watch them. You know? Because the hatred is just -- I watch this guy, Krauthammer, he doesn't get 50%. He doesn't break 50%. I watch Karl Rove. He always talks about -- he's not breaking 50%. Well, it's hard to break 50% when you have 17 people running. OK? I can't explain it to these people. You know, when you have 17 people -- we started off with 17 -- actually, truly, 18. But there were 17. And of the 17, I mean, you had senators, you had governors. You have guys like Ben Carson, who's a fantastic guy, who's a very accomplished guy and he's running, and Carly is running. And you know -- but you had 17 really accomplished people. Most of them politicians. Most of them governors and senators. And they're going to have their three percent, they're four percent. You had Lindsey Graham. You had all of these people and they're taking votes, and then they say, Donald Trump has only hit 48%. I said, 48%? I mean, 48% is good if you have three people. But I don't like it if you have two people but I like it if you have three. But -- but -- so we're doing amazingly well. A good poll came out the other day from NBC, which was at -- we were at 48%. You know? And I think they had three or four people in the poll but we were at 48%. So it's going really well. Wisconsin is really important because, if we win Wisconsin, I think it's going to be very close. We're going to do really well in New York. We're going to do really well in New Jersey. I think we're going to do great in Pennsylvania. I went to school in Pennsylvania, the Wharton School of Finance, and I think we're going to do fantastically there. But I just want to tell -- -- really love what you do in a good on business but you know what? If it's not necessarily that good, the loving is more important than having that good business. Some people want to be teachers. I mean, some of the happiest people and the most successful people that I know are people that aren't the richest at all. They don't make, at all, the most money. They're teachers, they're scientists. I know people that are scientists, that are -- like they can't wait to get to work. They can't wait. Policemen. You know, our police departments are, I think, terribly disrespected. I think they're not given the credit for the great job they do. I have to be honest with you. So true. And our vets and our our people, our military. But -- but I will tell you that the -- the happy people are the people -- number one, the people with the great families, people that have great relationships with their wives, their husband, very, very important towards success. Because I don't consider success necessarily monetary. Because I know the most successful people in the world and many of these people are really miserable people. OK? No matter what -- and perhaps I'm in that category. OK? But I'm pretty happy. At least I'm very content, I can tell you. But some of the most successful people in the world -- I know, like, many of them. I don't know all, I guess, but I know -- I seem to know all. And they cross my path a lot. And they're not necessarily happy people. They're very wealthy people but they're, in many cases, extremely unhappy. Now, with all of that, I don't want to talk you out of things because we're talking about success. Most people think success is measured in the form of monetary success. It's not -- really. I mean, to me a successful person has a great family, who loves the family, loves the children and the children love him or her. To me that's a much more successful person than a person that's made a billion dollars or $10 billion, and is miserable and doesn't have a good family, and nobody likes the person and -- you know, I've seen them. I've seen every -- I think I've seen every type of person there is that God created, if you want to know the truth. And the people are the happiest are not necessarily the people that are wealthiest, OK? But in terms of monetary success, it does make life easier. You don't have to worry about food and housing and education and sickness. Your doctors, you go to the best doctors and hopefully that solves the problems. But they are -- it does make life easier. And I tell -- told so many stories about different types of people. For instance, you got to love what you do. You're going to never ever quit or give up. Never quit. You're going to be so close. My father used to tell a story. He thought it was funny but I actually thought it was more of a lesson. He viewed it as funny and it was about a man who loved the cola business. He loved soft drinks. That's what he loved. He just loved the business. Isn't this strange, how people like different businesses? Look at all these geniuses, the heads of your college. And I think you like this better than politics too. Don't we like this better? This politics, ugh. So what happens is -- he loved the cola business and he founded a company, it was called 3 Up. And my father would tell this story, he'd laugh, he'd laugh. But I'd listen and I'd say, I don't want to laugh, it's a lesson. And he found his company, Three Up, and he was very proud but the company wasn't make it. It didn't work and he gave up and it was just not good and it went out of business. But he never wanted to quit. And he did another one. It was 4 Up and he did 5 Up and he did 6 Up. And they would all fail and he just kept failing, failing, failing and finally he gave up. And my father would say, if he only came up -- if he just worked a little bit harder, just one more, he would have had 7 Up and he would have been a tremendous success. And I laughed because I think of my father telling me that story -- and we viewed it differently. And what I viewed it is not as comedy, I viewed it as never ever give up. You know? Just never give up. You can't. I view another word that you never hear when you're talking about success, and that's momentum. Some people -- and you have to know. You have to know about yourself. You have to know about momentum. Some people have a great momentum. It's even like me on the campaign trail. I took off three or four days, which is a lot because I've been going for months without any -- a lot of people say, unlike Jeb, you are very high energy, right? It's true. But you know, you take three or four days off and that first day or two back, it's like -- you know, you got to get going. You got to get going. It's almost like -- don't take any time off. Vacation, if you want vacations, you're not really in the right business. I hardly ever take time off because I love what I'm doing, whether it's my business or whether it's now this. We're gonna make America great again. And whether it's this, no matter what. But the word momentum is a very important word, and you have to understand it and you have to understand how to think about momentum. And it's a word you never hear when you hear about success but it's so important. Now what happens is -- there was a man named William Levitt and I had great respect for him. He was a great real estate person and he was a young man and he built Levittown. Has anyone ever heard of Levittown? Well, Levittown where these massive housing developments, largely in Long Island, Pennsylvania, different places but massive. He was really the first of the massive builders of homes. And he was a young man, he did unbelievably -- became very, very rich and everything he touched turned to gold and it was incredible. And then what happened is he was offered a lot of money by Gulf and Western, it was a big conglomerate, to buy his company. And you have to understand, William Levitt used to go around looking for nails, looking for sawdust. He'd sell the sawdust. He'd save the nails and use them again. He'd save chips of wood and use them for different things. Everything was perfect. He knew how to get zoning. He'd have lunch with the mayor. He'd have lunch with the council. he'd have dinner with everybody. He was a -- the ultimate professional real estate developer and he built Levittown. Remember, he was the first really large scale housing sprawl all over. All over the country. Actually, they went all over the world. So Gulf and Western came to him and they offered him a lot of money. More money than he ever thought possible. And he took it and he said, oh boy, this is great. He then retired at a very young age. Very, very young. But he was going crazy. He was so bored. He was going absolutely crazy. But they had a restrictive covenant, he couldn't compete. He couldn't do what he knew best, which was building housing. And so he was retired. He moved to the south of France. He bought a magnificent yacht. Unfortunately, he got divorced and he did a trophy wife thing. And you know, one of those things and -- terrible. Terrible person to do that but he did it and -- but he had a wife who was a good wife, La Belle, and he named the boat after her, the yacht. And he was riding high. Everything was good. Now, he's getting a little older, he's still in retirement, lost his momentum. Remember the word. And Gulf and Western comes back and they're dying. This is a big company but they're dying because they don't send people to pick up nails. They don't send people to sell the sawdust. They don't send people to take the little scraps of lumber and bring them down and sell them and get very small amounts of money but it all adds up. And they're losing their shirt with this company they bought. They couldn't get zoning because they don't take the mayor out to dinner and they don't do the things that you have to do. And they couldn't get zoning, they had all this land, they went crazy with buying land. And they couldn't sell the company because it was a mess and they destroyed the company. And they went to William Levitt and they said, we'd love to sell you the company back. He said, oh -- I think it was about 12 years -- he was out. He lost that -- whatever it is. And after 12 years they came to him, they said, we'd love to sell you the company back. Would you have any interest? Yes I would. I'd love to buy it back. So he bought this big company back. Bigger than what he sold. He had all this land that was un-zoned and all. And he worked like crazy. He worked 24 hours a day. Work, work, work, work. And he went bankrupt. Out of business. Totally bankrupt. The biggest. He went bankrupt. And by this time he was an old guy and I was at a party and I was the new hot guy in New York. I was doing great with real estate and I was on the covers of Businessweek magazine and Fortune magazine. I was doing really well. And there was a man named Steve Ross, and a lot of you folks would know, from Warner Communications. And he was a hot guy in entertainment. He built Time Warner and he was a great guy. Passed away from from cancer, unfortunately, but he was an amazing guy. One of the great people in the history of the entertainment business. And he was giving a cocktail party, he had 50 people on his Fifth Avenue apartment. And I walk into the apartment. I was invited and I see 50 people, and most of them are in the entertainment business. And I saw one person, pretty old guy and he was sitting in the corner, and his name was William Levitt. And I went over to him because I was attracted to him, because he was in my business. I didn't care about the entertainment people, I cared about him. And I said, Mr. Levitt, how are you doing? Donald Trump. He said, yes, I know. He said, I'm not doing well. I'm not doing well at all. I said, I read that and it's too bad. What went wrong? And I'll never forget the expression of the statement. He said, Donald, I totally lost my momentum. So, the thing you probably never heard. He lost his momentum. He took that time off, he came back and it was a different world, and he lost his momentum. Now, the real lesson there is, you have to know if you've lost your momentum, so that you don't get hurt. And it's just something that I talk about because it's so different. And I watched him sitting in this corner. I don't even know why he was there because he was no longer successful. But I guess Steve knew him and respected him for what he had accomplished. Because what he had accomplished was amazing. He was the forerunner to so many massive developments that you see all over. But he said, I lost my momentum, Donald. I lost my momentum. I've never ever forgotten those words and I've always remembered them. And what you want to do is you want to keep going, keep going, keep going. But if you think you lost your momentum, slow down and refocus on maybe something else. Because it's so important to keep the momentum going. OK? So important. So that's one of the many, many elements or stories. And one quick one that we also talk about, and that I talk about. There's a certain amount of luck. Does anybody believe in luck? Does -- raise your hand. Who believes that some people are luckier than others, right? So I have a friend who's just an unlucky guy. Just an unlucky guy. He's smart. He went to the Wharton School of Finance. He's a very -- actually, he's a brilliant guy but he's always been unlucky, and no matter what happens, it just works that way. And he never really succeeded. And you'll find, when you become very successful, the people that you will like best are the people that are less successful than you. Because when you go to a table, you can tell them all these wonderful stories and they'll sit back and listen. Does that make sense to you. OK? Always be around unsuccessful people because everybody will respect you. Do you understand that? Anyway. But this guy, he had a thing and he just would be -- he was just like struck. He was unlucky. And no matter what he did, he'd always -- he was -- I call him injury-bound or he was just -- always something would happen. So he'd be injured. I said, what happened? I broke my shoulder. How do you break your shoulder? Are you a football player? He goes, no, no I strip -- I slipped. I went down the stairs. So he's in the hospital and he's recovering in Long Island, and he comes back and he's being driven back -- and again, he's always injured. He's injury-prone. You know the expression? Some people are injury-prone. Is anybody in this room injury-prone? Raise your -- oh, don't raise your hand. I don't even want to see. Don't do it because you'll convince yourself -- stand up, stand up, stand up back there. Are you really injury -- why, you're a big strong guy. Are you a football player or something? You are? Oh, come on. OK, here's what you do. Tell yourself you're not injury-prone. Sit down, OK? Look at the size of that guy. How can he be injury-prone? Looks like he's on the Green Bay Packers. I mean, you know, give me a break. But this guy was totally injury-prone. No matter what happened, totally injury-prone, and he'd always be ill. I'd always -- I'd call his wife and she'd say, oh no, he's very sick. What's wrong with him? And he -- tell me something. I'd say, all right. So he had a broken shoulder and now he's coming home. Think of this. He's coming home from the hospital and he's riding on the Long Island Expressway, which is the longest parking lot in the world by the way, he's riding on the Long -- because it's so crowded. He's riding along the Long Island Expressway and an 18-wheeler hits the signs that say, to New York City, 10 miles, right? Knocks over a sign. Think of this. He didn't get hit by the truck. He got hit by a sign. And I call up to make sure he's OK from the previous injury, and the wife says, no, no. We were taking him home and what happened is a big truck hit the big sign, the big stanchion, and the sign came down on the road and hit his car and now he's really in trouble, and now he's back in the hospital. Well, just like that, there is a certain amount of luck. But the greatest story to me is Gary Player. Gary Player was a golfer. A great golfer. One of the great golfers of all-time. And he was -- they used to say he's diminutive. He was small. He worked harder than any human being. He worked harder than any other golfer but he was a small guy and he -- but he hit it good, he hit it far. Great, great golfer. Everybody's heard of Gary Player, from South Africa. Still a great guy. Always kept himself in shape. I saw him the other day. He's like 80 years old. He's phenomenal. He still looks like he did 20 years ago. But Gary Player worked hard, and he was the first time -- maybe I've heard it again but he was the one -- the harder I work, the luckier I get. That was Gary Player. He worked so hard. And they'd say to him -- he'd win the U.S. Open and they say, where are you going tonight? I'm going to practice. I mean, you just won a tournament and you're going to practice. And I have seen people that work really, really hard. They create, to a certain extent -- because I do believe there could be something with the whole luck thing. But there are people that work hard. Remember that expression. The harder I work, the luckier I get. The harder he worked, he got stronger, stronger, longer, longer. He practiced putting, he practiced chipping. The guy was unbelievable. He won 18 majors, senior and regular. He won like 175 tournaments worldwide, which I think is the record. But he was a hard worker. And he used to say -- they'd ask, how do you do this? How do you -- how are you so successful? He says, well you know the harder I work, the luckier I get. And I just think it's a great thing for all of the young people out here, and the older people. Hey I'm still working just as -- I think I work hard -- I think I'm working harder in the last eight months than I've ever worked before in my life. Believe me. But I enjoy it. You have to really work. The harder you work -- remember, the harder you work, the luckier you get. So just remember those few little things. Momentum. Love what you do. Always love what you do. Always. One final story on success because I think it's a great thing. I have a friend who's a guy who was born to a very, very successful Wall Street Baron. And the Wall Street Baron is a vicious ruthless horrible human being. OK? You would not like him for dinner. You'd respect him but you wouldn't like him. I mean, most of the people in the room would know who he is. One of the big barons of Wall Street. Very, very smart. Very vicious. Very ruthless. More so than you'd ever see in -- in a movie. You know they can't make movies about guys like this. And he had a son who's a really nice guy. I have no idea how he produced this son. This son is the nicest human being. And the son was in the father's firm on Wall Street and the firm is a massive firm. And he was unable to compete, really, with all the young guns in the firm. And the father sort of understood it. Loved his son but drove his son really terribly. And what happened is the son is at a club, he's a member of a country club out in Westchester, and they were doing a major, major renovation of the clubhouse and the greens and the golf course. A big, big renovation. And people sort of semi felt sorry for him almost. And they made him -- they put him in charge. And he was fantastic. He was there at six in the morning and five in the morning, and he wouldn't leave till nine in the evening. And the job came in under-budget, ahead of schedule. The job turned out to be 10 times better than anyone ever thought. And he was so happy. His wife called me, she said, he's like a new man. He's so, so happy. He's doing this and he's so happy. But he doesn't want to leave the firm because -- -- and he wouldn't leave. And I went and met with him, and I met with him and his wife, and not so long ago. And I said, so what are you going to do? He said, I've got to stay with the firm. I said, you're making a huge mistake. Two years later he left the firm. He opened a construction company. He can never do what his father did but he's so happy. He's doing nicely. He's happy. His family loves him again. They couldn't stand him. He was a miserable unhappy guy. He could not compete. And he now goes around and renovates buildings -- he's the happiest guy in the world. And in his own way, his father's too tough to say it, but in his own way his father is proud of what the son is doing. So I only say, really, love what you do and remember those other little things I told you, OK? So that's enough of success. Do we agree? Do we agree? Is that OK Mr. instructors. OK? I really wanted to -- I wanted to go into it. I don't think I've done that once. I love speeches on success. I mean, to me, they're they're great and sometimes -- but I think that might be the first time I've ever done it on the political scene. And a couple of the older guys sitting in front, they've already made their millions. They're so rich. I don't know, right? You with the red -- stand up, stand up. With a red cap. Look at that guy. Handsome guy. You've made millions, right? Millions or maybe less. But you're happy? Oh, U.S. Marine Corps. Are you -- were you in the Marines? Well see, that's success. And you're very proud of that, right? Same thing. It's all the same folks. It's all the same. That's fantastic. Go ahead. Go ahead. Right. Well, are a lot of people are asking that question. A lot of people are asking that question. And he said something. He said when he was working -- and when he was not working, he had to go and work. No matter what. Even if it was part-time, you had to supplement your income. Now you have people that aren't working. Look, it's all about incentive. People have to want to go out. They have to want to -- we have no incentive in our country anymore. We're losing in every way. We're losing in that way because we have so many people that don't want to work. We have so many people that, if given the right incentive, would love to work. They'd love to do it. We don't have incentives anymore. We don't have spirit anymore. Our country doesn't have spirit. We lose in so many ways. Sit down. Thank you very much. I'll give you an example. When Scott Walker came out and ran for President, he was expected to win. I mean, during the course of my term, Jeb Bush expected to win. Gone, right? Scott Walker expected to win. Gone. Rand Paul expected to win. Gone. They're all gone. I miss them. I'm like lonely. No, I'm lonely. And during debates -- we had 11 or 12 debates. And during the debates, every single debate that I participated in I've been at the center. The center means that you're number one. And I used to say to CNN and Fox and the people that would have the debates, I'd say, well are you going to announce that center is number one? No, we don't do that. Why? Because nobody knows that. But some of them would do it. But I was at the center and I debated these people and -- I guess, won the debates because every single poll -- they have debate polls. They have polls on everything. One thing. I think I've been polls hot. You know? I think I really have. Nobody used to talk about polls. Now everybody talks about polls. But every single online poll -- they Drudge, who's a fantastic guy by the way, Drudge. They have a Drudge poll, they have a Time magazine poll, they had a -- many, many polls and they'd have, who won the debate? And I won the debate. And I would win every -- I think every single one of them, I won, according to the online polls. And the last poll, my wife said to me -- the last debate, she said, will you do me a favor? Be presidential. Don't be so vicious. Don't be so hard. Don't call him little Marco. Don't call him low energy Jeb. Be nice. I said, but if I'm nice, I'll be presidential but I'm going to lose, right? I mean, I'm going to lose. And they were hitting me with everything. And the bottom line is, the last debate, I was -- I said, in fact Ivanka called me and my wife called me. They said, be president. I said, so what happens when they come and they say really nasty things and they lie and -- we don't care. Be presidential. So I was pretty presidential in the last debate. Now, I actually thought that the other debates were much better. Personally. I think they were much more interesting. But I was presidential and I won that debate too. So you can win them all different ways. But look, we have a country that is in a lot of trouble. We have people that are running that won't do a great job. I'm telling you, Hillary's a disaster. Hillary's a disaster. Hillary Clinton will be a disaster. A disaster as President and I will beat Hillary -- Ted -- Ted cannot beat Hillary. He will not be able to beat her with his strident manner. He will not be able to beat Hillary. And believe me, the one person she doesn't want to run -- and I know this for a fact. The one person she does not want to run against is Donald Trump. But -- the one person, you know? A little while ago -- a couple of months ago she hit me with something. Even today she put an ad in. Did you see the ad? It's a New York City ad. It's talking about New York. Except for one problem. She used a sign that's on Pennsylvania Avenue. I'm building a big hotel on Pennsylvania Avenue. A big beautiful hotel on Pennsylvania Avenue. You know why I'm building it? Because, if for some reason this doesn't work out, I'm going to live in Pennsylvania Avenue no matter what happens. I don't care, OK? I don't care. No I'm building a big -- and she's got this sign. She's talking about New York but she's got the sign on Pennsylvania Avenue, which is sort of an interesting thing. Hillary's not going to win. Hillary's got so many problems and she's created so many problems. You look at Libya. You look at what's going on there. You know that ISIS -- people don't talk about this. The press, I don't think they want to write again -- about it because it's so bad. In Libya, the oil, it's taken by ISIS. ISIS has the oil. So we had Gaddafi with the oil, and that was bad, but at least he killed terrorists, right? Now we have Libya taking the oil. We have -- Libya is -- massive amounts of oil is going out. Why aren't we stopping this? Why do we allow this to happen? So ISIS has the oil. ISIS has some of the Iraq oil. They have some of the Syria oil. They don't have that much oil in Syria but they have what they have. But you see what's going on. And you say, how is it possible that this isn't stopped? Can you imagine General Douglas MacArthur or General George Patton saying we can't do anything about it. We lose at everything. We lose with our military. We can't beat ISIS. We can't beat ISIS. We lose on education. Common Core is a disaster by the way. It's a disaster. We have to bring education locally. We lose with health care. Obamacare is horrendous. Premiums are up 35, 45, 55%. The deductibles are so high you'll never get to use it. We lose with everything. Our Second Amendment is totally under siege, which we're not going to allow to happen. We lose with everything. And when I watched Scott Walker endorse yesterday -- Although a lot of people didn't hear too much about his endorsement because of my manager. And I looked at the tapes I say, I don't know. Am I wrong? I looked at -- raise your hand. Did anything look very, I mean, strident? Did anything look -- did everybody see that tape? Raise your hand if you saw that tape yesterday. Well, that's not that many people because it's a big story. How many thought it looked terrible? What he did. I mean, to me, it was breaking up. She's grabbing me. Grabbing. Did anybody think it was really terrible when he -- I mean where he should be fired, lose his job. No, you know what I mean, right? They wanted me to fire him and destroy him and lose his job. Does anybody -- OK so a lot of people saw the tape. Who thought that it was terrible what he did? I mean, you know, it's lucky I had the tape. That was my tape. It's one of my places. I have cameras all over the place. It wasn't meant for this stuff. It was meant for other things. Security. But -- but we have great cameras. Did -- OK so a lot of you saw the tape. Did anybody think it was a horrible thing what happened? I don't get it. I mean, we have -- we have people whose heads are big chopped off because they're Christian and for other reasons, in Syria, all over the Middle East. We have people that are being drowned in cages, 50 at a time, in big steel cages. They're being dropped in to the waters and lifted up an hour later. And I'm trying to figure out -- and then you have Ted Cruz. He should be fired. I say, why? I don't do that. I'm loyal. He did a good job. Now, the girl made statements. Actually, she made some terrible statements because she said that she was -- I mean I could read. Should I read the statement? Should I read? Does anybody want me to read it? Yes? I'll just read it quickly. Listen to this. This -- this young woman, reporter, who shouldn't have been where she was and she grabbed me twice. She said, I was jolted backwards. She wasn't right. Did anyone disagree? Someone had grabbed me tightly by the arm and yanked me down. Did she go down? Did she even go a little down? Like a little. Like a couple of inches. Did she have any facial expression? If I bring one of these big strong guys up here, of which we have a lot in this room -- that's called Wisconsin, right? Strong. Hey, if I bring a Green Bay Packer up here and if I give him a whack, he's going to go, ahh, and then he'll knock the hell out of you, right? After he recovers from shock. But -- but you know, you have a -- there's no facial expression. No nothing. So she said -- this the exact quote. I was jolted backwards. Someone had grabbed me tightly by the arm and yanked me down. She didn't go down. I almost fell to the ground. She didn't almost fall to the ground. But was able to maintain my balance nonetheless. But I was shaken. Then she goes, campaign managers aren't supposed to try to forcibly throw reporters to the ground. He didn't do that. And they put out a warrant. I mean what -- what do we -- what kind of a country are we in to destroy somebody? And what kind of a country are we in, when they go to Kasich, what would you do? I would fire him. They go to Ted Cruz, I would fire him. Folks, as your President -- you need somebody that's gonna be loyal to the country and to yourselves. You need somebody that's gonna fight you. Now if she really did go down. If he did something like that. He would have been fired before she ever got up. OK? That I can tell you. If she were like -- if this stuff were so, I would have -- I but I looked at the tape and I'm trying to figure it out. So all of the people that saw the tape, do we agree with this? Does anybody disagree? Could you stand up if you disagree with me? Because most of you saw it. Not one person in the room. It's a very, very -- and that's risky for me to do. You know, when I do that, the whole room stands up. Believe me that's going to be the number one story on television. Here's the bad news. Because I have a room loaded with people and nobody stood up. It won't even be on television. Right folks? They won't even talk about it. They won't even talk about it. So I want to tell you a little bit about Wisconsin because people don't understand, and I wouldn't have done this except, Scott -- I've done it twice now. I did it when he got out of the race. Because, you know, everyone thought he was doing a good job as Governor. And then what happened is -- didn't work out to be so good. And when I gave the numbers, he went from 22 or 24%, down to zero and he quit the race. He was one of the first people to quit. And I wouldn't do this except that he endorsed this guy Cruz. And Cruz would be a terrible President. OK. So -- but he endorsed Cruz. So let me give you the story on Wisconsin. And by the way, Scott Walker was up to my office, about a year ago, handing me a plaque. He regrets that because I actually supported him. I gave him a lot of money. Like 50 or $100 thousand for his campaign or something. I gave him a lot. I don't know what it was but it was a lot. In that vicinity. And he came up to my office, he gave me a plaque. We're trying to find it. It's on the bottom of a pile of plaques. I'm pretty sure I can find it. Actually, I got word that they found it. I'll have to how you. But look, I wrote these stats down. I just write them down. And these are -- this is not Donald Trump doing numbers or anything. This is a straight -- if you know, right out of the book. By the summer of 2015 -- remember, this is your state that you love. That I love too. I have a lot of friends in Wisconsin. It's an amazing place. By the summer of 2015 Wisconsin was facing a $2.2 billion two-year budget deficit. OK. That's bad. That's bad. Total state debt is $45 billion. Went up a lot. That's bad. That's a lot. That's at the higher end. That's really up there. I don't know if you folks know that. 20,000 fewer people in the labor force in Wisconsin than seven years ago, even though population has grown by 100,000. So you have 20,000 fewer people working, even though population growth has been increased by 100,000. I -- you know. I see this guy in his Harley. He's always on a Harley. Rrr, rrr, rrr. I love the bikers. You know, the bikers love me. I was saying it. Do you know that? Do we have any bikers in this room? The bikers, right? The bikers love Trump. I went to Hilton Head and a couple of other -- there were hundreds and hundreds of bikers. And the Secret Service says, stay away. I said, don't stay away. These are the greatest people. These people are amazing. For some reason, the bikers love me. I'm not a huge biker, I have to be honest with you, OK? I always like the limo better, right? The limo. But -- but the bikers love me. You know why they love me? And I asked a couple of them, why? They say security, military, borders. You're the only guy that's going to do it. Sheriff Joe Arpaio, from -- as you know, from Arizona, the toughest. He endorsed me. Nobody tougher on the borders than Sheriff Joe. He endorsed me. So many people endorsed me. Such great endorsement. OK. 800,000 food stamp recipients. Middle class hit hard due to job loss of manufacturing. The job loss. Now, both Ted Cruz and your Governor, and Kasich, are trying to approve TPP. Kasich approved NAFTA. He was a Congressman. He raised his hand. NAFTA has been a disaster for Wisconsin. It's been a disaster for the whole United States. We have lost so many companies and so many jobs. Wisconsin has lost 15,000 net jobs to Mexico. You know about that right? Do you feel that? Can you feel it? Right? When I say that, that's a hell of a number. Since NAFTA, 15,000 jobs. 70,000 jobs you've lost to China. 100,000 illegal immigrants living in Wisconsin costing taxpayers $883 million a year. Now, this is out of the books. I mean, you know. $883 million per year. Now, what happened is -- everybody thought Scott Walker was tough and doing a good job, and you know, he was fighting people and -- always fighting, fighting. It's better if you can do it without the fighting so much. You know, it's wonderful to fight. Let's fight. But you know, how many times can you fight? I looked at your capital, every time they're throwing, they're going crazy. Be cooler if you could do -- get better results. How about getting a better result without the fighting? Wouldn't that be nice? It's like in New Hampshire. I spent $2 million and won. Jeb Bush spent $48 million. He got beaten badly. Don't you want me as your President. Is that -- isn't that true? You know? I mean, I think, right? But Scott Walker was doing really well. He was leading the pack and I couldn't hit him because I'm a counter-puncher, I don't -- I cannot do it because I'm actually a nice person. I cannot hit a person first. I've got to let them hit me first. So I was going along and I was really nice to Scott Walker. And then one of his people -- they had a fundraiser and he was calling me names. Come on to the Scott Walker fundraiser -- and I was so happy to hear it. He called me really terrible names, said horrible things about me, and they had a fundraiser. And I said, Scott, your people shouldn't say that. They just shouldn't say it. And I did my number. I did, basically, what I'm doing now, except with much more vigor. OK? And within a matter of weeks, he was gone. Because nobody knew that. I'm sure a lot of the people in the audience didn't know these statistics, OK? But they're no good. They're no good. Wisconsin's in the middle of the pack in terms of states from around the area. Wisconsin is not doing well. So he would have been better off if he didn't endorse Ted Cruz because now I'm just letting out facts that nobody would have even known. I'm telling you, nobody even knows these facts folks. So winning Wisconsin is very important. On April 5th, you have the date. I hope you'll understand that this is a very important thing because we're -- I have far more delegates than anybody else. I have far -- do you ever hear Cruz get up say, I'm the only one that's proven that I can beat Donald Trump. I beat him here. I won last night on the town hall. He said, we won the state of Utah in a tremendous victory. He didn't say that the same night I won the state of Arizona and got many, many more delegates, right? He didn't say it. He said, I'm the only one. So I think I have 21 or 22 states and he has, what, seven? But he'll say, I'm the only one. I've proven -- and he uses this expression, I've proven time and time again that I can be Donald Trump. I've beaten -- I've killed this guy. I've killed him. I mean, it's really incredible. So lying Ted. He's lying Ted. But here's the thing, here's the thing. It's a very unfair situation though, because as I said before, getting to the 1,237 delegates is -- and by the way, Missouri just came in and it was certified, I won Missouri. That happened yesterday so I'm very good. They were actually going over the numbers. He was supposed to win Missouri. So, probably, they went over the numbers. But he was supposed to win Missouri. So, probably, when I went they said, oh we want a recount, so they had a recount. You know what happened? They found more than 300 more votes for me. So anyway -- so I won the state of Missouri, so that's good. And we picked up, I think, an extra 12 or so delegates, which is great. And they're great people. And I thought I'd win there. You know, I was told that I was going to lose there. I was told I was going to lose South Carolina. I won in a landslide. I was told that I wouldn't win in New Hampshire. We won in a landslide. I was told that Nevada would be very, very difficult for me to win. I won in a landslide. And by the way, in the polls, I won all of the Hispanic -- I won the Hispanic by a lot. You know, because the Hispanics, they want jobs. They want jobs to come into our country. They're smart. And one poll had me 25% with African-Americans, and one of the announcers said, if Trump got 25% with African-Americans, this election is over. You might as well not even have it. He wins. And I think I'll do great with African-Americans. So, we're going to have something special. But really important is next week, on Tuesday the 5th, to get out and to vote. Because a movement is only a movement if the movement ends in greatness. Meaning, ends in making sure that our country really becomes great again. And we have so much room -- when I told you about NATO, when I told you about the United Nations, when I tell you about the waste, fraud and abuse all over the place -- when I tell you these other candidates, they want to knock out your Social Security, they want to knock out your Medicare. You know Medicare is a program that works. There's a lot of waste fraud and abuse but it's a program that works. These people want to knock it out. I want to make our country rich again so that we can have it without knocking it out, and without doing anything to it other than running it better. So I just want to say that it's an honor to be here. I love this school. This school is beautiful. And I want to thank you, I want to thank everybody for allowing us to use the auditorium. I wish you had a much bigger auditorium so we could take care of all the thousands of people outside, but that'll be next time, right? But go out, do a fantastic job for yourselves, especially the young folks. And just remember this, we have a country that doesn't win anymore. If I'm elected President, we're going to win, win, win. We're going to win so much. I jokingly say, we're going to win so much you're going to get absolutely sick and tired of it. You're going to say please, please Mr. President, we can't stand it. We're winning too much. And I'm going to say, sorry folks. We're going to keep winning because we're going to make America great again, OK? So I love you all and go out and do a great job, and good luck with your lives. Good luck with your lives. Thank you. Great school. Thank you. Thank you very much fellows. Thank you everybody."}