{"id":420,"author":"Donald Trump","title":"Speech: Donald Trump Holds a Town Hall Event in Janesville, WI","date":"2016-03-29","link":"https://factba.se/transcript/donald-trump-speech-janesville-wi-march-29-2016","paragraphs":["Thank you, everybody. Wow. Thank you. I feel so badly. Outside we have 5,000 people and they can't get in. I feel badly. I want to apologize. We have speakers outside but I want to apologize. Who would have thought, we have over 5,000 people cannot get in. So, now does anybody want to leave and give your place to somebody outside?","I had a feeling you might be saying that. It's an honor to be here. It's an honor to be with you. And very important, you know, we're doing really well. Millions of votes ahead of Cruz, millions. You know I get a kick, I call him lying Ted, lying Ted Cruz. He stands up and I'm winning -- I win, as you know.","You've seen it. I have been winning all of the Evangelical vote. But he stands up, Bible high, puts it down and then he lies, you know. Isn't it kind of amazing? It's amazing to watch it. But he said, yo, I'm the only one that can beat Donald Trump. I've done it time after time. And I said, wait a minute, I've won like most of the states.","I think he had five or six and I had 20 or 22, right? And I said I can't believe it. Then I have millions of votes more. He says I'm the only one that can outvote him. And I'm saying, but I have like millions of votes more. I'll tell you something, it's so important. There is something happening, it's like a movement.","It's incredible. It's a movement and we're part of the movement. It's not me, I'm a messenger, to be honest. I'm a messenger and this is something that's so special and so amazing. And it's on the cover of Time Magazine. It's on the cover of every newspaper. It's something that has never -- that has maybe never happened and they're saying it's a phenomena.","Sometimes they say I'm a phenomena, I'm not. The message is what we want. We want jobs, we want jobs. We want trade deals that are smart deals not stupid deals. And you know, Wisconsin, I wrote down some notes. Look, I didn't think I thought I had a -- you know, it's one of those things. Look, I wrote down some notes and it's like -- it's like devastating.","So Walker came out today. I wrote down notes about Wisconsin. Look, he certainly can't endorse me after what I did to him in the race, right? But look at this, by the summer of 2015, Wisconsin was facing a $2.2 billion two-year budget deficit. That's terrible. By the way, these are out of books, right? This isn't Trump.","This is out of books. Total state debt is $45 billion. Now maybe somebody is going to tell me that's wrong, but again these are the -- $45 billion, very high. One of the higher ones. 20,000 fewer people in labor force in Wisconsin than seven years ago even though population has grown by 100,000. So your population is higher.","And -- now I wouldn't have done this but would he endorse Cruz? What am I going to do? Am I going to say he's doing a great job? He's not doing a great job. You know he comes in in his motorcycle jacket, a big Harley, I love Harleys, right? But the motorcycle guys like Trump. They really like Trump. And he doesn't look like a motorcycle guy to me, I'm sorry.","I'm sorry. Unemployment rate, well, they say I can't be possible. Unemployment rate, they have down 20%, that can't be possible. What? Is it 20%? Effective or regular? I mean, just -- effective unemployment rate, 20%. Hey, this is out of the big book. 800,000 food stamp recipients, middle class hit very, very hard due to loss of manufacturing jobs.","These are -- these are the stats, right? You know about this, right? It goes on and on. Wisconsin has lost 15,000 net jobs to Mexico since NAFTA. Now just so you understand, Kasich is running also. We forget about him. He voted for NAFTA. Both of them want TPP. TPP, Trans-Pacific Partnership. Both of them want Trans-Pacific.","That will make NAFTA look like a baby. And Wisconsin will be hit so hard. You're a motorcycle guy? I'll bet, right? Am I right? Do they love Trump? I don't even know why. I'm not big with the motorcycles but the motorcycle guys love Trump. Look, I love the disabled veterans and the veterans. We're going to take care of our veterans.","You know that, right? We're going to take care of our veterans. What is it about Trump that they like? I'm serious. We went to Hilton Head. We went to different places and there were hundreds, hundreds of bikers out there. Beautiful bikes, lots of Harleys, right? Lots of Harleys but made in America. But beautiful, beautiful bikes.","What is it with the motor -- why do they like me? Tell me. Who said that? Who is that? I love it. I don't know what it is but they like me. I feel good with them. I feel safe. I got out, I took a picture. Secret Service went crazy. I said these are great people, don't worry about it. But listen, I appreciate it, fellows.","I appreciate it. I know. Just keep you free. You're right. We're going to keep you free. I'm going to keep you free because we're getting rid of ISIS. We're going to have good borders. We're going to borders again. We're going to have borders again. So here -- here we have something that's pretty interesting.","I love you, too. You lost 70,000 jobs to China. 70,000 jobs. 100,000 illegal immigrants living in Wisconsin. Taxpayers are paying tens of millions of dollars a year. Look, I don't know. Look, I don't know. So what happened with Walker -- and I just, we'll finish you off with this.","He's a nice man. He came up to my office like about a year ago before I was -- I did the run. And you know, I've been a politician for what, about eight months, right? I never thought I'd be a politician. The last thing on my mind I want to be was a politician. But I built a great company. I filed papers.","Everybody's -- I mean, the company is incredible. Very little debt, tremendous cash flow, some of the great assets of the world. And I say that not in a bragging way. I say that because that's the kind of thinking we need, folks. I mean, I'd look -- we can't have China ripping us off and Mexico and Japan and Vietnam.","We can't have it. We can't have it. And they are ripping us like they've never ripped anybody before. We've rebuilt China. I mean, we're rebuilding Mexico. You looked the other day, you saw a Carrier moving down, Carrier Air Conditioner. I buy those air conditioners, a lot of them. I'm not buying anymore of them but Carrier Air Conditioner, moving to Mexico.","Ford, moving to Mexico. Nabisco, home of the wonderful former -- formerly wonderful Oreo, which we don't need anymore, right? We don't need it. We don't need it. Number one, it's a good way if it's a good order. It's called an enforced diet. But you know what, look, we're losing our jobs. Look at your jobs.","When I see that statistic, I mean, you're losing your jobs. When I went after your governor when he decided to run and I said, you know, I'm going to be nice to him. He's a nice guy. The guy came up to my office. He handed me a plaque because I supported him. What do I know? I support him, I gave him $50,000 or $100,000. That's a lot of money for a guy you never met before, right?","That's pretty good. But I like the fact he was fighting, fighting. He was always fighting. You know, to a certain extent I'd rather see somebody who are able to make a deal without having to go through all of that mess. But he was fighting and I gave him a lot of money. And he came up, you know, a year ago or so and he gave me a plaque.","Beautiful picture of something. I haven't -- I never really got to read it, to be honest. And I put it aside, that was it. I just had my girl find it. She just called, she said, Mr. Trump, I've just found it. A wonderful woman comes up and I said where is it? She said I think I know. And she found it under a pile of a lot of other plaques.","So -- so I'll bring it. I'm going to try getting it if I can tomorrow or the next day so that will -- because I'm going to be here the whole week. I'm going to be in Wisconsin the whole week because -- because if we win Wisconsin, it's like going to be over, pretty much over because we're going to do great.","Emerson -- because Emerson poll -- Emerson poll came out. I think I have 67%, 68% in New York compared to like 10% or whatever and you had Cruz talking about New York values. New Yorkers are no good. New Yorkers -- I watched New Yorkers rebuild the World Trade Center. I watched New Yorkers dying. Believe me, New Yorkers are good.","New Yorkers are very good. But Cruz said they're no good. So anyway -- so I think we're going to do great in New York. We're going to do great in New Jersey. Chris Christie endorsed me. We'll do great in New Jersey. Good guy. Ben Carson endorsed me, Sarah Palin, Sarah Palin endorsed. Sheriff Joe from Arizona, we love Sheriff Joe.","And you know with the Evangelicals I've had so many ministers, I've had so many pastors endorse me and Jerry Falwell Jr. endorsed me. It was incredible. And we've done so well with the Evangelicals. I mean, Christians, Evangelicals, we've done so well. In fact, in South Carolina, when we went to South Carolina that was going to be Cruz's territory.","He was going to take it except we won in a landslide. You know that you saw it. He was there. This guy follows me around, I'll tell you. But you were there, right? You remember, he was going to win that in a landslide. And then I started speaking, I started talking to people and I started saying, you know, the good and the bad and the ugly.","And we won in a landslide. And we won the Evangelicals. I've won just about, I think, almost every place I've won with Evangelicals. And it's been an amazing -- it's been an amazing time. So now I'm here to talk to the people of Wisconsin. I have friends in Wisconsin. I've been here before. It's an incredible place but it's a place that has problems.","But you have a Governor that has you convinced that it doesn't have problems. Now I remember when he was on the campaign trail, I was so nice to him. You know, I said how can I hit him? I'm not going to hit him, I'm not going to hit him. And I was so nice. I hit Jeb instead, right, right? And I hit Rand, Rand, the Rand.","And I hit a lot of people and they all went down. Wouldn't it be nice to have a President that could just, with his mouth, make things happen that are positive, you know? But it's not with a mouth, it's really with the mouth, the heart and the brain, remember the brain. I have a lot of friends. They're good with the mouth but they're not -- when they're not good with the brain, it all doesn't work, OK? You know, we had an interesting thing today.","A poll came out, a nationwide poll, it was a great poll. It was Trump, 48. It was an NBC poll. Trump, 48. I think Cruz was second in the low -- in the 20s, mid-20s-something and Kasich was way down. So what happened is they show the poll. It was an NBC poll. They got NBC monkey poll and it was on The Today Show and it was on Morning Joe.","Morning Joe held it up. He said, wow, those are great numbers. 48 is pretty good. You have three people, you know, I don't get enough credit for that. I've been at 42, 44, 45 and I've had like seven people. How do you get 45 when you have seven people? Nobody says that. They said, he hasn't cracked 50 yet.","How do you crack 50 when you have all these people running. So I'm at 48. Paul was good. Way, way ahead of anybody else nationwide. And they showed Hillary Clinton, hers is very close. Got a little problem. Good to happen. Got a bigger problem with the e-mails than she has, I think, with Bernie to be honest with you.","She should have. Her bigger problem should be with e-mails. We'll find out. We'll find out how honest our country is, right? But -- but she's got a sort of close race. And they put her poll up, it was, you know, put up there, big letters. And then they said, and Donald Trump is winning. That was it. They didn't say -- they didn't put numbers up. They didn't say I'm doing great.","In fact, they actually said Donald Trump is winning and they put some -- a little slightly negative statistic in. It was like, wait a minute, they put her numbers up and they didn't put my numbers up. Folks, it's so unfair. The press is so dishonest, it's unbelievable. That was Chuck Todd. That was -- that was Chuck Todd this morning on The Today Show.","Check it out. They put Hillary's numbers up and I'm winning by a lot. And they said Donald Trump is winning, you know. Let's go to a new subject, OK? Now I guarantee you one thing, if I was losing or doing poorly, it would still be up. It would be up all morning because they don't like what's happening. I'm self-funding my campaign.","I'm putting up my own money. They don't like it. Ted Cruz and Kasich are getting money from the banking industry, from the energy industries. They're getting money from the pharmaceutical companies. They're getting money from everybody. Folks, you can't straighten out this mess. We're in a mess if you can't do what you have to do. When millions of dollars are given to Cruz and Kasich, and millions from different industries, you're not going to be able to say, well, we're going to do and go against the banking industry to do what's right for the people.","If the banking industry gave you millions of dollars. Now that's true with Hillary also because she's gotten millions of dollars. But I'm the only one self-funding my campaign. I'm in for a lot of money. I mean, a lot of money. What was beautiful is when I was running against Jeb in New Hampshire. I was in for $2 million, Jeb was in for like $48 million.","I was in first and he was close to last. I said, who do you want as your President? By the way, did Jeb endorse anybody yet? Because I think Jeb probably endorse, must have endorsed. Huh, did he endorse? That shows you how important it is. Nobody even knows. I don't even know. No, you probably. Look, he'll endorse, just say you know, look, when you're in war you got to fight and you fight hard.","When I fight, I win. You're going to win. You know that. You're going to win. But you know, you do pretty serious damage, right? Because you want to win, you want to win fast. And a lot of people don't love you after you've finished. But I just love. I don't care about them. In fact, in fact, they're asking Cruz, you know, at the debate, which by the way, they said I won every single debate.","Now, I heard the other night he said I want to debate Trump. I've debated him 11 or 12 times. Every single online poll has me winning the debates. And he's an OK debater but he's a bad talker. You know, everything's so dramatic. Oh, and he waits phony and he waits. You know, have you ever seen, he goes sentence after sentence, and he stops for like three, four seconds, and then he goes again, it looks like we're in the theater.","We're not in the theater. We're in the real world. So, so what happens. Thank you. That's all right. Thank you very much. Thank you very much. By the way, the sheriff is here. He's a great guy and his people are fantastic. Thank you, Sheriff. Thank you. The -- I mean, the only thing I feel so guilty about are all the people outside.","So I feel so guilty. We're going to come back. I'm going to come back. We're going to come back to this area. You guys, you guys cannot come, OK? All of the ladies can come but the guys can't. But, but, but all of the people outside, we're going to take a bigger place. We're going to -- we're going to get some because I feel, I feel slightly, I feel slightly guilty.","But look, look, we have a very serious mess on our hands. We have a serious situation. We have a country that's not protected. We have a country that's sitting on a big fat bubble that's going to explode. In a certain way, I said let it do now. Don't do it after I get in. Three days later, it will explode.","They'll say it's Trump's fault, OK? Ayayay, we are in a big, fat, ugly bubble. We have interest rates that are so low, that if you're rich like me, I can borrow money for any amount. If you're a hardworking guy with a great farm or you're a hardworking developer or a businessman, you can't borrow money. You can only borrow money really cheaply.","Think of how bad that is. You can borrow money for nothing practically if you're rich. But if you're rich you don't need the money. So you don't have to borrow it but if you're a business person you want to go to the bank for a loan you can't get it. The regulators are running the banks. Dodd-Frank is a disaster by the way.","It's a disaster. It's a disaster. But the biggest disaster, our regulations, our rules regulations are horrible. We're going to get rid of probably 85% of them. There are some we live with but we got to go back. So many people from this area have told me regulations, regulatory climate is the worst they've ever seen it. I have a friend who's a farmer and if a puddle forms they consider it a lake for purposes of environmental.","They consider -- it's like a puddle and they consider it a lake. So -- but we don't know what we're doing. So here's what's happening. We're going to make our country so great again. We're going to make our country so strong again. Our military is going to be so amazing. We're never going to have to use it. Don't forget I didn't want to go into Iraq.","All these guys think that I'm a tough guy so I'll be so quick with the trigger. I'm not going to be quick. I was the slowest with the trigger. I didn't want the trigger. Now, when Obama left though, he shouldn't have left the way he did. He gave a certain date and the enemy said it can't be possible. Nobody would be that stupid.","Nobody. So I actually don't think it hurt that much because I don't think the enemy ever believed that anybody would be stupid enough to give a date. We're leaving on this date and then he left. They said he was serious. They pulled back. They pulled back then you see what happened. They pulled back and then they went in with fury.","But how about the 50 soldiers. He sold -- a couple of months ago, a few months ago. He sent 50 of our finest and instead of just sending them quietly, quietly sending them, what does he do? He sends them in and he makes a big press conference or announcement that we are sending 50 soldiers into Iraq, Syria, and now these soldiers have a big target on their back.","Why can't we just keep our mouths shut? Why can't we be unpredictable, unpredictable, right? Why can't we be unpredictable? Why does he have to tell? First of all, it doesn't even sound good when you say 50 soldiers because it sounds like so small. People would say is it good or bad? I mean, that sounds small but then when you think about it, why, why do we have to say that?","These are extraordinary people. These are our finest and they're, you know, very dangerous mission. Why would you tell people that we're sending them in? You just keep -- you keep quiet and let them accomplish something. They are right now -- who knows what's happened to them? But right now they have a big target on their back.","People that we've let go of Gitmo have now killed Americans. You've seen that, you saw that yesterday, that came out yesterday. We let people go out of Gitmo and they kill Americans, OK. Is anybody surprised at that though? Would anybody be surprised? And we're keeping it open. Now, they're spending, you know, hundreds of millions to run it. I guarantee you could run it a lot cheaper.","You'd have a lot of money left over. So we're going to get efficiency in Government but we're going to end Obamacare. We're going to -- we're going to replace it. We're going to replace it with something so much better and so much less expensive. We're going to get rid of Common Core. We're going to bring our education local.","We are going to preserve our Second Amendment. It's under siege. It's totally under siege. And Christianity is under siege. I'll tell you, Christianity is under siege. You take a look, I'm with these -- I'll tell you what I've been with so many pastors lately, and Jerry Falwell, Jr. is an example, he was telling me that -- Well, first of all, he told me something.","He says you remind me so much of my father. I thought his father was a great guy. What his father did with Liberty College and Liberty University and then Jerry to top it off, has taken that to a whole new place. But when Jerry was so strong and so great. But I was talking to -- I probably had 50 of the ministers and pastors, different folks came up to my office, and they're really under tremendous pressure because they don't want to have their tax-exempt status taken away.","This happened during the Lyndon Johnson Presidency. And I said why is it that you folks are pushed around so much, Christianity? These are the pastors and these are strong people. These are really strong people. Why do you allow them? Why aren't you more forceful? And finally, somebody said, well, we have to be a little careful of our tax-exempt status.","I said when did that happen? Actually, it was during the Johnson. Well, we're going to try getting rid of that, OK? Because that's really terrible. We're going to try getting rid and I've said that to -- I've said that to a lot of Evangelicals, a lot of great Christians. We're going to try getting rid of it because it's taken -- it sort of means that somebody walking down the street has more power than somebody of religion, of our religion, of Christianity.","Somebody that an Evangelical. You take anybody, they have more power because these people are powerless. They've actually taken their right of free speech away. So I said we're going to try and get rid of that and I think we'll be very, very successful. You know, it's interesting. I said how many Christians are there?","Because you know we've got men, we've got women. You cut it in half, we actually have a few more women but we have far more Christians, and we have men or women. So in a way, it's the most powerful, lobbyists, the biggest group of people. But we're not allowed -- they're not allowed to talk because they're petrified.","You saw what was happening with the IRS and you saw what was taking place with regard to certain groups. So we are going to try, and usually when I say try that means I'm going to get it done. That means I'm going to get it done. But we are going to try very hard. We're going to get that brought back.","And I think it's going to be very hard to counter it because if the Christians, and if they look, if the whole Evangelical Christian sector gets together nobody, nobody can beat. You know, when I made the statement about Muslims, banning Muslims on a temporary basis, I took such heat. Now, people are saying, you know, Trump is sort of right about that.","Now, they're all going, wow, because I see what's happening. And I think about what he said it about Christians I would have had less opposition. That's what's happened in this country, OK? That's what's happened in our country and we can't, we can't let it happen. We're going to turn this country around and we're going to be the smart people.","We're not going to be the dummies anymore. We're not going to be where China made last year trade deficit, $505 billion with a B, billion dollars. Japan, over $100 billion. Mexico, $58 billion. We're going to build a wall and Mexico's going to pay for the wall, OK? I remember, I -- recently I was in Florida and Marco, who's a nice guy actually, you know, do you notice how nice they are after you've defeated them?","I like everybody I defeat but when I went against Marco, it was supposed to be a very, oh, boy. Well, he started it, right? Just like Cruz started the last deal. He started it but Marco came after me very viciously. You know, he wanted to be Don Rickles, right? And it didn't work. But what happened is, what happened is I won by 20 points, almost 20 points and a lot of these issues we were talking about.","It was big issues and frankly, I wish I would have left about two days early. I wanted to stay in the Florida campaign. I wish I would have devoted two more days to Ohio because I almost won in Ohio. I would have won Ohio but I didn't want to take a chance on leaving my beautiful Florida. Look, because I love Florida and I wanted to win that.","So if I would've left a couple of days early, I think I would have won Florida, probably by the same, but I'm not going to have anything happen to Wisconsin. We have to win. If we -- look, we have to put these politicians in their place, folks. It's time. And believe me, you know, Cruz likes to pretend he's an outsider.","In the meantime, he gets all the Establishment support, including your Governor. So believe me, believe me, they're all Establishment. And frankly, in a way, it's worse because Cruz is Establishment and yet he's got no relationship with the Establishment. He goes and he stands on the floor of the Senate for a day and a half and he filibusters and these Senators, look, I know they're tough cookies.","I have the best -- I have one of the great people, Senator Jeff Sessions. He's good. Nobody better than Jeff. And you know, Cruz thought he was going to have them and he'd use them in his speech. Senator Jeff Sessions and then he comes out and endorses me. But when you think of it, look, out of all of these Senators, he has one supporter, Lee, who's his friend.","I mean, it's his friend. But I'm sure, and by the way, it took him plenty time to do it. But you know, to stand there and to rant and rave for two days, and to show people here you can filibuster. In the meantime, nothing was accomplished. Cruz has not accomplished one thing. So he's an insider but it's almost like the man on the street because he can't get anything done.","He dislikes people, he calls people, like for instance, he said horrible things about the speaker, and you know, the -- he said about the speaker and he said about separately, Mitch McConnell. I mean, he said some terrible things about -- how do you get things done when you're calling Mitch McConnell bad names, OK? Let's just say bad names.","So he's sort of got the worst of all elements. He's an insider totally but he can get nothing done, OK? He can get nothing done. Your new Speaker -- how do you like Paul Ryan? How do you like him? Do you like him? Wow, I was told be nice to Paul Ryan because -- really? All right. Well, he's the Speaker.","He's a nice guy. He called me the other day, he was very nice but I'm very surprised at this statement. Wow. Are you all Republicans? Are you mostly Conservatives? Because I don't care. You know the word can -- I always say I'm a commonplace. Just a common-sense Conservative.","And so, so important, a common sense. And then somebody told me today that somebody else, I think Walker used my term. You know Walker used -- I said Make America Great Again. I said Make America Great Again. And I copyrighted the term and then Walker was making a speech many months ago when he first started and he was saying, Make America Great Again because he saw the response I got.","The difference is he didn't get any response. You know it's sad to know but we told him you can't do that. That was the first little problem I had with him he said you had to -- Now, I said a commonsense Conservative. And today, I heard he used the term because the press was up and they interviewed me, and they said he said he's a commonsense Conservative.","Well, I coined the phrase a few months ago but that's what I am. I'm a conservative person. I'm very, very conservative on the military. I'm very conservative with our vets and on healthcare and on lots of things. But -- and I'm actually very conservative on trade but a lot of people would say he's not that conservative on trade because he doesn't believe in free trade.","Well, actually I do believe in free trade but it's got to be a good trade for us, right? It's got to be smart trade. It can't be where Wisconsin is losing thousands and thousands of jobs where you, folks, can't get into China but China comes in here like it's, like it's Swiss cheese. That's what happens.","You know China does not obey the rules. Now, I get along great with China. I made a fortune dealing with China. I have two buildings because of China. Big ones in New York and one in San Francisco, Bank of America that I have in partnership with a great company and it's because of China. I sell -- I have the biggest one of the big leases with one of their big banks.","With the biggest bank in the world actually from China. I sell millions and millions of dollars to kind of -- condos to people from China. I like China. I'm not angry at China. I like them. I think their leaders are doing a great job for them. But our leaders are doing a bad job for us. Same with Mexico, I get along great.","The Hispanics, I love the Hispanics. I love the Hispanics but their leaders are killing us on the border and they're killing us on trade. And I'm not angry at them. I'm angry at our country and our leadership because it's grossly incompetent and we're going to change it around and we're going to get the best and we're going to get the finest.","So what I thought I did -- thank you, folks. Thank you. Thank you very much. I appreciate it. So whatever you can do to spread the word. I'll be around. I'm going to Green Bay. I love that team by the way. You're talking about a great franchise. No, I love it and you have a truly great quarterback.","I don't know he's probably endorsing somebody else but I don't care. He's still a great quarterback. Tom Brady's a friend of mine. He said you have a great quarterback. That's all I need, right? When Tom says he's a great quarterback. That's pretty good. But you know, I really want to win Wisconsin because if we can win Wisconsin.","We're going to put all the stupidity away. We're going to put these, these stupid, stupid people that allow and I'm talking about basically politicians, and in many cases, you know, a lot of times people will see deals that are done. And I mean, take a look at the Iran deal. How bad is that? I mean, just as a deal, forget about countries.","But many times people say, deals that the country makes, right? Deals with -- and they'll say, how can our politicians be so stupid? They're not stupid. They've been hit by the lobbyists and the special interests and they make a fortune, OK? They get tremendous campaign contributions. They're not stupid.","They're doing it for themselves. So again, I'm not doing that. I'm doing for you. I'm working for you. But just remember, they're not so stupid like you think. But when you look at the people funding Cruz's campaign and Kasich's campaign, and you look, don't forget, Cruz said oh, the banks, the banks, you know, he's going to be Robin Hood.","He's going to be this great guy. And then in his personal financial disclosure form, he forgot to mention that he borrowed about $1 million from the banks, Citibank and Goldman Sachs, they borrowed $1 million at an interest rate that everybody in this room would be proud to have, a very low-interest rate, almost no interest.","He forgot to announce it on his personal financial disclosure form. He just forgot. He said, oh, I forgot, I forgot, I forgot. You know, so then he hits the banks. He's controlled by these people folks, OK? I mean, what he did was absolutely wrong but they're controlled by these people. I'm controlled by you.","I'm going to do the right thing for you, OK? So remember that. So let's take a few questions and then I'm off to Green Bay. I love that, OK? Let's go. Go ahead. Go ahead. Yeah. Go ahead. My biker, my biker friends. We have to start with them.","22 veterans a day commit suicide. That's correct.","We're going to take care of our veterans so much. Look, let me tell you. They -- many of them kill themselves waiting for a doctor. They can't even get to see the doctor you know that. They end up killing themselves before they see the doctor. 22 a day and a lot of people don't even believe that number. They think it's almost like an impossible number.","How could it be so bad? And it's actually could even be worse than that. But we are going to take care of them from the standpoint, they wait, they wait, then they get bad service, and they wait some more, six, seven, eight days, and sometimes they'll get to see the doctor and the doctor says, I can't see you now, I'm going on vacation.","Do you see the corruptness? I just left Phoenix. We had 21,000 people. Sheriff Joe was there. The job he did was incredible, incredible. And you know, they had a little protest, right? That protest ended so -- he arrested three people, everyone else scattered. You know, a lot of -- and you have that kind of a sheriff here.","You have a tough cookie here. I can tell you. I just met him and I can tell you. But we're going to -- well, you know, I have a great policy plan and I've gotten a lot of credit for it. In -- it's on donaldjtrump.com and with the veterans, when they're waiting for exorbitant times, even for a little time, they're going to go to the doctor, they're going to go to local doctors or local hospitals, many of the hospitals are dying for business you know that.","They're dying, these hospitals, some of these hospitals are dying. They're going to get immediate treatment, immediate service, we're going to pay the bill, and we're going to save a fortune, and they're going to get great service. And everybody is in love with it. Everybody loves it. And that's what's going to happen.","So we're going to take care of our veterans. If we can't take care of our veterans, we can't take care of anyone. So we're going to take care of our vets. Go ahead. One more from my other biker friend here.","Boy, do you look good though. You look good and tough. I wouldn't want to fight you. Do you think I could take you in a fight? I don't think so. What do you think? How about we do it right now? That would be great for television. Go ahead. But I do have more hair than him, right? Go ahead.","Yeah. Right now it's terrible. Why did they say? I mean, if you could say it, why are you unemployable?","OK. I got it. But --","Right, I know that. Daycare's a problem.","Yeah, no --","Right.","Right. I know. So for this --","Let me tell you. Here's the problem. Our veterans are taking worse care off than illegal immigrants who come into the country illegally.","So you don't even have to write it down. We're going to do things about it. You know what? Because I know, do you know what you're saying? I've heard this so many times before with the daycare and everything else. We are going to take care of our vets.","That's right.","And by the way, by the way, speaking of increase, Cruz and Kasich want to destroy your Social Security, folks, OK? I want to bring money back into this country. I want to bring jobs into this country. I want to bring tremendous wealth into this country. I want to take our wealth back from China, from Mexico, from all of these countries that have our wealth.","They've taken it like we're a bunch of babies and we're going to save your Social Security and we're going to save your Medicare. They want to get rid of it, OK? Remember that.","You could do that. You could do that.","I want to -- I want to not use too many Executive Orders, folks. You know, because you know, Executive Orders, sort of came about more recently, nobody ever heard of an Executive Order. Then, all of a sudden, Obama because he couldn't get anybody to agree with him he starts signing them like their butter.","So I want to do away with Executive Orders for the most part but look, just do me a favor stick with me. You're going to be, OK. All right. All right? OK? You're going to be OK. I know what you've said. I've heard a hundred times. And the day care is a huge problem, huge problem. And your wife not working.","Huge problem. She can't. So anyway and I'll bet you have a great wife, good wife?","Better believe it. OK. Go ahead.","Right.","Well, what we're doing, we're ending Common Core. You're not going to be educated -- your kids in Wisconsin are no longer going to be educated in Washington D.C. by bureaucrats, many of whom, I can't say all, but many of whom don't care for your kids. They couldn't care less. They get big fat salaries. Your kids are going to be educated locally.","We're terminating Common Core and you will see something, you will see something that's magic. And I've seen it where parents and all of these people, they're all in the -- the uncles, the aunts, they're all on school boards. They get professionals, they have great principals. You can't see what's going on from Washington D.C. Many of the people never even come here.","They sit behind a desk in Washington. They draw big salaries and they're telling you how to educate your kids. Not going to happen that way. And I've even seen it where the kid graduates, the child graduates, and those parents stay on. They love it because their child went through the system. They love it and they become so good at it. That's what's going to happen.","We're one of the worst in the world in education. We're going to be one of the better ones. Not necessarily, and I don't know that we're going to beat Sweden, Norway, Denmark, and China, but we're going to come very close, OK. Yes, go ahead.","Discipline in school? I don't think that Wisconsin should have a big problem with discipline. You have a problem with discipline?","You're from where?","Oh, that's interesting. OK. Well, we have to get discipline back in the country. Forget about school. We have to get disciplined. I mean, I have a case, I have a wonderful guy, a campaign manager. You talk about discipline and you probably saw what happened today with my campaign. He's a good guy, Corey.","And by the way, the easiest thing, Corey, you're fired. I can't do that. Can't do it. So, fortunately, I have a taping system. You know a very -- I'm rich so I have tapes so long. So this young woman who complained was, oh, she was talking about being maybe thrown to the floor and all this. I said, oh, that's horrible and then we saw the tapes.","Did anybody see the tape? What did you think, right? Nothing. Women. So what did you think?","I mean, she wasn't like her face stayed the same. If somebody squeezed your arm or did something really bad, don't forget, initially she said thrown to the floor. But if somebody squeezed your arm or hurt you, wouldn't you start screaming or something?","Did you see any change in her face?","Yeah. It's the same. It's it's horrible. It's horrible. It's honestly, it's horrible. And the best thing I could do is say -- but I can't destroy a man. I've got a beautiful wife and children and I'm not going to destroy a man for that. And you know when I saw that at the tape, at first, I said, oh, this is terrible.","Then, I saw the tape. It's my tape. I'm the one that had the tape. It's on the ceiling of this incredible Club in Jupiter, Florida. And we're all leaving and we have a press conference, right? And the press conference lasted a long time it's like 45 minutes so that was enough. I'm leaving with a whole big gang of people, people pushing left and right, left and right, and all of a sudden, she bolts into the picture.","She has -- she grabs me or hits me on the arm. In fact, I'm like this with my arm up and then he goes by, and I mean, maybe he touched her a little bit but I didn't. It was almost like he was trying to keep her off me, right?","Like he was helping her?","And did you see her fall to the ground?","OK. Because she talked about falling to -- now, after -- now, I must tell you, her statement changed big league because she said go to the ground you know all this. I could read it to you. Does anybody want to hear it? I mean, I want to be accurate because I like the press to treat me. So before she knew she was on tape she said I was jolted backwards.","Was she jolted backwards? I mean, if she was her face stayed the same. So I mean, I was jolted backwards. Someone grabbed me tightly by the arm and yanked me down. Campaign managers aren't supposed to forcefully throw reporters to the ground. Except she never went to the ground. She never even came -- she never even flinched.","She didn't, you know, if somebody grabs you even one of the guys, even the bikers, if somebody grabs even a biker or punches you a little bit, you'll awe, right? I mean, the toughest guy, the toughest woman. Look at her face. It's zero. They're going to destroy a man's life? And then I have Cruz starting, oh, that was a terrible thing.","That was a terrible thing. Let me tell you something, folks. If I win, if I lose, I didn't need to do this. I'm doing this because I just had a beautiful grandchild with Ivanka, with Ivanka. Ivanka and Jared, beautiful, beautiful grandchild. I'm very proud. It's my eighth. I'm doing this all for them. I didn't need to do this.","This is not so easy and I had no idea. You know, maybe none of us did. You know, I had no idea the message was going to get across. It's a message of competence. You know, it's a message. It really is. It's a message of common sense and it's a message of competence. And I had no idea that we'd have millions of more votes than we had -- when we had that stiff, Mitt Romney, a total stiff running, who by the way, he's a dope.","He's not a smart person. I'll tell you right now. Let me, let me tell you about Mitt Romney, that was an election that he should have won and he lost. And he should just go away and let the big boys do it now because you know what? That's an election that should have been won. And you know I -- I'll tell you what.","I helped John McCain and at that time honestly, that was a tough deal for him because the world was sort of collapsing and that was a tough one. But he lost and I helped Mitt Romney a lot and he lost. And I said this time we're going to do it ourselves. We're going to win. We're going to win. So just remember that.","We're going to win because of Wisconsin I hope. OK, a couple of more questions. How about a woman. Go ahead. Go ahead. Go ahead.","Great.","Right. She's so smart. I don't want them to know. I don't want to tell Putin what I'm thinking. She's so smart. What you just said is -- what does that say? What about Ukraine. Don't worry about Ukraine. Ukraine is going to be fine. Just don't ask me why. You know, you know it's just this world of politics.","Mr. Trump, you said don't forget, I'm the one that said take the oil. I was right. They didn't take the oil. Do you know where's the oil right now? ISIS has the oil. You know that Libya, ISIS has all that oil from Gadhafi. All of that big oil from Gadhafi. He took it. We're like a bunch of dummies. Why aren't we embargoing?","Why aren't we creating a nice big circle so they can't get the oil out? Why aren't we taking that oil back? Look, look, I'm the one that says though I don't want to say everything. If I win, I have a good chance of winning. I'm the frontrunner by a lot. I want to go in there. I want to knock the hell out of ISIS.","I don't want to tell all.","I really mean this. I don't want to tell everybody in this room and look at all the cameras that are going now. I don't want to tell the world what I'm going to do because they're watching. Just let me do it, folks. I will do it. You will be so happy. You don't have to know the details, OK? Let me do it. You know, I used the word before, we have to be a little bit unpredictable.","We can't say, well, we're going to go and attack on March 14th and then we're going to hit them from the front and then we're going to hit them from the back. You know, Obama did that eight months ago with one of the cities. He said we're going in next week. Look, folks, folks, folks, you know, you have to trust -- there has to be some trust, right?","Do you trust? We've got to stop. We've got to stop the stupid. That's why I really think your question is so great. I don't want to hear how you're going to do it, Mr. Trump. Just do it. I'll do it, OK? I love that. That woman, that woman. Thank you, honey. Thank you. Yes, go ahead.","OK. Hi.","OK.","I can see why.","I remember that. Yeah, I remember that.","Such a wonderful, beautiful woman. I mean, just an amazing woman. And are you? Are you doing -- are you coming along, OK?","That's great.","And you know what we'll do, we're going to watch him. You're going to watch him, Dana. Dana, watch him. We're going to be watching your boy, OK? But you're going to hopefully be around. You're not going to have to have anybody watch him. You're going to hopefully be around. Those doctors are going to be so wrong but we'll be helping you.","That's so nice. Thank you, honey. Thank you. I'm sorry I have to go down and say hello. Is that okay?","Wow, what a great woman that is. That's a great woman, a great mother. I remember that and it's heartbreaking but it's -- something's beautiful is going to happen. You watch. Something beautiful is going to happen. Folks, I just want to say I'd almost like to leave it on that because we can't top that. That is so amazing.","Thank you. Thank you. You know that little very sad but I think it's going to be a really, a story of hope, and something that is really great is going to happen out of that you watch. But it sort of tells me, when I first did this, people were saying, oh, it'll cost a lot. Forgetting about the campaign that's peanuts by comparison.","You know, I've spent tens of millions of dollars. But the big thing, I lost certain businesses, and I own the Miss Universe pageant. I bought it very inexpensively, many years ago, 15 years ago, and because of the fact that they thought I was against this one or that one, I had a hard time with television.","Now, the good news is I sold it for a wonderful -- I was very happy with that. But I didn't want to sell it but I sold it and I built it to really a very good company. We did a great job with that company, Miss Universe, Miss USA, Miss Teen USA, but other businesses, I sort of like the shirts and the ties with Macy's. Macy's was unbelievable, just unbelievably disloyal because of illegal immigration, and they ended the shirt size, who cares?","I mean, it's not a big deal but I'm doing something -- nobody else is giving up what I'm giving. I mean when Cruz runs he runs, if he wins, great. If he loses, great he is, you know, it's him. He's a politician. They just -- they run, they win, they lose. Who knows? But these guys run for office that's all they do. I've always heard that if you're a very successful person you can't run for office, especially for President, you just can't run for President.","And I can see it. I have so much false press about me. Things that are so false they're -- do you know, I saw the other day on television. There were like 50, did you see it? 56,000 negative ads on me, 56,000. In fact, in Florida, I own Doral and in Florida, we had the tournament there two weeks ago. Adam Scott, the great Adam Scott.","Great golfer, he was winning and in between shots, I told you this after the victory speech. In between they'd have commercials and they were all about Trump, negative, horrible, negative commercials, mostly false. Mostly false, not all false but mostly false. I have to be honest but it came out the other day.","I think it said $68 million, 55,000 negative ads, negative ads. And when I was running in Florida, I said how is it possible to win I mean with all of this? Because I knew it. I mean, you couldn't turn on, in Florida, where I was you couldn't turn on the television without seeing Trump commercials. Sometimes four or five in a row and they were horrendously, done by very, very bad people, very bad, evil people.","And I said how is it possible to win? And God helped me, honestly, because I won in a landslide. I won by almost 20%, so and now, they're doing it here, Club for Growth. It's a crooked outfit. Look, Club for Growth. Do you ever hear this Club for Growth? A friend of mine comes, would you, he's a conservative guy, calls, would you do me a favor and see Club for Growth?","I said what's Club for Growth? He said, well, they want to talk to you. I said all right send them up, he's a friend. He's a good guy. And now, I'm in politics so I have to see people that I wouldn't normally -- you know I'd say, give me a break. So Club for Growth, Club for Growth. They come up to my office.","This guy was I think a former Congressman and he tells me a little bit about Club for Growth. I'm falling asleep. And then he goes, and then he goes, would you contribute $1 million? I said $1 million for what? I don't even know you. I never met you. I said do me a favor. I'm trying to be nice and I said do me a favor, go back, write me a little note if you can and he was stupid enough to write me a note.","He writes me a letter asking for $1 million. I let him know that I'm not interested. You know you can be rich. I'd rather take $1 million and throw it all over this room. I'd rather give it to you for your boy, OK? And so what happens, what happens is they write me a letter -- put it in writing. I'd give you the letter some of you -- has anyone seen this letter they wrote?","It's incredible. They write me a letter. It's like extortion. They ask me for $1 million. I said no, nicely. And then, they're doing ads all over Wisconsin, Club for Growth. They did it all over Florida. Club for Growth about eminent domain. By the way, without eminent domain, you wouldn't have highways, you wouldn't have schools, you wouldn't have hospitals, you wouldn't have bridges, you need eminent domain.","If something's in your way and you're building a highway. If you're going to produce 7,000 jobs and you need a little corner of somebody's property every once in a while. You know, it's funny these guys all want the Keystone Pipeline, right? Everyone. Conservatives, no, Conservatives want the Keystone pipeline.","I like the Keystone Pipeline too. But they have a whole big thing on eminent domain in the prospectus because without eminent domain they wouldn't go 15 feet. They wouldn't be able to build it. So they have a whole -- so they don't want eminent domain. They do commercials about eminent domain. They love the Keystone pipeline and the whole Keystone pipeline is based around eminent domain because you've got to go from Canada where Cruz was born to Texas where he's representing.","Think of it. This guy. And don't forget that. Remember what I said. I'm going to win. Just remember what I said. I'm going to win. And I thank you, baby. I thank you. She's saying, oh, please win. Oh, you are so amazing. You are so amazing. I'm going to win. But remember this, if for some reason he does, it gets the nomination.","The first thing, just remember, I'm a good prognosticator. I'm a good predictor. The first thing that's going to happen is the Democrats are going to sue Ted Cruz. He was born in Canada. He lived there for four years. The head of the Harvard Law School, one of the top people in the business in terms of constitution is saying that you know, he's wrong.","And we have other people that are much worse -- much stronger than even that. So remember this. If Cruz gets lucky and he wins, and the only way he can get lucky is if he doesn't get -- because it's all Establishment. You know, if I go into that whole mess of the convention, I'm not the Establishment. I don't take their money.","I don't hire their people. I don't do any of that stuff, OK? So you have a disadvantage. But if Cruz wins, remember what I said, just remember. Again, he's not going to win but if he does, if he gets a nomination within the first few days, he will be sued by the Democrats that he doesn't have the right to be President.","And I think they're right because he wasn't born on our soil. He wasn't born. He's not a natural-born citizen. He's not a natural-born citizen. I don't like to make a big deal of this but it was just brought up by somebody. He is not a natural-born citizen. So if for some reason he should get the nomination, I really believe you're wasting your time.","And boy, do we have a problem because you're going to have somebody that's going to be sued probably will lose the lawsuit. Again, he was born there, lived there for four years, mother was there, the whole thing for a long period of time, and he was a Canadian citizen joint with U.S. until 14 or 15 months ago.","Did anyone know that? So he's a Senator from Texas, only because of the great Sarah Palin by the way, without Sarah Palin, he could have never won that election. He was a fluke. But he was a Senator from Texas. He lived -- he's a joint citizen. Now, he finally gave up his citizenship to Canada like 16 months ago.","He said, oh, I didn't know I was a citizen of Canada also. Does anybody -- just like he didn't know that Goldman Sachs and Citibank gave him money. I mean, this guy is -- you just have to study it, folks. Look, again, I'm doing this. We're going to win. We're going to turn this country around. We're going to Make America Great Again, and we're going to win a lot.","But you have to know the facts. I love you all. I love you all. Thank you. Thank you. I love you all. Thank you very much. Thank you. Thank you. Thank you. Get out there and vote. Thank you. Thank you, everybody."],"text":" Thank you, everybody. Wow. Thank you. I feel so badly. Outside we have 5,000 people and they can't get in. I feel badly. I want to apologize. We have speakers outside but I want to apologize. Who would have thought, we have over 5,000 people cannot get in. So, now does anybody want to leave and give your place to somebody outside? I had a feeling you might be saying that. It's an honor to be here. It's an honor to be with you. And very important, you know, we're doing really well. Millions of votes ahead of Cruz, millions. You know I get a kick, I call him lying Ted, lying Ted Cruz. He stands up and I'm winning -- I win, as you know. You've seen it. I have been winning all of the Evangelical vote. But he stands up, Bible high, puts it down and then he lies, you know. Isn't it kind of amazing? It's amazing to watch it. But he said, yo, I'm the only one that can beat Donald Trump. I've done it time after time. And I said, wait a minute, I've won like most of the states. I think he had five or six and I had 20 or 22, right? And I said I can't believe it. Then I have millions of votes more. He says I'm the only one that can outvote him. And I'm saying, but I have like millions of votes more. I'll tell you something, it's so important. There is something happening, it's like a movement. It's incredible. It's a movement and we're part of the movement. It's not me, I'm a messenger, to be honest. I'm a messenger and this is something that's so special and so amazing. And it's on the cover of Time Magazine. It's on the cover of every newspaper. It's something that has never -- that has maybe never happened and they're saying it's a phenomena. Sometimes they say I'm a phenomena, I'm not. The message is what we want. We want jobs, we want jobs. We want trade deals that are smart deals not stupid deals. And you know, Wisconsin, I wrote down some notes. Look, I didn't think I thought I had a -- you know, it's one of those things. Look, I wrote down some notes and it's like -- it's like devastating. So Walker came out today. I wrote down notes about Wisconsin. Look, he certainly can't endorse me after what I did to him in the race, right? But look at this, by the summer of 2015, Wisconsin was facing a $2.2 billion two-year budget deficit. That's terrible. By the way, these are out of books, right? This isn't Trump. This is out of books. Total state debt is $45 billion. Now maybe somebody is going to tell me that's wrong, but again these are the -- $45 billion, very high. One of the higher ones. 20,000 fewer people in labor force in Wisconsin than seven years ago even though population has grown by 100,000. So your population is higher. And -- now I wouldn't have done this but would he endorse Cruz? What am I going to do? Am I going to say he's doing a great job? He's not doing a great job. You know he comes in in his motorcycle jacket, a big Harley, I love Harleys, right? But the motorcycle guys like Trump. They really like Trump. And he doesn't look like a motorcycle guy to me, I'm sorry. I'm sorry. Unemployment rate, well, they say I can't be possible. Unemployment rate, they have down 20%, that can't be possible. What? Is it 20%? Effective or regular? I mean, just -- effective unemployment rate, 20%. Hey, this is out of the big book. 800,000 food stamp recipients, middle class hit very, very hard due to loss of manufacturing jobs. These are -- these are the stats, right? You know about this, right? It goes on and on. Wisconsin has lost 15,000 net jobs to Mexico since NAFTA. Now just so you understand, Kasich is running also. We forget about him. He voted for NAFTA. Both of them want TPP. TPP, Trans-Pacific Partnership. Both of them want Trans-Pacific. That will make NAFTA look like a baby. And Wisconsin will be hit so hard. You're a motorcycle guy? I'll bet, right? Am I right? Do they love Trump? I don't even know why. I'm not big with the motorcycles but the motorcycle guys love Trump. Look, I love the disabled veterans and the veterans. We're going to take care of our veterans. You know that, right? We're going to take care of our veterans. What is it about Trump that they like? I'm serious. We went to Hilton Head. We went to different places and there were hundreds, hundreds of bikers out there. Beautiful bikes, lots of Harleys, right? Lots of Harleys but made in America. But beautiful, beautiful bikes. What is it with the motor -- why do they like me? Tell me. Who said that? Who is that? I love it. I don't know what it is but they like me. I feel good with them. I feel safe. I got out, I took a picture. Secret Service went crazy. I said these are great people, don't worry about it. But listen, I appreciate it, fellows. I appreciate it. I know. Just keep you free. You're right. We're going to keep you free. I'm going to keep you free because we're getting rid of ISIS. We're going to have good borders. We're going to borders again. We're going to have borders again. So here -- here we have something that's pretty interesting. I love you, too. You lost 70,000 jobs to China. 70,000 jobs. 100,000 illegal immigrants living in Wisconsin. Taxpayers are paying tens of millions of dollars a year. Look, I don't know. Look, I don't know. So what happened with Walker -- and I just, we'll finish you off with this. He's a nice man. He came up to my office like about a year ago before I was -- I did the run. And you know, I've been a politician for what, about eight months, right? I never thought I'd be a politician. The last thing on my mind I want to be was a politician. But I built a great company. I filed papers. Everybody's -- I mean, the company is incredible. Very little debt, tremendous cash flow, some of the great assets of the world. And I say that not in a bragging way. I say that because that's the kind of thinking we need, folks. I mean, I'd look -- we can't have China ripping us off and Mexico and Japan and Vietnam. We can't have it. We can't have it. And they are ripping us like they've never ripped anybody before. We've rebuilt China. I mean, we're rebuilding Mexico. You looked the other day, you saw a Carrier moving down, Carrier Air Conditioner. I buy those air conditioners, a lot of them. I'm not buying anymore of them but Carrier Air Conditioner, moving to Mexico. Ford, moving to Mexico. Nabisco, home of the wonderful former -- formerly wonderful Oreo, which we don't need anymore, right? We don't need it. We don't need it. Number one, it's a good way if it's a good order. It's called an enforced diet. But you know what, look, we're losing our jobs. Look at your jobs. When I see that statistic, I mean, you're losing your jobs. When I went after your governor when he decided to run and I said, you know, I'm going to be nice to him. He's a nice guy. The guy came up to my office. He handed me a plaque because I supported him. What do I know? I support him, I gave him $50,000 or $100,000. That's a lot of money for a guy you never met before, right? That's pretty good. But I like the fact he was fighting, fighting. He was always fighting. You know, to a certain extent I'd rather see somebody who are able to make a deal without having to go through all of that mess. But he was fighting and I gave him a lot of money. And he came up, you know, a year ago or so and he gave me a plaque. Beautiful picture of something. I haven't -- I never really got to read it, to be honest. And I put it aside, that was it. I just had my girl find it. She just called, she said, Mr. Trump, I've just found it. A wonderful woman comes up and I said where is it? She said I think I know. And she found it under a pile of a lot of other plaques. So -- so I'll bring it. I'm going to try getting it if I can tomorrow or the next day so that will -- because I'm going to be here the whole week. I'm going to be in Wisconsin the whole week because -- because if we win Wisconsin, it's like going to be over, pretty much over because we're going to do great. Emerson -- because Emerson poll -- Emerson poll came out. I think I have 67%, 68% in New York compared to like 10% or whatever and you had Cruz talking about New York values. New Yorkers are no good. New Yorkers -- I watched New Yorkers rebuild the World Trade Center. I watched New Yorkers dying. Believe me, New Yorkers are good. New Yorkers are very good. But Cruz said they're no good. So anyway -- so I think we're going to do great in New York. We're going to do great in New Jersey. Chris Christie endorsed me. We'll do great in New Jersey. Good guy. Ben Carson endorsed me, Sarah Palin, Sarah Palin endorsed. Sheriff Joe from Arizona, we love Sheriff Joe. And you know with the Evangelicals I've had so many ministers, I've had so many pastors endorse me and Jerry Falwell Jr. endorsed me. It was incredible. And we've done so well with the Evangelicals. I mean, Christians, Evangelicals, we've done so well. In fact, in South Carolina, when we went to South Carolina that was going to be Cruz's territory. He was going to take it except we won in a landslide. You know that you saw it. He was there. This guy follows me around, I'll tell you. But you were there, right? You remember, he was going to win that in a landslide. And then I started speaking, I started talking to people and I started saying, you know, the good and the bad and the ugly. And we won in a landslide. And we won the Evangelicals. I've won just about, I think, almost every place I've won with Evangelicals. And it's been an amazing -- it's been an amazing time. So now I'm here to talk to the people of Wisconsin. I have friends in Wisconsin. I've been here before. It's an incredible place but it's a place that has problems. But you have a Governor that has you convinced that it doesn't have problems. Now I remember when he was on the campaign trail, I was so nice to him. You know, I said how can I hit him? I'm not going to hit him, I'm not going to hit him. And I was so nice. I hit Jeb instead, right, right? And I hit Rand, Rand, the Rand. And I hit a lot of people and they all went down. Wouldn't it be nice to have a President that could just, with his mouth, make things happen that are positive, you know? But it's not with a mouth, it's really with the mouth, the heart and the brain, remember the brain. I have a lot of friends. They're good with the mouth but they're not -- when they're not good with the brain, it all doesn't work, OK? You know, we had an interesting thing today. A poll came out, a nationwide poll, it was a great poll. It was Trump, 48. It was an NBC poll. Trump, 48. I think Cruz was second in the low -- in the 20s, mid-20s-something and Kasich was way down. So what happened is they show the poll. It was an NBC poll. They got NBC monkey poll and it was on The Today Show and it was on Morning Joe. Morning Joe held it up. He said, wow, those are great numbers. 48 is pretty good. You have three people, you know, I don't get enough credit for that. I've been at 42, 44, 45 and I've had like seven people. How do you get 45 when you have seven people? Nobody says that. They said, he hasn't cracked 50 yet. How do you crack 50 when you have all these people running. So I'm at 48. Paul was good. Way, way ahead of anybody else nationwide. And they showed Hillary Clinton, hers is very close. Got a little problem. Good to happen. Got a bigger problem with the e-mails than she has, I think, with Bernie to be honest with you. She should have. Her bigger problem should be with e-mails. We'll find out. We'll find out how honest our country is, right? But -- but she's got a sort of close race. And they put her poll up, it was, you know, put up there, big letters. And then they said, and Donald Trump is winning. That was it. They didn't say -- they didn't put numbers up. They didn't say I'm doing great. In fact, they actually said Donald Trump is winning and they put some -- a little slightly negative statistic in. It was like, wait a minute, they put her numbers up and they didn't put my numbers up. Folks, it's so unfair. The press is so dishonest, it's unbelievable. That was Chuck Todd. That was -- that was Chuck Todd this morning on The Today Show. Check it out. They put Hillary's numbers up and I'm winning by a lot. And they said Donald Trump is winning, you know. Let's go to a new subject, OK? Now I guarantee you one thing, if I was losing or doing poorly, it would still be up. It would be up all morning because they don't like what's happening. I'm self-funding my campaign. I'm putting up my own money. They don't like it. Ted Cruz and Kasich are getting money from the banking industry, from the energy industries. They're getting money from the pharmaceutical companies. They're getting money from everybody. Folks, you can't straighten out this mess. We're in a mess if you can't do what you have to do. When millions of dollars are given to Cruz and Kasich, and millions from different industries, you're not going to be able to say, well, we're going to do and go against the banking industry to do what's right for the people. If the banking industry gave you millions of dollars. Now that's true with Hillary also because she's gotten millions of dollars. But I'm the only one self-funding my campaign. I'm in for a lot of money. I mean, a lot of money. What was beautiful is when I was running against Jeb in New Hampshire. I was in for $2 million, Jeb was in for like $48 million. I was in first and he was close to last. I said, who do you want as your President? By the way, did Jeb endorse anybody yet? Because I think Jeb probably endorse, must have endorsed. Huh, did he endorse? That shows you how important it is. Nobody even knows. I don't even know. No, you probably. Look, he'll endorse, just say you know, look, when you're in war you got to fight and you fight hard. When I fight, I win. You're going to win. You know that. You're going to win. But you know, you do pretty serious damage, right? Because you want to win, you want to win fast. And a lot of people don't love you after you've finished. But I just love. I don't care about them. In fact, in fact, they're asking Cruz, you know, at the debate, which by the way, they said I won every single debate. Now, I heard the other night he said I want to debate Trump. I've debated him 11 or 12 times. Every single online poll has me winning the debates. And he's an OK debater but he's a bad talker. You know, everything's so dramatic. Oh, and he waits phony and he waits. You know, have you ever seen, he goes sentence after sentence, and he stops for like three, four seconds, and then he goes again, it looks like we're in the theater. We're not in the theater. We're in the real world. So, so what happens. Thank you. That's all right. Thank you very much. Thank you very much. By the way, the sheriff is here. He's a great guy and his people are fantastic. Thank you, Sheriff. Thank you. The -- I mean, the only thing I feel so guilty about are all the people outside. So I feel so guilty. We're going to come back. I'm going to come back. We're going to come back to this area. You guys, you guys cannot come, OK? All of the ladies can come but the guys can't. But, but, but all of the people outside, we're going to take a bigger place. We're going to -- we're going to get some because I feel, I feel slightly, I feel slightly guilty. But look, look, we have a very serious mess on our hands. We have a serious situation. We have a country that's not protected. We have a country that's sitting on a big fat bubble that's going to explode. In a certain way, I said let it do now. Don't do it after I get in. Three days later, it will explode. They'll say it's Trump's fault, OK? Ayayay, we are in a big, fat, ugly bubble. We have interest rates that are so low, that if you're rich like me, I can borrow money for any amount. If you're a hardworking guy with a great farm or you're a hardworking developer or a businessman, you can't borrow money. You can only borrow money really cheaply. Think of how bad that is. You can borrow money for nothing practically if you're rich. But if you're rich you don't need the money. So you don't have to borrow it but if you're a business person you want to go to the bank for a loan you can't get it. The regulators are running the banks. Dodd-Frank is a disaster by the way. It's a disaster. It's a disaster. But the biggest disaster, our regulations, our rules regulations are horrible. We're going to get rid of probably 85% of them. There are some we live with but we got to go back. So many people from this area have told me regulations, regulatory climate is the worst they've ever seen it. I have a friend who's a farmer and if a puddle forms they consider it a lake for purposes of environmental. They consider -- it's like a puddle and they consider it a lake. So -- but we don't know what we're doing. So here's what's happening. We're going to make our country so great again. We're going to make our country so strong again. Our military is going to be so amazing. We're never going to have to use it. Don't forget I didn't want to go into Iraq. All these guys think that I'm a tough guy so I'll be so quick with the trigger. I'm not going to be quick. I was the slowest with the trigger. I didn't want the trigger. Now, when Obama left though, he shouldn't have left the way he did. He gave a certain date and the enemy said it can't be possible. Nobody would be that stupid. Nobody. So I actually don't think it hurt that much because I don't think the enemy ever believed that anybody would be stupid enough to give a date. We're leaving on this date and then he left. They said he was serious. They pulled back. They pulled back then you see what happened. They pulled back and then they went in with fury. But how about the 50 soldiers. He sold -- a couple of months ago, a few months ago. He sent 50 of our finest and instead of just sending them quietly, quietly sending them, what does he do? He sends them in and he makes a big press conference or announcement that we are sending 50 soldiers into Iraq, Syria, and now these soldiers have a big target on their back. Why can't we just keep our mouths shut? Why can't we be unpredictable, unpredictable, right? Why can't we be unpredictable? Why does he have to tell? First of all, it doesn't even sound good when you say 50 soldiers because it sounds like so small. People would say is it good or bad? I mean, that sounds small but then when you think about it, why, why do we have to say that? These are extraordinary people. These are our finest and they're, you know, very dangerous mission. Why would you tell people that we're sending them in? You just keep -- you keep quiet and let them accomplish something. They are right now -- who knows what's happened to them? But right now they have a big target on their back. People that we've let go of Gitmo have now killed Americans. You've seen that, you saw that yesterday, that came out yesterday. We let people go out of Gitmo and they kill Americans, OK. Is anybody surprised at that though? Would anybody be surprised? And we're keeping it open. Now, they're spending, you know, hundreds of millions to run it. I guarantee you could run it a lot cheaper. You'd have a lot of money left over. So we're going to get efficiency in Government but we're going to end Obamacare. We're going to -- we're going to replace it. We're going to replace it with something so much better and so much less expensive. We're going to get rid of Common Core. We're going to bring our education local. We are going to preserve our Second Amendment. It's under siege. It's totally under siege. And Christianity is under siege. I'll tell you, Christianity is under siege. You take a look, I'm with these -- I'll tell you what I've been with so many pastors lately, and Jerry Falwell, Jr. is an example, he was telling me that -- Well, first of all, he told me something. He says you remind me so much of my father. I thought his father was a great guy. What his father did with Liberty College and Liberty University and then Jerry to top it off, has taken that to a whole new place. But when Jerry was so strong and so great. But I was talking to -- I probably had 50 of the ministers and pastors, different folks came up to my office, and they're really under tremendous pressure because they don't want to have their tax-exempt status taken away. This happened during the Lyndon Johnson Presidency. And I said why is it that you folks are pushed around so much, Christianity? These are the pastors and these are strong people. These are really strong people. Why do you allow them? Why aren't you more forceful? And finally, somebody said, well, we have to be a little careful of our tax-exempt status. I said when did that happen? Actually, it was during the Johnson. Well, we're going to try getting rid of that, OK? Because that's really terrible. We're going to try getting rid and I've said that to -- I've said that to a lot of Evangelicals, a lot of great Christians. We're going to try getting rid of it because it's taken -- it sort of means that somebody walking down the street has more power than somebody of religion, of our religion, of Christianity. Somebody that an Evangelical. You take anybody, they have more power because these people are powerless. They've actually taken their right of free speech away. So I said we're going to try and get rid of that and I think we'll be very, very successful. You know, it's interesting. I said how many Christians are there? Because you know we've got men, we've got women. You cut it in half, we actually have a few more women but we have far more Christians, and we have men or women. So in a way, it's the most powerful, lobbyists, the biggest group of people. But we're not allowed -- they're not allowed to talk because they're petrified. You saw what was happening with the IRS and you saw what was taking place with regard to certain groups. So we are going to try, and usually when I say try that means I'm going to get it done. That means I'm going to get it done. But we are going to try very hard. We're going to get that brought back. And I think it's going to be very hard to counter it because if the Christians, and if they look, if the whole Evangelical Christian sector gets together nobody, nobody can beat. You know, when I made the statement about Muslims, banning Muslims on a temporary basis, I took such heat. Now, people are saying, you know, Trump is sort of right about that. Now, they're all going, wow, because I see what's happening. And I think about what he said it about Christians I would have had less opposition. That's what's happened in this country, OK? That's what's happened in our country and we can't, we can't let it happen. We're going to turn this country around and we're going to be the smart people. We're not going to be the dummies anymore. We're not going to be where China made last year trade deficit, $505 billion with a B, billion dollars. Japan, over $100 billion. Mexico, $58 billion. We're going to build a wall and Mexico's going to pay for the wall, OK? I remember, I -- recently I was in Florida and Marco, who's a nice guy actually, you know, do you notice how nice they are after you've defeated them? I like everybody I defeat but when I went against Marco, it was supposed to be a very, oh, boy. Well, he started it, right? Just like Cruz started the last deal. He started it but Marco came after me very viciously. You know, he wanted to be Don Rickles, right? And it didn't work. But what happened is, what happened is I won by 20 points, almost 20 points and a lot of these issues we were talking about. It was big issues and frankly, I wish I would have left about two days early. I wanted to stay in the Florida campaign. I wish I would have devoted two more days to Ohio because I almost won in Ohio. I would have won Ohio but I didn't want to take a chance on leaving my beautiful Florida. Look, because I love Florida and I wanted to win that. So if I would've left a couple of days early, I think I would have won Florida, probably by the same, but I'm not going to have anything happen to Wisconsin. We have to win. If we -- look, we have to put these politicians in their place, folks. It's time. And believe me, you know, Cruz likes to pretend he's an outsider. In the meantime, he gets all the Establishment support, including your Governor. So believe me, believe me, they're all Establishment. And frankly, in a way, it's worse because Cruz is Establishment and yet he's got no relationship with the Establishment. He goes and he stands on the floor of the Senate for a day and a half and he filibusters and these Senators, look, I know they're tough cookies. I have the best -- I have one of the great people, Senator Jeff Sessions. He's good. Nobody better than Jeff. And you know, Cruz thought he was going to have them and he'd use them in his speech. Senator Jeff Sessions and then he comes out and endorses me. But when you think of it, look, out of all of these Senators, he has one supporter, Lee, who's his friend. I mean, it's his friend. But I'm sure, and by the way, it took him plenty time to do it. But you know, to stand there and to rant and rave for two days, and to show people here you can filibuster. In the meantime, nothing was accomplished. Cruz has not accomplished one thing. So he's an insider but it's almost like the man on the street because he can't get anything done. He dislikes people, he calls people, like for instance, he said horrible things about the speaker, and you know, the -- he said about the speaker and he said about separately, Mitch McConnell. I mean, he said some terrible things about -- how do you get things done when you're calling Mitch McConnell bad names, OK? Let's just say bad names. So he's sort of got the worst of all elements. He's an insider totally but he can get nothing done, OK? He can get nothing done. Your new Speaker -- how do you like Paul Ryan? How do you like him? Do you like him? Wow, I was told be nice to Paul Ryan because -- really? All right. Well, he's the Speaker. He's a nice guy. He called me the other day, he was very nice but I'm very surprised at this statement. Wow. Are you all Republicans? Are you mostly Conservatives? Because I don't care. You know the word can -- I always say I'm a commonplace. Just a common-sense Conservative. And so, so important, a common sense. And then somebody told me today that somebody else, I think Walker used my term. You know Walker used -- I said Make America Great Again. I said Make America Great Again. And I copyrighted the term and then Walker was making a speech many months ago when he first started and he was saying, Make America Great Again because he saw the response I got. The difference is he didn't get any response. You know it's sad to know but we told him you can't do that. That was the first little problem I had with him he said you had to -- Now, I said a commonsense Conservative. And today, I heard he used the term because the press was up and they interviewed me, and they said he said he's a commonsense Conservative. Well, I coined the phrase a few months ago but that's what I am. I'm a conservative person. I'm very, very conservative on the military. I'm very conservative with our vets and on healthcare and on lots of things. But -- and I'm actually very conservative on trade but a lot of people would say he's not that conservative on trade because he doesn't believe in free trade. Well, actually I do believe in free trade but it's got to be a good trade for us, right? It's got to be smart trade. It can't be where Wisconsin is losing thousands and thousands of jobs where you, folks, can't get into China but China comes in here like it's, like it's Swiss cheese. That's what happens. You know China does not obey the rules. Now, I get along great with China. I made a fortune dealing with China. I have two buildings because of China. Big ones in New York and one in San Francisco, Bank of America that I have in partnership with a great company and it's because of China. I sell -- I have the biggest one of the big leases with one of their big banks. With the biggest bank in the world actually from China. I sell millions and millions of dollars to kind of -- condos to people from China. I like China. I'm not angry at China. I like them. I think their leaders are doing a great job for them. But our leaders are doing a bad job for us. Same with Mexico, I get along great. The Hispanics, I love the Hispanics. I love the Hispanics but their leaders are killing us on the border and they're killing us on trade. And I'm not angry at them. I'm angry at our country and our leadership because it's grossly incompetent and we're going to change it around and we're going to get the best and we're going to get the finest. So what I thought I did -- thank you, folks. Thank you. Thank you very much. I appreciate it. So whatever you can do to spread the word. I'll be around. I'm going to Green Bay. I love that team by the way. You're talking about a great franchise. No, I love it and you have a truly great quarterback. I don't know he's probably endorsing somebody else but I don't care. He's still a great quarterback. Tom Brady's a friend of mine. He said you have a great quarterback. That's all I need, right? When Tom says he's a great quarterback. That's pretty good. But you know, I really want to win Wisconsin because if we can win Wisconsin. We're going to put all the stupidity away. We're going to put these, these stupid, stupid people that allow and I'm talking about basically politicians, and in many cases, you know, a lot of times people will see deals that are done. And I mean, take a look at the Iran deal. How bad is that? I mean, just as a deal, forget about countries. But many times people say, deals that the country makes, right? Deals with -- and they'll say, how can our politicians be so stupid? They're not stupid. They've been hit by the lobbyists and the special interests and they make a fortune, OK? They get tremendous campaign contributions. They're not stupid. They're doing it for themselves. So again, I'm not doing that. I'm doing for you. I'm working for you. But just remember, they're not so stupid like you think. But when you look at the people funding Cruz's campaign and Kasich's campaign, and you look, don't forget, Cruz said oh, the banks, the banks, you know, he's going to be Robin Hood. He's going to be this great guy. And then in his personal financial disclosure form, he forgot to mention that he borrowed about $1 million from the banks, Citibank and Goldman Sachs, they borrowed $1 million at an interest rate that everybody in this room would be proud to have, a very low-interest rate, almost no interest. He forgot to announce it on his personal financial disclosure form. He just forgot. He said, oh, I forgot, I forgot, I forgot. You know, so then he hits the banks. He's controlled by these people folks, OK? I mean, what he did was absolutely wrong but they're controlled by these people. I'm controlled by you. I'm going to do the right thing for you, OK? So remember that. So let's take a few questions and then I'm off to Green Bay. I love that, OK? Let's go. Go ahead. Go ahead. Yeah. Go ahead. My biker, my biker friends. We have to start with them. 22 veterans get killed or kill themselves everyday. 22 veterans a day commit suicide. That's correct. Over either health or not having a job or PTSD. What are your plans on that? We're going to take care of our veterans so much. Look, let me tell you. They -- many of them kill themselves waiting for a doctor. They can't even get to see the doctor you know that. They end up killing themselves before they see the doctor. 22 a day and a lot of people don't even believe that number. They think it's almost like an impossible number. How could it be so bad? And it's actually could even be worse than that. But we are going to take care of them from the standpoint, they wait, they wait, then they get bad service, and they wait some more, six, seven, eight days, and sometimes they'll get to see the doctor and the doctor says, I can't see you now, I'm going on vacation. Do you see the corruptness? I just left Phoenix. We had 21,000 people. Sheriff Joe was there. The job he did was incredible, incredible. And you know, they had a little protest, right? That protest ended so -- he arrested three people, everyone else scattered. You know, a lot of -- and you have that kind of a sheriff here. You have a tough cookie here. I can tell you. I just met him and I can tell you. But we're going to -- well, you know, I have a great policy plan and I've gotten a lot of credit for it. In -- it's on donaldjtrump.com and with the veterans, when they're waiting for exorbitant times, even for a little time, they're going to go to the doctor, they're going to go to local doctors or local hospitals, many of the hospitals are dying for business you know that. They're dying, these hospitals, some of these hospitals are dying. They're going to get immediate treatment, immediate service, we're going to pay the bill, and we're going to save a fortune, and they're going to get great service. And everybody is in love with it. Everybody loves it. And that's what's going to happen. So we're going to take care of our veterans. If we can't take care of our veterans, we can't take care of anyone. So we're going to take care of our vets. Go ahead. One more from my other biker friend here. How about the veterans who got themselves on a permanent bubble? They're unemployable disabled manner? Boy, do you look good though. You look good and tough. I wouldn't want to fight you. Do you think I could take you in a fight? I don't think so. What do you think? How about we do it right now? That would be great for television. Go ahead. But I do have more hair than him, right? Go ahead. to disabled benefits employable? We have so many appointments. Sometimes -- so they have -- Yeah. Right now it's terrible. Why did they say? I mean, if you could say it, why are you unemployable? Because of multiple situations that I have that are more than bearable. OK. I got it. But -- Really I would hold for places that I have to be and my wife and I'm at work. She has to take and therefore, we can't afford the monthly daycare. Right, I know that. Daycare's a problem. So my income is only at a certain rate while with that only a month is allowed, $100 per spouse and $50 per -- Yeah, no -- So on top of the charge when I get paid, it's only $2,800. Right. So then, my wife only gets $100 a month and my child gets only $50 a month. Right. I know. So for this -- So it's a big offset between -- Let me tell you. Here's the problem. Our veterans are taking worse care off than illegal immigrants who come into the country illegally. So not -- you So you don't even have to write it down. We're going to do things about it. You know what? Because I know, do you know what you're saying? I've heard this so many times before with the daycare and everything else. We are going to take care of our vets. Well, as veterans, also don't get an annual increase. That's right. Well, you can do an Executive Order -- And by the way, by the way, speaking of increase, Cruz and Kasich want to destroy your Social Security, folks, OK? I want to bring money back into this country. I want to bring jobs into this country. I want to bring tremendous wealth into this country. I want to take our wealth back from China, from Mexico, from all of these countries that have our wealth. They've taken it like we're a bunch of babies and we're going to save your Social Security and we're going to save your Medicare. They want to get rid of it, OK? Remember that. Well, without saying that true is also that you can give a veteran with a disability and or permanent total an annual increase automatically. You could do that. You could do that. Because you can do an Executive Order, right? I want to -- I want to not use too many Executive Orders, folks. You know, because you know, Executive Orders, sort of came about more recently, nobody ever heard of an Executive Order. Then, all of a sudden, Obama because he couldn't get anybody to agree with him he starts signing them like their butter. So I want to do away with Executive Orders for the most part but look, just do me a favor stick with me. You're going to be, OK. All right. All right? OK? You're going to be OK. I know what you've said. I've heard a hundred times. And the day care is a huge problem, huge problem. And your wife not working. Huge problem. She can't. So anyway and I'll bet you have a great wife, good wife? Yeah. Better believe it. OK. Go ahead. I work in education. I work in education. Right. What are you going to do to help get the local control back to a -- Well, what we're doing, we're ending Common Core. You're not going to be educated -- your kids in Wisconsin are no longer going to be educated in Washington D.C. by bureaucrats, many of whom, I can't say all, but many of whom don't care for your kids. They couldn't care less. They get big fat salaries. Your kids are going to be educated locally. We're terminating Common Core and you will see something, you will see something that's magic. And I've seen it where parents and all of these people, they're all in the -- the uncles, the aunts, they're all on school boards. They get professionals, they have great principals. You can't see what's going on from Washington D.C. Many of the people never even come here. They sit behind a desk in Washington. They draw big salaries and they're telling you how to educate your kids. Not going to happen that way. And I've even seen it where the kid graduates, the child graduates, and those parents stay on. They love it because their child went through the system. They love it and they become so good at it. That's what's going to happen. We're one of the worst in the world in education. We're going to be one of the better ones. Not necessarily, and I don't know that we're going to beat Sweden, Norway, Denmark, and China, but we're going to come very close, OK. Yes, go ahead. Can we get discipline back in school? Discipline in school? I don't think that Wisconsin should have a big problem with discipline. You have a problem with discipline? Minnesota. You're from where? Rochester, Minnesota. Oh, that's interesting. OK. Well, we have to get discipline back in the country. Forget about school. We have to get disciplined. I mean, I have a case, I have a wonderful guy, a campaign manager. You talk about discipline and you probably saw what happened today with my campaign. He's a good guy, Corey. And by the way, the easiest thing, Corey, you're fired. I can't do that. Can't do it. So, fortunately, I have a taping system. You know a very -- I'm rich so I have tapes so long. So this young woman who complained was, oh, she was talking about being maybe thrown to the floor and all this. I said, oh, that's horrible and then we saw the tapes. Did anybody see the tape? What did you think, right? Nothing. Women. So what did you think? He just kept walking. There was nothing wrong. It's a bunch of nothing. I mean, she wasn't like her face stayed the same. If somebody squeezed your arm or did something really bad, don't forget, initially she said thrown to the floor. But if somebody squeezed your arm or hurt you, wouldn't you start screaming or something? Immediately. Yeah. Did you see any change in her face? She keeps following you. I re-ran it and re-ran it on a widescreen and there was nothing. And she did nothing. They all came -- Yeah. It's the same. It's it's horrible. It's horrible. It's honestly, it's horrible. And the best thing I could do is say -- but I can't destroy a man. I've got a beautiful wife and children and I'm not going to destroy a man for that. And you know when I saw that at the tape, at first, I said, oh, this is terrible. Then, I saw the tape. It's my tape. I'm the one that had the tape. It's on the ceiling of this incredible Club in Jupiter, Florida. And we're all leaving and we have a press conference, right? And the press conference lasted a long time it's like 45 minutes so that was enough. I'm leaving with a whole big gang of people, people pushing left and right, left and right, and all of a sudden, she bolts into the picture. She has -- she grabs me or hits me on the arm. In fact, I'm like this with my arm up and then he goes by, and I mean, maybe he touched her a little bit but I didn't. It was almost like he was trying to keep her off me, right? We were -- we were like supporting her so she wouldn't fall. She hung right in there. Or keeping her out of the way. Like he was helping her? Yeah, exactly. And did you see her fall to the ground? No, she did not -- OK. Because she talked about falling to -- now, after -- now, I must tell you, her statement changed big league because she said go to the ground you know all this. I could read it to you. Does anybody want to hear it? I mean, I want to be accurate because I like the press to treat me. So before she knew she was on tape she said I was jolted backwards. Was she jolted backwards? I mean, if she was her face stayed the same. So I mean, I was jolted backwards. Someone grabbed me tightly by the arm and yanked me down. Campaign managers aren't supposed to forcefully throw reporters to the ground. Except she never went to the ground. She never even came -- she never even flinched. She didn't, you know, if somebody grabs you even one of the guys, even the bikers, if somebody grabs even a biker or punches you a little bit, you'll awe, right? I mean, the toughest guy, the toughest woman. Look at her face. It's zero. They're going to destroy a man's life? And then I have Cruz starting, oh, that was a terrible thing. That was a terrible thing. Let me tell you something, folks. If I win, if I lose, I didn't need to do this. I'm doing this because I just had a beautiful grandchild with Ivanka, with Ivanka. Ivanka and Jared, beautiful, beautiful grandchild. I'm very proud. It's my eighth. I'm doing this all for them. I didn't need to do this. This is not so easy and I had no idea. You know, maybe none of us did. You know, I had no idea the message was going to get across. It's a message of competence. You know, it's a message. It really is. It's a message of common sense and it's a message of competence. And I had no idea that we'd have millions of more votes than we had -- when we had that stiff, Mitt Romney, a total stiff running, who by the way, he's a dope. He's not a smart person. I'll tell you right now. Let me, let me tell you about Mitt Romney, that was an election that he should have won and he lost. And he should just go away and let the big boys do it now because you know what? That's an election that should have been won. And you know I -- I'll tell you what. I helped John McCain and at that time honestly, that was a tough deal for him because the world was sort of collapsing and that was a tough one. But he lost and I helped Mitt Romney a lot and he lost. And I said this time we're going to do it ourselves. We're going to win. We're going to win. So just remember that. We're going to win because of Wisconsin I hope. OK, a couple of more questions. How about a woman. Go ahead. Go ahead. Go ahead. I wanted to say I was at UIC from Chicago -- Great. Also, I'm a second-generation Ukrainian-American and I was wondering what is your strategic -- well, I know you don't what them to know what you're thinking but what's your strategic -- Right. She's so smart. I don't want them to know. I don't want to tell Putin what I'm thinking. She's so smart. What you just said is -- what does that say? What about Ukraine. Don't worry about Ukraine. Ukraine is going to be fine. Just don't ask me why. You know, you know it's just this world of politics. Mr. Trump, you said don't forget, I'm the one that said take the oil. I was right. They didn't take the oil. Do you know where's the oil right now? ISIS has the oil. You know that Libya, ISIS has all that oil from Gadhafi. All of that big oil from Gadhafi. He took it. We're like a bunch of dummies. Why aren't we embargoing? Why aren't we creating a nice big circle so they can't get the oil out? Why aren't we taking that oil back? Look, look, I'm the one that says though I don't want to say everything. If I win, I have a good chance of winning. I'm the frontrunner by a lot. I want to go in there. I want to knock the hell out of ISIS. I don't want to tell all. I hear you. I really mean this. I don't want to tell everybody in this room and look at all the cameras that are going now. I don't want to tell the world what I'm going to do because they're watching. Just let me do it, folks. I will do it. You will be so happy. You don't have to know the details, OK? Let me do it. You know, I used the word before, we have to be a little bit unpredictable. We can't say, well, we're going to go and attack on March 14th and then we're going to hit them from the front and then we're going to hit them from the back. You know, Obama did that eight months ago with one of the cities. He said we're going in next week. Look, folks, folks, folks, you know, you have to trust -- there has to be some trust, right? Do you trust? We've got to stop. We've got to stop the stupid. That's why I really think your question is so great. I don't want to hear how you're going to do it, Mr. Trump. Just do it. I'll do it, OK? I love that. That woman, that woman. Thank you, honey. Thank you. Yes, go ahead. Mr. Trump, Melissa wants to thank you. She's got something to say. OK. Hi. Hi, Mr. Trump. I was Miss Wisconsin USA in 2005. OK. And um -- I can see why. Thank you. Um, you have been -- I just want to say thank you. You saved me in so many ways and in recent years, I've been struggling with an incurable illness and I'm on home care now. It was caused by a doctor's medical negligence. And in those dark days fighting, right now, all the tubes have been removed, and I have a Do Not Resuscitate order, and I have a 7-year old son. And in those days in the hospital I received from you a handwritten letter that said to the bravest woman I know. I remember that. Yeah, I remember that. You um -- Such a wonderful, beautiful woman. I mean, just an amazing woman. And are you? Are you doing -- are you coming along, OK? No, sir. But that's OK because I'm here right now to thank you in person and that was my biggest dream and I wanted to thank you. Because through you and your organizations my son who is Mexican-American, seven years old, through your organizations and just being able to stand on that stage with you back in 2005. The outpouring of love that came from that, ultimately, provided my son when he graduates high school with a full ride to college. Oh, yeah. That's great. And because of you -- And you know what we'll do, we're going to watch him. You're going to watch him, Dana. Dana, watch him. We're going to be watching your boy, OK? But you're going to hopefully be around. You're not going to have to have anybody watch him. You're going to hopefully be around. Those doctors are going to be so wrong but we'll be helping you. So we thank you. God bless you and just you know, he's a Mexican-American. And you because of your efforts sent him to college. I have been writing letters to him for when I'm in heaven to tell him that what you've done for him. Now, he has a great responsibility to pay it forward just as you have done for us. And I can't thank you -- That's so nice. Thank you, honey. Thank you. I'm sorry I have to go down and say hello. Is that okay? Thank you. God bless you. Here you go, Mr. Trump. Here you go. Wow, what a great woman that is. That's a great woman, a great mother. I remember that and it's heartbreaking but it's -- something's beautiful is going to happen. You watch. Something beautiful is going to happen. Folks, I just want to say I'd almost like to leave it on that because we can't top that. That is so amazing. That is so beautiful. Thank you. Thank you. You know that little very sad but I think it's going to be a really, a story of hope, and something that is really great is going to happen out of that you watch. But it sort of tells me, when I first did this, people were saying, oh, it'll cost a lot. Forgetting about the campaign that's peanuts by comparison. You know, I've spent tens of millions of dollars. But the big thing, I lost certain businesses, and I own the Miss Universe pageant. I bought it very inexpensively, many years ago, 15 years ago, and because of the fact that they thought I was against this one or that one, I had a hard time with television. Now, the good news is I sold it for a wonderful -- I was very happy with that. But I didn't want to sell it but I sold it and I built it to really a very good company. We did a great job with that company, Miss Universe, Miss USA, Miss Teen USA, but other businesses, I sort of like the shirts and the ties with Macy's. Macy's was unbelievable, just unbelievably disloyal because of illegal immigration, and they ended the shirt size, who cares? I mean, it's not a big deal but I'm doing something -- nobody else is giving up what I'm giving. I mean when Cruz runs he runs, if he wins, great. If he loses, great he is, you know, it's him. He's a politician. They just -- they run, they win, they lose. Who knows? But these guys run for office that's all they do. I've always heard that if you're a very successful person you can't run for office, especially for President, you just can't run for President. And I can see it. I have so much false press about me. Things that are so false they're -- do you know, I saw the other day on television. There were like 50, did you see it? 56,000 negative ads on me, 56,000. In fact, in Florida, I own Doral and in Florida, we had the tournament there two weeks ago. Adam Scott, the great Adam Scott. Great golfer, he was winning and in between shots, I told you this after the victory speech. In between they'd have commercials and they were all about Trump, negative, horrible, negative commercials, mostly false. Mostly false, not all false but mostly false. I have to be honest but it came out the other day. I think it said $68 million, 55,000 negative ads, negative ads. And when I was running in Florida, I said how is it possible to win I mean with all of this? Because I knew it. I mean, you couldn't turn on, in Florida, where I was you couldn't turn on the television without seeing Trump commercials. Sometimes four or five in a row and they were horrendously, done by very, very bad people, very bad, evil people. And I said how is it possible to win? And God helped me, honestly, because I won in a landslide. I won by almost 20%, so and now, they're doing it here, Club for Growth. It's a crooked outfit. Look, Club for Growth. Do you ever hear this Club for Growth? A friend of mine comes, would you, he's a conservative guy, calls, would you do me a favor and see Club for Growth? I said what's Club for Growth? He said, well, they want to talk to you. I said all right send them up, he's a friend. He's a good guy. And now, I'm in politics so I have to see people that I wouldn't normally -- you know I'd say, give me a break. So Club for Growth, Club for Growth. They come up to my office. This guy was I think a former Congressman and he tells me a little bit about Club for Growth. I'm falling asleep. And then he goes, and then he goes, would you contribute $1 million? I said $1 million for what? I don't even know you. I never met you. I said do me a favor. I'm trying to be nice and I said do me a favor, go back, write me a little note if you can and he was stupid enough to write me a note. He writes me a letter asking for $1 million. I let him know that I'm not interested. You know you can be rich. I'd rather take $1 million and throw it all over this room. I'd rather give it to you for your boy, OK? And so what happens, what happens is they write me a letter -- put it in writing. I'd give you the letter some of you -- has anyone seen this letter they wrote? It's incredible. They write me a letter. It's like extortion. They ask me for $1 million. I said no, nicely. And then, they're doing ads all over Wisconsin, Club for Growth. They did it all over Florida. Club for Growth about eminent domain. By the way, without eminent domain, you wouldn't have highways, you wouldn't have schools, you wouldn't have hospitals, you wouldn't have bridges, you need eminent domain. If something's in your way and you're building a highway. If you're going to produce 7,000 jobs and you need a little corner of somebody's property every once in a while. You know, it's funny these guys all want the Keystone Pipeline, right? Everyone. Conservatives, no, Conservatives want the Keystone pipeline. I like the Keystone Pipeline too. But they have a whole big thing on eminent domain in the prospectus because without eminent domain they wouldn't go 15 feet. They wouldn't be able to build it. So they have a whole -- so they don't want eminent domain. They do commercials about eminent domain. They love the Keystone pipeline and the whole Keystone pipeline is based around eminent domain because you've got to go from Canada where Cruz was born to Texas where he's representing. Think of it. This guy. And don't forget that. Remember what I said. I'm going to win. Just remember what I said. I'm going to win. And I thank you, baby. I thank you. She's saying, oh, please win. Oh, you are so amazing. You are so amazing. I'm going to win. But remember this, if for some reason he does, it gets the nomination. The first thing, just remember, I'm a good prognosticator. I'm a good predictor. The first thing that's going to happen is the Democrats are going to sue Ted Cruz. He was born in Canada. He lived there for four years. The head of the Harvard Law School, one of the top people in the business in terms of constitution is saying that you know, he's wrong. And we have other people that are much worse -- much stronger than even that. So remember this. If Cruz gets lucky and he wins, and the only way he can get lucky is if he doesn't get -- because it's all Establishment. You know, if I go into that whole mess of the convention, I'm not the Establishment. I don't take their money. I don't hire their people. I don't do any of that stuff, OK? So you have a disadvantage. But if Cruz wins, remember what I said, just remember. Again, he's not going to win but if he does, if he gets a nomination within the first few days, he will be sued by the Democrats that he doesn't have the right to be President. And I think they're right because he wasn't born on our soil. He wasn't born. He's not a natural-born citizen. He's not a natural-born citizen. I don't like to make a big deal of this but it was just brought up by somebody. He is not a natural-born citizen. So if for some reason he should get the nomination, I really believe you're wasting your time. And boy, do we have a problem because you're going to have somebody that's going to be sued probably will lose the lawsuit. Again, he was born there, lived there for four years, mother was there, the whole thing for a long period of time, and he was a Canadian citizen joint with U.S. until 14 or 15 months ago. Did anyone know that? So he's a Senator from Texas, only because of the great Sarah Palin by the way, without Sarah Palin, he could have never won that election. He was a fluke. But he was a Senator from Texas. He lived -- he's a joint citizen. Now, he finally gave up his citizenship to Canada like 16 months ago. He said, oh, I didn't know I was a citizen of Canada also. Does anybody -- just like he didn't know that Goldman Sachs and Citibank gave him money. I mean, this guy is -- you just have to study it, folks. Look, again, I'm doing this. We're going to win. We're going to turn this country around. We're going to Make America Great Again, and we're going to win a lot. But you have to know the facts. I love you all. I love you all. Thank you. Thank you. I love you all. Thank you very much. Thank you. Thank you. Thank you. Get out there and vote. Thank you. Thank you, everybody."}