{"id":422,"author":"Donald Trump","title":"Speech: Donald Trump in Phoenix, AZ","date":"2016-03-19","link":"https://factba.se/transcript/donald-trump-speech-phoenix-az-march-19-2016","paragraphs":["Woah, woah. Man. Oh, thank you folks. Thank you very much folks. Wow, what a crowd this is. Thank you all very much. What a great honor. Sheriff Joe I want to thank you. You have some Sheriff. There's no games with you Sheriff, that's for sure. And Jan, thank you so much, and Jeff. Boy oh boy, we have such great support.","And Tuesday is so important. We have a movement going on folks. We've got to make that movement go forward. You have the establishment, They don't know what they're doing. They have no clue. They don't know how to win. They haven't won in a long time. They pick the people that -- they absolutely will never win with the people they talk about.","Go out on Tuesday and vote. I will never let you down. Remember. And I want to tell you, you know, so much about Illegal immigration and so much has been mentioned about it and talked about it. And these politicians are all, talk no action. They're never going to do anything.","They only picked it up because when I went and when I announced that I'm running for President I said, you know this country has a big, big problem with illegal immigration. And all of a sudden we started talking about it. And then you had lots of bad things happening. Crime all over the place and for the first time people saw what was going on. You had the killing of Kate.","You had the killing of Jamiel. You had so many killings. So much crime. Drugs pouring through the border. People are now seeing it. And you know what, we're going to build the wall and we're going to stop it. It's going to end. I only wish these cameras -- because there's nothing as dishonest as the media.","That I can tell you. I only wish these cameras would spin around and show the kind of people that we have. The numbers of people that we have here. I just wish they'd, for once, do it. Because you know what? We have a silent majority that's no longer so silent. It's now the loud, noisy majority and we're going to be heard.","We're going to be heard. So today on Drudge, one of the very big stories, where the border agents they say they support Trump. That Trump is the only one running that has their backs. OK? And they can do the job but they don't get support from the politicians. Now, why? I'm self-funding my campaign.","I'm putting up my own money. These guys are all -- I look at them, all up and down. We started off with 17. We're down now to three. Don't we love that? Don't we love it? Don't we love it? We lost the future of the Republican Party last Tuesday in Florida. You know that. He was the future. He was the future of the Republican Party, except I won Florida in a landslide because people are tired of what the politicians are doing to our country.","Remember that. They're tired of it. They're sick and tired of it. So we're going to make change but it's not going to be Obama change. Remember Obama? Change. This is going to be real change and we're going to have a border. And unless you have a border, you don't have a country folks. You don't have a country.","Remember that. Now, in addition -- and we'll go through a list of things very quickly because frankly it doesn't take a long time. We've got to end Common Core. We're going to bring our -- we're going to bring -- education will be local. Everybody wants it. We don't want our children educated by bureaucrats from Washington D.C., so we end Common Core.","Education local. We're going to terminate Obamacare. We're going to repeal it and replace it with great health care for far less money. That's going to happen. That is going to happen. We are going to protect our Second Amendment. Our Second Amendment. Remember, it's under siege like you've never seen before, and we are going to protect it. You know, in Paris, which has the toughest gun laws in the world -- the world.","No tougher gun laws than Paris, France. Tough. Guess what? 130 people dead. No bullets were going in the opposite direction. It was just boom, boom, boom. Same thing happened in California. 14 people, radicalized people. She probably radicalized him. They went in and killed 14 people that they worked with, supposedly that they liked.","It's not going to happen anymore folks. It's not going to happen. We're going to be smart. We're going to be vigilant. We're going to be the smart people. We're going to know what we're doing. We're going to be proud of our country again. Our military is depleted. Our military is exhausted. We don't replenish.","We take. We don't replenish. We send the best equipment in the world over to wherever we're sending it. We don't even know. I don't even think we know where we're sending it. And a bullet gets fired in the air and the people we send the equipment to they flee. And the enemy takes over this great equipment and they have better equipment than we do. And they're using our equipment.","Those days are done. Those days are done. We are going to rebuild our military. It's going to be bigger and better and stronger than ever. And hopefully nobody, nobody -- and hopefully we're not going to have to use it. But I guarantee you this, nobody, and I mean nobody, is going to mess with us anymore.","All right? Nobody. I love you too. I love you too. I love you. You know I love this country. I feel so -- I have such a spot in my heart for this country. The people are so amazing. No matter where we go, we have tragedies like this.","I mean this is pretty big one. In Alabama we had 35,000 people. Oklahoma, no matter where we go, we have these massive crowds. And by the way, are we winning or what? Look at the numbers. Man. You know it's really -- it's really amazing. It's really -- to me it's really amazing. We've won now, I think, 21 states.","OK? 21. And we've won in massive, massive landslides. Started with New Hampshire. I wasn't supposed to win New Hampshire. Ted Cruz, can you believe it? He wasn't born in our country folks. He was born in Canada. He's weak on immigration. He's in favor of amnesty. He shouldn't even be in the same category with the people that we're talking about.","But Ted Cruz was supposed to win but definitely was going to win in South Carolina. So I go to New Hampshire, we win in a massive landslide. We go to South Carolina where you have the evangelicals. Now, 68%. But you know lying Ted. We call him lying Ted. Lying Ted. So lying Ted comes up with the Bible high and he's going with the Bible, he puts it down and he starts lying.","And you know what? The evangelicals don't like liars. So we go into South Carolina. That was his stronghold. That was gonna be an easy victory. And Trump wins it in a landslide, right? In a landslide. And then one after another. We go in we win Nevada, landslide. We win the SEC. We did so great. And then we had a great day on Tuesday.","You know that? We won five. Five. And then I hear Cruz the other day and he's going, I'm the only one that can stop Trump. I've -- the only one. You ever hear this guy? I'm the only one. I beat him five times. And I said, well wait a minute, I beat him 20 times. What's going on? Lying Ted. He's lying Ted.","And you know I'll tell you, Kasich is a nice guy but, honestly, very weak on illegal immigration. That's the end of him, certainly as far as Phoenix is concerned. And as far as Arizona is concerned, Casey is very, very weak, as you know. And you know there's another thing that I don't like. He approved NAFTA.","When you approved NAFTA, a lot of your businesses that left -- and he's in favor of TPP. And so, by the way, is Ted Cruz. TPP is a disaster. It's called Trans-Pacific Partnership. It's a disaster. It's going to take your businesses away. It's going to decimate the automobile industry. You don't want it. You don't need it. We will make great deals.","Once I get into office, we will make great deals. But not with massive amounts of countries. You do them one at a time folks. One at a time. One at a time. One at a time. And if they misbehave and if they don't treat us properly, we terminate and we put them in the shed. And then maybe they come back. So crazy.","You know, I built a great company. A massive company. A fantastic company. And I filed -- I did my filings and every -- oh, they were so unhappy when they saw. They thought, maybe it's not so good. It's a phenomenal company some of the great assets of the world. Some of the great assets of the world.","Very little debt. Very, very -- tremendous cash flow. All of these things. And I say it not in a bragging -- you know, I -- look, I say it. You know what folks? Bottom line, this is the kind of mentality we need in this country, at least for a while. At least for a while. We have $19 trillion in debt. 19 trillion.","Who knows even what a trillion is? You know, five, six, seven years ago, you never even heard the term. We have $19 trillion in debt. Going to 21. They just approved a budget, which is a disaster. The omnibus. They call the omnibus budget, right? It is a total disaster. It funds Obamacare. It funds Syrians coming into the United States.","We have no idea who they are. It funds illegal immigrants coming in and through your border, right through Phoenix and right through -- right through -- it comes right through Arizona. All of these things are funded with the budget that they approved. And I think it took them like 12 minutes to approve the budget.","Not going to happen any more folks. Not going to happen anymore. So here's the story. Bottom line. The bottom line. It is -- first of all, it's great to be with you. This is incredible. We expected -- and this was just set up recently. We -- and we had -- by the way, last night, I don't know if you saw, we had an unbelievable evening in Salt Lake City, Utah.","And I hope they go with us. I hope they go with us. I said, we have to stop there. We stopped and we had an amazing evening there. But let me just tell you, and the way I finish is very simple. Our country is not winning anymore. Our trade is a disaster. China has -- it's one of the great robberies in the history of the world, what China has done to our country.","China has been rebuilt because of the money and the jobs we've lost and the money that we've given them. We have rebuilt China. And they know it. I have many friends from China. I don't have any objection to China. I think it's wonderful. I'm angry at our people, not their people. If you can get away with it. So look, we've rebuilt China.","And it's not free trade. It's not anything. This is horrible, stupid trade. When you have an imbalance of $500 billion a year, folks we got to get smart. I have Carl Icahn. I have the greatest negotiators in the world. I have the greatest business people in the world. They've all endorsed me. They say Trump's the only one that knows what corporate inversion is. You look at the corporate inversions, companies -- Pfizer, great company.","Pfizer just announced they're leaving. The great drug company. Thousands of jobs. They're going to Ireland. Many companies, as you know, are going to Mexico. Carrier air conditioner, Nabisco, Ford. Where are they going? They're going Mexico. Mexico -- mark my words. Mexico is a small version of China. And we better get smart and we better get smart quickly.","So you know, I tell this story -- and I tell this story, and it's sort of obvious, but it -- it relates to a lot of things. Now, my wife and my daughter Ivanka said to me, act presidential. Act presidential. Like in the last debate, I acted presidential, OK? I acted. I didn't hit little Marco and I didn't hit lying, lying, lying Ted.","I didn't want to hit him. I wanted to really impress my daughter and my wife, and I said, all right, I'll act -- and I won the debate. You know I've won every single debate according to the online polls. I don't know. Because I know that Cruz is a good debater but he can't talk. You know he talks, hey, wah, yay.","Not the right guy. Not the right guy. He's not going to be the right guy. And he's not going anywhere so it's not going to happen. The only one that can go -- and I say we make it before the convention by the way. A lot of nonsense. You have these stiffs like a Mitt Romney. The guy's a total stiff. Did he let us down?","This guy is a loser. Did he let us down? I mean here's a guy, goes up. He's so devastated. He forgot to campaign in the final month. He gave it to Obama. Believe me, that election -- I'm going to beat Hillary so badly. But let me just tell you, beating Obama four years ago was easier than beating Hillary Clinton now, believe me, and Mitt Romney choked.","Pure and simple. He choked. He choked like a dog. And that's not going to happen. That doesn't happen with me. So here's the story. Here's the story. We're going to tell our companies, come on back folks. Come on back. You left. We had incompetent leadership. You left. And they're not going to come back.","They're going to say we're not coming back, why should we? We're in Mexico. We're all over the place. Here's what we have to do. You know, Jeb Bush would say, he is not a conservative. I'm conservative folks but I'm also like smart. You know? Smart. Hey look, Jeb spent $48 million in New Hampshire. I spent two.","I won in a landslide. He was number six. I mean, give me a break, OK? Give me a break. He is not a conservative. I am a conservative. But you know, they get me on trade, because they say he's not a free trader. I'm a free trader but it's got to be smart trade. It's got to be good for us, not bad for us, OK? And if our incompetent politicians use political hacks to negotiate trade deals, people that have no clue about money or deals -- that have not read The Art of the Deal, in all fairness -- and don't intend to. It's not of interest to them.","Look at John Kerry. Look at the deal he made with Iran. One of the worst deals ever negotiated. One of the worst deals ever negotiated. Look at -- it's a disgrace. It's an embarrassment. By the way, on that deal, we should have never, ever even started until they give our prisoners back. You know that. We should have had them back years ago, and then once they got back, we should have gone in and told them, oh by the way, the $150 billion, sorry folks.","We're a debtor nation folks. We owe $19 trillion. We don't have it. Sorry, you're not getting the money. And you know what? After about two days of turmoil, we would have saved, believe me, $150 billion, OK? That deal is such an embarrassment. Well, our trade deals are just like that. Our trade deals -- Sergeant Bergdahl, five for one, right?","We get Bergdahl, they get five -- who is a traitor. We get Bergdahl, they get five of the great killers that they've coveted for a period of nine years, and they got them. And those guys are now back on the battlefield trying to kill us all and we got a traitor. Big deal. But that's the way -- and by the way, a traitor that supposedly -- supposedly, five or six young, beautiful soldiers were killed trying to find him and get him back, OK? That's our deals.","That's the way we negotiate. Not going to happen anymore. OK? Not going to happen anymore. So what we're going to do is we're going to tell our wonderful businesses that deserted us -- they left us and I'm not even blaming them. They had no reason not to because nobody talks to them. You think anybody went to Carrier and said, listen, you're letting all of these people go. You're moving to Mexico.","Please don't do it. Bah, bah, bah. Here's the deal. They don't do that. So they move into Mexico and I would say -- whether it's me -- I want to do it myself. I know it's not Presidential. It's not Presidential. It's not Presidential for the President of the United States to call up the head of Carrier. Hello, this is the President.","But I don't care. It's so much fun for me. I love doing it. Please don't take that away. Please don't take that away from me. I love deals. So whether it's me or one of my killers -- because they'll do -- I know them. I know the great ones. I know the bad ones. I know the overrated ones. I know the ones you've never heard of, that are better than all of them.","But whether it's one of these killers or whether it's me. But let me do it, OK? At least with Carrier. Please. So I call up -- I call up. They say the President in United States calling for the head of Carrier. Get him on the phone. I say, listen, here's the story. Good luck in Mexico. Enjoy your stay. But here's the story, you let go of 1,400 great people that helped build your company and I really love -- by the way, I love the pictures of your new facility.","Here's the story. Every single air conditioning unit that you make, every single one, as it crosses the border -- and we're going to have a real border because we're going to have a wall. We're going to have a real border, OK? We're going to have a big beautiful wall that nobody's crossing, and nobody's going underneath either by the way.","Just in case you had any questions. Don't worry about the tunnel stuff. Nobody's going over it or under it. And we're going to have, by the way, a big beautiful door and people are going to come in to our country but they're going to come in to our country legally, legally, legally. So I tell the head of Carrier, every single unit that you make in Mexico and you sell in the United States, we're going to put a 35% tax on that unit, and I hope it works out well for you folks.","And here's what's going to happen. They're going to have lobbyists call me. But I didn't take any of their money. They're going to have special interests call me. But I didn't take any of their money. They're going to have donors, donors, donors. But I didn't take any of their money. I don't give a damn for them folks.","I care for you. And here's what's going to happen. Within 24 hours of that phone call, the head of Carrier and Ford and so many other companies -- I mean, you just take a look. I could give you a list. I could read them out all day. The head of Nabisco leaving Chicago with their big plant, moving to Mexico.","No more Oreos for us. I'm not eating Oreos anymore, I guarantee. So here's what's going to happen folks. I will get a call within 24 hours and he will say to me, head of carrier, Mr. President we've decided to stay in the United States. I said, thank you very much. Build your plant anywhere. I don't even care if you don't build it in Phoenix or in Arizona.","I want it in the United States, right? Right? We want it in the United States. And it's going to happen a lot. And here's the story. We are going to start winning again. We're not winning anymore. We don't win at anything. We don't win at anything. We don't win with our military. We can't beat ISIS. How about our great General George Patton?","I love George Patton. He's too tough. He could never be a general now he's too tough. He's not politically correct. We got to stop with this political correct -- and by the way, by the way. Chipping away, just like I said, they're chipping away at the Second Amendment. They're chipping away at Christianity.","They're chipping away at our religions. We're not going to have it anymore. It comes -- Christmas time, we're going to see signs up that say Merry, Merry, Merry Christmas. OK? Remember it. Remember it. So we have become so politically correct that we're totally impotent as a country. It's not happening anymore.","So here's what's gonna happen. We're going to rebuild our military. We're going to knock the hell out of ISIS and we're going to come back and rebuild our country. We're going to rebuild our country. Our military is going to be so strong and so respected. And we're going to buy the right equipment. We're not going to buy equipment that was gotten because somebody at that company, that sold the equipment, had political connections to these characters that I run against.","We are going to have a great military and we are going to finally, finally take care of our great veterans. We are going to take care of them. So we're going to win with the military. We're going to win with the men. Oh thank you very -- look at you. Thank you. USA is right.","USA. USA. Thank you. So folks we're going to start winning again. We're going to win with our military. We're going to win for our vets, right? We're going to win for our vets, right? We're going to win for our vets. We're going to win with education. We're going to win by knocking the hell out of Obamacare.","Terminating it. Coming up with something much less expensive. Much better. We are going to win in every aspect of our lives. We're going to win so much. We're going to win with our Second Amendment. We're going to win big league with our Second Amendment. We are going to keep winning at every level. We're going to win so much that you're going to come and you're going to say, Mr. President we're winning too much.","I can't stand it anymore and I'm going to say, I don't care. And you know where we're really going to win? This is for the people of Phoenix, for the people of Arizona. We're really going to win at our border. We are going to win at our border and we're going to build the wall. And ladies and gentlemen, I love you.","You have to go out. You have to vote on Tuesday. You will never be disappointed with me. I'm not going to disappoint you. We are going to bring our country back. We are going to take our country back. We are going to have victories again. You are going to be so proud of your family, yourself, your President and your country.","We are going to win again. All the time. Thank you very much. I love you. I love you. Thank you very much. Thank you. Thank you. Thank you everybody."],"text":" Woah, woah. Man. Oh, thank you folks. Thank you very much folks. Wow, what a crowd this is. Thank you all very much. What a great honor. Sheriff Joe I want to thank you. You have some Sheriff. There's no games with you Sheriff, that's for sure. And Jan, thank you so much, and Jeff. Boy oh boy, we have such great support. And Tuesday is so important. We have a movement going on folks. We've got to make that movement go forward. You have the establishment, They don't know what they're doing. They have no clue. They don't know how to win. They haven't won in a long time. They pick the people that -- they absolutely will never win with the people they talk about. Go out on Tuesday and vote. I will never let you down. Remember. And I want to tell you, you know, so much about Illegal immigration and so much has been mentioned about it and talked about it. And these politicians are all, talk no action. They're never going to do anything. They only picked it up because when I went and when I announced that I'm running for President I said, you know this country has a big, big problem with illegal immigration. And all of a sudden we started talking about it. And then you had lots of bad things happening. Crime all over the place and for the first time people saw what was going on. You had the killing of Kate. You had the killing of Jamiel. You had so many killings. So much crime. Drugs pouring through the border. People are now seeing it. And you know what, we're going to build the wall and we're going to stop it. It's going to end. I only wish these cameras -- because there's nothing as dishonest as the media. That I can tell you. I only wish these cameras would spin around and show the kind of people that we have. The numbers of people that we have here. I just wish they'd, for once, do it. Because you know what? We have a silent majority that's no longer so silent. It's now the loud, noisy majority and we're going to be heard. We're going to be heard. So today on Drudge, one of the very big stories, where the border agents they say they support Trump. That Trump is the only one running that has their backs. OK? And they can do the job but they don't get support from the politicians. Now, why? I'm self-funding my campaign. I'm putting up my own money. These guys are all -- I look at them, all up and down. We started off with 17. We're down now to three. Don't we love that? Don't we love it? Don't we love it? We lost the future of the Republican Party last Tuesday in Florida. You know that. He was the future. He was the future of the Republican Party, except I won Florida in a landslide because people are tired of what the politicians are doing to our country. Remember that. They're tired of it. They're sick and tired of it. So we're going to make change but it's not going to be Obama change. Remember Obama? Change. This is going to be real change and we're going to have a border. And unless you have a border, you don't have a country folks. You don't have a country. Remember that. Now, in addition -- and we'll go through a list of things very quickly because frankly it doesn't take a long time. We've got to end Common Core. We're going to bring our -- we're going to bring -- education will be local. Everybody wants it. We don't want our children educated by bureaucrats from Washington D.C., so we end Common Core. Education local. We're going to terminate Obamacare. We're going to repeal it and replace it with great health care for far less money. That's going to happen. That is going to happen. We are going to protect our Second Amendment. Our Second Amendment. Remember, it's under siege like you've never seen before, and we are going to protect it. You know, in Paris, which has the toughest gun laws in the world -- the world. No tougher gun laws than Paris, France. Tough. Guess what? 130 people dead. No bullets were going in the opposite direction. It was just boom, boom, boom. Same thing happened in California. 14 people, radicalized people. She probably radicalized him. They went in and killed 14 people that they worked with, supposedly that they liked. It's not going to happen anymore folks. It's not going to happen. We're going to be smart. We're going to be vigilant. We're going to be the smart people. We're going to know what we're doing. We're going to be proud of our country again. Our military is depleted. Our military is exhausted. We don't replenish. We take. We don't replenish. We send the best equipment in the world over to wherever we're sending it. We don't even know. I don't even think we know where we're sending it. And a bullet gets fired in the air and the people we send the equipment to they flee. And the enemy takes over this great equipment and they have better equipment than we do. And they're using our equipment. Those days are done. Those days are done. We are going to rebuild our military. It's going to be bigger and better and stronger than ever. And hopefully nobody, nobody -- and hopefully we're not going to have to use it. But I guarantee you this, nobody, and I mean nobody, is going to mess with us anymore. All right? Nobody. I love you too. I love you too. I love you. You know I love this country. I feel so -- I have such a spot in my heart for this country. The people are so amazing. No matter where we go, we have tragedies like this. I mean this is pretty big one. In Alabama we had 35,000 people. Oklahoma, no matter where we go, we have these massive crowds. And by the way, are we winning or what? Look at the numbers. Man. You know it's really -- it's really amazing. It's really -- to me it's really amazing. We've won now, I think, 21 states. OK? 21. And we've won in massive, massive landslides. Started with New Hampshire. I wasn't supposed to win New Hampshire. Ted Cruz, can you believe it? He wasn't born in our country folks. He was born in Canada. He's weak on immigration. He's in favor of amnesty. He shouldn't even be in the same category with the people that we're talking about. But Ted Cruz was supposed to win but definitely was going to win in South Carolina. So I go to New Hampshire, we win in a massive landslide. We go to South Carolina where you have the evangelicals. Now, 68%. But you know lying Ted. We call him lying Ted. Lying Ted. So lying Ted comes up with the Bible high and he's going with the Bible, he puts it down and he starts lying. And you know what? The evangelicals don't like liars. So we go into South Carolina. That was his stronghold. That was gonna be an easy victory. And Trump wins it in a landslide, right? In a landslide. And then one after another. We go in we win Nevada, landslide. We win the SEC. We did so great. And then we had a great day on Tuesday. You know that? We won five. Five. And then I hear Cruz the other day and he's going, I'm the only one that can stop Trump. I've -- the only one. You ever hear this guy? I'm the only one. I beat him five times. And I said, well wait a minute, I beat him 20 times. What's going on? Lying Ted. He's lying Ted. And you know I'll tell you, Kasich is a nice guy but, honestly, very weak on illegal immigration. That's the end of him, certainly as far as Phoenix is concerned. And as far as Arizona is concerned, Casey is very, very weak, as you know. And you know there's another thing that I don't like. He approved NAFTA. When you approved NAFTA, a lot of your businesses that left -- and he's in favor of TPP. And so, by the way, is Ted Cruz. TPP is a disaster. It's called Trans-Pacific Partnership. It's a disaster. It's going to take your businesses away. It's going to decimate the automobile industry. You don't want it. You don't need it. We will make great deals. Once I get into office, we will make great deals. But not with massive amounts of countries. You do them one at a time folks. One at a time. One at a time. One at a time. And if they misbehave and if they don't treat us properly, we terminate and we put them in the shed. And then maybe they come back. So crazy. You know, I built a great company. A massive company. A fantastic company. And I filed -- I did my filings and every -- oh, they were so unhappy when they saw. They thought, maybe it's not so good. It's a phenomenal company some of the great assets of the world. Some of the great assets of the world. Very little debt. Very, very -- tremendous cash flow. All of these things. And I say it not in a bragging -- you know, I -- look, I say it. You know what folks? Bottom line, this is the kind of mentality we need in this country, at least for a while. At least for a while. We have $19 trillion in debt. 19 trillion. Who knows even what a trillion is? You know, five, six, seven years ago, you never even heard the term. We have $19 trillion in debt. Going to 21. They just approved a budget, which is a disaster. The omnibus. They call the omnibus budget, right? It is a total disaster. It funds Obamacare. It funds Syrians coming into the United States. We have no idea who they are. It funds illegal immigrants coming in and through your border, right through Phoenix and right through -- right through -- it comes right through Arizona. All of these things are funded with the budget that they approved. And I think it took them like 12 minutes to approve the budget. Not going to happen any more folks. Not going to happen anymore. So here's the story. Bottom line. The bottom line. It is -- first of all, it's great to be with you. This is incredible. We expected -- and this was just set up recently. We -- and we had -- by the way, last night, I don't know if you saw, we had an unbelievable evening in Salt Lake City, Utah. And I hope they go with us. I hope they go with us. I said, we have to stop there. We stopped and we had an amazing evening there. But let me just tell you, and the way I finish is very simple. Our country is not winning anymore. Our trade is a disaster. China has -- it's one of the great robberies in the history of the world, what China has done to our country. China has been rebuilt because of the money and the jobs we've lost and the money that we've given them. We have rebuilt China. And they know it. I have many friends from China. I don't have any objection to China. I think it's wonderful. I'm angry at our people, not their people. If you can get away with it. So look, we've rebuilt China. And it's not free trade. It's not anything. This is horrible, stupid trade. When you have an imbalance of $500 billion a year, folks we got to get smart. I have Carl Icahn. I have the greatest negotiators in the world. I have the greatest business people in the world. They've all endorsed me. They say Trump's the only one that knows what corporate inversion is. You look at the corporate inversions, companies -- Pfizer, great company. Pfizer just announced they're leaving. The great drug company. Thousands of jobs. They're going to Ireland. Many companies, as you know, are going to Mexico. Carrier air conditioner, Nabisco, Ford. Where are they going? They're going Mexico. Mexico -- mark my words. Mexico is a small version of China. And we better get smart and we better get smart quickly. So you know, I tell this story -- and I tell this story, and it's sort of obvious, but it -- it relates to a lot of things. Now, my wife and my daughter Ivanka said to me, act presidential. Act presidential. Like in the last debate, I acted presidential, OK? I acted. I didn't hit little Marco and I didn't hit lying, lying, lying Ted. I didn't want to hit him. I wanted to really impress my daughter and my wife, and I said, all right, I'll act -- and I won the debate. You know I've won every single debate according to the online polls. I don't know. Because I know that Cruz is a good debater but he can't talk. You know he talks, hey, wah, yay. Not the right guy. Not the right guy. He's not going to be the right guy. And he's not going anywhere so it's not going to happen. The only one that can go -- and I say we make it before the convention by the way. A lot of nonsense. You have these stiffs like a Mitt Romney. The guy's a total stiff. Did he let us down? This guy is a loser. Did he let us down? I mean here's a guy, goes up. He's so devastated. He forgot to campaign in the final month. He gave it to Obama. Believe me, that election -- I'm going to beat Hillary so badly. But let me just tell you, beating Obama four years ago was easier than beating Hillary Clinton now, believe me, and Mitt Romney choked. Pure and simple. He choked. He choked like a dog. And that's not going to happen. That doesn't happen with me. So here's the story. Here's the story. We're going to tell our companies, come on back folks. Come on back. You left. We had incompetent leadership. You left. And they're not going to come back. They're going to say we're not coming back, why should we? We're in Mexico. We're all over the place. Here's what we have to do. You know, Jeb Bush would say, he is not a conservative. I'm conservative folks but I'm also like smart. You know? Smart. Hey look, Jeb spent $48 million in New Hampshire. I spent two. I won in a landslide. He was number six. I mean, give me a break, OK? Give me a break. He is not a conservative. I am a conservative. But you know, they get me on trade, because they say he's not a free trader. I'm a free trader but it's got to be smart trade. It's got to be good for us, not bad for us, OK? And if our incompetent politicians use political hacks to negotiate trade deals, people that have no clue about money or deals -- that have not read The Art of the Deal, in all fairness -- and don't intend to. It's not of interest to them. Look at John Kerry. Look at the deal he made with Iran. One of the worst deals ever negotiated. One of the worst deals ever negotiated. Look at -- it's a disgrace. It's an embarrassment. By the way, on that deal, we should have never, ever even started until they give our prisoners back. You know that. We should have had them back years ago, and then once they got back, we should have gone in and told them, oh by the way, the $150 billion, sorry folks. We're a debtor nation folks. We owe $19 trillion. We don't have it. Sorry, you're not getting the money. And you know what? After about two days of turmoil, we would have saved, believe me, $150 billion, OK? That deal is such an embarrassment. Well, our trade deals are just like that. Our trade deals -- Sergeant Bergdahl, five for one, right? We get Bergdahl, they get five -- who is a traitor. We get Bergdahl, they get five of the great killers that they've coveted for a period of nine years, and they got them. And those guys are now back on the battlefield trying to kill us all and we got a traitor. Big deal. But that's the way -- and by the way, a traitor that supposedly -- supposedly, five or six young, beautiful soldiers were killed trying to find him and get him back, OK? That's our deals. That's the way we negotiate. Not going to happen anymore. OK? Not going to happen anymore. So what we're going to do is we're going to tell our wonderful businesses that deserted us -- they left us and I'm not even blaming them. They had no reason not to because nobody talks to them. You think anybody went to Carrier and said, listen, you're letting all of these people go. You're moving to Mexico. Please don't do it. Bah, bah, bah. Here's the deal. They don't do that. So they move into Mexico and I would say -- whether it's me -- I want to do it myself. I know it's not Presidential. It's not Presidential. It's not Presidential for the President of the United States to call up the head of Carrier. Hello, this is the President. But I don't care. It's so much fun for me. I love doing it. Please don't take that away. Please don't take that away from me. I love deals. So whether it's me or one of my killers -- because they'll do -- I know them. I know the great ones. I know the bad ones. I know the overrated ones. I know the ones you've never heard of, that are better than all of them. But whether it's one of these killers or whether it's me. But let me do it, OK? At least with Carrier. Please. So I call up -- I call up. They say the President in United States calling for the head of Carrier. Get him on the phone. I say, listen, here's the story. Good luck in Mexico. Enjoy your stay. But here's the story, you let go of 1,400 great people that helped build your company and I really love -- by the way, I love the pictures of your new facility. Here's the story. Every single air conditioning unit that you make, every single one, as it crosses the border -- and we're going to have a real border because we're going to have a wall. We're going to have a real border, OK? We're going to have a big beautiful wall that nobody's crossing, and nobody's going underneath either by the way. Just in case you had any questions. Don't worry about the tunnel stuff. Nobody's going over it or under it. And we're going to have, by the way, a big beautiful door and people are going to come in to our country but they're going to come in to our country legally, legally, legally. So I tell the head of Carrier, every single unit that you make in Mexico and you sell in the United States, we're going to put a 35% tax on that unit, and I hope it works out well for you folks. And here's what's going to happen. They're going to have lobbyists call me. But I didn't take any of their money. They're going to have special interests call me. But I didn't take any of their money. They're going to have donors, donors, donors. But I didn't take any of their money. I don't give a damn for them folks. I care for you. And here's what's going to happen. Within 24 hours of that phone call, the head of Carrier and Ford and so many other companies -- I mean, you just take a look. I could give you a list. I could read them out all day. The head of Nabisco leaving Chicago with their big plant, moving to Mexico. No more Oreos for us. I'm not eating Oreos anymore, I guarantee. So here's what's going to happen folks. I will get a call within 24 hours and he will say to me, head of carrier, Mr. President we've decided to stay in the United States. I said, thank you very much. Build your plant anywhere. I don't even care if you don't build it in Phoenix or in Arizona. I want it in the United States, right? Right? We want it in the United States. And it's going to happen a lot. And here's the story. We are going to start winning again. We're not winning anymore. We don't win at anything. We don't win at anything. We don't win with our military. We can't beat ISIS. How about our great General George Patton? I love George Patton. He's too tough. He could never be a general now he's too tough. He's not politically correct. We got to stop with this political correct -- and by the way, by the way. Chipping away, just like I said, they're chipping away at the Second Amendment. They're chipping away at Christianity. They're chipping away at our religions. We're not going to have it anymore. It comes -- Christmas time, we're going to see signs up that say Merry, Merry, Merry Christmas. OK? Remember it. Remember it. So we have become so politically correct that we're totally impotent as a country. It's not happening anymore. So here's what's gonna happen. We're going to rebuild our military. We're going to knock the hell out of ISIS and we're going to come back and rebuild our country. We're going to rebuild our country. Our military is going to be so strong and so respected. And we're going to buy the right equipment. We're not going to buy equipment that was gotten because somebody at that company, that sold the equipment, had political connections to these characters that I run against. We are going to have a great military and we are going to finally, finally take care of our great veterans. We are going to take care of them. So we're going to win with the military. We're going to win with the men. Oh thank you very -- look at you. Thank you. USA is right. USA. USA. Thank you. So folks we're going to start winning again. We're going to win with our military. We're going to win for our vets, right? We're going to win for our vets, right? We're going to win for our vets. We're going to win with education. We're going to win by knocking the hell out of Obamacare. Terminating it. Coming up with something much less expensive. Much better. We are going to win in every aspect of our lives. We're going to win so much. We're going to win with our Second Amendment. We're going to win big league with our Second Amendment. We are going to keep winning at every level. We're going to win so much that you're going to come and you're going to say, Mr. President we're winning too much. I can't stand it anymore and I'm going to say, I don't care. And you know where we're really going to win? This is for the people of Phoenix, for the people of Arizona. We're really going to win at our border. We are going to win at our border and we're going to build the wall. And ladies and gentlemen, I love you. You have to go out. You have to vote on Tuesday. You will never be disappointed with me. I'm not going to disappoint you. We are going to bring our country back. We are going to take our country back. We are going to have victories again. You are going to be so proud of your family, yourself, your President and your country. We are going to win again. All the time. Thank you very much. I love you. I love you. Thank you very much. Thank you. Thank you. Thank you everybody."}