{"id":423,"author":"Donald Trump","title":"Speech: Donald Trump in Salt Lake City, UT","date":"2016-03-18","link":"https://factba.se/transcript/donald-trump-speech-salt-lake-city-ut-march-18-2016","paragraphs":["Thank you, everybody. Wow. Thank you. What a group. We love Salt Lake City. We love Utah. You know they didn't have me scheduled in Utah I was going right into Phoenix and I said, \"Wait a minute, I want to go to Utah. What's going on with Utah?\" Based on what I see here we might win Utah. You know, we have thousands of people.","Really great people, thousands of people outside. Unbelievable. We have speakers set up out there. But you have a better location, I must say. So we had an amazing Tuesday. We won five including the islands. We won five and it was incredible. We pick up a lot of delegates. We're moving, we're moving. And I think, you know, they talk about the convention.","I think, we get to the convention, it's over. I don't think there is going to be much of a dispute. I don't think we're going to have a lot of dispute. The numbers were fantastic. Illinois, unbelievable and then, you know, we had as you know, I had a tough race in Florida. I was facing the future of the Republican Party, Marco Rubio, the future.","Well, that's what they said. They said he's the future the Republican Party. I assume he's not going to be endorsing me. I don't -- haven't found that out but I assume. But we face the future of the Republican Party, folks. Someday, you'll get another chance to vote for him maybe. You know you never know.","You never know. And boy did we win big. We got 99 delegates, just about the max, and we got 99. We did incredible between Illinois, Missouri, we're still waiting for -- I mean, we won Missouri but we're still waiting for that final count. And you know I keep hearing that Cruz is somebody that's a big shot in Missouri but I don't think Missouri works that way.","That's a great place, folks, I'll tell you. So we did -- we did fantastically there. We did -- we've done great essentially everywhere started, I mean, very good in Iowa, except a lot of, you know, lying Ted Cruz, what he did. Lying Ted. Lying Ted. One of the -- the biggest liars I've ever seen in my life.","I really mean it. You know when he walks in, you know the evangelicals are with me because they know one thing about me, I'm not a liar. But -- but Ted Cruz he walks in Bible high, Bible high, puts it down and he starts lying. I'll tell you what, now, he's got a lot of problems. We'll talk about him for a second but he's got a lot of problems.","Number one, in all fairness, look, is he really a natural born citizen? I mean, give me a break. Give me a break. And here's what's going to happen I don't think you'll ever get the chance, I don't think they care and that's wasn't wasting their money yet. Do you notice that Hillary's only focused on me, only?","They talk about Trump, Trump, Trump and the last person she wants to be running against is Trump and us. Believe me. So he was born in Canada, lived there for four years. He was a citizen of Canada 15 or 16 months ago. He was a citizen of Canada. Can you believe it? He became a United States senator and then he said, \"I didn't know I was a citizen of Canada.\" Lying Ted.","Lying Ted. He didn't know. He was adjoint. He was U.S. and he was Canada. And you know, that's not the way it's supposed to work. You're supposed to be born like here, here, here. So the first thing that's going to happen if he should luck out because it would -- He'd need a lot of luck. He's really, really far behind.","And you know he was supposed to win South Carolina, big evangelical base, 68% and that was going to be his. We won in a landslide, right? And that was right after I was attacked by the Pope. But the pope came back the next day. The pope was talking about illegal immigration and when he found out about what it really represented.","He was terrific. The pope was OK. Fortunately, just before the votes started going, 'cause you wanted to -- we never want to take on the Pope, right? You know, we don't want to take him on. So anyway, so the evangelicals have been so amazing. Everybody's so amazing and do I love the Mormons OK. I love the Mormons.","I have many friends that live in Salt Lake. I have a lot of friends. No, I have a lot of friends. By the way, Mitt Romney is not one of them. Did he choke? Did this guy choke? He's a choke artist. I can't believe. Are you sure he's a Mormon? Are we sure? He choked. He choked. It was so sad. He should have beaten Obama.","We wouldn't be working. I could be back right now. I could be back working in New York and doing my deals and having fun and being with my family. Ivanka is having a baby today or tomorrow or the next day. I could be with Ivanka and set him with you which is OK. It's OK. But now, Ivanka -- Ivanka is having a baby.","I thought maybe three weeks ago, two weeks ago. I mean it's got to happen soon. We thought it could have happened. I've always gotten every time I go to a primary place, I say, \"Maybe Ivanka -- Come on.\" Let's see what happens, right? I took her to Florida. I hope. Didn't work. But I should have right brought here.That would have been very cool.","But any day now, it should be over the next couple of days. But she's really special, she sends her regards and she really is very special. Don is with me, Don Trump, and he's with me, someplace. Where is he? Come on. Come on, Don. She hears all these reports. He wants to protect his father. You know, it's like one of those things I have a good son and Eric is -- is is fantastic.","They always like to travel. And by the way, outside looks absolutely fine. We have, they said, 2,500 of you and they have some of the agitators slash protesters, some of protesters, about 2% and then some are agitators that would be the rest, OK. And you know, we have to be allowed our freedom of speech, folks.","We have to be allowed freedom speech. We're not causing any problems and you know if you look at some of the other places we've been it's been very, very safe and you'll have a protester or agitator but stand up and start screaming. Then the crowd screams him down and, in fact, I wouldn't mind going over that original noise but then the crowd goes so wild and all they're doing is screaming U.S.A., U.S.A., U.S.A. and then you can't speak because it's so noisy it's incredible.","and had I known, you know we were trying to get a really big place I feel very guilty, in fact, we'll come back. I promise. We're going to come back. Don't forget we only set this up like yesterday afternoon and it is true. I mean, it's true. I said, \"I want to stop in Utah.\" I know I'm going to do great there and, but I have friends that are here and I have a couple of friends I have actually one, who is Jewish, and he loves.","He says that the hardest working people, he loves the Mormons he loves the Mormons. And he's got a very successful business and he's just very, very proud and I have so many friends I've had many. I've had many Mormons work, you know, for me and they give to the church and they constantly give. Sometimes I make the payment directly to the church.","They say they don't want to be tempted by keeping the money, OK. But they're -- they're amazing people and it's an honor to be with you tonight, for those of you that are Mormons. It's an honor. I love you. So we have a lot of things we can talk about. I do want to talk a little bit about the competition because this started off with 17 people.","We're now down to three. Or as they say usually on television two and a quarter. I actually think it's one and a half if you want to know the truth, but we don't have many left. And you know, they ask me on television they say, \"Well, maybe you'll start acting more presidential.\" I say, \"What's wrong with the way I'm doing it right now?\" In all fairness, you know.","That's you know their form of anarch -- I could be the most presidential person you've ever seen. The one thing I have to say is you have to knock them out. You know, a lot of people with 17, they were coming at me from different angles. If you're too presidential you can lose. We don't want to lose, right?","We're not people that don't know how to close. We know how to close the deal. And they said to me, Bill O'Reilly, good guy, said to me the other night, he said, \"Well, are you going to stop with to this or are you gonna act a little more?\" I said, \"Bill, I have two more leftovers. I have to take care of that first.","OK.\" I have to take care. And then after that, I promise I'll act presidential. Well, maybe I'll wait 'till Hillary gets out. Maybe I'll wait 'till we knockout her. Number one she shouldn't be allowed to run. OK. How that deal is working out. How that deal -- And I have to tell you something just came out over the wires the Reuters tracking poll.","So you know we have four or five six people and they're always comparing me like with Hillary. The Wall Street Journal which has no idea anything about math. They had to think. Well, Hillary had X millions of votes and you had a little bit less. I had 17 people in my dear. She had Bernie, just Bernie, who looks like he's finished now.","You know I'd love to run against Bernie but honestly, I'd rather run against Hillary. I must be honest. So you know with all of those people that's a tremendous amount of people. So one by one by one they leave. This guy Lindsey Graham, I mean, you ever see a guy like this? He's a seven. He started at seven.","I started hitting him. Now, he really hit me. I mean in all cases when you say, \"It was a nice crowd nice looking people.\" Those lights are bright. They're bright. But in all fairness they hit me. And you have to hit back. Look at Marco. He hit me. He went for everything he could do. He even talked about these powerful hands.","Look at that. He talked about the hands. And he makes stuff up as he goes along. You know they're politicians all-talk-no-action politicians. They will never take you where you want to be, folks. They're all taken care of with campaign. Look, campaign contributions are 100%, whether it's the pharmaceutical drug industry, whether it's anything you want to name.","They're all taken care of a hundred percent and you go up to him and you say, \"Well who is it? Who is gonna be the lobbyist to take care of Ted Cruz? I could give you the name of lobbyists. OK. It's almost like emblazoned on their far head the lobbyist forehead: Cruz, Cruz. And you go in and they raise money for him and I'm self funding my campaign.","I'm not taking money. I'm for you. I'm for you. I'm for you. So a lot of things -- thank you very much, a lot of things -- this is a very friendly group here. I expect a couple of protesters. I -- I mean I'm sure some a couple of pro -- Did any protesters sneak in tonight? Anybody? Huh? So that's so nice.","You know I was seeing and coming in, I was seeing that there were some protesters outside. They don't show the 2,000 people that are trying to get in that are with us. They show other people and how they get here is pretty sad. But you going to have to check on it because they always talk about with stifling them, they're stifling us, folks.","They're stifling us. We want nobody to get hurt we want everything to be perfect and just seems to be like a perfect evening but they can't stifle us. They can't let it happen. We can't allow it to happen. It's too important. And you know with all of the big rallies, I have 21,000, I have 35,000 in Alabama recently.","No matter where we go we have tremendous rallies and with all of these rallies people aren't getting hurt, folks. We did cancel Chicago and I did it. I think a very wise thing and I've been given credit I hated to do it. We had 25,000 people coming into Chicago. And we're able to get a lot of them not to bother coming in because it looked like it could have been a problem.","We ended it and nobody was hurt and we did a smart thing but it's really unfair. You know you talk about freedom of speech. You talk about the first amendment. Very, very unfair when they can stifle us very unfair. Remember that just remember that. And we can't let it and we can't let it happen. All right, I want to talk about a few things.","I want to talk about, first of all, I have to talk about this. Reuters just came out with their new poll, the big tracking poll. I'm almost 50. It's 40 se -- 49. This at 49.7 I said, \"You couldn't get -- You couldn't get me to 50, right?\" And that's with four people. So 40, you know when you are 49.7 you have four people that means you're 65, 70%, that's a national poll.","Emmerson just came out in New York poll. I hope I do so well in Utah. Just came out a little while ago, Emmerson, 64% for Trump, 12% for Cruz and Kasich had 1%, 64%. Emmerson, very, very respected poll. CNN came out a week ago and CNN had us said 49 or some -- some really high number, 49. And I'll tell you what, we are doing well, folks, we are doing well.","and people are asking me all the time I'm on so many magazine covers, you know, it's like -- And if I don't like the magazine, we just use it for wallpaper, we put it up as well. I've been hit by some of them. You know they say, \"Oh, we want to do a great story.\" say, \"They'll never do a great story.\" I do it and I'm right.\" You know I can almost tell by the magazine, fair or not fair.","I tell you who has treated me fairly, Time Magazine. I've been on the cover many times over the last four or five months. I mean, like many times and in particular one of them was incredible because they were talking about this as a movement. It's never been done before. There's never been anything like this before.","Thousands and thousands of people, you know, the nice thing, yes, I'm spending my own money, yes, it's a lot of money probably in for about $30 million already, a lot of money but other people are in for three, four, five, times said. In New Hampshire, which I owe a lot to, because the people of New Hampshire are incredible, and they have a big problem.","Drugs. They have a drug problem. It's like an incredible problem. I said, \"I'm going to stop up that border. You're not going to have drugs coming into New Hampshire anymore\" I owe it to them. And that means Utah, that means Salt Lake City, I mean, that means a lot of different places. But you know, New Hampshire with a beautiful fields and the trees and everything so beautiful.","And I'd go to a meeting with people that lived there and it was always like the biggest problem they have. Heroin. And you just don't see it for New Hampshire. So we said to them, and I mean it. Then I went to South Carolina. We won New Hampshire in a landslide. We then went to South Carolina, where I was expected to come in second and we won in a landslide because the evangelicals don't like lying and they don't like liars.","They're smart and they don't want that. And then we went all over. We went to Nevada we had a landslide there. Pretty much a landslide everywhere we've been. The biggest landslide was Florida 20 points almost 20 points. That was a great -- that was a great victory. That was the victory everybody said the polls must be wrong because they were showing like 18 points, 16 points.","One of the polls had eight or nine points but they didn't like me. You know, those polls are a little bit suspect before. The ultimate poll is the vote right. But the polls were showing 16, 17 points .We won by close to 20 points. And it was an amazing event. And people -- look, the biggest story in all of politics worldwide is what's happening to the Republican Party.","Can you believe this. It's true. Because the voting turnout is massive. It's -- and you know where they are, right? The people coming in, where are they from. They're Democrats, they're independents. And you know, almost, what's to me is the most impressive and I see it when I'm signing or when I'm shaking hands with people.","Most impressive, to me, is the fact that many of the people, so many, I would say of the new people coming in, which is millions and millions of people, 15, 20%, new voters, people that have never voted before, 50 years old, 60 years old, 30 years old. These are people, they say, \"Mr. Trump, I'm 38 years old.","I love you. I've never voted before. I've never had the incentive to vote before.\" And we have -- we have, I think., I guess ultimately millions of people come in. They've never -- you know what a great thing that is for our democracy when you think about it? These are people these are smart people these are great people.","These are hardworking people but they've been left out they've been disenfranchised they haven't liked the people that -- you know they're smart they see people that they're supposed to vote for and they say I'm not going to vote and we can understand that. But people that, I had one person in Tennessee, she's the all time record, 93 years old, everybody knows who I'm talking about,a big story, 93 years old, never voted before.","Now I could say, come on, you have to, you know, you do a little voting, right. She never voted before she voted for the first time recently in Tennessee. Ninety three years old. That is so amazing and she's like a fan. She's 93 she's wearing a Trump shirt, she's wearing a Trump shirt. So -- so I think it's an amazing tribute to all of us. It's an amazing tribute when they talk about the movement and when they talk about the fact that they've never seen anything like it and nothing stops us. The other thing they say and it comes out very strongly opposes that the Trump people are by far the most loyal.","They actually say, no, they actually say that Trump can do almost anything and they're never leaving, where some guys, if they sneeze, if the candidate sneezes, they're gone. The people are gone. Trump can do almost anything. So I guess there are certain things maybe not but almost anything. Thank you man.","Thank you. We love you all. We love you. Thank you. Thank you. Oh, that's beautiful. Look. What's it all about. You know the theme: Make America Great Again. That's the theme. And I will say this, our country is doing terribly. The real number of unemployment is -- is many times what they report. That number was meant for politicians.","It was meant probably for presidents so that they can say they're 5%. You know what, if real employment and if real unemployment was at 5% I wouldn't have the crowds that I'm having. No matter what. Now with all of that being said, I'm going to talk a little bit about trade. We're going to talk certainly about security.","We're going to have a little fun. Then I'll go home and I will go, you know. And then on Tuesday you're going to go and you're going to vote for who? Can't do it. And if you want I'll come back. I don't care. I'll keep coming back. But I want to do well in Utah. No, no I want to do well because you can't have Cruz.","I want to go over a couple of more things. OK. Ready I wrote these notes down. Listen. Number one -- number one, Cruz has done nothing he hasn't done anything. He'll stand on the Senate floor. Gets along with nobody, practically nobody, in terms of senators you just got one from Mike Lee, a nice guy, but you know the one he talked about was Senator Jeff Sessions, right.","He'd say Senator Jeff Sessions. Senator Jeff Sessions endorsed me. OK. And Jeff Sessions is one of the most respected Alabama, one of the most respected senators in -- in, there is. I mean there's nobody better. I mean he's great. But he endorsed me and then now Cruz doesn't talk about him anymore. But that's OK. Used to talk -- But number one he did nothing.","Remember he went down and he -- he filibustered for a day or something and he's ranting and raving and everybody is standing up there saying, \"When's he going to get off?\" You know, when's he getting -- get nothing done. He hasn't passed anything. I mean he talks. He is all talk, no action. He talks and talks and then he -- you know the greatest, he gets up and he said you saw that during the debate.","But he says it all the time, \"I'm the only one that can beat Donald Trump.\" Again, holding the Bible. I'm the only one that can beat him. I have beaten him five times. I have beaten him five times. And this is it. And I'm the only one. And then what happens when during the debate I said, \"Yeah. But I beat you 20 times.\" He doesn't mention that, you know, he doesn't mention.","Something like five or six to 20 and you know it's amazing. Plus we won the islands. We won the islands which we love. We love those islands. They were great. We had nine delegates. So I think we're in great shape. Now, a couple of things, Trans-Pacific Partnership he's in favor of that. That's going to take your business away, folks.","Now I was totally opposed to NAFTA. NAFTA is a disaster, you know what. NAFTA's done. NAFTA has been very bad. The TPP is going to be even worse. It's going to take your businesses it's going to drain it out. You're going to give it to some wonderful people in Asia. We're tired of giving our business away.","I'm going to stop it. Nobody else even understands it. They don't understand devaluation. They don't understand anything about business. They all they know is one thing. How do you get elected and how to get re-elected. Although some of them aren't that good at that either. A couple of things, OK, so TPP is a disaster.","A major reason why Obama got the trade powers is because of Ted Cruz, he's the one that pushed it. He also pushed something that I think is terrible. Justice Roberts in the Supreme Court who twice ruled in favor of Obamacare. You might as well call it Robertscare or Cruzcare because if Justice Roberts and Cruz was primarily responsible he pushed him and Justice Roberts and you can take a look back at your journals you'll see all sorts of stories where -- where Ted Cruz is pushing Roberts.","Roberts had two chances to kill Obamacare. Shockingly, both times he voted in favor of it. It was dead, it was gone. Nobody could believe what happened and they won. So that's no good. By the way, Scalia great guy. We have to replace him. We have to replace him with somebody who's close to him as we can get.","And you know when I see, when I see the disharmony when I see the -- the lack of harmony that we have in our party with you know, Mitt going, 'cause Mitt let us down. He just let us down. He let us down. He choked like a dog, he choked like a dog. But -- but you know when I see he's just like it's -- it's just crazy.","He's out -- he's out campaigning with Kasich and then he endorses Cruz. Nobody -- you know, people are saying are you sure you know what you're doing. It turned out to be a good thing my numbers went way up. I don't know what's going on. My numbers went way up. But there has to be some unity in the party, folks, because you know what.","If we don't win you're going to have probably Hillary if she doesn't get, put in the slammer. No, but that's what's going to happen. That's what's going to happen. And we will beat her. I'll beat her so coming in I was watching the networks and they were saying the one that has the best chance to beat Hillary is Trump, and that's true.","And I don't even call it a chance. You saw it happen two months ago with her. So look, very important, very important. We're going to destroy the manufacturing in this country. I'm the one that knows how to bring it back. I'm bringing jobs back from China. I'm bringing jobs back from Mexico which is a big deal for you, which is a big deal for you.","A very, very big deal. Now the other thing with Ted Cruz, he backed amnesty and he's actually weak on illegal immigration. I saw him today standing at the border. Remember one thing, folks, the great Joe Arpaio. Do we know Joe? Sheriff Joe. Trump. Trump. One thing we know, if Sheriff Joe is backing us, we've got -- we're good on the border.","Do we agree? They wouldn't even be talking about the border if I didn't come down that escalator on June 16 and bring it up. If I didn't bring up illegal immigration. I don't even think you'd be talking about it. And it's a huge problem in terms of economics. More importantly in terms of crime and in terms of what they're getting away with.","And in terms of drugs flowing into all of your communities and poisoning the blood of our youth and everybody else. And we're going to stop it. OK. We're going to stop it. Now, we have trade deficits with China, $500 billion a year. We have trade deficits with Mexico of $58 billion a year. Japan, massive numbers.","It's going to end folks. It's going to end you can't do that. We can't do it. It's sucking. That's why we have 19 trillion in debt. We're going up with a really bad budget. That budget was a disgrace. The so-called omnibus budget and they're all moving out. We're not gonna have anything left. We're going to have senior citizens homes where they take a factory.","We're not going to have any money because the jobs are all going. They convert the factories like in New England. I love New England that I was up in New England a lot during the during the primaries and I saw so many factories empty some converted the senior citizen housing. Problem is we're not converting to jobs we have to convert to jobs.","Utah, the same thing. We want jobs, we want manufacturing, we wanted to be like it was we'd let all of that stuff get sucked out of our system get sucked out and we don't have the jobs and the jobs we do have aren't the good jobs, they're the bad jobs and we're changing it. We're going to have Apple and you watch because what they do is currency manipulation in China and Vietnam and lots of other places we're going to have Apple and many other countries building their product in the United States not over there.","Believe me. Believe me. So -- True. So here's what's going to happen, when you look at what's going on, I believe in free trade you know a lot of people say, \"He's not conservative\", and they're usually referred to free trade. I am conservative. I'm very conservative but I'm not conservative when it comes to stupidity.","We have -- we have the -- probably the dumbest trade deals in the history of the world ever negotiate, we have rebuilt China with trade. They have sucked money out of our country and jobs and the base, manufacturing gone. Thousands and thousands of factories, millions of people lost their jobs. You know, smaller instances, Carrier moving to Mexico, recently you saw that.","They just announced, \"We're moving to Mexico.\" Now the only way you can do it, and I have to tell you, a good student, the Wharton School, all that stuff, you know has to be good student. You don't have to go to college and it's really easy to understand this. We can't allow our businesses to be stripped out of our country, right.","We can't allow it to happen. We're going to bring them back. By the way, we're bringing them back but we can't allow it to happen. But what's happened is we've had bad leadership and we've had very bad negotiators and we've had a lot of political guys where they get money and they say let it go, let it go, let it go. A lot of people say, \"Why the deals like that happen.","How come that, when it comes to like as an example medical, drugs. Why isn't there a big bidding war with the largest buyer of drugs in the world?\" There's no real bidding. We lose fortunes with that. There's no real bidding. They say why. Is it because all the guys who are getting taken care of with campaign contributions .With me, folks, it goes to bidding.","We will say same thing with the military. You've got to see the military procurement, the military bidding, the companies they get the jobs. Aren't the stuff with the best equipment, they're the ones with the best political context. It's going to end because we're going to build. We're going to make our military bigger, better, and stronger than ever before.","Ever, ever, ever before. And when nobody is going to mess around with this anymore, folks. Right now they're laughing, it's been so depleted. And we are depleted military, we have problems. We have generals leaving and they give press conferences and announce how bad our military is. Number one, I don't want generals giving press conferences.","And number two, we're going to make it strong because people are not viewing us the way they used to believe me that I can tell you. The other thing importantly we're going to take care of our vets. Our vets are being mistreated. There was a story, well, there was a story coming in which is almost hard to believe.","But there was a story come -- but not really, because when you see the stupid things that are going on where Hillary Clinton wants illegal immigrants to get Obamacare. Do you believe this? I mean, we're not taking care of our vets. Our -- our vets are waiting in line for six days to see a doctor and dying while they're waiting and we're giving illegal immigrants, people that aren't supposed to be here Obamacare.","Can't do it, folks, can't do it. We can't do it. We can't. So what's hap -- I love you too. Who is that guy back there? Nice guy. Now we appreciate it. Look -- look. It's -- Folks, it's common sense, it's intelligence, and common sense, and heart. We've got to take care of our people. We've got to take care of our people.","Let me just take a few things. We're going to get rid of Common Core, we're bringing education local. OK. Number one, it'll be much better education. And number two, I mean, is there any doubt that local is going to be much better? And it'll also be less expensive if you can believe it. But we're bringing it to a local level so that the people in the community can take care of their education.","We are ranked 30 out of 30 right now. The worst. And yet we're No. 1 in costs. We're going to bring our education locally. We're not going to rely on Washington D.C. bureaucrats to tell us how to educate kids in Salt Lake City. So we're bringing our education local. And it'll be great, a huge improvement.","Number two, we're repealing and replacing Obamacare, it's a total disaster. It's a total disaster. And number three, you know, if you look at it, our Second Amendment is under siege. We are going to be so strong with our Second Amendment. We're not letting -- we're not letting our Second Amendment go. So we're going to be very, very strong.","That's another one, they're chipping, chipping, chipping. They're always chipping away. Now they're looking at bullets maybe we can't do the guns, we'll do the bullets, not going to happen, folks. You know, if in Paris, they had bullets flying in the other direction, toughest gun laws in the world. If in Paris bullets were flying in the other direction, you wouldn't have had 130 people killed.","You wouldn't have had many, many people right now dying in hospitals from that attack. You wouldn't had in -- you know, it's not even Los Angeles. It's a very nice area, very nice community in California, 14 people killed, many people injured by these two people, radicalized people. They went in, they shot and killed people that gave them a baby shower just a little time before.","And you know what, there were no other guns, nobody had guns except for the bad ones. They had guns the bullet flew -- they flew in one direction. You have somebody, if this man right there with that beautiful white hair, if almost anybody, that one right there, if there were a couple of guns strapped onto a hip, was strapped around an ankle and those bullets were going in the opposite direction, believe me, it would not have been the carnage that you witnessed with either of these two places.","So -- so we have to we have to -- we have to take care of our people. We have to protect our Second Amendment. Now, when it comes to -- when it comes to trade, we're going to start being smart because our country is poor. We are now, if you go to places like Dubai and many, many places, China, You look at the roads you look at the railroad systems where they have trains.","They have the bullet trains to go hundreds of miles an hour. And you go back to New York, in our place, they go bah, bah, they're like from a hundred years ago. We have become a Third World country, folks. And we're going to change it. We're going to knock the hell out of ISIS because we have to. We have to, we have to. We have to, we have no choice.","You know I didn't want to go over to Iraq. It was a mistake going over there. It was a big mistake. But now we're there. And we've got to get out. And we tried to get out and Obama got out the wrong way. He announced today he's leaving. How about that? We're leaving at a certain date. How about that? Number one, who would do that.","Can you imagine George Patton, General George Patton and MacArthur, in their graves, right now they're spinning. They've never -- they would have knocked this threat out in one week or less. So we don't -- we don't do that. So here's the story -- here's the story, we're going to knock it out and we're going to come home and we're going to rebuild our country the way it's supposed to be. We're going to put people to work and we're going to take our jobs back and we're going to do so much and we're going to make America so great again.","You know, there's a sort of an expression that we had the American dream. We talk about the American dream. Remember the American Dream, everybody? Well, let me just tell you something, with all the rules regulations all the things that you people right here are complaining about and putting up with. We're going to get rid of -- We're going to bring it down to a modest level.","I mean, it's almost like let's go back 15 years. But we're going to take the American dream and we're going to make it great again. It's not great right now. We're going to make the American dream great. You know, you can't have a real American dream without education. So that's what we were talking about.","We're going to bring education back to a high level. Right now, it's Norway, Sweden, Denmark, China. All these places, they're the top, they don't spend anywhere near what we spend per pupil, but they're the top. So we're going to come back and we're going to bring the American dream back. We need education to do that.","Very, very hard to come up with the American dream without education. So we're going to get it done. And here's the -- here's the thing, look, when I hear a company like Carrier is moving to Mexico and losing its entire group of people, there's only one thing we can do, folks, we can say, lots of luck. I hope you enjoy your stay.","But every time you make a new air conditioner in Mexico or wherever you happen to be going when that air conditioning unit comes across the border, which now will be very strong, because you know why it's going to be strong. We're going to build a wall. OK. We're going to build a wall. And it'll be a real wall.","And by the way, it will be paid for by Mexico and they understand that. We're not paying for it. You know they could stop most of this right now if they wanted to. They don't want to. Try going into Mexico, try going there. You wouldn't be there for 10 minutes before they throw you the hell out. And you know, where they put you right here, they'll put you right here.","So you probably saw recently on one of the networks. They had the former president, Vincente Fox on, and you saw it. And by the way, he used the F bomb. If I ever used the F bomb, it would be the electric chair, right? It would be -- He used the F bomb. And he said, \"There's no way we are going to pay for the you know what, Wall.\" OK. And then I say, \"Wow, we've made progress.\" because a year ago he was saying there's no way we're going to have the wall.","So now he's accepting the wall's going to be built. But these guys that I'm against -- these guys that I'm against -- so thank you, these guys that I'm against you know, the final three we call them, right, the guys -- the guys that I'm now against, they ask me, \"You can't get...\" and they actually tell me, \"You can't get Mexico to pay for those.\" of course, I can.","How can you do that. All you have to do is look at the trade deficit. We have a 58-billion-dollar trade deficit. The wall is going to cause $10 billion. Is there anybody in this room that thinks we're not going to get it. If I'm president, I guarantee you they will pay and they'll be very, very happy about it, OK. They'll be very, very happy about it. So it's not a question of free trading, honestly.","It's not a question of free trading. Free trading is wonderful. The problem with free trading, we need smart people on our side also because so much blood has been drained. It's just been drained. Even this area it's been drained out of our country. So here's the story, we're going to negotiate great deals.","We're going to bring wealth back into our country. We're going to save Social Security and Medicare. We got to save them but we're going to bring wealth back into our country again because our country is a poor country. We have deficits like you wouldn't believe. For years and years and year you can't go on. We're sitting on a bubble like you've never seen.","And I hope it doesn't explode when I'm president. If it's going to explode, let it be a couple of days early. You know, being there for two weeks the bubble explodes they'll say, \"Oh, it's Trump's fault.\" No, I don't want that. We are sitting on a bubble and it's a very dangerous bubble right now. You take a look with what they're doing with interest rates.","We have free money, everything else. It's a very -- And what does free money mean? Free money means people that saved all their lives and thought they were going to live off the interest they're getting, they're not getting any interest, folks, they're not getting any interest. So we're sitting on a big, fat, ugly bubble.","At some point, unless we act quickly and smartly, it's going to explode. You need the right people in there you have the wrong people in there right now. And here's what we're going to do and you listen because this is important. On Tuesday you're going to vote. And on Tuesday, you're going to vote. Unless you want to vote for somebody else, don't vote.","You know, do you ever see this -- No, no you ever see these politicians where they say, \"On Tuesday you're going to vote and it makes no difference if you vote for me or anybody else...\" but to me it does. If you're gonna vote for somebody else don't vote. OK. Don't vote. On Tuesday -- on Tuesday you're going to vote and you're going to remember in two years from now and in four years and in 10 years and in 20 years you're going to remember this evening this beautiful evening.","Beautiful outside, everyone's just with this a lot of love. There's even some love from the protesters. Do we have love for the protesters? You know what, honestly, they're doing their thing. OK. They're doing that thing. Whatever. I don't quite get the thing. But whatever it is they're doing [Inaudible.","But let let me just tell you, I do have love for the protesters. And I have love for the people standing outside, the thousands of people that wanted to get in here. I love you people out there. I love you. But -- but you are going to remember this night and you're going to remember Tuesday, more importantly.","And you're going to say -- thank you. You're going to say to yourself in a couple of years and in a long time from now, you're going to say that was one of the most important votes they ever made, it was one of the great evenings of our lives. Because we are going to straighten out the country rapidly. We're going to take the country back.","We're going to straighten out the country. We have a noisy majority. You know, it used to be called the silent majority. It's not silent. It's noisy as hell. Because people are angry and we're not angry people. I'm not an angry person but we're angry about the incompetence with which our country is run. Is that a correct statement?","They're just angry. Because we love our country. And you're going to see things happen quickly. You're going to see on trade we're going to start winning again. We don't win anymore. You know as a country we don't win anymore. We don't win. And you're going to see a tremendous change. You're going to see victory after victory, win after win.","You're going to see wins on trade. You're going to see wins with our -- look, we have to help our soldiers. We have to help -- we have to help our wounded warriors. We have to help our veterans. And you're going to see -- you're going to see big, fat, beautiful wins for our veterans. We have to take care of our greatest people.","So we're going to see wins. We're going to have wins on -- on health care. We're going to have great wins on health care. Right now, Obamacare 45, 55% increases. The deductible is so high that you don't even get to use it unless you're close to death. It's no good. It doesn't work. It's so expensive and it doesn't work and it's going to fall of its own volition but it's going to be terminated before that.","OK. But you're going to win on health care you're going to win at the border. You're going to win with Common Core getting rid of it, end it over. You're going to win with the Second Amendment. We're going to win every single -- I, you know, I choke when I say it but sometimes it's fun to say it, you're going to win and win and win.","You're going to win so much you're going to say, \"Mr. President. You're driving us crazy with victories all the time. We don't want to win anymore, please.\" And I'm going to say, \"No way. You're going to win. We're going to make America great again.\" Thank you, folks, I love you. Thank you. Get out and vote, Utah. I love you."],"text":" Thank you, everybody. Wow. Thank you. What a group. We love Salt Lake City. We love Utah. You know they didn't have me scheduled in Utah I was going right into Phoenix and I said, \"Wait a minute, I want to go to Utah. What's going on with Utah?\" Based on what I see here we might win Utah. You know, we have thousands of people. Really great people, thousands of people outside. Unbelievable. We have speakers set up out there. But you have a better location, I must say. So we had an amazing Tuesday. We won five including the islands. We won five and it was incredible. We pick up a lot of delegates. We're moving, we're moving. And I think, you know, they talk about the convention. I think, we get to the convention, it's over. I don't think there is going to be much of a dispute. I don't think we're going to have a lot of dispute. The numbers were fantastic. Illinois, unbelievable and then, you know, we had as you know, I had a tough race in Florida. I was facing the future of the Republican Party, Marco Rubio, the future. Well, that's what they said. They said he's the future the Republican Party. I assume he's not going to be endorsing me. I don't -- haven't found that out but I assume. But we face the future of the Republican Party, folks. Someday, you'll get another chance to vote for him maybe. You know you never know. You never know. And boy did we win big. We got 99 delegates, just about the max, and we got 99. We did incredible between Illinois, Missouri, we're still waiting for -- I mean, we won Missouri but we're still waiting for that final count. And you know I keep hearing that Cruz is somebody that's a big shot in Missouri but I don't think Missouri works that way. That's a great place, folks, I'll tell you. So we did -- we did fantastically there. We did -- we've done great essentially everywhere started, I mean, very good in Iowa, except a lot of, you know, lying Ted Cruz, what he did. Lying Ted. Lying Ted. One of the -- the biggest liars I've ever seen in my life. I really mean it. You know when he walks in, you know the evangelicals are with me because they know one thing about me, I'm not a liar. But -- but Ted Cruz he walks in Bible high, Bible high, puts it down and he starts lying. I'll tell you what, now, he's got a lot of problems. We'll talk about him for a second but he's got a lot of problems. Number one, in all fairness, look, is he really a natural born citizen? I mean, give me a break. Give me a break. And here's what's going to happen I don't think you'll ever get the chance, I don't think they care and that's wasn't wasting their money yet. Do you notice that Hillary's only focused on me, only? They talk about Trump, Trump, Trump and the last person she wants to be running against is Trump and us. Believe me. So he was born in Canada, lived there for four years. He was a citizen of Canada 15 or 16 months ago. He was a citizen of Canada. Can you believe it? He became a United States senator and then he said, \"I didn't know I was a citizen of Canada.\" Lying Ted. Lying Ted. He didn't know. He was adjoint. He was U.S. and he was Canada. And you know, that's not the way it's supposed to work. You're supposed to be born like here, here, here. So the first thing that's going to happen if he should luck out because it would -- He'd need a lot of luck. He's really, really far behind. And you know he was supposed to win South Carolina, big evangelical base, 68% and that was going to be his. We won in a landslide, right? And that was right after I was attacked by the Pope. But the pope came back the next day. The pope was talking about illegal immigration and when he found out about what it really represented. He was terrific. The pope was OK. Fortunately, just before the votes started going, 'cause you wanted to -- we never want to take on the Pope, right? You know, we don't want to take him on. So anyway, so the evangelicals have been so amazing. Everybody's so amazing and do I love the Mormons OK. I love the Mormons. I have many friends that live in Salt Lake. I have a lot of friends. No, I have a lot of friends. By the way, Mitt Romney is not one of them. Did he choke? Did this guy choke? He's a choke artist. I can't believe. Are you sure he's a Mormon? Are we sure? He choked. He choked. It was so sad. He should have beaten Obama. We wouldn't be working. I could be back right now. I could be back working in New York and doing my deals and having fun and being with my family. Ivanka is having a baby today or tomorrow or the next day. I could be with Ivanka and set him with you which is OK. It's OK. But now, Ivanka -- Ivanka is having a baby. I thought maybe three weeks ago, two weeks ago. I mean it's got to happen soon. We thought it could have happened. I've always gotten every time I go to a primary place, I say, \"Maybe Ivanka -- Come on.\" Let's see what happens, right? I took her to Florida. I hope. Didn't work. But I should have right brought here.That would have been very cool. But any day now, it should be over the next couple of days. But she's really special, she sends her regards and she really is very special. Don is with me, Don Trump, and he's with me, someplace. Where is he? Come on. Come on, Don. She hears all these reports. He wants to protect his father. You know, it's like one of those things I have a good son and Eric is -- is is fantastic. They always like to travel. And by the way, outside looks absolutely fine. We have, they said, 2,500 of you and they have some of the agitators slash protesters, some of protesters, about 2% and then some are agitators that would be the rest, OK. And you know, we have to be allowed our freedom of speech, folks. We have to be allowed freedom speech. We're not causing any problems and you know if you look at some of the other places we've been it's been very, very safe and you'll have a protester or agitator but stand up and start screaming. Then the crowd screams him down and, in fact, I wouldn't mind going over that original noise but then the crowd goes so wild and all they're doing is screaming U.S.A., U.S.A., U.S.A. and then you can't speak because it's so noisy it's incredible. and had I known, you know we were trying to get a really big place I feel very guilty, in fact, we'll come back. I promise. We're going to come back. Don't forget we only set this up like yesterday afternoon and it is true. I mean, it's true. I said, \"I want to stop in Utah.\" I know I'm going to do great there and, but I have friends that are here and I have a couple of friends I have actually one, who is Jewish, and he loves. He says that the hardest working people, he loves the Mormons he loves the Mormons. And he's got a very successful business and he's just very, very proud and I have so many friends I've had many. I've had many Mormons work, you know, for me and they give to the church and they constantly give. Sometimes I make the payment directly to the church. They say they don't want to be tempted by keeping the money, OK. But they're -- they're amazing people and it's an honor to be with you tonight, for those of you that are Mormons. It's an honor. I love you. So we have a lot of things we can talk about. I do want to talk a little bit about the competition because this started off with 17 people. We're now down to three. Or as they say usually on television two and a quarter. I actually think it's one and a half if you want to know the truth, but we don't have many left. And you know, they ask me on television they say, \"Well, maybe you'll start acting more presidential.\" I say, \"What's wrong with the way I'm doing it right now?\" In all fairness, you know. That's you know their form of anarch -- I could be the most presidential person you've ever seen. The one thing I have to say is you have to knock them out. You know, a lot of people with 17, they were coming at me from different angles. If you're too presidential you can lose. We don't want to lose, right? We're not people that don't know how to close. We know how to close the deal. And they said to me, Bill O'Reilly, good guy, said to me the other night, he said, \"Well, are you going to stop with to this or are you gonna act a little more?\" I said, \"Bill, I have two more leftovers. I have to take care of that first. OK.\" I have to take care. And then after that, I promise I'll act presidential. Well, maybe I'll wait 'till Hillary gets out. Maybe I'll wait 'till we knockout her. Number one she shouldn't be allowed to run. OK. How that deal is working out. How that deal -- And I have to tell you something just came out over the wires the Reuters tracking poll. So you know we have four or five six people and they're always comparing me like with Hillary. The Wall Street Journal which has no idea anything about math. They had to think. Well, Hillary had X millions of votes and you had a little bit less. I had 17 people in my dear. She had Bernie, just Bernie, who looks like he's finished now. You know I'd love to run against Bernie but honestly, I'd rather run against Hillary. I must be honest. So you know with all of those people that's a tremendous amount of people. So one by one by one they leave. This guy Lindsey Graham, I mean, you ever see a guy like this? He's a seven. He started at seven. I started hitting him. Now, he really hit me. I mean in all cases when you say, \"It was a nice crowd nice looking people.\" Those lights are bright. They're bright. But in all fairness they hit me. And you have to hit back. Look at Marco. He hit me. He went for everything he could do. He even talked about these powerful hands. Look at that. He talked about the hands. And he makes stuff up as he goes along. You know they're politicians all-talk-no-action politicians. They will never take you where you want to be, folks. They're all taken care of with campaign. Look, campaign contributions are 100%, whether it's the pharmaceutical drug industry, whether it's anything you want to name. They're all taken care of a hundred percent and you go up to him and you say, \"Well who is it? Who is gonna be the lobbyist to take care of Ted Cruz? I could give you the name of lobbyists. OK. It's almost like emblazoned on their far head the lobbyist forehead: Cruz, Cruz. And you go in and they raise money for him and I'm self funding my campaign. I'm not taking money. I'm for you. I'm for you. I'm for you. So a lot of things -- thank you very much, a lot of things -- this is a very friendly group here. I expect a couple of protesters. I -- I mean I'm sure some a couple of pro -- Did any protesters sneak in tonight? Anybody? Huh? So that's so nice. You know I was seeing and coming in, I was seeing that there were some protesters outside. They don't show the 2,000 people that are trying to get in that are with us. They show other people and how they get here is pretty sad. But you going to have to check on it because they always talk about with stifling them, they're stifling us, folks. They're stifling us. We want nobody to get hurt we want everything to be perfect and just seems to be like a perfect evening but they can't stifle us. They can't let it happen. We can't allow it to happen. It's too important. And you know with all of the big rallies, I have 21,000, I have 35,000 in Alabama recently. No matter where we go we have tremendous rallies and with all of these rallies people aren't getting hurt, folks. We did cancel Chicago and I did it. I think a very wise thing and I've been given credit I hated to do it. We had 25,000 people coming into Chicago. And we're able to get a lot of them not to bother coming in because it looked like it could have been a problem. We ended it and nobody was hurt and we did a smart thing but it's really unfair. You know you talk about freedom of speech. You talk about the first amendment. Very, very unfair when they can stifle us very unfair. Remember that just remember that. And we can't let it and we can't let it happen. All right, I want to talk about a few things. I want to talk about, first of all, I have to talk about this. Reuters just came out with their new poll, the big tracking poll. I'm almost 50. It's 40 se -- 49. This at 49.7 I said, \"You couldn't get -- You couldn't get me to 50, right?\" And that's with four people. So 40, you know when you are 49.7 you have four people that means you're 65, 70%, that's a national poll. Emmerson just came out in New York poll. I hope I do so well in Utah. Just came out a little while ago, Emmerson, 64% for Trump, 12% for Cruz and Kasich had 1%, 64%. Emmerson, very, very respected poll. CNN came out a week ago and CNN had us said 49 or some -- some really high number, 49. And I'll tell you what, we are doing well, folks, we are doing well. and people are asking me all the time I'm on so many magazine covers, you know, it's like -- And if I don't like the magazine, we just use it for wallpaper, we put it up as well. I've been hit by some of them. You know they say, \"Oh, we want to do a great story.\" say, \"They'll never do a great story.\" I do it and I'm right.\" You know I can almost tell by the magazine, fair or not fair. I tell you who has treated me fairly, Time Magazine. I've been on the cover many times over the last four or five months. I mean, like many times and in particular one of them was incredible because they were talking about this as a movement. It's never been done before. There's never been anything like this before. Thousands and thousands of people, you know, the nice thing, yes, I'm spending my own money, yes, it's a lot of money probably in for about $30 million already, a lot of money but other people are in for three, four, five, times said. In New Hampshire, which I owe a lot to, because the people of New Hampshire are incredible, and they have a big problem. Drugs. They have a drug problem. It's like an incredible problem. I said, \"I'm going to stop up that border. You're not going to have drugs coming into New Hampshire anymore\" I owe it to them. And that means Utah, that means Salt Lake City, I mean, that means a lot of different places. But you know, New Hampshire with a beautiful fields and the trees and everything so beautiful. And I'd go to a meeting with people that lived there and it was always like the biggest problem they have. Heroin. And you just don't see it for New Hampshire. So we said to them, and I mean it. Then I went to South Carolina. We won New Hampshire in a landslide. We then went to South Carolina, where I was expected to come in second and we won in a landslide because the evangelicals don't like lying and they don't like liars. They're smart and they don't want that. And then we went all over. We went to Nevada we had a landslide there. Pretty much a landslide everywhere we've been. The biggest landslide was Florida 20 points almost 20 points. That was a great -- that was a great victory. That was the victory everybody said the polls must be wrong because they were showing like 18 points, 16 points. One of the polls had eight or nine points but they didn't like me. You know, those polls are a little bit suspect before. The ultimate poll is the vote right. But the polls were showing 16, 17 points .We won by close to 20 points. And it was an amazing event. And people -- look, the biggest story in all of politics worldwide is what's happening to the Republican Party. Can you believe this. It's true. Because the voting turnout is massive. It's -- and you know where they are, right? The people coming in, where are they from. They're Democrats, they're independents. And you know, almost, what's to me is the most impressive and I see it when I'm signing or when I'm shaking hands with people. Most impressive, to me, is the fact that many of the people, so many, I would say of the new people coming in, which is millions and millions of people, 15, 20%, new voters, people that have never voted before, 50 years old, 60 years old, 30 years old. These are people, they say, \"Mr. Trump, I'm 38 years old. I love you. I've never voted before. I've never had the incentive to vote before.\" And we have -- we have, I think., I guess ultimately millions of people come in. They've never -- you know what a great thing that is for our democracy when you think about it? These are people these are smart people these are great people. These are hardworking people but they've been left out they've been disenfranchised they haven't liked the people that -- you know they're smart they see people that they're supposed to vote for and they say I'm not going to vote and we can understand that. But people that, I had one person in Tennessee, she's the all time record, 93 years old, everybody knows who I'm talking about,a big story, 93 years old, never voted before. Now I could say, come on, you have to, you know, you do a little voting, right. She never voted before she voted for the first time recently in Tennessee. Ninety three years old. That is so amazing and she's like a fan. She's 93 she's wearing a Trump shirt, she's wearing a Trump shirt. So -- so I think it's an amazing tribute to all of us. It's an amazing tribute when they talk about the movement and when they talk about the fact that they've never seen anything like it and nothing stops us. The other thing they say and it comes out very strongly opposes that the Trump people are by far the most loyal. They actually say, no, they actually say that Trump can do almost anything and they're never leaving, where some guys, if they sneeze, if the candidate sneezes, they're gone. The people are gone. Trump can do almost anything. So I guess there are certain things maybe not but almost anything. Thank you man. Thank you. We love you all. We love you. Thank you. Thank you. Oh, that's beautiful. Look. What's it all about. You know the theme: Make America Great Again. That's the theme. And I will say this, our country is doing terribly. The real number of unemployment is -- is many times what they report. That number was meant for politicians. It was meant probably for presidents so that they can say they're 5%. You know what, if real employment and if real unemployment was at 5% I wouldn't have the crowds that I'm having. No matter what. Now with all of that being said, I'm going to talk a little bit about trade. We're going to talk certainly about security. We're going to have a little fun. Then I'll go home and I will go, you know. And then on Tuesday you're going to go and you're going to vote for who? Can't do it. And if you want I'll come back. I don't care. I'll keep coming back. But I want to do well in Utah. No, no I want to do well because you can't have Cruz. I want to go over a couple of more things. OK. Ready I wrote these notes down. Listen. Number one -- number one, Cruz has done nothing he hasn't done anything. He'll stand on the Senate floor. Gets along with nobody, practically nobody, in terms of senators you just got one from Mike Lee, a nice guy, but you know the one he talked about was Senator Jeff Sessions, right. He'd say Senator Jeff Sessions. Senator Jeff Sessions endorsed me. OK. And Jeff Sessions is one of the most respected Alabama, one of the most respected senators in -- in, there is. I mean there's nobody better. I mean he's great. But he endorsed me and then now Cruz doesn't talk about him anymore. But that's OK. Used to talk -- But number one he did nothing. Remember he went down and he -- he filibustered for a day or something and he's ranting and raving and everybody is standing up there saying, \"When's he going to get off?\" You know, when's he getting -- get nothing done. He hasn't passed anything. I mean he talks. He is all talk, no action. He talks and talks and then he -- you know the greatest, he gets up and he said you saw that during the debate. But he says it all the time, \"I'm the only one that can beat Donald Trump.\" Again, holding the Bible. I'm the only one that can beat him. I have beaten him five times. I have beaten him five times. And this is it. And I'm the only one. And then what happens when during the debate I said, \"Yeah. But I beat you 20 times.\" He doesn't mention that, you know, he doesn't mention. Something like five or six to 20 and you know it's amazing. Plus we won the islands. We won the islands which we love. We love those islands. They were great. We had nine delegates. So I think we're in great shape. Now, a couple of things, Trans-Pacific Partnership he's in favor of that. That's going to take your business away, folks. Now I was totally opposed to NAFTA. NAFTA is a disaster, you know what. NAFTA's done. NAFTA has been very bad. The TPP is going to be even worse. It's going to take your businesses it's going to drain it out. You're going to give it to some wonderful people in Asia. We're tired of giving our business away. I'm going to stop it. Nobody else even understands it. They don't understand devaluation. They don't understand anything about business. They all they know is one thing. How do you get elected and how to get re-elected. Although some of them aren't that good at that either. A couple of things, OK, so TPP is a disaster. A major reason why Obama got the trade powers is because of Ted Cruz, he's the one that pushed it. He also pushed something that I think is terrible. Justice Roberts in the Supreme Court who twice ruled in favor of Obamacare. You might as well call it Robertscare or Cruzcare because if Justice Roberts and Cruz was primarily responsible he pushed him and Justice Roberts and you can take a look back at your journals you'll see all sorts of stories where -- where Ted Cruz is pushing Roberts. Roberts had two chances to kill Obamacare. Shockingly, both times he voted in favor of it. It was dead, it was gone. Nobody could believe what happened and they won. So that's no good. By the way, Scalia great guy. We have to replace him. We have to replace him with somebody who's close to him as we can get. And you know when I see, when I see the disharmony when I see the -- the lack of harmony that we have in our party with you know, Mitt going, 'cause Mitt let us down. He just let us down. He let us down. He choked like a dog, he choked like a dog. But -- but you know when I see he's just like it's -- it's just crazy. He's out -- he's out campaigning with Kasich and then he endorses Cruz. Nobody -- you know, people are saying are you sure you know what you're doing. It turned out to be a good thing my numbers went way up. I don't know what's going on. My numbers went way up. But there has to be some unity in the party, folks, because you know what. If we don't win you're going to have probably Hillary if she doesn't get, put in the slammer. No, but that's what's going to happen. That's what's going to happen. And we will beat her. I'll beat her so coming in I was watching the networks and they were saying the one that has the best chance to beat Hillary is Trump, and that's true. And I don't even call it a chance. You saw it happen two months ago with her. So look, very important, very important. We're going to destroy the manufacturing in this country. I'm the one that knows how to bring it back. I'm bringing jobs back from China. I'm bringing jobs back from Mexico which is a big deal for you, which is a big deal for you. A very, very big deal. Now the other thing with Ted Cruz, he backed amnesty and he's actually weak on illegal immigration. I saw him today standing at the border. Remember one thing, folks, the great Joe Arpaio. Do we know Joe? Sheriff Joe. Trump. Trump. One thing we know, if Sheriff Joe is backing us, we've got -- we're good on the border. Do we agree? They wouldn't even be talking about the border if I didn't come down that escalator on June 16 and bring it up. If I didn't bring up illegal immigration. I don't even think you'd be talking about it. And it's a huge problem in terms of economics. More importantly in terms of crime and in terms of what they're getting away with. And in terms of drugs flowing into all of your communities and poisoning the blood of our youth and everybody else. And we're going to stop it. OK. We're going to stop it. Now, we have trade deficits with China, $500 billion a year. We have trade deficits with Mexico of $58 billion a year. Japan, massive numbers. It's going to end folks. It's going to end you can't do that. We can't do it. It's sucking. That's why we have 19 trillion in debt. We're going up with a really bad budget. That budget was a disgrace. The so-called omnibus budget and they're all moving out. We're not gonna have anything left. We're going to have senior citizens homes where they take a factory. We're not going to have any money because the jobs are all going. They convert the factories like in New England. I love New England that I was up in New England a lot during the during the primaries and I saw so many factories empty some converted the senior citizen housing. Problem is we're not converting to jobs we have to convert to jobs. Utah, the same thing. We want jobs, we want manufacturing, we wanted to be like it was we'd let all of that stuff get sucked out of our system get sucked out and we don't have the jobs and the jobs we do have aren't the good jobs, they're the bad jobs and we're changing it. We're going to have Apple and you watch because what they do is currency manipulation in China and Vietnam and lots of other places we're going to have Apple and many other countries building their product in the United States not over there. Believe me. Believe me. So -- True. So here's what's going to happen, when you look at what's going on, I believe in free trade you know a lot of people say, \"He's not conservative\", and they're usually referred to free trade. I am conservative. I'm very conservative but I'm not conservative when it comes to stupidity. We have -- we have the -- probably the dumbest trade deals in the history of the world ever negotiate, we have rebuilt China with trade. They have sucked money out of our country and jobs and the base, manufacturing gone. Thousands and thousands of factories, millions of people lost their jobs. You know, smaller instances, Carrier moving to Mexico, recently you saw that. They just announced, \"We're moving to Mexico.\" Now the only way you can do it, and I have to tell you, a good student, the Wharton School, all that stuff, you know has to be good student. You don't have to go to college and it's really easy to understand this. We can't allow our businesses to be stripped out of our country, right. We can't allow it to happen. We're going to bring them back. By the way, we're bringing them back but we can't allow it to happen. But what's happened is we've had bad leadership and we've had very bad negotiators and we've had a lot of political guys where they get money and they say let it go, let it go, let it go. A lot of people say, \"Why the deals like that happen. How come that, when it comes to like as an example medical, drugs. Why isn't there a big bidding war with the largest buyer of drugs in the world?\" There's no real bidding. We lose fortunes with that. There's no real bidding. They say why. Is it because all the guys who are getting taken care of with campaign contributions .With me, folks, it goes to bidding. We will say same thing with the military. You've got to see the military procurement, the military bidding, the companies they get the jobs. Aren't the stuff with the best equipment, they're the ones with the best political context. It's going to end because we're going to build. We're going to make our military bigger, better, and stronger than ever before. Ever, ever, ever before. And when nobody is going to mess around with this anymore, folks. Right now they're laughing, it's been so depleted. And we are depleted military, we have problems. We have generals leaving and they give press conferences and announce how bad our military is. Number one, I don't want generals giving press conferences. And number two, we're going to make it strong because people are not viewing us the way they used to believe me that I can tell you. The other thing importantly we're going to take care of our vets. Our vets are being mistreated. There was a story, well, there was a story coming in which is almost hard to believe. But there was a story come -- but not really, because when you see the stupid things that are going on where Hillary Clinton wants illegal immigrants to get Obamacare. Do you believe this? I mean, we're not taking care of our vets. Our -- our vets are waiting in line for six days to see a doctor and dying while they're waiting and we're giving illegal immigrants, people that aren't supposed to be here Obamacare. Can't do it, folks, can't do it. We can't do it. We can't. So what's hap -- I love you too. Who is that guy back there? Nice guy. Now we appreciate it. Look -- look. It's -- Folks, it's common sense, it's intelligence, and common sense, and heart. We've got to take care of our people. We've got to take care of our people. Let me just take a few things. We're going to get rid of Common Core, we're bringing education local. OK. Number one, it'll be much better education. And number two, I mean, is there any doubt that local is going to be much better? And it'll also be less expensive if you can believe it. But we're bringing it to a local level so that the people in the community can take care of their education. We are ranked 30 out of 30 right now. The worst. And yet we're No. 1 in costs. We're going to bring our education locally. We're not going to rely on Washington D.C. bureaucrats to tell us how to educate kids in Salt Lake City. So we're bringing our education local. And it'll be great, a huge improvement. Number two, we're repealing and replacing Obamacare, it's a total disaster. It's a total disaster. And number three, you know, if you look at it, our Second Amendment is under siege. We are going to be so strong with our Second Amendment. We're not letting -- we're not letting our Second Amendment go. So we're going to be very, very strong. That's another one, they're chipping, chipping, chipping. They're always chipping away. Now they're looking at bullets maybe we can't do the guns, we'll do the bullets, not going to happen, folks. You know, if in Paris, they had bullets flying in the other direction, toughest gun laws in the world. If in Paris bullets were flying in the other direction, you wouldn't have had 130 people killed. You wouldn't have had many, many people right now dying in hospitals from that attack. You wouldn't had in -- you know, it's not even Los Angeles. It's a very nice area, very nice community in California, 14 people killed, many people injured by these two people, radicalized people. They went in, they shot and killed people that gave them a baby shower just a little time before. And you know what, there were no other guns, nobody had guns except for the bad ones. They had guns the bullet flew -- they flew in one direction. You have somebody, if this man right there with that beautiful white hair, if almost anybody, that one right there, if there were a couple of guns strapped onto a hip, was strapped around an ankle and those bullets were going in the opposite direction, believe me, it would not have been the carnage that you witnessed with either of these two places. So -- so we have to we have to -- we have to take care of our people. We have to protect our Second Amendment. Now, when it comes to -- when it comes to trade, we're going to start being smart because our country is poor. We are now, if you go to places like Dubai and many, many places, China, You look at the roads you look at the railroad systems where they have trains. They have the bullet trains to go hundreds of miles an hour. And you go back to New York, in our place, they go bah, bah, they're like from a hundred years ago. We have become a Third World country, folks. And we're going to change it. We're going to knock the hell out of ISIS because we have to. We have to, we have to. We have to, we have no choice. You know I didn't want to go over to Iraq. It was a mistake going over there. It was a big mistake. But now we're there. And we've got to get out. And we tried to get out and Obama got out the wrong way. He announced today he's leaving. How about that? We're leaving at a certain date. How about that? Number one, who would do that. Can you imagine George Patton, General George Patton and MacArthur, in their graves, right now they're spinning. They've never -- they would have knocked this threat out in one week or less. So we don't -- we don't do that. So here's the story -- here's the story, we're going to knock it out and we're going to come home and we're going to rebuild our country the way it's supposed to be. We're going to put people to work and we're going to take our jobs back and we're going to do so much and we're going to make America so great again. You know, there's a sort of an expression that we had the American dream. We talk about the American dream. Remember the American Dream, everybody? Well, let me just tell you something, with all the rules regulations all the things that you people right here are complaining about and putting up with. We're going to get rid of -- We're going to bring it down to a modest level. I mean, it's almost like let's go back 15 years. But we're going to take the American dream and we're going to make it great again. It's not great right now. We're going to make the American dream great. You know, you can't have a real American dream without education. So that's what we were talking about. We're going to bring education back to a high level. Right now, it's Norway, Sweden, Denmark, China. All these places, they're the top, they don't spend anywhere near what we spend per pupil, but they're the top. So we're going to come back and we're going to bring the American dream back. We need education to do that. Very, very hard to come up with the American dream without education. So we're going to get it done. And here's the -- here's the thing, look, when I hear a company like Carrier is moving to Mexico and losing its entire group of people, there's only one thing we can do, folks, we can say, lots of luck. I hope you enjoy your stay. But every time you make a new air conditioner in Mexico or wherever you happen to be going when that air conditioning unit comes across the border, which now will be very strong, because you know why it's going to be strong. We're going to build a wall. OK. We're going to build a wall. And it'll be a real wall. And by the way, it will be paid for by Mexico and they understand that. We're not paying for it. You know they could stop most of this right now if they wanted to. They don't want to. Try going into Mexico, try going there. You wouldn't be there for 10 minutes before they throw you the hell out. And you know, where they put you right here, they'll put you right here. So you probably saw recently on one of the networks. They had the former president, Vincente Fox on, and you saw it. And by the way, he used the F bomb. If I ever used the F bomb, it would be the electric chair, right? It would be -- He used the F bomb. And he said, \"There's no way we are going to pay for the you know what, Wall.\" OK. And then I say, \"Wow, we've made progress.\" because a year ago he was saying there's no way we're going to have the wall. So now he's accepting the wall's going to be built. But these guys that I'm against -- these guys that I'm against -- so thank you, these guys that I'm against you know, the final three we call them, right, the guys -- the guys that I'm now against, they ask me, \"You can't get...\" and they actually tell me, \"You can't get Mexico to pay for those.\" of course, I can. How can you do that. All you have to do is look at the trade deficit. We have a 58-billion-dollar trade deficit. The wall is going to cause $10 billion. Is there anybody in this room that thinks we're not going to get it. If I'm president, I guarantee you they will pay and they'll be very, very happy about it, OK. They'll be very, very happy about it. So it's not a question of free trading, honestly. It's not a question of free trading. Free trading is wonderful. The problem with free trading, we need smart people on our side also because so much blood has been drained. It's just been drained. Even this area it's been drained out of our country. So here's the story, we're going to negotiate great deals. We're going to bring wealth back into our country. We're going to save Social Security and Medicare. We got to save them but we're going to bring wealth back into our country again because our country is a poor country. We have deficits like you wouldn't believe. For years and years and year you can't go on. We're sitting on a bubble like you've never seen. And I hope it doesn't explode when I'm president. If it's going to explode, let it be a couple of days early. You know, being there for two weeks the bubble explodes they'll say, \"Oh, it's Trump's fault.\" No, I don't want that. We are sitting on a bubble and it's a very dangerous bubble right now. You take a look with what they're doing with interest rates. We have free money, everything else. It's a very -- And what does free money mean? Free money means people that saved all their lives and thought they were going to live off the interest they're getting, they're not getting any interest, folks, they're not getting any interest. So we're sitting on a big, fat, ugly bubble. At some point, unless we act quickly and smartly, it's going to explode. You need the right people in there you have the wrong people in there right now. And here's what we're going to do and you listen because this is important. On Tuesday you're going to vote. And on Tuesday, you're going to vote. Unless you want to vote for somebody else, don't vote. You know, do you ever see this -- No, no you ever see these politicians where they say, \"On Tuesday you're going to vote and it makes no difference if you vote for me or anybody else...\" but to me it does. If you're gonna vote for somebody else don't vote. OK. Don't vote. On Tuesday -- on Tuesday you're going to vote and you're going to remember in two years from now and in four years and in 10 years and in 20 years you're going to remember this evening this beautiful evening. Beautiful outside, everyone's just with this a lot of love. There's even some love from the protesters. Do we have love for the protesters? You know what, honestly, they're doing their thing. OK. They're doing that thing. Whatever. I don't quite get the thing. But whatever it is they're doing [Inaudible. But let let me just tell you, I do have love for the protesters. And I have love for the people standing outside, the thousands of people that wanted to get in here. I love you people out there. I love you. But -- but you are going to remember this night and you're going to remember Tuesday, more importantly. And you're going to say -- thank you. You're going to say to yourself in a couple of years and in a long time from now, you're going to say that was one of the most important votes they ever made, it was one of the great evenings of our lives. Because we are going to straighten out the country rapidly. We're going to take the country back. We're going to straighten out the country. We have a noisy majority. You know, it used to be called the silent majority. It's not silent. It's noisy as hell. Because people are angry and we're not angry people. I'm not an angry person but we're angry about the incompetence with which our country is run. Is that a correct statement? They're just angry. Because we love our country. And you're going to see things happen quickly. You're going to see on trade we're going to start winning again. We don't win anymore. You know as a country we don't win anymore. We don't win. And you're going to see a tremendous change. You're going to see victory after victory, win after win. You're going to see wins on trade. You're going to see wins with our -- look, we have to help our soldiers. We have to help -- we have to help our wounded warriors. We have to help our veterans. And you're going to see -- you're going to see big, fat, beautiful wins for our veterans. We have to take care of our greatest people. So we're going to see wins. We're going to have wins on -- on health care. We're going to have great wins on health care. Right now, Obamacare 45, 55% increases. The deductible is so high that you don't even get to use it unless you're close to death. It's no good. It doesn't work. It's so expensive and it doesn't work and it's going to fall of its own volition but it's going to be terminated before that. OK. But you're going to win on health care you're going to win at the border. You're going to win with Common Core getting rid of it, end it over. You're going to win with the Second Amendment. We're going to win every single -- I, you know, I choke when I say it but sometimes it's fun to say it, you're going to win and win and win. You're going to win so much you're going to say, \"Mr. President. You're driving us crazy with victories all the time. We don't want to win anymore, please.\" And I'm going to say, \"No way. You're going to win. We're going to make America great again.\" Thank you, folks, I love you. Thank you. Get out and vote, Utah. I love you."}