{"id":424,"author":"Donald Trump","title":"Speech: Donald Trump Delivers a Campaign Speech in Vienna, OH","date":"2016-03-14","link":"https://factba.se/transcript/donald-trump-speech-vienna-oh-march-14-2016","paragraphs":["Wow. Thank you. Thank you Chris. So great. I got a call a couple of weeks ago from Chris Christie and he said, \"I really think it's amazing what's happened.\" You know, it's called something special. It's whether it's momentum or whether it's whatever. We have something going that people haven't seen before.","It's really a drive and I mean honestly, they're talking about it's one of the great things that they've seen in political history. It's been on the cover of Time. It's been at the head of every newspaper. It's really something special. We're going to make our country so much better. It's going to be great again.","And it's going to happen quickly. So I just wanted to, you know, I change my plans a little bit. We're doing great in Florida. We're doing great in Illinois. Missouri I think we're going to have a tremendous day. And I said, \"I have to come out here and we have to explain a couple of things.\" Because what's going on, you know.","I don't know if you know you read The Art of the deal. But I worked for a long time in Ohio. And my father and I, when I was very young I bought a job with my father and it was a great success. It was in Cincinnati and it was a great success. It was a horrible job. It was a mess and I took it over. I fixed it. I worked here summers, I worked here.","I come out all the time. And we bought it for X and we sold it for X and after that the job didn't do too well. I have to tell you, but we were gone. We were gone. And usually, we hold but this time we did. So it gave me an unbelievable feeling for the people of Ohio. I stayed here. I work here and I love the people of Ohio.","And. And and it was really one of my first big jobs. And -- and I said, 1164 units and we bought it from the FHA for like nothing. And we sold it for a lot of money and it gave me like that. Like if you're a baseball player, you get that first tip. Or if you're a golfer and you sink the first three foot putt.","You know, one of those deals. But it gave me a great confidence and I've always loved this place. So I just want to tell you that, folks. So thank you. Thank you. So this all began and this began very strongly in June. June 16th to be exact. And I said to my wife, \"We have to do this. This is something we have to do.\" Our country is being so badly led.","It's being led into this horrible deal with Iran. I mean, this deal where we pay $150 billion. We get nothing. We should have never even started negotiating the deal until we got our prisoners back. They never once walked. They never once did anything. Constantly, you'd see back in Iran, you'd see the people dancing in the streets before the deal was done.","They're dancing. They're calling us all stupid. The deal was a -- it was a joke. Except for us so serious. It was a joke. It was one of the worst negotiated transactions of any kind I've ever seen. They could have walked. They could have gone in and said before we start we need our prisoners back. This would be three and a half four years ago.","And they would have said, no. The Persians being great negotiators. They would have said no. And then we get up and we walk and we go out and we double up the sanctions. And within 24 hours they would call back. They said, \"We're giving you back the prisoners.\" Then we go in a second time and we say, \"Listen, we have a problem.","We owe $19 trillion. We can't give you the $150 billion back. Can't do it. Sorry.\" And I tell that story, you know, actually, some of the media who by the way are the most dishonest people on earth. OK. The worst. True. True. So true. So true. Like look at this massive crowd in this big hangar.","And -- and we set this up. Remember, we set this up. Like what? Fifteen hours ago. Right? And just look because I wanted to come up. This is a place I want to win. This is the place. This is going to do it. Ohio is going to make America great again. Kasich can not make America great again.","He can't do it. He can't do it. If you didn't hit oil, and that wasn't because of him, believe me. If you didn't hit oil, you would have had a disaster. This would have been as bad as any of them. And you got lucky. Now the problem, is oil has gone way down. And yet your budget has gone up 35% more than any other state in the United States.","That means, you're going to have a big, big problem. It's already been talked about. Two days ago, I was in Cleveland. We made a speech. It was unbelievable. Like 25,000 people. And just before I went on, one of the managers of the arena came over and the great Patrick Park. You know, Patrick and Raymond Park great people, they own it. They do such a beautiful job.","And he said, \"It's so sad Mr. Trump.\" Right over there Eaton Corp. going to Mexico, right over there Ford going to Mexico. Then he pointed over here, he pointed to two or three other places. And I said, \"Wow, that's sad.\" And that's what's happening, folks. That's what's happening. With me? It not going to happen anymore.","We're not going to be the dummies anymore. We're not going to be the dummies anymore. You're losing your jobs. You're losing your income. You're losing your factories. They're going to China. They're going to Mexico. Japan is killing us with the cars. Now, it's Vietnam, it's India, it's everybody.","We don't make good deals anymore. We don't win anymore. If you think, we don't win anymore. When do we win? We lose on trade. We lose with the military. We can't beat ISIS. We can't beat ISIS. Here we have military and we can't beat ISIS. We don't want to use our military. We don't know how to win anymore.","It's not even in our culture anymore. You know, the old expression to the victor belong the spoils. Right? We should have never gone in and I did not want to go in. Believe me, I said, \"You're going to destabilize the entire Middle East.\" But they went into Iraq, it was a mistake. They went in. Mistake. Now Obama gets out.","The way he got out was so bad. He puts out a date. The enemy says, \"Wow.\" They couldn't even believe it, I guarantee you. He puts out a date when we're leaving. Bad thing to do. In all fairness, we shouldn't have been there but we should have left some troops behind. So that what happened wouldn't happen.","So Iran is taking over as you stand here. Iran is taking over Iraq. Iraq has the second largest oil reserves in the world. So the Iran deal -- I used to say one of the greatest deals I've ever seen is the Iran deal. But actually the greatest deal I've ever seen is what happened just now. Iran is taking over Iraq, second largest oil reserves in the world.","That's the greatest deal. They've been fighting with Iraq forever, forever. And they go 10 feet one way, 10 feet the other way, 10 feet. Then they rest. Then they go again, for years and years and years they fought. But they were the same. They were equal military strength. Saddam Hussein would drop gas.","They'd complain, they dropped gas. This is what -- this went on forever. And then we obliterated one of the two powers and it was obvious. To me it was obvious. And I said, \"Don't do it. You're going to destabilize.\" Now Iran is taking over Iraq. Iran is going in with Yemen. Now they don't want Yemen. What they like is that long big beautiful border that separates Yemen from Saudi Arabia.","And I've been -- I've been really pretty good in these predictions. You know, when I wrote a book in the year 2000, The America We Deserve. I mentioned in the book Osama bin Laden and everyone said -- don't forget that was a year and a half before the World Trade Center came down. And everyone said, \"I don't believe it.\" One of the big announcers in the morning.","Great guy. He said, \"Wait a minute.\" Because they brought the book. They said, you know, \"Trump was talking about Osama bin Laden before he knocked down the World Trade Center.\" And the guy said, \"No way, no way. Let me see.\" They looked at the book. That's right. That's what I did. We had to take him out.","We had opportunities to take him out. So I'm pretty good at the prognostication. And I'll tell you. Four years ago, and a lot of your supporters and your supporters before I did this whole crazy political thing. OK. We've been supporters and friends for a long time. But you've seen, I said, \"Take the oil.\" I didn't want to be there but now we're there.","I said, \"You're going to leave. Take the oil. Take the oil.\" I kept saying it. And they said, \"You can't take the oil. What a terrible thing. This is a sovereign country.\" This is a country who has blown off the face of the earth. Sovereign. You had the leaders that we left behind were totally corrupt. That were totally corrupt.","Horrible. Horrible. These were corrupt people. That's what happened with ISIS. They wouldn't include these people. And ISIS turned out and ISIS turned out to be a lot tougher and a lot smarter than the people we chose. They didn't include them. So who has the oil? Iran has the oil and ISIS has the oil.","What do we have? We spend years there. Two trillion dollars and cost two trillion. Thousands of lives, wounded warriors who we all love all over the place. What do we have? We have nothing. If our leaders would have gone away, elect them president, tell them to go away to the beach. It just sun themselves for four years.","We would have been better off. Now Saddam Hussein was not a good person. Who cares? I'll tell you what he was great at, killing terrorists. He would kill terror. Now Iraq is Harvard University for terrorists. You go to Iraq, you want to be a terrorist, you go to Iraq. That's Harvard. That's what they do. They kill.","We don't do -- they developed terrorists all over the place now. It is far worse than it was before we started. Now in the meantime, we have our country, it's crumbling. You look at our airports, you look at our hospitals, you look at our roads and our highways, you look at our bridges they're falling down.","You look at our schools. Our country is falling apart. We've become third world in many respects. You know, you go to Dubai, you go to Qatar, you go to some of these places and you land at airports and you say, \"Oh man, look at this airport.\" I was in Qatar and they were touring me the airport. They were showing me this beautiful airport.","And I said, \"Akbar.\" Named Akbar. Good guy, nice guy. I get along with everybody. You have to get along. But they were showing me the head of the airline. Wonderful guy. Mr. Trump and this is this and this is that and here we have this and we have spas for the people. I said, \"This is beautiful.\" He goes, \"No, no, no, no, no. This is just temporary.","The real airport is being built over there.\" And he appoints in this 40 cranes building the most incredible airport. And then I get back on my plane I land at LaGuardia with potholes all over them. Right? We're becoming third world. You look at what's going on. So here's the story, folks. so important you got to vote tomorrow.","You've got to vote. If you have a headache. If you're dying, I mean, if you're dying, if you just went to your doctor -- although that would cost too much because Obamacare, you know. Where repealing and replacing Obamacare. That I think of. But if you go to your doctor and he tells you, you're -- you're over.","It's over. It's just done. You're done. You're gonna be dead in three weeks. Doesn't matter. Get out tomorrow and vote. Think about your children. Think about your family. Get out tomorrow and vote. OK? You got to do it. You've got to do it. So you know, it's a movement, it's a movement like they haven't seen.","I'll tell you what? the cover of Time, four times in the last couple of months. Take a look, that's what they're writing. The single biggest story in politics today in the world is what's happening of all things to the Republican Party. We had a party that was obsolete. We had a party. Mitt Romney couldn't run for -- for dogcatcher.","This guy was a disaster. We had a party. We had a party that you know, won the last election. We had the wrong person. You know it's interesting. I backed McCain, he lost. I backed Romney, he lost. I said, \"This time, we're going to do it ourselves, folks. We're going to do it right.\" We're going to do it. We've got to do it right.","So the biggest story in politics worldwide. It's all over the world. It's a movement is what's happening with the Republican Party. So here's a start. You know, I've won many, many 15, 16 states. I think we're gonna have a great day tomorrow. Great day. Fact, the one that's closest, looks like you get out and vote.","But we're going to have a great day. I think, we're gonna have a phenomenal day. Florida is looking fantastic. Florida is. Florida's really look at. But look -- look, you have a senator that doesn't show up to vote. How would you like to have a senator who doesn't show up to vote? I mean, he doesn't come in. So you can't have that either.","But Florida's looking really, really fantastic. And you know, they have a little bit of the same characteristic, you have Rubio. He doesn't vote. That's real bad stuff. And your governor is absentee. He goes -- listen to this because I know because I was there but I go back and I still work. You know, I have a job, right?","You going to have to do your job. So your governor Kasich, if you look at him -- and -- and I'm doing totally impartial. He goes to New Hampshire. He's living in New Hampshire, living with Chris. Is Chris around? Even more than Chris Christie. He was there. Right? Even more. I hate to do that but I had to make my point.","So so. But he goes to New Hampshire. He lives there. He loses badly. He gets killed. I win in a landslide. OK? I win New Hampshire. I love the people of New Hampshire. They gave me my first big victory and it was early on. Everybody wants to win Iowa so they can win New Hampshire. I won New Hampshire. Then we come, then we come.","We go South Carolina. I'm not supposed to win that because it's heavily, heavily evangelical. But I'm a great Christian and I understand evangelical. And evangelical is smart and they don't want to remember. Ted Cruz, I call him lying Ted Cruz. He's lying Ted Cruz. And he walks in with his nonsense.","He walks in with that -- you know, phony stuff and he lifts the Bible up high. And he said, \"Here I am. I'm lying Ted Cruz.\" And he pushed about and then he starts lying for the whole night. Any position you have. He knows what your position is. He tells people the opposite. What he did to Ben Carson who just endorsed me, by the way.","Doctor . Great guy. But in Iowa, Ben was doing really well and I was doing really well. And Ted Cruz said, \"Ben Carson had just quit the race.\" And the voting hadn't even come close to ending. And he convinced him. And then right after the race ended, he called him and apologized.","Give me a break. And I don't think Ben has ever forgotten that or forgiven that or whatever. But Ben endorsed me two days ago and that's a great endorsement. That to me. And you know, who else endorsement me? Which I think you'll like, Sheriff Joe Arpaio. Wait. When Sheriff Joe endorses you that means you're tough on the borders.","Believe me, Sheriff Joe. So we had Sheriff Joe and he endorsed. And we had Sarah Palin who was so great, she endorsed. And Jerry Falwell junior from Liberty University. So great. And maybe Jerry, I think, really helped me with the evangelicals. So we go to South Carolina. And that's going to be Ted Cruz country.","That's lying Ted Cruz country. And we go and everybody says, \"He's going to win.\" And who wins in a landslide? Trump. And who gets the military? The vets? Because when they're leaving, they do the polls. I won with the military, I won with the vets, I won big with the evangelicals, I won big with everybody, I won with women, I won with men, I won with highly educated, I won with less than highly educated, we won with every single category.","So it's been great. Same thing with Nevada, we go into Nevada. I win with Nevada in a landslide. But the big thing is this, I go there and I say hello to the people that work at the polling booths. And a woman comes up to me in New Hampshire she said, \"You know Mr. Trump, I've been doing this for 40 years.","And in 40 years, we used up like three people come in and then another three, four people. And it was just very light. Here we have lines.\" And I looked at the lines. The lines were five blocks long, five abreast coming in to vote. We've taken in millions and millions and millions of people within the Republican Party.","They came out from the Democrats. They came as the independents. And I'll tell you, the thing I'm most proud of is -- and I see it when I sign and when I shake hands with people. Every 20th person says to me, \"You know Mr. Trump, I've never ever voted before.\" We're talking about 40 year old people. We're talking about 50. You?","Are you going to vote? And you never voted before? Thank you man. That's so cool. But who's never voted before and just voted? Wow. Wow. And you're all voting, right? I'm telling you. I'm telling you they just set it on one of the stations coming in. It is a phenomena. It is. And it's phenomenal. But it is a phenomena.","We -- so many people they said, \"I've never wanted to vote because I've never seen anybody I wanted to vote for.\" OK? So we have the Democrats and we're out millions and millions and millions of votes. And you know, it's sort of interesting, I watch lying Ted a little while ago and he was saying, \"I'm the only one.\" You know, with the -- you know, I always say, he's a good debater but he can't talk.","He says, \"I'm the only one that can beat Trump. I beat him five times. I'm the only one.\" You know, it's like a professional debate artist. And yet I've won every debate. I don't understand it. But now according to Drudge used, an incredible guy, Drudge. They do the polls after the debates, every single day debate.","Time magazine, Drudge, all these different places they do polls after the debate. I think, I've won every single one for every single debate. Really. But lying Ted goes, \"I've got to tell you. I'm the only one that can stop Trump. Nobody else I'd beaten him five times.\" And then I said to myself, \"Is anyone going to speak up? Nobody speaks up.\" So at the debate, you remember?","He said, \"I'd beaten him five times. I'm the only.\" I said, \"Yeah, but I beat you 15 times.\" Right? Right? I don't know. He's lying Ted. He's lying Ted. So look, so important. We have so many different problems. And I want to read you something because I love it. I love it. You know, we need security.","We need borders. We're going to build the wall. The wall is going to be built. The wall is going to be built, 100%. Build that wall, build that wall, build that wall, build that wall, build that wall. Going to be built. And. And. Who's going to pay for the wall?","Mexico, 100%. 100%. We have a trade deficit with Mexico, folks. These guys come off the stage. They used to say, \"You can't build the wall.\" And then I said, \"Well you know, the Great Wall of China is 13,000 miles long. Much bigger. And it was built 2,000 years ago. Why can't we build the wall?\" \"Well, I don't know.","You can't build.\" And then the other day, I hear these guys say, \"We're going to build a wall.\" And my wife heard it, she came up she said, \"I think I just said, we're going to build a wall.\" OK. But here's the thing. Then they say, \"You can't get Mexico to pay for the wall.\" OK. So remember this. This is easy.","Anybody in the audience can do it because almost everybody in the audience is smarter than the people running our country. OK. Sorry remem -- sure. So remember this, remember this. The wall is going to cost $10 billion, a lot of money. We're going to do a real wall. It's going to be like in the OPO, The Old Post Office.","I got it. Under budget, ahead of schedule, going to be great. Right? We want to go under budget. We get it on. I'm the thing, I do best. In all fairness, is built. OK. So we're gonna build it under budget, ahead of schedule. But it was going to cost 10 and it's gonna be a -- let's see that ceiling. It's pretty good actually, that ceiling.","Hey, that ceilings up there. They don't build them like they used to, folks. Right? It's pretty good. But it's going to be right up there. It's probably going to be higher than that but it's going to be right up. Forty five, 50 feet, could precast, beautiful job. So here's a story. Here's a story. So the say, \"You're never going to be able to get Mexico to pay.","It's a 100%.\" They said, \"No way. These are the people I'm running against.\" I'm arguing with them. Here's the story, we have a trade deficit with Mexico a year, $58 billion. Right? The wall is going to cost $10 billion. That's a peanut compared. They going to pay for the wall, folks. When you have 58 billion advantage, in trade, and you want 10 billion to pay for the wall.","Now there's various ways they can do it and I'm not pushy. I'm a very, very un-pushy person. They're going to pay for the wall so easy. OK? So easy. You probably saw the other day, Vicente Fox. Vicente Fox, the ex-president. And what did he do? He threw out the F bomb. If I threw out the F bomb, I would get these people.","I would get the electric chair. OK. They would say it's the electric chair. He threw out. Nobody even talks about it. But what he did is good because he said, \"There's no way we're going to pay for the you know what? Wall.\" OK? Vicente, there's no way he said. And really angry and arrogant. He said -- and I love Mexico, I love the people of Mexico.","I have thousands of employees and over the years, Hispanics. And I win in the polls with the Hispanics. You saw that in Nevada. I won with the Hispanics. In addition to every other group. Because I'm going to bring jobs back, I'm bringing the jobs back. I'm bringing them back from China. I'm bringing them back from Mexico.","I'm bringing jobs back. So Vicente Fox, Vicente Fox, the good and the bad. He said, \"There's no way we're going to pay for the you know what? Wall.\" And angry. And I said, \"We made progress because he used to say there's no way we're going to build a wall. So now, he accept this going to be built. Right?","He accepts that it's going to be built. That's good. That's good. Now, we're just make a little deal and they're going to pay. Otherwise, we're going to have a little problem. We're not going to let so much trade. Don't forget, the 58 billion a year, doesn't include all the drugs that are pouring across and poisoning our youth.","OK? And one thing, I -- I told the people of New Hampshire because there were so good to me and the victory was so conclusive. And it was my first victory as a politician. I've never done this before. Some people give me credit. They said, \"You know, it's amazing. This is a phenomena.\" And he's never done it before.","He's only been doing it for eight months. But it's like common sense and that's why we have these crowds. And that's why it's a movement because it's a movement. When I go to Dallas, 21,000 people. We just left North Carolina -- where I think we're going to do great. We just left. We had a room that held 2,000 people who were set up quickly.","It held 2,000 people. They had between nine and 10,000 people outside listening and that we had to send away. There's something going on. OK. OK. So here's the story, we are going to do things that the country isn't used to doing. It's called, we're going to win. Win. It's very simple, win.","So I want to read you this because I love it. I don't know. Some of you may have heard and I haven't done it much but I love doing it. I love reading it. It was written by Al Wilson long time ago and it was actually a song and a little upgrade. Maybe we do a little but I think it's great. So we have a tremendous problem with terrorism.","And we have a tremendous problem where and I don't know if you agree with me. But we cannot let people into our country that we don't know, who they are, what they are doing, where they are. They have no paperwork. We can't do it. And we can build in Syria. We can build a safe zone and we'll do that.","And I want to get Saudi Arabia, I want to get Gulf states to pay. They have so much money that you wouldn't even believe it. And they're not paying, we're paying for everything. We always pay. You know, people think we spend a lot on our military. We spend a lot taking care of all these rich countries that don't reimburse us properly.","South Korea, I love South Korea. I love Japan. But Japan, if we get attacked, Japan doesn't have to do anything. If Japan gets attacked, we just started World War III. We have to go in and defend them. What kind of deals are these that we make, folks? So we're going to -- don't worry, we're going to make these good.","But we talk about terror and we talk about terrorism and we talk about -- remember this -- this from what I'm going to read. We talk about the role people coming into our country. Right? And we can't allow it. And I love you. Look at this crowd. I love you. I mean, it's amazing. OK. You're ready?","And it's called the snake. A snake. Snake. Right? On her way to work one morning, down the path along the lake, a tenderhearted woman saw a poor half frozen snake. Her pretty colored skin had been all frosted with the dew. Oh well, she cried, \"I'll take you in and I'll take care of you.\" \"Take me in, oh tender woman.","Take me in, for heaven's sake. Take me in, oh tender woman.\" Sighed the broken snake. She wrapped him up all cozy in a curvature of silk and then laid him by the fireside with honey and some milk. Now, she hurried home from work that night. As soon as she arrived she found that pretty snake she'd taken in had been revived.","She was happy. \"Take me in, oh tender woman. Take me in, for heaven's sake. Take me in, oh tend to woman.\" Sighed the broken snake. Now, she clutched him to her bosom. \"You're so beautiful.\" She cried. But if I hadn't brought you in by now, heavens, you might have died. Now she stroked his pretty skin and then she kissed him and held him tight.","But instead of saying thank you. That snake gave her a vicious bite. \"Take me in, oh tender woman. Take me in, for heaven's sake. Take me in, oh tender woman.\" Sighed that vicious snake. \"I saved you.\" Cried the woman. \"And you've bit me. Heavens why? You know your bite is poisonous. And now, I'm going to die.\" \"Oh, shut up. Silly woman.\" Said the reptile with a grin.","You knew damn well I was a snake before you took me in. Right? Right? U.S.A. U.S.A. So we don't know what we're doing, folks. And we have to learn. We're going to make America great again. We're going to do a few things and I'm going to go over him quickly. But the main thing I want you to do tonight, go home, go to sleep, get a good rest.","Go out tomorrow. You got to be Kasich. He's not going to be a great president. He's not going to be strong. He's weak on the borders. Remember, when he was a congressman he signed NAFTA. NAFTA destroyed Ohio. It destroyed Ohio. And now, he wants to sign TPP that is going to be worse. I have studied it so carefully.","That is going to be worse for Ohio. It's going to take all of your car business out. It's going to take all of your other. But the car business is going to be destroyed by TPP and he wants it. And nobody knows why he wants it, including himself. Maybe one of his lobbyists are demanding it. Maybe the special interests from the cars or something are demanding it. Maybe one of the other countries that are going to benefit are demanding it. Who knows.","It is absolutely crazy. They don't even talk about monetary manipulation in the agreement. It's 6,000 pages long. It's 12 countries at least. And here's what happens, we don't even have people to read these things. But those countries have read every single word. They diagnosed that every single word. We're going to be wrapped.","If we're going to make trade agreements, do nice simple. Bum, bum, bum. Doing with individual countries that deserve it. Don't do it with this whole mass group and then you watch. China? They're watching. They're not in the agreement now but they're watching. And they will come in through the back door at a later date.","And they will take it over and they will continue to laugh at how stupid our country and how stupid our leaders are. But it won't happen if I'm the leader. It won't happen. And remember the little -- Look, look, look. I love China, China is great. I love Mexico, it's all great. Their leaders are too smart for our leaders.","Our leaders don't have a clue. So think of China, think of China. Trade deficit, $500 billion. Then these stupid people say -- and I'm a conservative but I'm a commonsense person. And I like to say I'm a commonsense conservative. Look, I'm very conservative on the military. I'm very conservative with the veterans.","The veterans are going to be taking care of, folks. OK. Really. Better than ever before by a factor of 10. I'm very conservative on the border. Nobody remembers Sheriff Joe. Nobody is like me on the border. I'm very conservative on health care. I'm conservative on Second Amendment. We're going to keep our Second Amendment.","We're not playing game. Very, very. But when it comes to trade, I love free trade. See, a true conservative only wants free trade. And that's good if you have smart people negotiating for you. But we don't, we don't. We have the opposite. I'm trying to be nice. We have the opposite. So here's the story.","Here's the story. We're going to have great agreements. We're going to have great agreements. We're not going to have agreements where they're good for certain people. I'm self funding my own campaign. I'm putting up my own, money. When that big plane flies into Ohio, you know, who is paying for it? Trump is paying for it. Not as special interest.","I pay for it. And let me tell you, it's expensive but I'm paying. Made in the U.S.A., it's called Boeing. Made in the U.S. But look, but I'm paying for it. I'm self funding and I don't know if I get credit for that. I've spent, you know, a lot of money on the campaign. By the way, here's the beauty like in New Hampshire.","I spent two or two and a half billion. I came in first in a landslide. Other people one in particular spent, I think it was 50 million, 58 million, came in fifth or sixth. Who do you want as president? I mean, when you think? Wouldn't it be nice. Wouldn't it be nice. Seriously, if we could spend the least and get the best result.","Wouldn't that be nice? I mean, in education, in the world, 30 countries, the United States is No. 30. But it's No. 1 on cost. So cost per pupil. So we are No. 1 on cost -- and by the way, cost per pupil not even close. We are so much higher that No. 2 that we don't even talk about No. 2. So we're No. 1 on cost and we're the worst in terms of the education we produce.","You have Norway, Sweden, Denmark, China. Some countries that you've never even heard of before. And they're -- they're ahead of us in education. So we're going to change it around, folks. We're going to have strength. We're not going to have -- and -- and let me just tell you. Let me just tell you. I don't know if I get credit for self funding my campaign but these guys, you know, they're not stupid people.","They're not stupid. You ask, \"How did they make a deal so stupid?\" They're not stupid. Their lobbyists told them to make it. They are totally controlled by their lobbyists and by special interests. So when I tell carrier which just announced they're moving, \"Carrier. Guess what? This is your president.\" Now this is not very presidential.","My wife said, the last debate. And Ivanka said. Anybody ever hear if Ivanka? Yes. They said, \"Dad you're doing great in the debates but do me a favor. You're really ahead. Act presidential tonight.\" I sad, \"what does that mean?\" She said, \"Act presidential. In other words, when they come at you with things, just stand there and act present.\" Now let -- let me tell you, and I told this to the press.","I can be more presidential than any president the United States has ever had except for honest Abe Lincoln. He's tough with the top hat. I can't. Honest Abe. I mean, he was seriously president. Honest Abe. I don't think I can beat honest Abe. I've never said that before that I can't beat somebody. I don't think I can act more presidential than honest Abe.","Now I said, \"So what does that mean?\" Well that means, when they come at you with the barbs and that's -- just. I said, \"I can't do that.\" But I did, in the last debate. I was proud of myself. I did and I won that debate. I won that debate. According to the poll. But look, look. So they say act present -- so I'm going to tell you, this isn't presidential.","Because I'm not supposed to be doing it your president of the United States. But you know what? I'm more interested in having jobs in this country than I am acting presidential. OK? Now, I have Carl Icahn. I have some of the greatest business people in the world. And the -- we have the best negotiators.","We have the best business people. But I have Carl Icahn. I have great people. But this is too easy. I just want to do it myself. So Carrier announce that they're getting rid of 1400 jobs. I buy Carrier air conditioners, I buy train, I buy a lot of them. I buy a lot of air conditioners. I buy a lot of televisions.","You know, from -- they all come from South Korea. We don't make televisions anymore. Used to be, we had Zenith, we had RCA, we had G.E. We don't have anything anymore. They're all made over in South Korea. A little bit Sony, not much they've lost their way. But they're all made over and so. I want a thousands and thousands of televisions.","And I said, \"Can we buy them in the U.S.A.?\" We can't. So it's pretty tough. So here's what happens with -- with Carrier. They announced they're moving. And I'm not happy. because what do we get out of it? They laid off 1400 great, great workers that helped build that company. And they get it. And somebody had the cell phone going and you see these people they're crying, they're devastated, they've had a great job.","We're moving to Mexico, I'm sorry. We're going to close up. We're moving to Mexico. So here's what I do, I call up the head of Carrier, and I say very nicely with great respect, with great respect, \"Hello. This is Donald Trump. I'm the president of the United States and I am not happy about what you're doing.","Moving Carrier out of this country.\" And he's going to say, \"Mr. President.\" Now remember this, if Hillary who doesn't have the strength or the energy to be president. Believe me. Believe me. If Hillary is president, her special interests will call her. Her lobbyists will call her. Her fundraisers will call her.","And she knows it's a bad thing but she won't do anything about it. If Little Marco gets called a 100%, he'll do whatever his lobbyist tells him. He will skip to the B. They'll say, \"Marco, you can't do this Marco. These guys supported you. They gave you five million dollars.\" And you know, what he's going to say?","You're right. I can't do that. Oh, it's OK. OK. If lying Ted gets -- he's got lobbyists. Don't forget. Here's a guy that it is personal financial disclosure form. You know, he's going to be Robinhood. He's protecting everybody from the Big Bad Banks. Well, but he's got loans from Big Bad Banks.","He forgot to put his loan, four million dollars. He forgot to put his loans in his financial statements, in his disclosure forms that he gives to the government. Just forgot, he forgot. He forgot to say that the interest rate is so low that you're practically not paying any interest. You would love -- would anybody like to have lying Ted's interest rate?","Hey, I take his interest, right. You want to know the truth. So the truth is, they are totally controlled, 100%. And you can practically go to Washington they'll tell you, \"Who's the lobbyist for Rubio?\" And that's, \"Oh, you could use this one, this one, this one.\" They will produce. Here's the thing. With me, no lobbyists.","I know no lobbyists. I've used to lobbyists. I've contributed to everybody. I put in the greatest personal financial statement in the history of the United States government. Almost 100 pages, an unbelievable company, tremendous cash flow, very little debt or I wouldn't be running. Can you imagine if that were bad?","You would have heard from those guys. They were looking at that statement. They are so upset how good it is. I built a great, great company. They are devastated. They are so dishonest, disgusting and they are devastated. So here's the story. Here's the story. I only because I want. I could give it to Carl Icahn or one of the very great negotiators too but this too easy.","I want to do it myself. I love doing this stuff. So I'll call Carrier, I'll get the president on the phone. They'll say, \"The president of the United States is on the phone for you sir.\" \"Oh yes. OK.\" \"So let me just tell you something, Mr. President of Carrier.\" Here's the story. You're ready? And this applies to Ford.","This applies to Nabisco that's moving out from Chicago and it's moving into Mexico. And I'm not eating Oreos anymore. So here's the story. Here's the story. I say -- because it's just too easy. I have to do it myself. I know it's not presidential. I'm not supposed to be calling up air conditioner companies.","right? But I'm going to do it. So here's the story. I'm going to tell him, \"Congratulations on your move. I hope you build a beautiful facility. I wish you a lot of luck. Good luck with your employees. To 1400 people that were fired are really devastated. And they're right now working part time jobs because you can't get good jobs in this country.","Because our good jobs are all gone, by the way. So good luck with you. I just want to tell you one thing though before I hang up. Every air conditioning unit that is made by Carrier that crosses are now very strong border is going to be taxed at the rate of 35% per unit.\" OK. All right. Every single one.","Now with the other guys you'll get one of the lobbyists and they'll forget it. And here's what he's going to say, \"Mr. President. Sir, Mr. President.\" I say, \"You have 24 hours to call me. You let me know.\" I will get a call within 24 hours. And here's what's going to say, a hundred percent. This isn't like -- like 95%. This a hundred percent.","I will get a call and you'll say, \"Mr. President. Carrier air conditioner has decided to stay in the United States.\" OK. A hundred percent. And maybe they'll build a new plant and maybe they'll build a new factory and maybe they'll do lots of things. And I don't care where they build it as long as it's in our country right?","But they're staying and we're not going to let these other country manipulate their currencies. These countries are manipulating their currencies making it impossible for all of you to compete and for your companies to compete. That's why you're closing up companies all over Ohio. That's why your steel industry is a disaster.","I'll bring it back. That's why your coal industry in Ohio is a disaster. I'm going to bring your industry back. You're going to have clean coal whether you're in Kentucky or West Virginia or Ohio. We're going to go back and we're going to have -- we have technology now and we're going to have clean coal.","Your coal industry is dead. Your steel industry is dead. Your governor is totally overrated. He hasn't done a thing. And without oil you would be in worse shape than any other state in the union. Believe me. So -- so I'm going to ask you. To get up tomorrow and vote and I'll tell you the bottom line. You are going to be so happy, you're going to remember this evening and you're going to remember tomorrow when you vote.","And you are going to say it was the single greatest vote that you have ever cast. You're going to be proud of your president, I'm you, I'm you. You're gonna be proud of your president. You're gonna be so proud of your country. And we're going to start winning again. We're going to win with our military. We're going to make it so good so strong that nobody is going to play games with us, nobody is going to mess with the us. The -- the vets we're going to win with our vets, we're going to finally take proper care of our vets.","We're going to win at the border. We're going to win with the Second Amendment. We're going to win with getting rid of Common Core and having great education. We're going to win with health care. We're going to terminate Obamacare. We're going to have something that's so much less expensive and so much better.","We are going to win, win, win. We're going to win so much. You are going to be so proud of your country again. I love you Ohio. You can make the difference. You can make the difference. Tell your friends vote for Trump. I promise you I am going to do such a great job. You will look back two years from now, 10 years from now, 20 years from now, you're going to say that's the single greatest vote I ever cast.","We're bringing your business back. We're bringing your jobs back. Thank you Ohio. I love you. Thank you. Thank you. Thank you. I love you."],"text":" Wow. Thank you. Thank you Chris. So great. I got a call a couple of weeks ago from Chris Christie and he said, \"I really think it's amazing what's happened.\" You know, it's called something special. It's whether it's momentum or whether it's whatever. We have something going that people haven't seen before. It's really a drive and I mean honestly, they're talking about it's one of the great things that they've seen in political history. It's been on the cover of Time. It's been at the head of every newspaper. It's really something special. We're going to make our country so much better. It's going to be great again. And it's going to happen quickly. So I just wanted to, you know, I change my plans a little bit. We're doing great in Florida. We're doing great in Illinois. Missouri I think we're going to have a tremendous day. And I said, \"I have to come out here and we have to explain a couple of things.\" Because what's going on, you know. I don't know if you know you read The Art of the deal. But I worked for a long time in Ohio. And my father and I, when I was very young I bought a job with my father and it was a great success. It was in Cincinnati and it was a great success. It was a horrible job. It was a mess and I took it over. I fixed it. I worked here summers, I worked here. I come out all the time. And we bought it for X and we sold it for X and after that the job didn't do too well. I have to tell you, but we were gone. We were gone. And usually, we hold but this time we did. So it gave me an unbelievable feeling for the people of Ohio. I stayed here. I work here and I love the people of Ohio. And. And and it was really one of my first big jobs. And -- and I said, 1164 units and we bought it from the FHA for like nothing. And we sold it for a lot of money and it gave me like that. Like if you're a baseball player, you get that first tip. Or if you're a golfer and you sink the first three foot putt. You know, one of those deals. But it gave me a great confidence and I've always loved this place. So I just want to tell you that, folks. So thank you. Thank you. So this all began and this began very strongly in June. June 16th to be exact. And I said to my wife, \"We have to do this. This is something we have to do.\" Our country is being so badly led. It's being led into this horrible deal with Iran. I mean, this deal where we pay $150 billion. We get nothing. We should have never even started negotiating the deal until we got our prisoners back. They never once walked. They never once did anything. Constantly, you'd see back in Iran, you'd see the people dancing in the streets before the deal was done. They're dancing. They're calling us all stupid. The deal was a -- it was a joke. Except for us so serious. It was a joke. It was one of the worst negotiated transactions of any kind I've ever seen. They could have walked. They could have gone in and said before we start we need our prisoners back. This would be three and a half four years ago. And they would have said, no. The Persians being great negotiators. They would have said no. And then we get up and we walk and we go out and we double up the sanctions. And within 24 hours they would call back. They said, \"We're giving you back the prisoners.\" Then we go in a second time and we say, \"Listen, we have a problem. We owe $19 trillion. We can't give you the $150 billion back. Can't do it. Sorry.\" And I tell that story, you know, actually, some of the media who by the way are the most dishonest people on earth. OK. The worst. True. True. So true. So true. Like look at this massive crowd in this big hangar. And -- and we set this up. Remember, we set this up. Like what? Fifteen hours ago. Right? And just look because I wanted to come up. This is a place I want to win. This is the place. This is going to do it. Ohio is going to make America great again. Kasich can not make America great again. He can't do it. He can't do it. If you didn't hit oil, and that wasn't because of him, believe me. If you didn't hit oil, you would have had a disaster. This would have been as bad as any of them. And you got lucky. Now the problem, is oil has gone way down. And yet your budget has gone up 35% more than any other state in the United States. That means, you're going to have a big, big problem. It's already been talked about. Two days ago, I was in Cleveland. We made a speech. It was unbelievable. Like 25,000 people. And just before I went on, one of the managers of the arena came over and the great Patrick Park. You know, Patrick and Raymond Park great people, they own it. They do such a beautiful job. And he said, \"It's so sad Mr. Trump.\" Right over there Eaton Corp. going to Mexico, right over there Ford going to Mexico. Then he pointed over here, he pointed to two or three other places. And I said, \"Wow, that's sad.\" And that's what's happening, folks. That's what's happening. With me? It not going to happen anymore. We're not going to be the dummies anymore. We're not going to be the dummies anymore. You're losing your jobs. You're losing your income. You're losing your factories. They're going to China. They're going to Mexico. Japan is killing us with the cars. Now, it's Vietnam, it's India, it's everybody. We don't make good deals anymore. We don't win anymore. If you think, we don't win anymore. When do we win? We lose on trade. We lose with the military. We can't beat ISIS. We can't beat ISIS. Here we have military and we can't beat ISIS. We don't want to use our military. We don't know how to win anymore. It's not even in our culture anymore. You know, the old expression to the victor belong the spoils. Right? We should have never gone in and I did not want to go in. Believe me, I said, \"You're going to destabilize the entire Middle East.\" But they went into Iraq, it was a mistake. They went in. Mistake. Now Obama gets out. The way he got out was so bad. He puts out a date. The enemy says, \"Wow.\" They couldn't even believe it, I guarantee you. He puts out a date when we're leaving. Bad thing to do. In all fairness, we shouldn't have been there but we should have left some troops behind. So that what happened wouldn't happen. So Iran is taking over as you stand here. Iran is taking over Iraq. Iraq has the second largest oil reserves in the world. So the Iran deal -- I used to say one of the greatest deals I've ever seen is the Iran deal. But actually the greatest deal I've ever seen is what happened just now. Iran is taking over Iraq, second largest oil reserves in the world. That's the greatest deal. They've been fighting with Iraq forever, forever. And they go 10 feet one way, 10 feet the other way, 10 feet. Then they rest. Then they go again, for years and years and years they fought. But they were the same. They were equal military strength. Saddam Hussein would drop gas. They'd complain, they dropped gas. This is what -- this went on forever. And then we obliterated one of the two powers and it was obvious. To me it was obvious. And I said, \"Don't do it. You're going to destabilize.\" Now Iran is taking over Iraq. Iran is going in with Yemen. Now they don't want Yemen. What they like is that long big beautiful border that separates Yemen from Saudi Arabia. And I've been -- I've been really pretty good in these predictions. You know, when I wrote a book in the year 2000, The America We Deserve. I mentioned in the book Osama bin Laden and everyone said -- don't forget that was a year and a half before the World Trade Center came down. And everyone said, \"I don't believe it.\" One of the big announcers in the morning. Great guy. He said, \"Wait a minute.\" Because they brought the book. They said, you know, \"Trump was talking about Osama bin Laden before he knocked down the World Trade Center.\" And the guy said, \"No way, no way. Let me see.\" They looked at the book. That's right. That's what I did. We had to take him out. We had opportunities to take him out. So I'm pretty good at the prognostication. And I'll tell you. Four years ago, and a lot of your supporters and your supporters before I did this whole crazy political thing. OK. We've been supporters and friends for a long time. But you've seen, I said, \"Take the oil.\" I didn't want to be there but now we're there. I said, \"You're going to leave. Take the oil. Take the oil.\" I kept saying it. And they said, \"You can't take the oil. What a terrible thing. This is a sovereign country.\" This is a country who has blown off the face of the earth. Sovereign. You had the leaders that we left behind were totally corrupt. That were totally corrupt. Horrible. Horrible. These were corrupt people. That's what happened with ISIS. They wouldn't include these people. And ISIS turned out and ISIS turned out to be a lot tougher and a lot smarter than the people we chose. They didn't include them. So who has the oil? Iran has the oil and ISIS has the oil. What do we have? We spend years there. Two trillion dollars and cost two trillion. Thousands of lives, wounded warriors who we all love all over the place. What do we have? We have nothing. If our leaders would have gone away, elect them president, tell them to go away to the beach. It just sun themselves for four years. We would have been better off. Now Saddam Hussein was not a good person. Who cares? I'll tell you what he was great at, killing terrorists. He would kill terror. Now Iraq is Harvard University for terrorists. You go to Iraq, you want to be a terrorist, you go to Iraq. That's Harvard. That's what they do. They kill. We don't do -- they developed terrorists all over the place now. It is far worse than it was before we started. Now in the meantime, we have our country, it's crumbling. You look at our airports, you look at our hospitals, you look at our roads and our highways, you look at our bridges they're falling down. You look at our schools. Our country is falling apart. We've become third world in many respects. You know, you go to Dubai, you go to Qatar, you go to some of these places and you land at airports and you say, \"Oh man, look at this airport.\" I was in Qatar and they were touring me the airport. They were showing me this beautiful airport. And I said, \"Akbar.\" Named Akbar. Good guy, nice guy. I get along with everybody. You have to get along. But they were showing me the head of the airline. Wonderful guy. Mr. Trump and this is this and this is that and here we have this and we have spas for the people. I said, \"This is beautiful.\" He goes, \"No, no, no, no, no. This is just temporary. The real airport is being built over there.\" And he appoints in this 40 cranes building the most incredible airport. And then I get back on my plane I land at LaGuardia with potholes all over them. Right? We're becoming third world. You look at what's going on. So here's the story, folks. so important you got to vote tomorrow. You've got to vote. If you have a headache. If you're dying, I mean, if you're dying, if you just went to your doctor -- although that would cost too much because Obamacare, you know. Where repealing and replacing Obamacare. That I think of. But if you go to your doctor and he tells you, you're -- you're over. It's over. It's just done. You're done. You're gonna be dead in three weeks. Doesn't matter. Get out tomorrow and vote. Think about your children. Think about your family. Get out tomorrow and vote. OK? You got to do it. You've got to do it. So you know, it's a movement, it's a movement like they haven't seen. I'll tell you what? the cover of Time, four times in the last couple of months. Take a look, that's what they're writing. The single biggest story in politics today in the world is what's happening of all things to the Republican Party. We had a party that was obsolete. We had a party. Mitt Romney couldn't run for -- for dogcatcher. This guy was a disaster. We had a party. We had a party that you know, won the last election. We had the wrong person. You know it's interesting. I backed McCain, he lost. I backed Romney, he lost. I said, \"This time, we're going to do it ourselves, folks. We're going to do it right.\" We're going to do it. We've got to do it right. So the biggest story in politics worldwide. It's all over the world. It's a movement is what's happening with the Republican Party. So here's a start. You know, I've won many, many 15, 16 states. I think we're gonna have a great day tomorrow. Great day. Fact, the one that's closest, looks like you get out and vote. But we're going to have a great day. I think, we're gonna have a phenomenal day. Florida is looking fantastic. Florida is. Florida's really look at. But look -- look, you have a senator that doesn't show up to vote. How would you like to have a senator who doesn't show up to vote? I mean, he doesn't come in. So you can't have that either. But Florida's looking really, really fantastic. And you know, they have a little bit of the same characteristic, you have Rubio. He doesn't vote. That's real bad stuff. And your governor is absentee. He goes -- listen to this because I know because I was there but I go back and I still work. You know, I have a job, right? You going to have to do your job. So your governor Kasich, if you look at him -- and -- and I'm doing totally impartial. He goes to New Hampshire. He's living in New Hampshire, living with Chris. Is Chris around? Even more than Chris Christie. He was there. Right? Even more. I hate to do that but I had to make my point. So so. But he goes to New Hampshire. He lives there. He loses badly. He gets killed. I win in a landslide. OK? I win New Hampshire. I love the people of New Hampshire. They gave me my first big victory and it was early on. Everybody wants to win Iowa so they can win New Hampshire. I won New Hampshire. Then we come, then we come. We go South Carolina. I'm not supposed to win that because it's heavily, heavily evangelical. But I'm a great Christian and I understand evangelical. And evangelical is smart and they don't want to remember. Ted Cruz, I call him lying Ted Cruz. He's lying Ted Cruz. And he walks in with his nonsense. He walks in with that -- you know, phony stuff and he lifts the Bible up high. And he said, \"Here I am. I'm lying Ted Cruz.\" And he pushed about and then he starts lying for the whole night. Any position you have. He knows what your position is. He tells people the opposite. What he did to Ben Carson who just endorsed me, by the way. Doctor . Great guy. But in Iowa, Ben was doing really well and I was doing really well. And Ted Cruz said, \"Ben Carson had just quit the race.\" And the voting hadn't even come close to ending. And he convinced him. And then right after the race ended, he called him and apologized. Give me a break. And I don't think Ben has ever forgotten that or forgiven that or whatever. But Ben endorsed me two days ago and that's a great endorsement. That to me. And you know, who else endorsement me? Which I think you'll like, Sheriff Joe Arpaio. Wait. When Sheriff Joe endorses you that means you're tough on the borders. Believe me, Sheriff Joe. So we had Sheriff Joe and he endorsed. And we had Sarah Palin who was so great, she endorsed. And Jerry Falwell junior from Liberty University. So great. And maybe Jerry, I think, really helped me with the evangelicals. So we go to South Carolina. And that's going to be Ted Cruz country. That's lying Ted Cruz country. And we go and everybody says, \"He's going to win.\" And who wins in a landslide? Trump. And who gets the military? The vets? Because when they're leaving, they do the polls. I won with the military, I won with the vets, I won big with the evangelicals, I won big with everybody, I won with women, I won with men, I won with highly educated, I won with less than highly educated, we won with every single category. So it's been great. Same thing with Nevada, we go into Nevada. I win with Nevada in a landslide. But the big thing is this, I go there and I say hello to the people that work at the polling booths. And a woman comes up to me in New Hampshire she said, \"You know Mr. Trump, I've been doing this for 40 years. And in 40 years, we used up like three people come in and then another three, four people. And it was just very light. Here we have lines.\" And I looked at the lines. The lines were five blocks long, five abreast coming in to vote. We've taken in millions and millions and millions of people within the Republican Party. They came out from the Democrats. They came as the independents. And I'll tell you, the thing I'm most proud of is -- and I see it when I sign and when I shake hands with people. Every 20th person says to me, \"You know Mr. Trump, I've never ever voted before.\" We're talking about 40 year old people. We're talking about 50. You? Are you going to vote? And you never voted before? Thank you man. That's so cool. But who's never voted before and just voted? Wow. Wow. And you're all voting, right? I'm telling you. I'm telling you they just set it on one of the stations coming in. It is a phenomena. It is. And it's phenomenal. But it is a phenomena. We -- so many people they said, \"I've never wanted to vote because I've never seen anybody I wanted to vote for.\" OK? So we have the Democrats and we're out millions and millions and millions of votes. And you know, it's sort of interesting, I watch lying Ted a little while ago and he was saying, \"I'm the only one.\" You know, with the -- you know, I always say, he's a good debater but he can't talk. He says, \"I'm the only one that can beat Trump. I beat him five times. I'm the only one.\" You know, it's like a professional debate artist. And yet I've won every debate. I don't understand it. But now according to Drudge used, an incredible guy, Drudge. They do the polls after the debates, every single day debate. Time magazine, Drudge, all these different places they do polls after the debate. I think, I've won every single one for every single debate. Really. But lying Ted goes, \"I've got to tell you. I'm the only one that can stop Trump. Nobody else I'd beaten him five times.\" And then I said to myself, \"Is anyone going to speak up? Nobody speaks up.\" So at the debate, you remember? He said, \"I'd beaten him five times. I'm the only.\" I said, \"Yeah, but I beat you 15 times.\" Right? Right? I don't know. He's lying Ted. He's lying Ted. So look, so important. We have so many different problems. And I want to read you something because I love it. I love it. You know, we need security. We need borders. We're going to build the wall. The wall is going to be built. The wall is going to be built, 100%. Build that wall, build that wall, build that wall, build that wall, build that wall. Going to be built. And. And. Who's going to pay for the wall? Mexico, 100%. 100%. We have a trade deficit with Mexico, folks. These guys come off the stage. They used to say, \"You can't build the wall.\" And then I said, \"Well you know, the Great Wall of China is 13,000 miles long. Much bigger. And it was built 2,000 years ago. Why can't we build the wall?\" \"Well, I don't know. You can't build.\" And then the other day, I hear these guys say, \"We're going to build a wall.\" And my wife heard it, she came up she said, \"I think I just said, we're going to build a wall.\" OK. But here's the thing. Then they say, \"You can't get Mexico to pay for the wall.\" OK. So remember this. This is easy. Anybody in the audience can do it because almost everybody in the audience is smarter than the people running our country. OK. Sorry remem -- sure. So remember this, remember this. The wall is going to cost $10 billion, a lot of money. We're going to do a real wall. It's going to be like in the OPO, The Old Post Office. I got it. Under budget, ahead of schedule, going to be great. Right? We want to go under budget. We get it on. I'm the thing, I do best. In all fairness, is built. OK. So we're gonna build it under budget, ahead of schedule. But it was going to cost 10 and it's gonna be a -- let's see that ceiling. It's pretty good actually, that ceiling. Hey, that ceilings up there. They don't build them like they used to, folks. Right? It's pretty good. But it's going to be right up there. It's probably going to be higher than that but it's going to be right up. Forty five, 50 feet, could precast, beautiful job. So here's a story. Here's a story. So the say, \"You're never going to be able to get Mexico to pay. It's a 100%.\" They said, \"No way. These are the people I'm running against.\" I'm arguing with them. Here's the story, we have a trade deficit with Mexico a year, $58 billion. Right? The wall is going to cost $10 billion. That's a peanut compared. They going to pay for the wall, folks. When you have 58 billion advantage, in trade, and you want 10 billion to pay for the wall. Now there's various ways they can do it and I'm not pushy. I'm a very, very un-pushy person. They're going to pay for the wall so easy. OK? So easy. You probably saw the other day, Vicente Fox. Vicente Fox, the ex-president. And what did he do? He threw out the F bomb. If I threw out the F bomb, I would get these people. I would get the electric chair. OK. They would say it's the electric chair. He threw out. Nobody even talks about it. But what he did is good because he said, \"There's no way we're going to pay for the you know what? Wall.\" OK? Vicente, there's no way he said. And really angry and arrogant. He said -- and I love Mexico, I love the people of Mexico. I have thousands of employees and over the years, Hispanics. And I win in the polls with the Hispanics. You saw that in Nevada. I won with the Hispanics. In addition to every other group. Because I'm going to bring jobs back, I'm bringing the jobs back. I'm bringing them back from China. I'm bringing them back from Mexico. I'm bringing jobs back. So Vicente Fox, Vicente Fox, the good and the bad. He said, \"There's no way we're going to pay for the you know what? Wall.\" And angry. And I said, \"We made progress because he used to say there's no way we're going to build a wall. So now, he accept this going to be built. Right? He accepts that it's going to be built. That's good. That's good. Now, we're just make a little deal and they're going to pay. Otherwise, we're going to have a little problem. We're not going to let so much trade. Don't forget, the 58 billion a year, doesn't include all the drugs that are pouring across and poisoning our youth. OK? And one thing, I -- I told the people of New Hampshire because there were so good to me and the victory was so conclusive. And it was my first victory as a politician. I've never done this before. Some people give me credit. They said, \"You know, it's amazing. This is a phenomena.\" And he's never done it before. He's only been doing it for eight months. But it's like common sense and that's why we have these crowds. And that's why it's a movement because it's a movement. When I go to Dallas, 21,000 people. We just left North Carolina -- where I think we're going to do great. We just left. We had a room that held 2,000 people who were set up quickly. It held 2,000 people. They had between nine and 10,000 people outside listening and that we had to send away. There's something going on. OK. OK. So here's the story, we are going to do things that the country isn't used to doing. It's called, we're going to win. Win. It's very simple, win. So I want to read you this because I love it. I don't know. Some of you may have heard and I haven't done it much but I love doing it. I love reading it. It was written by Al Wilson long time ago and it was actually a song and a little upgrade. Maybe we do a little but I think it's great. So we have a tremendous problem with terrorism. And we have a tremendous problem where and I don't know if you agree with me. But we cannot let people into our country that we don't know, who they are, what they are doing, where they are. They have no paperwork. We can't do it. And we can build in Syria. We can build a safe zone and we'll do that. And I want to get Saudi Arabia, I want to get Gulf states to pay. They have so much money that you wouldn't even believe it. And they're not paying, we're paying for everything. We always pay. You know, people think we spend a lot on our military. We spend a lot taking care of all these rich countries that don't reimburse us properly. South Korea, I love South Korea. I love Japan. But Japan, if we get attacked, Japan doesn't have to do anything. If Japan gets attacked, we just started World War III. We have to go in and defend them. What kind of deals are these that we make, folks? So we're going to -- don't worry, we're going to make these good. But we talk about terror and we talk about terrorism and we talk about -- remember this -- this from what I'm going to read. We talk about the role people coming into our country. Right? And we can't allow it. And I love you. Look at this crowd. I love you. I mean, it's amazing. OK. You're ready? And it's called the snake. A snake. Snake. Right? On her way to work one morning, down the path along the lake, a tenderhearted woman saw a poor half frozen snake. Her pretty colored skin had been all frosted with the dew. Oh well, she cried, \"I'll take you in and I'll take care of you.\" \"Take me in, oh tender woman. Take me in, for heaven's sake. Take me in, oh tender woman.\" Sighed the broken snake. She wrapped him up all cozy in a curvature of silk and then laid him by the fireside with honey and some milk. Now, she hurried home from work that night. As soon as she arrived she found that pretty snake she'd taken in had been revived. She was happy. \"Take me in, oh tender woman. Take me in, for heaven's sake. Take me in, oh tend to woman.\" Sighed the broken snake. Now, she clutched him to her bosom. \"You're so beautiful.\" She cried. But if I hadn't brought you in by now, heavens, you might have died. Now she stroked his pretty skin and then she kissed him and held him tight. But instead of saying thank you. That snake gave her a vicious bite. \"Take me in, oh tender woman. Take me in, for heaven's sake. Take me in, oh tender woman.\" Sighed that vicious snake. \"I saved you.\" Cried the woman. \"And you've bit me. Heavens why? You know your bite is poisonous. And now, I'm going to die.\" \"Oh, shut up. Silly woman.\" Said the reptile with a grin. You knew damn well I was a snake before you took me in. Right? Right? U.S.A. U.S.A. So we don't know what we're doing, folks. And we have to learn. We're going to make America great again. We're going to do a few things and I'm going to go over him quickly. But the main thing I want you to do tonight, go home, go to sleep, get a good rest. Go out tomorrow. You got to be Kasich. He's not going to be a great president. He's not going to be strong. He's weak on the borders. Remember, when he was a congressman he signed NAFTA. NAFTA destroyed Ohio. It destroyed Ohio. And now, he wants to sign TPP that is going to be worse. I have studied it so carefully. That is going to be worse for Ohio. It's going to take all of your car business out. It's going to take all of your other. But the car business is going to be destroyed by TPP and he wants it. And nobody knows why he wants it, including himself. Maybe one of his lobbyists are demanding it. Maybe the special interests from the cars or something are demanding it. Maybe one of the other countries that are going to benefit are demanding it. Who knows. It is absolutely crazy. They don't even talk about monetary manipulation in the agreement. It's 6,000 pages long. It's 12 countries at least. And here's what happens, we don't even have people to read these things. But those countries have read every single word. They diagnosed that every single word. We're going to be wrapped. If we're going to make trade agreements, do nice simple. Bum, bum, bum. Doing with individual countries that deserve it. Don't do it with this whole mass group and then you watch. China? They're watching. They're not in the agreement now but they're watching. And they will come in through the back door at a later date. And they will take it over and they will continue to laugh at how stupid our country and how stupid our leaders are. But it won't happen if I'm the leader. It won't happen. And remember the little -- Look, look, look. I love China, China is great. I love Mexico, it's all great. Their leaders are too smart for our leaders. Our leaders don't have a clue. So think of China, think of China. Trade deficit, $500 billion. Then these stupid people say -- and I'm a conservative but I'm a commonsense person. And I like to say I'm a commonsense conservative. Look, I'm very conservative on the military. I'm very conservative with the veterans. The veterans are going to be taking care of, folks. OK. Really. Better than ever before by a factor of 10. I'm very conservative on the border. Nobody remembers Sheriff Joe. Nobody is like me on the border. I'm very conservative on health care. I'm conservative on Second Amendment. We're going to keep our Second Amendment. We're not playing game. Very, very. But when it comes to trade, I love free trade. See, a true conservative only wants free trade. And that's good if you have smart people negotiating for you. But we don't, we don't. We have the opposite. I'm trying to be nice. We have the opposite. So here's the story. Here's the story. We're going to have great agreements. We're going to have great agreements. We're not going to have agreements where they're good for certain people. I'm self funding my own campaign. I'm putting up my own, money. When that big plane flies into Ohio, you know, who is paying for it? Trump is paying for it. Not as special interest. I pay for it. And let me tell you, it's expensive but I'm paying. Made in the U.S.A., it's called Boeing. Made in the U.S. But look, but I'm paying for it. I'm self funding and I don't know if I get credit for that. I've spent, you know, a lot of money on the campaign. By the way, here's the beauty like in New Hampshire. I spent two or two and a half billion. I came in first in a landslide. Other people one in particular spent, I think it was 50 million, 58 million, came in fifth or sixth. Who do you want as president? I mean, when you think? Wouldn't it be nice. Wouldn't it be nice. Seriously, if we could spend the least and get the best result. Wouldn't that be nice? I mean, in education, in the world, 30 countries, the United States is No. 30. But it's No. 1 on cost. So cost per pupil. So we are No. 1 on cost -- and by the way, cost per pupil not even close. We are so much higher that No. 2 that we don't even talk about No. 2. So we're No. 1 on cost and we're the worst in terms of the education we produce. You have Norway, Sweden, Denmark, China. Some countries that you've never even heard of before. And they're -- they're ahead of us in education. So we're going to change it around, folks. We're going to have strength. We're not going to have -- and -- and let me just tell you. Let me just tell you. I don't know if I get credit for self funding my campaign but these guys, you know, they're not stupid people. They're not stupid. You ask, \"How did they make a deal so stupid?\" They're not stupid. Their lobbyists told them to make it. They are totally controlled by their lobbyists and by special interests. So when I tell carrier which just announced they're moving, \"Carrier. Guess what? This is your president.\" Now this is not very presidential. My wife said, the last debate. And Ivanka said. Anybody ever hear if Ivanka? Yes. They said, \"Dad you're doing great in the debates but do me a favor. You're really ahead. Act presidential tonight.\" I sad, \"what does that mean?\" She said, \"Act presidential. In other words, when they come at you with things, just stand there and act present.\" Now let -- let me tell you, and I told this to the press. I can be more presidential than any president the United States has ever had except for honest Abe Lincoln. He's tough with the top hat. I can't. Honest Abe. I mean, he was seriously president. Honest Abe. I don't think I can beat honest Abe. I've never said that before that I can't beat somebody. I don't think I can act more presidential than honest Abe. Now I said, \"So what does that mean?\" Well that means, when they come at you with the barbs and that's -- just. I said, \"I can't do that.\" But I did, in the last debate. I was proud of myself. I did and I won that debate. I won that debate. According to the poll. But look, look. So they say act present -- so I'm going to tell you, this isn't presidential. Because I'm not supposed to be doing it your president of the United States. But you know what? I'm more interested in having jobs in this country than I am acting presidential. OK? Now, I have Carl Icahn. I have some of the greatest business people in the world. And the -- we have the best negotiators. We have the best business people. But I have Carl Icahn. I have great people. But this is too easy. I just want to do it myself. So Carrier announce that they're getting rid of 1400 jobs. I buy Carrier air conditioners, I buy train, I buy a lot of them. I buy a lot of air conditioners. I buy a lot of televisions. You know, from -- they all come from South Korea. We don't make televisions anymore. Used to be, we had Zenith, we had RCA, we had G.E. We don't have anything anymore. They're all made over in South Korea. A little bit Sony, not much they've lost their way. But they're all made over and so. I want a thousands and thousands of televisions. And I said, \"Can we buy them in the U.S.A.?\" We can't. So it's pretty tough. So here's what happens with -- with Carrier. They announced they're moving. And I'm not happy. because what do we get out of it? They laid off 1400 great, great workers that helped build that company. And they get it. And somebody had the cell phone going and you see these people they're crying, they're devastated, they've had a great job. We're moving to Mexico, I'm sorry. We're going to close up. We're moving to Mexico. So here's what I do, I call up the head of Carrier, and I say very nicely with great respect, with great respect, \"Hello. This is Donald Trump. I'm the president of the United States and I am not happy about what you're doing. Moving Carrier out of this country.\" And he's going to say, \"Mr. President.\" Now remember this, if Hillary who doesn't have the strength or the energy to be president. Believe me. Believe me. If Hillary is president, her special interests will call her. Her lobbyists will call her. Her fundraisers will call her. And she knows it's a bad thing but she won't do anything about it. If Little Marco gets called a 100%, he'll do whatever his lobbyist tells him. He will skip to the B. They'll say, \"Marco, you can't do this Marco. These guys supported you. They gave you five million dollars.\" And you know, what he's going to say? You're right. I can't do that. Oh, it's OK. OK. If lying Ted gets -- he's got lobbyists. Don't forget. Here's a guy that it is personal financial disclosure form. You know, he's going to be Robinhood. He's protecting everybody from the Big Bad Banks. Well, but he's got loans from Big Bad Banks. He forgot to put his loan, four million dollars. He forgot to put his loans in his financial statements, in his disclosure forms that he gives to the government. Just forgot, he forgot. He forgot to say that the interest rate is so low that you're practically not paying any interest. You would love -- would anybody like to have lying Ted's interest rate? Hey, I take his interest, right. You want to know the truth. So the truth is, they are totally controlled, 100%. And you can practically go to Washington they'll tell you, \"Who's the lobbyist for Rubio?\" And that's, \"Oh, you could use this one, this one, this one.\" They will produce. Here's the thing. With me, no lobbyists. I know no lobbyists. I've used to lobbyists. I've contributed to everybody. I put in the greatest personal financial statement in the history of the United States government. Almost 100 pages, an unbelievable company, tremendous cash flow, very little debt or I wouldn't be running. Can you imagine if that were bad? You would have heard from those guys. They were looking at that statement. They are so upset how good it is. I built a great, great company. They are devastated. They are so dishonest, disgusting and they are devastated. So here's the story. Here's the story. I only because I want. I could give it to Carl Icahn or one of the very great negotiators too but this too easy. I want to do it myself. I love doing this stuff. So I'll call Carrier, I'll get the president on the phone. They'll say, \"The president of the United States is on the phone for you sir.\" \"Oh yes. OK.\" \"So let me just tell you something, Mr. President of Carrier.\" Here's the story. You're ready? And this applies to Ford. This applies to Nabisco that's moving out from Chicago and it's moving into Mexico. And I'm not eating Oreos anymore. So here's the story. Here's the story. I say -- because it's just too easy. I have to do it myself. I know it's not presidential. I'm not supposed to be calling up air conditioner companies. right? But I'm going to do it. So here's the story. I'm going to tell him, \"Congratulations on your move. I hope you build a beautiful facility. I wish you a lot of luck. Good luck with your employees. To 1400 people that were fired are really devastated. And they're right now working part time jobs because you can't get good jobs in this country. Because our good jobs are all gone, by the way. So good luck with you. I just want to tell you one thing though before I hang up. Every air conditioning unit that is made by Carrier that crosses are now very strong border is going to be taxed at the rate of 35% per unit.\" OK. All right. Every single one. Now with the other guys you'll get one of the lobbyists and they'll forget it. And here's what he's going to say, \"Mr. President. Sir, Mr. President.\" I say, \"You have 24 hours to call me. You let me know.\" I will get a call within 24 hours. And here's what's going to say, a hundred percent. This isn't like -- like 95%. This a hundred percent. I will get a call and you'll say, \"Mr. President. Carrier air conditioner has decided to stay in the United States.\" OK. A hundred percent. And maybe they'll build a new plant and maybe they'll build a new factory and maybe they'll do lots of things. And I don't care where they build it as long as it's in our country right? But they're staying and we're not going to let these other country manipulate their currencies. These countries are manipulating their currencies making it impossible for all of you to compete and for your companies to compete. That's why you're closing up companies all over Ohio. That's why your steel industry is a disaster. I'll bring it back. That's why your coal industry in Ohio is a disaster. I'm going to bring your industry back. You're going to have clean coal whether you're in Kentucky or West Virginia or Ohio. We're going to go back and we're going to have -- we have technology now and we're going to have clean coal. Your coal industry is dead. Your steel industry is dead. Your governor is totally overrated. He hasn't done a thing. And without oil you would be in worse shape than any other state in the union. Believe me. So -- so I'm going to ask you. To get up tomorrow and vote and I'll tell you the bottom line. You are going to be so happy, you're going to remember this evening and you're going to remember tomorrow when you vote. And you are going to say it was the single greatest vote that you have ever cast. You're going to be proud of your president, I'm you, I'm you. You're gonna be proud of your president. You're gonna be so proud of your country. And we're going to start winning again. We're going to win with our military. We're going to make it so good so strong that nobody is going to play games with us, nobody is going to mess with the us. The -- the vets we're going to win with our vets, we're going to finally take proper care of our vets. We're going to win at the border. We're going to win with the Second Amendment. We're going to win with getting rid of Common Core and having great education. We're going to win with health care. We're going to terminate Obamacare. We're going to have something that's so much less expensive and so much better. We are going to win, win, win. We're going to win so much. You are going to be so proud of your country again. I love you Ohio. You can make the difference. You can make the difference. Tell your friends vote for Trump. I promise you I am going to do such a great job. You will look back two years from now, 10 years from now, 20 years from now, you're going to say that's the single greatest vote I ever cast. We're bringing your business back. We're bringing your jobs back. Thank you Ohio. I love you. Thank you. Thank you. Thank you. I love you."}