{"id":425,"author":"Donald Trump","title":"Speech: Donald Trump in Hickory, NC","date":"2016-03-14","link":"https://factba.se/transcript/donald-trump-speech-hickory-nc-march-14-2016","paragraphs":["Thank you. Hello, everybody. Wow. Thank you. Thank you very much, everybody. Wow. You know, we have 5,000 people outside can't get in, so it's crazy. So we put loudspeakers out there so they hear us. Would anybody like to give up their seat for somebody outside?","I thought so.","Thank you very much. Thank you.","A lot of spirit. A lot of spirit in North Carolina, but I have a big development, actually, down the road not so far away. Lake Norman, you know where Lake Norman and it's Trump National and it's been a tremendous success. And I took it over, a company built it and they lost it and went through a bankruptcy proceeding and I bought it out of bankruptcy and I spent quite a bit of money on it. We have a lot of employees.","Great, great people from North Carolina. We have employees and it's a tremendous success. It's a tremendous job. We're very proud of it. And I come here, you know, I won't be coming here as much looking at that. We'll come here looking now at the state to make sure your roads were in good shape and everything else, but it's been -- it's been a wonderful -- it's been a wonderful job.","We love it. A lot of people work there too.","Thank you. Thank you. Thank you. Well, I felt like this is one small example, but all over the world and then in this country, and we submitted our papers to federal election because, you know, as a private company you never know, I mean, people don't know and a lot of people said, oh well, maybe he's not as rich as people thought.","So we submitted almost 100 pages of documents, very, very powerful documents, and it really spells out the great company. We've built an amazing company and very little debt, tremendous cash flow. You actually said you were shocked by the numbers, how big they were. It's great company and the reason I say that is because it's important.","This is the kind of thinking we need in this country, our country. We have to get -- we have to, you know, if, look, our infrastructure is a disaster. We have to build it on time, on budget. You know, these projects, they end up costing 10 times more than they were set. They build a road and it ends up costing far more than they ever anticipated.","Nobody knows what they're doing. And so it's one of those things, you know, one of the things, Chris, that was interesting is, fairly recently, two years ago, they went out to bid with the old post office in Washington D.C. It's the single best location in Washington. And everybody wanted it. One of the most sought after projects in the history of the GSA.","Everybody wanted it. And I ended up getting it. And I got it because my financial statement was the best store right there, along with all these other great. In many cases, big public companies, hotel companies and also because we had the best, the best job, the best concept. We're going to build a tremendous super-luxury hotel.","One of the best anywhere in the country, and I think maybe the best in the country. But interestingly, I got it in the Obama administration. I mean, if you think about it, the Obama administration, everybody wanted it, all the major hotel companies, Waldorf Astoria, so many different companies wanted it. And what we have now, we started construction.","We're over a year under, in terms of schedule, we're a year ahead of schedule. We're right on budget, even under budget, and I'd be way under budget except they up the marble. We're using marble instead of Teresa. We're using all of the finest materials and I think in the end it'll be great. But the point is, it's under schedule.","We're way ahead of schedule. We're over a year ahead. It will open September. And it wasn't supposed to open for many, many months after that. And it would be great if when we do the infrastructure of our country, we could be under budget and ahead of schedule. That's what we want to see.","Right, Chris. One of the biggest problems we have in our country is trade. We're bad traders. We have the worst people representing us. We have political hacks. Now we have political hacks. We have a trade deficit with China this year, $505 billion, billion dollars, think of it. $505 billion. We have trade deficit with Japan.","That's, that's shocking. We have, with -- by the way, with Mexico, I have great relationships with Mexico and with Hispanic people. I have thousands -- I employ thousands of Hispanics. They're great. But we have, with Mexico, $58 billion trade deficit. And when I say we're going to build a wall, which we will, by the way, but we're going to build a wall.","They love the wall. We love the wall. We love the wall. We're going to build a wall, folks, we're going to build a wall. Are you ready? Who is going to pay for the wall? 100% correct, OK? And you know, when I get off stage with like, Marco, and I get off stage with Kasich and -- USA.","USA. USA. All right. Thank you. All right. You know, it is amazing though. We have rallies, we have tremendous rallies, sometimes 25,000, 30,000. We had one two weeks ago in Alabama, 35,000 people. No disruption, no nothing. But the press is now calling this saying, oh, but there's such violence, the violence.","You know how many people have been hurt at our rallies? I think, like, basically none other than, I guess, maybe somebody got hit once or some, but there's no violence. And you know, in Chicago, we cancel because I didn't want to see, I mean, there's this huge group of people formed, like 3,000. We're going to have 25,000 people in Chicago, rather -- and they've given me a lot of credit, Chris, because rather than having the rally, and having people fighting because we feel great.","The people that are supporters of Donald Trump want to see America be great again. That's what it is. That's what it was. I mean, it's simple. So rather than fighting in Chicago, I did something that was a good move, a good decision because I don't want to see anybody be hurt. And what happened is -- and we've been given so much credit for that decision.","Nobody hurt, nobody -- no problem, it went away, but because of that, people say, well, is there violence? There's no violence. There's love fest. These are love fest. And every once in a while, I mean, sometimes like you just had somebody will stand up and say something, and the police, who are so great, by the way in all cases, I mean, they all are.","But somebody will stand up and they'll say something, and a lot of times they're kids and they don't know where they're coming from. And they'll have a Bernie sign, Bernie is going nowhere. You know that. But they'll have a Bernie sign. Probably given to them by Bernie, I mean, they're the Bernie signs, the exact -- you know, they're made by machine.","They're made the same signs that you see. And you know, possibly or probably, given them in to by Bernie's people, but it's a little disruption. But there's no violence. There's none whatsoever. And I'll tell you what, we go, and these things are so incredible. It's a movement and it's a love fest and we love each other and we're going to do so well.","And by the way, before we forget, Chris, so important tomorrow, North Carolina, you have to go out and vote. You have to vote.","The other country is so divided it's incredible. And you know, it's very sad when you look. And even, even when you have some of these protesters, the level of anger from all sides, including the anger from our side, we're angry. Now, we're not angry people, I'll tell you that. We're not angry people. We're all good.","We're good people, but there's a lot of anger. And there's anger, Chris, at incompetence there's, anger when you look at the trade deals, there's anger when you look at our military, where we can't beat ISIS. We can't beat ISIS. And you know, there's anger at the fact that America, the United States, it doesn't win anymore.","We don't win on trade. We don't win with the military. We can't take care of our vets who are so important. We're going to take care of our vets. Education is a disaster. Education -- Common Core, we're getting rid of, by the way. We're going to bring education locally. And -- but you just look at it, you just look at it. They're chopping away at the Second Amendment.","We're not going to let that happen anymore. We're not going to let it happen. And I have to tell you, healthcare, Obamacare is a disaster. We're going to repeal and replace it. Going to repeal it and replace it. But, but Chris, you know, the -- a certain governor got up and spoke after a presidential address and sort of alluded to the anger.","And the next night I was in a debate, one of the debates. You know they say I've won every debate, I think I have. I think -- I think if I didn't, we wouldn't be here today, right? I would have been like the other people out, but the question was -- it was Nikki Haley, and she said, well, there's great anger, great -- like it's a bad thing.","And they asked me during the debate, Nikki Haley said that you and a lot of your supporters have great anger. Now, I'm supposed to say, oh no, we don't have anger. We're wonderful people. We're so happy with the way the country is run. And I said, wait a minute, I'm not going -- I'm going to tell the truth.","I said, yes, I'm angry. Yes, the millions of people that is supporting Trump, and I'm supporting them, we're all angry because we're tired of a government that is run incompetently. We have incompetent people running our country. And I said we're tired of the Iran deal where we give Iran a terrorist state.","We give Iran $150 billion. We have prisoners in there for years. We should have never even started that negotiation until those prisoners were released. That I could tell you. So rather than doing the politically correct answer where I said, well, no, we're not angry, everything's just, you know, peaches.","I said we're very upset, we're very angry with the way our country is being run. And let me tell you, we're going to make changes. We're going to make this country so great again. But it's an embarrassment. I have friends from China. I have friends from Mexico. I have friends from Japan. They can't believe what they get away with.","They can't even believe it themselves. We're like the whipping post for the whole world, whether it's in trade, no matter what it is. So we're going to go from the not so smart people, I want to say beyond that, but I'm not going to. We're going to go to the really smart people. We're going to go to the brilliant people.","We're going to -- we're going to be respected again as a country. We're not respected at all right now.","Well, I've had great support. They've also supported me and I love the veterans. They're the most incredible people. They are great people and they're not being taken care of correctly. And illegal immigrants are getting better services and better care in many cases than the veterans, OK? It's not going to happen that way anymore.","And, you know, I've seen and I've really -- and I really started with the veterans probably more in New Hampshire than any other place, which I won big, which we won in a landslide. We've won a lot of them in landslides. But every time we go to a place, South Carolina's another one, was so fantastic. Nevada, so many of them, they do polls, exit polls and I win with the veterans so easily because they're so disgusted with what's happening.","Now, in all fairness, we win with women. That's so good, that we win with women. We win with men. That's less important. Women are more important. But we win with women, we win with men, we win with the most highly educated, we win with people without the great education, we win at every level. We win with evangelicals, so big league.","I mean, the evangelicals, you know, Chris, having Jerry Falwell Jr. and having so many of these people that are the ministers, the pastors supporting us has been incredible. But we win with the evangelicals and, you know, a guy like Ted Cruz, he comes into a room, he holds up the Bible -- he holds up the Bible and he starts holding it up nice and high.","Then he goes back and he starts -- he lies. I call him the lying Ted, lying Ted. He's lying Ted. But he lies. And you know, I found out a long time ago, the evangelicals do not want liars. They do not like liars. And that's what's happening. And it's hurt him. I mean, now it's hurt him. And that's why with South Carolina, he was supposed to win South Carolina.","67% evangelical population in South Carolina. And I won it in a landslide. I won it in a landslide, and I won the evangelicals and we've been winning them all over. It's been amazing. The relationship has been -- well, I'm a good Christian. I will tell you. I am a good -- and I'm a believer. One of -- one of the things, and speaking, Chris, of Christian, you know, they're chipping away at the Second Amendment and that's not going to happen anymore.","And they're chipping away at Christianity, folks. They're chipping away big league, big league at Christianity. And I had a meeting with a lot of the pastors. And, by the way, our pastor who was just up here was so incredible. He was at one of the meetings. He was so great. He did a good job. I don't know if he's back there, maybe he's in the audience.","He didn't know I was gonna bring him back on, but that's OK. But we had a meeting with about 40 pastors, pastors, ministers and I said why is it that Christianity seems to be taken advantage of? With other religions, with other places, if you said things that you couldn't -- you couldn't do -- you can almost say whatever you want about Christianity.","These are great people. These are great ministers. These are really strong people, smart people, really good people. And they said, you know Mr. Trump, the problem we have is when we do endorsements and when we do other things we are so concerned, we lose our tax-exempt status. And this was passed during the Lyndon Johnson years.","They passed it. Lyndon Johnson passed it. And basically, I said to him, I said, so that means that you were in Trump Tower. I said that means that you have less power in a certain way than the man walking down the street because they've taken the power away. And I said, how many Christians you have? And we sort of all determined together, 260 million Christians in this country.","I said that means you're bigger than women and bigger than men. That means you're the biggest group in the United States, that means you're the most powerful group potentially. But think of it -- but they don't use their power because they're afraid to use their power, Chris, because they're going to lose their tax-exempt status.","So I told them right then and there I said, you know, and I've seen it because it's a big jump. Hey, look, we're going to say Merry Christmas again at Christmas time, folks, remember that, OK? Remember. So I really mean that. You go into stores now, it's Christmas and you don't see Merry Christmas anymore.","Even if you say merry Christmas and happy holiday for people, and everybody wants it. I have many friends that aren't Christian and they like to say Merry Christmas. I mean everybody likes it. The stores don't put it up anymore. So I said to the group of pastors and ministers, I said look, you know, we -- if I win we're going to work really hard.","We're going to get rid of that restriction because Christianity should be able to have some power and some strength. They shouldn't be shy. They shouldn't be at -- because I really mean it. Things can be said about Christianity that if you say it about something else it's like you can't -- you can't even think about saying it. It's not going to happen anymore, folks.","We're going to bring it up. We're going to bring it up, we're going to bring it up big and it's going to be a big difference because these are great people. And their voice is being taken away and we're going to give their voice back to them, OK?","Well, I do. And you know, it's about the American dream. And you really can't unless you get very lucky or something, but you can't have the American dream without good education. The American Dream is the great thing. And a lot of people think the American dream is dead. And I would say, the American dream is dead.","But if we win we're going to make it bigger and better and stronger than ever before. Remember that. We're going to do that. But -- but if you look at this country, and a big part of education is how bad it is, it's run out of Washington D.C.. So in North Carolina, you want to educate your kids. It comes to Washington.","We're not going to have that. That's called Common Core. We're not going to have it. So we're getting rid of Common Core. And we're going to make it local love, we're going to make it great education. But if you look at worldwide, we're number -- in the top, you know, 30 out of 30 countries, we're No. 30. So we're last.","Out of 30 countries, we're last. But we're first in cost per pupil. We're No. 1, not even close. By the way, No. 2, you know, you have Norway, Sweden, Denmark, China, other countries. But these are the best for education. Now, we're No. 1 in cost by so much that there isn't even a No. 2. The No.2 is so far back.","So we spend more per pupil than anybody else, and we're down on the bottom. It's a little bit like running for office, OK? I spent the least amount of money and I'm at the highest level. That's -- isn't that nice? Isn't that nice? I remember in New Hampshire, one of our opponents -- I won't mention who, but one of our opponents have spent $48 million in New Hampshire running and I had spent $2 million.","And I was No. 1 and the other person was at the bottom of the pack. And I said, who do you want to have as your president? That or this, OK? But that's the way we have to do it. So -- so we spend a lot of money for education and we don't get the bang for the dollar. And we're going to change it around because it's important.","I know it's so important to Chris, but -- and you've done a great job in New Jersey with that, but it's so important. So we're going to get it done.","You know, it is very interesting. That is fine. Let him go. They'll go -- he'll go back home to mom and she'll be angry at him. But little Marco Rubio had a -- an event two days ago and he has very small crowds. Right? But he had this small crowd and a guy stood up like that because it happens to everybody.","You know, they stand up. That's what they do, and they're disruptors, but they stand up. It happens to everybody. They don't report them when it happens to somebody else. With me, everybody gets reported. They'll say, oh, big deal. So Marco Rubio had a small event and a guy stood up. And I'll tell you, it's on tape.","They ripped him down. I'll tell you what, somebody, a security guy, somebody -- they took him and they just ripped him down. Nobody reports that. If I ever did that, I'd be on the front page of every paper in the world. I'm telling you, go take a look at it. It's on Youtube or whatever, but -- but this guy stood up and he said a couple of things and they just ripped him to shreds.","It was incredible. Again, I don't do that. I'm a peace-loving person, folks. See, I'm a peace-loving. We love peace. We all love peace, OK? So, anyway, I just want to say there's a very big double standard here. That, that's OK.","Well, first of all, we have to make our military -- we have to replenish it because it's suffering from cuts and cutbacks. And, you know, under certain way, folks, it's the cheapest thing we can do because I'm going to make our military so strong, so powerful that nobody's ever even going to talk about messing with us, OK? It's the cheapest thing -- it is -- it is the cheapest thing we can do and we're going to go and we have to get ISIS.","We've got to get them out. You know, they're chopping off heads. We're going to get them out. We're going to get them out. We're going to get them out. I mean, just think of the great generals, MacArthur and Patton and some of these great, more modern generals. Think of them -- think of the old-time generals.","Think about that. But when you look at what we do, we don't fight. It's almost like we don't fight to win. We don't fight. I've been saying hit the oil, hit the oil for years. Most of you have been listening. And for years I've been saying, take the oil. And they don't do it. They don't do it. Take the oil.","Now they only started. You know, after Paris, when Paris was such a horror show, and actually the French -- think of this, when the French hit the oil before we did. But I've been saying that for a long time and I said, look, we shouldn't have gone into Iraq, OK? But once we did, we're there. Take the oil.","And, I said, take the oil. For years I've been saying, take the oil and I'll say this, and this is hard to believe, and you'll look it up and maybe it's not even true. But they say the reason they didn't want to hit the oil is they didn't want to pollute the atmosphere, OK? This is a little different. This is -- they don't want to change, you know, the footprint, right?","The carbon footprint. And yet he'll fly to Hawaii in a Boeing 747 to play golf. No, he doesn't want to change. He'll have -- he'll have an environmental meeting but he'll fly to play golf in Hawaii on a Boeing 747 with the very old engines that is spewing stuff, and then come back after a long time. I promise you, I will not be taking very long vacations, if I take them at all.","There's no time for vacation. We're not going to be big. We're not going to be big on vacation. You know, there's so many things -- just sort of interesting, Chris, the White House is like this incredible place, right? It represents so much and you're there for a limited period of time. If you're at the White House and you have so much work to do, why do you fly so -- why do you leave so much?","Why? You know, you'd think you'd want to work, work, work, straighten it out, get it done, fix it up, make it great, and then when you're finished, you can be proud. But boy are we a mess.","Well, I'll give you an example. So we send equipment over to the Middle East, it gets taken away. We send it over to our so-called allies that we don't even know who they are, you know, they're fighting. They're fighting against Syria, but we don't know, are we supposed to be fighting Syria because Syria is fighting ISIS.","So we're fighting Syria and we're fighting ISIS, but Syria is fighting ISIS and ISIS is fighting Syria. So, anyway, so we give it. We have people -- honestly, they don't have a clue, folks. They don't have a clue. And it's a big mess. It's a big mess and Hillary started this war. Hillary is a disaster, OK? Hillary's a disaster.","Just ask Hillary about Libya. You just look at what's happened, OK? But we don't have a clue. And I'll tell you this, look, we send equipment over to people that we think are friends of ours. And a bullet gets fired air, they run away. A friend of mine has a son who's been there for quite a while in Iraq.","Been there three times now, and so disgusted. He says the enemy has better equipment than we do. It's our equipment. They take it away. A bullet gets fired in the air. These guys drop the equipment, they run. 2,300 Humvees with all of the heavy armor plate gets taken away. You know how many that is? How many ships you have to send?","2,300 and we -- we're driving in the old stuff without any protection. That's why you have so many wounded warriors where they're just decimated, where the bombs go up and the thing just blows apart and they lose their arms, they lose their legs and worse. So it's going to be a whole different story. And you know, I think one of the things that Chris is alluding to, I'm self-funding my campaign so nobody is going to control me. Nobody.","You're going to control me. You're going to control. But -- but what happens is a lot of the equipment we buy, it's not necessarily the stuff that they want. They want certain things and they end up getting things, and you read about it. I've been reading about it since I'm a little boy, actually. You read about it where they're procuring, they're getting equipment because one-man manufacturer has better political connections to like guys like a Rubio or like a Cruz where they have better connections to Washington.","And we order equipment that, in many cases, they don't want. And the stuff they want, we don't order because that firm, you know what I'm talking about, that firm is not political or is not strong political. So we're going to get the right equipment. We're going to get the great equipment. We're going to get the stuff the generals and the soldiers want.","And we're going to build up our military and we're going to have a really ready and brilliant military that hopefully, we'll never have to use. Look, I didn't want to go into Iraq. I was against going into Iraq. Somebody said, oh, why bring Donald with his -- you know, he's a strong guy with a trigger. Let me tell you something, I'm the least guy in terms of that.","But we have to be prepared. We have to be prepared. We're not even prepared. When General Odierno left, he was on one of the shows, which I hate to see that he's on a show, to be honest because I don't like our generals, even if they leave, and being on a show and I didn't like what he said. He said, we're -- we have a level of unpreparedness that he's never seen before.","And I think he means going back hundreds of years. I mean, I think he actually was talking about we're the least prepared that the country's ever been. Now, number one, it's good. I like to hear that only from the standpoint that we have to know to fix it. But I hate for the enemies to hear that. You know, when an enemy sitting in other parts of the world, is listening to a general who's leaving talking about how unprepared our country is. That doesn't exactly put us in a position that we want to be. So, anyway, but we are going to take care of our military.","We're going to take care of our vets. We're going to really take care of our vets. And there's so many things we're going to be able to do from -- you know our vets wait sometimes, Chris, six, seven days just to see a doctor. Your suicide rate is the highest rate that anybody can even think of. You can't even believe it could be this high.","But our vets are being taken care of very poorly. I put it in a plan. And we have a whole big policy plan on the vets. But one of the things we're going to do -- if somebody is going to wait six days to see a doctor, where a simple pill or a shot or maybe a simple procedure can take care of them, instead they're virtually dying -- not going to happen anymore.","We're going to get that so that those people could go see a local doctor. Those people can go into a local hospital, they'll take care -- by the way, we'll pay for it. It's going to be much cheaper and people aren't going to be dying. They're not going to be dying.","Well, first of all she did say that. She said there's no problem with the VA and when I said -- when I heard that, it was, to me, incredible. Now, a little bit later then she corrected her statement. But you know what she means. She means there's no problem. Look, she doesn't have the strength and she doesn't have the energy to be president.","I can tell you that. There's no -- and I'll say it loud and clear and it doesn't make any difference because you know what, I don't need to be doing this. I honestly -- this is -- people, said why are you doing this? I have this great life. I'm doing it because of the fact that this country has been so good to me and this country is in serious, serious trouble.","$19 trillion in debt, soon to be $21 trillion in debt because of the ridiculous budgets that were passed over the last three months. And I'm doing it because I want to. You know, it's called giving back. I am going to -- I am really giving back. I am all over the place. We see -- what I've learned, Chris, the people in our country are unbelievable.","And I want to see Apple products made in this country not in China. And we're going to see it. And we're going to say it. So, you know, in case I give all the time as a Carrier and Ford and Nabisco and all these companies that are moving out, you have it too from here, I mean, from North Carolina, your businesses have been devastated by -- right?","Is that a correct -- they've been devastated. You know where they've been devastated? By people that are incompetent on trade deals, that -- you people are leaving. You had these great jobs 10 years ago, 20 years ago. You don't have them anymore because they're in different countries. We're going to bring our jobs back, folks.","They're coming back to North Carolina. And we're going to bring our jobs back. We're bringing it back. And believe me, and I'm not just playing games, as sure as you're sitting there, your jobs have been taken away. Now the other thing, and reason I think we have this incredible enthusiasm and -- and by the way, Chris, you know, look at Time Magazine, look at -- The Week's just covered it. They say it. I'm saying, it got a lot of reporters back there.","It's going to be, you know, affirmed. In the history of our country, nothing like this has ever happened. Where, I mean, you go outside. Seriously, you go outside. You have thousands and thousands of people wanting to come into this auditorium. Thousands of people. We go out to speak. We have crowds that are record-setting crowds like the day before the election and here we are many months away from the election because our people want to see something great happen.","They feel it. They can feel it. But -- but the biggest story in all of politics is -- and of all, you know, of all things, Republican. I mean, Republican, that used to be like a word people were thinking obsolete. The biggest story in all of politics worldwide is what's happening to the Republican Party in the United States.","The United States has -- we have numbers going and voting in the primaries that are millions and millions and millions of people more. Chris knows it better than anybody. You see it. We have people going out to vote by the millions more. Now the Democrats are down 35% from four years ago. The Republicans -- the Republicans, because who's going to vote for Hillary or Bernie, I mean, there's nothing exciting there.","Honestly. You take a look. You take a look at those two. Who is going to vote -- who is going to vote for them? Thank you. And see, that's the reason these people are put here. They're disruptors because the Democrats see what's happening. The Democrats -- this is so important. The Democrats see what's happening.","Maybe -- and it's been reported. In the history of our country -- it's a big statement, too and I'm just repeating the press. Nothing like this has ever happened. This is a phenomena. The Democrats are seeing what's happening and they try and disrupt what's happening. But it's not a big deal. They stand up, they shout for a couple of seconds and they get whisked out.","Not a big deal, not a big that. But many millions of people, and sometimes I'll be shaking hands or I'll be signing at the front and we do the rope lines, right? But sometimes I'll be signing and so often people will say 40 year old, 50 year old 60, 70, they'll say, Mr. Trump, I've never voted before ever and I'm voting now.","I'm telling you this happens like 20 every time I come to a place. It's unbelievable. So we're taking from the Democrats. Remember the Democrats for Reagan? We have it bigger. It's Democrats for Trump. It's a bigger number. So it's Democrats -- we're taking also though from independents, big league, and we're taking from people that have never ever voted before and they're 50 years old, in some cases.","And the numbers are astronomical. And who would have thought this is happening to the Republican Party because a lot of people would say, the Republican Party is obsolete. And we do have obsolete people in the Republican Party. We have a lot of leaders that are obsolete because they don't understand what's happening.","But I will tell you, off the record, off the record, there are only many cameras back there. But there are a lot of people that are calling me, top people in the Republican Party, and they're calling me and they say we want to get onto this train because this train is unbelievable. They've never seen anything like it. And -- and when we go into an election against, probably Hillary because she's probably going to make it even though she shouldn't be allowed to with the e-mail scandal, shouldn't be allowed to. Look, you know she's guilty.","I mean, she's guilty. Was that a protest that I just heard?","You know, usually, you're better off -- usually about when the protester stands up, usually an individual or two, you're better off just talking right through the protest because it's not a big one. The problem is the audience always turns, there they are, there they are, the suspect. And that you can't talk to, right?","Is it true?","But anyway. But I just want to say, there's never been anything like this. It's an incredible thing to see. People in South Carolina that work at the polling booths at the booths. And they'd say, Mr. Trump, I've done this for 30 and 40 years. They said we've never seen crowds like this. Lines that were going a quarter of a mile down the road.","They said we'd stand here and there'd be two people walk in an hour. They have lines that are going down the road you wouldn't believe it. And every place is like that, every place is like that. Same thing in Nevada. They said we've never -- a woman came up to me, Mr. Trump, I've done it for 32 years. I've never seen anything like that, the crowds.","And it's a great thing to see. And you know, it's really great. People are involved in the process but they see something that really gives them hope. And I'm so proud to be a part of it. I will -- I will tell you it's such -- it's like an amazing feeling to be a part of it. And if the Republican leadership or establishment, if there is such a thing as the establishment, I probably used to be a part of the establishment.","This guy would come to my office and say, could I have $350,000 for the Republican Governors Association, right?","That's right. He would come to my office like a year and a half, two years ago. So I guess, in a certain way, I was part of the establishment, but I don't even know if there is an establishment. What they have to do is embrace this phenomena and go with it. And we will beat the Democrats and we will beat Hillary who is so flawed.","We will beat them so badly. We will win every state. We will beat them so badly. And you know one of the other things that I have to say is, I run against, you know, other people. If I run, we're going to win Michigan. We're going to win New York. We're going to win places like Pennsylvania. We're going to win New Jersey, OK? We're going to win Florida, but we're going to win.","We're going to win, Florida -- Florida, we're doing great. You know, we're against a little Marco, but I'll tell you what, we're going to win states that no other candidate could even think about winning. We're going to win. So what the Republican leadership should do is try and unify things. Instead of fighting it, get used to it. This is the most incredible phenomena that they've ever seen in politics in this country.","Embrace it, embrace it and let's go win, OK?","Well, Thank you Chris. It's an honor to talk about them. I have a wonderful wife, Melania, who many of you know. I have wonderful children. I have five children. And you know, a lot of friends -- my children are doing very well. Ivanka and Don and Eric and Barron and Tiffany and they're doing well. And a lot of times a friend will come up and say, do you mind seeing my child?","My child's got a problem or whatever and I talk, you know, I'll see the child and they'll have a drug problem or a drinking problem or whatever problem they may have and you know it's interesting, when I won New Hampshire, Chris, the people would tell me in New Hampshire, the biggest problem they have is a problem with heroin.","And you don't see it in New Hampshire, you know, the beautiful roads and the beautiful trees. And yet every time that they'd say, you know, that you'd think they'd be talking about like some economic thing which was a problem, but the first thing was always heroin. And they're tremendously -- they have a huge problem with heroin.","I said -- and they treated me so great. That was my first win, New Hampshire. And I said if I get in, I'm going to pay back because I said drugs -- drugs is just hurting them so badly. They have so many young kids and some others too, but young, the young people are just being addicted, terribly addicted to drugs.","We're going to stop those drugs from coming in. Many of them come from the southern border. And you have the same problem and our whole country has the same problem. And easy way to solve the problem is don't give people access because if they don't start, they never going to have a problem. It's like I don't drink.","I don't have any longing to drink or smoke as I never started. If I did start, I'd probably love drinking and I'd love smoking, you know. So the easiest way is not start. Well, we're going to cut it off. We're going to absolutely cut that off. But I say to friends, I say and I used to when my kids were growing up, no drugs no alcohol.","You just can't have it. No drugs, no alcohol. And I see -- I see so often, and it's so important, I see so often these brilliant people, they have brilliant kids, they're smart, they go to the best schools, but they start with a drink, you know, they -- and they become alcoholic. And they start with drinking or they start with the drugs and they cannot get off it. They can't wean themselves off, that they worked so hard to do it and they can't. And I say to people just no drugs, no alcohol.","I just -- you don't have it. And I add cigarettes when I can. But so, so, so important. And you know, because the world is so competitive. It's so tough that if you have a drug problem or if you have an alcohol problem, it's tough enough now that if you don't have to have that problem because it just puts you at a tremendous competitive disadvantage.","So I do, I have wonderful kids. I hope they stay that way. So I knock on wood as I talk about my kids. But I do have wonderful kids and they've been a big help to me.","You got it. You got it.","And it's not easy and it's not easy. But you've got to start it and you've got to start it as fast as you can. That is something that's very tough. The easy thing is not to start. That's easy, but once you start, you get addicted and it's, it's something that can be handled but you've got to -- you've got to work on it very quickly","Well, we have to just -- we have to be so vigilant. We have to be so tough and we can not allow people into our country that we don't know anything about them, we don't know where they come from, who they are. They have no paperwork. They have no nothing. And I hate to be the one to say it, but I'm the one that says it, and it's not politically correct even to say it. But you know, we're allowing people into our country.","We have absolutely no idea who they are, where they come from, there's no paperwork, there's no nothing. And this could be the great Trojan Horse, who knows. And we have to be smart and we have to be tough and we have to be less politically correct because that is killing our country. I mean, you see the damage that two young people can do in California.","Two young people. She was radicalized. You probably radicalized him. They get married. They have a baby. They kill everybody that they worked with. They gave them baby showers. These people gave them baby showers that they worked with. Supposedly, they had great relations, they go and they kill everybody.","We have to be smart, folks. We can't be the stupid people anymore. We have to be smart, OK? That's all.","Well, we're sort of turning socialist if you look at what we're doing. And people just don't have the incentive to go out there and do the great job anymore. It's being taken away. That incentive is so important. You know, there's no system like we had. Now, I say, had, because we don't really have that system anymore.","Right now we have a different system and we have a series of poor things. We have such, as we discussed, we have such poor healthcare. We have such poor everything. We have no incentives to go out and to do what you want to do. And a guy like, like Bernie Sanders, you know, wants to give everything away.","There's only one problem. You can't give everything away because somebody is going to have to pay the bill. And your taxes -- your taxes, I mean, your taxes are going to go up to 95% or something. They were saying that if you were going to do all of this stuff, that somebody is going to pay. It is probably going to be you, folks, OK? Get used to it. But -- but your taxes go up to 95%. It goes -- once you hit 100%, then you go from socialism to communism and then the other things start to happen.","Look, look, we've got potentially -- we can be, in my opinion, we can be greater than ever before. We have that potential. The reason I say that Chris, is because I've traveled so much. I've never traveled like this in my life. I mean, I've traveled every day and yesterday I made three major speeches. Today, I'm doing three or four major speeches.","I've gotten to know the people. The people of this country are incredible. We have a chance to turn it around. We have a chance -- we're going to -- you're going to get the proper leadership, you're going to get the best people. On trade, we're bringing in the greatest people, the greatest negotiators in the world from Wall Street.","I know the good ones, the bad ones, the ones that are overrated. The ones that are underrated that nobody ever heard of. But there's not going to be any more deals with political hacks and dealing with these most brilliant people in China. And then the deals, TPP is a disaster. I mean, you look at the governor of Ohio.","He's a disaster, what he's done. He voted for NAFTA. NAFTA has taken a lot of your businesses right out of North Carolina. He's voted for NAFTA and now he wants to vote for TPP, and that's going to be much worse. So look, we are going to do something so special but most special of all we're going to start winning again.","We're going to win at every level. We're going to win with our military. We're going to win for our vets. We're going to win with education, knock out Common Core, but we're going to win for -- with education. We're going to win at every level on healthcare. We're going to win at the border. We're going to have the wall, but we're going to win at the border.","We're going to win solidly at the border. We're going to win it every facet. We can do that. It's not even going to be that difficult. I will say this. If we have four more years of an Obama person, if we have four more years of Hillary, and you see the way she's embracing Obama. She never used to embrace Obama.","She didn't even like Obama. Everybody knows it. Everybody that knows her, she never liked Obama. She never -- she couldn't stand Obama. Now, everything he says, oh, our president said this. Oh, he's so great, he's so great. Why? You know why? I know why. I know why. It's because she wants to keep him nice and happy.","Please be happy, Mr. President and please don't do anything bad to me, Mr. President. So, I mean, do you ever see anything like it? She can't stand Obama and all she does is embrace him. Everything he says is fine, fine. So look, and by the way, here's the good news, that's going to kill her in the general election because the last thing our public wants is four more years of Barack Obama. That I could tell you. The last thing. Thank you, everybody. Thank you."],"text":" Thank you. Hello, everybody. Wow. Thank you. Thank you very much, everybody. Wow. You know, we have 5,000 people outside can't get in, so it's crazy. So we put loudspeakers out there so they hear us. Would anybody like to give up their seat for somebody outside? All right. I thought so. Well, thank you. Thank you so much, everybody. Thank you very much. Thank you. And we're -- we're looking forward to being all over the country today. We'll be here, we're going to be in Tampa, we're going to be in Youngstown, Ohio and we're going to be working real hard right up until election day tomorrow to get the wins for this guy and put him in the White House. So what we thought we'd do today is -- since Donald and I have been together for 14 years now. I know North Carolina is important to you. We have business here. Why don't you tell folks a bit about that. I thought I'd ask you these questions to be able to know -- A lot of spirit. A lot of spirit in North Carolina, but I have a big development, actually, down the road not so far away. Lake Norman, you know where Lake Norman and it's Trump National and it's been a tremendous success. And I took it over, a company built it and they lost it and went through a bankruptcy proceeding and I bought it out of bankruptcy and I spent quite a bit of money on it. We have a lot of employees. Great, great people from North Carolina. We have employees and it's a tremendous success. It's a tremendous job. We're very proud of it. And I come here, you know, I won't be coming here as much looking at that. We'll come here looking now at the state to make sure your roads were in good shape and everything else, but it's been -- it's been a wonderful -- it's been a wonderful job. We love it. A lot of people work there too. And in that experience, not only here but what you've done all around the world in terms of building great businesses, I think folks are confident that if you become president, you're going to be able to do that same thing for our country. Tell them how you're going to do it. Thank you. Thank you. Thank you. Well, I felt like this is one small example, but all over the world and then in this country, and we submitted our papers to federal election because, you know, as a private company you never know, I mean, people don't know and a lot of people said, oh well, maybe he's not as rich as people thought. So we submitted almost 100 pages of documents, very, very powerful documents, and it really spells out the great company. We've built an amazing company and very little debt, tremendous cash flow. You actually said you were shocked by the numbers, how big they were. It's great company and the reason I say that is because it's important. This is the kind of thinking we need in this country, our country. We have to get -- we have to, you know, if, look, our infrastructure is a disaster. We have to build it on time, on budget. You know, these projects, they end up costing 10 times more than they were set. They build a road and it ends up costing far more than they ever anticipated. Nobody knows what they're doing. And so it's one of those things, you know, one of the things, Chris, that was interesting is, fairly recently, two years ago, they went out to bid with the old post office in Washington D.C. It's the single best location in Washington. And everybody wanted it. One of the most sought after projects in the history of the GSA. Everybody wanted it. And I ended up getting it. And I got it because my financial statement was the best store right there, along with all these other great. In many cases, big public companies, hotel companies and also because we had the best, the best job, the best concept. We're going to build a tremendous super-luxury hotel. One of the best anywhere in the country, and I think maybe the best in the country. But interestingly, I got it in the Obama administration. I mean, if you think about it, the Obama administration, everybody wanted it, all the major hotel companies, Waldorf Astoria, so many different companies wanted it. And what we have now, we started construction. We're over a year under, in terms of schedule, we're a year ahead of schedule. We're right on budget, even under budget, and I'd be way under budget except they up the marble. We're using marble instead of Teresa. We're using all of the finest materials and I think in the end it'll be great. But the point is, it's under schedule. We're way ahead of schedule. We're over a year ahead. It will open September. And it wasn't supposed to open for many, many months after that. And it would be great if when we do the infrastructure of our country, we could be under budget and ahead of schedule. That's what we want to see. And I think that relates to one of the big issues that you've brought up in this campaign which is trade. And how would you bring the same kind of principles you've brought to building great properties, managing a great company, to our relationships with trade with other countries around the world? Right, Chris. One of the biggest problems we have in our country is trade. We're bad traders. We have the worst people representing us. We have political hacks. Now we have political hacks. We have a trade deficit with China this year, $505 billion, billion dollars, think of it. $505 billion. We have trade deficit with Japan. That's, that's shocking. We have, with -- by the way, with Mexico, I have great relationships with Mexico and with Hispanic people. I have thousands -- I employ thousands of Hispanics. They're great. But we have, with Mexico, $58 billion trade deficit. And when I say we're going to build a wall, which we will, by the way, but we're going to build a wall. They love the wall. We love the wall. We love the wall. We're going to build a wall, folks, we're going to build a wall. Are you ready? Who is going to pay for the wall? 100% correct, OK? And you know, when I get off stage with like, Marco, and I get off stage with Kasich and -- USA. USA. USA. All right. Thank you. All right. You know, it is amazing though. We have rallies, we have tremendous rallies, sometimes 25,000, 30,000. We had one two weeks ago in Alabama, 35,000 people. No disruption, no nothing. But the press is now calling this saying, oh, but there's such violence, the violence. You know how many people have been hurt at our rallies? I think, like, basically none other than, I guess, maybe somebody got hit once or some, but there's no violence. And you know, in Chicago, we cancel because I didn't want to see, I mean, there's this huge group of people formed, like 3,000. We're going to have 25,000 people in Chicago, rather -- and they've given me a lot of credit, Chris, because rather than having the rally, and having people fighting because we feel great. The people that are supporters of Donald Trump want to see America be great again. That's what it is. That's what it was. I mean, it's simple. So rather than fighting in Chicago, I did something that was a good move, a good decision because I don't want to see anybody be hurt. And what happened is -- and we've been given so much credit for that decision. Nobody hurt, nobody -- no problem, it went away, but because of that, people say, well, is there violence? There's no violence. There's love fest. These are love fest. And every once in a while, I mean, sometimes like you just had somebody will stand up and say something, and the police, who are so great, by the way in all cases, I mean, they all are. But somebody will stand up and they'll say something, and a lot of times they're kids and they don't know where they're coming from. And they'll have a Bernie sign, Bernie is going nowhere. You know that. But they'll have a Bernie sign. Probably given to them by Bernie, I mean, they're the Bernie signs, the exact -- you know, they're made by machine. They're made the same signs that you see. And you know, possibly or probably, given them in to by Bernie's people, but it's a little disruption. But there's no violence. There's none whatsoever. And I'll tell you what, we go, and these things are so incredible. It's a movement and it's a love fest and we love each other and we're going to do so well. And by the way, before we forget, Chris, so important tomorrow, North Carolina, you have to go out and vote. You have to vote. Absolutely. And you've talked a lot at recent rallies about how you want to unify the country. And how divided the country is now by this president and how you want to unify them. And I think people would love to hear about the way you wanted to unify them. The other country is so divided it's incredible. And you know, it's very sad when you look. And even, even when you have some of these protesters, the level of anger from all sides, including the anger from our side, we're angry. Now, we're not angry people, I'll tell you that. We're not angry people. We're all good. We're good people, but there's a lot of anger. And there's anger, Chris, at incompetence there's, anger when you look at the trade deals, there's anger when you look at our military, where we can't beat ISIS. We can't beat ISIS. And you know, there's anger at the fact that America, the United States, it doesn't win anymore. We don't win on trade. We don't win with the military. We can't take care of our vets who are so important. We're going to take care of our vets. Education is a disaster. Education -- Common Core, we're getting rid of, by the way. We're going to bring education locally. And -- but you just look at it, you just look at it. They're chopping away at the Second Amendment. We're not going to let that happen anymore. We're not going to let it happen. And I have to tell you, healthcare, Obamacare is a disaster. We're going to repeal and replace it. Going to repeal it and replace it. But, but Chris, you know, the -- a certain governor got up and spoke after a presidential address and sort of alluded to the anger. And the next night I was in a debate, one of the debates. You know they say I've won every debate, I think I have. I think -- I think if I didn't, we wouldn't be here today, right? I would have been like the other people out, but the question was -- it was Nikki Haley, and she said, well, there's great anger, great -- like it's a bad thing. And they asked me during the debate, Nikki Haley said that you and a lot of your supporters have great anger. Now, I'm supposed to say, oh no, we don't have anger. We're wonderful people. We're so happy with the way the country is run. And I said, wait a minute, I'm not going -- I'm going to tell the truth. I said, yes, I'm angry. Yes, the millions of people that is supporting Trump, and I'm supporting them, we're all angry because we're tired of a government that is run incompetently. We have incompetent people running our country. And I said we're tired of the Iran deal where we give Iran a terrorist state. We give Iran $150 billion. We have prisoners in there for years. We should have never even started that negotiation until those prisoners were released. That I could tell you. So rather than doing the politically correct answer where I said, well, no, we're not angry, everything's just, you know, peaches. I said we're very upset, we're very angry with the way our country is being run. And let me tell you, we're going to make changes. We're going to make this country so great again. But it's an embarrassment. I have friends from China. I have friends from Mexico. I have friends from Japan. They can't believe what they get away with. They can't even believe it themselves. We're like the whipping post for the whole world, whether it's in trade, no matter what it is. So we're going to go from the not so smart people, I want to say beyond that, but I'm not going to. We're going to go to the really smart people. We're going to go to the brilliant people. We're going to -- we're going to be respected again as a country. We're not respected at all right now. Donald, you brought up veterans. You know here in North Carolina has one of the largest population of veterans in the entire country. Men and women who have served our country so bravely and so loyally and you mentioned, but you should talk about the plans you have for our veterans because I know, not only as a candidate but before that, you were a great supporter of our veterans. Well, I've had great support. They've also supported me and I love the veterans. They're the most incredible people. They are great people and they're not being taken care of correctly. And illegal immigrants are getting better services and better care in many cases than the veterans, OK? It's not going to happen that way anymore. And, you know, I've seen and I've really -- and I really started with the veterans probably more in New Hampshire than any other place, which I won big, which we won in a landslide. We've won a lot of them in landslides. But every time we go to a place, South Carolina's another one, was so fantastic. Nevada, so many of them, they do polls, exit polls and I win with the veterans so easily because they're so disgusted with what's happening. Now, in all fairness, we win with women. That's so good, that we win with women. We win with men. That's less important. Women are more important. But we win with women, we win with men, we win with the most highly educated, we win with people without the great education, we win at every level. We win with evangelicals, so big league. I mean, the evangelicals, you know, Chris, having Jerry Falwell Jr. and having so many of these people that are the ministers, the pastors supporting us has been incredible. But we win with the evangelicals and, you know, a guy like Ted Cruz, he comes into a room, he holds up the Bible -- he holds up the Bible and he starts holding it up nice and high. Then he goes back and he starts -- he lies. I call him the lying Ted, lying Ted. He's lying Ted. But he lies. And you know, I found out a long time ago, the evangelicals do not want liars. They do not like liars. And that's what's happening. And it's hurt him. I mean, now it's hurt him. And that's why with South Carolina, he was supposed to win South Carolina. 67% evangelical population in South Carolina. And I won it in a landslide. I won it in a landslide, and I won the evangelicals and we've been winning them all over. It's been amazing. The relationship has been -- well, I'm a good Christian. I will tell you. I am a good -- and I'm a believer. One of -- one of the things, and speaking, Chris, of Christian, you know, they're chipping away at the Second Amendment and that's not going to happen anymore. And they're chipping away at Christianity, folks. They're chipping away big league, big league at Christianity. And I had a meeting with a lot of the pastors. And, by the way, our pastor who was just up here was so incredible. He was at one of the meetings. He was so great. He did a good job. I don't know if he's back there, maybe he's in the audience. He didn't know I was gonna bring him back on, but that's OK. But we had a meeting with about 40 pastors, pastors, ministers and I said why is it that Christianity seems to be taken advantage of? With other religions, with other places, if you said things that you couldn't -- you couldn't do -- you can almost say whatever you want about Christianity. These are great people. These are great ministers. These are really strong people, smart people, really good people. And they said, you know Mr. Trump, the problem we have is when we do endorsements and when we do other things we are so concerned, we lose our tax-exempt status. And this was passed during the Lyndon Johnson years. They passed it. Lyndon Johnson passed it. And basically, I said to him, I said, so that means that you were in Trump Tower. I said that means that you have less power in a certain way than the man walking down the street because they've taken the power away. And I said, how many Christians you have? And we sort of all determined together, 260 million Christians in this country. I said that means you're bigger than women and bigger than men. That means you're the biggest group in the United States, that means you're the most powerful group potentially. But think of it -- but they don't use their power because they're afraid to use their power, Chris, because they're going to lose their tax-exempt status. So I told them right then and there I said, you know, and I've seen it because it's a big jump. Hey, look, we're going to say Merry Christmas again at Christmas time, folks, remember that, OK? Remember. So I really mean that. You go into stores now, it's Christmas and you don't see Merry Christmas anymore. Even if you say merry Christmas and happy holiday for people, and everybody wants it. I have many friends that aren't Christian and they like to say Merry Christmas. I mean everybody likes it. The stores don't put it up anymore. So I said to the group of pastors and ministers, I said look, you know, we -- if I win we're going to work really hard. We're going to get rid of that restriction because Christianity should be able to have some power and some strength. They shouldn't be shy. They shouldn't be at -- because I really mean it. Things can be said about Christianity that if you say it about something else it's like you can't -- you can't even think about saying it. It's not going to happen anymore, folks. We're going to bring it up. We're going to bring it up, we're going to bring it up big and it's going to be a big difference because these are great people. And their voice is being taken away and we're going to give their voice back to them, OK? You spent some time last week talking about education. How important education has been in your life and how important you think it is for every child in this country to have a chance at a great education. This president, you have some ideas on that as well that you should talk to folks about. Well, I do. And you know, it's about the American dream. And you really can't unless you get very lucky or something, but you can't have the American dream without good education. The American Dream is the great thing. And a lot of people think the American dream is dead. And I would say, the American dream is dead. But if we win we're going to make it bigger and better and stronger than ever before. Remember that. We're going to do that. But -- but if you look at this country, and a big part of education is how bad it is, it's run out of Washington D.C.. So in North Carolina, you want to educate your kids. It comes to Washington. We're not going to have that. That's called Common Core. We're not going to have it. So we're getting rid of Common Core. And we're going to make it local love, we're going to make it great education. But if you look at worldwide, we're number -- in the top, you know, 30 out of 30 countries, we're No. 30. So we're last. Out of 30 countries, we're last. But we're first in cost per pupil. We're No. 1, not even close. By the way, No. 2, you know, you have Norway, Sweden, Denmark, China, other countries. But these are the best for education. Now, we're No. 1 in cost by so much that there isn't even a No. 2. The No.2 is so far back. So we spend more per pupil than anybody else, and we're down on the bottom. It's a little bit like running for office, OK? I spent the least amount of money and I'm at the highest level. That's -- isn't that nice? Isn't that nice? I remember in New Hampshire, one of our opponents -- I won't mention who, but one of our opponents have spent $48 million in New Hampshire running and I had spent $2 million. And I was No. 1 and the other person was at the bottom of the pack. And I said, who do you want to have as your president? That or this, OK? But that's the way we have to do it. So -- so we spend a lot of money for education and we don't get the bang for the dollar. And we're going to change it around because it's important. I know it's so important to Chris, but -- and you've done a great job in New Jersey with that, but it's so important. So we're going to get it done. Yep. You talk to -- you talked earlier about ISIS. You know, it is very interesting. That is fine. Let him go. They'll go -- he'll go back home to mom and she'll be angry at him. But little Marco Rubio had a -- an event two days ago and he has very small crowds. Right? But he had this small crowd and a guy stood up like that because it happens to everybody. You know, they stand up. That's what they do, and they're disruptors, but they stand up. It happens to everybody. They don't report them when it happens to somebody else. With me, everybody gets reported. They'll say, oh, big deal. So Marco Rubio had a small event and a guy stood up. And I'll tell you, it's on tape. They ripped him down. I'll tell you what, somebody, a security guy, somebody -- they took him and they just ripped him down. Nobody reports that. If I ever did that, I'd be on the front page of every paper in the world. I'm telling you, go take a look at it. It's on Youtube or whatever, but -- but this guy stood up and he said a couple of things and they just ripped him to shreds. It was incredible. Again, I don't do that. I'm a peace-loving person, folks. See, I'm a peace-loving. We love peace. We all love peace, OK? So, anyway, I just want to say there's a very big double standard here. That, that's OK. You talked about our military before and I know that you have serious plans about how to rebuild our military and make America strong again around the world. And people here in North Carolina are real supporters of our military, and they want to -- yup. And they want to hear from you about the kind of commander in chief you'll be for America's military. Well, first of all, we have to make our military -- we have to replenish it because it's suffering from cuts and cutbacks. And, you know, under certain way, folks, it's the cheapest thing we can do because I'm going to make our military so strong, so powerful that nobody's ever even going to talk about messing with us, OK? It's the cheapest thing -- it is -- it is the cheapest thing we can do and we're going to go and we have to get ISIS. We've got to get them out. You know, they're chopping off heads. We're going to get them out. We're going to get them out. We're going to get them out. I mean, just think of the great generals, MacArthur and Patton and some of these great, more modern generals. Think of them -- think of the old-time generals. Think about that. But when you look at what we do, we don't fight. It's almost like we don't fight to win. We don't fight. I've been saying hit the oil, hit the oil for years. Most of you have been listening. And for years I've been saying, take the oil. And they don't do it. They don't do it. Take the oil. Now they only started. You know, after Paris, when Paris was such a horror show, and actually the French -- think of this, when the French hit the oil before we did. But I've been saying that for a long time and I said, look, we shouldn't have gone into Iraq, OK? But once we did, we're there. Take the oil. And, I said, take the oil. For years I've been saying, take the oil and I'll say this, and this is hard to believe, and you'll look it up and maybe it's not even true. But they say the reason they didn't want to hit the oil is they didn't want to pollute the atmosphere, OK? This is a little different. This is -- they don't want to change, you know, the footprint, right? The carbon footprint. And yet he'll fly to Hawaii in a Boeing 747 to play golf. No, he doesn't want to change. He'll have -- he'll have an environmental meeting but he'll fly to play golf in Hawaii on a Boeing 747 with the very old engines that is spewing stuff, and then come back after a long time. I promise you, I will not be taking very long vacations, if I take them at all. There's no time for vacation. We're not going to be big. We're not going to be big on vacation. You know, there's so many things -- just sort of interesting, Chris, the White House is like this incredible place, right? It represents so much and you're there for a limited period of time. If you're at the White House and you have so much work to do, why do you fly so -- why do you leave so much? Why? You know, you'd think you'd want to work, work, work, straighten it out, get it done, fix it up, make it great, and then when you're finished, you can be proud. But boy are we a mess. I've heard you say many times before that as Commander-in-chief, not only you build up the military, give them the equipment they need, buy it in a way that doesn't waste taxpayers money, but also that you're going to have the back of the men and women who are fighting for us. They'll have a plan, you'll support the generals. And I think these folks care a lot about that because they -- it's their sons and daughters who are out there protecting our country and -- tell them about how you're going to have the backs of our soldiers. Well, I'll give you an example. So we send equipment over to the Middle East, it gets taken away. We send it over to our so-called allies that we don't even know who they are, you know, they're fighting. They're fighting against Syria, but we don't know, are we supposed to be fighting Syria because Syria is fighting ISIS. So we're fighting Syria and we're fighting ISIS, but Syria is fighting ISIS and ISIS is fighting Syria. So, anyway, so we give it. We have people -- honestly, they don't have a clue, folks. They don't have a clue. And it's a big mess. It's a big mess and Hillary started this war. Hillary is a disaster, OK? Hillary's a disaster. Just ask Hillary about Libya. You just look at what's happened, OK? But we don't have a clue. And I'll tell you this, look, we send equipment over to people that we think are friends of ours. And a bullet gets fired air, they run away. A friend of mine has a son who's been there for quite a while in Iraq. Been there three times now, and so disgusted. He says the enemy has better equipment than we do. It's our equipment. They take it away. A bullet gets fired in the air. These guys drop the equipment, they run. 2,300 Humvees with all of the heavy armor plate gets taken away. You know how many that is? How many ships you have to send? 2,300 and we -- we're driving in the old stuff without any protection. That's why you have so many wounded warriors where they're just decimated, where the bombs go up and the thing just blows apart and they lose their arms, they lose their legs and worse. So it's going to be a whole different story. And you know, I think one of the things that Chris is alluding to, I'm self-funding my campaign so nobody is going to control me. Nobody. You're going to control me. You're going to control. But -- but what happens is a lot of the equipment we buy, it's not necessarily the stuff that they want. They want certain things and they end up getting things, and you read about it. I've been reading about it since I'm a little boy, actually. You read about it where they're procuring, they're getting equipment because one-man manufacturer has better political connections to like guys like a Rubio or like a Cruz where they have better connections to Washington. And we order equipment that, in many cases, they don't want. And the stuff they want, we don't order because that firm, you know what I'm talking about, that firm is not political or is not strong political. So we're going to get the right equipment. We're going to get the great equipment. We're going to get the stuff the generals and the soldiers want. And we're going to build up our military and we're going to have a really ready and brilliant military that hopefully, we'll never have to use. Look, I didn't want to go into Iraq. I was against going into Iraq. Somebody said, oh, why bring Donald with his -- you know, he's a strong guy with a trigger. Let me tell you something, I'm the least guy in terms of that. But we have to be prepared. We have to be prepared. We're not even prepared. When General Odierno left, he was on one of the shows, which I hate to see that he's on a show, to be honest because I don't like our generals, even if they leave, and being on a show and I didn't like what he said. He said, we're -- we have a level of unpreparedness that he's never seen before. And I think he means going back hundreds of years. I mean, I think he actually was talking about we're the least prepared that the country's ever been. Now, number one, it's good. I like to hear that only from the standpoint that we have to know to fix it. But I hate for the enemies to hear that. You know, when an enemy sitting in other parts of the world, is listening to a general who's leaving talking about how unprepared our country is. That doesn't exactly put us in a position that we want to be. So, anyway, but we are going to take care of our military. We're going to take care of our vets. We're going to really take care of our vets. And there's so many things we're going to be able to do from -- you know our vets wait sometimes, Chris, six, seven days just to see a doctor. Your suicide rate is the highest rate that anybody can even think of. You can't even believe it could be this high. But our vets are being taken care of very poorly. I put it in a plan. And we have a whole big policy plan on the vets. But one of the things we're going to do -- if somebody is going to wait six days to see a doctor, where a simple pill or a shot or maybe a simple procedure can take care of them, instead they're virtually dying -- not going to happen anymore. We're going to get that so that those people could go see a local doctor. Those people can go into a local hospital, they'll take care -- by the way, we'll pay for it. It's going to be much cheaper and people aren't going to be dying. They're not going to be dying. Yup. No, I know -- I know I've heard this and I know you've heard it, too. Hillary Clinton says that there is no crisis at the VA, that there is no problem at the VA. That's -- that's because she doesn't have to go to the VA to get her medical care. But it's just another example of the differences in this election. And as we move now towards the fall election, I think people like to get maybe even just a little preview of how a President Trump would be much different than Hillary Clinton. Well, first of all she did say that. She said there's no problem with the VA and when I said -- when I heard that, it was, to me, incredible. Now, a little bit later then she corrected her statement. But you know what she means. She means there's no problem. Look, she doesn't have the strength and she doesn't have the energy to be president. I can tell you that. There's no -- and I'll say it loud and clear and it doesn't make any difference because you know what, I don't need to be doing this. I honestly -- this is -- people, said why are you doing this? I have this great life. I'm doing it because of the fact that this country has been so good to me and this country is in serious, serious trouble. $19 trillion in debt, soon to be $21 trillion in debt because of the ridiculous budgets that were passed over the last three months. And I'm doing it because I want to. You know, it's called giving back. I am going to -- I am really giving back. I am all over the place. We see -- what I've learned, Chris, the people in our country are unbelievable. And I want to see Apple products made in this country not in China. And we're going to see it. And we're going to say it. So, you know, in case I give all the time as a Carrier and Ford and Nabisco and all these companies that are moving out, you have it too from here, I mean, from North Carolina, your businesses have been devastated by -- right? Is that a correct -- they've been devastated. You know where they've been devastated? By people that are incompetent on trade deals, that -- you people are leaving. You had these great jobs 10 years ago, 20 years ago. You don't have them anymore because they're in different countries. We're going to bring our jobs back, folks. They're coming back to North Carolina. And we're going to bring our jobs back. We're bringing it back. And believe me, and I'm not just playing games, as sure as you're sitting there, your jobs have been taken away. Now the other thing, and reason I think we have this incredible enthusiasm and -- and by the way, Chris, you know, look at Time Magazine, look at -- The Week's just covered it. They say it. I'm saying, it got a lot of reporters back there. It's going to be, you know, affirmed. In the history of our country, nothing like this has ever happened. Where, I mean, you go outside. Seriously, you go outside. You have thousands and thousands of people wanting to come into this auditorium. Thousands of people. We go out to speak. We have crowds that are record-setting crowds like the day before the election and here we are many months away from the election because our people want to see something great happen. They feel it. They can feel it. But -- but the biggest story in all of politics is -- and of all, you know, of all things, Republican. I mean, Republican, that used to be like a word people were thinking obsolete. The biggest story in all of politics worldwide is what's happening to the Republican Party in the United States. The United States has -- we have numbers going and voting in the primaries that are millions and millions and millions of people more. Chris knows it better than anybody. You see it. We have people going out to vote by the millions more. Now the Democrats are down 35% from four years ago. The Republicans -- the Republicans, because who's going to vote for Hillary or Bernie, I mean, there's nothing exciting there. Honestly. You take a look. You take a look at those two. Who is going to vote -- who is going to vote for them? Thank you. And see, that's the reason these people are put here. They're disruptors because the Democrats see what's happening. The Democrats -- this is so important. The Democrats see what's happening. Maybe -- and it's been reported. In the history of our country -- it's a big statement, too and I'm just repeating the press. Nothing like this has ever happened. This is a phenomena. The Democrats are seeing what's happening and they try and disrupt what's happening. But it's not a big deal. They stand up, they shout for a couple of seconds and they get whisked out. Not a big deal, not a big that. But many millions of people, and sometimes I'll be shaking hands or I'll be signing at the front and we do the rope lines, right? But sometimes I'll be signing and so often people will say 40 year old, 50 year old 60, 70, they'll say, Mr. Trump, I've never voted before ever and I'm voting now. I'm telling you this happens like 20 every time I come to a place. It's unbelievable. So we're taking from the Democrats. Remember the Democrats for Reagan? We have it bigger. It's Democrats for Trump. It's a bigger number. So it's Democrats -- we're taking also though from independents, big league, and we're taking from people that have never ever voted before and they're 50 years old, in some cases. And the numbers are astronomical. And who would have thought this is happening to the Republican Party because a lot of people would say, the Republican Party is obsolete. And we do have obsolete people in the Republican Party. We have a lot of leaders that are obsolete because they don't understand what's happening. But I will tell you, off the record, off the record, there are only many cameras back there. But there are a lot of people that are calling me, top people in the Republican Party, and they're calling me and they say we want to get onto this train because this train is unbelievable. They've never seen anything like it. And -- and when we go into an election against, probably Hillary because she's probably going to make it even though she shouldn't be allowed to with the e-mail scandal, shouldn't be allowed to. Look, you know she's guilty. I mean, she's guilty. Was that a protest that I just heard? No. You know, usually, you're better off -- usually about when the protester stands up, usually an individual or two, you're better off just talking right through the protest because it's not a big one. The problem is the audience always turns, there they are, there they are, the suspect. And that you can't talk to, right? Is it true? It is true. But anyway. But I just want to say, there's never been anything like this. It's an incredible thing to see. People in South Carolina that work at the polling booths at the booths. And they'd say, Mr. Trump, I've done this for 30 and 40 years. They said we've never seen crowds like this. Lines that were going a quarter of a mile down the road. They said we'd stand here and there'd be two people walk in an hour. They have lines that are going down the road you wouldn't believe it. And every place is like that, every place is like that. Same thing in Nevada. They said we've never -- a woman came up to me, Mr. Trump, I've done it for 32 years. I've never seen anything like that, the crowds. And it's a great thing to see. And you know, it's really great. People are involved in the process but they see something that really gives them hope. And I'm so proud to be a part of it. I will -- I will tell you it's such -- it's like an amazing feeling to be a part of it. And if the Republican leadership or establishment, if there is such a thing as the establishment, I probably used to be a part of the establishment. This guy would come to my office and say, could I have $350,000 for the Republican Governors Association, right? Yes. Good governors. That's right. He would come to my office like a year and a half, two years ago. So I guess, in a certain way, I was part of the establishment, but I don't even know if there is an establishment. What they have to do is embrace this phenomena and go with it. And we will beat the Democrats and we will beat Hillary who is so flawed. We will beat them so badly. We will win every state. We will beat them so badly. And you know one of the other things that I have to say is, I run against, you know, other people. If I run, we're going to win Michigan. We're going to win New York. We're going to win places like Pennsylvania. We're going to win New Jersey, OK? We're going to win Florida, but we're going to win. We're going to win, Florida -- Florida, we're doing great. You know, we're against a little Marco, but I'll tell you what, we're going to win states that no other candidate could even think about winning. We're going to win. So what the Republican leadership should do is try and unify things. Instead of fighting it, get used to it. This is the most incredible phenomena that they've ever seen in politics in this country. Embrace it, embrace it and let's go win, OK? And you know, one of the things that -- that we've talked about before, I think you can tell a lot about somebody who runs for public office by their family. And I've gotten to know Donald's family, his sister, who's an outstanding federal court judge but I think you tell a lot about somebody and the thing I'm proudest of in my life are my four children. And you look at -- you look at Donald's family, and I want to give you an opportunity because you don't do this enough, I think, to talk about Melania and your children and what kind of father you've been? How proud you are of your children because I think that tells a lot about what kind of person you are by how you treat your children and how they're raised and what kind of home you run. I'd love to have you talk about that. Well, Thank you Chris. It's an honor to talk about them. I have a wonderful wife, Melania, who many of you know. I have wonderful children. I have five children. And you know, a lot of friends -- my children are doing very well. Ivanka and Don and Eric and Barron and Tiffany and they're doing well. And a lot of times a friend will come up and say, do you mind seeing my child? My child's got a problem or whatever and I talk, you know, I'll see the child and they'll have a drug problem or a drinking problem or whatever problem they may have and you know it's interesting, when I won New Hampshire, Chris, the people would tell me in New Hampshire, the biggest problem they have is a problem with heroin. And you don't see it in New Hampshire, you know, the beautiful roads and the beautiful trees. And yet every time that they'd say, you know, that you'd think they'd be talking about like some economic thing which was a problem, but the first thing was always heroin. And they're tremendously -- they have a huge problem with heroin. I said -- and they treated me so great. That was my first win, New Hampshire. And I said if I get in, I'm going to pay back because I said drugs -- drugs is just hurting them so badly. They have so many young kids and some others too, but young, the young people are just being addicted, terribly addicted to drugs. We're going to stop those drugs from coming in. Many of them come from the southern border. And you have the same problem and our whole country has the same problem. And easy way to solve the problem is don't give people access because if they don't start, they never going to have a problem. It's like I don't drink. I don't have any longing to drink or smoke as I never started. If I did start, I'd probably love drinking and I'd love smoking, you know. So the easiest way is not start. Well, we're going to cut it off. We're going to absolutely cut that off. But I say to friends, I say and I used to when my kids were growing up, no drugs no alcohol. You just can't have it. No drugs, no alcohol. And I see -- I see so often, and it's so important, I see so often these brilliant people, they have brilliant kids, they're smart, they go to the best schools, but they start with a drink, you know, they -- and they become alcoholic. And they start with drinking or they start with the drugs and they cannot get off it. They can't wean themselves off, that they worked so hard to do it and they can't. And I say to people just no drugs, no alcohol. I just -- you don't have it. And I add cigarettes when I can. But so, so, so important. And you know, because the world is so competitive. It's so tough that if you have a drug problem or if you have an alcohol problem, it's tough enough now that if you don't have to have that problem because it just puts you at a tremendous competitive disadvantage. So I do, I have wonderful kids. I hope they stay that way. So I knock on wood as I talk about my kids. But I do have wonderful kids and they've been a big help to me. And I know you've been -- you've been putting that message forward for a long time about don't start, don't drink, don't do drugs. But I know that you're someone who knows and has said this before, that when there are people out there who do have that problem, you're someone whose favor of treatment for them. To get them treated and get them the help they need. You got it. You got it. Yeah. And it's not easy and it's not easy. But you've got to start it and you've got to start it as fast as you can. That is something that's very tough. The easy thing is not to start. That's easy, but once you start, you get addicted and it's, it's something that can be handled but you've got to -- you've got to work on it very quickly Yup. Let's -- let's talk about I think something that's really important to people in North Carolina, particularly. People are worried about terrorism and -- and you've had a lot to say on this subject and I think it's something that, no matter where you live, whether you're in North Carolina, whether you live in New Jersey, where -- where I live in New York, where you are, California. No matter where you are. That after we saw what happened in Paris, if we saw what happened in San Bernardino, California that Americans once again, for the first time since September 11th, I think feel really threatened by this. And I think you want to take a tough stand on this and I think it's important for people to know where you stand on fighting terrorism. Well, we have to just -- we have to be so vigilant. We have to be so tough and we can not allow people into our country that we don't know anything about them, we don't know where they come from, who they are. They have no paperwork. They have no nothing. And I hate to be the one to say it, but I'm the one that says it, and it's not politically correct even to say it. But you know, we're allowing people into our country. We have absolutely no idea who they are, where they come from, there's no paperwork, there's no nothing. And this could be the great Trojan Horse, who knows. And we have to be smart and we have to be tough and we have to be less politically correct because that is killing our country. I mean, you see the damage that two young people can do in California. Two young people. She was radicalized. You probably radicalized him. They get married. They have a baby. They kill everybody that they worked with. They gave them baby showers. These people gave them baby showers that they worked with. Supposedly, they had great relations, they go and they kill everybody. We have to be smart, folks. We can't be the stupid people anymore. We have to be smart, OK? That's all. Yup. And I don't want to -- I don't want to neglect Bernie because we got a socialist running on the other side. You're -- you're seen as one of the greatest capitalists in American history. I think this -- I think these people need to know from someone who has done it as well as anybody, why does America have to continue to be a capitalist country and not turn to socialism like Bernie Sanders and Hillary Clinton are talking about? Well, we're sort of turning socialist if you look at what we're doing. And people just don't have the incentive to go out there and do the great job anymore. It's being taken away. That incentive is so important. You know, there's no system like we had. Now, I say, had, because we don't really have that system anymore. Right now we have a different system and we have a series of poor things. We have such, as we discussed, we have such poor healthcare. We have such poor everything. We have no incentives to go out and to do what you want to do. And a guy like, like Bernie Sanders, you know, wants to give everything away. There's only one problem. You can't give everything away because somebody is going to have to pay the bill. And your taxes -- your taxes, I mean, your taxes are going to go up to 95% or something. They were saying that if you were going to do all of this stuff, that somebody is going to pay. It is probably going to be you, folks, OK? Get used to it. But -- but your taxes go up to 95%. It goes -- once you hit 100%, then you go from socialism to communism and then the other things start to happen. Look, look, we've got potentially -- we can be, in my opinion, we can be greater than ever before. We have that potential. The reason I say that Chris, is because I've traveled so much. I've never traveled like this in my life. I mean, I've traveled every day and yesterday I made three major speeches. Today, I'm doing three or four major speeches. I've gotten to know the people. The people of this country are incredible. We have a chance to turn it around. We have a chance -- we're going to -- you're going to get the proper leadership, you're going to get the best people. On trade, we're bringing in the greatest people, the greatest negotiators in the world from Wall Street. I know the good ones, the bad ones, the ones that are overrated. The ones that are underrated that nobody ever heard of. But there's not going to be any more deals with political hacks and dealing with these most brilliant people in China. And then the deals, TPP is a disaster. I mean, you look at the governor of Ohio. He's a disaster, what he's done. He voted for NAFTA. NAFTA has taken a lot of your businesses right out of North Carolina. He's voted for NAFTA and now he wants to vote for TPP, and that's going to be much worse. So look, we are going to do something so special but most special of all we're going to start winning again. We're going to win at every level. We're going to win with our military. We're going to win for our vets. We're going to win with education, knock out Common Core, but we're going to win for -- with education. We're going to win at every level on healthcare. We're going to win at the border. We're going to have the wall, but we're going to win at the border. We're going to win solidly at the border. We're going to win it every facet. We can do that. It's not even going to be that difficult. I will say this. If we have four more years of an Obama person, if we have four more years of Hillary, and you see the way she's embracing Obama. She never used to embrace Obama. She didn't even like Obama. Everybody knows it. Everybody that knows her, she never liked Obama. She never -- she couldn't stand Obama. Now, everything he says, oh, our president said this. Oh, he's so great, he's so great. Why? You know why? I know why. I know why. It's because she wants to keep him nice and happy. Please be happy, Mr. President and please don't do anything bad to me, Mr. President. So, I mean, do you ever see anything like it? She can't stand Obama and all she does is embrace him. Everything he says is fine, fine. So look, and by the way, here's the good news, that's going to kill her in the general election because the last thing our public wants is four more years of Barack Obama. That I could tell you. The last thing. Thank you, everybody. Thank you."}