{"id":426,"author":"Donald Trump","title":"Speech: Donald Trump in Cincinnati, OH","date":"2016-03-13","link":"https://factba.se/transcript/donald-trump-speech-cincinnati-oh-march-13-2016","paragraphs":["And the bad news is, you saw it there are thousands of people outside. I said why didn't we get a bigger place? But who knows? Who knows that this is all going to happen. You know things are going on that are amazing, but I don't know if you saw, I just came here. We drove through thousands and thousands of people, and I feel badly for those people too.","At least, do we have speakers outside, huh? Does anybody know? Do we have speakers outside? They do? Hello, outside. We love you outside. Oh boy, that's a lot of people. I couldn't believe it. But we have that all over. I mean we get these crowds that are incredible. There's tremendous love and there's tremendous everything going on. It's incredible because we're going to take our country back.","We're going to make our country great again. That's what we're going to do. That's what we're going to do. And it's been amazing, what's going on. So we have a big, big, big election. So Tuesday you have to get to the polls, you have to vote. It's so important. You know they're talking -- thank you. And I'll vote for you.","Someday, I vote for you. But we have to do it. Otherwise, we're just wasting a lot of time. Honestly, we just waste time. You know, Ohio has plenty of problems. Believe me. Believe me your real estate taxes are through the roof. And you know what they did is they try not to raise taxes, but they raised everybody's real estate taxes.","So the tax increase is absolutely a disaster, and your governor as you know, voted when he was a congressman, voted for NAFTA which is, which is absolutely -- You know, Ohio has never ever come back from that. And yesterday I was in Cleveland and you had Ford left, and you had Eton left on the other side.","Yes, sit down everybody, What the hell. Just sit down. Sit down. We could be here for a long time. I love it, man. We'll be here for a while. I think I have to come back because in fact, what we're doing -- thank you. No, I have to come back take care of some of those people that -- I feel badly when you have that many people being turned away.","That's -- well, in one way it's good, right? Because it means they love you, and in another way, it's a little bad. Now the other candidates do not have this problem. They have empty seats all over the place, OK? They don't have this problem. So Kasich voted, as you know, for NAFTA and now he wants to vote for Transpacific which is TPP which is going to be worse than NAFTA where all of the things that I've been talking about for years, monetary manipulation.","It's what they do with the devaluation. Makes it impossible for our businesses to compete. All of these countries are going -- believe me China's lurking in the background. They're watching. They're not in it, but they're watching and they're going to go in through the back. In a couple of years, and they'll steal it all.","So you better be careful and I hope they don't approve it. But Kasich is in favor of it. No good. Now today I watched him on television, and I like John, here is a nice guy, but he said did you see some of Trump's speeches? No I haven't seen them. Oh, he's the only person in America that hasn't seen him.","And so he said, did you see him? No. Well, I don't really watch television. When I watch television. I only watch Golf Channel. I don't watch the news. I don't watch sports. I said, wait a minute, we all like Golf Channel too. But you're running for President, the only thing you watch is a television's Golf Channel?","So he's not going to do the job, OK? Not going to do the job. We have so many problems with this country. We have so many problems and we're going to make this country so great, so strong. We're going to build up our military and we're not going to use our military. We're not going to have to use our military.","Hopefully, but nobody's going to mess with us. We're going to take care of our vets. The vets are very important. They're our great people. We've got to take care of our vets, right? These are great, great people. Thank you. I love that sign. Look at that beautiful sign. Thank you. Boy that's incredible.","I tell this story and it's sort of an amazing story, but a very, very good friend of mine is a very successful guy, and he always, I mean always, he hears about -- how many people do you speak in front of today, Donna? Say 21,000 people in Dallas, 35,000 people a couple of weeks ago in Alabama. He said, how do you do that?","This is one of the most successful guys. And I said you know, I don't really know and I'm not a big note person. I don't read speeches because I don't like to. I do, it's easier to read speeches. But you want to put everyone to sleep, just read speeches, right? Plus, you can't comment on things like Golf Channel, you know, with Kasich with Golf Channel.","Because you don't put that in the speech because it's too current. I just heard it a couple of hours ago. But, but he said How do you do it? And I really mean this, there's such love in these stadiums and these rooms, and there's such love. They took this room just very quickly because we just wanted to come up here and say hello.","You know, I used to work in Cincinnati and it's true.","The Queen City. I love Cincinnati. But I worked here and I tell the story, I wrote about it and I think the art of the deal, but I wrote about it. And it was great. Am my right?","And it was a great feeling. My father and I, we bought a job called Swifton Village and it was very sick. It had I think 11,064 units and I spent my entire summers, two summers working, working, working. I loved the job. I loved, I loved Cincinnati I must tell you. I really loved it and we bought it for very little from FHA Federal Housing, and sold it for a big profit.","And we got -- we got out, we sold it and now I know the area hasn't been very good, but at least we're able to protect that. But I tell you it was a great experience. It's sort of like a baseball player gets the first hit or a golfer sings the first three foot putt or something. And it gave you confidence because you know I was very young when I did that job, and it was my baby and it was just an amazing experience and I loved.","I just loved the whole -- the whole deal. And then I -- we also got very familiar with the people of Kentucky. And you know, do we have people? Yeah. But I loved him. And by the way, who won Kentucky recently, right? Right? Trump. So -- but I used to drive as a young guy. I used to drive --","Well, it adds excitement doesn't it, folks? You know you really ask what are they doing, right? What are they doing? It's the same thing everywhere. You know sometimes not so much. We had one yesterday. We had seven or eight incidents where they stand up and they say oh something, and everybody shouts some down, and you know it's fine.","Honestly, in certain ways, in certain ways, it makes it more exciting. OK, to be honest. It makes it more exciting. We might have a couple of more. Anybody else want to stand up right now? So anyways, it's a shame that we wasted two tickets where we have all those great people outside. It's a shame. But I used to, I used to drive to Kentucky.","Friday nights I'd spend time in Kentucky. True. And I just had a great time there. I mean, I love Kentucky and it was so amazing. You know, when I went out and when I did this, I was not supposed to win Kentucky, right? And did I win in a landslide? We won, we won in a landslide. So they must have remembered me in Kentucky when I was young and they said we're going to give him our vote.","But it was amazing. But Ohio is so important. The Tuesday vote is so important because if we can do that I think we're going to do great in Florida. Polls came out in Florida today which are fantastic. Now who knows? Who knows? I mean I think we're going to do very well. Look they have an absentee senator.","He's absentee. Totally. He's got one of the worst voting records in the last 25 years in the Senate. He doesn't vote. You know, they put him in. He's a young guy, they put him in and he goes out -- you know who I'm talking about, right? Who am I talking about? Little Marco. Marco. Marco. Marco. But, but he's -- I think he got a little nasty with me for a while, but that's OK. He got nasty.","They all get nasty and then you end up winning, and you just forget about them. We got nasty with him too. You know in the last debate, my daughter and my wife they said don't, just let him say whatever they want. Let them all say whatever they want. Act presidential. I said, I can't do that. I can't do it. When they come at you, you have to come back.","Don't we agree? I mean, what are you going to do stand there? You can't do it. You have to, you have to hit him back, and you hit him hard enough all of a sudden they collapse. We think of it. Think of it. Every person, we started off with 17. Now we're down to a few and certainly, a couple of getting out very soon.","But including the governor, the governor here didn't win one state yet, and he's not allowed. He didn't qualify. I don't know. Is this a big story. It doesn't seem to be a big story. I don't understand it. He didn't qualify in Pennsylvania. He didn't have the signatures. Does anyone know that?","It was just announced. He didn't qualify in Pennsylvania. So if he doesn't qualify in Pennsylvania, he shouldn't be running on Tuesday, right? I mean, I think. So anyway, hey look that's his problem. Hopefully, we can just beat him. Who cares if he qualifies in Pennsylvania. But, but he is somebody and he's been very nice to me, I've been very nice to him.","But he does this nice, you know, this nice routine. Yeah. I want to be the grown up in the room. I want to be. But he didn't start out that way. Do you remember the first two debates?","He came at me. Oh and I said wait a minute, what's this? And he came at me viciously, and I'm telling you, and that's why I remember because you know, now he's been less, probably six or seven or eight debates. He's been going, well you know, I'm the guy that's the grown up. I want to be really nice. Take a look at the first two bates -- debates.","Remember when I went after him? I said, you ran Lehman Brothers into the ground and it almost destroyed the world. Don't tell me about that. And all of a sudden he sort of shut up, but he was vicious which is OK. You know as a governor, you're supposed to be a little bit vicious, right? But now he's playing the good guy.","And then I had some commercials done in New Hampshire. So I'm up in New Hampshire and I -- which I won also. I love New Hampshire. I love those people. I love New Hampshire. You know the problem, New Hampshire has a big problem and I tell him I'm going to take care of this problem. New Hampshire has a tremendous problem with heroin.","Can you believe it? New Hampshire is such a beautiful place. It's so pristine. So you know the trees and the beautiful little roads and the countryside, and you go into like groups like this, you know large 1,500 people, 500 people. Every single time you ask a group, what's your big problem in New Hampshire?","They say heroin and drugs, and you don't see it. It doesn't go here to, here to, here to, all right, here to. Oh, we're going to build a wall, folks. Don't worry about it. We're going to build a wall. Think of it. We get the drugs, they get the money. Not a good deal, right? Not a good deal. Now we're going to build a wall, and Mexico is going to pay for the wall.","It's very simple. Look here's the story. Here's the story. Mexico. Mexico is going to pay $58 billion in trade. This our imbalance, $58 billion a year. That's our imbalance. People don't know that. And these senators come up Marco and lying Ted. You know lying Ted? He walks in, holds up the Bible and I'm beating him, I'm just killing him with Evangelicals because --","They don't like liars. They don't like liars. He comes in with the Bible, holds it up high, puts it down and then he lies. I mean, I call him the lying Ted. And you know why he hasn't -- he was supposed to win South Carolina because I think it's 68% Evangelical. And Trump got the Evangelicals, and that was the day after the Pope scolded me. But the Pope was told by Mexico that Trump wants to stop the border, and the Pope didn't like that.","And the Pope really, I said you know, sort of interesting. So I'm getting ready, they're getting ready for the vote in South Carolina, and my people come up, Mr. Trump we have a problem. This is the day before the vote. And I say, what's the problem? They said it's the Pope. I said the Pope? I said that's a big problem, right?","The Pope, I like the Pope. I do like the Pope. I said Why? What did I do with the Pope? I said let me ask you, is it a good thing or a bad thing? They said, not good. So the Pope hit me because he didn't like the fact that we're going to close up the borders, and people are going to come in, but they're going to come in legally.","They've got to come in legally. OK. So and the drugs that are poisoning our youth they're not coming in, folks. They're not coming in. So anyway, OK. That's a long shot. So I got this thing and they say the Pope, and because he was with Mexico, and I like Mexico, and I have a lot of respect for their leadership, much smarter than our leadership.","And that's why I mean, we can't make good deals because our leaders are not smart when it comes to trade. Minor things like trade, military, healthcare, common core, all these things. You know, they're not too good in any of it, OK? They're not good at anything. You want to know the truth. But so I get a call saying the Pope.","So then I sort of -- the Pope was sort of angry because he was told by Mexico that I wanted closed borders. The pope didn't know that tremendous crime is coming across the border. That drugs are pouring across the border -- border and, and just didn't know. I mean he went -- and the next day he was so nice.","The next day, the Pope was so terrific, and he did something, he issued something. I don't think it was exactly an apology, I don't want an apology, but he was great. We went to the polls and I won South Carolina in a massive landslide and lying Ted got very few votes, and that was supposed to be his -- that was supposed to be his deal.","But people don't know. They just don't like it when people like -- you remember with Ben Carson, by the way, who endorsed me yesterday? This is great. And remember in Iowa where Ben Carson was running, and you know, all of a sudden the rumor was going out all over that he left the race. He didn't leave the race.","Lying Ted said he left the race. He's not good and so vote for him, and you can't do that. You know you can't do that. And then right after the election, he went and apologized to Ben. A lot of good that does. They should have disqualified him. You want to know the truth. They actually should have disqualified him and they had it down many different ways.","So anyway, so we're going to run and we're going to do some incredible things, and we're going to bring our country back, and we're going to bring it back in every aspect. And frankly, Hillary's a disaster by the way, you know that, a disaster. And despite all of the stuff you see with Bernie, Bernie, Bernie is not a second of me. Bernie is going to be all right.","But unless, unless the FBI does its thing because he's got a problem. Anybody else, look at all the people that were so badly hurt by doing much less than she did including General Petraeus, a good guy destroyed. He was destroyed for doing much less than what she did. So let's see what happens. I'm sort of predicting that certainly, they would have done it already if they're going to do it. How can they let her run and then all of a sudden do it. So let's see what happens.","But I know she's probably doing OK. Did you ever see anybody embrace President Obama like she's embracing him? Oh the president is great. He's great. We love this plan. We love that plan. We love everything. She loves everything. TPP interestingly, she originally liked it. Now she doesn't like it. She wants you know -- and then if he wants it, she's going to want it again.","So I don't know what his -- if you know his position. You know his position is I like it. So I assume she likes it because everything that he wants. Now why is she being so nice to the president? You know, they didn't like each other for years, right? So why? Do you know?","That's right. That's right.","Yeah. For, for him?","Oh, that's interesting. That's right. You know, he might just executive order himself into that position. You never know. You never know. I mean, nobody ever heard of executive orders until this guy came along and he -- you know he doesn't do it when you get a group of people in the room, and you make the deals, and he always make good deals for your side, but you make like Ronald Reagan and Tip O'Neill.","But anyway, so look we have so many problems. One of the problems actually is that problem Supreme Court. If a Democrat gets in, you already lost. In losing Scalia, that was a terrible thing because he was a great guy. But nobody ever thought, nobody ever thought that was going to happen. I mean it came out of the blue.","They were thinking others that were older, and they were thinking others all of us. And that's the way life is. Things happen. You have no idea it's going to happen. That's the way life is. So we love Scalia. So now whoever the new President is could actually get up to four and maybe even five Supreme Court justices.","So let's assume that Hillary gets in and she's going to put, well no. No, If you don't and I'll tell you what. I'll tell you what, a guy like Ted Cruz can never beat her in the general election. Never in a million years, will never beat her. But she gets it. She's going to appoint four or five judges. You will never as a country recover from that.","That's one of the most important things. In fact, some people are angry. You know I used to be establishment. I was a big contributor and all that stuff, and then all of a sudden I said run. And they said Donald's running? He's not going to want our money. And if he doesn't want our money, he's not going to listen to us. I'm self funding my campaign, folks and they're not happy about it. They are not happy about it because when the pharmaceutical companies which give millions and millions of dollars to these centers, when all these went all these people, and all these companies, you know, they give it to the lobbyists, and through the lobbyists and the special interests, the pharmaceutical companies, you look at oil and gas, everything.","Everything is controlled in Washington. So when I said I'm running. How -- when was the last time you saw somebody run where they said I'm self funding? Did you ever remember anybody? No, no. Did you ever remember? In Washington, they have lobbyists and they have like Rubio up on their forehead, it's emblazoned.","I take care of Rubio. I take care of Cruz. They have these people, their lobbyists, they're very good. You got to pay them a lot of money and they go in, and they get you what you need. You know usually, usually they get you what you need. But these guys are totally controlled like the drug industry does very little bidding.","They bid like you know, they get like if you go to the drugstore and buy drugs, drugs to make you better, right? I mean, you're paying the same price. The United States is the largest drug buyer in the world. When you think we'd be able to buy pretty well, we don't buy. We don't bid. And then you look at it you know, people like Woody Johnson of Johnson & Johnson was in charge of Jeb Bush's campaign.","So what would happen if Jeb got in? Jeb didn't make it. I guess you probably heard that tepid. But he says low energy. We don't need low energy, folks. We need very strong energy. When you see China, when you see the way I've done a great deals with China. I made a lot of money with China. When you see China coming at you and you see Japan coming at you, and you see Mexico, you saw Vicente Fox the other day, right?","Where he used the F-bomb, nobody reported it. They didn't care if he used the F-bomb. Can you imagine if I said what he said? I told people this morning, it would be the electric chair. I wouldn't be here right now. It's true. But he said, we will not pay for the wall which made me actually happy because two years ago he said, we won't allow a wall to be built.","So now we've already got the first, he's allowing a wall. But he said, we will not pay for the you-know-what wall, right? And they're going to pay. And the reason they're going to pay, very simple. With the kind of money that we lose on Mexico in trade with a trade imbalance. When you have a trade imbalance of $58 billion a year, a $10 billion wall is peanuts, right?","So when these guys come off the stage, you don't really mean that Mexico's going to pay for the wall? I say, of course, they're going to pay for the wall. But Vicente Fox was so angry when he did that interview. I don't know. I think it was with CNN. Was it with CNN? Oh back there, look at them. What a lot of --","The most is that -- you know who's really dishonest? The New York Times. They write stories and never even call me. You don't even have -- they write stories, they're so inaccurate. They don't care. It's a badly run newspaper. It's a horrible -- it's failing. It's going to be -- well, it'll either be out of business or a very rich person will buy it, and just have it as a lava layer.","But the New York Times is the worst newspaper. They do a big story. They won't even call you for a comment. They don't care. And when you call them because you want to comment, like I had a person recently for something call. No, we don't want your comment. We don't want a comment. They write a story, then it's all wrong.","And they couldn't care less if it's wrong. That's why I said, we have to do something with the libel laws, folks. You have to -- when you libel, you have to be able to go and sue a newspaper, and get them to change, and in addition to that get some money. Now that's not freedom of speech. That's not to change.","All we want is for them to be honest. But when you have a dishonest newspaper like The New York Times, you have to be able to sue them. You have to be able to do it because that level of dishonesty, and that's what I talk about so many of them. But the level of dishonesty of the press is beyond belief. Far greater than you would ever think.","Believe me because you don't see it as much. I see it. I see it. They do stories that are so bad, that is so wrong, and knowingly wrong, they do it for headlines. They do it for whatever, and they're all having a hard time, you know, they're losing money. But, but a lot of them are losing money because people have given up on them.","Like for instance, I go around and whenever I talk about the media, the place always stands up and boos the hell out of the media. They're less popular than politicians which is pretty amazing when you think of it. So so this forum is really cool. I haven't done this in a while. I love doing this. I love this forum.","The problem is you don't get that many people in the room. That's you know, it's got to be a little more intimate. But I love doing this forum. So what I want to do is we'll take some questions and then I'm going to come back because we're going to have to do a much larger room because I feel so guilty about what we have over there.","I mean really feel guilty about all the people outside, many of whom we told to just leave or come back. Even if I come back after the election, I'm coming back. OK? Well, let me put it this way. Let me put it this way. If I win, I know I'm coming back. If I lose, yeah, maybe not. OK. Go ahead. Nice hat.","Cincinnati, oh we love Cincinnati. What do you think, hey, by the way, Pete let him in, right?","What are they doing?","You know, before you start, wait. Charlie Hustle, right? So I watched him and I -- he was a great player and it's so ridiculous. Don't you think he's paid the price? First of all. He didn't bet on his -- he bet that he would win. Not on the other team or anything, right? But look, he's not supposed to do it. It's a terrible thing.","All that stuff. How long has he been waiting like 30 years, like 35 years. He's got more hits than anybody. He was so good. I still remember when he went into second base and he took out Doug Harrelson, right? Right? That was the name of the second baseman. Good. That means it's still good. But you know.","We got to let Pete Rose into the Hall of Fame. And you know, you know, Charlie Hustle. If I were the commissioner, honestly, I would do it. He would be so popular. I have never met a group, even people that just used to root against him which was hard to do because he was really good. But even people that used to root against him did say let him in. And I don't know what Major League Baseball is doing, but who cares.","But let Pete Rose into the Hall of Fame. Do you agree with that? Better agree. OK, go ahead. This guy agrees, I can tell you with that hat on.","Thank you.","Unbelievable.","Were they here before you?","Right? That's pretty good.","I'll do that. I'll do it.","OK. Thank you. Go ahead. Right over here.","Where? where?","Oh, hey Keith.","A lot of courage, right?","More than anybody.","John McCain has not helped a lot of people like he should that I can tell you. It's true. Go ahead. How are you doing? How are you?","Nice to see you. Go ahead.","OK.","Oh no, no, no, no. I was. I never did that. You know that.","OK, go ahead.","OK.","Yeah.","You know exactly what I was doing.","But they argued, just so you understand and real heroes, OK? You know that. Thank you. Oh, that's for me. Wow, Thank you. Very nice. I like that. Thank you. You know that, OK?","Thank you very much. Appreciate it. OK. Who else? Go ahead. Go ahead.","OK.","You're talking at the VA?","Right.","It's true.","OK. Well, so that is such a big problem. And I hear from so many different people. And also I mean, the big problem is with the VA. It's horribly run. It's a corrupt enterprise. It's really corrupt. And you look at what's going on in Phoenix with the VA, it's a disaster, a complete disaster. We're going to take care of the problem.","They are having a tremendous problem with that. I fully know it. I fully understand it. We're going to do something about it. We have no choice. We have to do something about it. The truth is we have to treat our veterans much, much better. Our veterans are not being treated well, right? Thank you, man. Thank you.","How about -- how about over there, the young man in the middle. Go ahead.","You get up together? Good. I like that. Do you know each other?","Oh, good. Was it good? Was it good?","Yeah, that was nice. That was great rally.","Well, you know interestingly, we have a lot of young people. They don't talk about it. We have -- you saw yesterday and you see all the time, and yourselves. We have so many young people at these rallies it's incredible. Look even here, look at this. Look at all these. Stand up all you young people. Now look at -- now we have.","I would bet you and you know, I would, I would seriously think we have as many young people at least as Bernie. We have so many young people at our rallies, and it actually surprises me to a large extent. So you're talking about the 17, you're voting for Trump, right? You're OK with me. You are OK with me. You can vote for me anytime.","So what's going to be the problem. Go ahead.","Do I support?","Well, I have to look at the decision darling. Honestly, I have to look at it. You tell me what to do. You're with me. You're working with us. You're a volunteer. What do you want me to do?","Ahh, we love you. Thank you, honey. Thank you. Thank you. OK. Go ahead. A young one here, a young one. You are young. How old are you?","Wow, that's beautiful. So many young people, so many young people. Go ahead.","No. 1, your country is going to be safe because you know if you don't have a safe country and with people that aren't very good at what they do, like the people running our country now, you might very well, and don't underestimate this, you might very well not have a safe country. And it's so important. You know No. 1, the No. 1 thing we have to do is security, safety, and I'm not just talking at the border.","I'm talking about our military. We have to build it up. We have to replenish it. You know, a friend of mine has a son who is in -- he's served three terms over in Iraq, three tours and he comes home, and I see him. And his biggest complaint is that the enemy has better equipment than us, and it's our equipment.","So we give the equipment to people that we think are working with us. You know the old story's been going on for years and the bullets fired in the air, they dropped the equipment and run. Brand new Humvees, brand new everything. And he's saying we have older equipment and they have beautiful new stuff. And it really bothers the hell out of them.","So we're going to take care of that, folks. We're going to take care of it. We're not going to let this kind of nonsense happen anymore. We're going to work very hard on education. Just so you understand, Common Core is dead. You know what Common Core is? And most importantly, most important thing we can do in terms of education for you and your age.","We're getting education out of Washington D.C. run by the bureaucrats, and we're going to bring the education to the local area. You around this area? We're going to bring the education where your mother and your father, and everybody else's parents and uncles are there. They, they, they love. They love you.","Do you think your parents love you, huh? They run it with love, OK? In Washington, and look not everybody's bad, but you basically have bureaucrats they want to make -- you know they get a lot of money, and they don't know what's going on in Cincinnati and they don't know what's going on in Ohio. So we're getting rid of Common Core and it's going to be dead, and we're going to have local, locally based education.","And you're going to see a big difference. Big difference. All right. Very important. Good question. It's actually a great question. OK. How about over here. What about you, right there red?","Thank you. Thank you.","That is definitely true. That is --","Aww, thank you so much. That's better than a question. I love it. We'll take care, OK? Thank you. Thank you, whole family. Now that was such a great thing that happened in Kentucky because in theory, people would say you know, what? How does Trump, a couple of people said, how did Trump win Kentucky? And we didn't even win it. We won in a major, major landslide.","And I love Kentucky, I'll never forget it. OK. Go ahead, darling. Right here. Right here.","I love this every once in a while you know say I'm saying?","Thank you. Where are you from with that beautiful accent?","I'm telling you, the hispanics.","We're going to do so well with Hispanics.","People know.","Thank you, darling. That was so nice. Wow, thank you, darling. That was so nice. That was -- come here. Get over it. That was so nice. Come here. That was so nice. Thank you very much.","Thank you very much. That's so nice. Thank you. OK, who has a good question? Who has a good one? Let's go. Let's go. We've got to go here. Go ahead. The big strong guy here.","Go ahead. Just got out of football practice.","So you know there's a 6-year statute of limitations, I guess. And Hillary's fighting for a lot. Yeah, if she makes it. Nothing's going to happen if she doesn't make it. Certainly, you have to look into it and you have to look into it very strongly because so many lawyers whether you watch him on television, whether you read them in the newspapers, whether you see them wherever you see them.","I mean, very rarely do you see a lawyer that says that she's innocent of this this horrible situation. And you actually have to ask yourself why'd she do it? What's the big deal? Why would she do it? Why would she do that other than it's always the same thing with them. It's sneaking around the corner, it's sneaky, dirty stuff.","It's gone on like that for years. It's gone on like that for years. So I will tell you, you know No. 1, it's not me, but certainly, people are going to look and you know what, if there's anything wrong and you have to do it, you have to do that. You have to do that because so many people have asked me that same question and you have no idea, and she's being protected.","Look, let's face it. Look, it's not complicated. What she did certainly to me is certainly, she broke the law to me, what do I know? To me she broke the law and it looks so bad from the standpoint of the rest of the country and even from the standpoint of all those people that did something much less. So many people did something much less.","How do you think they feel? How do you think Petraeus feels? How do you think all these other people feel? And here she is she's got a clear path to running for president. But you know what? The first thing I have to do with Hillary is beat her. The next thing we'll do is we'll look into that, OK? And we'll beat her.","We'll beat her. And you know it's interesting, we haven't even started on her yet. I'm going to finish off the -- we have to finish off the deck. We have to finish off the deck. And the best thing you could do honestly. Your governor, remember NAFTA. Get rid of this -- look, just get rid of letting him be governor.","One other thing about him. He runs for president. He's lived in New Hampshire forever. He said there he had the record, more than Chris, more than anybody by far. He lived in New Hampshire. He moved out of the state and he said he was going to win New Hampshire. He did poorly there. He then moved to -- right?","South, didn't he? I mean he didn't -- I think he went to South Carolina and then he moved to Michigan. Now he said I thought, and I must be mistaken, but he said that he's going to win Michigan, and he's going to win it easily. I won it in a landslide. But he said he's going to win Michigan. He's going to win it easily.","So he went to South Carolina, he stayed there. Lost. Lost in New Hampshire. He went to Michigan and I thought he said because it's a neighboring state. I thought he said he would win Michigan and if he didn't win, he'd give up and let him be a governor. But he moved to Michigan spent all his time in Michigan.","And you know you people have a lot of problems. You call industrious dead, your steel industry is dying, it's dying badly. He's voting for the wrong things and the TPP in particular. And you know he should be home be governor, but he moved to that. So now he goes to Michigan and two weeks ago, I won Michigan by a lot.","By like a landslide, essentially. Yeah, a landslide. And when I won Michigan I said, oh good. Kasich is going to drop out of -- he's going to drop out of Ohio and that's good. But he didn't drop out. So you know, I think you got to show him, folks. You can't do that. You can't be an absentee governor. You got to run for governor, you got to be governor.","And you know what? If you don't want to do that you take out and same thing with Marco Rubio, he runs for the Senate, he never shows up to vote. The guy never shows up to vote, and the people of Florida you don't think they get it? Take a look at his poll numbers. They really get it because what he did to the people of Florida is defraud them.","He said I'm going to run. I'm going to represent you. I'm going to represent you, and about 15 minutes after he got in he starts running for president. That is wrong. And by the way, other people running for president they get to vote a lot more than he does. He never votes. Think he's going to set an all time record.","So let's see what happens. But we got to win in Ohio. If we can win Ohio, we're going to run the table, folks. We're going to run the table. Had a winner in Ohio. Go ahead, give her that mic. You just shout it out. Go ahead.","Yeah. Go ahead.","That's great by the way. That's --","A lot of people are in there saying they want to retire. They're afraid that they're not going to have anything to go by. They think their insurance companies are going bust. They think -- a lot of, a lot of problems. Look what's happened with the stock market going down. Did you get affected by that? By the stock market going down?","In terms of values you've been affected. A lot of people have been affected. So go ahead what's your question?","we're going to make this country so strong. We're not going to stand for losing $500 billion a year with China, for losing $58 billion with Mexico, for losing hundreds with Japan. We're going to make our country strong again. You know our military. OK. Our military, everyone sees our military budget. They don't realize we take care of Germany.","Nobody even probably knows that. We take care of Japan. You know that if we're attacked -- we have a treaty with Japan. If we're attacked, Japan doesn't have to help us. If Japan gets attacked, we're in third world -- we're in the third world war. We have a new war going on, OK? Now what kind of deals are these?","What kind of deals? But we take care of Japan. We take care of South Korea. I love all these countries. I think it's great, except we owe $19 trillion. Can't do it. We got to be reasonable. We can't do it. So we're taking care of South Korea. When the maniac next door acts up, we start up those battleships, we start up those aircraft carriers, let's say, and we start up, you know, our planes are flying.","We spend millions and millions of dollars. They don't pay us. They pay us very little. You know in South Korea and I love South Korea. I have buildings in South Korea. We have and they're great people. We have a border in South Korea. We have 28,000 soldiers. What they pay us is peanuts. What Japan pays us is peanuts.","So we protect the world. Saudi Arabia is the greatest of them all. So we protect Saudi Arabia until the oil went down and now they're making half which is still a lot, but until the oil went down Saudi Arabia was making $1 billion a day, right? We protect them. We protect them, and we protect them for peanuts.","So all of that stuff is going to change, folks. We're going to end up with a strong country again, a powerful country, and we're going to end up with a respected country again because we're not respected. We're not respected. All right. Two more questions, come on. Two more questions. And what's your question?","We are going to save the Second Amendment, Roger.","Throw it. Throw it.","Yeah. Give it to me.","OK. Get me that card would you, please.","Get me the card.","So you endorsed me?","I heard about that. I heard about it. Thank you.","I'm glad I told him to stay.","And the bad news is, you saw it there are thousands of people outside. I said why did we get a bigger place? But who knows? Who knows that this is all going to happen. You know things are going on that are amazing, but I don't know if you saw, I just came here. We drove through thousands and thousands of people, and I feel badly for those people too.","At least, do we have speakers outside, huh? Does anybody know? Do we have speakers outside? They do? Hello outside. We love you outside. Oh boy that's a lot of people. I couldn't believe it. But we have that all over. I mean we get these crowds that are incredible. There's tremendous love and there's tremendous everything going on. It's incredible because we're going to take our country back.","We're going to make our country great again. That's what we're going to do. That's what we're going to do. And it's been amazing, what's going on. So we have a big, big, big election. So Tuesday you have to get to the polls, you have to vote. It's so important. You know they're talking -- thank you. And I'll vote for you.","Someday I vote for you. But we have to do it, otherwise, we're just wasting a lot of time. Honestly, we just waste time. You know Ohio has plenty of problems. Believe me. Believe me your real estate taxes are through the roof. And you know what they did is they try not to raise taxes, but they raised everybody's real estate taxes.","So the tax increase is absolutely a disaster, and your governor as you know, voted when he was a congressman, voted for NAFTA which is, which is absolutely -- You know Ohio has never ever come back from that. And yesterday I was in Cleveland and you had Ford left, and you had Eton left on the other side.","Yes, sit down everybody, What the hell. Just sit down. Sit down. We could be here for a long time. I love it, man. We'll be here for a while. I think I have to come back because in fact, what we're doing -- thank you. No, I have to come back take care of some of those people that -- I feel badly when you have that many people being turned away.","That's -- well, in one way it's good, right? Because it means they love you, and in another way, it's a little bad. Now the other candidates do not have this problem. They have empty seats all over the place, OK? They don't have this problem. So Kasich voted as you know for NAFTA and now he wants to vote for Transpacific which is TPP which is going to be worse than NAFTA where all of the things that I've been talking about for years, monetary manipulation.","It's what they do with the devaluation. Makes it impossible for our businesses to compete. All of these countries are going -- believe me China's lurking in the background. They're watching. They're not in it, but they're watching and they're going to go in through the back. In a couple of years, and they'll steal it all.","So you better be careful and I hope they don't approve it. But Kasich is in favor of it. No good. Now today I watched him on television, and I like John, here is a nice guy, but he said did you see some of Trump's speeches? No I haven't seen them. Oh, he's the only person in America that hasn't seen him.","And so he said, did you see him? No. Well, I don't really watch television. When I watch television. I only watch Golf Channel. I don't watch the news. I don't watch sports. I said, wait a minute, we all like Golf Channel too. But you're running for President, the only thing you watch is a television's Golf Channel?","So he's not going to do the job, OK? Not going to do the job. We have so many problems with this country. We have so many problems and we're going to make this country so great, so strong. We're going to build up our military and we're not going to use our military. We're not going to have to use our military.","Hopefully, but nobody's going to mess with us. We're going to take care of our vets. The vets are very important. They're our great people. We've got to take care of our vets, right? These are great, great people. Thank you. I love that sign. Look at that beautiful sign. Thank you. Boy that's incredible.","I tell this story and it's sort of an amazing story, but a very, very good friend of mine is a very successful guy. And he always, I mean always he hears about -- how many people you speak in front of today, Donna? Say 21,000 people in Dallas, 35,000 people a couple of weeks ago in Alabama. He said, how do you do that?","This is one of the most successful guys. And I said you know, I don't really know and I'm not a big note person. I don't read speeches because I don't like to. I do, it's easier to read speeches. But you want to put everyone to sleep, just read speeches, right? Plus, you can't comment on things like Golf Channel, you know, with Kasich with Golf Channel.","Because you don't put that in the speech because it's too current. I just heard it a couple of hours ago. But, but he said How do you do it? And I really mean this, there's such love in these stadiums and these rooms, and there's such love. They took this room just very quickly because we just wanted to come up here and say hello.","You know I used to work in Cincinnati and it's true.","The Queen City. I love Cincinnati. But I worked here and I tell the story, I wrote about it and I think the art of the deal, but I wrote about it. And it was great. Am my right?","And it was a great feeling. My father and I, we bought a job called Swifton village and it was very sick. It had I think 11,064 units and I spent my entire summers, two summers working, working, working. I loved the job. I loved, I loved Cincinnati I must tell you. I really loved it and we bought it for very little from FHA Federal Housing, and sold it for a big profit.","And we got -- we got out, we sold it and now I know the area hasn't been very good, but at least we're able to protect that. But I tell you it was a great experience. It's sort of like a baseball player gets the first hit or a golfer sings the first three-foot putt or something. And it gave you confidence because you know I was very young when I did that job, and it was my baby and it was just an amazing experience and I loved.","I just loved the whole -- the whole deal. And then I -- we also got very familiar with the people of Kentucky. And you know, do we have people? Yeah. But I loved him. And by the way, who won Kentucky recently, right? Right? Trump. So -- but I used to drive as a young guy. I used to drive --","Well, it adds excitement doesn't it, folks? You know you really ask what are they doing, right? What are they doing? It's the same thing everywhere. You know sometimes not so much. We had one yesterday. We had seven or eight incidents where they stand up and they say oh something, and everybody shouts some down, and you know it's fine.","Honestly, in certain ways, in certain ways, it makes it more exciting. OK, to be honest. It makes it more exciting. We might have a couple of more. Anybody else want to stand up right now? So anyways, it's a shame that we wasted two tickets where we have all those great people outside. It's a shame. But I used to, I used to drive to Kentucky.","Friday nights I'd spend time in Kentucky. True. And I just had a great time there. I mean, I love Kentucky and it was so amazing. You know when I went out and when I did this, I was not supposed to win Kentucky, right? And did I win in a landslide? We won, we won in a landslide. So they must have remembered me in Kentucky when I was young and they said we're going to give him our vote.","But it was amazing. But Ohio is so important. The Tuesday vote is so important because if we can do that I think we're going to do great in Florida. Polls came out in Florida today which are fantastic. Now who knows? Who knows? I mean I think we're going to do very well. Look they have an absentee senator.","He's absentee. Totally. He's got one of the worst voting records in the last 25 years in the Senate. He doesn't vote. You know they put him in. He's a young guy, they put him in and he goes out -- you know who I'm talking about, right? Who am I talking about? Little Marco. Marco. Marco. Marco. But, but he's -- I think he got a little nasty with me for a while, but that's OK. He got nasty.","They all get nasty and then you end up winning, and you just forget about them. We got nasty with him too. You know in the last debate my daughter and my wife they said don't, just let him say whatever they want. Let them all say whatever they want. Act presidential. I said, I can't do that. I can't do it. When they come at you, you have to come back.","Don't we agree? I mean, what are you going to do stand there? You can't do it. You have to, you have to hit him back, and you hit him hard enough all of a sudden they collapse. We think of it. Think of it. Every person, we started off with 17. Now we're down to a few and certainly, a couple of getting out very soon.","But including the governor, the governor here didn't win one state yet, and he's not allowed. He didn't qualify. I don't know. Is this a big story? It doesn't seem to be a big story. I don't understand it. He didn't qualify in Pennsylvania. He didn't have the signatures. Does anyone know that?","It was just announced. He didn't qualify in Pennsylvania. So if he doesn't qualify in Pennsylvania, he shouldn't be running on Tuesday, right? I mean, I think. So anyway, hey look that's his problem. Hopefully, we can just beat him. Who cares if he qualifies in Pennsylvania. But, but he is somebody and he's been very nice to me, I've been very nice to him.","But he does this nice, you know this nice routine. Yeah. I want to be the grown up in the room. I want to be. But he didn't start out that way. Do you remember the first two debates?","He came at me. Oh and I said wait a minute, what's this? And he came at me viciously, and I'm telling you, and that's why I remember because you know now he's been less probably six or seven or eight debates. He's been going, well you know, I'm the guy that's the grown up. I want to be really nice. Take a look at the first two bates -- debates.","Remember when I went after him? I said, you ran Lehman Brothers into the ground and it almost destroyed the world. Don't tell me about that. And all of a sudden he sort of shut up, but he was vicious which is OK. You know as a governor, you're supposed to be a little bit vicious, right? But now he's playing the good guy.","And then I had some commercials done in New Hampshire. So I'm up in New Hampshire and I -- which I won also. I love New Hampshire. I love those people. I love New Hampshire. You know the problem, New Hampshire has a big problem and I tell him I'm going to take care of this problem. New Hampshire has a tremendous problem with heroin.","Can you believe it? New Hampshire is such a beautiful place. It's so pristine. So you know the trees and the beautiful little roads and the countryside, and you go into like groups like this, you know large 1,500 people, 500 people. Every single time you ask a group, what's your big problem in New Hampshire?","They say heroin and drugs, and you don't see it. It doesn't go here to, here to, here to, all right, here to. Oh, we're going to build a wall, folks. Don't worry about it. We're going to build a wall. Think of it. We get the drugs; they get the money. Not a good deal, right? Not a good deal. Now we're going to build a wall, and Mexico is going to pay for the wall.","It's very simple. Look here's the story. Here's the story. Mexico. Mexico is going to pay $58 billion in trade. This our imbalance, $58 billion a year. That's our imbalance. People don't know that. And these senators come up Marco and lying Ted. You know lying Ted? He walks in, holds up the Bible and I'm beating him, I'm just killing him with Evangelicals because --","They don't like liars. They don't like liars. He comes in with the Bible, holds it up high, puts it down and then he lies. I mean, I call him the lying Ted. And you know why he hasn't -- he was supposed to win South Carolina because I think it's 68% Evangelical. And Trump got the Evangelicals, and that was the day after the Pope scolded me. But the Pope was told by Mexico that Trump wants to stop the border, and the Pope didn't like that.","And the Pope really, I said you know, sort of interesting. So I'm getting ready, they're getting ready for the vote in South Carolina, and my people come up, Mr. Trump we have a problem. This is the day before the vote. And I say, what's the problem? They said it's the Pope. I said the Pope? I said that's a big problem, right?","The Pope, I like the Pope. I do like the Pope. I said Why? What did I do with the Pope? I said let me ask you, is it a good thing or a bad thing? They said, not good. So the Pope hit me because he didn't like the fact that we're going to close up the borders, and people are going to come in, but they're going to come in legally.","They've got to come in legally. OK. So and the drugs that are poisoning our youth they're not coming in, folks. They're not coming in. So anyway, OK. That's a long shot. So I got this thing and they say the Pope, and because he was with Mexico, and I like Mexico, and I have a lot of respect for their leadership, much smarter than our leadership.","And that's why I mean, we can't make good deals because our leaders are not smart when it comes to trade. Minor things like trade, military, healthcare, common core, all these things. You know they're not too good in any of it, OK? They're not good at anything. You want to know the truth. But so I get a call saying the Pope.","So then I sort of -- the Pope was sort of angry because he was told by Mexico that I wanted closed borders. The pope didn't know that tremendous crime is coming across the border. That drugs are pouring across the border -- border and, and just didn't know. I mean he went -- and the next day he was so nice.","The next day, the Pope was so terrific, and he did something, he issued something. I don't think it was exactly an apology, I don't want an apology, but he was great. We went to the polls and I won South Carolina in a massive landslide and lying Ted got very few votes, and that was supposed to be his -- that was supposed to be his deal.","But people don't know. They just don't like it when people like -- you remember with Ben Carson, by the way, who endorsed me yesterday? This is great. And remember in Iowa where Ben Carson was running, and you know, all of a sudden the rumor was going out all over that he left the race. He didn't leave the race.","Lying Ted said he left the race. He's not good and so vote for him, and you can't do that. You know you can't do that. And then right after the election, he went and apologized to Ben. A lot of good that does. They should have disqualified him. You want to know the truth. They actually should have disqualified him and they had it down many different ways.","So anyway, so we're going to run and we're going to do some incredible things, and we're going to bring our country back, and we're going to bring it back in every aspect. And frankly, Hillary's a disaster by the way, you know that, a disaster. And despite all of the stuff you see with Bernie, Bernie, Bernie is not a second of me. Bernie is going to be all right.","But unless, unless the FBI does its thing because he's got a problem. Anybody else, look at all the people that were so badly hurt by doing much less than she did including General Petraeus, a good guy destroyed. He was destroyed for doing much less than what she did. So let's see what happens. I'm sort of predicting that certainly, they would have done it already if they're going to do it. How can they let her run and then all of a sudden do it? So let's see what happens.","But I know she's probably doing OK. Did you ever see anybody embrace President Obama like she's embracing him? Oh, the president is great. He's great. We love this plan. We love that plan. We love everything. She loves everything. TPP interestingly, she originally liked it. Now she doesn't like it. She wants you know -- and then if he wants it, she's going to want it again.","So I don't know what his -- if you know his position. You know his position is I like it. So I assume she likes it because everything that he wants. Now why is she being so nice to the president? You know they didn't like each other for years, right? So why? Do you know?","That's right. That's right.","Yeah. For, for him?","Oh, that's interesting. That's right. You know he might just executive order himself into that position. You never know. You never know. I mean, nobody ever heard of executive orders until this guy came along and he -- you know he doesn't do it when you get a group of people in the room, and you make the deals, and he always make good deals for your side, but you make like Ronald Reagan and Tip O'Neill.","But anyway, so look we have so many problems. One of the problems actually is that problem Supreme Court. If a Democrat gets in, you already lost. In losing Scalia, that was a terrible thing because he was a great guy. But nobody ever thought, nobody ever thought that was going to happen. I mean it came out of the blue.","They were thinking others that were older, and they were thinking others all of us. And that's the way life is. Things happen. You have no idea it's going to happen. That's the way life is. So we love Scalia. So now whoever the new President is could actually get up to four and maybe even five Supreme Court justices.","So let's assume that Hillary gets in and she's going to put, well, no. No, if you don't and I'll tell you what. I'll tell you what, a guy like Ted Cruz can never beat her in the general election. Never in a million years, will never beat her. But she gets it. She's going to appoint four or five judges. You will never as a country recover from that.","That's one of the most important things. In fact, some people are angry. You know I used to be establishment. I was a big contributor and all that stuff, and then all of a sudden I said run. And they said Donald's running? He's not going to want our money. And if he doesn't want our money, he's not going to listen to us. I'm self funding my campaign, folks and they're not happy about it. They are not happy about it because when the pharmaceutical companies which give millions and millions of dollars to these centers, when all these went all these people, and all these companies, you know, they give it to the lobbyists, and through the lobbyists and the special interests, the pharmaceutical companies, you look at oil and gas, everything.","Everything is controlled in Washington. So when I said I'm running. How -- when was the last time you saw somebody run where they said I'm self-funding. Did you ever remember anybody? No, no. Did you ever remember? In Washington, they have lobbyists and they have like Rubio up on their forehead, it's emblazoned.","I take care of Rubio. I take care of Cruz. They have these people, their lobbyists, they're very good. You got to pay them a lot of money and they go in, and they get you what you need. You know usually, usually they get you what you need. But these guys are totally controlled like the drug industry does very little bidding.","They bid like you know, they get like if you go to the drugstore and buy drugs, drugs to make you better, right? I mean, you're paying the same price. The United States is the largest drug buyer in the world. When you think we'd be able to buy pretty well, we don't buy. We don't bid. And then you look at it you know, people like Woody Johnson of Johnson & Johnson was in charge of Jeb Bush's campaign.","So what would happen if Jeb got in? Jeb didn't make it. I guess you probably heard that tepid. But he says low energy. We don't need low energy folks. We need very strong energy. When you see China, when you see the way I've done a great deal with China. I made a lot of money with China. When you see China coming at you and you see Japan coming at you, and you see Mexico, you saw Vicente Fox the other day, right?","Where he used the F-bomb, nobody reported it. They didn't care if he used the F-bomb. Can you imagine if I said what he said? I told people this morning, it would be the electric chair. I wouldn't be here right now. It's true. But he said, we will not pay for the wall which made me actually happy because two years ago he said, we won't allow a wall to be built.","So now we've already got the first, he's allowing a wall. But he said, we will not pay for the you-know-what wall, right? And they're going to pay. And the reason they're going to pay, very simple. With the kind of money that we lose on Mexico in trade with a trade imbalance. When you have a trade imbalance of $58 billion a year, a $10 billion wall is peanuts, right?","So when these guys come off the stage, you don't really mean that Mexico's going to pay for the wall? I say, of course, they're going to pay for the wall. But Vicente Fox was so angry when he did that interview. I don't know. I think it was with CNN. Was it with CNN? Oh back there, look at them. What a lot of --","The most is that -- you know who's really dishonest? The New York Times. They write stories and never even call me. You don't even have -- they write stories, they're so inaccurate. They don't care. It's a badly run newspaper. It's a horrible -- it's failing. It's going to be -- well, it'll either be out of business or a very rich person will buy it, and just have it as a lava layer.","But the New York Times is the worst newspaper. They do a big story. They won't even call you for a comment. They don't care. And when you call them because you want to comment, like I had a person recently for something call. No, we don't want your comment. We don't want a comment. They write a story, then it's all wrong.","And they couldn't care less if it's wrong. That's why I said, we have to do something with the libel laws, folks. You have to -- when you libel, you have to be able to go and sue a newspaper, and get them to change, and in addition to that get some money. Now that's not freedom of speech. That's not to change.","All we want is for them to be honest. But when you have a dishonest newspaper like The New York Times, you have to be able to sue them. You have to be able to do it because that level of dishonesty, and that's what I talk about so many of them. But the level of dishonesty of the press is beyond belief. Far greater than you would ever think.","Believe me because you don't see it as much. I see it. I see it. They do stories that are so bad, that is so wrong, and knowingly wrong, they do it for headlines. They do it for whatever, and they're all having a hard time, you know, they're losing money. But, but a lot of them are losing money because people have given up on them.","Like for instance, I go around and whenever I talk about the media, the place always stands up and boos the hell out of the media. They're less popular than politicians which is pretty amazing when you think of it. So so this forum is really cool. I haven't done this in a while. I love doing this. I love this forum.","The problem is you don't get that many people in the room. That's you know, it's got to be a little more intimate. But I love doing this forum. So what I want to do is we'll take some questions and then I'm going to come back because we're going to have to do a much larger room because I feel so guilty about what we have over there.","I mean really feel guilty about all the people outside, many of whom we told to just leave or come back. Even if I come back after the election, I'm coming back. OK? Well, let me put it this way. Let me put it this way. If I win, I know I'm coming back. If I lose, yeah, maybe not. OK. Go ahead. Nice hat.","Cincinnati, oh we love Cincinnati. What do you think, hey, by the way, Pete let him in, right?","What are they doing?","You know before you start, wait. Charlie Hustle, right? So I watched him and I -- he was a great player and it's so ridiculous. Don't you think he's paid the price? First of all. He didn't bet on his -- he bet that he would win. Not on the other team or anything, right? But look, he's not supposed to do it. It's a terrible thing.","All that stuff. How long has he been waiting like 30 years, like 35 years. He's got more hits than anybody. He was so good. I still remember when he went into second base and he took out Doug Harrelson, right? Right? That was the name of the second baseman. Good. That means it's still good. But you know.","We got to let Pete Rose into the Hall of Fame. And you know, you know, Charlie Hustle. If I were the commissioner, honestly, I would do it. He would be so popular. I have never met a group, even people that just used to root against him which was hard to do because he was really good. But even people that used to root against him did say let him in. And I don't know what Major League Baseball is doing, but who cares.","But let Pete Rose into the Hall of Fame. Do you agree with that? Better agree. OK, go ahead. This guy agrees, I can tell you with that hat on.","Thank you.","Unbelievable.","Were they here before you?","Right? That's pretty good.","I'll do that. I'll do it.","OK. Thank you. Go ahead. Right over here.","Where? where?","Oh, hey Keith.","A lot of courage, right?","More than anybody.","John McCain has not helped a lot of people like he should that I can tell you. It's true. Go ahead. How are you doing? How are you?","Nice to see you. Go ahead.","OK.","Oh no, no, no, no. I was. I never did that. You know that.","OK, go ahead.","OK.","Yeah.","You know exactly what I was doing.","But they argued, just so you understand and real heroes, OK? You know that. Thank you. Oh, that's for me. Wow, Thank you. Very nice. I like that. Thank you. You know that, OK?","Thank you very much. Appreciate it. OK. Who else? Go ahead. Go ahead.","OK.","You're talking at the VA?","Right.","It's true.","OK. Well, so that is such a big problem. And I hear from so many different people. And also I mean, the big problem is with the VA. It's horribly run. It's a corrupt enterprise. It's really corrupt. And you look at what's going on in Phoenix with the VA, it's a disaster, a complete disaster. We're going to take care of the problem.","They are having a tremendous problem with that. I fully know it. I fully understand it. We're going to do something about it. We have no choice. We have to do something about it. The truth is we have to treat our veterans much, much better. Our veterans are not being treated well, right? Thank you, man. Thank you.","How about -- how about over there, the young man in the middle. Go ahead.","You get up together? Good. I like that. Do you know each other?","Oh, good. Was it good? Was it good?","Yeah, that was nice. That was great rally.","Well, you know interestingly, we have a lot of young people. They don't talk about it. We have -- you saw yesterday and you see all the time, and yourselves. We have so many young people at these rallies it's incredible. Look even here, look at this. Look at all these. Stand up all you young people. Now look at -- now we have.","I would bet you and you know, I would, I would seriously think we have as many young people at least as Bernie. We have so many young people at our rallies, and it actually surprises me to a large extent. So you're talking about the 17, you're voting for Trump, right? You're OK with me. You are OK with me. You can vote for me anytime.","So what's going to be the problem. Go ahead.","Do I support?","Well, I have to look at the decision darling. Honestly, I have to look at it. You tell me what to do. You're with me. You're working with us. You're a volunteer. What do you want me to do?","Ahh, we love you. Thank you, honey. Thank you. Thank you. OK. Go ahead. A young one here, a young one. You are young. How old are you?","Wow, that's beautiful. So many young people, so many young people. Go ahead.","No. 1, your country is going to be safe because you know if you don't have a safe country and with people that aren't very good at what they do, like the people running our country now, you might very well, and don't underestimate this, you might very well not have a safe country. And it's so important. You know No. 1, the No. 1 thing we have to do is security, safety, and I'm not just talking at the border.","I'm talking about our military. We have to build it up. We have to replenish it. You know a friend of mine has a son who is in -- he's served three terms over in Iraq, three tours and he comes home, and I see him. And his biggest complaint is that the enemy has better equipment than us, and it's our equipment.","So we give the equipment to people that we think are working with us. You know the old story's been going on for years and the bullets fired in the air, they dropped the equipment and run. Brand new Humvees, brand new everything. And he's saying we have older equipment and they have beautiful new stuff. And it really bothers the hell out of them.","So we're going to take care of that, folks. We're going to take care of it. We're not going to let this kind of nonsense happen anymore. We're going to work very hard on education. Just so you understand, Common Core is dead. You know what Common Core is? And most importantly, most important thing we can do in terms of education for you and your age.","We're getting education out of Washington D.C. run by the bureaucrats, and we're going to bring the education to the local area. You around this area? We're going to bring the education where your mother and your father, and everybody else's parents and uncles are there. They, they, they love. They love you.","Do you think your parents love you, huh? They run it with love, OK? In Washington, and look not everybody's bad, but you basically have bureaucrats they want to make -- you know they get a lot of money, and they don't know what's going on in Cincinnati and they don't know what's going on in Ohio. So we're getting rid of Common Core and it's going to be dead, and we're going to have local, locally based education.","And you're going to see a big difference. Big difference. All right. Very important. Good question. It's actually a great question. OK. How about over here. What about you, right there red?","Thank you. Thank you.","That is definitely true. That is --","Aww, thank you so much. That's better than a question. I love it. We'll take care, OK? Thank you. Thank you, whole family. Now that was such a great thing that happened in Kentucky because in theory, people would say you know, what? How does Trump, a couple of people said, how did Trump win Kentucky? And we didn't even win it. We won in a major, major landslide.","And I love Kentucky, I'll never forget it. OK. Go ahead, darling. Right here. Right here.","I love this every once in a while you know say I'm saying?","Thank you. Where are you from with that beautiful accent?","I'm telling you, the hispanics.","We're going to do so well with Hispanics.","People know.","Thank you, darling. That was so nice. Wow, thank you, darling. That was so nice. That was -- come here. Get over it. That was so nice. Come here. That was so nice. Thank you very much.","Thank you very much. That's so nice. Thank you. OK, who has a good question? Who has a good one? Let's go. Let's go. We've got to go here. Go ahead. The big strong guy here.","Go ahead. Just got out of football practice.","So you know there's a 6-year statute of limitations, I guess. And Hillary's fighting for a lot. Yeah, if she makes it. Nothing's going to happen if she doesn't make it. Certainly, you have to look into it and you have to look into it very strongly because so many lawyers whether you watch him on television, whether you read them in the newspapers, whether you see them wherever you see them.","I mean, very rarely do you see a lawyer that says that she's innocent of this this horrible situation. And you actually have to ask yourself why'd she do it? What's the big deal? Why would she do it? Why would she do that other than it's always the same thing with them. It's sneaking around the corner, it's sneaky, dirty stuff.","It's gone on like that for years. It's gone on like that for years. So I will tell you, you know No. 1, it's not me, but certainly, people are going to look and you know what, if there's anything wrong and you have to do it, you have to do that. You have to do that because so many people have asked me that same question and you have no idea, and she's being protected.","Look, let's face it. Look, it's not complicated. What she did certainly to me is certainly, she broke the law to me, what do I know? To me she broke the law and it looks so bad from the standpoint of the rest of the country and even from the standpoint of all those people that did something much less. So many people did something much less.","How do you think they feel? How do you think Petraeus feels? How do you think all these other people feel? And here she is she's got a clear path to running for president. But you know what? The first thing I have to do with Hillary is beat her. The next thing we'll do is we'll look into that, OK? And we'll beat her.","We'll beat her. And you know it's interesting, we haven't even started on her yet. I'm going to finish off the -- we have to finish off the deck. We have to finish off the deck. And the best thing you could do honestly. Your governor, remember NAFTA. Get rid of this -- look, just get rid of letting him be governor.","One other thing about him. He runs for president. He's lived in New Hampshire forever. He said there he had the record, more than Chris, more than anybody by far. He lived in New Hampshire. He moved out of the state and he said he was going to win New Hampshire. He did poorly there. He then moved to -- right?","South, didn't he? I mean he didn't -- I think he went to South Carolina and then he moved to Michigan. Now he said I thought, and I must be mistaken, but he said that he's going to win Michigan, and he's going to win it easily. I won it in a landslide. But he said he's going to win Michigan. He's going to win it easily.","So he went to South Carolina, he stayed there. Lost. Lost in New Hampshire. He went to Michigan and I thought he said because it's a neighboring state. I thought he said he would win Michigan and if he didn't win, he'd give up and let him be a governor. But he moved to Michigan spent all his time in Michigan.","And you know you people have a lot of problems. You call industrious dead, your steel industry is dying, it's dying badly. He's voting for the wrong things and the TPP in particular. And you know he should be home be governor, but he moved to that. So now he goes to Michigan and two weeks ago, I won Michigan by a lot.","By like a landslide, essentially. Yeah, a landslide. And when I won Michigan I said, oh good. Kasich is going to drop out of -- he's going to drop out of Ohio and that's good. But he didn't drop out. So you know, I think you got to show him, folks. You can't do that. You can't be an absentee governor. You got to run for governor, you got to be governor.","And you know what? If you don't want to do that you take out and same thing with Marco Rubio, he runs for the Senate, he never shows up to vote. The guy never shows up to vote, and the people of Florida you don't think they get it? Take a look at his poll numbers. They really get it because what he did to the people of Florida is defraud them.","He said I'm going to run. I'm going to represent you. Im going to represent you, and about 15 minutes after he got in he starts running for president. That is wrong. And by the way, other people running for president they get to vote a lot more than he does. He never votes. Think he's going to set an all time record.","So let's see what happens. But we got to win in Ohio. If we can win Ohio, we're going to run the table, folks. We're going to run the table. Had a winner in Ohio. Go ahead, give her that mic. You just shout it out. Go ahead.","Yeah. Go ahead.","That's great by the way. That's --","A lot of people are in there saying they want to retire. They're afraid that they're not going to have anything to go by. They think their insurance companies are going bust. They think -- a lot of, a lot of problems. Look what's happened with the stock market going down. Did you get affected by that? By the stock market going down?","In terms of values you've been affected. A lot of people have been affected. So go ahead what's your question?","we're going to make this country so strong. We're not going to stand for losing $500 billion a year with China, for losing $58 billion with Mexico, for losing hundreds with Japan. We're going to make our country strong again. You know our military. OK. Our military, everyone sees our military budget. They don't realize we take care of Germany.","Nobody even probably knows that. We take care of Japan. You know that if we're attacked -- we have a treaty with Japan. If we're attacked, Japan doesn't have to help us. If Japan gets attacked, we're in third world -- we're in the third world war. We have a new war going on, OK? Now what kind of deals are these?","What kind of deals? But we take care of Japan. We take care of South Korea. I love all these countries. I think it's great, except we owe $19 trillion. Can't do it. We got to be reasonable. We can't do it. So we're taking care of South Korea. When the maniac next door acts up, we start up those battleships, we start up those aircraft carriers, let's say, and we start up, you know, our planes are flying.","We spend millions and millions of dollars. They don't pay us. They pay us very little. You know in South Korea and I love South Korea. I have buildings in South Korea. We have and they're great people. We have a border in South Korea. We have 28,000 soldiers. What they pay us is peanuts. What Japan pays us is peanuts.","So we protect the world. Saudi Arabia is the greatest of them all. So we protect Saudi Arabia until the oil went down and now they're making half which is still a lot, but until the oil went down Saudi Arabia was making $1 billion a day, right? We protect them. We protect them, and we protect them for peanuts.","So all of that stuff is going to change, folks. We're going to end up with a strong country again, a powerful country, and we're going to end up with a respected country again because we're not respected. We're not respected. All right. Two more questions, come on. Two more questions. And what's your question?","We are going to save the Second Amendment, Roger.","Throw it. Throw it.","Yeah. Give it to me.","OK. Get me that card would you, please.","Get me the card.","So you endorsed me?","I heard about that. I heard about it. Thank you.","I'm glad I told him to stay.","I like it. I like it. Thank you.","You know it's a funny thing. I don't get it, but I do get it. You know the motorcycle guys love Trump? Do you know that?","Every place I go, right? And I'm not too much on the motorcycles, right? But, but every place I go, there's hundreds of guys with motorcycles and they say we love you Mr. Trump. We love you. You know what they love? They want to see a strong country. They want to see a strong military. They want to see a strong everything.","They want infrastructure. They want our highways fixed. I mean, if I'm driving a motorcycle I don't want to go over potholes believe me, OK? Not good. But the motorcycle people love Donald Trump. Go ahead, darling. Go ahead.","Right.","Gerri is great. I know Gerri.","Come on. You know what? Let her come up here. Come on. Oh, OK. How about, how about one more. Who's, who's got a good one? Wait, I have to get a hug. I have to get a hug. Come on."],"text":" And the bad news is, you saw it there are thousands of people outside. I said why didn't we get a bigger place? But who knows? Who knows that this is all going to happen. You know things are going on that are amazing, but I don't know if you saw, I just came here. We drove through thousands and thousands of people, and I feel badly for those people too. At least, do we have speakers outside, huh? Does anybody know? Do we have speakers outside? They do? Hello, outside. We love you outside. Oh boy, that's a lot of people. I couldn't believe it. But we have that all over. I mean we get these crowds that are incredible. There's tremendous love and there's tremendous everything going on. It's incredible because we're going to take our country back. We're going to make our country great again. That's what we're going to do. That's what we're going to do. And it's been amazing, what's going on. So we have a big, big, big election. So Tuesday you have to get to the polls, you have to vote. It's so important. You know they're talking -- thank you. And I'll vote for you. Someday, I vote for you. But we have to do it. Otherwise, we're just wasting a lot of time. Honestly, we just waste time. You know, Ohio has plenty of problems. Believe me. Believe me your real estate taxes are through the roof. And you know what they did is they try not to raise taxes, but they raised everybody's real estate taxes. So the tax increase is absolutely a disaster, and your governor as you know, voted when he was a congressman, voted for NAFTA which is, which is absolutely -- You know, Ohio has never ever come back from that. And yesterday I was in Cleveland and you had Ford left, and you had Eton left on the other side. Yes, sit down everybody, What the hell. Just sit down. Sit down. We could be here for a long time. I love it, man. We'll be here for a while. I think I have to come back because in fact, what we're doing -- thank you. No, I have to come back take care of some of those people that -- I feel badly when you have that many people being turned away. That's -- well, in one way it's good, right? Because it means they love you, and in another way, it's a little bad. Now the other candidates do not have this problem. They have empty seats all over the place, OK? They don't have this problem. So Kasich voted, as you know, for NAFTA and now he wants to vote for Transpacific which is TPP which is going to be worse than NAFTA where all of the things that I've been talking about for years, monetary manipulation. It's what they do with the devaluation. Makes it impossible for our businesses to compete. All of these countries are going -- believe me China's lurking in the background. They're watching. They're not in it, but they're watching and they're going to go in through the back. In a couple of years, and they'll steal it all. So you better be careful and I hope they don't approve it. But Kasich is in favor of it. No good. Now today I watched him on television, and I like John, here is a nice guy, but he said did you see some of Trump's speeches? No I haven't seen them. Oh, he's the only person in America that hasn't seen him. And so he said, did you see him? No. Well, I don't really watch television. When I watch television. I only watch Golf Channel. I don't watch the news. I don't watch sports. I said, wait a minute, we all like Golf Channel too. But you're running for President, the only thing you watch is a television's Golf Channel? So he's not going to do the job, OK? Not going to do the job. We have so many problems with this country. We have so many problems and we're going to make this country so great, so strong. We're going to build up our military and we're not going to use our military. We're not going to have to use our military. Hopefully, but nobody's going to mess with us. We're going to take care of our vets. The vets are very important. They're our great people. We've got to take care of our vets, right? These are great, great people. Thank you. I love that sign. Look at that beautiful sign. Thank you. Boy that's incredible. I tell this story and it's sort of an amazing story, but a very, very good friend of mine is a very successful guy, and he always, I mean always, he hears about -- how many people do you speak in front of today, Donna? Say 21,000 people in Dallas, 35,000 people a couple of weeks ago in Alabama. He said, how do you do that? This is one of the most successful guys. And I said you know, I don't really know and I'm not a big note person. I don't read speeches because I don't like to. I do, it's easier to read speeches. But you want to put everyone to sleep, just read speeches, right? Plus, you can't comment on things like Golf Channel, you know, with Kasich with Golf Channel. Because you don't put that in the speech because it's too current. I just heard it a couple of hours ago. But, but he said How do you do it? And I really mean this, there's such love in these stadiums and these rooms, and there's such love. They took this room just very quickly because we just wanted to come up here and say hello. You know, I used to work in Cincinnati and it's true. Yeah. The Queen City. I love Cincinnati. But I worked here and I tell the story, I wrote about it and I think the art of the deal, but I wrote about it. And it was great. Am my right? Yeah. And it was a great feeling. My father and I, we bought a job called Swifton Village and it was very sick. It had I think 11,064 units and I spent my entire summers, two summers working, working, working. I loved the job. I loved, I loved Cincinnati I must tell you. I really loved it and we bought it for very little from FHA Federal Housing, and sold it for a big profit. And we got -- we got out, we sold it and now I know the area hasn't been very good, but at least we're able to protect that. But I tell you it was a great experience. It's sort of like a baseball player gets the first hit or a golfer sings the first three foot putt or something. And it gave you confidence because you know I was very young when I did that job, and it was my baby and it was just an amazing experience and I loved. I just loved the whole -- the whole deal. And then I -- we also got very familiar with the people of Kentucky. And you know, do we have people? Yeah. But I loved him. And by the way, who won Kentucky recently, right? Right? Trump. So -- but I used to drive as a young guy. I used to drive -- Trump. Trump. Trump. Trump. Well, it adds excitement doesn't it, folks? You know you really ask what are they doing, right? What are they doing? It's the same thing everywhere. You know sometimes not so much. We had one yesterday. We had seven or eight incidents where they stand up and they say oh something, and everybody shouts some down, and you know it's fine. Honestly, in certain ways, in certain ways, it makes it more exciting. OK, to be honest. It makes it more exciting. We might have a couple of more. Anybody else want to stand up right now? So anyways, it's a shame that we wasted two tickets where we have all those great people outside. It's a shame. But I used to, I used to drive to Kentucky. Friday nights I'd spend time in Kentucky. True. And I just had a great time there. I mean, I love Kentucky and it was so amazing. You know, when I went out and when I did this, I was not supposed to win Kentucky, right? And did I win in a landslide? We won, we won in a landslide. So they must have remembered me in Kentucky when I was young and they said we're going to give him our vote. But it was amazing. But Ohio is so important. The Tuesday vote is so important because if we can do that I think we're going to do great in Florida. Polls came out in Florida today which are fantastic. Now who knows? Who knows? I mean I think we're going to do very well. Look they have an absentee senator. He's absentee. Totally. He's got one of the worst voting records in the last 25 years in the Senate. He doesn't vote. You know, they put him in. He's a young guy, they put him in and he goes out -- you know who I'm talking about, right? Who am I talking about? Little Marco. Marco. Marco. Marco. But, but he's -- I think he got a little nasty with me for a while, but that's OK. He got nasty. They all get nasty and then you end up winning, and you just forget about them. We got nasty with him too. You know in the last debate, my daughter and my wife they said don't, just let him say whatever they want. Let them all say whatever they want. Act presidential. I said, I can't do that. I can't do it. When they come at you, you have to come back. Don't we agree? I mean, what are you going to do stand there? You can't do it. You have to, you have to hit him back, and you hit him hard enough all of a sudden they collapse. We think of it. Think of it. Every person, we started off with 17. Now we're down to a few and certainly, a couple of getting out very soon. But including the governor, the governor here didn't win one state yet, and he's not allowed. He didn't qualify. I don't know. Is this a big story. It doesn't seem to be a big story. I don't understand it. He didn't qualify in Pennsylvania. He didn't have the signatures. Does anyone know that? Yeah. It was just announced. He didn't qualify in Pennsylvania. So if he doesn't qualify in Pennsylvania, he shouldn't be running on Tuesday, right? I mean, I think. So anyway, hey look that's his problem. Hopefully, we can just beat him. Who cares if he qualifies in Pennsylvania. But, but he is somebody and he's been very nice to me, I've been very nice to him. But he does this nice, you know, this nice routine. Yeah. I want to be the grown up in the room. I want to be. But he didn't start out that way. Do you remember the first two debates? Yeah. He came at me. Oh and I said wait a minute, what's this? And he came at me viciously, and I'm telling you, and that's why I remember because you know, now he's been less, probably six or seven or eight debates. He's been going, well you know, I'm the guy that's the grown up. I want to be really nice. Take a look at the first two bates -- debates. Remember when I went after him? I said, you ran Lehman Brothers into the ground and it almost destroyed the world. Don't tell me about that. And all of a sudden he sort of shut up, but he was vicious which is OK. You know as a governor, you're supposed to be a little bit vicious, right? But now he's playing the good guy. And then I had some commercials done in New Hampshire. So I'm up in New Hampshire and I -- which I won also. I love New Hampshire. I love those people. I love New Hampshire. You know the problem, New Hampshire has a big problem and I tell him I'm going to take care of this problem. New Hampshire has a tremendous problem with heroin. Can you believe it? New Hampshire is such a beautiful place. It's so pristine. So you know the trees and the beautiful little roads and the countryside, and you go into like groups like this, you know large 1,500 people, 500 people. Every single time you ask a group, what's your big problem in New Hampshire? They say heroin and drugs, and you don't see it. It doesn't go here to, here to, here to, all right, here to. Oh, we're going to build a wall, folks. Don't worry about it. We're going to build a wall. Think of it. We get the drugs, they get the money. Not a good deal, right? Not a good deal. Now we're going to build a wall, and Mexico is going to pay for the wall. It's very simple. Look here's the story. Here's the story. Mexico. Mexico is going to pay $58 billion in trade. This our imbalance, $58 billion a year. That's our imbalance. People don't know that. And these senators come up Marco and lying Ted. You know lying Ted? He walks in, holds up the Bible and I'm beating him, I'm just killing him with Evangelicals because -- Yeah. They don't like liars. They don't like liars. He comes in with the Bible, holds it up high, puts it down and then he lies. I mean, I call him the lying Ted. And you know why he hasn't -- he was supposed to win South Carolina because I think it's 68% Evangelical. And Trump got the Evangelicals, and that was the day after the Pope scolded me. But the Pope was told by Mexico that Trump wants to stop the border, and the Pope didn't like that. And the Pope really, I said you know, sort of interesting. So I'm getting ready, they're getting ready for the vote in South Carolina, and my people come up, Mr. Trump we have a problem. This is the day before the vote. And I say, what's the problem? They said it's the Pope. I said the Pope? I said that's a big problem, right? The Pope, I like the Pope. I do like the Pope. I said Why? What did I do with the Pope? I said let me ask you, is it a good thing or a bad thing? They said, not good. So the Pope hit me because he didn't like the fact that we're going to close up the borders, and people are going to come in, but they're going to come in legally. They've got to come in legally. OK. So and the drugs that are poisoning our youth they're not coming in, folks. They're not coming in. So anyway, OK. That's a long shot. So I got this thing and they say the Pope, and because he was with Mexico, and I like Mexico, and I have a lot of respect for their leadership, much smarter than our leadership. And that's why I mean, we can't make good deals because our leaders are not smart when it comes to trade. Minor things like trade, military, healthcare, common core, all these things. You know, they're not too good in any of it, OK? They're not good at anything. You want to know the truth. But so I get a call saying the Pope. So then I sort of -- the Pope was sort of angry because he was told by Mexico that I wanted closed borders. The pope didn't know that tremendous crime is coming across the border. That drugs are pouring across the border -- border and, and just didn't know. I mean he went -- and the next day he was so nice. The next day, the Pope was so terrific, and he did something, he issued something. I don't think it was exactly an apology, I don't want an apology, but he was great. We went to the polls and I won South Carolina in a massive landslide and lying Ted got very few votes, and that was supposed to be his -- that was supposed to be his deal. But people don't know. They just don't like it when people like -- you remember with Ben Carson, by the way, who endorsed me yesterday? This is great. And remember in Iowa where Ben Carson was running, and you know, all of a sudden the rumor was going out all over that he left the race. He didn't leave the race. Lying Ted said he left the race. He's not good and so vote for him, and you can't do that. You know you can't do that. And then right after the election, he went and apologized to Ben. A lot of good that does. They should have disqualified him. You want to know the truth. They actually should have disqualified him and they had it down many different ways. So anyway, so we're going to run and we're going to do some incredible things, and we're going to bring our country back, and we're going to bring it back in every aspect. And frankly, Hillary's a disaster by the way, you know that, a disaster. And despite all of the stuff you see with Bernie, Bernie, Bernie is not a second of me. Bernie is going to be all right. But unless, unless the FBI does its thing because he's got a problem. Anybody else, look at all the people that were so badly hurt by doing much less than she did including General Petraeus, a good guy destroyed. He was destroyed for doing much less than what she did. So let's see what happens. I'm sort of predicting that certainly, they would have done it already if they're going to do it. How can they let her run and then all of a sudden do it. So let's see what happens. But I know she's probably doing OK. Did you ever see anybody embrace President Obama like she's embracing him? Oh the president is great. He's great. We love this plan. We love that plan. We love everything. She loves everything. TPP interestingly, she originally liked it. Now she doesn't like it. She wants you know -- and then if he wants it, she's going to want it again. So I don't know what his -- if you know his position. You know his position is I like it. So I assume she likes it because everything that he wants. Now why is she being so nice to the president? You know, they didn't like each other for years, right? So why? Do you know? Yeah, for him. That's right. That's right. She wants to with Obama. Yeah. For, for him? For him. Yeah, a trade. She'll work with him and she'll make him to bring . Oh, that's interesting. That's right. You know, he might just executive order himself into that position. You never know. You never know. I mean, nobody ever heard of executive orders until this guy came along and he -- you know he doesn't do it when you get a group of people in the room, and you make the deals, and he always make good deals for your side, but you make like Ronald Reagan and Tip O'Neill. But anyway, so look we have so many problems. One of the problems actually is that problem Supreme Court. If a Democrat gets in, you already lost. In losing Scalia, that was a terrible thing because he was a great guy. But nobody ever thought, nobody ever thought that was going to happen. I mean it came out of the blue. They were thinking others that were older, and they were thinking others all of us. And that's the way life is. Things happen. You have no idea it's going to happen. That's the way life is. So we love Scalia. So now whoever the new President is could actually get up to four and maybe even five Supreme Court justices. So let's assume that Hillary gets in and she's going to put, well no. No, If you don't and I'll tell you what. I'll tell you what, a guy like Ted Cruz can never beat her in the general election. Never in a million years, will never beat her. But she gets it. She's going to appoint four or five judges. You will never as a country recover from that. That's one of the most important things. In fact, some people are angry. You know I used to be establishment. I was a big contributor and all that stuff, and then all of a sudden I said run. And they said Donald's running? He's not going to want our money. And if he doesn't want our money, he's not going to listen to us. I'm self funding my campaign, folks and they're not happy about it. They are not happy about it because when the pharmaceutical companies which give millions and millions of dollars to these centers, when all these went all these people, and all these companies, you know, they give it to the lobbyists, and through the lobbyists and the special interests, the pharmaceutical companies, you look at oil and gas, everything. Everything is controlled in Washington. So when I said I'm running. How -- when was the last time you saw somebody run where they said I'm self funding? Did you ever remember anybody? No, no. Did you ever remember? In Washington, they have lobbyists and they have like Rubio up on their forehead, it's emblazoned. I take care of Rubio. I take care of Cruz. They have these people, their lobbyists, they're very good. You got to pay them a lot of money and they go in, and they get you what you need. You know usually, usually they get you what you need. But these guys are totally controlled like the drug industry does very little bidding. They bid like you know, they get like if you go to the drugstore and buy drugs, drugs to make you better, right? I mean, you're paying the same price. The United States is the largest drug buyer in the world. When you think we'd be able to buy pretty well, we don't buy. We don't bid. And then you look at it you know, people like Woody Johnson of Johnson & Johnson was in charge of Jeb Bush's campaign. So what would happen if Jeb got in? Jeb didn't make it. I guess you probably heard that tepid. But he says low energy. We don't need low energy, folks. We need very strong energy. When you see China, when you see the way I've done a great deals with China. I made a lot of money with China. When you see China coming at you and you see Japan coming at you, and you see Mexico, you saw Vicente Fox the other day, right? Where he used the F-bomb, nobody reported it. They didn't care if he used the F-bomb. Can you imagine if I said what he said? I told people this morning, it would be the electric chair. I wouldn't be here right now. It's true. But he said, we will not pay for the wall which made me actually happy because two years ago he said, we won't allow a wall to be built. So now we've already got the first, he's allowing a wall. But he said, we will not pay for the you-know-what wall, right? And they're going to pay. And the reason they're going to pay, very simple. With the kind of money that we lose on Mexico in trade with a trade imbalance. When you have a trade imbalance of $58 billion a year, a $10 billion wall is peanuts, right? So when these guys come off the stage, you don't really mean that Mexico's going to pay for the wall? I say, of course, they're going to pay for the wall. But Vicente Fox was so angry when he did that interview. I don't know. I think it was with CNN. Was it with CNN? Oh back there, look at them. What a lot of -- Boo. The most is that -- you know who's really dishonest? The New York Times. They write stories and never even call me. You don't even have -- they write stories, they're so inaccurate. They don't care. It's a badly run newspaper. It's a horrible -- it's failing. It's going to be -- well, it'll either be out of business or a very rich person will buy it, and just have it as a lava layer. But the New York Times is the worst newspaper. They do a big story. They won't even call you for a comment. They don't care. And when you call them because you want to comment, like I had a person recently for something call. No, we don't want your comment. We don't want a comment. They write a story, then it's all wrong. And they couldn't care less if it's wrong. That's why I said, we have to do something with the libel laws, folks. You have to -- when you libel, you have to be able to go and sue a newspaper, and get them to change, and in addition to that get some money. Now that's not freedom of speech. That's not to change. All we want is for them to be honest. But when you have a dishonest newspaper like The New York Times, you have to be able to sue them. You have to be able to do it because that level of dishonesty, and that's what I talk about so many of them. But the level of dishonesty of the press is beyond belief. Far greater than you would ever think. Believe me because you don't see it as much. I see it. I see it. They do stories that are so bad, that is so wrong, and knowingly wrong, they do it for headlines. They do it for whatever, and they're all having a hard time, you know, they're losing money. But, but a lot of them are losing money because people have given up on them. Like for instance, I go around and whenever I talk about the media, the place always stands up and boos the hell out of the media. They're less popular than politicians which is pretty amazing when you think of it. So so this forum is really cool. I haven't done this in a while. I love doing this. I love this forum. The problem is you don't get that many people in the room. That's you know, it's got to be a little more intimate. But I love doing this forum. So what I want to do is we'll take some questions and then I'm going to come back because we're going to have to do a much larger room because I feel so guilty about what we have over there. I mean really feel guilty about all the people outside, many of whom we told to just leave or come back. Even if I come back after the election, I'm coming back. OK? Well, let me put it this way. Let me put it this way. If I win, I know I'm coming back. If I lose, yeah, maybe not. OK. Go ahead. Nice hat. Cincinnati, oh we love Cincinnati. What do you think, hey, by the way, Pete let him in, right? Right. Yeah. What are they doing? Mr. Mr. Trump. You know, before you start, wait. Charlie Hustle, right? So I watched him and I -- he was a great player and it's so ridiculous. Don't you think he's paid the price? First of all. He didn't bet on his -- he bet that he would win. Not on the other team or anything, right? But look, he's not supposed to do it. It's a terrible thing. All that stuff. How long has he been waiting like 30 years, like 35 years. He's got more hits than anybody. He was so good. I still remember when he went into second base and he took out Doug Harrelson, right? Right? That was the name of the second baseman. Good. That means it's still good. But you know. We got to let Pete Rose into the Hall of Fame. And you know, you know, Charlie Hustle. If I were the commissioner, honestly, I would do it. He would be so popular. I have never met a group, even people that just used to root against him which was hard to do because he was really good. But even people that used to root against him did say let him in. And I don't know what Major League Baseball is doing, but who cares. But let Pete Rose into the Hall of Fame. Do you agree with that? Better agree. OK, go ahead. This guy agrees, I can tell you with that hat on. And I love you Donald Trump, man, and you're the future of America. Thank you. I just, I just. Just real quick. And I've been waiting 17 hours to see you today. I got here -- Unbelievable. I got here 11:00 last night. I was the very first one here and I just want you to know, and I didn't get front row, I'm in the second row. But with that said -- Were they here before you? No. Right? That's pretty good. I would love to get a picture with you before I leave today. I'll do that. I'll do it. Thank you. OK. Thank you. Go ahead. Right over here. Hi, I'm Robin from Cincinnati soldiers' support. I have a very special person here with us today, Mr. Keith and I think, everybody, everybody in this room knows who Mr. is. Um -- Where? where? Mr. Keith . Keith stand up. Oh, hey Keith. I'm going to let Keith ask the question. A lot of courage, right? Keith is a veteran and his son was captured in Iraq and he was killed. And Keith would like to ask you a question because we all know that that you support our veterans POWs and everyone else. More than anybody. Mr. McCain he went through years of trying to get his son back. John McCain would not help him. We know that you would help our POWs. John McCain has not helped a lot of people like he should that I can tell you. It's true. Go ahead. How are you doing? How are you? Good morning, sir. Nice to see you. Go ahead. I come here because you made a comment to John McCain. OK. That you don't think that captured soldiers are heroes. Oh no, no, no, no. I was. I never did that. You know that. But what I want you to do. OK, go ahead. Is just clarify that for me. OK. Because I think it's important for all these people here. Yeah. And for a lot of veterans that's in Ohio, especially Ohio. And I know what you were doing. You know exactly what I was doing. But I want you to disclaim that. But they argued, just so you understand and real heroes, OK? You know that. Thank you. Oh, that's for me. Wow, Thank you. Very nice. I like that. Thank you. You know that, OK? Thank you. We know. Thank you very much. Appreciate it. OK. Who else? Go ahead. Go ahead. Mr. Trump, I have four sons in the Army, and my one son is a nurse psychiatric practitioner. OK. Dealing with the PTSD. He tells me every day that my son, Lieutenant Courter is overwhelmed dealing with this. What are your plans to help him out? And he does want to support -- You're talking at the VA? No. He, he actually is a Lieutenant in the Army, he's a nurse practitioner, psychiatric nurse. Right. So there -- he's the one they see first and the biggest issue says that no one in the VA, very few of them understand what they have gone through. He's telling me that it's better that they have some help. They need more help on the psychiatric side to help him transition these soldiers out, and he has none. He says he's -- It's true. over -- totally overwhelmed, and he says we've got to get the soldiers who are unemployed or don't have jobs. He said I would love to have them help me to deal with us. And there's nobody else. One other quick thing. We need a new first lady since Nancy's gone. OK. Well, so that is such a big problem. And I hear from so many different people. And also I mean, the big problem is with the VA. It's horribly run. It's a corrupt enterprise. It's really corrupt. And you look at what's going on in Phoenix with the VA, it's a disaster, a complete disaster. We're going to take care of the problem. They are having a tremendous problem with that. I fully know it. I fully understand it. We're going to do something about it. We have no choice. We have to do something about it. The truth is we have to treat our veterans much, much better. Our veterans are not being treated well, right? Thank you, man. Thank you. How about -- how about over there, the young man in the middle. Go ahead. Hold on, hold on, hold on son. You get up together? Good. I like that. Do you know each other? Yeah. we're here together. Yeah. Hi, this is my friend Lily. We're both from Dayton, Ohio. We were actually at your rally yesterday. Oh, good. Was it good? Was it good? Yeah, it was amazing. Yeah, that was nice. That was great rally. But actually we're both interned for Senator Portman here in Ohio and we volunteer for your campaign. But we were just wondering, maybe you heard or maybe you didn't. John, you said just earlier this week, refused to let 17-year old who are even going to be 18 by the general election not vote in this primary. And I know that a lot of young voters, a lot of people we talked to support Bernie or Hillary, and he is a Republican. So what do you feel about? Well, you know interestingly, we have a lot of young people. They don't talk about it. We have -- you saw yesterday and you see all the time, and yourselves. We have so many young people at these rallies it's incredible. Look even here, look at this. Look at all these. Stand up all you young people. Now look at -- now we have. I would bet you and you know, I would, I would seriously think we have as many young people at least as Bernie. We have so many young people at our rallies, and it actually surprises me to a large extent. So you're talking about the 17, you're voting for Trump, right? You're OK with me. You are OK with me. You can vote for me anytime. So what's going to be the problem. Go ahead. No, I was just curious is that even though he's a Republican, do you still support him with that? Or do you think that -- Do I support? John, you said with his decision. Well, I have to look at the decision darling. Honestly, I have to look at it. You tell me what to do. You're with me. You're working with us. You're a volunteer. What do you want me to do? If I could vote, I actually missed the deadline by four months. I would definitely vote for you. Ahh, we love you. Thank you, honey. Thank you. Thank you. OK. Go ahead. A young one here, a young one. You are young. How old are you? I'm a seventh grader. Wow, that's beautiful. So many young people, so many young people. Go ahead. Um, I like to know what you would do from my education in the next four years. No. 1, your country is going to be safe because you know if you don't have a safe country and with people that aren't very good at what they do, like the people running our country now, you might very well, and don't underestimate this, you might very well not have a safe country. And it's so important. You know No. 1, the No. 1 thing we have to do is security, safety, and I'm not just talking at the border. I'm talking about our military. We have to build it up. We have to replenish it. You know, a friend of mine has a son who is in -- he's served three terms over in Iraq, three tours and he comes home, and I see him. And his biggest complaint is that the enemy has better equipment than us, and it's our equipment. So we give the equipment to people that we think are working with us. You know the old story's been going on for years and the bullets fired in the air, they dropped the equipment and run. Brand new Humvees, brand new everything. And he's saying we have older equipment and they have beautiful new stuff. And it really bothers the hell out of them. So we're going to take care of that, folks. We're going to take care of it. We're not going to let this kind of nonsense happen anymore. We're going to work very hard on education. Just so you understand, Common Core is dead. You know what Common Core is? And most importantly, most important thing we can do in terms of education for you and your age. We're getting education out of Washington D.C. run by the bureaucrats, and we're going to bring the education to the local area. You around this area? We're going to bring the education where your mother and your father, and everybody else's parents and uncles are there. They, they, they love. They love you. Do you think your parents love you, huh? They run it with love, OK? In Washington, and look not everybody's bad, but you basically have bureaucrats they want to make -- you know they get a lot of money, and they don't know what's going on in Cincinnati and they don't know what's going on in Ohio. So we're getting rid of Common Core and it's going to be dead, and we're going to have local, locally based education. And you're going to see a big difference. Big difference. All right. Very important. Good question. It's actually a great question. OK. How about over here. What about you, right there red? Can we, can we get to -- Hold on. Hold on. I'm from Ohio and my entire oh -- Look at me, right. I'm from Ohio. My name is Misty and my entire family is from Kentucky. They were all very happy to vote for you in the Kentucky primary. Thank you. Thank you. It is so refreshing to have a presidential candidate that is not bought and paid for, and is self funding. That is definitely true. That is -- And I 100% believe in you that you will make America great again. Aww, thank you so much. That's better than a question. I love it. We'll take care, OK? Thank you. Thank you, whole family. Now that was such a great thing that happened in Kentucky because in theory, people would say you know, what? How does Trump, a couple of people said, how did Trump win Kentucky? And we didn't even win it. We won in a major, major landslide. And I love Kentucky, I'll never forget it. OK. Go ahead, darling. Right here. Right here. Hold on. Hold on. I love this every once in a while you know say I'm saying? Hi, I am Evelyn Scalevich. Mr. Trump I don't have a question for you. I'm really glad to hear the other questions, but I just wanted to tell you that I am so happy that you are running for the next President of our country. Thank you. Where are you from with that beautiful accent? Yeah. I am from Managua, Nicaragua, Central America. I'm telling you, the hispanics. Yes. We're going to do so well with Hispanics. Yeah. People know. And what I wanted to say also. I want to thank you for what you are doing in our country. You are giving our country the opportunity to dream, to hope that there is hope in America. That we have a Christian nation, and that we are country of laws and that we are a sovereign nation. And I want to give you thanks. God bless you. Thank you, darling. That was so nice. Wow, thank you, darling. That was so nice. That was -- come here. Get over it. That was so nice. Come here. That was so nice. Thank you very much. And you are so and so. I love your blue eyes. Thank you very much. That's so nice. Thank you. OK, who has a good question? Who has a good one? Let's go. Let's go. We've got to go here. Go ahead. The big strong guy here. Right here. I'm coming. Everybody let me in. Go ahead. Just got out of football practice. Hi, I'm Zach, I'm from Kentucky. Whooh, I have one question. On what day in office will you put Hillary in prison? Yeah. So you know there's a 6-year statute of limitations, I guess. And Hillary's fighting for a lot. Yeah, if she makes it. Nothing's going to happen if she doesn't make it. Certainly, you have to look into it and you have to look into it very strongly because so many lawyers whether you watch him on television, whether you read them in the newspapers, whether you see them wherever you see them. I mean, very rarely do you see a lawyer that says that she's innocent of this this horrible situation. And you actually have to ask yourself why'd she do it? What's the big deal? Why would she do it? Why would she do that other than it's always the same thing with them. It's sneaking around the corner, it's sneaky, dirty stuff. It's gone on like that for years. It's gone on like that for years. So I will tell you, you know No. 1, it's not me, but certainly, people are going to look and you know what, if there's anything wrong and you have to do it, you have to do that. You have to do that because so many people have asked me that same question and you have no idea, and she's being protected. Look, let's face it. Look, it's not complicated. What she did certainly to me is certainly, she broke the law to me, what do I know? To me she broke the law and it looks so bad from the standpoint of the rest of the country and even from the standpoint of all those people that did something much less. So many people did something much less. How do you think they feel? How do you think Petraeus feels? How do you think all these other people feel? And here she is she's got a clear path to running for president. But you know what? The first thing I have to do with Hillary is beat her. The next thing we'll do is we'll look into that, OK? And we'll beat her. We'll beat her. And you know it's interesting, we haven't even started on her yet. I'm going to finish off the -- we have to finish off the deck. We have to finish off the deck. And the best thing you could do honestly. Your governor, remember NAFTA. Get rid of this -- look, just get rid of letting him be governor. One other thing about him. He runs for president. He's lived in New Hampshire forever. He said there he had the record, more than Chris, more than anybody by far. He lived in New Hampshire. He moved out of the state and he said he was going to win New Hampshire. He did poorly there. He then moved to -- right? South, didn't he? I mean he didn't -- I think he went to South Carolina and then he moved to Michigan. Now he said I thought, and I must be mistaken, but he said that he's going to win Michigan, and he's going to win it easily. I won it in a landslide. But he said he's going to win Michigan. He's going to win it easily. So he went to South Carolina, he stayed there. Lost. Lost in New Hampshire. He went to Michigan and I thought he said because it's a neighboring state. I thought he said he would win Michigan and if he didn't win, he'd give up and let him be a governor. But he moved to Michigan spent all his time in Michigan. And you know you people have a lot of problems. You call industrious dead, your steel industry is dying, it's dying badly. He's voting for the wrong things and the TPP in particular. And you know he should be home be governor, but he moved to that. So now he goes to Michigan and two weeks ago, I won Michigan by a lot. By like a landslide, essentially. Yeah, a landslide. And when I won Michigan I said, oh good. Kasich is going to drop out of -- he's going to drop out of Ohio and that's good. But he didn't drop out. So you know, I think you got to show him, folks. You can't do that. You can't be an absentee governor. You got to run for governor, you got to be governor. And you know what? If you don't want to do that you take out and same thing with Marco Rubio, he runs for the Senate, he never shows up to vote. The guy never shows up to vote, and the people of Florida you don't think they get it? Take a look at his poll numbers. They really get it because what he did to the people of Florida is defraud them. He said I'm going to run. I'm going to represent you. I'm going to represent you, and about 15 minutes after he got in he starts running for president. That is wrong. And by the way, other people running for president they get to vote a lot more than he does. He never votes. Think he's going to set an all time record. So let's see what happens. But we got to win in Ohio. If we can win Ohio, we're going to run the table, folks. We're going to run the table. Had a winner in Ohio. Go ahead, give her that mic. You just shout it out. Go ahead. I just hope to say -- are you hearing me? Yeah. Go ahead. My husband is in the military, he's a Navy Seal. Now I -- That's great by the way. That's -- Not just the firefighters and -- Good. And he's done 20 years in the fire service. He's going to retire in June, but he's afraid to retire. He says he's afraid he's not comparable and he's going to have insurance in getting his -- A lot of people are in there saying they want to retire. They're afraid that they're not going to have anything to go by. They think their insurance companies are going bust. They think -- a lot of, a lot of problems. Look what's happened with the stock market going down. Did you get affected by that? By the stock market going down? Yeah. In terms of values you've been affected. A lot of people have been affected. So go ahead what's your question? Do you think he'll be able to retire? we're going to make this country so strong. We're not going to stand for losing $500 billion a year with China, for losing $58 billion with Mexico, for losing hundreds with Japan. We're going to make our country strong again. You know our military. OK. Our military, everyone sees our military budget. They don't realize we take care of Germany. Nobody even probably knows that. We take care of Japan. You know that if we're attacked -- we have a treaty with Japan. If we're attacked, Japan doesn't have to help us. If Japan gets attacked, we're in third world -- we're in the third world war. We have a new war going on, OK? Now what kind of deals are these? What kind of deals? But we take care of Japan. We take care of South Korea. I love all these countries. I think it's great, except we owe $19 trillion. Can't do it. We got to be reasonable. We can't do it. So we're taking care of South Korea. When the maniac next door acts up, we start up those battleships, we start up those aircraft carriers, let's say, and we start up, you know, our planes are flying. We spend millions and millions of dollars. They don't pay us. They pay us very little. You know in South Korea and I love South Korea. I have buildings in South Korea. We have and they're great people. We have a border in South Korea. We have 28,000 soldiers. What they pay us is peanuts. What Japan pays us is peanuts. So we protect the world. Saudi Arabia is the greatest of them all. So we protect Saudi Arabia until the oil went down and now they're making half which is still a lot, but until the oil went down Saudi Arabia was making $1 billion a day, right? We protect them. We protect them, and we protect them for peanuts. So all of that stuff is going to change, folks. We're going to end up with a strong country again, a powerful country, and we're going to end up with a respected country again because we're not respected. We're not respected. All right. Two more questions, come on. Two more questions. And what's your question? Excuse me. Excuse me. Excuse me. My name's Roger and I'm also the CEO of the Motorcycle Rifle Association. There we go. Yeah. And we've endorsed your campaign. We are going to save the Second Amendment, Roger. That's right. I got something for you that's what I'm talking about. Throw it. Throw it. Here you go. Yeah. Give it to me. There you go. OK. Get me that card would you, please. Thank you. Get me the card. Thank you very much. That's what we're concerned about. So you endorsed me? Yes, sir. We did. We did. I heard about that. I heard about it. Thank you. Yes. We're actually participating -- I'm glad I told him to stay. That's your membership card. Lifetime membership. And the bad news is, you saw it there are thousands of people outside. I said why did we get a bigger place? But who knows? Who knows that this is all going to happen. You know things are going on that are amazing, but I don't know if you saw, I just came here. We drove through thousands and thousands of people, and I feel badly for those people too. At least, do we have speakers outside, huh? Does anybody know? Do we have speakers outside? They do? Hello outside. We love you outside. Oh boy that's a lot of people. I couldn't believe it. But we have that all over. I mean we get these crowds that are incredible. There's tremendous love and there's tremendous everything going on. It's incredible because we're going to take our country back. We're going to make our country great again. That's what we're going to do. That's what we're going to do. And it's been amazing, what's going on. So we have a big, big, big election. So Tuesday you have to get to the polls, you have to vote. It's so important. You know they're talking -- thank you. And I'll vote for you. Someday I vote for you. But we have to do it, otherwise, we're just wasting a lot of time. Honestly, we just waste time. You know Ohio has plenty of problems. Believe me. Believe me your real estate taxes are through the roof. And you know what they did is they try not to raise taxes, but they raised everybody's real estate taxes. So the tax increase is absolutely a disaster, and your governor as you know, voted when he was a congressman, voted for NAFTA which is, which is absolutely -- You know Ohio has never ever come back from that. And yesterday I was in Cleveland and you had Ford left, and you had Eton left on the other side. Yes, sit down everybody, What the hell. Just sit down. Sit down. We could be here for a long time. I love it, man. We'll be here for a while. I think I have to come back because in fact, what we're doing -- thank you. No, I have to come back take care of some of those people that -- I feel badly when you have that many people being turned away. That's -- well, in one way it's good, right? Because it means they love you, and in another way, it's a little bad. Now the other candidates do not have this problem. They have empty seats all over the place, OK? They don't have this problem. So Kasich voted as you know for NAFTA and now he wants to vote for Transpacific which is TPP which is going to be worse than NAFTA where all of the things that I've been talking about for years, monetary manipulation. It's what they do with the devaluation. Makes it impossible for our businesses to compete. All of these countries are going -- believe me China's lurking in the background. They're watching. They're not in it, but they're watching and they're going to go in through the back. In a couple of years, and they'll steal it all. So you better be careful and I hope they don't approve it. But Kasich is in favor of it. No good. Now today I watched him on television, and I like John, here is a nice guy, but he said did you see some of Trump's speeches? No I haven't seen them. Oh, he's the only person in America that hasn't seen him. And so he said, did you see him? No. Well, I don't really watch television. When I watch television. I only watch Golf Channel. I don't watch the news. I don't watch sports. I said, wait a minute, we all like Golf Channel too. But you're running for President, the only thing you watch is a television's Golf Channel? So he's not going to do the job, OK? Not going to do the job. We have so many problems with this country. We have so many problems and we're going to make this country so great, so strong. We're going to build up our military and we're not going to use our military. We're not going to have to use our military. Hopefully, but nobody's going to mess with us. We're going to take care of our vets. The vets are very important. They're our great people. We've got to take care of our vets, right? These are great, great people. Thank you. I love that sign. Look at that beautiful sign. Thank you. Boy that's incredible. I tell this story and it's sort of an amazing story, but a very, very good friend of mine is a very successful guy. And he always, I mean always he hears about -- how many people you speak in front of today, Donna? Say 21,000 people in Dallas, 35,000 people a couple of weeks ago in Alabama. He said, how do you do that? This is one of the most successful guys. And I said you know, I don't really know and I'm not a big note person. I don't read speeches because I don't like to. I do, it's easier to read speeches. But you want to put everyone to sleep, just read speeches, right? Plus, you can't comment on things like Golf Channel, you know, with Kasich with Golf Channel. Because you don't put that in the speech because it's too current. I just heard it a couple of hours ago. But, but he said How do you do it? And I really mean this, there's such love in these stadiums and these rooms, and there's such love. They took this room just very quickly because we just wanted to come up here and say hello. You know I used to work in Cincinnati and it's true. Yeah. The Queen City. I love Cincinnati. But I worked here and I tell the story, I wrote about it and I think the art of the deal, but I wrote about it. And it was great. Am my right? Yeah. And it was a great feeling. My father and I, we bought a job called Swifton village and it was very sick. It had I think 11,064 units and I spent my entire summers, two summers working, working, working. I loved the job. I loved, I loved Cincinnati I must tell you. I really loved it and we bought it for very little from FHA Federal Housing, and sold it for a big profit. And we got -- we got out, we sold it and now I know the area hasn't been very good, but at least we're able to protect that. But I tell you it was a great experience. It's sort of like a baseball player gets the first hit or a golfer sings the first three-foot putt or something. And it gave you confidence because you know I was very young when I did that job, and it was my baby and it was just an amazing experience and I loved. I just loved the whole -- the whole deal. And then I -- we also got very familiar with the people of Kentucky. And you know, do we have people? Yeah. But I loved him. And by the way, who won Kentucky recently, right? Right? Trump. So -- but I used to drive as a young guy. I used to drive -- Trump. Trump. Trump. Trump. Well, it adds excitement doesn't it, folks? You know you really ask what are they doing, right? What are they doing? It's the same thing everywhere. You know sometimes not so much. We had one yesterday. We had seven or eight incidents where they stand up and they say oh something, and everybody shouts some down, and you know it's fine. Honestly, in certain ways, in certain ways, it makes it more exciting. OK, to be honest. It makes it more exciting. We might have a couple of more. Anybody else want to stand up right now? So anyways, it's a shame that we wasted two tickets where we have all those great people outside. It's a shame. But I used to, I used to drive to Kentucky. Friday nights I'd spend time in Kentucky. True. And I just had a great time there. I mean, I love Kentucky and it was so amazing. You know when I went out and when I did this, I was not supposed to win Kentucky, right? And did I win in a landslide? We won, we won in a landslide. So they must have remembered me in Kentucky when I was young and they said we're going to give him our vote. But it was amazing. But Ohio is so important. The Tuesday vote is so important because if we can do that I think we're going to do great in Florida. Polls came out in Florida today which are fantastic. Now who knows? Who knows? I mean I think we're going to do very well. Look they have an absentee senator. He's absentee. Totally. He's got one of the worst voting records in the last 25 years in the Senate. He doesn't vote. You know they put him in. He's a young guy, they put him in and he goes out -- you know who I'm talking about, right? Who am I talking about? Little Marco. Marco. Marco. Marco. But, but he's -- I think he got a little nasty with me for a while, but that's OK. He got nasty. They all get nasty and then you end up winning, and you just forget about them. We got nasty with him too. You know in the last debate my daughter and my wife they said don't, just let him say whatever they want. Let them all say whatever they want. Act presidential. I said, I can't do that. I can't do it. When they come at you, you have to come back. Don't we agree? I mean, what are you going to do stand there? You can't do it. You have to, you have to hit him back, and you hit him hard enough all of a sudden they collapse. We think of it. Think of it. Every person, we started off with 17. Now we're down to a few and certainly, a couple of getting out very soon. But including the governor, the governor here didn't win one state yet, and he's not allowed. He didn't qualify. I don't know. Is this a big story? It doesn't seem to be a big story. I don't understand it. He didn't qualify in Pennsylvania. He didn't have the signatures. Does anyone know that? Yeah. It was just announced. He didn't qualify in Pennsylvania. So if he doesn't qualify in Pennsylvania, he shouldn't be running on Tuesday, right? I mean, I think. So anyway, hey look that's his problem. Hopefully, we can just beat him. Who cares if he qualifies in Pennsylvania. But, but he is somebody and he's been very nice to me, I've been very nice to him. But he does this nice, you know this nice routine. Yeah. I want to be the grown up in the room. I want to be. But he didn't start out that way. Do you remember the first two debates? Yeah. He came at me. Oh and I said wait a minute, what's this? And he came at me viciously, and I'm telling you, and that's why I remember because you know now he's been less probably six or seven or eight debates. He's been going, well you know, I'm the guy that's the grown up. I want to be really nice. Take a look at the first two bates -- debates. Remember when I went after him? I said, you ran Lehman Brothers into the ground and it almost destroyed the world. Don't tell me about that. And all of a sudden he sort of shut up, but he was vicious which is OK. You know as a governor, you're supposed to be a little bit vicious, right? But now he's playing the good guy. And then I had some commercials done in New Hampshire. So I'm up in New Hampshire and I -- which I won also. I love New Hampshire. I love those people. I love New Hampshire. You know the problem, New Hampshire has a big problem and I tell him I'm going to take care of this problem. New Hampshire has a tremendous problem with heroin. Can you believe it? New Hampshire is such a beautiful place. It's so pristine. So you know the trees and the beautiful little roads and the countryside, and you go into like groups like this, you know large 1,500 people, 500 people. Every single time you ask a group, what's your big problem in New Hampshire? They say heroin and drugs, and you don't see it. It doesn't go here to, here to, here to, all right, here to. Oh, we're going to build a wall, folks. Don't worry about it. We're going to build a wall. Think of it. We get the drugs; they get the money. Not a good deal, right? Not a good deal. Now we're going to build a wall, and Mexico is going to pay for the wall. It's very simple. Look here's the story. Here's the story. Mexico. Mexico is going to pay $58 billion in trade. This our imbalance, $58 billion a year. That's our imbalance. People don't know that. And these senators come up Marco and lying Ted. You know lying Ted? He walks in, holds up the Bible and I'm beating him, I'm just killing him with Evangelicals because -- Yeah. They don't like liars. They don't like liars. He comes in with the Bible, holds it up high, puts it down and then he lies. I mean, I call him the lying Ted. And you know why he hasn't -- he was supposed to win South Carolina because I think it's 68% Evangelical. And Trump got the Evangelicals, and that was the day after the Pope scolded me. But the Pope was told by Mexico that Trump wants to stop the border, and the Pope didn't like that. And the Pope really, I said you know, sort of interesting. So I'm getting ready, they're getting ready for the vote in South Carolina, and my people come up, Mr. Trump we have a problem. This is the day before the vote. And I say, what's the problem? They said it's the Pope. I said the Pope? I said that's a big problem, right? The Pope, I like the Pope. I do like the Pope. I said Why? What did I do with the Pope? I said let me ask you, is it a good thing or a bad thing? They said, not good. So the Pope hit me because he didn't like the fact that we're going to close up the borders, and people are going to come in, but they're going to come in legally. They've got to come in legally. OK. So and the drugs that are poisoning our youth they're not coming in, folks. They're not coming in. So anyway, OK. That's a long shot. So I got this thing and they say the Pope, and because he was with Mexico, and I like Mexico, and I have a lot of respect for their leadership, much smarter than our leadership. And that's why I mean, we can't make good deals because our leaders are not smart when it comes to trade. Minor things like trade, military, healthcare, common core, all these things. You know they're not too good in any of it, OK? They're not good at anything. You want to know the truth. But so I get a call saying the Pope. So then I sort of -- the Pope was sort of angry because he was told by Mexico that I wanted closed borders. The pope didn't know that tremendous crime is coming across the border. That drugs are pouring across the border -- border and, and just didn't know. I mean he went -- and the next day he was so nice. The next day, the Pope was so terrific, and he did something, he issued something. I don't think it was exactly an apology, I don't want an apology, but he was great. We went to the polls and I won South Carolina in a massive landslide and lying Ted got very few votes, and that was supposed to be his -- that was supposed to be his deal. But people don't know. They just don't like it when people like -- you remember with Ben Carson, by the way, who endorsed me yesterday? This is great. And remember in Iowa where Ben Carson was running, and you know, all of a sudden the rumor was going out all over that he left the race. He didn't leave the race. Lying Ted said he left the race. He's not good and so vote for him, and you can't do that. You know you can't do that. And then right after the election, he went and apologized to Ben. A lot of good that does. They should have disqualified him. You want to know the truth. They actually should have disqualified him and they had it down many different ways. So anyway, so we're going to run and we're going to do some incredible things, and we're going to bring our country back, and we're going to bring it back in every aspect. And frankly, Hillary's a disaster by the way, you know that, a disaster. And despite all of the stuff you see with Bernie, Bernie, Bernie is not a second of me. Bernie is going to be all right. But unless, unless the FBI does its thing because he's got a problem. Anybody else, look at all the people that were so badly hurt by doing much less than she did including General Petraeus, a good guy destroyed. He was destroyed for doing much less than what she did. So let's see what happens. I'm sort of predicting that certainly, they would have done it already if they're going to do it. How can they let her run and then all of a sudden do it? So let's see what happens. But I know she's probably doing OK. Did you ever see anybody embrace President Obama like she's embracing him? Oh, the president is great. He's great. We love this plan. We love that plan. We love everything. She loves everything. TPP interestingly, she originally liked it. Now she doesn't like it. She wants you know -- and then if he wants it, she's going to want it again. So I don't know what his -- if you know his position. You know his position is I like it. So I assume she likes it because everything that he wants. Now why is she being so nice to the president? You know they didn't like each other for years, right? So why? Do you know? Yeah, for him. That's right. That's right. She wants to with Obama. Yeah. For, for him? For him. Yeah, a trade. She'll work with him and she'll make him to bring . Oh, that's interesting. That's right. You know he might just executive order himself into that position. You never know. You never know. I mean, nobody ever heard of executive orders until this guy came along and he -- you know he doesn't do it when you get a group of people in the room, and you make the deals, and he always make good deals for your side, but you make like Ronald Reagan and Tip O'Neill. But anyway, so look we have so many problems. One of the problems actually is that problem Supreme Court. If a Democrat gets in, you already lost. In losing Scalia, that was a terrible thing because he was a great guy. But nobody ever thought, nobody ever thought that was going to happen. I mean it came out of the blue. They were thinking others that were older, and they were thinking others all of us. And that's the way life is. Things happen. You have no idea it's going to happen. That's the way life is. So we love Scalia. So now whoever the new President is could actually get up to four and maybe even five Supreme Court justices. So let's assume that Hillary gets in and she's going to put, well, no. No, if you don't and I'll tell you what. I'll tell you what, a guy like Ted Cruz can never beat her in the general election. Never in a million years, will never beat her. But she gets it. She's going to appoint four or five judges. You will never as a country recover from that. That's one of the most important things. In fact, some people are angry. You know I used to be establishment. I was a big contributor and all that stuff, and then all of a sudden I said run. And they said Donald's running? He's not going to want our money. And if he doesn't want our money, he's not going to listen to us. I'm self funding my campaign, folks and they're not happy about it. They are not happy about it because when the pharmaceutical companies which give millions and millions of dollars to these centers, when all these went all these people, and all these companies, you know, they give it to the lobbyists, and through the lobbyists and the special interests, the pharmaceutical companies, you look at oil and gas, everything. Everything is controlled in Washington. So when I said I'm running. How -- when was the last time you saw somebody run where they said I'm self-funding. Did you ever remember anybody? No, no. Did you ever remember? In Washington, they have lobbyists and they have like Rubio up on their forehead, it's emblazoned. I take care of Rubio. I take care of Cruz. They have these people, their lobbyists, they're very good. You got to pay them a lot of money and they go in, and they get you what you need. You know usually, usually they get you what you need. But these guys are totally controlled like the drug industry does very little bidding. They bid like you know, they get like if you go to the drugstore and buy drugs, drugs to make you better, right? I mean, you're paying the same price. The United States is the largest drug buyer in the world. When you think we'd be able to buy pretty well, we don't buy. We don't bid. And then you look at it you know, people like Woody Johnson of Johnson & Johnson was in charge of Jeb Bush's campaign. So what would happen if Jeb got in? Jeb didn't make it. I guess you probably heard that tepid. But he says low energy. We don't need low energy folks. We need very strong energy. When you see China, when you see the way I've done a great deal with China. I made a lot of money with China. When you see China coming at you and you see Japan coming at you, and you see Mexico, you saw Vicente Fox the other day, right? Where he used the F-bomb, nobody reported it. They didn't care if he used the F-bomb. Can you imagine if I said what he said? I told people this morning, it would be the electric chair. I wouldn't be here right now. It's true. But he said, we will not pay for the wall which made me actually happy because two years ago he said, we won't allow a wall to be built. So now we've already got the first, he's allowing a wall. But he said, we will not pay for the you-know-what wall, right? And they're going to pay. And the reason they're going to pay, very simple. With the kind of money that we lose on Mexico in trade with a trade imbalance. When you have a trade imbalance of $58 billion a year, a $10 billion wall is peanuts, right? So when these guys come off the stage, you don't really mean that Mexico's going to pay for the wall? I say, of course, they're going to pay for the wall. But Vicente Fox was so angry when he did that interview. I don't know. I think it was with CNN. Was it with CNN? Oh back there, look at them. What a lot of -- Boo. The most is that -- you know who's really dishonest? The New York Times. They write stories and never even call me. You don't even have -- they write stories, they're so inaccurate. They don't care. It's a badly run newspaper. It's a horrible -- it's failing. It's going to be -- well, it'll either be out of business or a very rich person will buy it, and just have it as a lava layer. But the New York Times is the worst newspaper. They do a big story. They won't even call you for a comment. They don't care. And when you call them because you want to comment, like I had a person recently for something call. No, we don't want your comment. We don't want a comment. They write a story, then it's all wrong. And they couldn't care less if it's wrong. That's why I said, we have to do something with the libel laws, folks. You have to -- when you libel, you have to be able to go and sue a newspaper, and get them to change, and in addition to that get some money. Now that's not freedom of speech. That's not to change. All we want is for them to be honest. But when you have a dishonest newspaper like The New York Times, you have to be able to sue them. You have to be able to do it because that level of dishonesty, and that's what I talk about so many of them. But the level of dishonesty of the press is beyond belief. Far greater than you would ever think. Believe me because you don't see it as much. I see it. I see it. They do stories that are so bad, that is so wrong, and knowingly wrong, they do it for headlines. They do it for whatever, and they're all having a hard time, you know, they're losing money. But, but a lot of them are losing money because people have given up on them. Like for instance, I go around and whenever I talk about the media, the place always stands up and boos the hell out of the media. They're less popular than politicians which is pretty amazing when you think of it. So so this forum is really cool. I haven't done this in a while. I love doing this. I love this forum. The problem is you don't get that many people in the room. That's you know, it's got to be a little more intimate. But I love doing this forum. So what I want to do is we'll take some questions and then I'm going to come back because we're going to have to do a much larger room because I feel so guilty about what we have over there. I mean really feel guilty about all the people outside, many of whom we told to just leave or come back. Even if I come back after the election, I'm coming back. OK? Well, let me put it this way. Let me put it this way. If I win, I know I'm coming back. If I lose, yeah, maybe not. OK. Go ahead. Nice hat. Cincinnati, oh we love Cincinnati. What do you think, hey, by the way, Pete let him in, right? Right. Yeah. What are they doing? Mr. Mr. Trump. You know before you start, wait. Charlie Hustle, right? So I watched him and I -- he was a great player and it's so ridiculous. Don't you think he's paid the price? First of all. He didn't bet on his -- he bet that he would win. Not on the other team or anything, right? But look, he's not supposed to do it. It's a terrible thing. All that stuff. How long has he been waiting like 30 years, like 35 years. He's got more hits than anybody. He was so good. I still remember when he went into second base and he took out Doug Harrelson, right? Right? That was the name of the second baseman. Good. That means it's still good. But you know. We got to let Pete Rose into the Hall of Fame. And you know, you know, Charlie Hustle. If I were the commissioner, honestly, I would do it. He would be so popular. I have never met a group, even people that just used to root against him which was hard to do because he was really good. But even people that used to root against him did say let him in. And I don't know what Major League Baseball is doing, but who cares. But let Pete Rose into the Hall of Fame. Do you agree with that? Better agree. OK, go ahead. This guy agrees, I can tell you with that hat on. And I love you Donald Trump, man, and you're the future of America. Thank you. I just, I just. Just real quick. And I've been waiting 17 hours to see you today. I got here -- Unbelievable. I got here 11:00 last night. I was the very first one here and I just want you to know, and I didn't get front row, I'm in the second row. But with that said -- Were they here before you? No. Right? That's pretty good. I would love to get a picture with you before I leave today. I'll do that. I'll do it. Thank you. OK. Thank you. Go ahead. Right over here. Hi, I'm Robin from Cincinnati soldiers' support. I have a very special person here with us today, Mr. Keith and I think, everybody, everybody in this room knows who Mr. is. Um -- Where? where? Mr. Keith . Keith stand up. Oh, hey Keith. I'm going to let Keith ask the question. A lot of courage, right? Keith is a veteran and his son was captured in Iraq and he was killed. And Keith would like to ask you a question because we all know that that you support our veterans POWs and everyone else. More than anybody. Mr. McCain he went through years of trying to get his son back. John McCain would not help him. We know that you would help our POWs. John McCain has not helped a lot of people like he should that I can tell you. It's true. Go ahead. How are you doing? How are you? Good morning, sir. Nice to see you. Go ahead. I come here because you made a comment to John McCain. OK. That you don't think that captured soldiers are heroes. Oh no, no, no, no. I was. I never did that. You know that. But what I want you to do. OK, go ahead. Is just clarify that for me. OK. Because I think it's important for all these people here. Yeah. And for a lot of veterans that's in Ohio, especially Ohio. And I know what you were doing. You know exactly what I was doing. But I want you to disclaim that. But they argued, just so you understand and real heroes, OK? You know that. Thank you. Oh, that's for me. Wow, Thank you. Very nice. I like that. Thank you. You know that, OK? Thank you. We know. Thank you very much. Appreciate it. OK. Who else? Go ahead. Go ahead. Mr. Trump, I have four sons in the Army, and my one son is a nurse psychiatric practitioner. OK. Dealing with the PTSD. He tells me every day that my son, Lieutenant Courter is overwhelmed dealing with this. What are your plans to help him out? And he does want to support -- You're talking at the VA? No. He, he actually is a Lieutenant in the Army, he's a nurse practitioner, psychiatric nurse. Right. So there -- he's the one they see first and the biggest issue says that no one in the VA, very few of them understand what they have gone through. He's telling me that it's better that they have some help. They need more help on the psychiatric side to help him transition these soldiers out, and he has none. He says he's -- It's true. over -- totally overwhelmed, and he says we've got to get the soldiers who are unemployed or don't have jobs. He said I would love to have them help me to deal with us. And there's nobody else. One other quick thing. We need a new first lady since Nancy's gone. OK. Well, so that is such a big problem. And I hear from so many different people. And also I mean, the big problem is with the VA. It's horribly run. It's a corrupt enterprise. It's really corrupt. And you look at what's going on in Phoenix with the VA, it's a disaster, a complete disaster. We're going to take care of the problem. They are having a tremendous problem with that. I fully know it. I fully understand it. We're going to do something about it. We have no choice. We have to do something about it. The truth is we have to treat our veterans much, much better. Our veterans are not being treated well, right? Thank you, man. Thank you. How about -- how about over there, the young man in the middle. Go ahead. Hold on, hold on, hold on son. You get up together? Good. I like that. Do you know each other? Yeah. we're here together. Yeah. Hi, this is my friend Lily. We're both from Dayton, Ohio. We were actually at your rally yesterday. Oh, good. Was it good? Was it good? Yeah, it was amazing. Yeah, that was nice. That was great rally. But actually we're both interned for Senator Portman here in Ohio and we volunteer for your campaign. But we were just wondering, maybe you heard or maybe you didn't. John, you said just earlier this week, refused to let 17-year old who are even going to be 18 by the general election not vote in this primary. And I know that a lot of young voters, a lot of people we talked to support Bernie or Hillary, and he is a Republican. So what do you feel about? Well, you know interestingly, we have a lot of young people. They don't talk about it. We have -- you saw yesterday and you see all the time, and yourselves. We have so many young people at these rallies it's incredible. Look even here, look at this. Look at all these. Stand up all you young people. Now look at -- now we have. I would bet you and you know, I would, I would seriously think we have as many young people at least as Bernie. We have so many young people at our rallies, and it actually surprises me to a large extent. So you're talking about the 17, you're voting for Trump, right? You're OK with me. You are OK with me. You can vote for me anytime. So what's going to be the problem. Go ahead. No, I was just curious is that even though he's a Republican, do you still support him with that? Or do you think that -- Do I support? John, you said with his decision. Well, I have to look at the decision darling. Honestly, I have to look at it. You tell me what to do. You're with me. You're working with us. You're a volunteer. What do you want me to do? If I could vote, I actually missed the deadline by four months. I would definitely vote for you. Ahh, we love you. Thank you, honey. Thank you. Thank you. OK. Go ahead. A young one here, a young one. You are young. How old are you? I'm a seventh grader. Wow, that's beautiful. So many young people, so many young people. Go ahead. Um, I like to know what you would do from my education in the next four years. No. 1, your country is going to be safe because you know if you don't have a safe country and with people that aren't very good at what they do, like the people running our country now, you might very well, and don't underestimate this, you might very well not have a safe country. And it's so important. You know No. 1, the No. 1 thing we have to do is security, safety, and I'm not just talking at the border. I'm talking about our military. We have to build it up. We have to replenish it. You know a friend of mine has a son who is in -- he's served three terms over in Iraq, three tours and he comes home, and I see him. And his biggest complaint is that the enemy has better equipment than us, and it's our equipment. So we give the equipment to people that we think are working with us. You know the old story's been going on for years and the bullets fired in the air, they dropped the equipment and run. Brand new Humvees, brand new everything. And he's saying we have older equipment and they have beautiful new stuff. And it really bothers the hell out of them. So we're going to take care of that, folks. We're going to take care of it. We're not going to let this kind of nonsense happen anymore. We're going to work very hard on education. Just so you understand, Common Core is dead. You know what Common Core is? And most importantly, most important thing we can do in terms of education for you and your age. We're getting education out of Washington D.C. run by the bureaucrats, and we're going to bring the education to the local area. You around this area? We're going to bring the education where your mother and your father, and everybody else's parents and uncles are there. They, they, they love. They love you. Do you think your parents love you, huh? They run it with love, OK? In Washington, and look not everybody's bad, but you basically have bureaucrats they want to make -- you know they get a lot of money, and they don't know what's going on in Cincinnati and they don't know what's going on in Ohio. So we're getting rid of Common Core and it's going to be dead, and we're going to have local, locally based education. And you're going to see a big difference. Big difference. All right. Very important. Good question. It's actually a great question. OK. How about over here. What about you, right there red? Can we, can we get to -- Hold on. Hold on. I'm from Ohio and my entire oh -- Look at me, right. I'm from Ohio. My name is Misty and my entire family is from Kentucky. They were all very happy to vote for you in the Kentucky primary. Thank you. Thank you. It is so refreshing to have a presidential candidate that is not bought and paid for, and is self funding. That is definitely true. That is -- And I 100% believe in you that you will make America great again. Aww, thank you so much. That's better than a question. I love it. We'll take care, OK? Thank you. Thank you, whole family. Now that was such a great thing that happened in Kentucky because in theory, people would say you know, what? How does Trump, a couple of people said, how did Trump win Kentucky? And we didn't even win it. We won in a major, major landslide. And I love Kentucky, I'll never forget it. OK. Go ahead, darling. Right here. Right here. Hold on. Hold on. I love this every once in a while you know say I'm saying? Hi, I am Evelyn Scalevich. Mr. Trump I don't have a question for you. I'm really glad to hear the other questions, but I just wanted to tell you that I am so happy that you are running for the next President of our country. Thank you. Where are you from with that beautiful accent? Yeah. I am from Managua, Nicaragua, Central America. I'm telling you, the hispanics. Yes. We're going to do so well with Hispanics. Yeah. People know. And what I wanted to say also. I want to thank you for what you are doing in our country. You are giving our country the opportunity to dream, to hope that there is hope in America. That we have a Christian nation, and that we are country of laws and that we are a sovereign nation. And I want to give you thanks. God bless you. Thank you, darling. That was so nice. Wow, thank you, darling. That was so nice. That was -- come here. Get over it. That was so nice. Come here. That was so nice. Thank you very much. And you are so and so. I love your blue eyes. Thank you very much. That's so nice. Thank you. OK, who has a good question? Who has a good one? Let's go. Let's go. We've got to go here. Go ahead. The big strong guy here. Right here. I'm coming. Everybody let me in. Go ahead. Just got out of football practice. Hi, I'm Zach I'm from Kentucky. Whooh, I have one question. On what day in office will you put Hillary in prison? Yeah. So you know there's a 6-year statute of limitations, I guess. And Hillary's fighting for a lot. Yeah, if she makes it. Nothing's going to happen if she doesn't make it. Certainly, you have to look into it and you have to look into it very strongly because so many lawyers whether you watch him on television, whether you read them in the newspapers, whether you see them wherever you see them. I mean, very rarely do you see a lawyer that says that she's innocent of this this horrible situation. And you actually have to ask yourself why'd she do it? What's the big deal? Why would she do it? Why would she do that other than it's always the same thing with them. It's sneaking around the corner, it's sneaky, dirty stuff. It's gone on like that for years. It's gone on like that for years. So I will tell you, you know No. 1, it's not me, but certainly, people are going to look and you know what, if there's anything wrong and you have to do it, you have to do that. You have to do that because so many people have asked me that same question and you have no idea, and she's being protected. Look, let's face it. Look, it's not complicated. What she did certainly to me is certainly, she broke the law to me, what do I know? To me she broke the law and it looks so bad from the standpoint of the rest of the country and even from the standpoint of all those people that did something much less. So many people did something much less. How do you think they feel? How do you think Petraeus feels? How do you think all these other people feel? And here she is she's got a clear path to running for president. But you know what? The first thing I have to do with Hillary is beat her. The next thing we'll do is we'll look into that, OK? And we'll beat her. We'll beat her. And you know it's interesting, we haven't even started on her yet. I'm going to finish off the -- we have to finish off the deck. We have to finish off the deck. And the best thing you could do honestly. Your governor, remember NAFTA. Get rid of this -- look, just get rid of letting him be governor. One other thing about him. He runs for president. He's lived in New Hampshire forever. He said there he had the record, more than Chris, more than anybody by far. He lived in New Hampshire. He moved out of the state and he said he was going to win New Hampshire. He did poorly there. He then moved to -- right? South, didn't he? I mean he didn't -- I think he went to South Carolina and then he moved to Michigan. Now he said I thought, and I must be mistaken, but he said that he's going to win Michigan, and he's going to win it easily. I won it in a landslide. But he said he's going to win Michigan. He's going to win it easily. So he went to South Carolina, he stayed there. Lost. Lost in New Hampshire. He went to Michigan and I thought he said because it's a neighboring state. I thought he said he would win Michigan and if he didn't win, he'd give up and let him be a governor. But he moved to Michigan spent all his time in Michigan. And you know you people have a lot of problems. You call industrious dead, your steel industry is dying, it's dying badly. He's voting for the wrong things and the TPP in particular. And you know he should be home be governor, but he moved to that. So now he goes to Michigan and two weeks ago, I won Michigan by a lot. By like a landslide, essentially. Yeah, a landslide. And when I won Michigan I said, oh good. Kasich is going to drop out of -- he's going to drop out of Ohio and that's good. But he didn't drop out. So you know, I think you got to show him, folks. You can't do that. You can't be an absentee governor. You got to run for governor, you got to be governor. And you know what? If you don't want to do that you take out and same thing with Marco Rubio, he runs for the Senate, he never shows up to vote. The guy never shows up to vote, and the people of Florida you don't think they get it? Take a look at his poll numbers. They really get it because what he did to the people of Florida is defraud them. He said I'm going to run. I'm going to represent you. Im going to represent you, and about 15 minutes after he got in he starts running for president. That is wrong. And by the way, other people running for president they get to vote a lot more than he does. He never votes. Think he's going to set an all time record. So let's see what happens. But we got to win in Ohio. If we can win Ohio, we're going to run the table, folks. We're going to run the table. Had a winner in Ohio. Go ahead, give her that mic. You just shout it out. Go ahead. I just hope to say -- are you hearing me? Yeah. Go ahead. My husband is in the military, he's a Navy Seal. Now I -- That's great by the way. That's -- Not just the firefighters and -- Good. And he's done 20 years in the fire service. He's going to retire in June, but he's afraid to retire. He says he's afraid he's not comparable and he's going to have insurance in getting his -- A lot of people are in there saying they want to retire. They're afraid that they're not going to have anything to go by. They think their insurance companies are going bust. They think -- a lot of, a lot of problems. Look what's happened with the stock market going down. Did you get affected by that? By the stock market going down? Yeah. In terms of values you've been affected. A lot of people have been affected. So go ahead what's your question? Do you think he'll be able to retire? we're going to make this country so strong. We're not going to stand for losing $500 billion a year with China, for losing $58 billion with Mexico, for losing hundreds with Japan. We're going to make our country strong again. You know our military. OK. Our military, everyone sees our military budget. They don't realize we take care of Germany. Nobody even probably knows that. We take care of Japan. You know that if we're attacked -- we have a treaty with Japan. If we're attacked, Japan doesn't have to help us. If Japan gets attacked, we're in third world -- we're in the third world war. We have a new war going on, OK? Now what kind of deals are these? What kind of deals? But we take care of Japan. We take care of South Korea. I love all these countries. I think it's great, except we owe $19 trillion. Can't do it. We got to be reasonable. We can't do it. So we're taking care of South Korea. When the maniac next door acts up, we start up those battleships, we start up those aircraft carriers, let's say, and we start up, you know, our planes are flying. We spend millions and millions of dollars. They don't pay us. They pay us very little. You know in South Korea and I love South Korea. I have buildings in South Korea. We have and they're great people. We have a border in South Korea. We have 28,000 soldiers. What they pay us is peanuts. What Japan pays us is peanuts. So we protect the world. Saudi Arabia is the greatest of them all. So we protect Saudi Arabia until the oil went down and now they're making half which is still a lot, but until the oil went down Saudi Arabia was making $1 billion a day, right? We protect them. We protect them, and we protect them for peanuts. So all of that stuff is going to change, folks. We're going to end up with a strong country again, a powerful country, and we're going to end up with a respected country again because we're not respected. We're not respected. All right. Two more questions, come on. Two more questions. And what's your question? Excuse me. Excuse me. Excuse me. My name's Roger and I'm also the CEO of the Motorcycle Rifle Association. There we go. Yeah. And we've endorsed your campaign. We are going to save the Second Amendment, Roger. That's right. I got something for you that's what I'm talking about. Throw it. Throw it. Here you go. Yeah. Give it to me. There you go. OK. Get me that card would you, please. Thank you. Get me the card. Thank you very much. That's what we're concerned about. So you endorsed me? Yes, sir. We did. We did. I heard about that. I heard about it. Thank you. Yes. We're actually participating -- I'm glad I told him to stay. That's your membership card. Lifetime membership. I like it. I like it. Thank you. Good deal and we're covering a lot of motorcycle rallies, right now for you and now for all that help. You know it's a funny thing. I don't get it, but I do get it. You know the motorcycle guys love Trump? Do you know that? Yeah. Every place I go, right? And I'm not too much on the motorcycles, right? But, but every place I go, there's hundreds of guys with motorcycles and they say we love you Mr. Trump. We love you. You know what they love? They want to see a strong country. They want to see a strong military. They want to see a strong everything. They want infrastructure. They want our highways fixed. I mean, if I'm driving a motorcycle I don't want to go over potholes believe me, OK? Not good. But the motorcycle people love Donald Trump. Go ahead, darling. Go ahead. I just want to say my sister is in South Carolina. She's the top activist for South Carolina. Right. Her name is Michelle Wild and she works with Gerri McDaniels. Gerri is great. I know Gerri. Can I come up and hug you? Come on. You know what? Let her come up here. Come on. Oh, OK. How about, how about one more. Who's, who's got a good one? Wait, I have to get a hug. I have to get a hug. Come on. We love you, Michelle. Come on. You're great. Say hello. She's fantastic. Thank you, everybody. All right, who's got a good one? Who's got a good one, huh? Maybe I have to go back here, right? How about -- who's got a good one? Who's got a nice -- go ahead, sir. Go ahead, the two of you right here. Go ahead. My name is Katrina. Right. And I'm Native American. Right here you go. Here you go. My name is Katrina and I'm Native American. Great. My Native name is woman who sees. Ah. Do you know that all of the other ethnic groups that we've supposedly done things to have been apologized to, but at no point the Native Americans have been apologized to after you take -- maybe in the first month or so you can say I'm sorry as I could be that we did what we did to you. Well, I'll certainly look into it. You know I haven't been big on apologizing. You do know that, right? They complain, Trump never apologizes. I'll look into it. We're going to do one more. I'm going to look into that. OK. Let's go. One more, come on. We want a good one. Give me a fun one. Give me a fun question. OK? All right. Go ahead. It better be good because I don't want to leave with a bad question. Make some room. Come on. Worst thing you could do, you do well, you do great. Everybody's having a good time. And then we get a bum question. What are you doing? I'd just stay there. Go ahead, relax. Go ahead. OK, Mr. Trump, first of all, I want to thank you. You and your family for stepping out in faith to take this country forward. I so far like this question. OK. The second thing and I know what impressed me the most about you is your strategic ability to get things done. If I was to ask you in a unified manner because you've got people on one side of the aisle, the other side of the aisle which I disagree about the aisle anyway. I think we ought to be working together. But strategically, what could you do or what do you see yourself doing in your plans to improve and bring leadership and dedication, and integrity back to Washington D.C.? Well, let me just say, you know, it's sort of the kind of question that's very important. Not exactly the most exciting question, but you know what it is? You know what it is? Look. You have an ability to lead. You either can lead or you can't lead. And you can learn something about leadership, but basically you're a leader or you're not a leader. I'll get people together. We're going to make great deals. We're going to make conservative deals. We're going to make wonderful deals. We're going to get along with people. We're going to get along with Democrats. We're going to get along with Liberals. We're going to make deals. You know you can't have Obama just everything he signs an executive order and then they'll start getting thrown out by the courts at some point, and maybe not because of the Supreme Court goes the way I mean, all of these things will be upheld. But look. We need great leadership. We're going to -- we just discussed with this man's great question. we're going to be leading on education. Get rid of Common Core. We're going to lead on education. We're going to lead on healthcare. We're going to get rid of Obamacare repeal and replace. We're going to lead with our military. We're going to lead at the border. We're going to take care of our vets. We're going to do so good. And you know what's so important? We don't win anymore, folks. We don't win anymore. You know you look at our country, when was the last time you saw a victory with our country. We don't have any victory. We have a military can't beat ISIS, right? Can't beat ISIS. You look at our great generals of the past is spinning in the grave. They can't beat ISIS and we don't fight them. We don't fight to win anymore. We fight to be politically correct. If your going to have an enemy, you got to win. You got to win. Look at the way I'm doing. I mean, you got to win. You've got to take them out. You've got to take them out. So look, folks. We're going to start winning again. We're going to be the smart country. Right now we're not a respected country. We're going down. We're going in the wrong direction. We're going to start winning on healthcare, on borders, on military. We're going to win so much. You're going to be so happy. You're going to remember this day and you're going to more importantly, remember Tuesday when you go to vote. And in two years and three years, and ten years you're going to say there was a single greatest vote I ever cast. I love you. I love Ohio. I love Ohio and I love Kentucky. And I hope you go out and I hope you vote and bring us home a big beautiful victory on Tuesday. Thank you. We will make America great again. Thank you very much, everybody. Thank you."}