{"id":427,"author":"Donald Trump","title":"Speech: Donald Trump in Boca Raton, FL","date":"2016-03-13","link":"https://factba.se/transcript/donald-trump-speech-boca-raton-fl-march-13-2016","paragraphs":["We love Boca. We love Florida. Beautiful. Great to be with you tonight. This is incredible. It's not too far. This is my second home. I love Florida. And I hear my man, Steve, did a beautiful job explaining what a lousy senator you have. Is that right? He did a great. Tell you, Marco doesn't vote. You got to go vote.","You know, interesting, you get elected to the Senate, you got to go vote on occasion, right? He set a record, one of the worst records in the last 10 years for no voting in the Senate. So we don't have to go into it too big. But you know what's gonna happen? We're gonna make America great again, folks. We're gonna make America great again.","So we had an interesting week. On Friday, we went to Chicago. We had 25,000 people coming. No, it's OK. We had 25,000 people coming. We had some, I would say, they were, let's be nice, protesters, OK? Let's say, let's call them protesters. And we had a decision to make. We had to make this decision. We want peace.","We want happiness. We want everybody to go home really happy, really peaceful. So we said you know what we'll do? We'll postpone it. And it was a very wise decision. We've been given a lot of credit. And we've been given really a lot of credit. And you know what? It was an amazing thing. And the other side actually said, This didn't work out too well because all over the world they're talking about what took place.","And they're talking about us and they're talking about how well we handled it. And they're talking about the fact that nobody got hurt. Nobody got injured. Everything went smooth. It was a nice easy breakup. So that's the way we have to have things go. And I love you people for being here tonight. Thank you.","So -- I love you too. It's a guy. It's a guy, but I love you. I love you. So this all began around June. But around January I said, I have to start thinking about it. Too many mistakes are being made by the politicians. Too many mistakes are being made by people that truly don't know what they're doing. And we can't have it anymore, folks.","We can't have it anymore. Our trade deals are the worst anyone's ever seen anywhere in the world. You go anywhere in the world, we're like the lapdog for the world. We're like the people that don't know what they're doing. We're not gonna take it. What happens is China this year going to make $500 billion in terms of trade deficit.","Can't have it. Mexico, $58 billion. Think of it, China, China 58 -- China -- Mexico, $58 billion. China, $505 billion in a trade deficit. It doesn't work. It doesn't work. It doesn't work. So what's going to happen is we've got the greatest negotiators in the world. Carl Icahn, all of them, they're calling me. They all want to be involved.","We're gonna negotiate the greatest trade deals you've ever seen. We're gonna turn it around. We're gonna turn it around fast. We are gonna become rich again. We're gonna become great again. We're gonna take care of Social Security. We're gonna take care of Medicaid and Medicare. We're gonna take care of all of the things that frankly, right now, we can't do, OK? We can't do. So we're gonna take care of it. Now when it started I was coming down the escalator in Manhattan.","And when it started, it was about the border and it was about trade. The border is a disaster. Drugs are pouring across. Crime is pouring across. We've got to strengthen our border. If you don't have a border, we don't have a country. Is that right? Oh, we love that wall, don't we? Oh, we love that wall.","That wall is gonna happen, folks. Do you remember when I first brought up the wall? Everybody, all of these people -- first of all, they're all controlled by their special interests. They're all controlled, every single one of them, they're controlled by their lobbyists. I know the politicians better than anybody knows the politicians.","I've dealt with them all my life. If you can make it with a politician, you can't make it at all folks, OK? So they're all controlled. I'm self funding my campaign. I'm not controlled. I don't have anybody's money. Nobody is gonna tell us what to do. I'm working for you and I'm working for you. I'm working for you, folks.","Believe me. So it began and we started talking about trade. Now trade, we understand and trade, you know when they do polls, on trade, on the economy, on finance, on leadership, on all of this stuff, we lead by so much. I lead by so much. The personality -- and they don't love it so much but that's OK. Who cares?","Who cares? Who the hell cares about that? We want it. We got to straight down our country. But I'll tell you, you want to know the truth? I'm a better person than the people I'm running against, that I can tell you. And I'm a better person than Hillary. Hillary is not good. So -- thank you. You know, I tell you, a little while ago, a friend of mine said to me, how many people are you gonna be speaking in front?","He's down in Florida, very successful guy, very wealthy guy. In fact, maybe I'll use him to negotiate against Japan, OK? Believe me. Believe me. All you have to do is go home, relax. This guy makes -- he only makes good deals. So what happens, what happens, he said, how many people are you speaking in front of? I said, maybe about 12,000, 15,000. He said, how do you do that?","I said, you know, honestly, and by the way, no teleprompters, right? No teleprompters. No teleprompters. I saw Hillary last week, it was outside, there were two teleprompters. They were massive. They were so big and they were painted black on both sides. They were painted black, so you couldn't even see her.","And I said, what are we doing? No teleprompter. Do you notice I'm not reading speeches. No reading speeches. No reading speeches. Speak from the heart and from the head, but speak from the heart. We got to do it. We got to do it. We speak from the heart and from the head. I mean, you know, let's not forget that.","But we've got to do it. So look, I love this group. This is a good group. Go ahead. USA. USA. Man, what spirit. Look, how young some of these people are too. Look at them, young, young, young and beautiful and wonderful and great heart and great everything. Unbelievable. I'm telling you and I told this guy, I said, there's so much love in that place.","There's -- and this is, by the way, we have a movement going on, folks. This isn't just us here. This is all over the country. Same thing is happening. Same thing is happening. So remember, and I guess you've been seeing it, cover of Time Magazine many, many times, cover of everything. The biggest political story in the world today are the millions and millions of additional people far more, far more than four years ago.","Not even a contest, up by 70%. Some states up by a 102%. And I love that sign. It says, Hispanics for Trump. I love that sign. Thank you. I love you. You know, they do the polls, the exit polls and I always win with Hispanics, which nobody understand. But you understand it because we're gonna bring jobs to the United States.","And when you're here legally, other people aren't gonna be taking your jobs, right? So they understand it. But you know, the exit polls, you come out, I win with women. I win with men. I love the women. I do love the women. I win, I win with women. I win with men. We win with the military. We win with the vets.","We win with young. We win with old. We win with highly educated and we win with less than highly educated and we love them. We won with every single category, everybody. So the point is we have a massive situation going on. And honestly, it's the biggest story in politics. The biggest story -- worldwide, the biggest single story in politics.","The unbelievable amount of people that are coming out and voting. And you saw it in New Hampshire. You saw it in South Carolina. We won all of them. We won so many of them. I have a list. You know, it's interesting, lying Ted Cruz comes in with a Bible. Ladies and gentleman, lying Ted. Lying, l, y, i, n, '. We can say it the right way.","We got to go, lying Ted. And he comes in with the Bible, right? And he lifts the Bible. And by the way, I win with the evangelicals by a lot because they know I'm legit. But lying Ted comes in with the Bible, he raises the Bible, he puts the Bible down and then he starts lying. So it's lying Ted. Actually, you know, little little Marco what we did -- No, no, no. Now, he's a little, l, i, d, d. Little Marco.","You know, we have to you have to brand people a certain way when they're your opponents. Like Jeb Bush, we call them low energy, low energy. You know, the first time I saw Jeb -- and I don't care talking badly about him. He spent $29 million on negative ads on me. $29 million, can you believe it? He spent a lot of people's money, of his lobbyist and his special interest money.","But you've got a brand people. We brand it. So we started off 17 people up on this stage and what the hell did I know about this stuff. I've never done this before, right? So we start off with 17 people. Now we're down to four. Bush was favored, then Walker was favored, then another one was favored. They're all favored.","Now Trump is favored, OK? It's about time. They haven't learned. So you know, when I was thinking about running, it was really interesting because some of these pundits are not worth anything. These guys at the worst. They say, well, he's not going to run. He's just having fun. He's just having fun. I know he's not running.","There's no way he'll run. Don't worry about it. One guy said, he's just a clown, a clown. Me? I'm a clown. I build a great business, the best business. Nobody has ever run for president did what I did in terms of business and things. We put in papers at federal election, the likes of which has never been seen down there.","We built an unbelievable company, with very low debt. The greatest assets. By the way, speaking of Florida in terms of assets, Doral, right? We love Doral, in Miami, hundreds of acres owned by Donald Trump. So what happens -- and the reason I say, it's some of the greatest assets in the world, low debt, great cash flow.","The reason -- and I filed. Somebody said, oh maybe he won't file because maybe he's not worth as much as they thought. Actually, one of my very successful friends said, now I know how successful you are. Now I know, how rich you are because you filed. I mean you had to file the most detailed papers. And I said, look, it all doesn't matter.","Here's what does matter. We need that kind of thinking to bring our country back where we pay off our debt, where we balance out. We need a certain, we need a certain thinking. So the pundits all said, oh, he'll never run. He's just having a good time. Somebody said, he's doing it for branding. I'm doing this for branding.","I can think of other things believe me other than -- I love you folks. But I can think of places I'd rather be, right? We can think of places we'd rather be. So what happens, so what happens, they said, well, he's just -- now I watched them tonight and they are the same guys. He's not gonna run. Don't worry about him.","You know, they're also cocky. Now they're saying, how do we stop him? What's going on? What's going on? How do we stop him? You know, no, it was very funny. I mean, these people are the worst. They're the worst. Let's see them run for office someday. They wouldn't have a shot at it. And one of them actually said, now one of them actually said, this is the most talented politician I've ever seen.","I said, I don't want to be called a politician. But it's very interesting. So they said, how do we stop him? How do we do it? How do we do it? And Jeb actually said, I don't know if he can be stopped. He's a gifted, gifted politician. And my wife said, let me ask you a question, this was a month ago before he dropped out.","They said, let me ask you this question, darling. Why did he call you a gifted person? You're a gifted person if he's fighting you? Now, do you know why he called me a gifted person? I will not say because he's stupid, OK? I'm not gonna say that. Why? Why? You know why? Because we're gonna do things that have never been done.","We're gonna straighten our country out. We're gonna do it fast. It's gonna be done properly. We're gonna strengthen our military. We're gonna knock the hell out of ISIS. We have to do it. We have to do it. They're chopping off heads. They're drowning people. You know, you probably saw it during one of the debates.","By the way, who won the last debate? Could I ask you? You know, I'm against these guys. They're politicians. All they do is debate. Their whole life is to debate. And Ted Cruz is a good debater. I said, he's a good debater but he can't talk properly. It's true, right? He's a bad talker. Good debater. But you know what we're gonna do? We're gonna go one by one, we're gonna go step by step and we're gonna solve our problems and we're gonna solve them fast.","And a woman came up to me because I explained we're the policemen for the world. We're spending a fortune on Germany. We're spending a fortune on South Korea. We're spending a fortune in Japan. You know, we guard Japan. Now if something happens to us, Japan doesn't have to help. If somebody attacks Japan, we're in World War 3 folks.","I hate to tell you, OK? Germany, we take care of Germany. Now Germany is an economic behemoth. They don't pay us very much. We lose on everything. We don't win anymore folks. We're gonna start winning like you've never seen anything win before. We have all the cards. We have the cards. So here's the story and I tell it, and I tell it strongly because I just feel that we have to be -- we have to at least -- we like to help people, right?","We all want to help people. But, but it's got to be fair. Now, with all of these countries we're spending money somebody said, our military budget is 10 times higher than anybody else's, but that's because we're taking care of the world. Saudi Arabia. Saudi Arabia, before the oil went down, now they're still a billion dollars a day and we protect Saudi Arabia.","They pay us peanuts. Not gonna happen anymore, folks. We're now gonna be, we're now gonna be back in the saddle. We're gonna be running it the way it's supposed to be run. You are going to be so happy. You are going to be so proud of your country again. You're gonna be proud of your president, but you have to get out and vote on Tuesday.","You have to do it. Now a big, big thing is gonna be is going to be -- so we're rebuilding our military. By the way, we're rebuilding our military. We're gonna have the finest and you know, what we're gonna do? We're gonna get the equipment that they want, not equipment that's sold to the armed forces because that particular company, even though they don't want it, has better political connections with the guys that I'm running against, OK? We're not doing that anymore.","We're getting the right stuff. We're getting this stuff. How often have you seen that we're stuffed, they stuff it down your throat. Equipment that the soldiers and the generals don't want because a company is politically connected. No more folks. Not gonna happen. Not gonna happen. Now here's what we have to do. And it all changed because something changed and it was very big.","But here's what we're gonna have to do. So important. We are gonna do new trade deals. We had a company and you saw just the other day, a couple of weeks ago, Carrier said, we're moving out of the United States. We're moving to Mexico. I made a speech, I made a speech yesterday in Cleveland. And in Cleveland, where by the way, the governor is raising real estate taxes through the roof.","He approved NAFTA. He's now approving TPP, which is gonna be worse than NAFTA. I'll tell you what, if we can't beat Kasich, we have ourselves -- I really think we are going to do great, not only in Florida -- and let's not say that we have a 21 point lead because I want you to vote. Let's assume we're even, OK? Somebody came out they said, Mr. Trump, congratulations.","In Florida, you have a 21 point lead over a no show senator, over a senator that doesn't work. What does he do? What does he do? So I said, do me a favor. Let's not tell the crowd that we have a big lead. Let's tell the crowd, well, we can never lie, but let's say it's tight. It's sort of tight. We want you to get out and vote.","But remember this, in Ohio, in Ohio, it's pretty even with Kasich. And people don't understand what's been happening in Ohio. They've lost a tremendous amount of their business. I went to Cleveland yesterday, I made a speech in front of a massive, like a massive crowd and they were saying, Eaton left. They're over there.","I mean, I'm right in this big convention center owned by the great Patrick Park and his family, great people. But they said, Eaton left. They're on the right. Ford left. I said, let me guess, where did they move? They said, Mexico. Mexico. Nabisco left for Mexico. Look, look, folks, the reason we have this whole thing going.","The reason -- and I mean it. I was starting to say before, this is a massive movement. This is not -- they say, these people, most dishonest people, look at all those people back there. Look at all those cameras there. Look at all those cameras. And unless we have a protestor, the cameras are never gonna show the crowd.","Do we have a protestor or anyone? Do we have a disrupter? Because unless we have a disruptor, I don't even call them protestor. I call disrupters. Unless, we have a disrupter, the camera never goes off my face. They're all live. They never go off my face. Is there a disrupter in the house, right? So here's the story, look.","So in Cleveland, I looked and you look at the business being drained out of Ohio. I mean every place, not every place. A lot of it's going to Mexico. Pfizer, the great pharmaceutical company, did you see what they're doing? They're leaving. They're going to Ireland. So here's what we're gonna do, let's use Carrier as an example.","Now my daughter Ivanka. Did anyone ever hear of Ivanka? Huh? And my wife, Melania. They want me, they want me to be presidential. So they said on the last debate, darling, we love you. My daughter said, Daddy, just be low key. If they say bad things, you don't do too much. I said, I can't do that. My wife said, be presidential and it was good.","I sort of like the other way better to be honest with you. I mean, I'll be honest. You know, they want me to be put. But here's the thing what I'll do, I'll do this even if it's not very president because you're president. OK, let's say, we win. Great. We win as president. So now, what I do is the following.","I call up Carrier. And you know, I'm a conservative person and I'm very conservative on military and taking care of the vets. And we're gonna get rid of Common Core. We're gonna bring education locally and we're gonna repeal and replace so much less expensive. And we're gonna have strong borders and yes, we're gonna have the wall.","And yes, Mexico is gonna pay for the wall, 100%. But here's what they say, some of the conservative guys who aren't really too smart. You know, this National Review Group, they had 18 guys write a negative piece about me. And after that, my poll numbers went up seven points, OK? Do you believe? So they say, National Review, but they say, he's not a free trader.","Well, who wants to free trade if China is making -- if we have an imbalance with China of $500 billion a year. We don't need to free trade for that, folks. Mexico, the reason Mexico is paying for the wall is very simple. The wall is not big, OK? We have, as you know, in China, the great -- we all studied, right?","The Great Wall of China. It's 13,000 miles long. It was built two thousand years ago. Look at that sign, it says, build the wall. We're gonna build the wall. Don't worry about it. 100%. By the way, 100%. 100%. So our wall. We need a thousand miles because we have a lot of natural barriers and a lot of things.","It's actually 2,000. But we need a thousand. And by the way, just so you understand, I love the Mexican people. I love the Hispanic people. So many work for me. I deal with them in business and everything else. They're great people. The problem is their leaders are far too smart for our leaders. Our leaders don't have a clue.","So here's the story. Everyone said and a couple of these guys came off the stage that we were competing with their gun. But they came off the stage and they said, you can't get Mexico to pay for the wall. I said, here's the story. We have, we have trade imbalance. Think of it, $58 billion. The wall is gonna cost $10 billion.","How easy is that, folks? You get it, right? You get it. It's peanuts and we subsidize that. We do so many things for Mexico and Mexico is gonna be fine. You know, we are going to have better relationships with these countries. Look at Mexico, remember Sergeant Tambores? He was there for so long. The president probably never even lifted up a phone.","I mean, the answer is I don't think he did. And he was there far longer. He got lost and he shouldn't have been there and he got there. And that kind of stuff that's not a good neighbor policy. The way they treated him. That's not a good neighbor policy. And then you look at China, in the South China Sea, they are building a massive military base with runways and storage of weapons and all sorts of things.","Now, they don't respect us. They're not supposed to be doing that. They're not supposed to be doing it. So we're gonna have -- let me tell you, this is the way it works. We're gonna have economic good relations with these countries. We're gonna make a lot. We're gonna bring a lot of jobs back into the United States.","And we're gonna actually have better relationships than we have right now because they're gonna respect us. Right now, they don't respect us? OK. So here's what happens. So here's what happens with Carrier. It's very simple. I want to do it myself. May I do it myself, please? OK? Even though Melania and Ivanka said, please be presidential.","Because somehow it's not very presidential for the president of the United States to be calling up Carrier air conditioning company. I buy a lot of Carrier air conditioners. I'm not buying them anymore. So here's the story. We have to be proud. Remember we used to have signs made in the USA, right? And we were proud.","When was the last time you saw that sign? You don't see them anymore, right? And you know countries like Japan and I respect this. I respect this. By the way, I'm not angry at China and I'm not angry at Japan. All of these cars come off the truck like they're driving for NASCAR. So fast. I've never seen anything.","I was at the docks. I'd never seen massive boats coming right out of Japan. Now, you know, what we give them? Practically nothing. It's a one way street. It's a one way street. We have all the power. We have to be able to use the power and sparingly and we don't want to hurt anybody and we don't want to hurt other countries economically.","We're getting got to get along great with other countries. But we can't be the stupid people anymore, folks. We can't afford to lose the kind of of money and jobs. You go to Ohio and you go to these different places. The jobs are being sucked out of them. Sucked right out. You go to places -- I was at three or four states over the last supposed to win a lot of these states.","I won Michigan in a landslide because they know I'm gonna bring the jobs, gonna bring the industry back. We're not gonna have this stuff anymore. So here's what I have to tell. So maybe I'll have one of my guys too because it's a little more presidential. I'll have one of my genius negotiators do it. But I love doing it and it's so easy.","I'm gonna call up the head of Carrier. I'm gonna say, listen, listen, here's the story. What you've done is very sad. I saw them. They let 1,400 people go. Not gonna happen. Not gonna happen. So here's what I'll tell them. I hope you enjoy your new plant in Mexico. I hope you have great success and I hope it's a really beautiful building.","But here's the story, every single time you sell an air conditioning unit crossing our now strong border, where they can't just take them come across anymore. Every single time, we are going to have a tax on that unit of 35%, OK? 35%. And by the way, I'll tell the same thing to Ford and I'll tell the same thing to Nabisco.","And all of these companies that are going crazy and they're moving out and they're letting go of people here and they're opening up new. So here's the story and here's what's gonna happen 100% as sure as you're standing there. Here's what's gonna happen. They're gonna call lobbyists, but I can't be taken by lobbyist because I didn't take their money.","They're gonna call special interests. They're gonna call donors. They're gonna call everybody. It doesn't matter. Let let me just tell you. Anybody else, any other politician, 100%. But here's what happens. I will tell them, you're gonna move back, right? And they're gonna say, yes, sir. We're moving back to the United States.","We're gonna build our factory in the United States. We're not moving to Mexico and we're gonna create a lot of new employment. And that's what's gonna happen. That is what is going to happen. And you know what? Unless we do that -- now somebody from the conservative movement, I always say, commonsense conservative, right?","Somebody -- Hello, Darling. How beautiful she is. Somebody from the conservative movement would say, Donald Trump is not a free trader. I am a total free trader. But to have free trade, we need smart leadership. We do not have smart leadership. We'll probably have free trade because once I start telling these people that are abusing us with their monetary manipulations.","And by the way China, they're like your grand chess player. What they do to us with devaluation of their currency is beyond belief. Grand chess masters. But I get the game and a couple of other people get the game. Our president has no clue. We're gonna change it, we're gonna turn it around and we're gonna bring our jobs back, folks.","We're gonna bring our jobs back. Just remember. So the other thing and I'm not sure that Boca feels the same way that a lot of other people do. But when I say this in certain parts of the country, they go wild. Are you ready? We are going to preserve our Second Amendment, OK? We're preserving our Second Amendment.","You know, a lot of things changed. I came down that escalator and I made a speech about illegal immigration. Boy, did I take heat. But after a month, took a lot of heat. But after a month, people realized I was right. People are pouring into this country. The crime is incredible. Then you see so many people being killed and now people are reading it and now it's really at the front of their mind.","All of a sudden, all these other candidates that would have never virtually brought it up. All of a sudden, it's a big deal. In fact, Ted Cruz the other day said, you know, he's talking. And he said, yes and we'll build a wall. He actually said, we'll build wall. I said, where did that come from? So here's what -- here's what's going to happen.","Here's what's going to happen and I mean, I mean, you are going to be so happy. Now, wait a minute, before we do anything, before we do anything, who is going to vote on Tuesday? Is that close to 100%? I think so. Is that 100%? Right. You promise, right? You promise. See, now a politician would say the following.","A politician would say, it's very important to vote. Go out and vote no matter who you're voting for. Very important. I don't say that. I say it's very important to vote, but only if you're gonna vote for Donald J. Trump, OK? Otherwise, don't vote. Do not vote if you're gonna vote for anybody else. OK. All right.","So, so is this -- I tell you what, is this place incredible? Is this incredible? I mean, it's incredible. I love you, folks. I love you, folks. So a couple of things. So we have to be smart. We're going to be smart. We have to be smart. We have to be sharp. We have to be vigilant. Now, we all have big hearts.","I have the biggest heart. I want to take care of people. I'm gonna take care of people. We have to be very careful. The Syrians, the migration, nobody knows who the people are. Nobody knows where they come from. There's no People make a statement and I would say it's true. You look at that mass migration of people.","All because of bad policy. This all happened because of a Hillary Clinton policy and Obama policy. A lot of bad policy. A lot of bad policy. So what we're gonna do is we build and we'll get Gulf State money. We're not using our money. We're gonna build safe zones. We're gonna make them. It's gonna be good.","And eventually, let them go back to their lands. You know, what I find? I have thousands of employees. I have people that come here and they become citizens and they work and they work for years. And you know, no matter how beautiful they do, no matter what, they all want to go back to their country. Countries that you'd be surprised at frankly.","They want to go back. They love their country. And in Syria, I think when it all settles out, which we hope is going to be at least soon. The damage, the horrible, horrible cost of lives, what's going on is terrible. But we're gonna do safe zones and we're gonna get the Gulf States to pay for it. We're not gonna pay for it. But we have to be smart.","We have to be vigilant. We can not let them come into our country. We have enough problems, folks. You saw what the two people did. They got married. She radicalized him. It sounds like. And they blew away, they killed 14 of their friends that had showers, baby showers for their baby and they killed him.","There's something going on. We have to get to the bottom of it. We will get to the bottom of it. But whatever it is, we can't have people come in unless they're fully documented. Unless, we know who they are, where they are, where they come from. So here's the story, OK, in a nutshell. Here is the story.","You have one of the most important days in your life coming up because our country is going to hell. We don't know what's happening. We're sitting on a very big fat ugly bubble. It started to pop with the stock market, comes back a little bit. Watch what's going to happen. But we are going to make some unbelievable and really straightforward just commonsense moves.","We're gonna ask people that we take care of got to pay us folks. These are rich, these are rich countries. You got to pay us. We're gonna bring so much money in that for a lot of seniors and a lot of the people that are gonna be seniors. We're gonna save you Social Security without all the cutting and the changes that these people are talking about.","I mean, if I do my job right, we're gonna have -- we're gonna be in such great shape. But here's the story, you've got to go out on Tuesday. You've got a vote on Tuesday and you're gonna be happy. Because here's what, we don't win anymore. We lose at everything. No matter what we do. We can't beat ISIS. Think of it, General Douglas MacArthur.","I loved Douglas MacArthur. He was a brutal guy. He was a brilliant guy. You know in the history of West Point, I don't know if it's still, but for many years, in the history of West Point, Douglas MacArthur had the highest grades in the history of West Point. That's pretty good. You know that always mean something to be called grades, maybe not everything, but it means something.","General George Patton. Can you imagine, can you imagine George Patton right now he's spinning in his grave when he sees that we're not beating ISIS. We are doing a politically correct war. We have to knock the hell -- they're cutting off heads. They're drowning people. We have to knock them out. We have to knock them out fast.","We got to get back to our country. We have to rebuild our country now. It's time. It's now time that we rebuild the United States. Our roads are falling apart. Our schools, our schools are a disgrace. You see it on television. Rat infested, walls falling down. We build a school over there. They blow it up. We build it again.","They blow it up. We build. This goes on four, five times. And if they need money for Brooklyn, if they need money for Boca, if they need money for any place, we don't have any money to do anything. So I think it is wrong. We're gonna have really smart thinking. We've got the smartest people lined up. We are gonna think so good.","And here's what's gonna happen, we're gonna start winning again, OK? Because right now, when was the last time -- just think about it. When was the last time the United States won at everything? We're losing at war. We're losing at war. We're losing a trade with everybody. We're losing with everybody. This isn't China.","I use China because it's the greatest abuser of all. China abuses us more than anyone. I hope they still like me after this speech, by the way, but I don't care. You know I had the biggest bank in the world. He's a tenant of mine in Manhattan, from China, 400 million customers, the biggest in the world. I own a big chunk of the Bank of America building, 1290 Avenue.","A lot of buildings that I've got through war with China, with China. We could do great against China if we're smart. We can do great. I sell condos. You read about it the other day. I sell condos to people from China for tens of millions of dollars. I love China but their leaders are too smart for our leaders.","We can't let it keep going on. So here's what's gonna happen. winning with our military. We're gonna knock the hell out of ISIS. We're gonna, we're gonna start -- we're gonna knock off -- folks, folks, just relax. We can't, we can't let it go any further. It's too bad. It's too bad. We are going to start winning with our military.","We are going to take care of our vets. We are going have strong borders. We are going to build a wall and we are going to have Mexico pay for it. We are going to have great education. Right now, we're way down on the bottom of the list worldwide, but number one in cost per pupil. We're gonna get that changed around a lot.","We're going to get education taken care of. We're gonna do it locally. It's gonna be so much better, so much less expensive. And we're gonna be proud of our education. Because right now, our system is so broken, it's so bad and people are making so much money out of that system. So we're gonna win with education.","We're gonna win at every single level. We're gonna get rid of Obamacare. We're gonna win on health care. We're gonna win on health care. We're gonna start winning. And I'll tell you and I say it kiddingly, but I mean it 100%. We're gonna win, win, win. We're gonna win so much you're gonna get sick and tired of it. You're gonna say, Mr. President, we can't take it anymore.","You're winning too much. Please, we don't want to win that much anymore. Please, Mr. President. We can't take it. And I'm gonna say, I don't care. We're gonna keep winning because we're gonna make America great again. We're gonna make it greater than ever before. I love you. Go vote on Tuesday. I love you.","We're gonna win again. Thank you. I love you, folks. I love Boca. I love Florida. Go out. Start the winning. Start the winning. Thank you, folks. I love you."],"text":" We love Boca. We love Florida. Beautiful. Great to be with you tonight. This is incredible. It's not too far. This is my second home. I love Florida. And I hear my man, Steve, did a beautiful job explaining what a lousy senator you have. Is that right? He did a great. Tell you, Marco doesn't vote. You got to go vote. You know, interesting, you get elected to the Senate, you got to go vote on occasion, right? He set a record, one of the worst records in the last 10 years for no voting in the Senate. So we don't have to go into it too big. But you know what's gonna happen? We're gonna make America great again, folks. We're gonna make America great again. So we had an interesting week. On Friday, we went to Chicago. We had 25,000 people coming. No, it's OK. We had 25,000 people coming. We had some, I would say, they were, let's be nice, protesters, OK? Let's say, let's call them protesters. And we had a decision to make. We had to make this decision. We want peace. We want happiness. We want everybody to go home really happy, really peaceful. So we said you know what we'll do? We'll postpone it. And it was a very wise decision. We've been given a lot of credit. And we've been given really a lot of credit. And you know what? It was an amazing thing. And the other side actually said, This didn't work out too well because all over the world they're talking about what took place. And they're talking about us and they're talking about how well we handled it. And they're talking about the fact that nobody got hurt. Nobody got injured. Everything went smooth. It was a nice easy breakup. So that's the way we have to have things go. And I love you people for being here tonight. Thank you. So -- I love you too. It's a guy. It's a guy, but I love you. I love you. So this all began around June. But around January I said, I have to start thinking about it. Too many mistakes are being made by the politicians. Too many mistakes are being made by people that truly don't know what they're doing. And we can't have it anymore, folks. We can't have it anymore. Our trade deals are the worst anyone's ever seen anywhere in the world. You go anywhere in the world, we're like the lapdog for the world. We're like the people that don't know what they're doing. We're not gonna take it. What happens is China this year going to make $500 billion in terms of trade deficit. Can't have it. Mexico, $58 billion. Think of it, China, China 58 -- China -- Mexico, $58 billion. China, $505 billion in a trade deficit. It doesn't work. It doesn't work. It doesn't work. So what's going to happen is we've got the greatest negotiators in the world. Carl Icahn, all of them, they're calling me. They all want to be involved. We're gonna negotiate the greatest trade deals you've ever seen. We're gonna turn it around. We're gonna turn it around fast. We are gonna become rich again. We're gonna become great again. We're gonna take care of Social Security. We're gonna take care of Medicaid and Medicare. We're gonna take care of all of the things that frankly, right now, we can't do, OK? We can't do. So we're gonna take care of it. Now when it started I was coming down the escalator in Manhattan. And when it started, it was about the border and it was about trade. The border is a disaster. Drugs are pouring across. Crime is pouring across. We've got to strengthen our border. If you don't have a border, we don't have a country. Is that right? Oh, we love that wall, don't we? Oh, we love that wall. That wall is gonna happen, folks. Do you remember when I first brought up the wall? Everybody, all of these people -- first of all, they're all controlled by their special interests. They're all controlled, every single one of them, they're controlled by their lobbyists. I know the politicians better than anybody knows the politicians. I've dealt with them all my life. If you can make it with a politician, you can't make it at all folks, OK? So they're all controlled. I'm self funding my campaign. I'm not controlled. I don't have anybody's money. Nobody is gonna tell us what to do. I'm working for you and I'm working for you. I'm working for you, folks. Believe me. So it began and we started talking about trade. Now trade, we understand and trade, you know when they do polls, on trade, on the economy, on finance, on leadership, on all of this stuff, we lead by so much. I lead by so much. The personality -- and they don't love it so much but that's OK. Who cares? Who cares? Who the hell cares about that? We want it. We got to straight down our country. But I'll tell you, you want to know the truth? I'm a better person than the people I'm running against, that I can tell you. And I'm a better person than Hillary. Hillary is not good. So -- thank you. You know, I tell you, a little while ago, a friend of mine said to me, how many people are you gonna be speaking in front? He's down in Florida, very successful guy, very wealthy guy. In fact, maybe I'll use him to negotiate against Japan, OK? Believe me. Believe me. All you have to do is go home, relax. This guy makes -- he only makes good deals. So what happens, what happens, he said, how many people are you speaking in front of? I said, maybe about 12,000, 15,000. He said, how do you do that? I said, you know, honestly, and by the way, no teleprompters, right? No teleprompters. No teleprompters. I saw Hillary last week, it was outside, there were two teleprompters. They were massive. They were so big and they were painted black on both sides. They were painted black, so you couldn't even see her. And I said, what are we doing? No teleprompter. Do you notice I'm not reading speeches. No reading speeches. No reading speeches. Speak from the heart and from the head, but speak from the heart. We got to do it. We got to do it. We speak from the heart and from the head. I mean, you know, let's not forget that. But we've got to do it. So look, I love this group. This is a good group. Go ahead. USA. USA. Man, what spirit. Look, how young some of these people are too. Look at them, young, young, young and beautiful and wonderful and great heart and great everything. Unbelievable. I'm telling you and I told this guy, I said, there's so much love in that place. There's -- and this is, by the way, we have a movement going on, folks. This isn't just us here. This is all over the country. Same thing is happening. Same thing is happening. So remember, and I guess you've been seeing it, cover of Time Magazine many, many times, cover of everything. The biggest political story in the world today are the millions and millions of additional people far more, far more than four years ago. Not even a contest, up by 70%. Some states up by a 102%. And I love that sign. It says, Hispanics for Trump. I love that sign. Thank you. I love you. You know, they do the polls, the exit polls and I always win with Hispanics, which nobody understand. But you understand it because we're gonna bring jobs to the United States. And when you're here legally, other people aren't gonna be taking your jobs, right? So they understand it. But you know, the exit polls, you come out, I win with women. I win with men. I love the women. I do love the women. I win, I win with women. I win with men. We win with the military. We win with the vets. We win with young. We win with old. We win with highly educated and we win with less than highly educated and we love them. We won with every single category, everybody. So the point is we have a massive situation going on. And honestly, it's the biggest story in politics. The biggest story -- worldwide, the biggest single story in politics. The unbelievable amount of people that are coming out and voting. And you saw it in New Hampshire. You saw it in South Carolina. We won all of them. We won so many of them. I have a list. You know, it's interesting, lying Ted Cruz comes in with a Bible. Ladies and gentleman, lying Ted. Lying, l, y, i, n, '. We can say it the right way. We got to go, lying Ted. And he comes in with the Bible, right? And he lifts the Bible. And by the way, I win with the evangelicals by a lot because they know I'm legit. But lying Ted comes in with the Bible, he raises the Bible, he puts the Bible down and then he starts lying. So it's lying Ted. Actually, you know, little little Marco what we did -- No, no, no. Now, he's a little, l, i, d, d. Little Marco. You know, we have to you have to brand people a certain way when they're your opponents. Like Jeb Bush, we call them low energy, low energy. You know, the first time I saw Jeb -- and I don't care talking badly about him. He spent $29 million on negative ads on me. $29 million, can you believe it? He spent a lot of people's money, of his lobbyist and his special interest money. But you've got a brand people. We brand it. So we started off 17 people up on this stage and what the hell did I know about this stuff. I've never done this before, right? So we start off with 17 people. Now we're down to four. Bush was favored, then Walker was favored, then another one was favored. They're all favored. Now Trump is favored, OK? It's about time. They haven't learned. So you know, when I was thinking about running, it was really interesting because some of these pundits are not worth anything. These guys at the worst. They say, well, he's not going to run. He's just having fun. He's just having fun. I know he's not running. There's no way he'll run. Don't worry about it. One guy said, he's just a clown, a clown. Me? I'm a clown. I build a great business, the best business. Nobody has ever run for president did what I did in terms of business and things. We put in papers at federal election, the likes of which has never been seen down there. We built an unbelievable company, with very low debt. The greatest assets. By the way, speaking of Florida in terms of assets, Doral, right? We love Doral, in Miami, hundreds of acres owned by Donald Trump. So what happens -- and the reason I say, it's some of the greatest assets in the world, low debt, great cash flow. The reason -- and I filed. Somebody said, oh maybe he won't file because maybe he's not worth as much as they thought. Actually, one of my very successful friends said, now I know how successful you are. Now I know, how rich you are because you filed. I mean you had to file the most detailed papers. And I said, look, it all doesn't matter. Here's what does matter. We need that kind of thinking to bring our country back where we pay off our debt, where we balance out. We need a certain, we need a certain thinking. So the pundits all said, oh, he'll never run. He's just having a good time. Somebody said, he's doing it for branding. I'm doing this for branding. I can think of other things believe me other than -- I love you folks. But I can think of places I'd rather be, right? We can think of places we'd rather be. So what happens, so what happens, they said, well, he's just -- now I watched them tonight and they are the same guys. He's not gonna run. Don't worry about him. You know, they're also cocky. Now they're saying, how do we stop him? What's going on? What's going on? How do we stop him? You know, no, it was very funny. I mean, these people are the worst. They're the worst. Let's see them run for office someday. They wouldn't have a shot at it. And one of them actually said, now one of them actually said, this is the most talented politician I've ever seen. I said, I don't want to be called a politician. But it's very interesting. So they said, how do we stop him? How do we do it? How do we do it? And Jeb actually said, I don't know if he can be stopped. He's a gifted, gifted politician. And my wife said, let me ask you a question, this was a month ago before he dropped out. They said, let me ask you this question, darling. Why did he call you a gifted person? You're a gifted person if he's fighting you? Now, do you know why he called me a gifted person? I will not say because he's stupid, OK? I'm not gonna say that. Why? Why? You know why? Because we're gonna do things that have never been done. We're gonna straighten our country out. We're gonna do it fast. It's gonna be done properly. We're gonna strengthen our military. We're gonna knock the hell out of ISIS. We have to do it. We have to do it. They're chopping off heads. They're drowning people. You know, you probably saw it during one of the debates. By the way, who won the last debate? Could I ask you? You know, I'm against these guys. They're politicians. All they do is debate. Their whole life is to debate. And Ted Cruz is a good debater. I said, he's a good debater but he can't talk properly. It's true, right? He's a bad talker. Good debater. But you know what we're gonna do? We're gonna go one by one, we're gonna go step by step and we're gonna solve our problems and we're gonna solve them fast. And a woman came up to me because I explained we're the policemen for the world. We're spending a fortune on Germany. We're spending a fortune on South Korea. We're spending a fortune in Japan. You know, we guard Japan. Now if something happens to us, Japan doesn't have to help. If somebody attacks Japan, we're in World War 3 folks. I hate to tell you, OK? Germany, we take care of Germany. Now Germany is an economic behemoth. They don't pay us very much. We lose on everything. We don't win anymore folks. We're gonna start winning like you've never seen anything win before. We have all the cards. We have the cards. So here's the story and I tell it, and I tell it strongly because I just feel that we have to be -- we have to at least -- we like to help people, right? We all want to help people. But, but it's got to be fair. Now, with all of these countries we're spending money somebody said, our military budget is 10 times higher than anybody else's, but that's because we're taking care of the world. Saudi Arabia. Saudi Arabia, before the oil went down, now they're still a billion dollars a day and we protect Saudi Arabia. They pay us peanuts. Not gonna happen anymore, folks. We're now gonna be, we're now gonna be back in the saddle. We're gonna be running it the way it's supposed to be run. You are going to be so happy. You are going to be so proud of your country again. You're gonna be proud of your president, but you have to get out and vote on Tuesday. You have to do it. Now a big, big thing is gonna be is going to be -- so we're rebuilding our military. By the way, we're rebuilding our military. We're gonna have the finest and you know, what we're gonna do? We're gonna get the equipment that they want, not equipment that's sold to the armed forces because that particular company, even though they don't want it, has better political connections with the guys that I'm running against, OK? We're not doing that anymore. We're getting the right stuff. We're getting this stuff. How often have you seen that we're stuffed, they stuff it down your throat. Equipment that the soldiers and the generals don't want because a company is politically connected. No more folks. Not gonna happen. Not gonna happen. Now here's what we have to do. And it all changed because something changed and it was very big. But here's what we're gonna have to do. So important. We are gonna do new trade deals. We had a company and you saw just the other day, a couple of weeks ago, Carrier said, we're moving out of the United States. We're moving to Mexico. I made a speech, I made a speech yesterday in Cleveland. And in Cleveland, where by the way, the governor is raising real estate taxes through the roof. He approved NAFTA. He's now approving TPP, which is gonna be worse than NAFTA. I'll tell you what, if we can't beat Kasich, we have ourselves -- I really think we are going to do great, not only in Florida -- and let's not say that we have a 21 point lead because I want you to vote. Let's assume we're even, OK? Somebody came out they said, Mr. Trump, congratulations. In Florida, you have a 21 point lead over a no show senator, over a senator that doesn't work. What does he do? What does he do? So I said, do me a favor. Let's not tell the crowd that we have a big lead. Let's tell the crowd, well, we can never lie, but let's say it's tight. It's sort of tight. We want you to get out and vote. But remember this, in Ohio, in Ohio, it's pretty even with Kasich. And people don't understand what's been happening in Ohio. They've lost a tremendous amount of their business. I went to Cleveland yesterday, I made a speech in front of a massive, like a massive crowd and they were saying, Eaton left. They're over there. I mean, I'm right in this big convention center owned by the great Patrick Park and his family, great people. But they said, Eaton left. They're on the right. Ford left. I said, let me guess, where did they move? They said, Mexico. Mexico. Nabisco left for Mexico. Look, look, folks, the reason we have this whole thing going. The reason -- and I mean it. I was starting to say before, this is a massive movement. This is not -- they say, these people, most dishonest people, look at all those people back there. Look at all those cameras there. Look at all those cameras. And unless we have a protestor, the cameras are never gonna show the crowd. Do we have a protestor or anyone? Do we have a disrupter? Because unless we have a disruptor, I don't even call them protestor. I call disrupters. Unless, we have a disrupter, the camera never goes off my face. They're all live. They never go off my face. Is there a disrupter in the house, right? So here's the story, look. So in Cleveland, I looked and you look at the business being drained out of Ohio. I mean every place, not every place. A lot of it's going to Mexico. Pfizer, the great pharmaceutical company, did you see what they're doing? They're leaving. They're going to Ireland. So here's what we're gonna do, let's use Carrier as an example. Now my daughter Ivanka. Did anyone ever hear of Ivanka? Huh? And my wife, Melania. They want me, they want me to be presidential. So they said on the last debate, darling, we love you. My daughter said, Daddy, just be low key. If they say bad things, you don't do too much. I said, I can't do that. My wife said, be presidential and it was good. I sort of like the other way better to be honest with you. I mean, I'll be honest. You know, they want me to be put. But here's the thing what I'll do, I'll do this even if it's not very president because you're president. OK, let's say, we win. Great. We win as president. So now, what I do is the following. I call up Carrier. And you know, I'm a conservative person and I'm very conservative on military and taking care of the vets. And we're gonna get rid of Common Core. We're gonna bring education locally and we're gonna repeal and replace so much less expensive. And we're gonna have strong borders and yes, we're gonna have the wall. And yes, Mexico is gonna pay for the wall, 100%. But here's what they say, some of the conservative guys who aren't really too smart. You know, this National Review Group, they had 18 guys write a negative piece about me. And after that, my poll numbers went up seven points, OK? Do you believe? So they say, National Review, but they say, he's not a free trader. Well, who wants to free trade if China is making -- if we have an imbalance with China of $500 billion a year. We don't need to free trade for that, folks. Mexico, the reason Mexico is paying for the wall is very simple. The wall is not big, OK? We have, as you know, in China, the great -- we all studied, right? The Great Wall of China. It's 13,000 miles long. It was built two thousand years ago. Look at that sign, it says, build the wall. We're gonna build the wall. Don't worry about it. 100%. By the way, 100%. 100%. So our wall. We need a thousand miles because we have a lot of natural barriers and a lot of things. It's actually 2,000. But we need a thousand. And by the way, just so you understand, I love the Mexican people. I love the Hispanic people. So many work for me. I deal with them in business and everything else. They're great people. The problem is their leaders are far too smart for our leaders. Our leaders don't have a clue. So here's the story. Everyone said and a couple of these guys came off the stage that we were competing with their gun. But they came off the stage and they said, you can't get Mexico to pay for the wall. I said, here's the story. We have, we have trade imbalance. Think of it, $58 billion. The wall is gonna cost $10 billion. How easy is that, folks? You get it, right? You get it. It's peanuts and we subsidize that. We do so many things for Mexico and Mexico is gonna be fine. You know, we are going to have better relationships with these countries. Look at Mexico, remember Sergeant Tambores? He was there for so long. The president probably never even lifted up a phone. I mean, the answer is I don't think he did. And he was there far longer. He got lost and he shouldn't have been there and he got there. And that kind of stuff that's not a good neighbor policy. The way they treated him. That's not a good neighbor policy. And then you look at China, in the South China Sea, they are building a massive military base with runways and storage of weapons and all sorts of things. Now, they don't respect us. They're not supposed to be doing that. They're not supposed to be doing it. So we're gonna have -- let me tell you, this is the way it works. We're gonna have economic good relations with these countries. We're gonna make a lot. We're gonna bring a lot of jobs back into the United States. And we're gonna actually have better relationships than we have right now because they're gonna respect us. Right now, they don't respect us? OK. So here's what happens. So here's what happens with Carrier. It's very simple. I want to do it myself. May I do it myself, please? OK? Even though Melania and Ivanka said, please be presidential. Because somehow it's not very presidential for the president of the United States to be calling up Carrier air conditioning company. I buy a lot of Carrier air conditioners. I'm not buying them anymore. So here's the story. We have to be proud. Remember we used to have signs made in the USA, right? And we were proud. When was the last time you saw that sign? You don't see them anymore, right? And you know countries like Japan and I respect this. I respect this. By the way, I'm not angry at China and I'm not angry at Japan. All of these cars come off the truck like they're driving for NASCAR. So fast. I've never seen anything. I was at the docks. I'd never seen massive boats coming right out of Japan. Now, you know, what we give them? Practically nothing. It's a one way street. It's a one way street. We have all the power. We have to be able to use the power and sparingly and we don't want to hurt anybody and we don't want to hurt other countries economically. We're getting got to get along great with other countries. But we can't be the stupid people anymore, folks. We can't afford to lose the kind of of money and jobs. You go to Ohio and you go to these different places. The jobs are being sucked out of them. Sucked right out. You go to places -- I was at three or four states over the last supposed to win a lot of these states. I won Michigan in a landslide because they know I'm gonna bring the jobs, gonna bring the industry back. We're not gonna have this stuff anymore. So here's what I have to tell. So maybe I'll have one of my guys too because it's a little more presidential. I'll have one of my genius negotiators do it. But I love doing it and it's so easy. I'm gonna call up the head of Carrier. I'm gonna say, listen, listen, here's the story. What you've done is very sad. I saw them. They let 1,400 people go. Not gonna happen. Not gonna happen. So here's what I'll tell them. I hope you enjoy your new plant in Mexico. I hope you have great success and I hope it's a really beautiful building. But here's the story, every single time you sell an air conditioning unit crossing our now strong border, where they can't just take them come across anymore. Every single time, we are going to have a tax on that unit of 35%, OK? 35%. And by the way, I'll tell the same thing to Ford and I'll tell the same thing to Nabisco. And all of these companies that are going crazy and they're moving out and they're letting go of people here and they're opening up new. So here's the story and here's what's gonna happen 100% as sure as you're standing there. Here's what's gonna happen. They're gonna call lobbyists, but I can't be taken by lobbyist because I didn't take their money. They're gonna call special interests. They're gonna call donors. They're gonna call everybody. It doesn't matter. Let let me just tell you. Anybody else, any other politician, 100%. But here's what happens. I will tell them, you're gonna move back, right? And they're gonna say, yes, sir. We're moving back to the United States. We're gonna build our factory in the United States. We're not moving to Mexico and we're gonna create a lot of new employment. And that's what's gonna happen. That is what is going to happen. And you know what? Unless we do that -- now somebody from the conservative movement, I always say, commonsense conservative, right? Somebody -- Hello, Darling. How beautiful she is. Somebody from the conservative movement would say, Donald Trump is not a free trader. I am a total free trader. But to have free trade, we need smart leadership. We do not have smart leadership. We'll probably have free trade because once I start telling these people that are abusing us with their monetary manipulations. And by the way China, they're like your grand chess player. What they do to us with devaluation of their currency is beyond belief. Grand chess masters. But I get the game and a couple of other people get the game. Our president has no clue. We're gonna change it, we're gonna turn it around and we're gonna bring our jobs back, folks. We're gonna bring our jobs back. Just remember. So the other thing and I'm not sure that Boca feels the same way that a lot of other people do. But when I say this in certain parts of the country, they go wild. Are you ready? We are going to preserve our Second Amendment, OK? We're preserving our Second Amendment. You know, a lot of things changed. I came down that escalator and I made a speech about illegal immigration. Boy, did I take heat. But after a month, took a lot of heat. But after a month, people realized I was right. People are pouring into this country. The crime is incredible. Then you see so many people being killed and now people are reading it and now it's really at the front of their mind. All of a sudden, all these other candidates that would have never virtually brought it up. All of a sudden, it's a big deal. In fact, Ted Cruz the other day said, you know, he's talking. And he said, yes and we'll build a wall. He actually said, we'll build wall. I said, where did that come from? So here's what -- here's what's going to happen. Here's what's going to happen and I mean, I mean, you are going to be so happy. Now, wait a minute, before we do anything, before we do anything, who is going to vote on Tuesday? Is that close to 100%? I think so. Is that 100%? Right. You promise, right? You promise. See, now a politician would say the following. A politician would say, it's very important to vote. Go out and vote no matter who you're voting for. Very important. I don't say that. I say it's very important to vote, but only if you're gonna vote for Donald J. Trump, OK? Otherwise, don't vote. Do not vote if you're gonna vote for anybody else. OK. All right. So, so is this -- I tell you what, is this place incredible? Is this incredible? I mean, it's incredible. I love you, folks. I love you, folks. So a couple of things. So we have to be smart. We're going to be smart. We have to be smart. We have to be sharp. We have to be vigilant. Now, we all have big hearts. I have the biggest heart. I want to take care of people. I'm gonna take care of people. We have to be very careful. The Syrians, the migration, nobody knows who the people are. Nobody knows where they come from. There's no People make a statement and I would say it's true. You look at that mass migration of people. All because of bad policy. This all happened because of a Hillary Clinton policy and Obama policy. A lot of bad policy. A lot of bad policy. So what we're gonna do is we build and we'll get Gulf State money. We're not using our money. We're gonna build safe zones. We're gonna make them. It's gonna be good. And eventually, let them go back to their lands. You know, what I find? I have thousands of employees. I have people that come here and they become citizens and they work and they work for years. And you know, no matter how beautiful they do, no matter what, they all want to go back to their country. Countries that you'd be surprised at frankly. They want to go back. They love their country. And in Syria, I think when it all settles out, which we hope is going to be at least soon. The damage, the horrible, horrible cost of lives, what's going on is terrible. But we're gonna do safe zones and we're gonna get the Gulf States to pay for it. We're not gonna pay for it. But we have to be smart. We have to be vigilant. We can not let them come into our country. We have enough problems, folks. You saw what the two people did. They got married. She radicalized him. It sounds like. And they blew away, they killed 14 of their friends that had showers, baby showers for their baby and they killed him. There's something going on. We have to get to the bottom of it. We will get to the bottom of it. But whatever it is, we can't have people come in unless they're fully documented. Unless, we know who they are, where they are, where they come from. So here's the story, OK, in a nutshell. Here is the story. You have one of the most important days in your life coming up because our country is going to hell. We don't know what's happening. We're sitting on a very big fat ugly bubble. It started to pop with the stock market, comes back a little bit. Watch what's going to happen. But we are going to make some unbelievable and really straightforward just commonsense moves. We're gonna ask people that we take care of got to pay us folks. These are rich, these are rich countries. You got to pay us. We're gonna bring so much money in that for a lot of seniors and a lot of the people that are gonna be seniors. We're gonna save you Social Security without all the cutting and the changes that these people are talking about. I mean, if I do my job right, we're gonna have -- we're gonna be in such great shape. But here's the story, you've got to go out on Tuesday. You've got a vote on Tuesday and you're gonna be happy. Because here's what, we don't win anymore. We lose at everything. No matter what we do. We can't beat ISIS. Think of it, General Douglas MacArthur. I loved Douglas MacArthur. He was a brutal guy. He was a brilliant guy. You know in the history of West Point, I don't know if it's still, but for many years, in the history of West Point, Douglas MacArthur had the highest grades in the history of West Point. That's pretty good. You know that always mean something to be called grades, maybe not everything, but it means something. General George Patton. Can you imagine, can you imagine George Patton right now he's spinning in his grave when he sees that we're not beating ISIS. We are doing a politically correct war. We have to knock the hell -- they're cutting off heads. They're drowning people. We have to knock them out. We have to knock them out fast. We got to get back to our country. We have to rebuild our country now. It's time. It's now time that we rebuild the United States. Our roads are falling apart. Our schools, our schools are a disgrace. You see it on television. Rat infested, walls falling down. We build a school over there. They blow it up. We build it again. They blow it up. We build. This goes on four, five times. And if they need money for Brooklyn, if they need money for Boca, if they need money for any place, we don't have any money to do anything. So I think it is wrong. We're gonna have really smart thinking. We've got the smartest people lined up. We are gonna think so good. And here's what's gonna happen, we're gonna start winning again, OK? Because right now, when was the last time -- just think about it. When was the last time the United States won at everything? We're losing at war. We're losing at war. We're losing a trade with everybody. We're losing with everybody. This isn't China. I use China because it's the greatest abuser of all. China abuses us more than anyone. I hope they still like me after this speech, by the way, but I don't care. You know I had the biggest bank in the world. He's a tenant of mine in Manhattan, from China, 400 million customers, the biggest in the world. I own a big chunk of the Bank of America building, 1290 Avenue. A lot of buildings that I've got through war with China, with China. We could do great against China if we're smart. We can do great. I sell condos. You read about it the other day. I sell condos to people from China for tens of millions of dollars. I love China but their leaders are too smart for our leaders. We can't let it keep going on. So here's what's gonna happen. winning with our military. We're gonna knock the hell out of ISIS. We're gonna, we're gonna start -- we're gonna knock off -- folks, folks, just relax. We can't, we can't let it go any further. It's too bad. It's too bad. We are going to start winning with our military. We are going to take care of our vets. We are going have strong borders. We are going to build a wall and we are going to have Mexico pay for it. We are going to have great education. Right now, we're way down on the bottom of the list worldwide, but number one in cost per pupil. We're gonna get that changed around a lot. We're going to get education taken care of. We're gonna do it locally. It's gonna be so much better, so much less expensive. And we're gonna be proud of our education. Because right now, our system is so broken, it's so bad and people are making so much money out of that system. So we're gonna win with education. We're gonna win at every single level. We're gonna get rid of Obamacare. We're gonna win on health care. We're gonna win on health care. We're gonna start winning. And I'll tell you and I say it kiddingly, but I mean it 100%. We're gonna win, win, win. We're gonna win so much you're gonna get sick and tired of it. You're gonna say, Mr. President, we can't take it anymore. You're winning too much. Please, we don't want to win that much anymore. Please, Mr. President. We can't take it. And I'm gonna say, I don't care. We're gonna keep winning because we're gonna make America great again. We're gonna make it greater than ever before. I love you. Go vote on Tuesday. I love you. We're gonna win again. Thank you. I love you, folks. I love Boca. I love Florida. Go out. Start the winning. Start the winning. Thank you, folks. I love you."}