{"id":428,"author":"Donald Trump","title":"Speech: Donald Trump in Cleveland, OH","date":"2016-03-12","link":"https://factba.se/transcript/donald-trump-speech-cleveland-oh-march-12-2016","paragraphs":["Oh, boy. Are we going to win Ohio? We are. We are. Well, I want to thank everybody. This is incredible. Look at all of that media back there. Look at all those cameras. Oh boy, they know who to follow. I wish they could be honest. I wish, wish, wish. You know before we had a tremendous -- in Dayton, we had a tremendous hangar like this.","It was packed, packed with people and I was called by my people. They said you were so tight in my face, my face took the whole screen. They didn't want to show the crowd. They didn't want to show the crowd. The whole thing was big. No good, right? No good. No, they're very dishonest people.","I have to tell you that. So you know I have to thank -- before I even begin but I have to thank a couple of friends of mine. They're incredible people. They are just incredible people. Oh, so early. Look at that. Look at that. Look at that. Shocking. It's -- do we love our protesters, right? We love our protesters.","All right. Get them out of here. Get them out. Where do these people come from? You know Bernie was saying Mr. Trump should speak to his crowd. Mr. Trump -- do you know where they come from? Bernie's crowd. They're Bernie's crowd. Thank you. Get them out. Good. Every five minutes or so one of Bernie's people and sometimes Hillary.","But there's not a lot of flavor and not a lot of fervor with Hillary so you don't have too much of Hillary. I'll tell you. So, anyway. Thank you. Where do these people come from? But I want to introduce two friends of mine. They've done an incredible, an incredible job. They love Cleveland. They love Ohio.","They own this place. They run it beautifully, Patrick Park and Raymond Park. Come up for a second, Patrick, Raymond. Get up here. Patrick, get up here. Come on. What a great guy. Where's Raymond? Patrick, get Raymond. Come on. These two folks they employ a lot of people. They spend a lot of money in the area and I just wanted to thank them very much.","Come here, Patrick. Any of my guys here? Yeah. The next President of the United States, the people's choice, Donald Trump. That is an amazing family. I want to tell you. And they, they love you. They love you. And I love you. I really do. So, yesterday in Chicago, we had a little bit of a problem.","We came, we were not allowed to exercise our First Amendment rights. Because a professional organization which printed circulars and printed signs and everything was printed very professionally. You know I'd like to see them hand-drawn a little bit, right? It doesn't look good when they're printed out but they disrupt things and they really, they really stop.","We had 25,000 people coming and they really stop these people in terms of our First Amendment, freedom of speech, a terrible situation. I have to tell you and it just makes all of our friends and supporters more angry. We're going to go to the polls on Tuesday. And we're going to be resounding victory, resounding.","And I really appreciate you being here. This is our final push. You know all over the world they're talking about what's happening. The momentum that we have. It's a movement. They're calling it a movement. It's not me it's you. I'm a messenger. Believe me. I'm just the messenger. People are fed up with what's going on. And by the way, they're fed up, they're fed up with the stupidity in Washington.","They're fed up with the stupidity of trade deals and labor deals. They're fed up with the fact that they haven't had an increase in the last 12 years if you can believe it. The middle-class, the workers aren't being taken care of in this country. We're losing our jobs. We're losing our factories. They're going to China.","They're going to Mexico. So, we're here and the great Mayor, your great Mayor said to me, you know Mr. Trump, right here on the left you have Ford, the Ford foundry and that's moving to Mexico. And on the right, you have Eaton and that's moving to Mexico. Now when you think of it isn't it ridiculous?","What are we doing? What are we doing? What are we doing it for? Who are we doing this, for what? And then we have a protester that says, oh, what are they protesting about? We want to keep our factories here. We want to keep our manufacturing here. We don't want them moving to China to Mexico to Japan to India to Vietnam.","It's crazy. It's crazy what we're doing. What we're doing to our country is crazy and you know you have these people. I'm a conservative person. But I'm in theory not so conservative on trade. And these really stupid people, they call themselves the elite. Now, I don't think the elite. I don't -- oh, another group.","Get them out. Thank you. Get them out. Get them out. Troublemakers. They're Bernie fans. Remember when they took over the microphones from Bernie, remember? They took over the microphones, two young women took over the microphones and he walked back like this. These are Bernie's people. Oh, boy. Wouldn't it be fun to meet Bernie in the finals?","Wouldn't that be fun? I'd get him out and Hillary too to a lesser extent. Get them out. Get them the hell out. Look at the Hillary sign. Look at the Hillary sign. Look at the Hillary sign. Unbelievable. So, we're going to stop it. We're going to stop being the stupid country because that's what people think of us. We're going to be the brilliant country.","We're going to be so smart. We're going to be so sharp. We're going to make great deals. We're going to bring back our military. We're going to take care of our vets. We're going to take care of our vets. We're going to get rid of Common Core and we're going to have local education. We're going to repeal and replace Obamacare.","It is a disaster. We are going to have incredibly, incredibly strong borders. We are going to have strong borders on the Southern border. We are going to have a wall. We're going to have a wall. A real wall, folks, a real wall. And who is going to pay for the wall? Who? You better believe it. They're paying.","They're paying. OK. OK. So here's the story. We have trade deficits with virtually every country we do business with. With China, it's $500 billion, think of this, $500 billion, and you're losing plants over here, and you're losing a plant over there, and you're losing another plant, I hear, over there. Any direction I can point to you're losing jobs, you're losing your plants.","We're not going to let it happen anymore. You have a Governor who I've gotten to know and he's abandoned this state. He's lived in New Hampshire. He's lived there. He moved to New Hampshire. He said he's going to win. I won in a landslide. He moved to South Carolina. He said he was going to win. I won in a landslide.","He moved to Michigan. He said he was going to win and if he didn't win Michigan, he'd drop out of the race and I won in a landslide. Why didn't he drop out? And now he said he's going to win Ohio. I don't think so. I really don't think so. I really -- I really don't think so. But your Governor, I don't know if you know this, NAFTA has been a tremendous problem.","Your Governor when he was a Congressman voted for NAFTA, OK? He voted for NAFTA. He was a Managing Director of Lehman Brothers when it failed. It went bankrupt and it almost destroyed the world. Lehman Brothers was the beginning of a tremendous mass destruction and he was a Managing Director of Lehman Brothers.","You've got the highest budget increase of any state in the United States. Now here's the story. You got lucky. You -- right. You struck oil, OK? Before him, you struck oil. If you didn't have oil. Boy, would you have problems right now. But now the price of oil is down. You're down and waiting to see what happens so high -- oh, in a little while it's going to be a big problem.","It's going to be a big problem. He's now in favor of the Trans-Pacific Partnership. It is a disaster. It's going to ruin your car industry, totally ruin it. And believe me, that deal is very bad for a very -- a lot of reasons. Number one, you shouldn't sign with that many countries.","Do you know the document is almost 7,000 pages long, 7,000 pages, 7,000 pages long and nobody from our country has read it? Believe me. But the other countries have all read it and they know every word. And it's just another way to take advantage of jobs manufacturing and everything else in the United States.","We're not going to let it happen anymore. We're not. You can't get them out. Get them out. Yeah. Get them out. That's a Bernie person. It's a Bernie person. It's a Bernie person. I'd get that Bernie person out of here. Hell's up a sign I'm a protester. All right. Get them out. Get them out. Let's do a USA chant.","USA. USA. USA. USA. I saw Hillary Clinton saying on the way up Donald Trump has got to speak to his people so that they're non-violent. My people aren't violent it's these people that come in. My people want to do one thing Make America Great Again. That's what they want to do. One thing.","So the Governor, your Governor has let your coal industry down. He's let it go to hell. Your steel industry is going to hell. We're going to revive it. We're going to bring it back. And it's so important so we're bringing it all back. Your EPA here has caused you tremendous problems. All of these things are coming back, folks.","And by the way, Kasich cannot be President. He's weak on immigration. He wants people to come in. He's in favor of amnesty. He can't be President. So I hope you're going to remember that when you go to the polls. Thank you. What a crowd, man, 29,000 people. Unbelievable. And when you go home you won't see yourself, although, you will if we have a couple of more protesters, you will maybe.","So this began in June, on June 16th and it started with trades, it started with the border and I came out. I came down the escalator and you know what? Who would have thought that my statement on illegal immigration would have mushroomed into such an important statement? What happened is everybody now is copying us. I just got endorsed by Sheriff Joe Arpaio who we love.","And you know when Sheriff Joe endorses you about the border, we know that you have a tough plan and the right plan. And by the way, by the way, yes we're going to have the wall. Yes. Yes, Mexico is going to pay for the wall, 100%. They are but people are going to come through that wall. But they're going to come through that big beautiful door but they're going to come through legally, legally, legally.","And we're going to have situations, I'll tell you what, folks. Our country is going to start winning again. We don't win at all. We don't win at all. We don't win with our military. We don't win in any way. I mean, I'm fighting a battle in Florida where you have little Marco. You know Marco, little Marco, and Marco, boy, oh boy, I've never seen -- number one, he's a joker.","Did you ever see anybody choke like that during a debate? By the way, who won the last debate? Believe me. I think I won all of the debates. You know I hear all about lying Ted, lying Ted, lying Ted. So you know I have the Evangelical support and everyone thinks, oh gee, that's amazing. In South Carolina, it was supposed to be an easy victory for Ted and it turned out to be a lot -- do you know what happened?","He hurt Ben Carson, who by the way, just endorsed me, right? A great guy. But he cheated Ben Carson horribly in Iowa, and all of a sudden, people started getting wise to it. And he walks in with a Bible held high. This is lying Ted. He has the Bible high, waves the Bible, puts it down, then he starts talking and he lies.","So it's a lie and lying Ted. And then Marco over here, Marco, what he does, but most importantly, what is he? He's a choke artist who never goes to vote. I mean, here's a guy representing Florida, has the worst attendance record in the last 20 years in the U.S. Senate. Who the hell wants him to represent you?","Who? So I think Marco has got a lot of problems. He's got other problems. Just take a look at the ads. You know I figure we might as well put a couple of negative ads up, there doing it on me by the way. Has anybody had more negative ads in history? All of these special interests -- I'll tell you one. I got to tell you one.","So this stupid growth for, for, what is it? health for growth, Club for Growth, these people come in. Club for Growth. So they come in to see me last week. They come in to see me about a year ago last week and they want to talk. What do you want to talk about? And I did it for a friend. He said would you see that -- they come into my office, they ask me for a million dollars.","Now you can be rich but, you know, what are you doing, right? We don't want to be stupid people like the people running our country, right? So they come in, Club for Growth, they come in and they give me something -- the guy's an ex-Congressman. So you know he can't be very honest, OK? Except for your Congressman here is great.","I have to tell you and I think he endorsed me. So they come in, and they say, we have this, we have that, Club for Growth. I didn't know what the heck he was talking about. It didn't make any sense. It was a waste so I told him very nicely that I'm not interested in being extorted and I said, no, I'm not going to give you $1 million.","They went so negative. So now they're putting up -- any time you see Club for Growth remember this. It's extortion. Just think of it. It's an extortion plot. They came to my office, they asked for $1 million. Then stupidly, he writes me a letter asking for $1 million, OK? Now, I already sort of turned him down.","But he writes me a letter asking for $1 million. We were very nice. We tried to be nice. We told him, no, thank you very much. We really love you very much. No, thank you, right? And now they do negative ads. I have had more negative ads than any human being. And yet last week, Mississippi, unbelievable.","Michigan, unbelievable. Hawaii un -- I don't know how. I don't know how. And I'll tell you those ads are lies, they're lies. They are so dishonest. They say whatever they want to say and they're really dirty rotten lies. Just remember that. And they're put up, by the people, the money is put up by the people that controls the people that I'm on the stage with.","They control Ted Cruz and they control Little Marco Rubio. They have total control. In fact, you have guys in Washington, lobbyists. It says Rubio on his forehead. You go to him. You pay them a big fee. It's practically guaranteed you get their vote and they will do anything these guys say because they give them a lot of money, OK? Me, I'm different.","I'm self-funding my campaign. I'm working for you. I'm working for you. Believe me, I'm working for you. So here's what I have to tell you. So one of the reasons I happen to be conservative but one of the reasons I like to say, you know, the elite, the elite, they call themselves the elite conservatives.","They're not elite like I am but I'm more like you. Believe me. I'm more like you. I put in one of the greatest financial statements probably ever given to the Federal Elections Commission. Nobody reports on it. Do you know why they don't report on it? Because it's so good. They were so unhappy when I put in those numbers.","They thought, oh, you know, I'm a private company. So the numbers were far bigger, far better, far -- I mean, they were incredible. Look, tremendous assets, some of the great assets of the world, very, very, very little debt, unbelievable cash flows but the best assets, and they don't want to report it. Do you know why?","They had no idea this was going to happen. Don't forget. They said he'd never run. Then they said he'd never file Form-A because that's basically a one-pager where you sign your life away. When I did that they said, whoa, he said he's running. He's out. Then they said he'll never file his financials. And I filed the financials almost 100 pages and it's the best ever filed with the Federal Elections by a factor of a lot.","Mitt Romney is like this, he's a little tiny peanut, a little peanut. I mean, I have a store that's worth more than Mitt Romney which is true. I -- so, no, but the jealousy -- because the truth is, the truth is, we have to bring our party together, folks. We have to. We're going to win something that's going to be special.","We do have to bring our party together. The reason I tell you about the forms and the reason I tell you about the filing of the financials because the financial say a lot and it only means this, we need that kind of thinking for our country. Because right now, we're being ripped off by everybody. We're like a whipping post for everybody.","We can't let it happen. We have $19 trillion in debt. They want to cut Social Security which I'm not cutting. I'm going to bring our jobs back. I'm going to make our country wealthy again. And I'm the only one that's not cutting it. I will not cut it. So we have a ways to go. We have a ways to go. And when I heard about Ford and when they told me, I mean honestly, when the Park family came over and told me about Eaton and told me about Ford.","You know Ford right now, they're building almost completing a $2.5 billion plant in Mexico. Right there and that's one of the divisions that's going there. But $2.5 billion they're taking out of Michigan. That's why I won Michigan because nobody can protect you like me. Believe me. Now I like free trade.","I like free trade. But it's got to be smart trade, folks. It's got to be something. When we lose $505 billion in trade, think of it, $505-billion trading with China, who needs to do this? Why are we doing it? What are we doing? And to deal with China is almost impossible. You can't get your product in, and when you do get it in, you know what happens.","They tax the hell out of you. With them, they send it in we don't tax them. So here's what we're doing. Carrier and Ford, I could, I could change, and frankly, Nabisco, and hundreds of other companies moving out to Mexico. Mexico is the new China, smaller version, OK? Believe me. We have a trade deficit with Mexico of $58 billion this year, all right, $58 billion.","And then there's these stupid politicians they say they won't allow you to build a wall. I said yes they will. Yes, they will. By the way, by the way, ready? 100%. I don't mean like 99%. I won't be coming back to you in two years and say, folks, I'm sorry, it's impossible. You know one of the reasons they wanted to build it 15 years ago, you won't believe this, but they couldn't get their environmental impact study approved.","Do you believe that? Because there were snakes in the way or turtles or rats or something was on the way, snails, snails are always good. We will get that built so fast your head will spin. So they said, they were telling me, we need it. You know I had a great victory in New Hampshire, a great, great victory in New Hampshire.","And I love New Hampshire because it was my first really great victory in terms of politics. Hey, I've been doing this for eight months. I haven't been doing it that long and I won New Hampshire in a landslide, just a total landslide. And I told those people, I said if I --","-- win I'm going to do something because you go to New Hampshire, the most beautiful fields, the most beautiful trees, everything's beautiful, and you go to a meeting with the people, and you say, what's your number one problem?","They say heroin. I say heroin? You know it just doesn't go. I said what do you mean heroin? Oh, it's our number one -- every single meeting I went to, it's drugs, it's heroin coming over the Southern border. They poured their drugs over. We get the drugs they get the cash, folks, not going to happen anymore.","It's not going to happen anymore. Not going to happen. So what we're going to do and I made that pledge to the people. I made that pledge very strongly to the people of New Hampshire and I'm making it to the country. But I specifically said, if I get in, you'll going -- we're going to get the kids better.","Their youth is just -- it's disastrous. For some reason, bigger in New Hampshire, bigger in New Hampshire than I've ever seen anywhere else. And it's so strange because it's just not the setting for it. It's just not what you think. So we're going to take care of that drugs and drugs pouring in like it's water into our country.","So we get drugs they get cash. It's over folks. It's not going to happen, OK? Not going to happen. So let me, let me just tell you. So here's what we're going to do. I'll use this as an example. Now my daughter Ivanka, do we know Ivanka, right? So she said the other night in the debate, daddy, daddy, I want to talk to you.","What? Would you please act Presidential in this debate? I said I've won every debate so far. You know if you look at Drudge, if you look at Time, if you look at Slate, if you look at all these online polls, every single debate according to every single poll I've won. I say what do you mean Presidential? I want to keep winning.","She said dad don't hit back so hard. You don't have to hit back. It's over. You don't have to hit back. He said, this guy's a lightweight, I don't know. I call him lightweight. I call him a lightweight. But she said don't do it. Daddy, be nice. Just don't do it. So every time I was ready to go after him I thought of Ivanka, and I said you know what, and my wife Melania, she said don't hit back so hard.","You shouldn't do that. Act Presidential. So I said all right. So everybody said I acted Presidential. I didn't hit back and my poll numbers went up. So they were right. Can you believe it? They were right. They were. But here's where I won't act so Presidential. So it doesn't look Presidential when I call -- so Carrier, you know, closed up their plant and they're moving -- they -- you saw the announcement three weeks ago some management guy gets up, and he wasn't even nice about it, frankly.","You'd think he'd be nice about it. He said after many, many years, all these great people, 1,400 people. We're closing our plant. We're moving to Mexico was almost set like that. Horrible. We're closing our plant. We're moving to Mexico. By the way, folks, whether you're highly educated or not highly educated, how does that help us, right?","How does it help us? So we're closing our plant. We're moving to Mexico. So here's what I'd do. Now I have the best business leaders in the world, Carl Icahn, some of the smartest, the best, we have the best in the world. We're going to use them for trade. We're going to use them for negotiation. We're going to use them to our advantage.","Nobody can out-negotiate these deals. But here's what I'm doing. Don't worry about them. Let them run. Let them run. Don't worry about them, folks. Don't worry about them, folks. Don't worry about them. Let's just talk, talk over, OK? So here's what I'm going to do. I'm not at all going to look Presidential but I'm going to do it myself anyway.","I'm calling up. The head of Carrier and I'm going to say -- this could be Ford, by the way, this could be Nabisco, this could be any one of the hundreds of companies that are pouring into Mexico because our leadership is so stupid. They let it happen. This could be Pfizer that's moving to Ireland. But here's what I'm doing.","I'm going to say something that conservatives don't like. Because, well, I'm a free trader. I'm a smart trader. I'm a fair trader. I know what I'm doing. I'm going to say to Carrier, enjoy your new plant. I hope it's lovely. I hope you make a lot of air conditioning units and I buy a lot of Carrier but I'm not buying anymore.","I hope you make a lot of air conditioning units but here's the story, every unit you make that crosses the border -- and now we're going have a real border remember that. We're going to have a real border. We are charging you 35% tax on that unit, and you know what they're going to say, they're going to call up their lobbyist but the lobbyists can't get to me because I haven't taken any of their money.","And they're going to call up their special interest friends, and they're going to call me, and I'm not even going to take that call. They didn't give me anything. I turned down tens of millions of dollars. I have turned down, folks. So Jeb Bush had $148 million. Can you believe that? Jeb, Jeb, spent $168 million on his campaign and he was down here.","I spent peanuts and I'm by far number one, now, peanuts. What's peanuts? What's peanuts? What's peanuts? $30 million is always money, right? But I spent relatively little. Wouldn't it be nice if our country was that way, where the guy who spends the least is in first place you know? In education, in education, out of the top 30, the 30 countries that they look at, the United States is number 30, last.","We're last but we're number one in cost per pupil, number one. Think of that. So we're number one. Not good, right? So we are going to change it around and we're going to have a situation where -- oh, let him go. Let him go. They have no voice. Listen, look, it's a Bernie person. It's a Bernie -- hello, Bernie.","Hey, Bernie get your people in line, Bernie. Get your people in line. Can you imagine Bernie saying that Trump should get his people under control and they put in these people? And by the way, our crowds are so much bigger than Bernie's, you wouldn't believe it. Not even. And I think Bernie's finished but you never know.","Hillary is really doing badly, right? You never know. I think he's finished but we've been saying that for about four weeks. Hillary just seems -- I don't know she -- Hillary cannot seem to win even against a communist. I mean, how is it, how is it that in this great society that, you know, in our great, great world, that a communist cannot be beaten by Hillary Clinton.","It's terrible. OK. So here's the story, folks. They will call me and they will put -- but I didn't take any of their money, right? I don't care. I'm working for you and I will tell the Head of Carrier, no, I'm sorry. The 35%, I mean it. It's done. Enjoy your plan. Have a good thing. He'll call me back within one day.","As sure as you're standing there, and he'll say, Mr. President, we've decided to stay in the United States. I'll say thank you. Thank you. That's what's going to happen. By the way, that's not 90% or 95%, that's 100% sure, all right? That's 100% sure. So look, I just want to tell you, so important, so important, is on Tuesday you have to go out and vote.","We have this incredible movement. We have this incredible movement going on. It's on the cover of Time Magazine. It's on the cover of The New York Times which treats us all horribly, by the way. And fortunately, it's a dying paper. It won't be around too much longer. It's on the cover of The Wall Street Journal.","We have a movement going like, by the way, this isn't Donald Trump talking. This is political experts, if there is such a thing like has never been seen in the United States, OK? Thank you. You know and it's not because of little Marco and it's not because of lying Ted, I can tell you that. Do you know that millions and millions of people more are going to the polls to vote?","That's some of the countries, I'll tell you what, if you take a look, all countries are watching this. They don't believe what's happening. Millions and millions and millions of people and yet for the Democrats, they're down 35%. The Republicans have millions of people come in. They're Democrats, they're independents, they're all up there, people who have never voted before.","I have -- I'll sign some papers here in a little while and shake some hands. But let me just tell you. Let me just tell you what happens and I'll tell you that what's happening is, every time I do, I meet every 20th person, says Mr. Trump, he's a 50-year old people, 60-year old, 70-year old, miss -- I had one 92 years old in Tennessee.","Mr. Trump, I've never voted before ever. I've never found anybody that I've wanted to vote for, sir. For the first time in my life, I'm voting and they have a trump shirt on, the whole thing. I'm voting. A massive -- this is a massive number of people. We beat Hillary in the polls. I haven't even started on her.","I have to still get rid of this Kasich guy. I have to get rid of Kasich. He would be so bad as President because he's so weak on immigration, he's so bad on trade, but he had luck, he had the oil. He had a -- pure luck. And by the way, you're going to have huge problems. You watch what's going to happen over the next year or two years with Ohio.","But if I get in it's going to all turn around. You're going to keep your companies here. You're not going to lose this one. You're not going to lose that one. So here's the story, folks. You got to get out and vote on Tuesday or the movement is just going to go down in history as a wonderful, wonderful, lot of talk.","I received a call from a very, very major reporter. Somebody I respect a lot even though he happens to be a Liberal. And he said I'd like to talk to Donald Trump. So they put me on the phone. I said, yes? He goes how does it feel? I said has what feel? How does it feel to do what you've done? Nobody has ever done it in the history of this country.","How does it feel? I said it doesn't feel like anything personally because if I don't win it doesn't mean a damn thing to me. He said, no, you're wrong. He said, no, you're wrong. What you've done will go down in the history books. And I said you're wrong. If we don't win we can't make these changes, we can't straighten out the country and I say it doesn't matter.","So we've got to win. We've got to win on Tuesday. On Tuesday, you have to go and we have to. Now, and just in closing, I have to tell you again, I want to thank the Park, the great Park family. But here's really what I want to do. You're going to win so much. We're going to win with the military. We're going to win for our veterans.","We're going to take care of our veterans. We're going to win with healthcare. We're going to win at the border. We're going to have a strong border. We're going to have a wall. We're going to have Mexico pay for the wall. We're going to take care of it. We're going to win with Common Core and education. We're getting rid of Common Core.","We're going to save our Second Amendment. We're going to save it. We're not going to let them chip away any longer at Christianity which they're doing more and more. We're not going to let it happen. We're not going to let that happen. And we're not going to let them chip away at our Second Amendment.","So here's the story. We're going to win and we're going to win everywhere. We're going to knock the hell out of ISIS. We're going to win with trade. We're going to win with trade. We're going to win with health. We're going to win at so many levels. We're going to, win, win, win. You're going to get so tired of winning.","You're going to say, Mr. President, please, we don't want to win anymore. It's too much. And I'm going to say, I'm sorry, we're going to keep winning because we're going to Make America Great Again. I love you. Thank you. Thank you. Go and vote on Tuesday. Thank you. Thank you."],"text":" Oh, boy. Are we going to win Ohio? We are. We are. Well, I want to thank everybody. This is incredible. Look at all of that media back there. Look at all those cameras. Oh boy, they know who to follow. I wish they could be honest. I wish, wish, wish. You know before we had a tremendous -- in Dayton, we had a tremendous hangar like this. It was packed, packed with people and I was called by my people. They said you were so tight in my face, my face took the whole screen. They didn't want to show the crowd. They didn't want to show the crowd. The whole thing was big. No good, right? No good. No, they're very dishonest people. I have to tell you that. So you know I have to thank -- before I even begin but I have to thank a couple of friends of mine. They're incredible people. They are just incredible people. Oh, so early. Look at that. Look at that. Look at that. Shocking. It's -- do we love our protesters, right? We love our protesters. All right. Get them out of here. Get them out. Where do these people come from? You know Bernie was saying Mr. Trump should speak to his crowd. Mr. Trump -- do you know where they come from? Bernie's crowd. They're Bernie's crowd. Thank you. Get them out. Good. Every five minutes or so one of Bernie's people and sometimes Hillary. But there's not a lot of flavor and not a lot of fervor with Hillary so you don't have too much of Hillary. I'll tell you. So, anyway. Thank you. Where do these people come from? But I want to introduce two friends of mine. They've done an incredible, an incredible job. They love Cleveland. They love Ohio. They own this place. They run it beautifully, Patrick Park and Raymond Park. Come up for a second, Patrick, Raymond. Get up here. Patrick, get up here. Come on. What a great guy. Where's Raymond? Patrick, get Raymond. Come on. These two folks they employ a lot of people. They spend a lot of money in the area and I just wanted to thank them very much. Come here, Patrick. Any of my guys here? Yeah. The next President of the United States, the people's choice, Donald Trump. That is an amazing family. I want to tell you. And they, they love you. They love you. And I love you. I really do. So, yesterday in Chicago, we had a little bit of a problem. We came, we were not allowed to exercise our First Amendment rights. Because a professional organization which printed circulars and printed signs and everything was printed very professionally. You know I'd like to see them hand-drawn a little bit, right? It doesn't look good when they're printed out but they disrupt things and they really, they really stop. We had 25,000 people coming and they really stop these people in terms of our First Amendment, freedom of speech, a terrible situation. I have to tell you and it just makes all of our friends and supporters more angry. We're going to go to the polls on Tuesday. And we're going to be resounding victory, resounding. And I really appreciate you being here. This is our final push. You know all over the world they're talking about what's happening. The momentum that we have. It's a movement. They're calling it a movement. It's not me it's you. I'm a messenger. Believe me. I'm just the messenger. People are fed up with what's going on. And by the way, they're fed up, they're fed up with the stupidity in Washington. They're fed up with the stupidity of trade deals and labor deals. They're fed up with the fact that they haven't had an increase in the last 12 years if you can believe it. The middle-class, the workers aren't being taken care of in this country. We're losing our jobs. We're losing our factories. They're going to China. They're going to Mexico. So, we're here and the great Mayor, your great Mayor said to me, you know Mr. Trump, right here on the left you have Ford, the Ford foundry and that's moving to Mexico. And on the right, you have Eaton and that's moving to Mexico. Now when you think of it isn't it ridiculous? What are we doing? What are we doing? What are we doing it for? Who are we doing this, for what? And then we have a protester that says, oh, what are they protesting about? We want to keep our factories here. We want to keep our manufacturing here. We don't want them moving to China to Mexico to Japan to India to Vietnam. It's crazy. It's crazy what we're doing. What we're doing to our country is crazy and you know you have these people. I'm a conservative person. But I'm in theory not so conservative on trade. And these really stupid people, they call themselves the elite. Now, I don't think the elite. I don't -- oh, another group. Get them out. Thank you. Get them out. Get them out. Troublemakers. They're Bernie fans. Remember when they took over the microphones from Bernie, remember? They took over the microphones, two young women took over the microphones and he walked back like this. These are Bernie's people. Oh, boy. Wouldn't it be fun to meet Bernie in the finals? Wouldn't that be fun? I'd get him out and Hillary too to a lesser extent. Get them out. Get them the hell out. Look at the Hillary sign. Look at the Hillary sign. Look at the Hillary sign. Unbelievable. So, we're going to stop it. We're going to stop being the stupid country because that's what people think of us. We're going to be the brilliant country. We're going to be so smart. We're going to be so sharp. We're going to make great deals. We're going to bring back our military. We're going to take care of our vets. We're going to take care of our vets. We're going to get rid of Common Core and we're going to have local education. We're going to repeal and replace Obamacare. It is a disaster. We are going to have incredibly, incredibly strong borders. We are going to have strong borders on the Southern border. We are going to have a wall. We're going to have a wall. A real wall, folks, a real wall. And who is going to pay for the wall? Who? You better believe it. They're paying. They're paying. OK. OK. So here's the story. We have trade deficits with virtually every country we do business with. With China, it's $500 billion, think of this, $500 billion, and you're losing plants over here, and you're losing a plant over there, and you're losing another plant, I hear, over there. Any direction I can point to you're losing jobs, you're losing your plants. We're not going to let it happen anymore. You have a Governor who I've gotten to know and he's abandoned this state. He's lived in New Hampshire. He's lived there. He moved to New Hampshire. He said he's going to win. I won in a landslide. He moved to South Carolina. He said he was going to win. I won in a landslide. He moved to Michigan. He said he was going to win and if he didn't win Michigan, he'd drop out of the race and I won in a landslide. Why didn't he drop out? And now he said he's going to win Ohio. I don't think so. I really don't think so. I really -- I really don't think so. But your Governor, I don't know if you know this, NAFTA has been a tremendous problem. Your Governor when he was a Congressman voted for NAFTA, OK? He voted for NAFTA. He was a Managing Director of Lehman Brothers when it failed. It went bankrupt and it almost destroyed the world. Lehman Brothers was the beginning of a tremendous mass destruction and he was a Managing Director of Lehman Brothers. You've got the highest budget increase of any state in the United States. Now here's the story. You got lucky. You -- right. You struck oil, OK? Before him, you struck oil. If you didn't have oil. Boy, would you have problems right now. But now the price of oil is down. You're down and waiting to see what happens so high -- oh, in a little while it's going to be a big problem. It's going to be a big problem. He's now in favor of the Trans-Pacific Partnership. It is a disaster. It's going to ruin your car industry, totally ruin it. And believe me, that deal is very bad for a very -- a lot of reasons. Number one, you shouldn't sign with that many countries. Do you know the document is almost 7,000 pages long, 7,000 pages, 7,000 pages long and nobody from our country has read it? Believe me. But the other countries have all read it and they know every word. And it's just another way to take advantage of jobs manufacturing and everything else in the United States. We're not going to let it happen anymore. We're not. You can't get them out. Get them out. Yeah. Get them out. That's a Bernie person. It's a Bernie person. It's a Bernie person. I'd get that Bernie person out of here. Hell's up a sign I'm a protester. All right. Get them out. Get them out. Let's do a USA chant. USA. USA. USA. USA. I saw Hillary Clinton saying on the way up Donald Trump has got to speak to his people so that they're non-violent. My people aren't violent it's these people that come in. My people want to do one thing Make America Great Again. That's what they want to do. One thing. So the Governor, your Governor has let your coal industry down. He's let it go to hell. Your steel industry is going to hell. We're going to revive it. We're going to bring it back. And it's so important so we're bringing it all back. Your EPA here has caused you tremendous problems. All of these things are coming back, folks. And by the way, Kasich cannot be President. He's weak on immigration. He wants people to come in. He's in favor of amnesty. He can't be President. So I hope you're going to remember that when you go to the polls. Thank you. What a crowd, man, 29,000 people. Unbelievable. And when you go home you won't see yourself, although, you will if we have a couple of more protesters, you will maybe. So this began in June, on June 16th and it started with trades, it started with the border and I came out. I came down the escalator and you know what? Who would have thought that my statement on illegal immigration would have mushroomed into such an important statement? What happened is everybody now is copying us. I just got endorsed by Sheriff Joe Arpaio who we love. And you know when Sheriff Joe endorses you about the border, we know that you have a tough plan and the right plan. And by the way, by the way, yes we're going to have the wall. Yes. Yes, Mexico is going to pay for the wall, 100%. They are but people are going to come through that wall. But they're going to come through that big beautiful door but they're going to come through legally, legally, legally. And we're going to have situations, I'll tell you what, folks. Our country is going to start winning again. We don't win at all. We don't win at all. We don't win with our military. We don't win in any way. I mean, I'm fighting a battle in Florida where you have little Marco. You know Marco, little Marco, and Marco, boy, oh boy, I've never seen -- number one, he's a joker. Did you ever see anybody choke like that during a debate? By the way, who won the last debate? Believe me. I think I won all of the debates. You know I hear all about lying Ted, lying Ted, lying Ted. So you know I have the Evangelical support and everyone thinks, oh gee, that's amazing. In South Carolina, it was supposed to be an easy victory for Ted and it turned out to be a lot -- do you know what happened? He hurt Ben Carson, who by the way, just endorsed me, right? A great guy. But he cheated Ben Carson horribly in Iowa, and all of a sudden, people started getting wise to it. And he walks in with a Bible held high. This is lying Ted. He has the Bible high, waves the Bible, puts it down, then he starts talking and he lies. So it's a lie and lying Ted. And then Marco over here, Marco, what he does, but most importantly, what is he? He's a choke artist who never goes to vote. I mean, here's a guy representing Florida, has the worst attendance record in the last 20 years in the U.S. Senate. Who the hell wants him to represent you? Who? So I think Marco has got a lot of problems. He's got other problems. Just take a look at the ads. You know I figure we might as well put a couple of negative ads up, there doing it on me by the way. Has anybody had more negative ads in history? All of these special interests -- I'll tell you one. I got to tell you one. So this stupid growth for, for, what is it? health for growth, Club for Growth, these people come in. Club for Growth. So they come in to see me last week. They come in to see me about a year ago last week and they want to talk. What do you want to talk about? And I did it for a friend. He said would you see that -- they come into my office, they ask me for a million dollars. Now you can be rich but, you know, what are you doing, right? We don't want to be stupid people like the people running our country, right? So they come in, Club for Growth, they come in and they give me something -- the guy's an ex-Congressman. So you know he can't be very honest, OK? Except for your Congressman here is great. I have to tell you and I think he endorsed me. So they come in, and they say, we have this, we have that, Club for Growth. I didn't know what the heck he was talking about. It didn't make any sense. It was a waste so I told him very nicely that I'm not interested in being extorted and I said, no, I'm not going to give you $1 million. They went so negative. So now they're putting up -- any time you see Club for Growth remember this. It's extortion. Just think of it. It's an extortion plot. They came to my office, they asked for $1 million. Then stupidly, he writes me a letter asking for $1 million, OK? Now, I already sort of turned him down. But he writes me a letter asking for $1 million. We were very nice. We tried to be nice. We told him, no, thank you very much. We really love you very much. No, thank you, right? And now they do negative ads. I have had more negative ads than any human being. And yet last week, Mississippi, unbelievable. Michigan, unbelievable. Hawaii un -- I don't know how. I don't know how. And I'll tell you those ads are lies, they're lies. They are so dishonest. They say whatever they want to say and they're really dirty rotten lies. Just remember that. And they're put up, by the people, the money is put up by the people that controls the people that I'm on the stage with. They control Ted Cruz and they control Little Marco Rubio. They have total control. In fact, you have guys in Washington, lobbyists. It says Rubio on his forehead. You go to him. You pay them a big fee. It's practically guaranteed you get their vote and they will do anything these guys say because they give them a lot of money, OK? Me, I'm different. I'm self-funding my campaign. I'm working for you. I'm working for you. Believe me, I'm working for you. So here's what I have to tell you. So one of the reasons I happen to be conservative but one of the reasons I like to say, you know, the elite, the elite, they call themselves the elite conservatives. They're not elite like I am but I'm more like you. Believe me. I'm more like you. I put in one of the greatest financial statements probably ever given to the Federal Elections Commission. Nobody reports on it. Do you know why they don't report on it? Because it's so good. They were so unhappy when I put in those numbers. They thought, oh, you know, I'm a private company. So the numbers were far bigger, far better, far -- I mean, they were incredible. Look, tremendous assets, some of the great assets of the world, very, very, very little debt, unbelievable cash flows but the best assets, and they don't want to report it. Do you know why? They had no idea this was going to happen. Don't forget. They said he'd never run. Then they said he'd never file Form-A because that's basically a one-pager where you sign your life away. When I did that they said, whoa, he said he's running. He's out. Then they said he'll never file his financials. And I filed the financials almost 100 pages and it's the best ever filed with the Federal Elections by a factor of a lot. Mitt Romney is like this, he's a little tiny peanut, a little peanut. I mean, I have a store that's worth more than Mitt Romney which is true. I -- so, no, but the jealousy -- because the truth is, the truth is, we have to bring our party together, folks. We have to. We're going to win something that's going to be special. We do have to bring our party together. The reason I tell you about the forms and the reason I tell you about the filing of the financials because the financial say a lot and it only means this, we need that kind of thinking for our country. Because right now, we're being ripped off by everybody. We're like a whipping post for everybody. We can't let it happen. We have $19 trillion in debt. They want to cut Social Security which I'm not cutting. I'm going to bring our jobs back. I'm going to make our country wealthy again. And I'm the only one that's not cutting it. I will not cut it. So we have a ways to go. We have a ways to go. And when I heard about Ford and when they told me, I mean honestly, when the Park family came over and told me about Eaton and told me about Ford. You know Ford right now, they're building almost completing a $2.5 billion plant in Mexico. Right there and that's one of the divisions that's going there. But $2.5 billion they're taking out of Michigan. That's why I won Michigan because nobody can protect you like me. Believe me. Now I like free trade. I like free trade. But it's got to be smart trade, folks. It's got to be something. When we lose $505 billion in trade, think of it, $505-billion trading with China, who needs to do this? Why are we doing it? What are we doing? And to deal with China is almost impossible. You can't get your product in, and when you do get it in, you know what happens. They tax the hell out of you. With them, they send it in we don't tax them. So here's what we're doing. Carrier and Ford, I could, I could change, and frankly, Nabisco, and hundreds of other companies moving out to Mexico. Mexico is the new China, smaller version, OK? Believe me. We have a trade deficit with Mexico of $58 billion this year, all right, $58 billion. And then there's these stupid politicians they say they won't allow you to build a wall. I said yes they will. Yes, they will. By the way, by the way, ready? 100%. I don't mean like 99%. I won't be coming back to you in two years and say, folks, I'm sorry, it's impossible. You know one of the reasons they wanted to build it 15 years ago, you won't believe this, but they couldn't get their environmental impact study approved. Do you believe that? Because there were snakes in the way or turtles or rats or something was on the way, snails, snails are always good. We will get that built so fast your head will spin. So they said, they were telling me, we need it. You know I had a great victory in New Hampshire, a great, great victory in New Hampshire. And I love New Hampshire because it was my first really great victory in terms of politics. Hey, I've been doing this for eight months. I haven't been doing it that long and I won New Hampshire in a landslide, just a total landslide. And I told those people, I said if I -- -- win I'm going to do something because you go to New Hampshire, the most beautiful fields, the most beautiful trees, everything's beautiful, and you go to a meeting with the people, and you say, what's your number one problem? They say heroin. I say heroin? You know it just doesn't go. I said what do you mean heroin? Oh, it's our number one -- every single meeting I went to, it's drugs, it's heroin coming over the Southern border. They poured their drugs over. We get the drugs they get the cash, folks, not going to happen anymore. It's not going to happen anymore. Not going to happen. So what we're going to do and I made that pledge to the people. I made that pledge very strongly to the people of New Hampshire and I'm making it to the country. But I specifically said, if I get in, you'll going -- we're going to get the kids better. Their youth is just -- it's disastrous. For some reason, bigger in New Hampshire, bigger in New Hampshire than I've ever seen anywhere else. And it's so strange because it's just not the setting for it. It's just not what you think. So we're going to take care of that drugs and drugs pouring in like it's water into our country. So we get drugs they get cash. It's over folks. It's not going to happen, OK? Not going to happen. So let me, let me just tell you. So here's what we're going to do. I'll use this as an example. Now my daughter Ivanka, do we know Ivanka, right? So she said the other night in the debate, daddy, daddy, I want to talk to you. What? Would you please act Presidential in this debate? I said I've won every debate so far. You know if you look at Drudge, if you look at Time, if you look at Slate, if you look at all these online polls, every single debate according to every single poll I've won. I say what do you mean Presidential? I want to keep winning. She said dad don't hit back so hard. You don't have to hit back. It's over. You don't have to hit back. He said, this guy's a lightweight, I don't know. I call him lightweight. I call him a lightweight. But she said don't do it. Daddy, be nice. Just don't do it. So every time I was ready to go after him I thought of Ivanka, and I said you know what, and my wife Melania, she said don't hit back so hard. You shouldn't do that. Act Presidential. So I said all right. So everybody said I acted Presidential. I didn't hit back and my poll numbers went up. So they were right. Can you believe it? They were right. They were. But here's where I won't act so Presidential. So it doesn't look Presidential when I call -- so Carrier, you know, closed up their plant and they're moving -- they -- you saw the announcement three weeks ago some management guy gets up, and he wasn't even nice about it, frankly. You'd think he'd be nice about it. He said after many, many years, all these great people, 1,400 people. We're closing our plant. We're moving to Mexico was almost set like that. Horrible. We're closing our plant. We're moving to Mexico. By the way, folks, whether you're highly educated or not highly educated, how does that help us, right? How does it help us? So we're closing our plant. We're moving to Mexico. So here's what I'd do. Now I have the best business leaders in the world, Carl Icahn, some of the smartest, the best, we have the best in the world. We're going to use them for trade. We're going to use them for negotiation. We're going to use them to our advantage. Nobody can out-negotiate these deals. But here's what I'm doing. Don't worry about them. Let them run. Let them run. Don't worry about them, folks. Don't worry about them, folks. Don't worry about them. Let's just talk, talk over, OK? So here's what I'm going to do. I'm not at all going to look Presidential but I'm going to do it myself anyway. I'm calling up. The head of Carrier and I'm going to say -- this could be Ford, by the way, this could be Nabisco, this could be any one of the hundreds of companies that are pouring into Mexico because our leadership is so stupid. They let it happen. This could be Pfizer that's moving to Ireland. But here's what I'm doing. I'm going to say something that conservatives don't like. Because, well, I'm a free trader. I'm a smart trader. I'm a fair trader. I know what I'm doing. I'm going to say to Carrier, enjoy your new plant. I hope it's lovely. I hope you make a lot of air conditioning units and I buy a lot of Carrier but I'm not buying anymore. I hope you make a lot of air conditioning units but here's the story, every unit you make that crosses the border -- and now we're going have a real border remember that. We're going to have a real border. We are charging you 35% tax on that unit, and you know what they're going to say, they're going to call up their lobbyist but the lobbyists can't get to me because I haven't taken any of their money. And they're going to call up their special interest friends, and they're going to call me, and I'm not even going to take that call. They didn't give me anything. I turned down tens of millions of dollars. I have turned down, folks. So Jeb Bush had $148 million. Can you believe that? Jeb, Jeb, spent $168 million on his campaign and he was down here. I spent peanuts and I'm by far number one, now, peanuts. What's peanuts? What's peanuts? What's peanuts? $30 million is always money, right? But I spent relatively little. Wouldn't it be nice if our country was that way, where the guy who spends the least is in first place you know? In education, in education, out of the top 30, the 30 countries that they look at, the United States is number 30, last. We're last but we're number one in cost per pupil, number one. Think of that. So we're number one. Not good, right? So we are going to change it around and we're going to have a situation where -- oh, let him go. Let him go. They have no voice. Listen, look, it's a Bernie person. It's a Bernie -- hello, Bernie. Hey, Bernie get your people in line, Bernie. Get your people in line. Can you imagine Bernie saying that Trump should get his people under control and they put in these people? And by the way, our crowds are so much bigger than Bernie's, you wouldn't believe it. Not even. And I think Bernie's finished but you never know. Hillary is really doing badly, right? You never know. I think he's finished but we've been saying that for about four weeks. Hillary just seems -- I don't know she -- Hillary cannot seem to win even against a communist. I mean, how is it, how is it that in this great society that, you know, in our great, great world, that a communist cannot be beaten by Hillary Clinton. It's terrible. OK. So here's the story, folks. They will call me and they will put -- but I didn't take any of their money, right? I don't care. I'm working for you and I will tell the Head of Carrier, no, I'm sorry. The 35%, I mean it. It's done. Enjoy your plan. Have a good thing. He'll call me back within one day. As sure as you're standing there, and he'll say, Mr. President, we've decided to stay in the United States. I'll say thank you. Thank you. That's what's going to happen. By the way, that's not 90% or 95%, that's 100% sure, all right? That's 100% sure. So look, I just want to tell you, so important, so important, is on Tuesday you have to go out and vote. We have this incredible movement. We have this incredible movement going on. It's on the cover of Time Magazine. It's on the cover of The New York Times which treats us all horribly, by the way. And fortunately, it's a dying paper. It won't be around too much longer. It's on the cover of The Wall Street Journal. We have a movement going like, by the way, this isn't Donald Trump talking. This is political experts, if there is such a thing like has never been seen in the United States, OK? Thank you. You know and it's not because of little Marco and it's not because of lying Ted, I can tell you that. Do you know that millions and millions of people more are going to the polls to vote? That's some of the countries, I'll tell you what, if you take a look, all countries are watching this. They don't believe what's happening. Millions and millions and millions of people and yet for the Democrats, they're down 35%. The Republicans have millions of people come in. They're Democrats, they're independents, they're all up there, people who have never voted before. I have -- I'll sign some papers here in a little while and shake some hands. But let me just tell you. Let me just tell you what happens and I'll tell you that what's happening is, every time I do, I meet every 20th person, says Mr. Trump, he's a 50-year old people, 60-year old, 70-year old, miss -- I had one 92 years old in Tennessee. Mr. Trump, I've never voted before ever. I've never found anybody that I've wanted to vote for, sir. For the first time in my life, I'm voting and they have a trump shirt on, the whole thing. I'm voting. A massive -- this is a massive number of people. We beat Hillary in the polls. I haven't even started on her. I have to still get rid of this Kasich guy. I have to get rid of Kasich. He would be so bad as President because he's so weak on immigration, he's so bad on trade, but he had luck, he had the oil. He had a -- pure luck. And by the way, you're going to have huge problems. You watch what's going to happen over the next year or two years with Ohio. But if I get in it's going to all turn around. You're going to keep your companies here. You're not going to lose this one. You're not going to lose that one. So here's the story, folks. You got to get out and vote on Tuesday or the movement is just going to go down in history as a wonderful, wonderful, lot of talk. I received a call from a very, very major reporter. Somebody I respect a lot even though he happens to be a Liberal. And he said I'd like to talk to Donald Trump. So they put me on the phone. I said, yes? He goes how does it feel? I said has what feel? How does it feel to do what you've done? Nobody has ever done it in the history of this country. How does it feel? I said it doesn't feel like anything personally because if I don't win it doesn't mean a damn thing to me. He said, no, you're wrong. He said, no, you're wrong. What you've done will go down in the history books. And I said you're wrong. If we don't win we can't make these changes, we can't straighten out the country and I say it doesn't matter. So we've got to win. We've got to win on Tuesday. On Tuesday, you have to go and we have to. Now, and just in closing, I have to tell you again, I want to thank the Park, the great Park family. But here's really what I want to do. You're going to win so much. We're going to win with the military. We're going to win for our veterans. We're going to take care of our veterans. We're going to win with healthcare. We're going to win at the border. We're going to have a strong border. We're going to have a wall. We're going to have Mexico pay for the wall. We're going to take care of it. We're going to win with Common Core and education. We're getting rid of Common Core. We're going to save our Second Amendment. We're going to save it. We're not going to let them chip away any longer at Christianity which they're doing more and more. We're not going to let it happen. We're not going to let that happen. And we're not going to let them chip away at our Second Amendment. So here's the story. We're going to win and we're going to win everywhere. We're going to knock the hell out of ISIS. We're going to win with trade. We're going to win with trade. We're going to win with health. We're going to win at so many levels. We're going to, win, win, win. You're going to get so tired of winning. You're going to say, Mr. President, please, we don't want to win anymore. It's too much. And I'm going to say, I'm sorry, we're going to keep winning because we're going to Make America Great Again. I love you. Thank you. Thank you. Go and vote on Tuesday. Thank you. Thank you."}