{"id":429,"author":"Donald Trump","title":"Speech: Donald Trump Delivers a Campaign Speech in Vandalia, OH","date":"2016-03-12","link":"https://factba.se/transcript/donald-trump-speech-vandalia-oh-march-12-2016","paragraphs":["Do we love Nick? Do we love Nick? The best. He's the best. Number one. Number one in his position, by everybody, and everybody tells me. So thank you all very much. And Nick, I want to thank you very much. What a good guy, Ohio. Oh, I love Ohio. I love Ohio. You know, I worked in Ohio for summers in Cincinnati and I love Cincinnati.","And I had a great experience. It was early on and it was a job and I bought it with my father. I bought it and worked out really well. I stayed here. I ran the job myself. I was very, very young and I bought it for this and I sold it for this and I look good and I felt good. It's like sinking that first putt or getting a homerun your first time at bat.","So I always had a great feeling for Ohio and the people are amazing people. Thank you. I love you. Look at these people. I don't know if the media is getting this. I mean, here we have a full hangar and we thought with this. And this is a big, big hangar. This can take just about anything. And we figured the crowd would be OK. And we have so many thousands of people extra that we had to put them out in the runway, right?","They never want to capture that. Just so you understand, right? They never want to. So I'd say -- it's really fantastic. Let's address -- thank you, darling. I love you too, darling. Look at that. This is amazing. So let's address yesterday should we? Yeah. So look, we had a tremendous rally in Chicago planned.","We're going to have over 25,000 people. The arena was seating about 11,000. We had registered much more than 25,000. So what we did -- that's all right. That's OK. I understand. You're loyal to other places and that's OK. But what happened. It was very interesting. So what happened and these were great people.","These are people like yourselves. These were people that want to Make America Great Again. That's all it is. It's very simple. And they were pouring into the arena. Good arena, everything nice, and all of a sudden, a planned attack just came out of nowhere. Printed by and it was printed by people that were professional people.","If you look at the posters they're all printed. They have a mark on them, who made them, all done by a group, all very professionally done. A disgrace, if you want to know the truth. And with these thousands of people and forced out of them, no, don't go because we would have had a problem like you wouldn't have believed.","Just like Big Nick over here. He would have been in there, they would have wiped him out, and that would not have been good. And we made and we made a decision. We said -- and I hated to do this because frankly, I would have been easier to go but I didn't want to see anybody get hurt. You would have had a problem, like, they haven't seen in a long time because we have people that are so amazing and it's not necessarily loyal to me. It's loyal to the country.","We want to see things happen. We want to see things happen. And they're loyal to the country. It's OK. USA is right. They're loyal, they're loyal to the country. They want great security. They want great military. They want to take care of their vets. They want a border. They want a wall.","They want -- We're going to build the walls, folks. Don't worry about it. Who's going to pay for the wall? Who? Do we have a good time? Do we have a good time? You know, it's sort of interesting I watched, uh, well, I shouldn't say it but I watched little Marco and I watched lying Ted Cruz, lying Ted.","He holds up that Bible and then he puts it down and he lies, lying Ted. Even Rubio said, boy, he's a liar. He lies about everything. And you know, I have the Evangelical vote, and I've had great support from Jerry Falwell's Union, everybody, Sarah Palin. We've had -- we have such unbelievable support but I have the Evangelical vote and I won in South Carolina all of these.","I mean, we did so well and he was supposed to win in South Carolina and I won in a landslide. And we got Evangelicals and you know why? Because they don't like liars. They don't like liars. Right? So anyway, so -- but they said just as I was coming in I'm watching and I'm watching the news and they said, well, at our rallies, we would never have anything like that.","They don't have any people at their rallies, folks. There's nobody there. Nobody cares. If they had this hangar they'd have about four people in the corner over there in that little corner office. You know and they'll call it a town hall meeting. Do you ever notice? They say town hall meetings. They always say why don't you have more town hall meetings?","I said because I have too many people, can't have them. So anyway, I'd actually like to have a couple of town hall meetings but I don't -- I just, you know, don't like -- we'd have to turn away how many people? Like, 24,000? We'll have 500,000 we'll turn away 24,000 people. So what happened yesterday was incredible.","We dealt with law enforcement. So good. So good. We love our police. Do we love our police? But we dealt with law enforcement at every level. Secret Service, great. The whole group. And it was determined that if we go in it could cause really bad, bad vibes. And you have to understand. They want me to tell my people.","Please, be nice, be nice. My people are nice. The people that came there were so nice. And let me tell you, the people that were there, that came there, that were invited there, thousands and thousands of people, they caused no problem. They were taunted. They were harassed by these other people. These other people, by the way, some represented Bernie, our communist friend.","Now, really Bernie should tell his people -- there weren't too many Hillary people there. You know why? I mean, in all fairness to Bernie. The reason there weren't Hillary people, they have no fervor. There's no fervor. Say what you want about Bernie at least they have a little bit of fervor, right?","But with Bernie, so, he should really get up and say to his people, stop, stop, not me. Stop. They said, Mr. Trump, should get up and this morning tell his people to be nice. My people are nice, folks. They're nice. They're great. They're great. My people are great. My people are great. So, so here's the story.","So we get up and I make the decision and the people in the audience were really devastated. You know some of those people got there like you. They got there like eight hours early. Now, they're standing there for eight hours, like you, right? Like you. Raise your hand. Who -- we love you people. Don't worry, I'll sign autographs.","Don't let them. Don't let them rip you away from that position. No one is -- the only one could rip you away is Nick Mangold. That's him, we can't do anything about, right? So anyway, so what happened is everybody was fine. Everybody was behaving and what they've done really, on the other side, it was moveon.org or one of these groups, bad groups these are bad people.","Let me tell you, these are people that truly don't want to see our country be great again. I'm telling you. I'm telling you that and we want to get along with everybody. And we can get along with people. We're going to unify the country. Our President has divided this country so badly. He has been a -- I call him the great divider.","You know, when he got elected originally, I said, you know, I don't think he's going to be a very good President. Who knows? I hope frankly, I wish he were. I wish I didn't have to do this. I wish we had the right people. I wish we didn't have to do it but we have to. We have no choice. When you look at the Iran deal.","When you look at the horrible trade deals where we're losing a fortune to every country we do business with. Our jobs are being sucked away. Our jobs are being sucked away. It's unbelievable what's happening. Our military can't beat ISIS. It's being depleted. It can't beat ISIS. Our veterans are being treated horribly.","Our border, our border is like a piece of Swiss cheese. The people just come pouring across. We don't have borders anymore. So let me just tell you. And on top of that, we have a divided country. We have black and white and every other thing, income groups, everybody hates everybody, even in Congress. You look at Congress.","You look at Washington. Look at the politicians. The politicians hate each other. The Democrats hate the Republicans. The Liberals hate the Conservatives. We have got to change our thinking. Yeah, and if there's a group out there just throwing them the hell out that's OK. So look, we cannot let our First Amendment, we just can't. We cannot let our First Amendment rights be taken away from us, folks.","We can't let it happen. We can't let it happen. We have a right to speak. I mean, we are law-abiding people. We're people that work very hard. We're people that have built this country and made this country great. And we're all together and we want to get along with everybody. But when they have organized professionally staged wiseguys.","We've got to fight back. We've got to fight back. So, oh, do you have anybody? Oh, hello. Do we have anybody? You know, I love the protesters because it shows what's happening. They will not show -- the media is, by the way, the most dishonest group of people I've ever met. The worst.","They are -- they'll say today, Donald Trump came to Dayton and he had a small crowd, a smattering of people came. They don't say it was so big, it was bursting out of the biggest hangar I've ever seen. Now, they'll say a small crowd or a representative crowd was there. You know that means like what 15 people?","We have these crowds everywhere, folks. And let me tell you something. We have amazing people in this country. I am so impressed with the people of our country. We're going to start making Apple products in the United States, OK? Not in China. When Carrier air conditioner says they're leaving the United States, 1,400 people, because they're going to build in Mexico, and Ford is going to build in Mexico, and Nabisco is leaving Chicago because they're going to build in Mexico.","Not going to happen with me. We're going to keep our businesses here. And let me just tell you, while we're on this subject, let me talk about your Governor. Do you mind for about two minutes, OK? I want to tell you because he's got -- I mean, it's a boring subject but we'll talk about him anyway. Look, he was the Managing Director of Lehman Brothers which was one of the great catastrophes in the history of this world.","Lehman Brothers failed and almost brought down the world if you remember. And Kasich was a Managing Director. He was right in there dealing with all the big boys, all of the people that made these horrible decisions at Lehman. Another thing, he voted for NAFTA. You people forgot. He voted for NAFTA.","Now, he was a Congressman and he voted for NAFTA. NAFTA has destroyed New England but it's destroyed it -- I mean, you have fought for years and years and years, and you'll never recover completely from it, but you will if I get elected because we're bringing those businesses back. So, so NAFTA, putting a vote up. In my opinion, anybody that puts his hand up for NAFTA, Clinton signed the bill, but NAFTA wiped out states.","It wiped out entire states. It wiped out New England. It's taken years and years and years and you look at those factories and they're made into senior citizens housing and it's all wonderful. But we need jobs, folks. We need jobs. We don't have our jobs anymore. Our jobs are going to China to Japan to Mexico.","Our jobs are going to Vietnam. We're losing our jobs. We're losing our base. We're losing our manufacturing. We're losing everything. We're losing at every single item no matter what. Whether it's healthcare or whether it's trade. I mean, think of it. Our military, do we have great military, right? Right?","But we have a problem. We have a problem. Our military can't beat ISIS. Now, I know, we could knock them out in two days if we wanted to. But we don't have. Do you know what I call ourselves? We're the politically correct warriors, OK? We can't attack the oil because it's going to go into the environment and it's going to affect the carbon footprint.","Do You believe this? And have I been saying for four years, hit the oil, hit the oil, hit the oil? Right? I've been saying it for years. And I also said, by the way, don't go into Iraq, you're going to destabilize the Middle East. I said it loud and clear. You know they try and say, oh, but years ago, let me tell you something.","I said don't go into Iraq. Now, it turned out that Iraq, you know, I mean, in all fairness, they didn't have weapons of mass destruction. I'm not saying I knew that. I said for other reasons, don't go in but we have destabilized the Middle East. All of the things that you see right now that was one of the worst decisions ever made.","Then you have Obama and he made it worse because of what he did. When he got out, instead of slowly getting out, and not saying when and keeping some soldiers there, look, you shouldn't have gone in. You shouldn't have gotten that with everybody. And then what he does, he announces a date.","We're going to be leaving by such and such a date. And on the other side, the other side is looking at this thing, I can't believe he gave us the date. It must be some kind of a wise guy move, right? It wasn't. He moved out that date and they all just pulled back and that's what they did. Do you remember about two months ago, three months ago, he said, we're sending 50 soldiers in, right, 50. And then you say, why does he have -- why can't we be unpredictable, right, in war?","Why can't -- it's like these guys. These dishonest people back there. They're always like, what would you do about ISIS? And I'm supposed to layout my plans? I never wanted to say attack the oil to them. I never wanted to say it. I wanted to knock the crap out of the oil, OK? But, but, but, I don't want to say it. I want to surprise the enemy you know.","Our wonderful -- look, I want to surprise, you know, unpredictability. General Douglas MacArthur, I had great respect for MacArthur. I had great respect for General George Patton. Do you know what they're doing now? Right now they're spinning in their grave as we announce every single move. So we announced a few months ago, we're sending 50 soldiers.","Now, number one, it's not even a good announcement because 50 soldiers. It sounds like that -- but these are very elite people, very talented people. They, right now, have a target on their back because of the announcement. Why don't you just send him in President and keep your mouth shut and just relax, and let them do their job, right?","Let them do their job. So let me just -- let me just go over a couple of things with Kasich and we'll be done and you'll make a decision. He's not the right guy to be President. He's not tough enough. He's not sharp enough. In my opinion, he is I mean, maybe he wins Ohio and maybe he doesn't. But he's very weak on illegal immigration.","He's totally in favor of amnesty which you cannot be in favor of. Look, folks, we even -- we either have a country or we don't. All right? He's very, very weak on illegal immigration. We and -- he wants amnesty and he's wanted it always. And he talks about it. Now as far as cars, as far as everything that you have right now, you're industries that haven't been taken out of Ohio.","Here's what we have to do. We have to protect your coal industry which is getting decimated. And we have to protect your steel industry. Your steel industry is being decimated. It's being decimated. Now, your Governor is in favor of the Trans-Pacific Partnership which is a disaster. By the way, I'm telling you it's a disaster.","And I was so strong in the debate on it and I think -- did I do well in that debate or what? Did I? You know, I actually like debating the other way better but they all came to me, they said, even my daughter Ivanka, Dad, you're the smartest one up there. But you have to act presidential. And you know, do you mind if I take off my coat?","The weather's so beautiful. Do you mind? So Ivanka said, Dad, you have to act presidential. You're doing so well, but don't fall for it, when they attack you, don't fall for it. Just yet -- and I said to myself, well, here's the problem. You have little Marco saying all sorts of things which weren't true by the way, weren't true.","But they're not as big as Nick I can tell you that. But bigger than most hands. In fact, I was getting ready to grab him. When he was choking, when he was choking like a dog. I was getting ready to take that hand and hold him up because I thought he was going down and I tell you with Chris Christie, who endorsed me by the way, and Ben Carson yesterday endorsed me. Right?","You know it's interesting. I got a call from a couple of very, very great people, and strong Evangelicals yesterday, and they said, you know, we were teetering on you a little bit. We were sort of there but maybe we weren't going to get there. As soon as Ben Carson endorsed you, Donald, we were there. We are with you 100%. So, I want to thank, I want to thank them.","But look, your coal industry, your steel industry, you know, all these industries are under siege. The EPA is -- the Environmental Protection Group. I mean, they are a disaster what they're doing. And what they're doing to Ohio, more so than most, they're a complete disaster. We're going to change things around.","Now, Transpacific is going to destroy your auto industry in Ohio. They're going to do everything. They're going to take it away from you just like you're a bunch of babies. Not going to happen if I become President, OK? Not going to happen. It's a horrible, horrible trade agreement, doesn't get any worse but it's a horrible trade agreement.","You have 12 countries, all of whom, want to rip our heart out. You have China which is not a part of it but wants to be a part of it at a later date. They're watching every move. The document I hear is 6,000 or 7,000 pages long. It's too complicated. It's too big. Each country knows every word of that document and our Congressmen and our Senators, Senator, our people have never even looked at it or read it. We don't even know what the hell it says.","We should not do it. And the most important weapon that they have to kill our industry and to destroy us on trade is monetary manipulation, devaluation of their currencies, and they are grandmasters. The greatest of all time is China. But Mexico's getting really good at it. Japan is a total professional.","Japan. What they're doing with the yen and what they're doing to us with the cars is incredible and it's got to stop. It's got to stop. You know, you go off to Los Angeles, you see those boats, the biggest ships you've ever seen, loaded up with cars from Japan. You know, NASCAR and Brian France, I guess, you probably heard from NASCAR, they endorsed Trump.","Trump. Trump. And many of the drivers and many, many of the drivers. We had such great people up there, including the young, hot rookie, Chase Elliott. We know Chase and his father Bill. I mean, the whole group. It's a great group but they understand. They get it. They're really smart people. They get it. We got to keep our industry.","Now, your Governor wants to do TPP. He's got to take it away, got to take it away. Regardless of what happens on Tuesday, he's got to take that support away because TPP, you -- Ohio is a target, is a target of TPP. You'll lose your auto industry entirely and you have to get it stopped. So with all of that being said, you have a Governor, that honestly, if you didn't hit oil, Ohio would be a disaster right now.","You got lucky you were sitting on top of oil, folks, OK? Like Saudi Arabia got lucky. By the way, we protect Saudi Arabia before the slide they were making $1 billion a day. They pay us peanuts, OK, like we're, like we're indentured servants. They pay us peanuts. Now, they make $1 billion a day. So now, let's say they make half, the oil went down.","And the problem with Ohio, by the way, now that the oil is down, you've got big problems coming because you had in the United States, the largest increase in a budget. In the United States, 35% or 36%, the budget of Ohio, and you're relying on the oil. But you can't rely on the oil now because the price is so low.","So you got a lot of problems. You better be careful. I've been seeing signs. Ohio is in trouble because of the price of oil. You made a lot of money with oil. You were lucky as hell. I mean, other places are cutting, cutting, cutting, but they don't have the oil factor. But now, you don't have the oil factor so much anymore because of the price.","Saudi Arabia. Saudi Arabia, if you look at all of these countries, not -- nothing richer. Nobody richer relatively than Saudi Arabia. So they make $1 billion a day. Every time there's a threat to Saudi Arabia, we turn on the ships, send over the planes, it costs you $1 million just to turn a button on some of these ships, right?","To turn on the battleships, being let's start the engines, let's check them, boom, $1 million down the drain, OK? Look, we spend billions of billions of dollars protecting wealthy countries and we're not a wealthy country. We owe $19 trillion. Our country is weak. Our country is soft. We have leadership that's pathetic and it's got to change, folks.","It's got to change. You know, you've probably seen, you know, this whole thing of torture. I don't want torture, I don't, nobody wants torture but we're dealing with people that are animals. We're dealing with people in the Middle East that chop off heads, that drown 50 people at a time in steel cages, heavy, heavy steel cages, and they drop them in the water, usually ocean, wherever they can find, and they drop them in the water, and they hold them for one hour, and then they pull them back up all dead, and then they put another 50 in. We're dealing with animals.","And then, the question was asked, and it was tough, it was a tough ask. They went to Ted Cruz who was on my left. By the way, I've been on the center of every debate from the very beginning. Does that say -- OK? And I never did this before. I never debated before. I do get credit. They say, you know, one of the wise guys back there, said, you know, and actually, I liked him that day.","He said, you know, the amazing thing about Trump? He's not a politician. He's only done this for eight months and he's killing everybody. What do you think, huh? Pretty good. I like that. I don't know. I like that because I still believe incompetence over experience, OK? And yet, I have, I have great experience.","But here's the thing. Here's the thing. I've been dealing on the other side of the equation for a long time. Nobody knows politicians better than I do. Nobody knows about all of the things like PACs, which by the way, are a disaster. But like PACs and funding. I -- you know, I was -- I hate to say this. I was like sort of very, very Establishment nine months ago.","I dealt from that side and then I saw how stupid everybody was, the stupid decisions, and I say, I'm going to become very anti-Establishment. And I said I'm going to run. And the Establishment said, hey, Jim, do you believe this? Trump is running. This is bad. He's self-funding his campaign. He doesn't want our money.","We're not going to be able to control him. We've got to fight him. We've got to fight him. Because I know what has to be done. But just to finish on torture, OK? I love hopping around. You know, somebody -- some people said, it's like a great chess game where you go from being, being, then, you know, you're remind -- you go here but you never forget.","You never forget. So we were at torture and I want to just tell you. So they asked Ted Cruz the question on waterboarding. Now, here are people that are like medieval times. I haven't heard about chopping, you know, James Foley, and that was the beginning, right? A wonderful young man, yet, so many wonderful people.","A lot of Christians but Christians, everybody, anybody gets in the way, boom, chop off their head. So you got to stop that. You've got to stop it. We can't, we can't allow that. We can't allow that. We can't allow that. In our world, we cannot allow that. We shouldn't have gone there but you know what? Now, we've got to stop it, OK? And now, we've got to go in. We've got to knock the hell out of them.","But, but they asked Ted Cruz, who was right here on my left, and you know, he's a nice guy, except he'd lie so much. He said, they said, they said, Senator Cruz, waterboarding. What do you think? And he goes, uh, let me go back and talk to my consultants. It's a bad question. I don't know. You know, they're all afraid of being politically correct, right?","Then they go to me because he didn't give an answer. And you know, he's a great debater but he's a lousy talker. Does that make sense? He can't talk. He talks, he goes, hey, ha, who, ha, it's crazy. He's a great debater. Well, I don't know if he's a great debater. I think I beat him in all the debates.","I don't know. So -- but so they said, Cruz, and he basically, if you look back, it's from, like, three debates ago. That he gave sort of a non-answer and which is unlike him, in all fairness, but he gave a non-answer. He didn't like that question. They came to me and I said, in front of the audience, and I didn't have it polled.","You know, I have much more money than all of them put together, including all of their PACs times 10, times 20. I don't have a pollster. I don't want a pollster. What do I need a pollster for? If the pollsters are any good they'd be doing what we're doing, right? Don't you think, right? Anyway, they spend hundreds of thousands on pollsters and you know.","So anyway, so, they came to me, they said what do you think about waterboarding? I said here's a story. Are you ready? In the Middle East and other places, but in the Middle East, they're chopping off heads. They're drowning people. They're killing people. They had -- they would kill us so quickly if they had the capability, and they're trying to get the capability, which is by the way, why we have to kill them.","Just so you understand. It's why we have to kill them. If there weren't massive weaponry available today, I would say, get the hell out, and let's rebuild our country real fast, OK? Because we've spent probably $5 trillion in the Middle East, and if you think about it, go back 15 years, we were much better off 15 years ago.","If Saddam Hussein was in charge, a bad guy. You know, they always say, he admires Saddam Hussein. I can't stand that guy. The guy was horrible, OK? Because Putin called me a genius. Putin said Donald Trump is a genius. They all said I would thank you. She said you are that's very -- but, but Putin said good things about me. He said he's the leader and there's no question about it, he's a genius.","So, they all said, the media, they said, Don, you saw it in the debate. They said you admire President Putin. I said I don't admire him. I said he was a strong leader which he is. I mean, he might be bad, he might be good, but he's a strong leader. Well, you said the Chinese, the Tiananmen Square, they were right.","I said right? No, I said they put down a riot viciously, horribly, strongly. I don't say they were right. They weren't right. These are very -- they are so dishonest. And if I didn't have as big speaker system, in terms of my mouth, but the people that listen to it, and Twitter, @realDonaldTrump, by the way.","But -- no, it's so great. This Twitter, this Twitter, Facebook is so great because when they lie on television, I type out, you know, ding, ding, ding. I'll do it myself. Ding, ding, dong, ding, ding. Press and they go like 12 seconds later, we have breaking news from Donald Trump. Here's this the -- it's the craziest thing.","I was watching CNN before, I typed out something that Kasich, without oil, would have been nothing in Ohio. And they go, boom. And they, all of a sudden, we have breaking news. I said this is the most unbelievable. You know, in the old days, in the old days, it would take me years to get the word out. Now, I just go -- so it's great stuff.","But, but I will say this, look, we have to get strong. We have to get smart. So they ask about torture. He took a pass. They asked me about torture. You remember, I said, and I started by saying they're chopping off heads because you have to do a little bit of warm-up. Because it's a tough subject. It's a lousy subject to be honest with you.","I said I am 100% fine, fine with waterboarding and it should be increased. And it should be increased. And by the way, just so you understand, they said, well, he wants to disobey the laws. And it is true, you know, we have laws. If you're too rough, figure this, we're too rough with our enemy. They've just chopped off three heads of Christians who are great people, who get -- who went over there to help people.","They get caught and not even a question of getting caught. They weren't hiding. They grab them. They chop off their heads because they're great people. They are helping people, right? And I'm saying to myself, and I have to defend this, but just so you understand. So we have laws and we have rules and regulations and rules of engagement.","They have nothing. They have nothing. Very hard to beat somebody when you have rules, regulations at a very high level. I mean, this has never happened before. So we catch one of these animals that had just chopped off 10 -- 10 heads. And we don't even know where we can try him. First of all, they're going to Guantanamo Bay, OK? Just so you understand.","We don't -- I -- We don't want them here. They're going to Guantanamo Bay and that's going to be it. But do you see the money we spend in Guantanamo? We're spending hundreds of millions of dollars a year and we have like 90 prisoners left or 60 prisoners left. Believe me, we can do better than that, folks.","There's so much fat -- there's so -- we spend hundreds of millions of dollars a year, maintaining a place for 90 people. Look, we can do much better. Our government is so fat and so disgusting. Torture. So I said, we have to, waterboarding is fine. And also, if we can go much worse than waterboarding, that's OK with me too, right?","Right? So, so they said, oh, he may not obey the laws because we're not -- you know, as of now, we're actually not allowed to waterboard. So think of this. Now, waterboarding is considered -- look, torture is terrible, OK? We all agree, right? It's horrible. But when somebody is doing what they're doing.","These horrible acts. The cutting and the drowning. We have to fight. We have to fight, like, we have to fight, right? We have no choice, right? So what happens, what happens is this. We have to expand our laws. We have to get much tougher. We want to knock them so fast and so furious, but think of this, the ISIS guys, they eat dinner like we do, right?","They eat dinner like you have dinner and we have dinner, we all have dinner, different locations, different people, we all have dinner, they have dinner. Can you imagine them sitting around and each one of them chopped off three heads today and drowned 70 people, right? And they're talking about the United States doesn't want to allow waterboarding which a lot of people don't consider torture.","They think it's less than torture but who knows? But, but think of it. So the United States. Can you imagine what these people say? Can you imagine what these people say about the United States? How weak we are? How ineffective we are? And how frankly, stupid we are? All right. Now, there's a story that I tell.","This is when we were strong. But in 1919 General Pershing, has anyone heard that story? He was there -- should I tell the story or not? Yes? Some of you have heard it. Has anybody not heard it? All right, enough. Should I tell it? It's a rough story and the media said, oh, that's a terrible story.","Well, I'm just telling the truth. And it was in the Philippines. And he's a rough guy and he's sitting on a horse, you know, on those days it was horses. It's a beautiful horse. He's a straight guy, beautiful looking guy. He's up on the horse and they were having problems with radical Islamic terrorism. Whoa, I'm so shocked.","This is 1919. Things -- some things never change, folks. Some things never change, and by the way, we have to get to the bottom of it. We cannot allow people into the country that want to destroy us. We cannot do it. We can't allow the Syrians. We can't allow the migration, the Syrians into the country. We don't know who they are, where they are, where they come from.","General Pershing, so, they were having a tremendous terror problem, OK? Tremendous. Now, the difference between then and now is the weaponry. That's the only difference. The other -- everything else is the same but the weapons are so powerful. Now, what they can take out the destruction. In those days, you didn't have that but you still had tremendous problems.","So they catch 50 terrorists, a little different than we handle them today. Today, we read them their rights. We take care of them, bop, bah. We feed them the best food. Make sure they have television. We give them areas to pray. It's a wonderful thing. We're wonderful people. We're wonderful, wonderful, stupid, stupid people, OK? So General Pershing, tough, tough guy and he had the whole deal going, and they catch 50 terrorists.","And in the Philippines and they were doing tremendous destruction. What happens is he lines them up to be shot. He lines them up. Get some -- knows they're guilty. They've admitted their guilt, lines 50 people up to be shot. And as you know, swine, pig, all of that, the big problem for them. Big problem.","He took two pigs. They chopped them open, took the bullets that were going to go and shoot these men, took the bullets, the 50 bullets, dropped them in the pigs, swished him around. So there was blood all over those bullets. Had his men, instructed his men to put the bullets into the rifles. They put the bullets into the rifles and they shot 49 men.","No, we don't like this but I'm just saying, if we're going to win, we're going to win or let's not play the game and let's not be a country anymore. Let's be blown up by everybody. They put the bullets in the rifles and they shot 49 of the 50 men, dead. Boom. So it was a pig infested bullet in each one. They then dumped the bodies into a mass grave and they dumped the pigs in with the bodies and they took the final bullet and they gave it to the one person that they decided not to shoot.","And they said, here, take this bullet go back to your people and explain what we just did, OK? But that's not the end. Here's the end. Do you want to hear the end? He went back and he said what just happened. For 28 years there was no terrorism, 28 years, OK? So, I'm not saying that's a good thing.","I'm not saying it's bad. I'm just this is history, folks. This is history. This is what is going on. This is history. We're either going to win or we're going to lose. You know, it's not going to be -- because we can't continue to go the way we're going right now. We're either going to win the battle or we're going to lose the battle.","We have to do what we have to do. We have to clean it out. These are people that have horrible thoughts. These are people that have visions that you wouldn't believe. These are people, interestingly, when I won in South Carolina, just before the vote, the pope said bad about me. I said this can only happen to me, the pope, because the Mexicans, he had just left Mexico, and he's on the plane and he said something about Donald Trump.","Now, what he said is what the Mexicans told him. Look, we have to stop illegal immigration, right? Crime. All the problems, drugs, all the problems. We're going to stop it. But they said, oh, it's terrible. What does American Trump wants to do? So, the pope came out, by the way, the next day he issued such a nice statement.","He sort of I don't know. You can't get the pope to apologize but it was sort of very nice what he did. I said I'm the only person, because I felt I could win in South Carolina, even though it was supposed to be Cruz territory, and I won in a landslide. It was like a massive landslide. And by the way, I won with women, I won with men, I won with highly educated, I won with less than highly educated, I won with soldiers, I won with vets, I won with Evangelicals big, I won with everybody.","So it was good. But, but just so you understand. Look, we have got to toughen up. Now, we don't like it. You know, even a scene like yesterday, I didn't want to put the police at any discomfort level because they would have been very uncomfortable. We had 300 police. We had, you know, the secret service guys, who were right here and they're fantastic people.","I don't want to put them, I don't want to put them to a strong test. I don't want to do that and we did the right thing. And we were given credit for doing the right thing. Interestingly, by doing what I did, that story is all over the world right now that we made the right decision under a great deal of pressure that that was a great decision.","You know, who else would make it? It would have been much easier. Go do it. Let people fight. Let people hurt themselves. I don't want to see that happen. And we were given a lot of credit. And the people that protested, actually one of them said, I think, we gave Trump an awfully good platform. They hurt themselves and they had Bill Ayres there.","They had Bill Ayers who probably wrote Obama's first book. The one that was actually well written you know. They had a lot of people there that not really, they are not really good. All right. We have to have one protester, right? So, we have one protester, looks a little wacky, he's a whack job.","We have one. Listen. So we have one protester and watch, the story tomorrow, massive protest at Trump rally. They won't talk about the crowds. They won't talk or they'll talk about massive protests because again, they are the worst. OK, so, here's the story. We are going to strengthen our country. We are going to hopefully win Ohio.","You know honestly, look, look, look, Kasich is a baby. He's a baby. He can't be President. He can't be President. Too many problems, too much on the -- let people come into our country. Approve -- just the fact that he approved NAFTA. Nobody knows that. The fact that he was with Lehman Brothers when it took down the world.","There's so many factors. He can't be President. He can't be President. It will be not a good situation. I will do such a great job. You have no idea. I will do it. And you know what else? And you know a lot of people are going to be surprised when -- I'll bring unity back. I'm going to bring jobs in communities that don't have jobs.","I'm going to bring jobs back from China. I'm going to bring jobs back from Japan. I'm going to bring our jobs back from Mexico. I'm going to bring jobs back to this country, folks. And you won't even believe it. You won't even believe it. We're going to start winning again. We are going to win again. So just a couple of things, Second Amendment, we are going to fight, and we're not going to give it up. Trade deals.","We're going to make some of the greatest deals ever made. They need us much more than we need them, folks. Remember that. And you know, they all say he can't be a true Conservative. Well, I'm the most conservative person in the world, on the military, on the vets, on education, on everything, on healthcare.","I am -- the one thing they say, but he's not a free trader. In fact, I remember Jeb Bush would get up. He is not a Conservative. And I said, and he is very low energy, OK? No, he wasn't a nice person. He was not a nice guy. Jeb was not a nice guy to me. I will tell you that. He should have been but he wasn't. But let me just tell you.","We are going to be so strong on trade. Now, these so-called conservatives, you know, these people that don't know what's happening. That's OK. Are you OK? Don't worry about it. It's easy over there. They can just put them out on the runway. They say about free trade. I am a free trader. I'm a big free trader but let me tell you, it's got to be smart trade.","China, we have a trade deficit with China this year. Listen to this, over $500 billion, over $500 billion. We can't have that. It's been going on for years, $300 billion, $400 billion. You know, it's $500 billion. And then they say, he's going to start a trade war. Well, I'm not, except for one problem. You'd be better off with a trade war than losing $500 billion.","Who the hell wants to lose $500 billion? And you know yesterday, I think in the Wall Street Journal of the times, you know, they both treat me terribly, but these are minor details. They had a big story that Trump has totally changed the thinking on trade, totally change, it's true. For 200 years, everybody talked about free trade, free trade and so do I. But you know what?","It's got to be fair trade. It's got to be smart trade. We've got to do something. We've got to get something. I have friends that are manufacturers. They cannot get their products into China. China dumps everything over here. We don't charge them tax. We don't charge anything. I have friends that are absolutely great manufacturers.","They make a better product than anything made in China. They can't get their product into China. And when they do they get charged a massive tax. But we don't do that because we don't know what's going on. Those days are over. I have Carl Icahn endorse me, the great businessman, many of the great businessmen of the world.","We're going to use our top, top chess players because that's what they are. The great people, the people that have made these, great fortune -- did great. You know there's a reason. They're great negotiators. They know what's happening. They understand it. They love it. They want to help us. They will come in. Let me tell you.","If I put Carl or some of the other great names, you know, some of them. But and frankly, some of them are better than all of them and nobody I know -- I know so many people. We have, we have the greatest negotiators in the world. We don't use them. We use political hacks to make deals with China, to make deals with Japan.","I mean, we have Caroline Kennedy representing us in Japan and she admits she got the job. How did you get it? I don't know. I don't know. And she's a lovely person. I always say I like her because Ivanka likes her, OK? I just don't want her trading on automobiles, OK? I want to get some ruthless cray. I just want to get -- I want to get one of the killers, right?","Somebody that you don't want to have dinner with. I mean, some of these guys are so bad. If you ever met them, this beautiful young woman, if she ever met him, you would get sick to your stomach. You wouldn't want to have them over for dinner. You wouldn't want to talk to them. You'd say he's a horrible, horrible human being.","He's rude. He's crude. He's vicious. You want nothing to do with him. I want him negotiating for us, folks, OK? But I have the best. I have them -- actually, some of them are very nice. Not too many of them but that's OK. But some of them are very nice but these are our greatest negotiators. We're the greatest in the world but we're losing our companies.","Pfizer is leaving, right? Pfizer. Take a look at Carrier. Now, what I would do, oh, and I get killed for this. They say, well, that's not very, you know, free. But look, Carrier had just announced so I told you. They announced they're moving into Mexico. Here's what I do. And Ford, much bigger, Ford, plan.","But I've been talking about that for a long time and now they're doubling up. They're going to build much more in Mexico. It was announced three days ago. You know why? Because nobody in our administration talks to them and say you can't do this, folks. You can't leave us like this, folks. You can't keep doing this, folks.","But I'll do it. Like, take Carrier. That's so easy. I don't want to use Carl or any of the killers. I just want to say that it's so easy. Oh, I do this stuff. I do this stuff so well. I do it so well. So here's the story. Are you're ready? And by the way, I put in some of the greatest financial statements ever seen by man into the General Elections Commission.","Everyone said he'll never give his financials. I reported to all of my financials and the reporters are saying, oh damn it, damn it, they're really good. They were hoping and a friend of mine is a very rich guy said now, I know you're rich because you would have never run if you weren't really rich. You better believe it. So anyway, no, I built a great company, very little debt, tremendous cash flow, some of the greatest assets in the world.","I mean, I own Doral. We had the big championship last week, hundreds of acres in the middle of Miami. I own all of these buildings, Trump Towers at 40 Wall Street, the Bank of America building in San Francisco, big chunks, and all these -- many tremendous assets, some of the greatest. And the reason I say that?","Very simple. Very, very simple. Because that's the kind of thinking we need in our country at least for a while. We need that thinking. So, so we're going to get the best people but here's Carrier. Are you ready? So Carrier announces, I see these 14, somebody had one of these crazy cellphones with a camera, right?","They're wonderful things because they really get you. And he's taken, you know, some management guy is saying, sorry, we're closing Carrier, after how many years? Many, many years. They did a great job. Great looking people. They're devastated. And you see it. We are closing. We're moving to Mexico. Good luck.","It wasn't even a warm speech. It was like bye-bye, we're moving to Mexico, right? I would call, and I know this isn't presidential. Ivanka would say, dad, you cannot call Carrier. It's not presidential. You know, I was like this great student. I was like this really -- I went to the best schools. My uncle was a top, top, top professor at M.I.T., a super genius with science, and I know exactly what, and I understand it might not be presidential.","Who cares? I tell her who cares? You know, when she said, dad, act presidential on the last debate. So, when they came at me a little bit, not much, they sort of used to not coming at me. You saw what happened to Marco. He went weighing down the tubes but everybody, so far, everybody that's come at me has gone down the tubes.","Is that right? Right? Wouldn't that be great for our nation? Wouldn't that be nice? I mean, think of it. I don't want to mention all the names because some of them have already called me wanting to endorse me. I've got some endorsing. Oh, that's OK. It's so late. It's so late. All right. Get him out. Get him out of here, folks.","Why is he angry? Why is he? I'm just saying we're going to make good trade deals. Why is he angry? We're going to make great trade deals. Why would anybody be upset? And what took him, what took him so long to put up his hand? We're almost finished. What took him so long?","Go back home to Mommy. Go. Go back home. Go back home to mommy. Go back home. Guy, looks like he's 15 years old. What's going on over here? What's going on? All right take him back home to mom. She'll, she'll lock him in his bedroom. So, so, folks, so folks, here's what happens. I will call up Carrier, the President.","I guess I have to do it myself. I know it's not -- Thank you for the warning. I was ready for him but it's much easier if the cops do it. Don't we agree? What a great job. What a great job. And to think I had such an easy life.","Why do I need this for, right? What do I do? Do you know why I need it? Because I've done great. I love this country. We're going to make our country great again. I owe, it's payback time. It's payback time. These guys are so fantastic. All right so let me finish. I'm going to call up Carrier and I'm going to tell the Head of Carrier.","I hope you enjoy your stay in Mexico, folks. But every single unit that you make and send across our border, which now will be real, you're going to pay a 35% tax, 35% tax. And you know what Carrier is going to do? They're going to call me in 24 hours because I'm not taken care of by the special interests.","I'm not taken care of by the donors. They're going to call me back. And they're going to go, Mr. President, we're moving back into the United States. We're going to build in the United States. That's what's going to happen, 100% sure. So let me just tell you. Let me just tell you. Are you ready? We don't win anymore but we're going to start winning.","We're going to win with our military. We're going to win with our vets. We're going to take care of our vets. And by the way, our military, and it's the least expensive thing we can do because we don't want to use it. Remember, I was against, I'm the most militaristic person here, but I was against that ridiculous war.","Our military is going to be bigger and better and stronger than ever before. And nobody is going to mess with us, folks. Nobody. Nobody. We're going to get rid of Common Core. We're bringing our education locally. We're going to repeal and replace Obamacare and we're going to win with this replacement. We're going to have such strong borders.","You're going to be so proud of them. We're going to have such strong borders. We're going to have a wall. And people are coming into our country but they're going to come in legally, legally. Now, so important is this, so important, Kasich cannot do the job. In fact, most people don't even know how to pronounce his name.","Kasich, Kasich, pretend it's a K, Kasich. He cannot do the job, folks. He's not your President. I hope you go to the polls. By the way, is there anything more fun than a Trump rally? I hope you go to the polls. You've got to go to the polls. You know, the last time I made people I said how about putting up your hand and saying I swear that I'll go. Do you want to do that?","OK, ready? I love you all by the way. I love you all. Say, I swear that on Tuesday I will go to the polls and vote for Donald Trump. Thank you. Thank you, everybody. I love Ohio. I love your people. I just love. I love Ohio. So look, here's the story. We're going to win.","We're going to win, win, win. We're going to win so much you're going to get tired of winning, maybe. But we're going to win everything. We're going to -- you are going to be so proud of your President. You are going to be so proud of your country. On Tuesday go vote. I love you all. Thank you, Ohio. Thank you, Dave. Thank you. I love you. Thank you. Thank you."],"text":" Do we love Nick? Do we love Nick? The best. He's the best. Number one. Number one in his position, by everybody, and everybody tells me. So thank you all very much. And Nick, I want to thank you very much. What a good guy, Ohio. Oh, I love Ohio. I love Ohio. You know, I worked in Ohio for summers in Cincinnati and I love Cincinnati. And I had a great experience. It was early on and it was a job and I bought it with my father. I bought it and worked out really well. I stayed here. I ran the job myself. I was very, very young and I bought it for this and I sold it for this and I look good and I felt good. It's like sinking that first putt or getting a homerun your first time at bat. So I always had a great feeling for Ohio and the people are amazing people. Thank you. I love you. Look at these people. I don't know if the media is getting this. I mean, here we have a full hangar and we thought with this. And this is a big, big hangar. This can take just about anything. And we figured the crowd would be OK. And we have so many thousands of people extra that we had to put them out in the runway, right? They never want to capture that. Just so you understand, right? They never want to. So I'd say -- it's really fantastic. Let's address -- thank you, darling. I love you too, darling. Look at that. This is amazing. So let's address yesterday should we? Yeah. So look, we had a tremendous rally in Chicago planned. We're going to have over 25,000 people. The arena was seating about 11,000. We had registered much more than 25,000. So what we did -- that's all right. That's OK. I understand. You're loyal to other places and that's OK. But what happened. It was very interesting. So what happened and these were great people. These are people like yourselves. These were people that want to Make America Great Again. That's all it is. It's very simple. And they were pouring into the arena. Good arena, everything nice, and all of a sudden, a planned attack just came out of nowhere. Printed by and it was printed by people that were professional people. If you look at the posters they're all printed. They have a mark on them, who made them, all done by a group, all very professionally done. A disgrace, if you want to know the truth. And with these thousands of people and forced out of them, no, don't go because we would have had a problem like you wouldn't have believed. Just like Big Nick over here. He would have been in there, they would have wiped him out, and that would not have been good. And we made and we made a decision. We said -- and I hated to do this because frankly, I would have been easier to go but I didn't want to see anybody get hurt. You would have had a problem, like, they haven't seen in a long time because we have people that are so amazing and it's not necessarily loyal to me. It's loyal to the country. We want to see things happen. We want to see things happen. And they're loyal to the country. It's OK. USA is right. They're loyal, they're loyal to the country. They want great security. They want great military. They want to take care of their vets. They want a border. They want a wall. They want -- We're going to build the walls, folks. Don't worry about it. Who's going to pay for the wall? Who? Do we have a good time? Do we have a good time? You know, it's sort of interesting I watched, uh, well, I shouldn't say it but I watched little Marco and I watched lying Ted Cruz, lying Ted. He holds up that Bible and then he puts it down and he lies, lying Ted. Even Rubio said, boy, he's a liar. He lies about everything. And you know, I have the Evangelical vote, and I've had great support from Jerry Falwell's Union, everybody, Sarah Palin. We've had -- we have such unbelievable support but I have the Evangelical vote and I won in South Carolina all of these. I mean, we did so well and he was supposed to win in South Carolina and I won in a landslide. And we got Evangelicals and you know why? Because they don't like liars. They don't like liars. Right? So anyway, so -- but they said just as I was coming in I'm watching and I'm watching the news and they said, well, at our rallies, we would never have anything like that. They don't have any people at their rallies, folks. There's nobody there. Nobody cares. If they had this hangar they'd have about four people in the corner over there in that little corner office. You know and they'll call it a town hall meeting. Do you ever notice? They say town hall meetings. They always say why don't you have more town hall meetings? I said because I have too many people, can't have them. So anyway, I'd actually like to have a couple of town hall meetings but I don't -- I just, you know, don't like -- we'd have to turn away how many people? Like, 24,000? We'll have 500,000 we'll turn away 24,000 people. So what happened yesterday was incredible. We dealt with law enforcement. So good. So good. We love our police. Do we love our police? But we dealt with law enforcement at every level. Secret Service, great. The whole group. And it was determined that if we go in it could cause really bad, bad vibes. And you have to understand. They want me to tell my people. Please, be nice, be nice. My people are nice. The people that came there were so nice. And let me tell you, the people that were there, that came there, that were invited there, thousands and thousands of people, they caused no problem. They were taunted. They were harassed by these other people. These other people, by the way, some represented Bernie, our communist friend. Now, really Bernie should tell his people -- there weren't too many Hillary people there. You know why? I mean, in all fairness to Bernie. The reason there weren't Hillary people, they have no fervor. There's no fervor. Say what you want about Bernie at least they have a little bit of fervor, right? But with Bernie, so, he should really get up and say to his people, stop, stop, not me. Stop. They said, Mr. Trump, should get up and this morning tell his people to be nice. My people are nice, folks. They're nice. They're great. They're great. My people are great. My people are great. So, so here's the story. So we get up and I make the decision and the people in the audience were really devastated. You know some of those people got there like you. They got there like eight hours early. Now, they're standing there for eight hours, like you, right? Like you. Raise your hand. Who -- we love you people. Don't worry, I'll sign autographs. Don't let them. Don't let them rip you away from that position. No one is -- the only one could rip you away is Nick Mangold. That's him, we can't do anything about, right? So anyway, so what happened is everybody was fine. Everybody was behaving and what they've done really, on the other side, it was moveon.org or one of these groups, bad groups these are bad people. Let me tell you, these are people that truly don't want to see our country be great again. I'm telling you. I'm telling you that and we want to get along with everybody. And we can get along with people. We're going to unify the country. Our President has divided this country so badly. He has been a -- I call him the great divider. You know, when he got elected originally, I said, you know, I don't think he's going to be a very good President. Who knows? I hope frankly, I wish he were. I wish I didn't have to do this. I wish we had the right people. I wish we didn't have to do it but we have to. We have no choice. When you look at the Iran deal. When you look at the horrible trade deals where we're losing a fortune to every country we do business with. Our jobs are being sucked away. Our jobs are being sucked away. It's unbelievable what's happening. Our military can't beat ISIS. It's being depleted. It can't beat ISIS. Our veterans are being treated horribly. Our border, our border is like a piece of Swiss cheese. The people just come pouring across. We don't have borders anymore. So let me just tell you. And on top of that, we have a divided country. We have black and white and every other thing, income groups, everybody hates everybody, even in Congress. You look at Congress. You look at Washington. Look at the politicians. The politicians hate each other. The Democrats hate the Republicans. The Liberals hate the Conservatives. We have got to change our thinking. Yeah, and if there's a group out there just throwing them the hell out that's OK. So look, we cannot let our First Amendment, we just can't. We cannot let our First Amendment rights be taken away from us, folks. We can't let it happen. We can't let it happen. We have a right to speak. I mean, we are law-abiding people. We're people that work very hard. We're people that have built this country and made this country great. And we're all together and we want to get along with everybody. But when they have organized professionally staged wiseguys. We've got to fight back. We've got to fight back. So, oh, do you have anybody? Oh, hello. Do we have anybody? You know, I love the protesters because it shows what's happening. They will not show -- the media is, by the way, the most dishonest group of people I've ever met. The worst. They are -- they'll say today, Donald Trump came to Dayton and he had a small crowd, a smattering of people came. They don't say it was so big, it was bursting out of the biggest hangar I've ever seen. Now, they'll say a small crowd or a representative crowd was there. You know that means like what 15 people? We have these crowds everywhere, folks. And let me tell you something. We have amazing people in this country. I am so impressed with the people of our country. We're going to start making Apple products in the United States, OK? Not in China. When Carrier air conditioner says they're leaving the United States, 1,400 people, because they're going to build in Mexico, and Ford is going to build in Mexico, and Nabisco is leaving Chicago because they're going to build in Mexico. Not going to happen with me. We're going to keep our businesses here. And let me just tell you, while we're on this subject, let me talk about your Governor. Do you mind for about two minutes, OK? I want to tell you because he's got -- I mean, it's a boring subject but we'll talk about him anyway. Look, he was the Managing Director of Lehman Brothers which was one of the great catastrophes in the history of this world. Lehman Brothers failed and almost brought down the world if you remember. And Kasich was a Managing Director. He was right in there dealing with all the big boys, all of the people that made these horrible decisions at Lehman. Another thing, he voted for NAFTA. You people forgot. He voted for NAFTA. Now, he was a Congressman and he voted for NAFTA. NAFTA has destroyed New England but it's destroyed it -- I mean, you have fought for years and years and years, and you'll never recover completely from it, but you will if I get elected because we're bringing those businesses back. So, so NAFTA, putting a vote up. In my opinion, anybody that puts his hand up for NAFTA, Clinton signed the bill, but NAFTA wiped out states. It wiped out entire states. It wiped out New England. It's taken years and years and years and you look at those factories and they're made into senior citizens housing and it's all wonderful. But we need jobs, folks. We need jobs. We don't have our jobs anymore. Our jobs are going to China to Japan to Mexico. Our jobs are going to Vietnam. We're losing our jobs. We're losing our base. We're losing our manufacturing. We're losing everything. We're losing at every single item no matter what. Whether it's healthcare or whether it's trade. I mean, think of it. Our military, do we have great military, right? Right? But we have a problem. We have a problem. Our military can't beat ISIS. Now, I know, we could knock them out in two days if we wanted to. But we don't have. Do you know what I call ourselves? We're the politically correct warriors, OK? We can't attack the oil because it's going to go into the environment and it's going to affect the carbon footprint. Do You believe this? And have I been saying for four years, hit the oil, hit the oil, hit the oil? Right? I've been saying it for years. And I also said, by the way, don't go into Iraq, you're going to destabilize the Middle East. I said it loud and clear. You know they try and say, oh, but years ago, let me tell you something. I said don't go into Iraq. Now, it turned out that Iraq, you know, I mean, in all fairness, they didn't have weapons of mass destruction. I'm not saying I knew that. I said for other reasons, don't go in but we have destabilized the Middle East. All of the things that you see right now that was one of the worst decisions ever made. Then you have Obama and he made it worse because of what he did. When he got out, instead of slowly getting out, and not saying when and keeping some soldiers there, look, you shouldn't have gone in. You shouldn't have gotten that with everybody. And then what he does, he announces a date. We're going to be leaving by such and such a date. And on the other side, the other side is looking at this thing, I can't believe he gave us the date. It must be some kind of a wise guy move, right? It wasn't. He moved out that date and they all just pulled back and that's what they did. Do you remember about two months ago, three months ago, he said, we're sending 50 soldiers in, right, 50. And then you say, why does he have -- why can't we be unpredictable, right, in war? Why can't -- it's like these guys. These dishonest people back there. They're always like, what would you do about ISIS? And I'm supposed to layout my plans? I never wanted to say attack the oil to them. I never wanted to say it. I wanted to knock the crap out of the oil, OK? But, but, but, I don't want to say it. I want to surprise the enemy you know. Our wonderful -- look, I want to surprise, you know, unpredictability. General Douglas MacArthur, I had great respect for MacArthur. I had great respect for General George Patton. Do you know what they're doing now? Right now they're spinning in their grave as we announce every single move. So we announced a few months ago, we're sending 50 soldiers. Now, number one, it's not even a good announcement because 50 soldiers. It sounds like that -- but these are very elite people, very talented people. They, right now, have a target on their back because of the announcement. Why don't you just send him in President and keep your mouth shut and just relax, and let them do their job, right? Let them do their job. So let me just -- let me just go over a couple of things with Kasich and we'll be done and you'll make a decision. He's not the right guy to be President. He's not tough enough. He's not sharp enough. In my opinion, he is I mean, maybe he wins Ohio and maybe he doesn't. But he's very weak on illegal immigration. He's totally in favor of amnesty which you cannot be in favor of. Look, folks, we even -- we either have a country or we don't. All right? He's very, very weak on illegal immigration. We and -- he wants amnesty and he's wanted it always. And he talks about it. Now as far as cars, as far as everything that you have right now, you're industries that haven't been taken out of Ohio. Here's what we have to do. We have to protect your coal industry which is getting decimated. And we have to protect your steel industry. Your steel industry is being decimated. It's being decimated. Now, your Governor is in favor of the Trans-Pacific Partnership which is a disaster. By the way, I'm telling you it's a disaster. And I was so strong in the debate on it and I think -- did I do well in that debate or what? Did I? You know, I actually like debating the other way better but they all came to me, they said, even my daughter Ivanka, Dad, you're the smartest one up there. But you have to act presidential. And you know, do you mind if I take off my coat? The weather's so beautiful. Do you mind? So Ivanka said, Dad, you have to act presidential. You're doing so well, but don't fall for it, when they attack you, don't fall for it. Just yet -- and I said to myself, well, here's the problem. You have little Marco saying all sorts of things which weren't true by the way, weren't true. But they're not as big as Nick I can tell you that. But bigger than most hands. In fact, I was getting ready to grab him. When he was choking, when he was choking like a dog. I was getting ready to take that hand and hold him up because I thought he was going down and I tell you with Chris Christie, who endorsed me by the way, and Ben Carson yesterday endorsed me. Right? You know it's interesting. I got a call from a couple of very, very great people, and strong Evangelicals yesterday, and they said, you know, we were teetering on you a little bit. We were sort of there but maybe we weren't going to get there. As soon as Ben Carson endorsed you, Donald, we were there. We are with you 100%. So, I want to thank, I want to thank them. But look, your coal industry, your steel industry, you know, all these industries are under siege. The EPA is -- the Environmental Protection Group. I mean, they are a disaster what they're doing. And what they're doing to Ohio, more so than most, they're a complete disaster. We're going to change things around. Now, Transpacific is going to destroy your auto industry in Ohio. They're going to do everything. They're going to take it away from you just like you're a bunch of babies. Not going to happen if I become President, OK? Not going to happen. It's a horrible, horrible trade agreement, doesn't get any worse but it's a horrible trade agreement. You have 12 countries, all of whom, want to rip our heart out. You have China which is not a part of it but wants to be a part of it at a later date. They're watching every move. The document I hear is 6,000 or 7,000 pages long. It's too complicated. It's too big. Each country knows every word of that document and our Congressmen and our Senators, Senator, our people have never even looked at it or read it. We don't even know what the hell it says. We should not do it. And the most important weapon that they have to kill our industry and to destroy us on trade is monetary manipulation, devaluation of their currencies, and they are grandmasters. The greatest of all time is China. But Mexico's getting really good at it. Japan is a total professional. Japan. What they're doing with the yen and what they're doing to us with the cars is incredible and it's got to stop. It's got to stop. You know, you go off to Los Angeles, you see those boats, the biggest ships you've ever seen, loaded up with cars from Japan. You know, NASCAR and Brian France, I guess, you probably heard from NASCAR, they endorsed Trump. Trump. Trump. And many of the drivers and many, many of the drivers. We had such great people up there, including the young, hot rookie, Chase Elliott. We know Chase and his father Bill. I mean, the whole group. It's a great group but they understand. They get it. They're really smart people. They get it. We got to keep our industry. Now, your Governor wants to do TPP. He's got to take it away, got to take it away. Regardless of what happens on Tuesday, he's got to take that support away because TPP, you -- Ohio is a target, is a target of TPP. You'll lose your auto industry entirely and you have to get it stopped. So with all of that being said, you have a Governor, that honestly, if you didn't hit oil, Ohio would be a disaster right now. You got lucky you were sitting on top of oil, folks, OK? Like Saudi Arabia got lucky. By the way, we protect Saudi Arabia before the slide they were making $1 billion a day. They pay us peanuts, OK, like we're, like we're indentured servants. They pay us peanuts. Now, they make $1 billion a day. So now, let's say they make half, the oil went down. And the problem with Ohio, by the way, now that the oil is down, you've got big problems coming because you had in the United States, the largest increase in a budget. In the United States, 35% or 36%, the budget of Ohio, and you're relying on the oil. But you can't rely on the oil now because the price is so low. So you got a lot of problems. You better be careful. I've been seeing signs. Ohio is in trouble because of the price of oil. You made a lot of money with oil. You were lucky as hell. I mean, other places are cutting, cutting, cutting, but they don't have the oil factor. But now, you don't have the oil factor so much anymore because of the price. Saudi Arabia. Saudi Arabia, if you look at all of these countries, not -- nothing richer. Nobody richer relatively than Saudi Arabia. So they make $1 billion a day. Every time there's a threat to Saudi Arabia, we turn on the ships, send over the planes, it costs you $1 million just to turn a button on some of these ships, right? To turn on the battleships, being let's start the engines, let's check them, boom, $1 million down the drain, OK? Look, we spend billions of billions of dollars protecting wealthy countries and we're not a wealthy country. We owe $19 trillion. Our country is weak. Our country is soft. We have leadership that's pathetic and it's got to change, folks. It's got to change. You know, you've probably seen, you know, this whole thing of torture. I don't want torture, I don't, nobody wants torture but we're dealing with people that are animals. We're dealing with people in the Middle East that chop off heads, that drown 50 people at a time in steel cages, heavy, heavy steel cages, and they drop them in the water, usually ocean, wherever they can find, and they drop them in the water, and they hold them for one hour, and then they pull them back up all dead, and then they put another 50 in. We're dealing with animals. And then, the question was asked, and it was tough, it was a tough ask. They went to Ted Cruz who was on my left. By the way, I've been on the center of every debate from the very beginning. Does that say -- OK? And I never did this before. I never debated before. I do get credit. They say, you know, one of the wise guys back there, said, you know, and actually, I liked him that day. He said, you know, the amazing thing about Trump? He's not a politician. He's only done this for eight months and he's killing everybody. What do you think, huh? Pretty good. I like that. I don't know. I like that because I still believe incompetence over experience, OK? And yet, I have, I have great experience. But here's the thing. Here's the thing. I've been dealing on the other side of the equation for a long time. Nobody knows politicians better than I do. Nobody knows about all of the things like PACs, which by the way, are a disaster. But like PACs and funding. I -- you know, I was -- I hate to say this. I was like sort of very, very Establishment nine months ago. I dealt from that side and then I saw how stupid everybody was, the stupid decisions, and I say, I'm going to become very anti-Establishment. And I said I'm going to run. And the Establishment said, hey, Jim, do you believe this? Trump is running. This is bad. He's self-funding his campaign. He doesn't want our money. We're not going to be able to control him. We've got to fight him. We've got to fight him. Because I know what has to be done. But just to finish on torture, OK? I love hopping around. You know, somebody -- some people said, it's like a great chess game where you go from being, being, then, you know, you're remind -- you go here but you never forget. You never forget. So we were at torture and I want to just tell you. So they asked Ted Cruz the question on waterboarding. Now, here are people that are like medieval times. I haven't heard about chopping, you know, James Foley, and that was the beginning, right? A wonderful young man, yet, so many wonderful people. A lot of Christians but Christians, everybody, anybody gets in the way, boom, chop off their head. So you got to stop that. You've got to stop it. We can't, we can't allow that. We can't allow that. We can't allow that. In our world, we cannot allow that. We shouldn't have gone there but you know what? Now, we've got to stop it, OK? And now, we've got to go in. We've got to knock the hell out of them. But, but they asked Ted Cruz, who was right here on my left, and you know, he's a nice guy, except he'd lie so much. He said, they said, they said, Senator Cruz, waterboarding. What do you think? And he goes, uh, let me go back and talk to my consultants. It's a bad question. I don't know. You know, they're all afraid of being politically correct, right? Then they go to me because he didn't give an answer. And you know, he's a great debater but he's a lousy talker. Does that make sense? He can't talk. He talks, he goes, hey, ha, who, ha, it's crazy. He's a great debater. Well, I don't know if he's a great debater. I think I beat him in all the debates. I don't know. So -- but so they said, Cruz, and he basically, if you look back, it's from, like, three debates ago. That he gave sort of a non-answer and which is unlike him, in all fairness, but he gave a non-answer. He didn't like that question. They came to me and I said, in front of the audience, and I didn't have it polled. You know, I have much more money than all of them put together, including all of their PACs times 10, times 20. I don't have a pollster. I don't want a pollster. What do I need a pollster for? If the pollsters are any good they'd be doing what we're doing, right? Don't you think, right? Anyway, they spend hundreds of thousands on pollsters and you know. So anyway, so, they came to me, they said what do you think about waterboarding? I said here's a story. Are you ready? In the Middle East and other places, but in the Middle East, they're chopping off heads. They're drowning people. They're killing people. They had -- they would kill us so quickly if they had the capability, and they're trying to get the capability, which is by the way, why we have to kill them. Just so you understand. It's why we have to kill them. If there weren't massive weaponry available today, I would say, get the hell out, and let's rebuild our country real fast, OK? Because we've spent probably $5 trillion in the Middle East, and if you think about it, go back 15 years, we were much better off 15 years ago. If Saddam Hussein was in charge, a bad guy. You know, they always say, he admires Saddam Hussein. I can't stand that guy. The guy was horrible, OK? Because Putin called me a genius. Putin said Donald Trump is a genius. They all said I would thank you. She said you are that's very -- but, but Putin said good things about me. He said he's the leader and there's no question about it, he's a genius. So, they all said, the media, they said, Don, you saw it in the debate. They said you admire President Putin. I said I don't admire him. I said he was a strong leader which he is. I mean, he might be bad, he might be good, but he's a strong leader. Well, you said the Chinese, the Tiananmen Square, they were right. I said right? No, I said they put down a riot viciously, horribly, strongly. I don't say they were right. They weren't right. These are very -- they are so dishonest. And if I didn't have as big speaker system, in terms of my mouth, but the people that listen to it, and Twitter, @realDonaldTrump, by the way. But -- no, it's so great. This Twitter, this Twitter, Facebook is so great because when they lie on television, I type out, you know, ding, ding, ding. I'll do it myself. Ding, ding, dong, ding, ding. Press and they go like 12 seconds later, we have breaking news from Donald Trump. Here's this the -- it's the craziest thing. I was watching CNN before, I typed out something that Kasich, without oil, would have been nothing in Ohio. And they go, boom. And they, all of a sudden, we have breaking news. I said this is the most unbelievable. You know, in the old days, in the old days, it would take me years to get the word out. Now, I just go -- so it's great stuff. But, but I will say this, look, we have to get strong. We have to get smart. So they ask about torture. He took a pass. They asked me about torture. You remember, I said, and I started by saying they're chopping off heads because you have to do a little bit of warm-up. Because it's a tough subject. It's a lousy subject to be honest with you. I said I am 100% fine, fine with waterboarding and it should be increased. And it should be increased. And by the way, just so you understand, they said, well, he wants to disobey the laws. And it is true, you know, we have laws. If you're too rough, figure this, we're too rough with our enemy. They've just chopped off three heads of Christians who are great people, who get -- who went over there to help people. They get caught and not even a question of getting caught. They weren't hiding. They grab them. They chop off their heads because they're great people. They are helping people, right? And I'm saying to myself, and I have to defend this, but just so you understand. So we have laws and we have rules and regulations and rules of engagement. They have nothing. They have nothing. Very hard to beat somebody when you have rules, regulations at a very high level. I mean, this has never happened before. So we catch one of these animals that had just chopped off 10 -- 10 heads. And we don't even know where we can try him. First of all, they're going to Guantanamo Bay, OK? Just so you understand. We don't -- I -- We don't want them here. They're going to Guantanamo Bay and that's going to be it. But do you see the money we spend in Guantanamo? We're spending hundreds of millions of dollars a year and we have like 90 prisoners left or 60 prisoners left. Believe me, we can do better than that, folks. There's so much fat -- there's so -- we spend hundreds of millions of dollars a year, maintaining a place for 90 people. Look, we can do much better. Our government is so fat and so disgusting. Torture. So I said, we have to, waterboarding is fine. And also, if we can go much worse than waterboarding, that's OK with me too, right? Right? So, so they said, oh, he may not obey the laws because we're not -- you know, as of now, we're actually not allowed to waterboard. So think of this. Now, waterboarding is considered -- look, torture is terrible, OK? We all agree, right? It's horrible. But when somebody is doing what they're doing. These horrible acts. The cutting and the drowning. We have to fight. We have to fight, like, we have to fight, right? We have no choice, right? So what happens, what happens is this. We have to expand our laws. We have to get much tougher. We want to knock them so fast and so furious, but think of this, the ISIS guys, they eat dinner like we do, right? They eat dinner like you have dinner and we have dinner, we all have dinner, different locations, different people, we all have dinner, they have dinner. Can you imagine them sitting around and each one of them chopped off three heads today and drowned 70 people, right? And they're talking about the United States doesn't want to allow waterboarding which a lot of people don't consider torture. They think it's less than torture but who knows? But, but think of it. So the United States. Can you imagine what these people say? Can you imagine what these people say about the United States? How weak we are? How ineffective we are? And how frankly, stupid we are? All right. Now, there's a story that I tell. This is when we were strong. But in 1919 General Pershing, has anyone heard that story? He was there -- should I tell the story or not? Yes? Some of you have heard it. Has anybody not heard it? All right, enough. Should I tell it? It's a rough story and the media said, oh, that's a terrible story. Well, I'm just telling the truth. And it was in the Philippines. And he's a rough guy and he's sitting on a horse, you know, on those days it was horses. It's a beautiful horse. He's a straight guy, beautiful looking guy. He's up on the horse and they were having problems with radical Islamic terrorism. Whoa, I'm so shocked. This is 1919. Things -- some things never change, folks. Some things never change, and by the way, we have to get to the bottom of it. We cannot allow people into the country that want to destroy us. We cannot do it. We can't allow the Syrians. We can't allow the migration, the Syrians into the country. We don't know who they are, where they are, where they come from. General Pershing, so, they were having a tremendous terror problem, OK? Tremendous. Now, the difference between then and now is the weaponry. That's the only difference. The other -- everything else is the same but the weapons are so powerful. Now, what they can take out the destruction. In those days, you didn't have that but you still had tremendous problems. So they catch 50 terrorists, a little different than we handle them today. Today, we read them their rights. We take care of them, bop, bah. We feed them the best food. Make sure they have television. We give them areas to pray. It's a wonderful thing. We're wonderful people. We're wonderful, wonderful, stupid, stupid people, OK? So General Pershing, tough, tough guy and he had the whole deal going, and they catch 50 terrorists. And in the Philippines and they were doing tremendous destruction. What happens is he lines them up to be shot. He lines them up. Get some -- knows they're guilty. They've admitted their guilt, lines 50 people up to be shot. And as you know, swine, pig, all of that, the big problem for them. Big problem. He took two pigs. They chopped them open, took the bullets that were going to go and shoot these men, took the bullets, the 50 bullets, dropped them in the pigs, swished him around. So there was blood all over those bullets. Had his men, instructed his men to put the bullets into the rifles. They put the bullets into the rifles and they shot 49 men. No, we don't like this but I'm just saying, if we're going to win, we're going to win or let's not play the game and let's not be a country anymore. Let's be blown up by everybody. They put the bullets in the rifles and they shot 49 of the 50 men, dead. Boom. So it was a pig infested bullet in each one. They then dumped the bodies into a mass grave and they dumped the pigs in with the bodies and they took the final bullet and they gave it to the one person that they decided not to shoot. And they said, here, take this bullet go back to your people and explain what we just did, OK? But that's not the end. Here's the end. Do you want to hear the end? He went back and he said what just happened. For 28 years there was no terrorism, 28 years, OK? So, I'm not saying that's a good thing. I'm not saying it's bad. I'm just this is history, folks. This is history. This is what is going on. This is history. We're either going to win or we're going to lose. You know, it's not going to be -- because we can't continue to go the way we're going right now. We're either going to win the battle or we're going to lose the battle. We have to do what we have to do. We have to clean it out. These are people that have horrible thoughts. These are people that have visions that you wouldn't believe. These are people, interestingly, when I won in South Carolina, just before the vote, the pope said bad about me. I said this can only happen to me, the pope, because the Mexicans, he had just left Mexico, and he's on the plane and he said something about Donald Trump. Now, what he said is what the Mexicans told him. Look, we have to stop illegal immigration, right? Crime. All the problems, drugs, all the problems. We're going to stop it. But they said, oh, it's terrible. What does American Trump wants to do? So, the pope came out, by the way, the next day he issued such a nice statement. He sort of I don't know. You can't get the pope to apologize but it was sort of very nice what he did. I said I'm the only person, because I felt I could win in South Carolina, even though it was supposed to be Cruz territory, and I won in a landslide. It was like a massive landslide. And by the way, I won with women, I won with men, I won with highly educated, I won with less than highly educated, I won with soldiers, I won with vets, I won with Evangelicals big, I won with everybody. So it was good. But, but just so you understand. Look, we have got to toughen up. Now, we don't like it. You know, even a scene like yesterday, I didn't want to put the police at any discomfort level because they would have been very uncomfortable. We had 300 police. We had, you know, the secret service guys, who were right here and they're fantastic people. I don't want to put them, I don't want to put them to a strong test. I don't want to do that and we did the right thing. And we were given credit for doing the right thing. Interestingly, by doing what I did, that story is all over the world right now that we made the right decision under a great deal of pressure that that was a great decision. You know, who else would make it? It would have been much easier. Go do it. Let people fight. Let people hurt themselves. I don't want to see that happen. And we were given a lot of credit. And the people that protested, actually one of them said, I think, we gave Trump an awfully good platform. They hurt themselves and they had Bill Ayres there. They had Bill Ayers who probably wrote Obama's first book. The one that was actually well written you know. They had a lot of people there that not really, they are not really good. All right. We have to have one protester, right? So, we have one protester, looks a little wacky, he's a whack job. We have one. Listen. So we have one protester and watch, the story tomorrow, massive protest at Trump rally. They won't talk about the crowds. They won't talk or they'll talk about massive protests because again, they are the worst. OK, so, here's the story. We are going to strengthen our country. We are going to hopefully win Ohio. You know honestly, look, look, look, Kasich is a baby. He's a baby. He can't be President. He can't be President. Too many problems, too much on the -- let people come into our country. Approve -- just the fact that he approved NAFTA. Nobody knows that. The fact that he was with Lehman Brothers when it took down the world. There's so many factors. He can't be President. He can't be President. It will be not a good situation. I will do such a great job. You have no idea. I will do it. And you know what else? And you know a lot of people are going to be surprised when -- I'll bring unity back. I'm going to bring jobs in communities that don't have jobs. I'm going to bring jobs back from China. I'm going to bring jobs back from Japan. I'm going to bring our jobs back from Mexico. I'm going to bring jobs back to this country, folks. And you won't even believe it. You won't even believe it. We're going to start winning again. We are going to win again. So just a couple of things, Second Amendment, we are going to fight, and we're not going to give it up. Trade deals. We're going to make some of the greatest deals ever made. They need us much more than we need them, folks. Remember that. And you know, they all say he can't be a true Conservative. Well, I'm the most conservative person in the world, on the military, on the vets, on education, on everything, on healthcare. I am -- the one thing they say, but he's not a free trader. In fact, I remember Jeb Bush would get up. He is not a Conservative. And I said, and he is very low energy, OK? No, he wasn't a nice person. He was not a nice guy. Jeb was not a nice guy to me. I will tell you that. He should have been but he wasn't. But let me just tell you. We are going to be so strong on trade. Now, these so-called conservatives, you know, these people that don't know what's happening. That's OK. Are you OK? Don't worry about it. It's easy over there. They can just put them out on the runway. They say about free trade. I am a free trader. I'm a big free trader but let me tell you, it's got to be smart trade. China, we have a trade deficit with China this year. Listen to this, over $500 billion, over $500 billion. We can't have that. It's been going on for years, $300 billion, $400 billion. You know, it's $500 billion. And then they say, he's going to start a trade war. Well, I'm not, except for one problem. You'd be better off with a trade war than losing $500 billion. Who the hell wants to lose $500 billion? And you know yesterday, I think in the Wall Street Journal of the times, you know, they both treat me terribly, but these are minor details. They had a big story that Trump has totally changed the thinking on trade, totally change, it's true. For 200 years, everybody talked about free trade, free trade and so do I. But you know what? It's got to be fair trade. It's got to be smart trade. We've got to do something. We've got to get something. I have friends that are manufacturers. They cannot get their products into China. China dumps everything over here. We don't charge them tax. We don't charge anything. I have friends that are absolutely great manufacturers. They make a better product than anything made in China. They can't get their product into China. And when they do they get charged a massive tax. But we don't do that because we don't know what's going on. Those days are over. I have Carl Icahn endorse me, the great businessman, many of the great businessmen of the world. We're going to use our top, top chess players because that's what they are. The great people, the people that have made these, great fortune -- did great. You know there's a reason. They're great negotiators. They know what's happening. They understand it. They love it. They want to help us. They will come in. Let me tell you. If I put Carl or some of the other great names, you know, some of them. But and frankly, some of them are better than all of them and nobody I know -- I know so many people. We have, we have the greatest negotiators in the world. We don't use them. We use political hacks to make deals with China, to make deals with Japan. I mean, we have Caroline Kennedy representing us in Japan and she admits she got the job. How did you get it? I don't know. I don't know. And she's a lovely person. I always say I like her because Ivanka likes her, OK? I just don't want her trading on automobiles, OK? I want to get some ruthless cray. I just want to get -- I want to get one of the killers, right? Somebody that you don't want to have dinner with. I mean, some of these guys are so bad. If you ever met them, this beautiful young woman, if she ever met him, you would get sick to your stomach. You wouldn't want to have them over for dinner. You wouldn't want to talk to them. You'd say he's a horrible, horrible human being. He's rude. He's crude. He's vicious. You want nothing to do with him. I want him negotiating for us, folks, OK? But I have the best. I have them -- actually, some of them are very nice. Not too many of them but that's OK. But some of them are very nice but these are our greatest negotiators. We're the greatest in the world but we're losing our companies. Pfizer is leaving, right? Pfizer. Take a look at Carrier. Now, what I would do, oh, and I get killed for this. They say, well, that's not very, you know, free. But look, Carrier had just announced so I told you. They announced they're moving into Mexico. Here's what I do. And Ford, much bigger, Ford, plan. But I've been talking about that for a long time and now they're doubling up. They're going to build much more in Mexico. It was announced three days ago. You know why? Because nobody in our administration talks to them and say you can't do this, folks. You can't leave us like this, folks. You can't keep doing this, folks. But I'll do it. Like, take Carrier. That's so easy. I don't want to use Carl or any of the killers. I just want to say that it's so easy. Oh, I do this stuff. I do this stuff so well. I do it so well. So here's the story. Are you're ready? And by the way, I put in some of the greatest financial statements ever seen by man into the General Elections Commission. Everyone said he'll never give his financials. I reported to all of my financials and the reporters are saying, oh damn it, damn it, they're really good. They were hoping and a friend of mine is a very rich guy said now, I know you're rich because you would have never run if you weren't really rich. You better believe it. So anyway, no, I built a great company, very little debt, tremendous cash flow, some of the greatest assets in the world. I mean, I own Doral. We had the big championship last week, hundreds of acres in the middle of Miami. I own all of these buildings, Trump Towers at 40 Wall Street, the Bank of America building in San Francisco, big chunks, and all these -- many tremendous assets, some of the greatest. And the reason I say that? Very simple. Very, very simple. Because that's the kind of thinking we need in our country at least for a while. We need that thinking. So, so we're going to get the best people but here's Carrier. Are you ready? So Carrier announces, I see these 14, somebody had one of these crazy cellphones with a camera, right? They're wonderful things because they really get you. And he's taken, you know, some management guy is saying, sorry, we're closing Carrier, after how many years? Many, many years. They did a great job. Great looking people. They're devastated. And you see it. We are closing. We're moving to Mexico. Good luck. It wasn't even a warm speech. It was like bye-bye, we're moving to Mexico, right? I would call, and I know this isn't presidential. Ivanka would say, dad, you cannot call Carrier. It's not presidential. You know, I was like this great student. I was like this really -- I went to the best schools. My uncle was a top, top, top professor at M.I.T., a super genius with science, and I know exactly what, and I understand it might not be presidential. Who cares? I tell her who cares? You know, when she said, dad, act presidential on the last debate. So, when they came at me a little bit, not much, they sort of used to not coming at me. You saw what happened to Marco. He went weighing down the tubes but everybody, so far, everybody that's come at me has gone down the tubes. Is that right? Right? Wouldn't that be great for our nation? Wouldn't that be nice? I mean, think of it. I don't want to mention all the names because some of them have already called me wanting to endorse me. I've got some endorsing. Oh, that's OK. It's so late. It's so late. All right. Get him out. Get him out of here, folks. Why is he angry? Why is he? I'm just saying we're going to make good trade deals. Why is he angry? We're going to make great trade deals. Why would anybody be upset? And what took him, what took him so long to put up his hand? We're almost finished. What took him so long? Go back home to Mommy. Go. Go back home. Go back home to mommy. Go back home. Guy, looks like he's 15 years old. What's going on over here? What's going on? All right take him back home to mom. She'll, she'll lock him in his bedroom. So, so, folks, so folks, here's what happens. I will call up Carrier, the President. I guess I have to do it myself. I know it's not -- Thank you for the warning. I was ready for him but it's much easier if the cops do it. Don't we agree? What a great job. What a great job. And to think I had such an easy life. Why do I need this for, right? What do I do? Do you know why I need it? Because I've done great. I love this country. We're going to make our country great again. I owe, it's payback time. It's payback time. These guys are so fantastic. All right so let me finish. I'm going to call up Carrier and I'm going to tell the Head of Carrier. I hope you enjoy your stay in Mexico, folks. But every single unit that you make and send across our border, which now will be real, you're going to pay a 35% tax, 35% tax. And you know what Carrier is going to do? They're going to call me in 24 hours because I'm not taken care of by the special interests. I'm not taken care of by the donors. They're going to call me back. And they're going to go, Mr. President, we're moving back into the United States. We're going to build in the United States. That's what's going to happen, 100% sure. So let me just tell you. Let me just tell you. Are you ready? We don't win anymore but we're going to start winning. We're going to win with our military. We're going to win with our vets. We're going to take care of our vets. And by the way, our military, and it's the least expensive thing we can do because we don't want to use it. Remember, I was against, I'm the most militaristic person here, but I was against that ridiculous war. Our military is going to be bigger and better and stronger than ever before. And nobody is going to mess with us, folks. Nobody. Nobody. We're going to get rid of Common Core. We're bringing our education locally. We're going to repeal and replace Obamacare and we're going to win with this replacement. We're going to have such strong borders. You're going to be so proud of them. We're going to have such strong borders. We're going to have a wall. And people are coming into our country but they're going to come in legally, legally. Now, so important is this, so important, Kasich cannot do the job. In fact, most people don't even know how to pronounce his name. Kasich, Kasich, pretend it's a K, Kasich. He cannot do the job, folks. He's not your President. I hope you go to the polls. By the way, is there anything more fun than a Trump rally? I hope you go to the polls. You've got to go to the polls. You know, the last time I made people I said how about putting up your hand and saying I swear that I'll go. Do you want to do that? OK, ready? I love you all by the way. I love you all. Say, I swear that on Tuesday I will go to the polls and vote for Donald Trump. Thank you. Thank you, everybody. I love Ohio. I love your people. I just love. I love Ohio. So look, here's the story. We're going to win. We're going to win, win, win. We're going to win so much you're going to get tired of winning, maybe. But we're going to win everything. We're going to -- you are going to be so proud of your President. You are going to be so proud of your country. On Tuesday go vote. I love you all. Thank you, Ohio. Thank you, Dave. Thank you. I love you. Thank you. Thank you."}