{"id":430,"author":"Donald Trump","title":"Speech: Donald Trump in Kansas City, MO","date":"2016-03-12","link":"https://factba.se/transcript/donald-trump-speech-kansas-city-mo-march-12-2016","paragraphs":["Thank you. Wow this is incredible. This is incredible. This whole experience has been amazing. I just want to thank everybody. We've had an interesting couple of days, I have to tell you. But the crowds -- you know, we were in Dayton just a little while ago and -- the whole thing, it's been so unbelievable.","It's been so unbelievable that the kind of crowds we've had have been -- you know, they're record setting. Wow, look at all these people. Look at all that press. Look at that. Look at that. We love you. We love you. We love you Missouri. We love you Missouri. We love you. I could do it as though I came here but then I wouldn't be legit because I know it as Missouri and we like it. So -- so thank you all.","Thank you all for being here. So we have a big big day coming up on Tuesday. And I think that it's going to be, hopefully, record setting. They're talking about what's happening all over. All over the world they're talking about it. And it's been -- it has been such an honor but they're talking about it as a movement.","We're going to take our country back. We're going to make America great again. Really are. And we're going to beat Hillary Clinton. I assume it's going to be her. We're going to beat her very bad and we haven't even started on that one yet but we're going to beat her very badly. And we've got to do it, otherwise we're all wasting time folks, OK? And we don't want to waste time.","We don't want to waste time. I will say this, look, I'm self-funding my campaign. I'm putting up my own money. You know, these other guys, they're all subject to whatever the people that put up the money, whether it's a PAC. They're all subject to these people. They put up the money. Believe me, that's the people they listen to. I call them the bosses.","They are the bosses. So, with me, you're the boss and that's the way we're going to have it. So we -- we made some stops and we made some speeches today. We had incredible crowds. We had incredible crowds. We went to Cleveland, we had 27,000 people in Cleveland. And we went to Dayton and we had 20,000. We had it in a hangar and I didn't have to get out too much.","I walked out the plane, was unbelievable. A massive hangar packed. The people came forward and something interesting happened. Did you hear about what happened? Not so good. Not so good. He just said, won't happen here. Who knows, you've got to be careful.","We need strong courts. We need strong laws. You know, we're not playing on the same field. So, should I talk about that or not? You want me to talk about what happened? See, that's the nice thing about not using teleprompters and not reading speeches, which would be so much easier.","Would be so much easier. Boy, would that be nice. You get up, you read a speech, you read a speech, you leave. 25 minutes later, next. No good right? That's no good. By doing it the way I do it -- number one there's a lot more enthusiasm. There's a lot more energy, to quote Jeb Bush. But a lot -- a lot more energy.","And you can talk about things that happened 25 minutes ago. You know, when you're writing up speeches, you can't do that. Someday I'll read speeches but I really don't like doing it as much. But I do have something I'm going to read, which I think you're going to find interesting. So I was in Dayton, it was an amazing experience.","We had great crowds. We had a great group of people -- it sounds like you have a couple of protesters back there. The hell with them. Is there? I don't know. Either they're protesters or they're great fans, right? But in Dayton, so everything's going well, the crowd was really well-behaved. Because, as you know, in Chicago we had a real problem.","Get them out of here. Get them out. Get them out. I think they're Bernie supporters. I think they're Bernie supporter. And a little bit less Hillary. You know, Hillary was saying, Donald Trump has to stop the rhetoric. He has to stop it. And my people are great.","It's these people that are the problem. So they're Bernie supporters. I'll tell you what though. The police are so great. Thank you police. We love our police. We love our police. They do such a great job. They do such a great job. So, anyway -- so yesterday, in Chicago, we -- Yah.","Hello darling. Go home to mom. Go home to mommy. Go home to Mommy. Look at those cameras, the way they bend around. They'll do anything for a shot. That's why I love the protesters. The only way we find out how many people are in these places is through the protesters. So I love our protesters.","And we don't want to hurt the protesters, please. We don't want to hurt the protesters. So here's the story. In Chicago -- in Chicago, we had an interesting day. We had 25,000 people replying. They all wanted to be there. Fortunately we could call them, we could get them. What happened is we had very professional -- very professionally organized.","The signs were made. Quiet. The signs -- the signs were professionally made. Bernie -- you'll have to check. It's probably the same location. Get them out. Get them out. Get them out.","Right. Thank you. You know, it's really amazing. You know, when you think about it, you see this, just disruptors. Bad people. So bad for our country. So bad for our country. People have no idea what's going on. So, so bad. So bad. Do we have a good time at Trump rallies?","Does this happen with anyone else? Man. Look at them. Unbelievable. Now, here's another one. Here's another beauty. Get him out. Oh, Bernie. Bernie. It's another Bernie sign. Get out of here Bernie. Get out of here Bernie. It's another Bernie sign. Get her out of here. Out. That's a Bernie supporter folks.","Got the Bernie sign. Where you put in here by Bernie? Get out. Out. Get her out. Get her out. Where are these people coming from? Unbelievable. Where are they coming from? Unbelievable. All right, thank you.","Any other protesters in the room? Any other? They'll wear out. They get tired after a while. They get tired. That was a Bernie -- she had a Bernie sign. A big professionally made Bernie sign. You know, Bernie -- Bernie, our communist friend is running. What a -- what a horrible thing. So those are Bernie signs right off the printing press.","And they put him in. He's not doing so well anyway. I guess it's going to be her. But we'll see. You go ahead take care of them. Get out of here. You know, if we do that to one of their rallies, you know what happens? Front page, how bad we are. OK? Front page. We do that to one of their rallies, to Bernie or to Hillary, and they would say, isn't that terrible?","The press, the dishonest press. They say -- they're the most dishonest people in the world. They would say, isn't that terrible. Isn't that terrible. All right, get her out of here. Get her out. You notice they're all singles. They're all singles. One here, one here. All right. Unbelievable. Exciting though, right?","Is it exciting? I mean, supposing this didn't happen, it really wouldn't be the same thing. Don't we agree? Wouldn't be quite the same. OK, let's go. Come on. Let's go. We could sit down. Look, everyone's so excited. You want to sit down? I love you people. All right. OK. Are they out?","Are they gone? Watch, after a few minutes another one will pop up. It'll be a Bernie person. Oh, would I love to run against Bernie. Do you member -- hey, wait. Do you remember when the two young women came up and took away his microphone? And he went to the back like a little -- oh, they took away my, my -- that doesn't happen to us folks.","That doesn't happen to us. So we were in Chicago yesterday and it was amazing. We had 25,000 people coming and we had disruption, they're disruptors. That's all they are, disruptors. And they really came. You had airs there. You had all sorts of people. Not a lot of people that you'd like. But you know what?","I sort of want to like everybody. But these were absolute disruptors. And rather than go through the whole process, I didn't want to see anybody get hurt. I got plenty of time. I mean, we're in no -- anybody in a rush? We're in no rush. We're in no rush.","Yeah. Get him out. Get him out. Get him out. Oh, look at those cameras. They're shooting is not nice. Get him out. Thank you. OK. Anybody else want to stand up? All right. Get him out of here. Get him out. Get him out. Boy, this place is packed. You know, we have thousands of people outside trying to get in and these people are taking their place.","It's not worth it. We have thousands trying to get in. Get them out. Any anybody else? That's lot of people up there. Thank you everybody. Thank you. Unbelievable. Unbelievable what we have to put up with. What we have to put up with. You and me and all of us. We're trying to make this country great again and it's really hard with people like this, I'll tell you.","You know, when you think about it, we want a strong military. We want protection. We want to take care of our vets. Think of it. We want to -- we want a good home. We want a great family. We want education. We want great healthcare. We want all the -- what's to argue with, right? We're looking for the same thing as them, as anybody else.","What's the point in doing what they do? They're disruptors. They're disruptors. And let me tell you, the reason they're doing it is because there's never been anything like this that's happened before. Because you know what folks? We're going to take our country back from these people. We're going to take it back.","These are bad, bad people and we're going to take our country back from these people. We are going to take our country back from those people, those people. They do nothing. They do nothing. We're going to bring it back and we're going to make America great again folks.","We're going to make it great again. And you know, they're treated very gently. Very, very gently. I told the police. I knew there was going to be problems here. They said, why don't you cancel? I said, no, we're not canceling this time. Not going to cancel this time. And I told the police, you have weak people and they're going to protest and they're going to stand up as individuals because they don't have enough to do it as a group.","And they're going to stand up. Be very gentle when you take them out. Very, very gentle, all right? And so the police are doing that. OK? Are they all out so far? Any new ones want to stand up? Anybody else want to stand up? I'll tell you what, there is nothing so interesting as a Trump rally, right? We are going to have -- And I'll stand up all night and we'll do this all night.","And you know what? It's interesting. Because we have thousands of people outside who want to come in. So I know you probably have a few more. They'll stand up in the middle of a point. They always pick the right time. Oh, here's a good point he wants to make, boom, they stand up. Almost -- we're better off if we don't say anything.","Because you hear that little weak voice up there? That's a protester. That's a protester. It's actually -- when all of the room goes, there they are. There they are. So now I have to stop. Whereas that voice, you can't even hear it. It's pathetic. OK. But yesterday in Chicago, 25,000 people coming. We were going to have 15,000 outside.","We had speakers set up, 10,000 inside, and we had disruptors I call them not protesters. I call them disruptors. They had all professionally made signs. They're holding them up. It says Bernie on them. Bernie. Good old Bernie. You know, he was a lousy senator for a long time. All of a sudden he runs. He didn't do a damn thing in the Senate.","And you have Hillary. You have some Hillary signs up. And Hillary frankly, let's face it, you look at what's going on in the primaries. You look at what -- they're down 35%. There's no excitement whatsoever. The Republicans, you know what? We are so far -- millions and millions of people are showing up at the polls to vote.","Thank you. And it's for me. It's not for -- I tell you what, it's not for little Marco and it's not for lying Ted, OK? It's not for lying -- the biggest liar. This is the biggest liar I've ever seen in my life. It's not for Marco it's not for Ted, and it's a great honor. I want to tell you, it is a great great honor, what's going on. Get him out.","Get him out. Get him out. These people. And then -- you know what? And then the audience gets rough with them and the press says, how dare they? How dare they? Try not to -- try not to get too involved up there. Don't hurt the person. Don't hurt the person. See, I'm a nonviolent person. Did you know that about me? Nonviolent.","Try not to hurt the person. Thank you. Thank you police. The police do a good job. Look at this, what they -- look at the abuse our police are taking from this person. No, look at the abuse they take. Boy, oh boy. We're gonna have to go back about 15 or 20 years, I think, folks. Because what we're doing in this country now, it's not working, I want to tell you.","Not working. It is not working. You know, just organized nonsense. It's just nonsense. You know, we have a First Amendment right. We have a freedom of speech and we're not allowed to do that because of this garbage right over here. We're not allowed to do that. But we'll do it because we all have a long time together.","That's OK. We'll do it. Okay. I'm going to defend you. Believe me, we're going to defend you. And I'll tell you, if somebody like Hillary gets in, you're not going to be defended. It's going to get worse and worse and worse. They're going to end up with four more Supreme Court judges and you'll never recover as a country in a million years.","And we have something happening with us now, millions and millions of people are going to the polls that have never gone. They're going out and voting. On the Republican side -- by the way, as I said, Democrats down 35%. Bernie doesn't inspire. It's a little group that want a free lunch. That's all it is. That's all it is. And Hillary has zero inspirational quality.","Let's face it. So they're down. Just listen to this. From four years ago, they're down 35%. We're up. I mean we have states 102% up, 75% up, 60% up. Millions of people are going and voting, ideally for me, because I've won so much. But they're voting. They're voting and they never -- some never voted before.","Many are Democrats. They came over. Many are independents and many, many, many are people that never voted before. When I sign, and I'll do that in a little while, and when I shake hands with people, people tell me -- I'm telling you, every 10th person tells me, Mr. Trump -- like a 50-year old guy, 60-year old people, a 70-year old.","Actually, my all-time was a woman, 93 years old in Tennessee. She never voted before and she's got a trump shirt on. An incredible woman. Never voted before. She's 93 years old. But we have -- we have people -- by the way, it's called a movement. In the history of the United States -- and I say it in front of these lying, thieving reporters, they're the worst.","And by the way, if I say it and it's wrong, they'll have a big headline. Trump was wrong. But they're reporting it anyway. They have to report it. At some point they report the truth. In the history of the country, there's never been anything like this folks. The Republicans were not doing exactly well.","We had stiffs like Mitt Romney running for office, who failed so damn badly. Who, by the way, that should have been an easy election. We're running against a failed President and he fails to show up. The last month, what happened to him? He failed to show up and he got creamed. He got beaten badly. Sadly, but he got beaten badly.","All right, so here's the story. We have millions of people -- Get out of here. Get out of here. Get him out. Get him out. Bye, bye. Bye, bye. Thank you. By the way, what do they do? Do they arrest these people? What happens? Do they arrest them or do they just put them outside?","I hope they arrest these people because they're really violating all of us, OK? And I hope they're arrested. I hope they're arrested because, honestly, they should be. And you don't see this stuff happening at other rallies, at -- let's say liberal, liberal rallies. You know see it happening. It doesn't happen.","You guys don't go to their -- number one, you'd get very bored very quickly, I'll tell you. All right. I hope you arrest these people because, I'll tell you, they deserve to be arrested. And some of them are very violent. But I'm going to ask that you arrest them. I'll file whatever charges you want. Who the hell knows?","You know what? If they want to do this -- I say to the rest of the room because we're going to go strongly for your arrest, and I'm going to do this from now on. Let's ruin -- the rest -- they're going to ruin the rest of their lives. If they want to do this, let them have a big arrest mark. They got arrested for whatever it is. And by the way, some of these people are swinging.","You know, we don't swing. They're swinging. Meaning, this. They're swinging. And you know what? That's not right. Not right, folks. OK? And then if you swing back it's like, oh, we were terrible. We were terrible. So I hope you arrest them and do whatever you have to do. And you know what? Once that starts happening, we're not going to have any more protesters folks.","We're not going to have any more protesters. So in Chicago we had 25,000, we had 3,000 or 4,000 protesters. They all came at the exact same time, which means it's an organized deal. And it's organized by the group that endorsed Bernie. But -- and you know, they said, oh well, no. But then they came out and they said they did it, moveon.org.","Third rate organization. They finally think they have some power. Bernie, by the way, doesn't draw nearly as well as we do folks, that I can tell you. That I can tell you. But -- so we had 25,000. I had a decision to make. Do I go and speak and watch an unbelievable riot, where a lot of people are going to get hurt and may be killed, or do I say I'm not going to do it? And I said, you know -- and I was totally safe but the people are going to be fighting, it would have been horrible.","I said, you know what? Let's not do it, and it turned out to be a great, great decision. Nobody was hurt. Listen to this. Nobody was hurt. I got great credit for good reaction under pressure, which is always nice, right? You have to react under pressure. Our President doesn't know how to react under pressure.","Our President is incompetent. He doesn't know what the hell he's doing. And then one of these people from that organization, they were on one of the stations last night. They said, I think we made a mistake. Trump got more publicity because of this than he would have ever gotten by speaking to 25,000 people.","But safety is important. So today, let me just -- so that was yesterday, Chicago. Really worked out well and a lot of -- we all got a lot of credit. And frankly, so good. People weren't -- I mean within reason, they weren't even hurt. It was amazing the way it worked out. Everybody dispersed. And then I'm watching a couple of the programs by the way.","And I'm watching shots from four hours before, like it's live. Like it's going on. Then I said, well it can't be live because they're all dispersed. I call up, they're all dispersed. Then I say, wait a minute. Wait a minute. I just saw that. 20 minutes ago. They kept rerunning it over and over and over like it's live television.","Dishonest reporting. Dishonest media. Very, very unfair. OK. So today -- today we went to Cleveland second and they were incredible. We had a tremendous 25,000, 27,000 people in this incredible, incredible place. But before Cleveland, we were in Dayton. Dayton, Ohio. And the crowd was unbelievable. In fact, really incredible.","We didn't have anything like this. We had very little disruption. It was going along, and all of a sudden the people in the front row start screaming, be careful. Watch it. Watch it. I'm speaking. I'm saying, what's this all about? I looked back and there's a guy charging the stage. And I mean charging. He put on a bull rush.","Charging the stage. And I have to tell you folks, the Secret Service was unbelievable. Unbelievable. Stand up. Look at these guys. They were unbelievable. You know, we have to give credit where credit is due. You know, the Secret Service, they got a little bad publicity. They don't deserve -- this is a great group of people.","I've gotten to know them. You know, the crowds have been so large. They said we have to have Secret Service and we -- I've gotten to know so many of them. These are incredible people, incredible individuals and they are tough. So this guy charges. The people are screaming from the front row. This guy is charging from behind.","Because we were in this hangar, it's a massive hangar. Much bigger than this. The room was full. We moved the stage way back. It kept going back and then we just put a lot of people back -- in the back of it. The place was packed. But this guy jumps over a railing that's this high -- in fact, the people that were next to him couldn't believe it. And he was clapping like this.","The whole thing. Clapping, clapping. And then all of a sudden, boom, he jumps out. And they're screaming, look out and I look out, and I see this guy charging. Now, I'm elevated but they're charging, he's charging, he's got his girlfriend in the back screaming like crazy. Screaming like a total maniac. And this guy is running and the Secret Service guys -- he just got to the stage and the Secret Service guys hit him like you wouldn't believe.","They took him out. Man. And he was a tough guy. He was a strong guy. In fact, the people couldn't believe that, from a standing jump, he was able to get over a 50-inch railing. That's a hard thing to do. So, in a certain way, I guess he was in pretty good shape, but strong. But he got over this railing and you know just phony.","Clapping, clapping, clapping. Says, you ready? Jumps over, tries to make a rush at me. Now, I was ready. I don't know if I would have done well but I would have been out there fighting folks. I don't know if I would have done well but I would have been boom, boom, boom. I'll beat that -- So you probably saw on television today, I'm turning around, I'm saying what's going on And I got it from -- and those people were so great.","The heart. You know they really -- they were scared. They look at -- watch out Mr. Trump. Watch out, watch out. And I turn around and I see this guy just totally rushing to stage and he gets to the thing. He actually had his hand on -- or a couple of hands on the stage. And I will tell you, he got -- he got taken down you would not believe it. He's got to have -- he has got to be one very sore person.","But that's not the -- that's not the terrible part. The terrible part I'm going to tell you, right. So they bring them into a court and they process him and the judge lets him go. OK. All right. Now, let me tell you. If he would have gotten on stage, it would have been a problem, to be honest. Because it would have been a problem.","Because he was looking to do harm. This wasn't a guy that was looking to, you know, have a little fun. This was a guy that was looking to do harm. So the judge let him go. And then one of my people said, wow. They found his name. And it was probably ISIS or ISIS-related. Do you believe it? And then they go online -- my people found this.","Then they go online and they find that guy is playing all sorts of very -- let's say music that you wouldn't be liking. Dragging an American flag along the sidewalk. Making all sorts of gestures. Having all sorts of things on the internet and he's probably or possibly ISIS-related. Now, let me just tell you where I have some real problems.","Number one, that should have been found out. OK? It shouldn't be found out by one of my internet people. Number two, this guy should be in jail right now. He shouldn't be out. This guy should be in jail. He should be in jail. And for a judge to let him go is incredible. But he should be in jail. Yeah, law and order.","It's called law and order. Who said that? That man. Now, you know, what you said is a terrible thing. There are a lot of people who said, law and order? That's a terrible thing to say. Law and order, you're right. You're right. So they let him go, and after they let him go, they found all this stuff about his -- his real love and where he comes from and the whole thing.","Now, who knows what's going to happen when they go back to get him? Who knows if they're ever going to find him again folks. But our courts have to get tougher and sharper and smarter or we are very, very -- we're going to be in a lot of trouble as a country. We already are. We already are. I mean, even here today, I said to the police today, look, you're going to have some protest -- because I know this.","I mean, I'm pretty good at this stuff. And I said, you're going to have some protests. And by the way, in Dayton, other than him, it was so beautiful. In Cleveland it was beautiful. It was so beautiful. The whole -- the crowd was massive. You know, this one is packed but it's a much smaller venue and that's why so many people can't get in, they're outside.","I hate to waste seats on this -- people that we take out. I hate -- I just hate to waste the seats. I hate to waste the time. But think of this, look, so you got this guy out there. He's ISIS-related. All sorts of stuff back and forth, and I'm saying to myself, who would let a guy -- what country would let a guy -- and I mean to tell you, he went through and he was a tough cookie and he came through that thing.","And if these guys were trained tough, tough, strong professionals, he would have gotten through easily. OK? He would have gotten -- they were -- they were all over him. Man, did he get taken down. He got taken down like a sack of potatoes, was wah. I mean, amazing. But honestly, the Secret Service, they were so incredible.","But now the judge lets him go and now they find out he's ISIS-related or could be ISIS-related. Certainly, he's not in love with our country, that I can tell you. OK? And we got to get tougher folks, and we got to get smarter. We have to get smarter. You know? You know, we had we had a case where -- at the last debate before this -- did I win that debate?","That last debate? I mean -- you know, my daughter said -- Ivanka and my wife Melania, they said, dad, darling -- dad, darling, don't fight back. Don't -- get the evangelicals out. Number one, I'm a good Christian. I am a good Christian. And by the way, I'm not going to allow -- that if we win -- if we win we're going to be saying Merry Christmas again when it's Christmas, OK? Because you don't say it anymore.","So during the previous debate -- Oh, you have one of these other people. Get him out of here. Go on, get out. Get out. Bing, bing. Get him out. You can see they're dying off folks. You can see. They're losing their steam. We never give up do we? We never, ever give up. We never give up. So one of the moderators asked a question to lying Ted and they said -- they said, Senator -- Senator Cruz, born in Canada, raised for four years in Canada -- a real question.","A real, real question. As to whether or not he can even run. Let's find out. But they say -- that is a real question by the way. There are a lot of people that think you have to be born on our land, OK? You can't be born in Canada, raised there for four or five years. He was a Canadian citizen until 16 months ago.","Give me a break, OK? I mean, what is this? I mean, are we supposed to have laws or are we supposed to be playing games? But anyway, let him run, he's not going to win anyway. Who cares. But look, look -- So they asked lying Ted, they said -- they didn't call him lying Ted. There's a -- Mr. Senator.","I said, lying Ted, that's a pretty bad answer. They talked about waterboarding, right? You remember. And they said, let me ask you Senator, waterboarding, are you in favor? Are you against? And you know, something to that effect. And he didn't want to answer it because you know he didn't like the question.","He doesn't want to get involved. He does -- oh, he likes it one way but he's politically correct. He wants to be careful. Got to stop with this political correctness folks, it's killing us, OK? It's killing. So what do you think Senator? And he didn't want to really answer. He gave a very bad -- you know, he's a good debater but he's a bad talker.","You understand what that means, right? Good debater but I beat him in the debates. I don't know, where is this coming? But he's a good debater, bad talker. So here's what happens. So he didn't want to answer. Then they look at me. What do you think of waterboarding Mr. Trump? Now, I didn't just say, it's good.","I said, listen, in the Middle East they're chopping off heads. In the Middle East they're drowning people in cages like animals. They're drowning people, 40, 50 people in cages. They're putting them in, dumping them for one hour pulling it up. Everyone dead. This hasn't happened since medieval times. When I'd read, I always loved history, and I'd read about different periods.","And I'm thinking medieval times, right? That's like where the chopping of the heads. And we only saw it with James Foley, this beautiful person whose parents I got to know. Incredible people. I helped them with their foundation. But these are great people. And the son was this beautiful person. And that was the first we saw of it, James Foley.","And then, it happened with others. And then you'd see 20 of them and 15 of them. And if you were Christian, you were really in trouble. So they're chopping off the heads of Christians. And I said -- and anybody else that got in their way. These are animals folks. These are animals. These aren't -- these are animals.","And I was against going into Iraq. You know, they'd say, oh well, he wasn't -- let me tell you, believe me, I was against. I was against. I was -- it was a mistake to go in. It was a tremendous mistake, the way Obama got us out. Because the way he got -- remember, I said, keep the oil. Keep the oil. You know, in the old days they had an expression, to the victor belong the spoils right, right?","Right? We were the victor. Do you call it a victor? We get nothing. You know what we get? We spend two trillion dollars on a stupid war that totally destabilized the Middle East, that Iran now takes over Iraq without firing a bullet. Forever they've been trying to take over -- they've been fighting back and forth but the militaries were even.","So they'd fight and fight for two, three years. Bombs this way, bomb -- nothing happened, they'd rest. Then they go back and fight. We decapitated one of the armies. We get decapitated one of the countries. We leave, Iran's taking it over. Second richest oil reserves in the world is Iraq. Nobody knows that.","Iran's getting that. Iran's getting one $150 billion. This crazy deal that was made by Secretary Kerry, who is horrible. Never once walked, right? Never once walked. Never once walked. So, anyway -- so I said to him, they're decapitating people. They're drowning people and they're chopping off heads. Yes, I'm in favor of waterboarding, OK? And I said, and as far as I'm concerned, you can go a lot stronger than waterboarding if you'd like.","And believe me, it works. It works. You know, I watched some of these weak Generals say, oh waterboarding sir. It works folks, OK? We got a lot of information. And not that I want it, not that I like it. I hate the concept of any kind of torture. It's horrible. But they're chopping off heads and they're drowning people by the dozens.","And what do we have? And then I fear -- then I hear that Mr. Trump said a horrible thing because he's not going by the law and the law doesn't allow because of Obama. He brought it up one step higher, doesn't allow waterboarding anymore, right? So I said, no, no. I want to obey the laws. We have to obey the laws.","But think of it folks. They chop off heads and we talk about we can't do waterboarding. And think of this, we have dinner, right? Tonight, you're going home, you're having dinner. I have dinner, you have dinner. We all have dinner. You guys up there -- boy that's a lot of people. Those are actually good seats.","They get a good view of all this stuff, right? Beautiful. But let me just tell you -- and thank you for being here. Thank you. And especially thank you to the people outside who didn't even get in. I think they have loudspeakers outside but that's not quite the same thing. They don't get to see the action, right?","So here's the story. They have dinner. We have dinner. We all have dinner. Well, ISIS, we're dealing with scum. But they have dinner. Can you imagine these guys sitting around a dinner saying that the stupid Americans aren't allowing waterboarding. Which a lot of people don't consider torture. You know, it's a question.","Who knows? It is. It isn't. They -- it's a -- it's like the mildest form. So some people think it's torture, some people don't. It's like a borderline. So they cut off heads. They chop off heads and we can't waterboard. So what we're doing is we're playing on a different field. We have rules and regulations.","They have nothing. You don't win wars like that folks. We have to increase our rules and regulations so we can play a tougher game, OK? We have to change our laws. So here's something a friend of mine, who's very rich -- and I've done it one time before I believe. But I read it. I think it's incredible.","Done by Al Wilson, years ago. And it was written -- and think in terms of terror and terrorism. We've got to stop the problem folks. We're going to build up our military and we are going to be so strong, so powerful, that nobody's going to mess with us anymore, all right? Nobody. Nobody. So here's a little poem that was written -- I guess it was put in the form of a song.","But a friend of mine who's really successful said, you got to read that again. You got to read it. You got to read it to the folks in Kansas City. You got to read it. I said, I'll do it. I'll do it. And I took it out and I might have done it once or twice. But I love it. I think it's so great. Think of this in terms of terror, and in terms of terrorists, OK? Because we negotiate, we bargain.","Sometimes you can't bargain so well. You have to show strength. You have to show strength. On her way to work one morning -- What? Is he with us or against us? Are you with us or against us? You know, sometimes somebody stands up and they're with me I think they're protesters, OK? Are you a protester?","Are you a protester? Where is this guy? I guess he's with us. OK. Ready? I hope they get put in -- I hope these guys get thrown into a jail. They'll never do it again. It'll destroy their record. They'll have to explain to mom and dad why they have a police record, and why they can't get a job. And you know what?","I'm going to start pressing charges against all these people, OK? And then we won't have a problem. And I don't want to do that. I don't want to ruin somebody's life. They're probably good kids. You know, they're probably good kids. I don't want to ruin people's lives. But the only way we're going to stop this craziness is if we press charges.","Because then their lives are going to be ruined. They're going to know their lives are going to be ruined. So I'll just tell you folks, from now on if you do anything, we're pressing charges, OK? So it's called the snake. On her way to work one morning, down the path along the lake, a tender-hearted woman saw a poor half-frozen snake.","His pretty colored skin had been all frosted with the dew. Oh well, she cried. I'll take you in and I'll take care of you. Take me in oh tender woman. Take me in for heaven's sake. Take me in oh tender woman, sighed the broken snake. She wrapped him up all cozy in a curvature of silk and then laid him by the fireside with honey and some milk.","Now she hurried home from work that night. As soon as she arrived, she found that pretty snake she'd taken and revived. Take me in oh tender woman. Take me in for heaven's sake. Take me in oh tend to a woman, sighed the broken snake. Now she clutched him to her bosom. You're so beautiful, she cried. But if I hadn't brought you in by now you might have died.","Now she's stroked his pretty skin and then she kissed him and held him tight. But instead of saying thank you, that snake gave her a vicious bite. Take me in oh tender woman. Take me in for heaven's sake. Take me in oh tender woman, sighed the broken snake. I saved you, cried the woman, and you've bit me. Heavens, why?","You know your bite is poisonous and now I'm going to die. Oh shut up silly woman, said the reptile with a grin. You knew damn well I was a snake before you took me in. Right? Right? There was no way I'm stopping for that maniac at the -- in the last sentence.","No way. So I think it's just great. It's life. You know what, it's life. And that's what we do. We're soft. We're weak. People take advantage of us. We're being taken advantage of trade -- in trade. Trade is a disaster. We're losing $500 billion a year with China. And just like on war, we're playing by different rules.","We're supposed to have free trade. I love free trade. I think free trade is great but with China we don't have free trade. We don't have free trade with anybody. We pretend it's free trade. China can sell its products, no tax, no nothing, no problems. No nothing. We can't get our products into China to sell, and when we do, they charge a big fat beautiful tax, OK? Now, Mexico is killing us at the border and they're killing us, likewise, in trade.","You have many, many -- you know, in Ohio, I was making a speech in this massive, massive ex-plant. It used to be a plant. They moved. Probably to Mexico. I didn't ask about that one. But the people that owned it said, it's so sad what's happening. Right over there is Ford. They're moving. You know they're moving?","Mexico. Right over is another company moving to Mexico. Right over there is another company moving to Mexico. You know what happened with Carrier. You know what happened with Nabisco, out of Chicago. Moving. Their big plant moving into Mexico. Pfizer's moving to Ireland. We're losing our businesses folks.","We're losing our jobs. We're losing our wealth. We're losing our country with stupid, stupid people. Stupid people are telling us what we should be doing. I don't mind free trade. I'm a free trader. I'm a very conservative person. They say, he can't be conservative, he doesn't believe in free trade. I don't believe in free trade.","I believe in really, really smart trade, where we can come out on top. That's what I believe in. All right? I mean, I'm a free trader. You have this guy -- you have this guy, Cruz. He wants to approve the Trans-Pacific Partnership. It's a disaster. It's going to be a disaster for here. It's going to be a disaster no matter where you look.","He's weak on illegal immigration. He wants amnesty. Ted Cruz is a disaster. I'll tell you what, he would be a big, big mistake, number one. Number two, he can never beat Hillary. I'm the only one going to beat Hillary, OK? Assuming she can run. Assuming she can run because after what she did, she should truly not be allowed to run.","But we'll find out about that. We'll find out about that. But when you look at trade -- so here's the story -- and I'll give it to you, and it could be for any one of them. I have the greatest business people in the world as friends and enemies, and I know them all. I don't care if they're friends or -- it makes no difference because I'm self-funding my campaign.","I don't need anybody's money. I would have more money than anybody ever -- I've had friends say, Donald, can I give you 10 million? And I said, no, I don't want it. What? They don't even understand it. That's never happened to them before. At the Mar-a-Lago Club the other night, a friend of mine comes up. Donald, I'd like to give you $10 million for your campaign.","Now, you have to understand all my life I take, right? You know, I'm a business guy. I give contributions to everybody. I take. I get greedy. Take, take. I want more, more. Now, I'm going to get greedy for the United States. I'm going to take, take. All my life. So what happens is these guys are coming up and they're asking me to take this money and I say, no, no, no. I will say this.","Look, I put my own money, I'm self-funding. But I tell you, I don't know if it's really that appreciated by the voters. I don't think anybody goes into the booth -- Did I hear a voice back there? Oh, do I hear -- somebody wants to go to prison. No. Nobody wants to go. Nobody.","You notice how quiet it is since I said that? When will we ever learn liberal press? When will we ever learn, right? When will we ever -- it's been very quiet. Anybody else want to protest? Do I hear any protesters? Any protesters? Any protesters? Now you can arrest her. Arrest her. Arrest her. So here's what's going to happen.","I'm going to tell Carrier -- my daughter would say and my wife would say, it's not presidential for you to call Carrier. And you know what I'm going to say? Who cares? I'm going to call Carrier. I'm going to say, you know what folks? Good luck in Mexico. Hope you build a nice building. Enjoy yourself. Every time you make a unit, an air conditioning unit, you bring it into the United States -- which has to go across real borders now folks -- you're going to pay a 35% tax, OK? And here's what's going to happen.","They are going to call their lobbyists but I can't be bought. Because it doesn't matter, I'm working for you folks. They're going to call their special interest group. Within 24 hours, the head of Carrier is going to call me and he's going to say, Mr. President, we have decided to stay in the United States.","Thank you sir. All right. So here's the end of the story. We don't win anymore folks. We don't win. We don't win at trade. We get killed with everybody. We have the worst trade deals. We're gonna have the best trade deals. We're going to use the smartest people. We're going to use the greatest business people in the world.","They'll do it for nothing. They want to do it so badly. We don't win at trade. Our businesses are being ripped out of our country. Our jobs and money are being ripped out of our country. We owe $19 trillion. We owe China $1.7 trillion dollars. We owe Japan. Think of this, they sell cars, we owe them money.","OK, that's a trick, right? We owe them $1.5 trillion. Here's a story. We're going to win on trade. We're going to win with our vets. We're going to take care of our veterans. We're going to take care of our veterans. We're going to rebuild our military. We're going to be so strong, so powerful, nobody's ever going to mess with us. It's the cheapest single thing we can do. Believe me. Instead of making it weak and saving, we're going to make it strong and we won't have to fight wars because nobody is going to play games with us anymore like they do now, OK? Nobody.","We're going to bring our education local. We're going to get rid of Common Core. It's a disaster. We're going to repeal and replace Obamacare. It's going to be repealed and replaced. We're going to have strong borders. We're not going to let the drugs pour in. We're not going to let people come in that are illegal.","People can come in but they have to come in legally. We're going to build a wall. We're going to build a wall. And Mexico -- as sure as you're standing here, Mexico is going to pay for the wall. We have a trade deficit with Mexico of $58 billion a year.","These two senators come up to me -- first of all, they said you'd never build a wall. Now they're all saying, oh we have to build a wall. Now they say you'll never get Mexico to pay. So look at this. You're all smart people. If we have $58 billion trade deficit with Mexico, meaning they're doing much better than we're doing -- it's just another of a horrible deals.","And if the wall is going to cost us approximately $10 billion, and I'll bring it ahead of schedule and under-budget because that's what I do, OK? So we're going to have a real wall. We're going to -- but if you have 56 and $58 billion trade deficits, and you have a $10 billion wall, guess what happens. It's real easy to get Mexico to pay for the wall.","And once I explain that to them, they still don't understand it. And it doesn't matter if they understand it because they're controlled by lobbyists and special interests. So, even if they understand it, they're not going to do it. They're not going to create bidding for the pharmaceutical companies because the pharmaceutical companies take care of all these people.","Hey, look, nobody is better than me. You know, eight months ago, I was the ultimate in the establishment. I know the system better than anybody folks. We're going to fix the system. We have a broken country. We're going to fix our country. And we're going to win again. We're going to win so much. We're going to win with our military.","We're going to knock the hell out of ISIS. We're going to win with our veterans. We're going to win at the border. We're going to win with our Second Amendment. We're not letting them chop up our Second Amendment. We're going to win with health care. Honestly folks, we're going to start winning so much.","And you are going to be so proud. Tuesday, you have to go out and vote. Because otherwise we're just all wasting our time. We had a good time and all that. But you got to go out. We have a movement going on. It's covered every -- I mean, all the time. Time magazine, I'm on the cover so much, it's covered -- and it's not me. It's you.","You're on the cover. Not me. We have a movement going on, the likes of which has never been seen in this country. And they say it. And I couldn't say it if I didn't believe it and I couldn't say it if they didn't agree. Let me tell you something. It's never been anything like this but if we don't go out on Tuesday and vote -- because we'll beat Hillary.","It's gonna be easy to beat Hillary once we start on her. But if you don't go out and vote, we've wasted our time. So just remember this, go out and vote. You're going to remember this evening. You're going to say, I remember that evening. Two years, three years, four years from now you're going to say, I remember that evening.","And because of that evening, I went out on Tuesday and I voted. And that was one of the greatest things I ever did. Because you're going to be proud of your President. And you're going to be so proud of our country. And we are going to make America great again."],"text":" Thank you. Wow this is incredible. This is incredible. This whole experience has been amazing. I just want to thank everybody. We've had an interesting couple of days, I have to tell you. But the crowds -- you know, we were in Dayton just a little while ago and -- the whole thing, it's been so unbelievable. It's been so unbelievable that the kind of crowds we've had have been -- you know, they're record setting. Wow, look at all these people. Look at all that press. Look at that. Look at that. We love you. We love you. We love you Missouri. We love you Missouri. We love you. I could do it as though I came here but then I wouldn't be legit because I know it as Missouri and we like it. So -- so thank you all. Thank you all for being here. So we have a big big day coming up on Tuesday. And I think that it's going to be, hopefully, record setting. They're talking about what's happening all over. All over the world they're talking about it. And it's been -- it has been such an honor but they're talking about it as a movement. We're going to take our country back. We're going to make America great again. Really are. And we're going to beat Hillary Clinton. I assume it's going to be her. We're going to beat her very bad and we haven't even started on that one yet but we're going to beat her very badly. And we've got to do it, otherwise we're all wasting time folks, OK? And we don't want to waste time. We don't want to waste time. I will say this, look, I'm self-funding my campaign. I'm putting up my own money. You know, these other guys, they're all subject to whatever the people that put up the money, whether it's a PAC. They're all subject to these people. They put up the money. Believe me, that's the people they listen to. I call them the bosses. They are the bosses. So, with me, you're the boss and that's the way we're going to have it. So we -- we made some stops and we made some speeches today. We had incredible crowds. We had incredible crowds. We went to Cleveland, we had 27,000 people in Cleveland. And we went to Dayton and we had 20,000. We had it in a hangar and I didn't have to get out too much. I walked out the plane, was unbelievable. A massive hangar packed. The people came forward and something interesting happened. Did you hear about what happened? Not so good. Not so good. He just said, won't happen here. Who knows, you've got to be careful. We need strong courts. We need strong laws. You know, we're not playing on the same field. So, should I talk about that or not? You want me to talk about what happened? See, that's the nice thing about not using teleprompters and not reading speeches, which would be so much easier. Would be so much easier. Boy, would that be nice. You get up, you read a speech, you read a speech, you leave. 25 minutes later, next. No good right? That's no good. By doing it the way I do it -- number one there's a lot more enthusiasm. There's a lot more energy, to quote Jeb Bush. But a lot -- a lot more energy. And you can talk about things that happened 25 minutes ago. You know, when you're writing up speeches, you can't do that. Someday I'll read speeches but I really don't like doing it as much. But I do have something I'm going to read, which I think you're going to find interesting. So I was in Dayton, it was an amazing experience. We had great crowds. We had a great group of people -- it sounds like you have a couple of protesters back there. The hell with them. Is there? I don't know. Either they're protesters or they're great fans, right? But in Dayton, so everything's going well, the crowd was really well-behaved. Because, as you know, in Chicago we had a real problem. Get them out of here. Get them out. Get them out. I think they're Bernie supporters. I think they're Bernie supporter. And a little bit less Hillary. You know, Hillary was saying, Donald Trump has to stop the rhetoric. He has to stop it. And my people are great. It's these people that are the problem. So they're Bernie supporters. I'll tell you what though. The police are so great. Thank you police. We love our police. We love our police. They do such a great job. They do such a great job. So, anyway -- so yesterday, in Chicago, we -- Yah. Hello darling. Go home to mom. Go home to mommy. Go home to Mommy. Look at those cameras, the way they bend around. They'll do anything for a shot. That's why I love the protesters. The only way we find out how many people are in these places is through the protesters. So I love our protesters. And we don't want to hurt the protesters, please. We don't want to hurt the protesters. So here's the story. In Chicago -- in Chicago, we had an interesting day. We had 25,000 people replying. They all wanted to be there. Fortunately we could call them, we could get them. What happened is we had very professional -- very professionally organized. The signs were made. Quiet. The signs -- the signs were professionally made. Bernie -- you'll have to check. It's probably the same location. Get them out. Get them out. Get them out. Right. Thank you. You know, it's really amazing. You know, when you think about it, you see this, just disruptors. Bad people. So bad for our country. So bad for our country. People have no idea what's going on. So, so bad. So bad. Do we have a good time at Trump rallies? Does this happen with anyone else? Man. Look at them. Unbelievable. Now, here's another one. Here's another beauty. Get him out. Oh, Bernie. Bernie. It's another Bernie sign. Get out of here Bernie. Get out of here Bernie. It's another Bernie sign. Get her out of here. Out. That's a Bernie supporter folks. Got the Bernie sign. Where you put in here by Bernie? Get out. Out. Get her out. Get her out. Where are these people coming from? Unbelievable. Where are they coming from? Unbelievable. All right, thank you. Any other protesters in the room? Any other? They'll wear out. They get tired after a while. They get tired. That was a Bernie -- she had a Bernie sign. A big professionally made Bernie sign. You know, Bernie -- Bernie, our communist friend is running. What a -- what a horrible thing. So those are Bernie signs right off the printing press. And they put him in. He's not doing so well anyway. I guess it's going to be her. But we'll see. You go ahead take care of them. Get out of here. You know, if we do that to one of their rallies, you know what happens? Front page, how bad we are. OK? Front page. We do that to one of their rallies, to Bernie or to Hillary, and they would say, isn't that terrible? The press, the dishonest press. They say -- they're the most dishonest people in the world. They would say, isn't that terrible. Isn't that terrible. All right, get her out of here. Get her out. You notice they're all singles. They're all singles. One here, one here. All right. Unbelievable. Exciting though, right? Is it exciting? I mean, supposing this didn't happen, it really wouldn't be the same thing. Don't we agree? Wouldn't be quite the same. OK, let's go. Come on. Let's go. We could sit down. Look, everyone's so excited. You want to sit down? I love you people. All right. OK. Are they out? Are they gone? Watch, after a few minutes another one will pop up. It'll be a Bernie person. Oh, would I love to run against Bernie. Do you member -- hey, wait. Do you remember when the two young women came up and took away his microphone? And he went to the back like a little -- oh, they took away my, my -- that doesn't happen to us folks. That doesn't happen to us. So we were in Chicago yesterday and it was amazing. We had 25,000 people coming and we had disruption, they're disruptors. That's all they are, disruptors. And they really came. You had airs there. You had all sorts of people. Not a lot of people that you'd like. But you know what? I sort of want to like everybody. But these were absolute disruptors. And rather than go through the whole process, I didn't want to see anybody get hurt. I got plenty of time. I mean, we're in no -- anybody in a rush? We're in no rush. We're in no rush. Yeah. Get him out. Get him out. Get him out. Oh, look at those cameras. They're shooting is not nice. Get him out. Thank you. OK. Anybody else want to stand up? All right. Get him out of here. Get him out. Get him out. Boy, this place is packed. You know, we have thousands of people outside trying to get in and these people are taking their place. It's not worth it. We have thousands trying to get in. Get them out. Any anybody else? That's lot of people up there. Thank you everybody. Thank you. Unbelievable. Unbelievable what we have to put up with. What we have to put up with. You and me and all of us. We're trying to make this country great again and it's really hard with people like this, I'll tell you. You know, when you think about it, we want a strong military. We want protection. We want to take care of our vets. Think of it. We want to -- we want a good home. We want a great family. We want education. We want great healthcare. We want all the -- what's to argue with, right? We're looking for the same thing as them, as anybody else. What's the point in doing what they do? They're disruptors. They're disruptors. And let me tell you, the reason they're doing it is because there's never been anything like this that's happened before. Because you know what folks? We're going to take our country back from these people. We're going to take it back. These are bad, bad people and we're going to take our country back from these people. We are going to take our country back from those people, those people. They do nothing. They do nothing. We're going to bring it back and we're going to make America great again folks. We're going to make it great again. And you know, they're treated very gently. Very, very gently. I told the police. I knew there was going to be problems here. They said, why don't you cancel? I said, no, we're not canceling this time. Not going to cancel this time. And I told the police, you have weak people and they're going to protest and they're going to stand up as individuals because they don't have enough to do it as a group. And they're going to stand up. Be very gentle when you take them out. Very, very gentle, all right? And so the police are doing that. OK? Are they all out so far? Any new ones want to stand up? Anybody else want to stand up? I'll tell you what, there is nothing so interesting as a Trump rally, right? We are going to have -- And I'll stand up all night and we'll do this all night. And you know what? It's interesting. Because we have thousands of people outside who want to come in. So I know you probably have a few more. They'll stand up in the middle of a point. They always pick the right time. Oh, here's a good point he wants to make, boom, they stand up. Almost -- we're better off if we don't say anything. Because you hear that little weak voice up there? That's a protester. That's a protester. It's actually -- when all of the room goes, there they are. There they are. So now I have to stop. Whereas that voice, you can't even hear it. It's pathetic. OK. But yesterday in Chicago, 25,000 people coming. We were going to have 15,000 outside. We had speakers set up, 10,000 inside, and we had disruptors I call them not protesters. I call them disruptors. They had all professionally made signs. They're holding them up. It says Bernie on them. Bernie. Good old Bernie. You know, he was a lousy senator for a long time. All of a sudden he runs. He didn't do a damn thing in the Senate. And you have Hillary. You have some Hillary signs up. And Hillary frankly, let's face it, you look at what's going on in the primaries. You look at what -- they're down 35%. There's no excitement whatsoever. The Republicans, you know what? We are so far -- millions and millions of people are showing up at the polls to vote. Thank you. And it's for me. It's not for -- I tell you what, it's not for little Marco and it's not for lying Ted, OK? It's not for lying -- the biggest liar. This is the biggest liar I've ever seen in my life. It's not for Marco it's not for Ted, and it's a great honor. I want to tell you, it is a great great honor, what's going on. Get him out. Get him out. Get him out. These people. And then -- you know what? And then the audience gets rough with them and the press says, how dare they? How dare they? Try not to -- try not to get too involved up there. Don't hurt the person. Don't hurt the person. See, I'm a nonviolent person. Did you know that about me? Nonviolent. Try not to hurt the person. Thank you. Thank you police. The police do a good job. Look at this, what they -- look at the abuse our police are taking from this person. No, look at the abuse they take. Boy, oh boy. We're gonna have to go back about 15 or 20 years, I think, folks. Because what we're doing in this country now, it's not working, I want to tell you. Not working. It is not working. You know, just organized nonsense. It's just nonsense. You know, we have a First Amendment right. We have a freedom of speech and we're not allowed to do that because of this garbage right over here. We're not allowed to do that. But we'll do it because we all have a long time together. That's OK. We'll do it. Okay. I'm going to defend you. Believe me, we're going to defend you. And I'll tell you, if somebody like Hillary gets in, you're not going to be defended. It's going to get worse and worse and worse. They're going to end up with four more Supreme Court judges and you'll never recover as a country in a million years. And we have something happening with us now, millions and millions of people are going to the polls that have never gone. They're going out and voting. On the Republican side -- by the way, as I said, Democrats down 35%. Bernie doesn't inspire. It's a little group that want a free lunch. That's all it is. That's all it is. And Hillary has zero inspirational quality. Let's face it. So they're down. Just listen to this. From four years ago, they're down 35%. We're up. I mean we have states 102% up, 75% up, 60% up. Millions of people are going and voting, ideally for me, because I've won so much. But they're voting. They're voting and they never -- some never voted before. Many are Democrats. They came over. Many are independents and many, many, many are people that never voted before. When I sign, and I'll do that in a little while, and when I shake hands with people, people tell me -- I'm telling you, every 10th person tells me, Mr. Trump -- like a 50-year old guy, 60-year old people, a 70-year old. Actually, my all-time was a woman, 93 years old in Tennessee. She never voted before and she's got a trump shirt on. An incredible woman. Never voted before. She's 93 years old. But we have -- we have people -- by the way, it's called a movement. In the history of the United States -- and I say it in front of these lying, thieving reporters, they're the worst. And by the way, if I say it and it's wrong, they'll have a big headline. Trump was wrong. But they're reporting it anyway. They have to report it. At some point they report the truth. In the history of the country, there's never been anything like this folks. The Republicans were not doing exactly well. We had stiffs like Mitt Romney running for office, who failed so damn badly. Who, by the way, that should have been an easy election. We're running against a failed President and he fails to show up. The last month, what happened to him? He failed to show up and he got creamed. He got beaten badly. Sadly, but he got beaten badly. All right, so here's the story. We have millions of people -- Get out of here. Get out of here. Get him out. Get him out. Bye, bye. Bye, bye. Thank you. By the way, what do they do? Do they arrest these people? What happens? Do they arrest them or do they just put them outside? I hope they arrest these people because they're really violating all of us, OK? And I hope they're arrested. I hope they're arrested because, honestly, they should be. And you don't see this stuff happening at other rallies, at -- let's say liberal, liberal rallies. You know see it happening. It doesn't happen. You guys don't go to their -- number one, you'd get very bored very quickly, I'll tell you. All right. I hope you arrest these people because, I'll tell you, they deserve to be arrested. And some of them are very violent. But I'm going to ask that you arrest them. I'll file whatever charges you want. Who the hell knows? You know what? If they want to do this -- I say to the rest of the room because we're going to go strongly for your arrest, and I'm going to do this from now on. Let's ruin -- the rest -- they're going to ruin the rest of their lives. If they want to do this, let them have a big arrest mark. They got arrested for whatever it is. And by the way, some of these people are swinging. You know, we don't swing. They're swinging. Meaning, this. They're swinging. And you know what? That's not right. Not right, folks. OK? And then if you swing back it's like, oh, we were terrible. We were terrible. So I hope you arrest them and do whatever you have to do. And you know what? Once that starts happening, we're not going to have any more protesters folks. We're not going to have any more protesters. So in Chicago we had 25,000, we had 3,000 or 4,000 protesters. They all came at the exact same time, which means it's an organized deal. And it's organized by the group that endorsed Bernie. But -- and you know, they said, oh well, no. But then they came out and they said they did it, moveon.org. Third rate organization. They finally think they have some power. Bernie, by the way, doesn't draw nearly as well as we do folks, that I can tell you. That I can tell you. But -- so we had 25,000. I had a decision to make. Do I go and speak and watch an unbelievable riot, where a lot of people are going to get hurt and may be killed, or do I say I'm not going to do it? And I said, you know -- and I was totally safe but the people are going to be fighting, it would have been horrible. I said, you know what? Let's not do it, and it turned out to be a great, great decision. Nobody was hurt. Listen to this. Nobody was hurt. I got great credit for good reaction under pressure, which is always nice, right? You have to react under pressure. Our President doesn't know how to react under pressure. Our President is incompetent. He doesn't know what the hell he's doing. And then one of these people from that organization, they were on one of the stations last night. They said, I think we made a mistake. Trump got more publicity because of this than he would have ever gotten by speaking to 25,000 people. But safety is important. So today, let me just -- so that was yesterday, Chicago. Really worked out well and a lot of -- we all got a lot of credit. And frankly, so good. People weren't -- I mean within reason, they weren't even hurt. It was amazing the way it worked out. Everybody dispersed. And then I'm watching a couple of the programs by the way. And I'm watching shots from four hours before, like it's live. Like it's going on. Then I said, well it can't be live because they're all dispersed. I call up, they're all dispersed. Then I say, wait a minute. Wait a minute. I just saw that. 20 minutes ago. They kept rerunning it over and over and over like it's live television. Dishonest reporting. Dishonest media. Very, very unfair. OK. So today -- today we went to Cleveland second and they were incredible. We had a tremendous 25,000, 27,000 people in this incredible, incredible place. But before Cleveland, we were in Dayton. Dayton, Ohio. And the crowd was unbelievable. In fact, really incredible. We didn't have anything like this. We had very little disruption. It was going along, and all of a sudden the people in the front row start screaming, be careful. Watch it. Watch it. I'm speaking. I'm saying, what's this all about? I looked back and there's a guy charging the stage. And I mean charging. He put on a bull rush. Charging the stage. And I have to tell you folks, the Secret Service was unbelievable. Unbelievable. Stand up. Look at these guys. They were unbelievable. You know, we have to give credit where credit is due. You know, the Secret Service, they got a little bad publicity. They don't deserve -- this is a great group of people. I've gotten to know them. You know, the crowds have been so large. They said we have to have Secret Service and we -- I've gotten to know so many of them. These are incredible people, incredible individuals and they are tough. So this guy charges. The people are screaming from the front row. This guy is charging from behind. Because we were in this hangar, it's a massive hangar. Much bigger than this. The room was full. We moved the stage way back. It kept going back and then we just put a lot of people back -- in the back of it. The place was packed. But this guy jumps over a railing that's this high -- in fact, the people that were next to him couldn't believe it. And he was clapping like this. The whole thing. Clapping, clapping. And then all of a sudden, boom, he jumps out. And they're screaming, look out and I look out, and I see this guy charging. Now, I'm elevated but they're charging, he's charging, he's got his girlfriend in the back screaming like crazy. Screaming like a total maniac. And this guy is running and the Secret Service guys -- he just got to the stage and the Secret Service guys hit him like you wouldn't believe. They took him out. Man. And he was a tough guy. He was a strong guy. In fact, the people couldn't believe that, from a standing jump, he was able to get over a 50-inch railing. That's a hard thing to do. So, in a certain way, I guess he was in pretty good shape, but strong. But he got over this railing and you know just phony. Clapping, clapping, clapping. Says, you ready? Jumps over, tries to make a rush at me. Now, I was ready. I don't know if I would have done well but I would have been out there fighting folks. I don't know if I would have done well but I would have been boom, boom, boom. I'll beat that -- So you probably saw on television today, I'm turning around, I'm saying what's going on And I got it from -- and those people were so great. The heart. You know they really -- they were scared. They look at -- watch out Mr. Trump. Watch out, watch out. And I turn around and I see this guy just totally rushing to stage and he gets to the thing. He actually had his hand on -- or a couple of hands on the stage. And I will tell you, he got -- he got taken down you would not believe it. He's got to have -- he has got to be one very sore person. But that's not the -- that's not the terrible part. The terrible part I'm going to tell you, right. So they bring them into a court and they process him and the judge lets him go. OK. All right. Now, let me tell you. If he would have gotten on stage, it would have been a problem, to be honest. Because it would have been a problem. Because he was looking to do harm. This wasn't a guy that was looking to, you know, have a little fun. This was a guy that was looking to do harm. So the judge let him go. And then one of my people said, wow. They found his name. And it was probably ISIS or ISIS-related. Do you believe it? And then they go online -- my people found this. Then they go online and they find that guy is playing all sorts of very -- let's say music that you wouldn't be liking. Dragging an American flag along the sidewalk. Making all sorts of gestures. Having all sorts of things on the internet and he's probably or possibly ISIS-related. Now, let me just tell you where I have some real problems. Number one, that should have been found out. OK? It shouldn't be found out by one of my internet people. Number two, this guy should be in jail right now. He shouldn't be out. This guy should be in jail. He should be in jail. And for a judge to let him go is incredible. But he should be in jail. Yeah, law and order. It's called law and order. Who said that? That man. Now, you know, what you said is a terrible thing. There are a lot of people who said, law and order? That's a terrible thing to say. Law and order, you're right. You're right. So they let him go, and after they let him go, they found all this stuff about his -- his real love and where he comes from and the whole thing. Now, who knows what's going to happen when they go back to get him? Who knows if they're ever going to find him again folks. But our courts have to get tougher and sharper and smarter or we are very, very -- we're going to be in a lot of trouble as a country. We already are. We already are. I mean, even here today, I said to the police today, look, you're going to have some protest -- because I know this. I mean, I'm pretty good at this stuff. And I said, you're going to have some protests. And by the way, in Dayton, other than him, it was so beautiful. In Cleveland it was beautiful. It was so beautiful. The whole -- the crowd was massive. You know, this one is packed but it's a much smaller venue and that's why so many people can't get in, they're outside. I hate to waste seats on this -- people that we take out. I hate -- I just hate to waste the seats. I hate to waste the time. But think of this, look, so you got this guy out there. He's ISIS-related. All sorts of stuff back and forth, and I'm saying to myself, who would let a guy -- what country would let a guy -- and I mean to tell you, he went through and he was a tough cookie and he came through that thing. And if these guys were trained tough, tough, strong professionals, he would have gotten through easily. OK? He would have gotten -- they were -- they were all over him. Man, did he get taken down. He got taken down like a sack of potatoes, was wah. I mean, amazing. But honestly, the Secret Service, they were so incredible. But now the judge lets him go and now they find out he's ISIS-related or could be ISIS-related. Certainly, he's not in love with our country, that I can tell you. OK? And we got to get tougher folks, and we got to get smarter. We have to get smarter. You know? You know, we had we had a case where -- at the last debate before this -- did I win that debate? That last debate? I mean -- you know, my daughter said -- Ivanka and my wife Melania, they said, dad, darling -- dad, darling, don't fight back. Don't -- get the evangelicals out. Number one, I'm a good Christian. I am a good Christian. And by the way, I'm not going to allow -- that if we win -- if we win we're going to be saying Merry Christmas again when it's Christmas, OK? Because you don't say it anymore. So during the previous debate -- Oh, you have one of these other people. Get him out of here. Go on, get out. Get out. Bing, bing. Get him out. You can see they're dying off folks. You can see. They're losing their steam. We never give up do we? We never, ever give up. We never give up. So one of the moderators asked a question to lying Ted and they said -- they said, Senator -- Senator Cruz, born in Canada, raised for four years in Canada -- a real question. A real, real question. As to whether or not he can even run. Let's find out. But they say -- that is a real question by the way. There are a lot of people that think you have to be born on our land, OK? You can't be born in Canada, raised there for four or five years. He was a Canadian citizen until 16 months ago. Give me a break, OK? I mean, what is this? I mean, are we supposed to have laws or are we supposed to be playing games? But anyway, let him run, he's not going to win anyway. Who cares. But look, look -- So they asked lying Ted, they said -- they didn't call him lying Ted. There's a -- Mr. Senator. I said, lying Ted, that's a pretty bad answer. They talked about waterboarding, right? You remember. And they said, let me ask you Senator, waterboarding, are you in favor? Are you against? And you know, something to that effect. And he didn't want to answer it because you know he didn't like the question. He doesn't want to get involved. He does -- oh, he likes it one way but he's politically correct. He wants to be careful. Got to stop with this political correctness folks, it's killing us, OK? It's killing. So what do you think Senator? And he didn't want to really answer. He gave a very bad -- you know, he's a good debater but he's a bad talker. You understand what that means, right? Good debater but I beat him in the debates. I don't know, where is this coming? But he's a good debater, bad talker. So here's what happens. So he didn't want to answer. Then they look at me. What do you think of waterboarding Mr. Trump? Now, I didn't just say, it's good. I said, listen, in the Middle East they're chopping off heads. In the Middle East they're drowning people in cages like animals. They're drowning people, 40, 50 people in cages. They're putting them in, dumping them for one hour pulling it up. Everyone dead. This hasn't happened since medieval times. When I'd read, I always loved history, and I'd read about different periods. And I'm thinking medieval times, right? That's like where the chopping of the heads. And we only saw it with James Foley, this beautiful person whose parents I got to know. Incredible people. I helped them with their foundation. But these are great people. And the son was this beautiful person. And that was the first we saw of it, James Foley. And then, it happened with others. And then you'd see 20 of them and 15 of them. And if you were Christian, you were really in trouble. So they're chopping off the heads of Christians. And I said -- and anybody else that got in their way. These are animals folks. These are animals. These aren't -- these are animals. And I was against going into Iraq. You know, they'd say, oh well, he wasn't -- let me tell you, believe me, I was against. I was against. I was -- it was a mistake to go in. It was a tremendous mistake, the way Obama got us out. Because the way he got -- remember, I said, keep the oil. Keep the oil. You know, in the old days they had an expression, to the victor belong the spoils right, right? Right? We were the victor. Do you call it a victor? We get nothing. You know what we get? We spend two trillion dollars on a stupid war that totally destabilized the Middle East, that Iran now takes over Iraq without firing a bullet. Forever they've been trying to take over -- they've been fighting back and forth but the militaries were even. So they'd fight and fight for two, three years. Bombs this way, bomb -- nothing happened, they'd rest. Then they go back and fight. We decapitated one of the armies. We get decapitated one of the countries. We leave, Iran's taking it over. Second richest oil reserves in the world is Iraq. Nobody knows that. Iran's getting that. Iran's getting one $150 billion. This crazy deal that was made by Secretary Kerry, who is horrible. Never once walked, right? Never once walked. Never once walked. So, anyway -- so I said to him, they're decapitating people. They're drowning people and they're chopping off heads. Yes, I'm in favor of waterboarding, OK? And I said, and as far as I'm concerned, you can go a lot stronger than waterboarding if you'd like. And believe me, it works. It works. You know, I watched some of these weak Generals say, oh waterboarding sir. It works folks, OK? We got a lot of information. And not that I want it, not that I like it. I hate the concept of any kind of torture. It's horrible. But they're chopping off heads and they're drowning people by the dozens. And what do we have? And then I fear -- then I hear that Mr. Trump said a horrible thing because he's not going by the law and the law doesn't allow because of Obama. He brought it up one step higher, doesn't allow waterboarding anymore, right? So I said, no, no. I want to obey the laws. We have to obey the laws. But think of it folks. They chop off heads and we talk about we can't do waterboarding. And think of this, we have dinner, right? Tonight, you're going home, you're having dinner. I have dinner, you have dinner. We all have dinner. You guys up there -- boy that's a lot of people. Those are actually good seats. They get a good view of all this stuff, right? Beautiful. But let me just tell you -- and thank you for being here. Thank you. And especially thank you to the people outside who didn't even get in. I think they have loudspeakers outside but that's not quite the same thing. They don't get to see the action, right? So here's the story. They have dinner. We have dinner. We all have dinner. Well, ISIS, we're dealing with scum. But they have dinner. Can you imagine these guys sitting around a dinner saying that the stupid Americans aren't allowing waterboarding. Which a lot of people don't consider torture. You know, it's a question. Who knows? It is. It isn't. They -- it's a -- it's like the mildest form. So some people think it's torture, some people don't. It's like a borderline. So they cut off heads. They chop off heads and we can't waterboard. So what we're doing is we're playing on a different field. We have rules and regulations. They have nothing. You don't win wars like that folks. We have to increase our rules and regulations so we can play a tougher game, OK? We have to change our laws. So here's something a friend of mine, who's very rich -- and I've done it one time before I believe. But I read it. I think it's incredible. Done by Al Wilson, years ago. And it was written -- and think in terms of terror and terrorism. We've got to stop the problem folks. We're going to build up our military and we are going to be so strong, so powerful, that nobody's going to mess with us anymore, all right? Nobody. Nobody. So here's a little poem that was written -- I guess it was put in the form of a song. But a friend of mine who's really successful said, you got to read that again. You got to read it. You got to read it to the folks in Kansas City. You got to read it. I said, I'll do it. I'll do it. And I took it out and I might have done it once or twice. But I love it. I think it's so great. Think of this in terms of terror, and in terms of terrorists, OK? Because we negotiate, we bargain. Sometimes you can't bargain so well. You have to show strength. You have to show strength. On her way to work one morning -- What? Is he with us or against us? Are you with us or against us? You know, sometimes somebody stands up and they're with me I think they're protesters, OK? Are you a protester? Are you a protester? Where is this guy? I guess he's with us. OK. Ready? I hope they get put in -- I hope these guys get thrown into a jail. They'll never do it again. It'll destroy their record. They'll have to explain to mom and dad why they have a police record, and why they can't get a job. And you know what? I'm going to start pressing charges against all these people, OK? And then we won't have a problem. And I don't want to do that. I don't want to ruin somebody's life. They're probably good kids. You know, they're probably good kids. I don't want to ruin people's lives. But the only way we're going to stop this craziness is if we press charges. Because then their lives are going to be ruined. They're going to know their lives are going to be ruined. So I'll just tell you folks, from now on if you do anything, we're pressing charges, OK? So it's called the snake. On her way to work one morning, down the path along the lake, a tender-hearted woman saw a poor half-frozen snake. His pretty colored skin had been all frosted with the dew. Oh well, she cried. I'll take you in and I'll take care of you. Take me in oh tender woman. Take me in for heaven's sake. Take me in oh tender woman, sighed the broken snake. She wrapped him up all cozy in a curvature of silk and then laid him by the fireside with honey and some milk. Now she hurried home from work that night. As soon as she arrived, she found that pretty snake she'd taken and revived. Take me in oh tender woman. Take me in for heaven's sake. Take me in oh tend to a woman, sighed the broken snake. Now she clutched him to her bosom. You're so beautiful, she cried. But if I hadn't brought you in by now you might have died. Now she's stroked his pretty skin and then she kissed him and held him tight. But instead of saying thank you, that snake gave her a vicious bite. Take me in oh tender woman. Take me in for heaven's sake. Take me in oh tender woman, sighed the broken snake. I saved you, cried the woman, and you've bit me. Heavens, why? You know your bite is poisonous and now I'm going to die. Oh shut up silly woman, said the reptile with a grin. You knew damn well I was a snake before you took me in. Right? Right? There was no way I'm stopping for that maniac at the -- in the last sentence. No way. So I think it's just great. It's life. You know what, it's life. And that's what we do. We're soft. We're weak. People take advantage of us. We're being taken advantage of trade -- in trade. Trade is a disaster. We're losing $500 billion a year with China. And just like on war, we're playing by different rules. We're supposed to have free trade. I love free trade. I think free trade is great but with China we don't have free trade. We don't have free trade with anybody. We pretend it's free trade. China can sell its products, no tax, no nothing, no problems. No nothing. We can't get our products into China to sell, and when we do, they charge a big fat beautiful tax, OK? Now, Mexico is killing us at the border and they're killing us, likewise, in trade. You have many, many -- you know, in Ohio, I was making a speech in this massive, massive ex-plant. It used to be a plant. They moved. Probably to Mexico. I didn't ask about that one. But the people that owned it said, it's so sad what's happening. Right over there is Ford. They're moving. You know they're moving? Mexico. Right over is another company moving to Mexico. Right over there is another company moving to Mexico. You know what happened with Carrier. You know what happened with Nabisco, out of Chicago. Moving. Their big plant moving into Mexico. Pfizer's moving to Ireland. We're losing our businesses folks. We're losing our jobs. We're losing our wealth. We're losing our country with stupid, stupid people. Stupid people are telling us what we should be doing. I don't mind free trade. I'm a free trader. I'm a very conservative person. They say, he can't be conservative, he doesn't believe in free trade. I don't believe in free trade. I believe in really, really smart trade, where we can come out on top. That's what I believe in. All right? I mean, I'm a free trader. You have this guy -- you have this guy, Cruz. He wants to approve the Trans-Pacific Partnership. It's a disaster. It's going to be a disaster for here. It's going to be a disaster no matter where you look. He's weak on illegal immigration. He wants amnesty. Ted Cruz is a disaster. I'll tell you what, he would be a big, big mistake, number one. Number two, he can never beat Hillary. I'm the only one going to beat Hillary, OK? Assuming she can run. Assuming she can run because after what she did, she should truly not be allowed to run. But we'll find out about that. We'll find out about that. But when you look at trade -- so here's the story -- and I'll give it to you, and it could be for any one of them. I have the greatest business people in the world as friends and enemies, and I know them all. I don't care if they're friends or -- it makes no difference because I'm self-funding my campaign. I don't need anybody's money. I would have more money than anybody ever -- I've had friends say, Donald, can I give you 10 million? And I said, no, I don't want it. What? They don't even understand it. That's never happened to them before. At the Mar-a-Lago Club the other night, a friend of mine comes up. Donald, I'd like to give you $10 million for your campaign. Now, you have to understand all my life I take, right? You know, I'm a business guy. I give contributions to everybody. I take. I get greedy. Take, take. I want more, more. Now, I'm going to get greedy for the United States. I'm going to take, take. All my life. So what happens is these guys are coming up and they're asking me to take this money and I say, no, no, no. I will say this. Look, I put my own money, I'm self-funding. But I tell you, I don't know if it's really that appreciated by the voters. I don't think anybody goes into the booth -- Did I hear a voice back there? Oh, do I hear -- somebody wants to go to prison. No. Nobody wants to go. Nobody. You notice how quiet it is since I said that? When will we ever learn liberal press? When will we ever learn, right? When will we ever -- it's been very quiet. Anybody else want to protest? Do I hear any protesters? Any protesters? Any protesters? Now you can arrest her. Arrest her. Arrest her. So here's what's going to happen. I'm going to tell Carrier -- my daughter would say and my wife would say, it's not presidential for you to call Carrier. And you know what I'm going to say? Who cares? I'm going to call Carrier. I'm going to say, you know what folks? Good luck in Mexico. Hope you build a nice building. Enjoy yourself. Every time you make a unit, an air conditioning unit, you bring it into the United States -- which has to go across real borders now folks -- you're going to pay a 35% tax, OK? And here's what's going to happen. They are going to call their lobbyists but I can't be bought. Because it doesn't matter, I'm working for you folks. They're going to call their special interest group. Within 24 hours, the head of Carrier is going to call me and he's going to say, Mr. President, we have decided to stay in the United States. Thank you sir. All right. So here's the end of the story. We don't win anymore folks. We don't win. We don't win at trade. We get killed with everybody. We have the worst trade deals. We're gonna have the best trade deals. We're going to use the smartest people. We're going to use the greatest business people in the world. They'll do it for nothing. They want to do it so badly. We don't win at trade. Our businesses are being ripped out of our country. Our jobs and money are being ripped out of our country. We owe $19 trillion. We owe China $1.7 trillion dollars. We owe Japan. Think of this, they sell cars, we owe them money. OK, that's a trick, right? We owe them $1.5 trillion. Here's a story. We're going to win on trade. We're going to win with our vets. We're going to take care of our veterans. We're going to take care of our veterans. We're going to rebuild our military. We're going to be so strong, so powerful, nobody's ever going to mess with us. It's the cheapest single thing we can do. Believe me. Instead of making it weak and saving, we're going to make it strong and we won't have to fight wars because nobody is going to play games with us anymore like they do now, OK? Nobody. We're going to bring our education local. We're going to get rid of Common Core. It's a disaster. We're going to repeal and replace Obamacare. It's going to be repealed and replaced. We're going to have strong borders. We're not going to let the drugs pour in. We're not going to let people come in that are illegal. People can come in but they have to come in legally. We're going to build a wall. We're going to build a wall. And Mexico -- as sure as you're standing here, Mexico is going to pay for the wall. We have a trade deficit with Mexico of $58 billion a year. These two senators come up to me -- first of all, they said you'd never build a wall. Now they're all saying, oh we have to build a wall. Now they say you'll never get Mexico to pay. So look at this. You're all smart people. If we have $58 billion trade deficit with Mexico, meaning they're doing much better than we're doing -- it's just another of a horrible deals. And if the wall is going to cost us approximately $10 billion, and I'll bring it ahead of schedule and under-budget because that's what I do, OK? So we're going to have a real wall. We're going to -- but if you have 56 and $58 billion trade deficits, and you have a $10 billion wall, guess what happens. It's real easy to get Mexico to pay for the wall. And once I explain that to them, they still don't understand it. And it doesn't matter if they understand it because they're controlled by lobbyists and special interests. So, even if they understand it, they're not going to do it. They're not going to create bidding for the pharmaceutical companies because the pharmaceutical companies take care of all these people. Hey, look, nobody is better than me. You know, eight months ago, I was the ultimate in the establishment. I know the system better than anybody folks. We're going to fix the system. We have a broken country. We're going to fix our country. And we're going to win again. We're going to win so much. We're going to win with our military. We're going to knock the hell out of ISIS. We're going to win with our veterans. We're going to win at the border. We're going to win with our Second Amendment. We're not letting them chop up our Second Amendment. We're going to win with health care. Honestly folks, we're going to start winning so much. And you are going to be so proud. Tuesday, you have to go out and vote. Because otherwise we're just all wasting our time. We had a good time and all that. But you got to go out. We have a movement going on. It's covered every -- I mean, all the time. Time magazine, I'm on the cover so much, it's covered -- and it's not me. It's you. You're on the cover. Not me. We have a movement going on, the likes of which has never been seen in this country. And they say it. And I couldn't say it if I didn't believe it and I couldn't say it if they didn't agree. Let me tell you something. It's never been anything like this but if we don't go out on Tuesday and vote -- because we'll beat Hillary. It's gonna be easy to beat Hillary once we start on her. But if you don't go out and vote, we've wasted our time. So just remember this, go out and vote. You're going to remember this evening. You're going to say, I remember that evening. Two years, three years, four years from now you're going to say, I remember that evening. And because of that evening, I went out on Tuesday and I voted. And that was one of the greatest things I ever did. Because you're going to be proud of your President. And you're going to be so proud of our country. And we are going to make America great again."}