{"id":431,"author":"Donald Trump","title":"Speech: Donald Trump in Concord, NC","date":"2016-03-07","link":"https://factba.se/transcript/donald-trump-speech-concord-nc-march-7-2016","paragraphs":["Boy on a Monday morning. Can you believe this, right? This is amazing. This is amazing. Well, I want to thank you. It's a great place. You know I have a lot of property here I love North Carolina. And over by Lake Norman. Anybody ever hear of Lake Norman? So you know what I have then, it's great. It's great.","Great place. That's right. That's exactly right. You know. So it's always nice. I don't think too many of the other candidates employ a lot of people here, right? Just Trump. Just Trump. So I want to thank you all. You know I just had a visitor backstage, NASCAR endorsed Trump. Can you believe that? And we love Brian France and the whole group and NASCAR and we had Bill Elliott and Chase Elliott, the hot, young driver and we have right here.","Come here, Mark. Mark Martin, everybody. Come here.","Thank you, Martin. Oh, he has guts. Do those guys have guts? I tried it once you know. I couldn't get that -- I just couldn't press down on that accelerator very far. I might have gone up to about 85. That's about all. It takes -- you know it's a special talent. It's a special -- it's a special kind of courage.","Like everything else you need a special to -- world I guess of specialization to an extent. But Mark, I want to thank you very much, really an honor. And I have to tell you and I want to thank NASCAR and you know Brian France was with us last week at a venue and he got up on behalf of NASCAR. And Brian's an amazing guy.","He's done some job. I'll tell you that. And for them to endorse me was really a very great honor. Thank you very much. So a lot of things have been happening. And a lot of polls have come out and the latest one, national polls, CNN, Trump 49, little Marco Rubio you know. He's a -- he's a no show in the US Senate.","He never goes to vote. I'll tell you what. That guy he couldn't be elected dogcatcher in Florida. The people in Florida. I mean --","-- of Cruz at 15, you have Kasich like at six, and I just want to tell you that's pretty good stuff, right? You know one of the polls came out isn't that a beautiful, sight? Beautiful. I love it. Well, I only use like the ones where we're doing well but we're doing well in most of them so. One of them, the polls just came out and a number of them have just come out.","One of the polls -- you know I only use like the ones where we're doing well but we're doing well in most of them so. One of the polls just came out and a number of polls have just come out. I'm beating Hillary Clinton quite easily, thank you. And honestly, we really haven't even started on her. We only had one little skirmish about a month ago.","You remember that little skirmish, right? So -- I tell you what. Yeah, put her in jail. Who said that? Who said -- I -- and he means it. So we've been going around and it's been amazing. We won New Hampshire. We won South Carolina. Oh, South Carolina. We love South Carolina, right?","We love South Carolina. We won Nevada, Georgia, Tennessee, Alabama, Vermont, Arkansas, Massachusetts. We're going to have I think a couple of good ones tomorrow I hope. Let's see what happens. But we have some good ones. Michigan is going to be -- look I've been fighting hard for cars. Cars are going to be made in our country.","They're going to be made in our country. And we really have been, I mean, we've been fighting very, very hard for that industry. I've been to Michigan a lot and I think we're going to do well there and we have Idaho. We love Idaho potatoes, right? Who doesn't have potatoes from Idaho? And we have Mississippi which I'm there a lot actually and what a great -- do we love Mississippi, yes, right?","So we have in -- we have Hawaii. I have a big hotel in Hawaii. We employ a lot of people in Hawaii. It's beautiful. So we have a lot of things coming up and then the following week we go with Florida. And we go with Ohio and some others. It's going to be. It's going to be -- well, let me ask you most importantly.","Who's going to win North Carolina? Right? I think so. I think we're going to do great here. I mean, I think we're going to do good. Should we do the pledge? Should we do the pledge? Raise your hand. I swear I'm going to vote for Donald Trump next week. I swear, right? Good. Oh, wow. Just with the people here I think we'll win, right?","So I want to just thank you all. I mean, really to be here on a Monday like this, Monday morning. This is incredible. But I'll tell you what. I'll tell you what. Our country and somebody just shouted out about jobs and they shouted it out to Mark. Thank you very much. Oh, we have a protester. We have a protester.","We have -- out, out, out. Be nice. Out, get out of here. Get out. I thought it was too early for protesters. I'd -- get them out of here. See the way he puts up his hand. He puts out the wrong finger and we're supposed to take it nowadays, folks, right? Now, he's allowed to do that but we're not allowed to do what we want to do. You know it's pretty tough.","Pretty, pretty sad. Nasty, nasty, some nasty people, disgusting people, actually. When he, when he does that I think it's disgusting. So that's all right. So our country has got a lot of problems. You see what's happening. You know it's very interesting. I was driving in and I see this big air conditioning system, which I know a lot about air conditioner, and I said look that's Carrier.","You heard what happened with Carrier. And they're moving to Mexico. Ford. Ford, as you know, is putting a massive facility in Mexico. Now, they're doubling up. They're going to do another one. Nabisco is moving their big plant from Chicago into Mexico. And I'm telling you, folks. I'm not going to let it happen anymore.","This is ridiculous. We're not going to let it happen. All this free trade. You know what? It's free trade for them, not free trade for us. We're losing our shirts. And I -- look, I believe, I think free trade's fine. But the leaders of these other countries whether it's China, $500 billion a year trade deficit with China.","What the hell good is that for us? Where does that help us? So you have China, you have Japan where the cars come in by the hundreds of thousands. They pour off the boats. It's like mark is, is driving the car. I've never seen -- they come off. You wouldn't drive them it's too reckless. They come off these boats going like 40 miles or 50 miles an hour.","It's like the Long Island turnpike or Long Island Expressway. They come pouring off the boats one after another after another and we send them like nothing. We send them nothing. And by comparison, nothing. We have to make smart deals. We can no longer -- you know we're losing. You look at our deficits. You look at our budget.","You look at what's going on with this country. We're losing our jobs. And the politicians don't tell you that. I actually think a lot of them don't know. Most of them that do know they're controlled by special interests and own companies and other countries. They're even controlled by other countries. You know countries have lobbyists also.","They have lobbyists, they have their donors. It's absolutely crazy what's going on with our country. And you know, when you stand up and say we're going to charge you a tax. As an example, as an example Carrier. So they announced two weeks ago, the guy standing is a management person, I don't think it was even the top guy.","And he let 1,400 -- 1,400 great people and they had the cellphone going. Great people let go. And they said, boy, that's sad. I'm watching on a television. I'm saying that's sad. Now, folks, I was really a good student at the greatest school, the Wharton School of Finance, and you don't have to go Wharton.","You can -- you don't have to go to school. How does it help us to have Carrier go to Mexico? Make their air conditioning units in Mexico, let go all of these people, great jobs, they've been there for many, many years. They're great people. Great people. Beautiful units outside. Great people. Great stuff.","I'm not buying it anymore. I'm not buying Carrier anymore. So they go to Mexico. We go to -- and by the way, some countries that have pride, they don't buy like products if they're made in America. They want to build it in their country made -- remember we used to have made in the USA, right? When was the last time you've seen it. You don't see that anymore.","You don't see that anymore. So with Carrier, they're going to leave and they're going to take their 1,400 jobs and go on unemployment. They weren't even nice to the people. Actually, I didn't think. So they're going to build a big plant. And I will tell you what. The politicians will never do this because there's always a lobbyist to take care of a politician.","They have lobbyists where they virtually advertise, I'll take care of Rubio. They have guys that specialized in Rubio. They have guys that specialize in lying Ted Cruz, OK? No, they have -- they, they specialize. You know Ted Cruz, he comes in Bible high, bible high, puts the Bible down then lies to you.","He tells you -- I mean it's unbelievable. I -- I never met, you know, I thought real estate people were tough and real estate people in Manhattan were tough. And in many ways they are tough, they're tougher. But nope, I've never seen lying like goes on in politics. So here's what happens. We call up Carrier.","I want to do it myself. You know they always say you have to act Presidential. Somehow, it's not Presidential for the President of the United States to call up some guy at Carrier. This is the President of the United States. Who cares if it's Presidential in the sense. Look, I or one of my people. You know we have -- we have the best business people in the world in the United States.","We don't use them for trade deals. We don't use them. We use political hacks. We use people that couldn't care less. We used people that just contributed to get the job. And all of these people, they make the worst deals. We don't have good deals with it. We don't have good anything. When was the last time we won anything in this country?","We don't win anymore. Do we win in this country? Seriously, think about it. When was the last time we had a victory? We lose with ISIS. We lose with war. We lose with trade. We have lousy healthcare. It's going up 35%, 45%, 50%, this stupid Obamacare which we're going to repeal and replace. You look at education.","They want to educate your kids in Washington. They want them to come -- Washington. I want the kids educated from North Carolina. That's where we want them educated. You know you have Common Core. We're going to repeal and rip -- we're going to get rid of Common Core, a total way -- You know in 30 countries we're no 30th in the world, 30. So out of 30 countries, we're number 30 in the world, and we're number one in cost per pupil by far.","Now in a campaign, Mark would like this, because he's a very frugal person I hear. He doesn't spend anything. So he'd like this. In a campaign, I've spent the least money and I'm by far number one. Isn't that nice? Seriously. Wouldn't that be nice? So I've spent the least. You know in New Hampshire I won.","I love the people of New Hampshire. They have a tremendous problem with heroin. I said I'm going to solve that problem because we're going to build that wall, and that wall is going to happen, and we're going to stop. But, but, but we -- we are we're going to do so many things, folks. We're going to do -- how about when Mark and somebody, takes my best line he says, we're going to build that wall.","I love that, right? But in New Hampshire, they have a tremendous drug problem and you wouldn't see it. And we have so many problems. And I told the people of New Hampshire. They gave me a resounding victory, tremendous victory. And I told them I said, we're going to solve your problem. They have a tremendous heroin problem.","And it comes across the border like candy. And I said, I'm going to solve that then we're going to try and help your people because there's so many people that are so severely addicted, young people mostly, but people. A lot of people and we're going to help to get rid of this curse because this is a curse that's pouring into the United States, coming mostly from the Southern Border, and you know if you never start it, you never get addicted.","It's when you start it, it's very, very addictive, highly addictive. People getting -- dying all the time. Dying all the time. And it's strange because you go to New Hampshire it's so beautiful, like this. It's so beautiful and you drive down these gorgeous roads with the beautiful trees and everything so beautiful.","And then, you meet with a group of people and I say so what's your biggest problem? They go heroin. I say heroin? You know it just doesn't seem to make sense. But it is. It's a big problem and it's a big problem in the country. The drug problem is a big problem in the country. We're going to get rid of that problem, a large part of that problem.","We're going to get rid of a large part of that problem and we're going to bring you back to good lives again because this is crazy. This is crazy. You know -- but think about it. Where does our country win? So here's the story. We're going to go and, and I'm going to finish up with what I'm telling you because it's so easy.","We're going to start with trade. When I started, when I came down that escalator with my wife Melania, and I came down. And I said you know, it takes guts to do this. I mean, we're running for President. It takes guts. I'm a -- I'm not a politician. And about almost eight months ago, we came down the escalator and I took a deep breath and I talked about illegal immigration and I talked about trade.","So I started with trade. That's where the Carrier comes in and the Ford comes in, and then Nabisco comes in. And by the way, what I would do with Carrier is I would say the following, folks, enjoy your stay in Mexico. Build yourself a really nice plant. They're gone. They're gone. But I say build yourself a really nice plant.","But let me just give you a little clue. Every single air conditioning unit that you make -- forget about free trade, there is no free trade with this group. There is no free trade because these other countries, look, you know the eggheads, the eggheads, and we're all smarter than most of these eggheads. These other -- these people say free trade.","I love the concept of free trade. The problem is to have free trade, you need smart leadership. Otherwise, it's not going to work. And we have very, very dumb leadership. We have dumb, dumb leaders. And I'll get the approval for this because, in theory, we need the approval, in theory, but I'll get the approval.","I'm going to say look here's a story. Every single air conditioning unit that you make, every single unit that comes across the border, and it'll be hard to get things across the border by the time I'm -- every single unit that comes across the border, you're going to pay a 35% tax on that unit, OK? 35% and I'll tell you what's going to happen.","I'll tell you what's going to happen. We're going to get a call and they'll go and see a lobbyist but I'm self-funding my campaign. I'm putting up my own money so the lobbyists haven't done anything for me. And then they're going to have special interest guys call me up. I have no interest. I'm working for you, folks.","Then they'll have everybody and -- but it doesn't matter. Look, I'm not doing this because I need it. I'm doing it to Make America Great Again. We are going so down. We going -- and the politicians will never do it because they'll say, oh, it's wrong. We're going to do it. And by then -- within 10 minutes, somebody will have called them that contributed to their campaign.","You see the money they spent? You see the millions in negative ads about me that are mostly phony ads? I turned on at Doral, I had the Doral World Championship. You saw that the other day, Cadillac. And Adam Scott won, great, great tournament, and a lot of you watched it. And every time I turn I see a commercial about Trump, Trump, Trump, and so much of it is false.","It's so false. And by the time you get them to admit it's false, the election's over. Then they'll say, oh, I'm sorry it was false. It's like Ted Cruz, a good guy was Ben Carson like he did to Ben Carson. What he did was unbelievable. In Iowa, he says, oh, Ben Carson quit the race. Vote for us. Ben Carson quit the race.","Ben Carson never quit the race. He wouldn't have done that. I know him. He doesn't quit but they said Ben Carson left the race, he went home, he's not here, vote for us. And they convinced many people, probably thousands of people to vote for lying Ted Cruz, OK? And actually, and Rubio's worse, and Rubio's worse.","I mean this guy is such a scoundrel. You look at his past with his credit cards. You look at the driveway that he built out of funds that don't belong to him. You look at the things that Cruz did -- I mean, I'll tell you what. What he's done? I cannot believe he got away with it. But we'll expose it and see what happens.","I mean, we'll see what happens. But this guy is a disaster. On top of which, he's a choker because when Chris Christie, who endorsed me by the way, when he went after him -- it's true. I thought, I thought he was going to melt. I was all set to grab him, by the way, with his very powerful hand. I was very -- he made it up. He made that up. You know, I call him a lightweight.","So he said let's see, how do I attack Trump? Let's see, oh, he's got -- everything's nice. I'm pretty good you know, 6'3, he even called me 6'2, but that's OK. But he said, how do I -- oh, you have small hands. I do? I looked, I said I do? I shook hands. You know it's very funny -- all right. Get him out of here.","Get him out. You know you really say, where do these people come from? Where do they come? So here's the story. Look, here's the story, we're dealing with dirty, rotten, liars. These politicians are liars. They're dishonest people. They do commercials. They're only good at one thing and that's getting elected.","That's the only thing they're good at. I know them all my life. I know more about politicians than anybody. They're really -- I tell you they had not taken us where we have to be taken. So I came down, I talked about trade, trade, don't worry. But we've got endorsed by Carl Icahn. That's like getting endorsed by Brian France.","That's like you know great businesspeople. In fact, Brian would be very good. Hey, we could have Brian take over one night. How about Japan? Brian, you negotiate with Japan. We're going to be just fine. But you know, I have the best business leaders in the world. They want to do it. They don't want money.","They don't want to get paid. They want to do it. They love the country even though some of them are not nice people. Who cares? But they love the country. They want to do it and they don't want anything. They want to do it and they know how bad it is. Hey, I like China. I like Mexico but their leaders are too smart for our leaders.","Mexico's killing us at the border. They're killing us with trade. With trade, Mexico is a mini version of China. With China, they send their stuff over here -- I have a friend, he's a great manufacturer. He goes out to manufacture things. He is so good, his stuff is so good. He can't get it in China. That's not supposed to be, it's supposed to be free, right?","Free, flows. When he gets it in China, he's supposed to pay a massive tax. Now, they call it a tariff. It sounds a little bit less owners but he pays a big tax. And he comes and tells me, I see him about two months ago, he said, boy, dealing with China's murder. You can't get your stuff in and he's not even saying this is part of a campaign.","He said, you can't get your stuff in and when you do, we have to pay a big tax. I know a guy bought an airplane. He can't bring the airplane back into China. I mean, I don't want to mention big items but big items are important because they employ a lot of people. He can't get his airplane into China because they're charging a massive tax.","You look at trucks, they have a tax on trucks going into China. We just let everyone come in free. Folks, we've got to have smart trade now. We can't do this. We can't lose $505 billion with trade deficits. And I know what's going on because I'm in North Carolina a lot. In fact, I have a lot of my people that work for me. Where are my people?","Where are my people? Where are they? They work for me. Where are they? I love these people. They are doing the best job. Where's Gavin? Gavin, I love Gavin. What a job. I'm paying him too much money. That's my general manager. I just saw him backstage. He says, Mr. Trump, I said no signing because I have to go. We got a lot of people.","He just walks up. Hi, Mr. Trump could you sign this for me? That's Gavin, right? But anyway, Gavin's here someplace. So we love Gavin. Where's Gavin? Where? I love you, Gavin. Are we doing well? Do we love North Carolina? Good. Great job. One of the best golf courses in the state, one of the best, best Golf courses in the state, and it's a tremendous success, and the whole project is a tremendous success.","Thanks, Gavin. Good to have you. So I came down I talked about trade and the trade is going to take care of itself. Believe me. And just so you understand, I guarantee you that Carrier will call very quickly, and they're going to say what? They're going to say, Mr. President, we're moving back into the United States, we're not going to make this move.","We'll move -- I guarantee. I guarantee. I guarantee. The problem is our country has let it get too far out of control. It's out of control. So many people are leaving. You have Pfizers is leaving. They're moving to Ireland. You have so many great companies leaving, leaving back Pfizer. It's a massive, you know, pharmaceutical company.","You're -- they're leaving and they're taking thousands and thousands of jobs and letting the people go. And if you look at the jobs reports, which are totally phony, because if you stopped looking for a job, you are essentially considered employed, OK? How many people do you know that stopped looking for a job because they couldn't find it and then they're just considered employed?","So then you hear about 5% unemployment. It's probably 25%, but the one thing, even the other side admits this, we have all bad jobs now. We have garbage jobs. We don't have good jobs. We have jobs that we're not -- right. The other thing because of Obamacare and in order having to do with qualification, we have a lot of part-time jobs.","Who's working part-time that doesn't want to right now? Yeah. Yeah. You've got a lot of part-time jobs and these people don't want to work. I know there are some companies where the people were full-time for 25 years. Now, they're part-timers and they go out and get another job. And that has to do solely with Obamacare.","So we're going to straighten things out. But what happened is I would talk about trade and I talk about the border. And just to make it official because we're going to do it even stronger than Mark. And even though he's the strongest, we're going to make this strong, Mark. All right? We're going to build a wall.","It's going to be a real wall. We're going to build a wall on our border. And that wall is going to be a very, very effective real wall about as high as this ceiling. That's a pretty high ceiling. If somebody gets up there, they don't want to come down so quickly. That I can -- Do you ever see now they take cars and they drive right over the top?","They drive right over the top. They take the drugs -- By-bye. So we've had three singles so far. I tell you what. Where do these people come? You know, I tell you what. Oh, we have another one over here. Another single. Get out of here.","Get out of here. Get out of here. I didn't think you had people like that in North Carolina. Get out of here. Hey, you know, folks, it's interesting because I see there's an -- I like demonstrators. I actually have fun with it because the only way the cameras ever show how big the crowds are is where there's a demonstrat -- otherwise, they're focused on me. And everybody says to me, did you have much of a crowd?","Look at this place as an example, there's a -- they always say, did you have much of a crowd? But if there's a doubt -- and it took me three or four times before I realized they didn't -- I thought it was fixed equipment, they couldn't move it. It would never move. I'd say, show the crowd and they'd never move.","Then one day, four times in, my fourth speech, we had a demonstrator who was screaming and making fists and all the thing and those things look like pretzels the way they move. They move beautifully. They were moving. You never saw anything like it and everyone said, wow, what a crowd. So I love demonstration.","I love demonstrators. You're my friends, OK. In fact, If we don't have some, every once in a while, I'm going to bring my own demonstrator just to create, and we'll, we'll put them up into a corner someplace. So -- but, but it is -- nobody has the crowds. We have bigger crowds than Bernie by far, Bernie is going down now anyway.","You know Bernie. Bernie is over. Sadly, Bernie is over but he did have the second biggest crowds but we have the biggest. By the way, four times on the cover of Time Magazine over the last number of months which is amazing. Talking about the movement. In fact, this week we're on the cover of Time. I think I was on the cover of Time Magazine twice in 30 years, and now, I've been like almost, I think it's four times in the last three or four months.","Is that good? So that means -- see only in America. That means, as you get older, you get better, right? That's what that . But I'll tell you what, the last story, not the one out this week which was fine, but the one from three weeks ago, the cover of Time. You have to get it. It talks about the movement.","This is a movement. We go to Dallas. We go to Mobile, Alabama. We go to all different places. We go up in New Hampshire. We have the biggest crowds they've ever seen. They say that they've never seen anything like this in the history, and this isn't me speaking, in the history of this country. Politically speaking, they've never seen anything like it. And by the way, while I'm at it folks.","Will you please go out and vote? You know when you're voting next Tuesday, next Tuesday. Not tomorrow but in a week. You've got to go out. You've got to vote. Otherwise remember, you all swore to me, most of you, I think, almost all of you. But we don't have much of a movement. You know, that's like Muhammad Ali.","He was a friend of mine and Muhammad Ali -- oh, we have another one. Get him out of here. Get out of here. Looks like a nice little guy actually. Go home to mommy. Go home. Bye. Go home to mommy. Go home to mommy. Tell her to tuck you in bed. Aw, he's such a nice guy. Nasty little -- I'll tell you, nasty people.","Yeah. Are you sure we're in North Carolina? He's a nasty guy. No, he'll go home to mom now. I love you too, man. I love you. So it began and it really began strongly with trade and borders. And then you had Paris and then you had the attack in California, the 14 with two radicalized people came together, and they killed people that threw baby showers for them, 14, many in the hospital.","Paris, 130, many so badly hurt. And speaking of Paris, by the way, the toughest gun laws in the world. Paris and France, OK? The toughest in the world. The bad guys have guns. The good people -- let me just tell you something. If there were guns, if you had a gun, you had a gun, you had a gun, and you were on the other side of that room, and the bullets were going in the opposite direction.","You know in Paris, what they did, boom, boom, you get over here, boom, 130 people killed, many gravely injured, not one other gun in the room. We are going to protect, folks, our Second Amendment, 100%, 100%. Not going to be any games. Not going to be any games. We're going to protect it 100%. So what happened is I talked about trade, I talked about the borders, then you had the killing of Kate.","You had the killing of Jamiel, this great young guy in California. Going to be a football star, going to go to college, his father's a friend of mine. He's a great guy. Father was devastated, shot him, shot his son three times in the face. A guy just got out of jail, illegal immigrant, and shot him. You had the -- you had the woman who was 65 years old, a veteran, a wonderful woman, raped, sodomized, and killed by the illegal immigrant.","And, and you know what we're going to say? No more. No, no, no. No more, folks. No more. No more. No more. Those days are gone. We're not going to put up with it. We're not going to put up with it. We're not putting up with it. And let me tell you something. The migration, they're coming across, and Obama wants to bring thousands and thousands of people in. He has no idea who they are.","Are you, OK? You, OK? Are you all right? Go. Oh, boy. They all have a different system. Are Trump rallies fun? Aren't these fun, right? They're fun. They're fun. So after Paris, so after Paris, all of a sudden it started changing and we started getting polls in and everybody like Trump from the standpoint of ISIS, from the standpoint of the military, and by the way, our military is very depleted.","We are going to build up our military, 100%. The cheapest thing we can do and nobody is going to mess with us. Nobody. Nobody is going to mess with us. We're going to knock the hell out of ISIS. We're going to get rid of that deal. We're going to get rid of that. You know in one of the debates, I'm sure you heard it, it became a big deal.","But at one of the debates they asked lying Ted Cruz, he was on my left, and they asked him. They said lying Ted, what do you think of waterboarding? And he didn't want to answer the question because it's not, I guess, politically correct, right? And he was very weak on the question. And then they looked at me, they said what do you think?","I said I think we absolutely need it. We should have it. And if we can, we should have worse. Now, there are laws, there are laws, and we want to obey the laws, the rules, the regulations, even though ISIS doesn't. You know, it's very hard to defeat people when you're playing by different games and different rules.","So ISIS cuts off heads, like not since the middle ages, right? Medieval times, think of medieval times you'd read, they cut off heads. They drowned people in cages, big steel cages, they drop them in the ocean, they lift them up, they wiped out 40 people at one time, right? Now, we have waterboarding. Can you imagine these people sitting around after chopping off heads all day long and doing what they do which is violent?","Talking about can you imagine the stupid United States of America wants to protect us? They don't like waterboarding. Here are guys, they chop, chop. So we're going to go by the laws but I want to see if we can expand those laws and make them much more severe. We have to. So we're going to look to expand the laws but it was very interesting because Ted didn't want to talk about it too much, he was off.","But I'll tell you what. When I said no, no, we have to do it. We have to do it. Well, we don't have a choice, folks. We have people out there that want to destroy us. They don't have rules. They don't have regulations. Can you imagine telling ISIS and the others out there? Because it's beyond ISIS now, it's gotten to be so bad.","But could you imagine saying to them, well, you're not allowed to cut off heads because we have a law. You know what? I'll be honest. Honestly, they wouldn't even know what you're talking about. So we're playing by different sets of rules. We have to get the rules there, but even without that, we are going to find General MacArthur, General George Patton How long do you think ISIS would be around if General George Patton headed a little group going over to the Middle East?","I don't think they'd be around very long, folks. I don't think they'd be around very long. So we're going to toughen up our country. We're going to make our country better. It's going to be a better place. I mean, right now we have tremendous problems with crime and other things. We're going to strengthen our country.","We're going to make it a better place. But we're going to toughen up, and we're going to take care of our vets. Our vets have not been properly taken for. So it began and it was very interesting. So it began with the border. It began with trade because this trade has bothered me for years and years with China.","You know China has created, in my opinion, it's the single greatest theft in the history of the world. They have taken money and jobs and factories and everything out of our country to a tune, and by the way, I have a great relationship with China. They buy my apartments. They pay me tens of millions of dollars.","They do everything. I mean, they -- I have a great relationship with the people. We have buildings -- massive, these massive buildings, very, very successful. By the way, they never talk about that. They talk about water. I still have water. They talk about these little, little things, and I build these big jobs, and they're tremendously successful.","What I did is I built so many and I deal so much with China and it's been a pleasure. They write you big, fat, beautiful checks. In one of my buildings, I have the biggest bank in the world, their 400 million customers from China. We deal with China. The problem is our people and our lead -- our leaders don't know how to do it. So here's the story.","We are going to change our trade deals. We are going to make trade fade. We're not going to have, we're not going to have -- what? Oh, that's OK. Don't worry about him. He's very -- he's a quiet protester. I can't even hear him. I know he's protesting. I've been watching but I don't see anything coming out of his mouth.","I see his mouth moving. So we're going to have great trip -- we're going to have great trade deals. We're going to bring our jobs back to the country. We're going to bring our jobs back to North Carolina where they've been stripped. They've been stripped. And you're going to be so proud of your country. What happened is with the trade, great.","With the wall, great. Are you, OK, honey? Don't fall. Oh, the protester just tripped. Oh, they'll blame us. They're going to blame Trump, she tripped. Nobody was touching her. OK, only one person, she slipped. You know what she'll do? She'll sue this building now on the basis that the floors were too slippery, right?","This is what we are. So it started off with trade and it started off with the border, and all of a sudden everybody said, we like Trump best for the military. We like Trump best for ISIS. We like Trump best for healthcare and that's what's happened. So here's the story, folks. Our country doesn't win anymore.","We're going to start winning. We're going to win with our military. We're going to knock out ISIS. We're going to take care of our vets, big league. We're going to help our vets, our greatest people. We're going to win with healthcare. We're going to get rid of Obamacare. We're going to replace it with something great.","We're getting rid of Common Core. We're going to have great education where you're going to be proud. We're going to have strong, strong, powerful borders. We're going to have borders that you're going to be proud of. If we don't have borders, we don't have a country. We're going to have borders and we're going to have the wall.","And the wall is going to go up and it's going to go up fast. So I just want to thank everybody. Thank you. So I just want to thank everybody for being here. It's like an amazing thing. No matter where we go in the country, no matter where -- we go to Dallas. We go to all of these different places.","We have great, great people in this country. And one of the things I'm going to do and I'm going to get it done and a lot of people talk about it, but they'll never get it done because they're just third-rate politicians. One of the things I'm going to do is Apple and companies like Apple are going to start building their product in the United States.","We're going to make it in the United States. So, folks, we're going to start winning again. We're going to win a lot. I love you. Go out and vote. Remember that pledge, remember that pledge. Go out and vote. I love you all. I love North Carolina. Thank you, everybody. Thank you, Mark. Thank you, Mark. Thank you, everybody."],"text":" Boy on a Monday morning. Can you believe this, right? This is amazing. This is amazing. Well, I want to thank you. It's a great place. You know I have a lot of property here I love North Carolina. And over by Lake Norman. Anybody ever hear of Lake Norman? So you know what I have then, it's great. It's great. Great place. That's right. That's exactly right. You know. So it's always nice. I don't think too many of the other candidates employ a lot of people here, right? Just Trump. Just Trump. So I want to thank you all. You know I just had a visitor backstage, NASCAR endorsed Trump. Can you believe that? And we love Brian France and the whole group and NASCAR and we had Bill Elliott and Chase Elliott, the hot, young driver and we have right here. Come here, Mark. Mark Martin, everybody. Come here. Hey, guys. Donald Trump has my vote. Let's bring these greatly needed jobs back to this country and build that wall. Make America Great Again. Thank you, Martin. Oh, he has guts. Do those guys have guts? I tried it once you know. I couldn't get that -- I just couldn't press down on that accelerator very far. I might have gone up to about 85. That's about all. It takes -- you know it's a special talent. It's a special -- it's a special kind of courage. Like everything else you need a special to -- world I guess of specialization to an extent. But Mark, I want to thank you very much, really an honor. And I have to tell you and I want to thank NASCAR and you know Brian France was with us last week at a venue and he got up on behalf of NASCAR. And Brian's an amazing guy. He's done some job. I'll tell you that. And for them to endorse me was really a very great honor. Thank you very much. So a lot of things have been happening. And a lot of polls have come out and the latest one, national polls, CNN, Trump 49, little Marco Rubio you know. He's a -- he's a no show in the US Senate. He never goes to vote. I'll tell you what. That guy he couldn't be elected dogcatcher in Florida. The people in Florida. I mean -- -- of Cruz at 15, you have Kasich like at six, and I just want to tell you that's pretty good stuff, right? You know one of the polls came out isn't that a beautiful, sight? Beautiful. I love it. Well, I only use like the ones where we're doing well but we're doing well in most of them so. One of them, the polls just came out and a number of them have just come out. One of the polls -- you know I only use like the ones where we're doing well but we're doing well in most of them so. One of the polls just came out and a number of polls have just come out. I'm beating Hillary Clinton quite easily, thank you. And honestly, we really haven't even started on her. We only had one little skirmish about a month ago. You remember that little skirmish, right? So -- I tell you what. Yeah, put her in jail. Who said that? Who said -- I -- and he means it. So we've been going around and it's been amazing. We won New Hampshire. We won South Carolina. Oh, South Carolina. We love South Carolina, right? We love South Carolina. We won Nevada, Georgia, Tennessee, Alabama, Vermont, Arkansas, Massachusetts. We're going to have I think a couple of good ones tomorrow I hope. Let's see what happens. But we have some good ones. Michigan is going to be -- look I've been fighting hard for cars. Cars are going to be made in our country. They're going to be made in our country. And we really have been, I mean, we've been fighting very, very hard for that industry. I've been to Michigan a lot and I think we're going to do well there and we have Idaho. We love Idaho potatoes, right? Who doesn't have potatoes from Idaho? And we have Mississippi which I'm there a lot actually and what a great -- do we love Mississippi, yes, right? So we have in -- we have Hawaii. I have a big hotel in Hawaii. We employ a lot of people in Hawaii. It's beautiful. So we have a lot of things coming up and then the following week we go with Florida. And we go with Ohio and some others. It's going to be. It's going to be -- well, let me ask you most importantly. Who's going to win North Carolina? Right? I think so. I think we're going to do great here. I mean, I think we're going to do good. Should we do the pledge? Should we do the pledge? Raise your hand. I swear I'm going to vote for Donald Trump next week. I swear, right? Good. Oh, wow. Just with the people here I think we'll win, right? So I want to just thank you all. I mean, really to be here on a Monday like this, Monday morning. This is incredible. But I'll tell you what. I'll tell you what. Our country and somebody just shouted out about jobs and they shouted it out to Mark. Thank you very much. Oh, we have a protester. We have a protester. We have -- out, out, out. Be nice. Out, get out of here. Get out. I thought it was too early for protesters. I'd -- get them out of here. See the way he puts up his hand. He puts out the wrong finger and we're supposed to take it nowadays, folks, right? Now, he's allowed to do that but we're not allowed to do what we want to do. You know it's pretty tough. Pretty, pretty sad. Nasty, nasty, some nasty people, disgusting people, actually. When he, when he does that I think it's disgusting. So that's all right. So our country has got a lot of problems. You see what's happening. You know it's very interesting. I was driving in and I see this big air conditioning system, which I know a lot about air conditioner, and I said look that's Carrier. You heard what happened with Carrier. And they're moving to Mexico. Ford. Ford, as you know, is putting a massive facility in Mexico. Now, they're doubling up. They're going to do another one. Nabisco is moving their big plant from Chicago into Mexico. And I'm telling you, folks. I'm not going to let it happen anymore. This is ridiculous. We're not going to let it happen. All this free trade. You know what? It's free trade for them, not free trade for us. We're losing our shirts. And I -- look, I believe, I think free trade's fine. But the leaders of these other countries whether it's China, $500 billion a year trade deficit with China. What the hell good is that for us? Where does that help us? So you have China, you have Japan where the cars come in by the hundreds of thousands. They pour off the boats. It's like mark is, is driving the car. I've never seen -- they come off. You wouldn't drive them it's too reckless. They come off these boats going like 40 miles or 50 miles an hour. It's like the Long Island turnpike or Long Island Expressway. They come pouring off the boats one after another after another and we send them like nothing. We send them nothing. And by comparison, nothing. We have to make smart deals. We can no longer -- you know we're losing. You look at our deficits. You look at our budget. You look at what's going on with this country. We're losing our jobs. And the politicians don't tell you that. I actually think a lot of them don't know. Most of them that do know they're controlled by special interests and own companies and other countries. They're even controlled by other countries. You know countries have lobbyists also. They have lobbyists, they have their donors. It's absolutely crazy what's going on with our country. And you know, when you stand up and say we're going to charge you a tax. As an example, as an example Carrier. So they announced two weeks ago, the guy standing is a management person, I don't think it was even the top guy. And he let 1,400 -- 1,400 great people and they had the cellphone going. Great people let go. And they said, boy, that's sad. I'm watching on a television. I'm saying that's sad. Now, folks, I was really a good student at the greatest school, the Wharton School of Finance, and you don't have to go Wharton. You can -- you don't have to go to school. How does it help us to have Carrier go to Mexico? Make their air conditioning units in Mexico, let go all of these people, great jobs, they've been there for many, many years. They're great people. Great people. Beautiful units outside. Great people. Great stuff. I'm not buying it anymore. I'm not buying Carrier anymore. So they go to Mexico. We go to -- and by the way, some countries that have pride, they don't buy like products if they're made in America. They want to build it in their country made -- remember we used to have made in the USA, right? When was the last time you've seen it. You don't see that anymore. You don't see that anymore. So with Carrier, they're going to leave and they're going to take their 1,400 jobs and go on unemployment. They weren't even nice to the people. Actually, I didn't think. So they're going to build a big plant. And I will tell you what. The politicians will never do this because there's always a lobbyist to take care of a politician. They have lobbyists where they virtually advertise, I'll take care of Rubio. They have guys that specialized in Rubio. They have guys that specialize in lying Ted Cruz, OK? No, they have -- they, they specialize. You know Ted Cruz, he comes in Bible high, bible high, puts the Bible down then lies to you. He tells you -- I mean it's unbelievable. I -- I never met, you know, I thought real estate people were tough and real estate people in Manhattan were tough. And in many ways they are tough, they're tougher. But nope, I've never seen lying like goes on in politics. So here's what happens. We call up Carrier. I want to do it myself. You know they always say you have to act Presidential. Somehow, it's not Presidential for the President of the United States to call up some guy at Carrier. This is the President of the United States. Who cares if it's Presidential in the sense. Look, I or one of my people. You know we have -- we have the best business people in the world in the United States. We don't use them for trade deals. We don't use them. We use political hacks. We use people that couldn't care less. We used people that just contributed to get the job. And all of these people, they make the worst deals. We don't have good deals with it. We don't have good anything. When was the last time we won anything in this country? We don't win anymore. Do we win in this country? Seriously, think about it. When was the last time we had a victory? We lose with ISIS. We lose with war. We lose with trade. We have lousy healthcare. It's going up 35%, 45%, 50%, this stupid Obamacare which we're going to repeal and replace. You look at education. They want to educate your kids in Washington. They want them to come -- Washington. I want the kids educated from North Carolina. That's where we want them educated. You know you have Common Core. We're going to repeal and rip -- we're going to get rid of Common Core, a total way -- You know in 30 countries we're no 30th in the world, 30. So out of 30 countries, we're number 30 in the world, and we're number one in cost per pupil by far. Now in a campaign, Mark would like this, because he's a very frugal person I hear. He doesn't spend anything. So he'd like this. In a campaign, I've spent the least money and I'm by far number one. Isn't that nice? Seriously. Wouldn't that be nice? So I've spent the least. You know in New Hampshire I won. I love the people of New Hampshire. They have a tremendous problem with heroin. I said I'm going to solve that problem because we're going to build that wall, and that wall is going to happen, and we're going to stop. But, but, but we -- we are we're going to do so many things, folks. We're going to do -- how about when Mark and somebody, takes my best line he says, we're going to build that wall. I love that, right? But in New Hampshire, they have a tremendous drug problem and you wouldn't see it. And we have so many problems. And I told the people of New Hampshire. They gave me a resounding victory, tremendous victory. And I told them I said, we're going to solve your problem. They have a tremendous heroin problem. And it comes across the border like candy. And I said, I'm going to solve that then we're going to try and help your people because there's so many people that are so severely addicted, young people mostly, but people. A lot of people and we're going to help to get rid of this curse because this is a curse that's pouring into the United States, coming mostly from the Southern Border, and you know if you never start it, you never get addicted. It's when you start it, it's very, very addictive, highly addictive. People getting -- dying all the time. Dying all the time. And it's strange because you go to New Hampshire it's so beautiful, like this. It's so beautiful and you drive down these gorgeous roads with the beautiful trees and everything so beautiful. And then, you meet with a group of people and I say so what's your biggest problem? They go heroin. I say heroin? You know it just doesn't seem to make sense. But it is. It's a big problem and it's a big problem in the country. The drug problem is a big problem in the country. We're going to get rid of that problem, a large part of that problem. We're going to get rid of a large part of that problem and we're going to bring you back to good lives again because this is crazy. This is crazy. You know -- but think about it. Where does our country win? So here's the story. We're going to go and, and I'm going to finish up with what I'm telling you because it's so easy. We're going to start with trade. When I started, when I came down that escalator with my wife Melania, and I came down. And I said you know, it takes guts to do this. I mean, we're running for President. It takes guts. I'm a -- I'm not a politician. And about almost eight months ago, we came down the escalator and I took a deep breath and I talked about illegal immigration and I talked about trade. So I started with trade. That's where the Carrier comes in and the Ford comes in, and then Nabisco comes in. And by the way, what I would do with Carrier is I would say the following, folks, enjoy your stay in Mexico. Build yourself a really nice plant. They're gone. They're gone. But I say build yourself a really nice plant. But let me just give you a little clue. Every single air conditioning unit that you make -- forget about free trade, there is no free trade with this group. There is no free trade because these other countries, look, you know the eggheads, the eggheads, and we're all smarter than most of these eggheads. These other -- these people say free trade. I love the concept of free trade. The problem is to have free trade, you need smart leadership. Otherwise, it's not going to work. And we have very, very dumb leadership. We have dumb, dumb leaders. And I'll get the approval for this because, in theory, we need the approval, in theory, but I'll get the approval. I'm going to say look here's a story. Every single air conditioning unit that you make, every single unit that comes across the border, and it'll be hard to get things across the border by the time I'm -- every single unit that comes across the border, you're going to pay a 35% tax on that unit, OK? 35% and I'll tell you what's going to happen. I'll tell you what's going to happen. We're going to get a call and they'll go and see a lobbyist but I'm self-funding my campaign. I'm putting up my own money so the lobbyists haven't done anything for me. And then they're going to have special interest guys call me up. I have no interest. I'm working for you, folks. Then they'll have everybody and -- but it doesn't matter. Look, I'm not doing this because I need it. I'm doing it to Make America Great Again. We are going so down. We going -- and the politicians will never do it because they'll say, oh, it's wrong. We're going to do it. And by then -- within 10 minutes, somebody will have called them that contributed to their campaign. You see the money they spent? You see the millions in negative ads about me that are mostly phony ads? I turned on at Doral, I had the Doral World Championship. You saw that the other day, Cadillac. And Adam Scott won, great, great tournament, and a lot of you watched it. And every time I turn I see a commercial about Trump, Trump, Trump, and so much of it is false. It's so false. And by the time you get them to admit it's false, the election's over. Then they'll say, oh, I'm sorry it was false. It's like Ted Cruz, a good guy was Ben Carson like he did to Ben Carson. What he did was unbelievable. In Iowa, he says, oh, Ben Carson quit the race. Vote for us. Ben Carson quit the race. Ben Carson never quit the race. He wouldn't have done that. I know him. He doesn't quit but they said Ben Carson left the race, he went home, he's not here, vote for us. And they convinced many people, probably thousands of people to vote for lying Ted Cruz, OK? And actually, and Rubio's worse, and Rubio's worse. I mean this guy is such a scoundrel. You look at his past with his credit cards. You look at the driveway that he built out of funds that don't belong to him. You look at the things that Cruz did -- I mean, I'll tell you what. What he's done? I cannot believe he got away with it. But we'll expose it and see what happens. I mean, we'll see what happens. But this guy is a disaster. On top of which, he's a choker because when Chris Christie, who endorsed me by the way, when he went after him -- it's true. I thought, I thought he was going to melt. I was all set to grab him, by the way, with his very powerful hand. I was very -- he made it up. He made that up. You know, I call him a lightweight. So he said let's see, how do I attack Trump? Let's see, oh, he's got -- everything's nice. I'm pretty good you know, 6'3, he even called me 6'2, but that's OK. But he said, how do I -- oh, you have small hands. I do? I looked, I said I do? I shook hands. You know it's very funny -- all right. Get him out of here. Get him out. You know you really say, where do these people come from? Where do they come? So here's the story. Look, here's the story, we're dealing with dirty, rotten, liars. These politicians are liars. They're dishonest people. They do commercials. They're only good at one thing and that's getting elected. That's the only thing they're good at. I know them all my life. I know more about politicians than anybody. They're really -- I tell you they had not taken us where we have to be taken. So I came down, I talked about trade, trade, don't worry. But we've got endorsed by Carl Icahn. That's like getting endorsed by Brian France. That's like you know great businesspeople. In fact, Brian would be very good. Hey, we could have Brian take over one night. How about Japan? Brian, you negotiate with Japan. We're going to be just fine. But you know, I have the best business leaders in the world. They want to do it. They don't want money. They don't want to get paid. They want to do it. They love the country even though some of them are not nice people. Who cares? But they love the country. They want to do it and they don't want anything. They want to do it and they know how bad it is. Hey, I like China. I like Mexico but their leaders are too smart for our leaders. Mexico's killing us at the border. They're killing us with trade. With trade, Mexico is a mini version of China. With China, they send their stuff over here -- I have a friend, he's a great manufacturer. He goes out to manufacture things. He is so good, his stuff is so good. He can't get it in China. That's not supposed to be, it's supposed to be free, right? Free, flows. When he gets it in China, he's supposed to pay a massive tax. Now, they call it a tariff. It sounds a little bit less owners but he pays a big tax. And he comes and tells me, I see him about two months ago, he said, boy, dealing with China's murder. You can't get your stuff in and he's not even saying this is part of a campaign. He said, you can't get your stuff in and when you do, we have to pay a big tax. I know a guy bought an airplane. He can't bring the airplane back into China. I mean, I don't want to mention big items but big items are important because they employ a lot of people. He can't get his airplane into China because they're charging a massive tax. You look at trucks, they have a tax on trucks going into China. We just let everyone come in free. Folks, we've got to have smart trade now. We can't do this. We can't lose $505 billion with trade deficits. And I know what's going on because I'm in North Carolina a lot. In fact, I have a lot of my people that work for me. Where are my people? Where are my people? Where are they? They work for me. Where are they? I love these people. They are doing the best job. Where's Gavin? Gavin, I love Gavin. What a job. I'm paying him too much money. That's my general manager. I just saw him backstage. He says, Mr. Trump, I said no signing because I have to go. We got a lot of people. He just walks up. Hi, Mr. Trump could you sign this for me? That's Gavin, right? But anyway, Gavin's here someplace. So we love Gavin. Where's Gavin? Where? I love you, Gavin. Are we doing well? Do we love North Carolina? Good. Great job. One of the best golf courses in the state, one of the best, best Golf courses in the state, and it's a tremendous success, and the whole project is a tremendous success. Thanks, Gavin. Good to have you. So I came down I talked about trade and the trade is going to take care of itself. Believe me. And just so you understand, I guarantee you that Carrier will call very quickly, and they're going to say what? They're going to say, Mr. President, we're moving back into the United States, we're not going to make this move. We'll move -- I guarantee. I guarantee. I guarantee. The problem is our country has let it get too far out of control. It's out of control. So many people are leaving. You have Pfizers is leaving. They're moving to Ireland. You have so many great companies leaving, leaving back Pfizer. It's a massive, you know, pharmaceutical company. You're -- they're leaving and they're taking thousands and thousands of jobs and letting the people go. And if you look at the jobs reports, which are totally phony, because if you stopped looking for a job, you are essentially considered employed, OK? How many people do you know that stopped looking for a job because they couldn't find it and then they're just considered employed? So then you hear about 5% unemployment. It's probably 25%, but the one thing, even the other side admits this, we have all bad jobs now. We have garbage jobs. We don't have good jobs. We have jobs that we're not -- right. The other thing because of Obamacare and in order having to do with qualification, we have a lot of part-time jobs. Who's working part-time that doesn't want to right now? Yeah. Yeah. You've got a lot of part-time jobs and these people don't want to work. I know there are some companies where the people were full-time for 25 years. Now, they're part-timers and they go out and get another job. And that has to do solely with Obamacare. So we're going to straighten things out. But what happened is I would talk about trade and I talk about the border. And just to make it official because we're going to do it even stronger than Mark. And even though he's the strongest, we're going to make this strong, Mark. All right? We're going to build a wall. It's going to be a real wall. We're going to build a wall on our border. And that wall is going to be a very, very effective real wall about as high as this ceiling. That's a pretty high ceiling. If somebody gets up there, they don't want to come down so quickly. That I can -- Do you ever see now they take cars and they drive right over the top? They drive right over the top. They take the drugs -- By-bye. So we've had three singles so far. I tell you what. Where do these people come? You know, I tell you what. Oh, we have another one over here. Another single. Get out of here. Get out of here. Get out of here. I didn't think you had people like that in North Carolina. Get out of here. Hey, you know, folks, it's interesting because I see there's an -- I like demonstrators. I actually have fun with it because the only way the cameras ever show how big the crowds are is where there's a demonstrat -- otherwise, they're focused on me. And everybody says to me, did you have much of a crowd? Look at this place as an example, there's a -- they always say, did you have much of a crowd? But if there's a doubt -- and it took me three or four times before I realized they didn't -- I thought it was fixed equipment, they couldn't move it. It would never move. I'd say, show the crowd and they'd never move. Then one day, four times in, my fourth speech, we had a demonstrator who was screaming and making fists and all the thing and those things look like pretzels the way they move. They move beautifully. They were moving. You never saw anything like it and everyone said, wow, what a crowd. So I love demonstration. I love demonstrators. You're my friends, OK. In fact, If we don't have some, every once in a while, I'm going to bring my own demonstrator just to create, and we'll, we'll put them up into a corner someplace. So -- but, but it is -- nobody has the crowds. We have bigger crowds than Bernie by far, Bernie is going down now anyway. You know Bernie. Bernie is over. Sadly, Bernie is over but he did have the second biggest crowds but we have the biggest. By the way, four times on the cover of Time Magazine over the last number of months which is amazing. Talking about the movement. In fact, this week we're on the cover of Time. I think I was on the cover of Time Magazine twice in 30 years, and now, I've been like almost, I think it's four times in the last three or four months. Is that good? So that means -- see only in America. That means, as you get older, you get better, right? That's what that . But I'll tell you what, the last story, not the one out this week which was fine, but the one from three weeks ago, the cover of Time. You have to get it. It talks about the movement. This is a movement. We go to Dallas. We go to Mobile, Alabama. We go to all different places. We go up in New Hampshire. We have the biggest crowds they've ever seen. They say that they've never seen anything like this in the history, and this isn't me speaking, in the history of this country. Politically speaking, they've never seen anything like it. And by the way, while I'm at it folks. Will you please go out and vote? You know when you're voting next Tuesday, next Tuesday. Not tomorrow but in a week. You've got to go out. You've got to vote. Otherwise remember, you all swore to me, most of you, I think, almost all of you. But we don't have much of a movement. You know, that's like Muhammad Ali. He was a friend of mine and Muhammad Ali -- oh, we have another one. Get him out of here. Get out of here. Looks like a nice little guy actually. Go home to mommy. Go home. Bye. Go home to mommy. Go home to mommy. Tell her to tuck you in bed. Aw, he's such a nice guy. Nasty little -- I'll tell you, nasty people. Yeah. Are you sure we're in North Carolina? He's a nasty guy. No, he'll go home to mom now. I love you too, man. I love you. So it began and it really began strongly with trade and borders. And then you had Paris and then you had the attack in California, the 14 with two radicalized people came together, and they killed people that threw baby showers for them, 14, many in the hospital. Paris, 130, many so badly hurt. And speaking of Paris, by the way, the toughest gun laws in the world. Paris and France, OK? The toughest in the world. The bad guys have guns. The good people -- let me just tell you something. If there were guns, if you had a gun, you had a gun, you had a gun, and you were on the other side of that room, and the bullets were going in the opposite direction. You know in Paris, what they did, boom, boom, you get over here, boom, 130 people killed, many gravely injured, not one other gun in the room. We are going to protect, folks, our Second Amendment, 100%, 100%. Not going to be any games. Not going to be any games. We're going to protect it 100%. So what happened is I talked about trade, I talked about the borders, then you had the killing of Kate. You had the killing of Jamiel, this great young guy in California. Going to be a football star, going to go to college, his father's a friend of mine. He's a great guy. Father was devastated, shot him, shot his son three times in the face. A guy just got out of jail, illegal immigrant, and shot him. You had the -- you had the woman who was 65 years old, a veteran, a wonderful woman, raped, sodomized, and killed by the illegal immigrant. And, and you know what we're going to say? No more. No, no, no. No more, folks. No more. No more. No more. Those days are gone. We're not going to put up with it. We're not going to put up with it. We're not putting up with it. And let me tell you something. The migration, they're coming across, and Obama wants to bring thousands and thousands of people in. He has no idea who they are. Are you, OK? You, OK? Are you all right? Go. Oh, boy. They all have a different system. Are Trump rallies fun? Aren't these fun, right? They're fun. They're fun. So after Paris, so after Paris, all of a sudden it started changing and we started getting polls in and everybody like Trump from the standpoint of ISIS, from the standpoint of the military, and by the way, our military is very depleted. We are going to build up our military, 100%. The cheapest thing we can do and nobody is going to mess with us. Nobody. Nobody is going to mess with us. We're going to knock the hell out of ISIS. We're going to get rid of that deal. We're going to get rid of that. You know in one of the debates, I'm sure you heard it, it became a big deal. But at one of the debates they asked lying Ted Cruz, he was on my left, and they asked him. They said lying Ted, what do you think of waterboarding? And he didn't want to answer the question because it's not, I guess, politically correct, right? And he was very weak on the question. And then they looked at me, they said what do you think? I said I think we absolutely need it. We should have it. And if we can, we should have worse. Now, there are laws, there are laws, and we want to obey the laws, the rules, the regulations, even though ISIS doesn't. You know, it's very hard to defeat people when you're playing by different games and different rules. So ISIS cuts off heads, like not since the middle ages, right? Medieval times, think of medieval times you'd read, they cut off heads. They drowned people in cages, big steel cages, they drop them in the ocean, they lift them up, they wiped out 40 people at one time, right? Now, we have waterboarding. Can you imagine these people sitting around after chopping off heads all day long and doing what they do which is violent? Talking about can you imagine the stupid United States of America wants to protect us? They don't like waterboarding. Here are guys, they chop, chop. So we're going to go by the laws but I want to see if we can expand those laws and make them much more severe. We have to. So we're going to look to expand the laws but it was very interesting because Ted didn't want to talk about it too much, he was off. But I'll tell you what. When I said no, no, we have to do it. We have to do it. Well, we don't have a choice, folks. We have people out there that want to destroy us. They don't have rules. They don't have regulations. Can you imagine telling ISIS and the others out there? Because it's beyond ISIS now, it's gotten to be so bad. But could you imagine saying to them, well, you're not allowed to cut off heads because we have a law. You know what? I'll be honest. Honestly, they wouldn't even know what you're talking about. So we're playing by different sets of rules. We have to get the rules there, but even without that, we are going to find General MacArthur, General George Patton How long do you think ISIS would be around if General George Patton headed a little group going over to the Middle East? I don't think they'd be around very long, folks. I don't think they'd be around very long. So we're going to toughen up our country. We're going to make our country better. It's going to be a better place. I mean, right now we have tremendous problems with crime and other things. We're going to strengthen our country. We're going to make it a better place. But we're going to toughen up, and we're going to take care of our vets. Our vets have not been properly taken for. So it began and it was very interesting. So it began with the border. It began with trade because this trade has bothered me for years and years with China. You know China has created, in my opinion, it's the single greatest theft in the history of the world. They have taken money and jobs and factories and everything out of our country to a tune, and by the way, I have a great relationship with China. They buy my apartments. They pay me tens of millions of dollars. They do everything. I mean, they -- I have a great relationship with the people. We have buildings -- massive, these massive buildings, very, very successful. By the way, they never talk about that. They talk about water. I still have water. They talk about these little, little things, and I build these big jobs, and they're tremendously successful. What I did is I built so many and I deal so much with China and it's been a pleasure. They write you big, fat, beautiful checks. In one of my buildings, I have the biggest bank in the world, their 400 million customers from China. We deal with China. The problem is our people and our lead -- our leaders don't know how to do it. So here's the story. We are going to change our trade deals. We are going to make trade fade. We're not going to have, we're not going to have -- what? Oh, that's OK. Don't worry about him. He's very -- he's a quiet protester. I can't even hear him. I know he's protesting. I've been watching but I don't see anything coming out of his mouth. I see his mouth moving. So we're going to have great trip -- we're going to have great trade deals. We're going to bring our jobs back to the country. We're going to bring our jobs back to North Carolina where they've been stripped. They've been stripped. And you're going to be so proud of your country. What happened is with the trade, great. With the wall, great. Are you, OK, honey? Don't fall. Oh, the protester just tripped. Oh, they'll blame us. They're going to blame Trump, she tripped. Nobody was touching her. OK, only one person, she slipped. You know what she'll do? She'll sue this building now on the basis that the floors were too slippery, right? This is what we are. So it started off with trade and it started off with the border, and all of a sudden everybody said, we like Trump best for the military. We like Trump best for ISIS. We like Trump best for healthcare and that's what's happened. So here's the story, folks. Our country doesn't win anymore. We're going to start winning. We're going to win with our military. We're going to knock out ISIS. We're going to take care of our vets, big league. We're going to help our vets, our greatest people. We're going to win with healthcare. We're going to get rid of Obamacare. We're going to replace it with something great. We're getting rid of Common Core. We're going to have great education where you're going to be proud. We're going to have strong, strong, powerful borders. We're going to have borders that you're going to be proud of. If we don't have borders, we don't have a country. We're going to have borders and we're going to have the wall. And the wall is going to go up and it's going to go up fast. So I just want to thank everybody. Thank you. So I just want to thank everybody for being here. It's like an amazing thing. No matter where we go in the country, no matter where -- we go to Dallas. We go to all of these different places. We have great, great people in this country. And one of the things I'm going to do and I'm going to get it done and a lot of people talk about it, but they'll never get it done because they're just third-rate politicians. One of the things I'm going to do is Apple and companies like Apple are going to start building their product in the United States. We're going to make it in the United States. So, folks, we're going to start winning again. We're going to win a lot. I love you. Go out and vote. Remember that pledge, remember that pledge. Go out and vote. I love you all. I love North Carolina. Thank you, everybody. Thank you, Mark. Thank you, Mark. Thank you, everybody."}