{"id":432,"author":"Donald Trump","title":"Speech: Donald Trump in Wichita, KS","date":"2016-03-05","link":"https://factba.se/transcript/donald-trump-speech-wichita-ks-march-5-2016","paragraphs":["So I wanted to be in Kansas. I wanted to be here so badly, so I headed into another direction. I told the pilot, \"We're going to Kansas, just get there.\" Now, we don't have much time this morning because in a few minutes we're got go over in caucus. Who's got the right to caucus? Who's got the right to vote?","Your hand. Good. Good. Good. Well I'm going over with you. OK. We're all going together.","This is the movement, folks. It's never been anything like this. They're all saying, \"This isn't coming from Donald Trump. This is coming from Time magazine and everything else.\" We're on the cover numerous times over the last couple of months. I never thought -- took me to -- it took me like 30 years to be on the cover of Time twice.","Now I've done it four times in the last three months so something's happening, right? Something's happening.","This is better than real estate. This is more fun. But look we've got to do the right thing. CNN just came out with a poll two days ago, 49% for Trump, next was Cruz and Rubio. Lying Ted and little Marco. The -- These are not -- this is not presidential material, folks, believe me.","So look, look. We've got to make America great again. We've got to -- we've got to make America great again. It's very simple. Look he's got a sign. \"Show him your hands, Mr. Trump.\" My hands, look at these hands. These hands hit a golf ball 285 yards. Look at these hands. These politicians, such liars, liars.","I guess when I made this statement about him being a lightweight he said, \"Ah, let's see. What's wrong with Trump? What's wrong? Let me think about something. Ah, maybe he's got a small hands. He's got small hands.\"","They lie. So anyway, look, all kidding aside, our country is in trouble. We are $19 trillion, nobody even knows what that means. It means so much, you can take top people. Top top people they don't know what it means. And it's just beyond. They just signed the worst budget deal I've ever seen, the worst.","And we're going to change things so badly, went so quickly, it's going to go so fast, and you're going to be so proud, you're going to be so proud of your country again, you're going to be proud of your president.","And it's not me. I'm like the messenger, we're all together, we're all together. I'm telling you, I've so many articles. What we've done is very unique because the Republicans were for, you know, decades, decades. They made a tremendous mistake when you chose Mitt Romney four years ago. He was a disastrous again today, no energy, no life, no nothing.","He's a stiff. OK. Just a stiff guy. He was. He was, he was a loser. And then he comes out. You know if he would have devoted the same energy four years ago to running for president, him and his third great campaign manager, I steal my television all the time. Where was he four years ago when Obama was doing Jay Leno, when Obama was doing David Letterman and oh, Romney was looking for a zone change to get a nine car garage built?","OK. Where was this guy?","So look. It's -- it's the establishment -- the establishment is against us. The press back there is against us. Although some of it's coming around, I must tell you. I read a couple of articles this morning. I read a couple of articles this morning, folks, they're coming around. By the way, polls show that I beat Hillary Clinton.","Many polls show that I beat Hillary.","You know, these guys they like to say, \"Well, Donald Trump will never beat Hillary Clinton.\" I watch him on television. I'm watching FOX, I'm watching CNN, I'm watching MS, and I'm watching television and say, \"Well, Donald Trump will never ever beat Hillary.\" The polls are showing that I beat her. I haven't even started on her yet.","I haven't even started.","You know, I wasn't supposed to beat Jeb Bush. He was established man. He was the one that was getting it. I spew all of his supporters on television saying, \"Donald Trump will not win.\" Well what happened to that candidate. OK. It's unbelievable. No, don't -- this is so, so foolish. You know the Republicans are eating their own.","The Republicans are eating their own. They've got to be very careful. We have to bring things together.","Now I hear, \"If we -- \" not me, if we win, look at these fans. By the way, there are thou -- Look, look at this thing, it's packed this convention hall. Now, I wish I wish the cameras would spin around and show those upper decks where you can't even get on, but on top of that there are thousands of people outside.","I mean, they're -- they won't show it, unless -- Is there a protester in the room, please? The only way they turned the cameras is if there's a protest because that's like supposed to be a bad thing. I view protesters as a positive thing because then the cameras swing around.","That's the only reason you can stand there and force them. They won't touch those ca -- I don't think. You know what, for three rallies I had no protesters and nobody knew what was happening with these rallies. And I go home and my wife would say, \"Well, there are many people there.\" I say, \"Yeah. About 20,000.\" She said, \"Really?\" They never showed that.","They only show your face. Now I liked my face but I'd rather show the crowd.","I'd much rather show the crowd. So. We're going to win and we're going to win easily. But now I hear the establish -- Well you probably heard this, the establishment is saying very strongly and I can't imagine that if Trump wins -- Now if I win Florida and I have a big lead in Florida over a guy that never shows up to vote, Rubio, the guy never shows up to vote.","He's got the worst voting record almost in the history of the United States Senate.","Who the hell wants to vote for a guy like that? In addition, I watched him melt down under the stare of Chris Christie, who just endorsed me by the way, but -- and Senator Sessions, and Sarah Palin, and Jerry Falwell Jr, who's been so great. You know Jerry Falwell were leading with the evangelicals all over the country.","Leading big.","Because they don't want to vote for a liar. You have lying Ted Cruz. I call him, I nicknamed him lying. I say lying. And how would you spell that L-Y-E-N, with a big apostrophe. But you know you have lying Ted Cruz and he comes in he holds up the Bible and then he tells you exactly what I didn't say. All these guys.","I say something, I make it very clear, then they get on television, \"Donald Trump just said...\" And it's like totally different. I want to tell you something. I used to think that real estate people were tough especially in Manhattan their babies compared to these politicians. These politicians are liars.","I mean, you know it's funny, I mean, much tougher people over the years.","I've doubt, you know, the people I deal with a much tougher than the politicians. But nobody lives like a politician. Nobody, nobody. So anyway, what we've got to do is we've got to get out today. We've got a caucus. I'm going to go with you. We're going to caucus. And after making this huge U-turn to Kansas.","If I lose I'm going to be so angry at you.","Oh, and my friend, did you ever hear of Phil Ruthven -- Phil Ruffin? Now he's from Kansas, he's one of my best friends. He's the sweetest guy. He made a lot of money just by brainpower. Just a really smart guy great poker player, great everything, so smart. A real Kansas guy. And he's so proud of Kansas, he loves it. I called him up a few days ago said, \"Phil, good luck.","You're in charge of Kansas.\" Calls me up the next day says, \"Donald, you're doing well but you have to be here.\" I said, \"I'll be there.\" OK. So here I am. So here I am.","So I want to thank. I want to -- I have to do this. I want to thank Phil Ruffin and I want to thank all of my -- Mr. and Mrs. Ruffin too, by the way, she's fantastic. I want to thank all of my friends from Kansas, they have been working so --","","This was so sad. It took a whole 45 minutes before we realized it was a protest. I said, \"Don't worry let him keep protesting. He's got a very soft voice. Don't worry about it. Doesn't bother us. But look, we've got -- just so you understand we're going to strengthen our borders. We're going to build a wall.","Mexico's going to pay for the wall. We're going to re energize and rebuild our military with the right equipment not equipment that's bought because companies have political connections or we're putting stuff in there that they don't want. We're gonna use the stuff that the generals and the soldiers and that everybody wants.","You know we buy military equipment based on political connections.","If somebody has a plane and they're connected and then somebody else has a plane and they're not, but the one that doesn't that's not connected the planes are cheaper faster better maneuvers, better. We buy the lousy plane because of connections, not gonna happen anymore, folks. Not going to happen. You know, same thing with the drug industry we don't really essentially we don't beat our drugs we're the largest purchaser of drugs in the world.","Drugs to make you better. We're the largest purchaser of drugs in the world and we don't put it out because the drug companies, they have such a monopoly over these senators that we deal with. They don't beat it out. Whoever heard We'll save hundreds -- we'll save so much money. We'll save hundreds of millions of dollars billions of dollars by bidding.","We will start bidding procedures, folks.","We will save so much on waste fraud and abuse. I'm so good at contracts. You know, I'm building a hotel on Pennsylvania Avenue at the side of the old post office that I got, believe it or not, many peo -- over a hundred people bid. And when I say people, I mean the biggest companies in the world. The hardest thing that the GSA has ever had and I think the hottest bid.","The GSA is like the landlord for the United States government services, very professional people.","The old post office on Pennsylvania Avenue, right between the White House, right between the Capitol building and the White House, and it's under construction now. I got it. By the way, people were shocked that I got it but I got it. They were shocked because of the Obama. That tells you how good -- and I got it for two reasons: I had the most incredible and have the most incredible financial statement.","It's incredible because they want to make sure it gets built. They don't want to have it stuck. And I came up with a concept that's great. But here's the story. It's under budget and it's two years ahead of schedule, two years. Now think of that, two years ahead of schedule.","So we're going to open in September of this year it was supposed to be September of like two years from now because I'm really good at this stuff we're going to rebuild the infrastructure of our country.","We're going to rebuild the infrastructure and we're going to do it for a fraction of the cost and it's going to be better than what they were projecting. And we're going to save and we're going to -- OK we're going to reinvigorate our military. We're going to knock the hell out of ISIS. We've got to get rid of them.","They cut off heads. We've got to get rid of it. We're going to knock the hell -- they're not going to know what happened. We're going to knock the hell out. We're going to take care of our great veterans. Our veterans have been absolutely treated unfairly. We're getting rid of Common Core. We're bringing education locally.","We're one of the worst in the world in education. And we spend the most per pupil. So we're getting rid of Common Core. We're going to do it locally with love, with love, with love. And I've seen that. We're getting rid of Obamacare, it's a total disaster and it's being replaced. And we'll have great health care at a fraction of the cost.","You'll have your do -- all the lies that we're told to get Obamacare passed. And friends of mine are showing you your costs are going up 35, 45, 55%. In 17 it dies anyway, unless the Republicans extend it. These Republicans they keep extending. They keep giving the money to extend Obamacare to allow people to come into the country, to allow the Syrians to come in and we have no idea who they are.","So here's what we're going to do, right. Quiet. Don't worry about it. Sit down. Sit down.","Boy, did he get out fast. He's gone. You know it's amazing. He stood up. He started shouting. I said sit down and he sat down. Oh, that's OK. You can keep going. No thank you I appreciate it. Thank you, Mr. protester. I never saw a protester drop so fast. I said sit down. He sat down that was the end of the protest.","OK. Thank you. I like that protester. That's somebody we can reason with. All right. So look.","We are going to do things that are so great. You are going to be so proud of what you do today. I'm going to see you in a few minutes over at caucus but you will get -- and I -- I do wish you could just walk in this whole caucus system. I don't want to knock it because we're living with it right now.","But don't you like it when you have a vote. You walk in you press Trump, Trump, Trump, Trump and you leave. Instead of walking, oh, let's discuss it. Let's talk for a couple of hours. What a ridiculous system. But you know what. We got to live with it, right. We have to live with it. So get in there, do a job.","Hello. All right. Get him out. Thank you. Thank you. That's all right. He's he's another quiet one. I know how tough the people of Kansas. You are tough people. How come the protesters are so weak. What's going on? What's going on?","You know why? You know why they're weak? Because they know you're tough. That's why they're weak. OK. So we're going to do things you're going to be very proud. You're going to say in a couple of years from now that was one of the greatest mornings and one of the most important things I've ever done because you're going to see changes made.","We're no longer going to be the stupid country. We're no longer going to be the country that gives Iran a terror nation $150 billion and doesn't get anything. You're going to get your prisoners back four years early.","You're not going to have deals. We're not going to pay them 150 billion. We're not going to pay them anything. That's the kind of jobs we're going to make. We're going to make real deals. We're not going to make -- We're not going to make a deal where we give over a dirty-rotten trade or we get him and they get five of the people terrorists that they most covet.","Sergeant Bergdahl, OK. We're not making deals where five people were killed going after Sergeant Bergdahl. Five wonderful, young people killed going after him and he was a deserter. And we take Bergdahl and they get five people, not one person, they get five people that they most wanted anywhere, anywhere, anywhere, okay.","Not going to happen. These stupid deals aren't going to happen anymore, folks. OK. And let me tell you, if I have a guy like Phil Ruffin, you know, Phil Ruffin is great. If I have a guy like Phil Ruffin one of your own. Believe me you should be very proud of him. I'll have him. Let's say, \"Phil, do me a favor.","Look over the trade deal with Japan. They're sending millions of cars. They take practically nothing from us. There's a trade imbalance that's massive. Do me a favor Phil. look it over.\" You know what, folks. Go to sleep at night. You're going to be well protected. We're not using -- We're not going to use our hacks.","We're not going to use political hacks to negotiate the biggest deals. The other thing is, Carl Icahn, many of the great -- Phil's another one, but Carl Icahn. Many of the greatest business leaders in the country have endorsed me.","They say Trump's the only one that knows what he's doing. We're losing companies. We're losing companies. A company like Pfizer is leaving. Pfizer, massive pharmaceutical company. They're leaving the United States and moving to Ireland. We're losing many. It's called corporate inversion. The politicians I don't even think they ever heard the words.","OK. I don't think they ever heard the word, so we're losing.","Forget about -- we're not going to let him go. Carrier. Carrier air conditioners said they're moving to Mexico. Nabisco, moving to Mexico. Ford, moving to Mexico. Mexico is the new China. Not going to happen. Carrier just announced. I will tell Carrier, \"Good luck in Mexico but every air conditioning unit that you make, you're going to pay a 35% tax when you move it back into this country.\"","The hell with no taxes, folks. To hell with these guys and I'm a conservative guy but the hell with these conservative guys who say free trade. \"Trump doesn't believe in free trade.\" I believe in free trade more than they do. But I also believe in smart trade and fair trade. And it's not fair.","With China, we have a trade imbalance. Think of this, $505 billion a year. OK. Now that's not free trade. Because you want to do business? Try it. You people know. Some of you know. Try selling a product in China. You can't do it. You can't get your product in. And if you do, you have to pay a massive tax.","With us they send it in no tax, no nothing. That's dumb trade.","We're not going to have that anymore. That's why there's such a trade imbalance and we can't have that anymore. When I say Mexico's paying for the wall, I mean it. There's a 58-billion-dollar imbalance in their favor, of course. Because it's always in the other countries. We don't have wins at any level.","There's a 58 -- Now I'm going to say the wall is going to cost if I do it because I'll be under budget ahead of schedule always.","But look. The wall's going to cost $10 billion. That's what the wall's going to cost, $10 billion. That's what it's going to cost. Sounds like a lot of money. Really not that much. Oh, it's going to get tall. It's going to be very tall. And every time Mexico protested it's going to gain another 10 feet. OK.","He said that. You saw the president of Mexico the other day throw out the f-bomb if I ever did that. Give me the electric chair. OK. Nobody even talks about it. But you know what I didn't like? One thing I didn't like, he said, \"We will not pay for the wall.\" In other words, now he's accepted the wall. Because a few months ago they said, \"We will not allow a wall.\" Well now they said we won't pay for it. You see so we made progress.","So now they know the wall's going to happen. So now he's going to say, We won't pay for that F, you know, the wall.\" at wall but he used the word I didn't.","I'll probably get more publicity even for doing this. You know when I do this, you know what they do? They go bleep. And everyone thinks I used the word. That's what happened last time. I said we're not going to pay for the. And I went like that, quiet, and they go, the dishonest press, most dishonest people in the world.","They go bleep. And I got calls, \"Don, you shouldn't use foul language.\"","I said I didn't but they bleep you out. So now you're here that you said nothing. These are really dishonest people. OK. So what happens now. Vicente Fox, the ex-president, was so angered that he used the F bomb. Right? Nobody said anything about that. But what I really noticed is his anger was incredible.","Not at the fact that the wall is being built not at the fact that way -- but you know where his anger was? That the fact that the United States would actually be tough with Mexico for a change. He couldn't believe it. How dare they talk to us that way. How dare they talk about the wall. This guy was insensi -- Anyway, look we're going to have a better relationship with Mexico than we do now.","Remember Sergeant Tahmooressi? They kept him for so long. They should've let him. We never even made a phone call. They had him in the worst prison. He shouldn't have been there. We -- China shouldn't be building a massive military place in the middle, right in the middle of the South China Sea. So they make a fortune.","They have no respect for us.","They're going to make out a lot less and they're going to like us a lot more, you watch. That's what I do. That's what I do. That's what I do. So you are going to go -- You are going to caucus. We are going to win. You're going to say that was one of the great mornings of your life. And in two years, three years, and four years you're going to say, \"Wow, has our country changed for the better.\"","You're going to say and you're going to see that our country will be the smart country. It will make the smart deals. We have to become rich again to be great -- come great again. A woman told me, \"Mr. Trump I don't like it when you say our country is going to become rich again.\"","I'd say, you know, what a beautiful woman very nice woman she said, \"I really -- I love you, Mr. Trump, I'm voting for you but you should leave the rich again.\" I said, \"I can't do that because unless we're going to become rich again we can never become great again.\" We're a debtor nation. We have no money.","We owe all this money, we have no money and we can't afford to have Germany, Japan, South Korea, Saudi Arabia was making a billion dollars a day. Now they're making half. Still a -- and we we take care of their military. Why aren't they helping us out. They got to help us. They got to help us. So just watch.","Do me a favor. Just relax. I'll take care of all of this stuff. You have one thing to do. You have one thing to do. Go out and caucus and you're going to see us win, win, win.","We're going to win with the military. You watch. And I hope that thousands of people that are outside trying to get in can hear this. You're going to win with the military. You're going to win on health care. You're going to win with education. We have to have great education. We have horrible education.","You're going to win with education. Our vets are going to be big winners, we're going to take care of our vets finally.","All these politicians for 20 years they're not helping. We're going to help the vets. All they do is spend money. It's a corrupt organization. The Veterans Administration is a corrupt organization and incompetently run, except for themselves. So we are going to take care of our vets and we're going to take care of trade.","We're going to get rid of these horrible trade deals that are being left at all over the world.","These countries -- I have so many friends in China I have so many friends in Mexico. They can't believe they get away with it. We're going to end it and we're going to end drugs pouring in through our southern border.","And let me tell you, New Hampshire we had a tremendous victory in New Hampshire, and I told the people of New Hampshire they have a tremendous problem with heroin and drugs. I said, \"I am going to take care.\" That was such an amazing victory, they're such incredible people. The first thing they mentioned all the time is heroin.","And number one, you wouldn't think with New Hampshire. So beautiful. Heroin. I said we are going to stop it. We are going to get rid of that. We are going to help your kids get better. They have so many addicted young people and people generally. We are going to do something for the people of New Hampshire and the people of the country.","We are going to stop the drugs from flowing in like it's water. OK. It's not going to happen anywhere, folks. So we're going to win. And we're going to win so much. You may, I jokingly say, \"You may say, please, please, Mr. Perry, we just can't stand it anymore. We're winning too much.\" We're winning with the military we're going to knock out ISIS.","We're winning with trade. We're winning with health care. \"Mr. President we can't stand. We're winning too much.\" And I'm going to say, \"I don't care whether I keep winning. We're going to make America great again.\"","I love you, folks. Go over. I'll see you over there. Go, go, go, caucus. We're going to be very proud of this morning. I love you. Thank you. Thank you. Thank you."],"text":" So I wanted to be in Kansas. I wanted to be here so badly, so I headed into another direction. I told the pilot, \"We're going to Kansas, just get there.\" Now, we don't have much time this morning because in a few minutes we're got go over in caucus. Who's got the right to caucus? Who's got the right to vote? Your hand. Good. Good. Good. Well I'm going over with you. OK. We're all going together. This is the movement, folks. It's never been anything like this. They're all saying, \"This isn't coming from Donald Trump. This is coming from Time magazine and everything else.\" We're on the cover numerous times over the last couple of months. I never thought -- took me to -- it took me like 30 years to be on the cover of Time twice. Now I've done it four times in the last three months so something's happening, right? Something's happening. This is better than real estate. This is more fun. But look we've got to do the right thing. CNN just came out with a poll two days ago, 49% for Trump, next was Cruz and Rubio. Lying Ted and little Marco. The -- These are not -- this is not presidential material, folks, believe me. So look, look. We've got to make America great again. We've got to -- we've got to make America great again. It's very simple. Look he's got a sign. \"Show him your hands, Mr. Trump.\" My hands, look at these hands. These hands hit a golf ball 285 yards. Look at these hands. These politicians, such liars, liars. I guess when I made this statement about him being a lightweight he said, \"Ah, let's see. What's wrong with Trump? What's wrong? Let me think about something. Ah, maybe he's got a small hands. He's got small hands.\" They lie. So anyway, look, all kidding aside, our country is in trouble. We are $19 trillion, nobody even knows what that means. It means so much, you can take top people. Top top people they don't know what it means. And it's just beyond. They just signed the worst budget deal I've ever seen, the worst. And we're going to change things so badly, went so quickly, it's going to go so fast, and you're going to be so proud, you're going to be so proud of your country again, you're going to be proud of your president. And it's not me. I'm like the messenger, we're all together, we're all together. I'm telling you, I've so many articles. What we've done is very unique because the Republicans were for, you know, decades, decades. They made a tremendous mistake when you chose Mitt Romney four years ago. He was a disastrous again today, no energy, no life, no nothing. He's a stiff. OK. Just a stiff guy. He was. He was, he was a loser. And then he comes out. You know if he would have devoted the same energy four years ago to running for president, him and his third great campaign manager, I steal my television all the time. Where was he four years ago when Obama was doing Jay Leno, when Obama was doing David Letterman and oh, Romney was looking for a zone change to get a nine car garage built? OK. Where was this guy? So look. It's -- it's the establishment -- the establishment is against us. The press back there is against us. Although some of it's coming around, I must tell you. I read a couple of articles this morning. I read a couple of articles this morning, folks, they're coming around. By the way, polls show that I beat Hillary Clinton. Many polls show that I beat Hillary. You know, these guys they like to say, \"Well, Donald Trump will never beat Hillary Clinton.\" I watch him on television. I'm watching FOX, I'm watching CNN, I'm watching MS, and I'm watching television and say, \"Well, Donald Trump will never ever beat Hillary.\" The polls are showing that I beat her. I haven't even started on her yet. I haven't even started. You know, I wasn't supposed to beat Jeb Bush. He was established man. He was the one that was getting it. I spew all of his supporters on television saying, \"Donald Trump will not win.\" Well what happened to that candidate. OK. It's unbelievable. No, don't -- this is so, so foolish. You know the Republicans are eating their own. The Republicans are eating their own. They've got to be very careful. We have to bring things together. Now I hear, \"If we -- \" not me, if we win, look at these fans. By the way, there are thou -- Look, look at this thing, it's packed this convention hall. Now, I wish I wish the cameras would spin around and show those upper decks where you can't even get on, but on top of that there are thousands of people outside. I mean, they're -- they won't show it, unless -- Is there a protester in the room, please? The only way they turned the cameras is if there's a protest because that's like supposed to be a bad thing. I view protesters as a positive thing because then the cameras swing around. That's the only reason you can stand there and force them. They won't touch those ca -- I don't think. You know what, for three rallies I had no protesters and nobody knew what was happening with these rallies. And I go home and my wife would say, \"Well, there are many people there.\" I say, \"Yeah. About 20,000.\" She said, \"Really?\" They never showed that. They only show your face. Now I liked my face but I'd rather show the crowd. I'd much rather show the crowd. So. We're going to win and we're going to win easily. But now I hear the establish -- Well you probably heard this, the establishment is saying very strongly and I can't imagine that if Trump wins -- Now if I win Florida and I have a big lead in Florida over a guy that never shows up to vote, Rubio, the guy never shows up to vote. He's got the worst voting record almost in the history of the United States Senate. Who the hell wants to vote for a guy like that? In addition, I watched him melt down under the stare of Chris Christie, who just endorsed me by the way, but -- and Senator Sessions, and Sarah Palin, and Jerry Falwell Jr, who's been so great. You know Jerry Falwell were leading with the evangelicals all over the country. Leading big. Because they don't want to vote for a liar. You have lying Ted Cruz. I call him, I nicknamed him lying. I say lying. And how would you spell that L-Y-E-N, with a big apostrophe. But you know you have lying Ted Cruz and he comes in he holds up the Bible and then he tells you exactly what I didn't say. All these guys. I say something, I make it very clear, then they get on television, \"Donald Trump just said...\" And it's like totally different. I want to tell you something. I used to think that real estate people were tough especially in Manhattan their babies compared to these politicians. These politicians are liars. I mean, you know it's funny, I mean, much tougher people over the years. I've doubt, you know, the people I deal with a much tougher than the politicians. But nobody lives like a politician. Nobody, nobody. So anyway, what we've got to do is we've got to get out today. We've got a caucus. I'm going to go with you. We're going to caucus. And after making this huge U-turn to Kansas. If I lose I'm going to be so angry at you. Oh, and my friend, did you ever hear of Phil Ruthven -- Phil Ruffin? Now he's from Kansas, he's one of my best friends. He's the sweetest guy. He made a lot of money just by brainpower. Just a really smart guy great poker player, great everything, so smart. A real Kansas guy. And he's so proud of Kansas, he loves it. I called him up a few days ago said, \"Phil, good luck. You're in charge of Kansas.\" Calls me up the next day says, \"Donald, you're doing well but you have to be here.\" I said, \"I'll be there.\" OK. So here I am. So here I am. So I want to thank. I want to -- I have to do this. I want to thank Phil Ruffin and I want to thank all of my -- Mr. and Mrs. Ruffin too, by the way, she's fantastic. I want to thank all of my friends from Kansas, they have been working so -- This was so sad. It took a whole 45 minutes before we realized it was a protest. I said, \"Don't worry let him keep protesting. He's got a very soft voice. Don't worry about it. Doesn't bother us. But look, we've got -- just so you understand we're going to strengthen our borders. We're going to build a wall. Mexico's going to pay for the wall. We're going to re energize and rebuild our military with the right equipment not equipment that's bought because companies have political connections or we're putting stuff in there that they don't want. We're gonna use the stuff that the generals and the soldiers and that everybody wants. You know we buy military equipment based on political connections. If somebody has a plane and they're connected and then somebody else has a plane and they're not, but the one that doesn't that's not connected the planes are cheaper faster better maneuvers, better. We buy the lousy plane because of connections, not gonna happen anymore, folks. Not going to happen. You know, same thing with the drug industry we don't really essentially we don't beat our drugs we're the largest purchaser of drugs in the world. Drugs to make you better. We're the largest purchaser of drugs in the world and we don't put it out because the drug companies, they have such a monopoly over these senators that we deal with. They don't beat it out. Whoever heard We'll save hundreds -- we'll save so much money. We'll save hundreds of millions of dollars billions of dollars by bidding. We will start bidding procedures, folks. We will save so much on waste fraud and abuse. I'm so good at contracts. You know, I'm building a hotel on Pennsylvania Avenue at the side of the old post office that I got, believe it or not, many peo -- over a hundred people bid. And when I say people, I mean the biggest companies in the world. The hardest thing that the GSA has ever had and I think the hottest bid. The GSA is like the landlord for the United States government services, very professional people. The old post office on Pennsylvania Avenue, right between the White House, right between the Capitol building and the White House, and it's under construction now. I got it. By the way, people were shocked that I got it but I got it. They were shocked because of the Obama. That tells you how good -- and I got it for two reasons: I had the most incredible and have the most incredible financial statement. It's incredible because they want to make sure it gets built. They don't want to have it stuck. And I came up with a concept that's great. But here's the story. It's under budget and it's two years ahead of schedule, two years. Now think of that, two years ahead of schedule. So we're going to open in September of this year it was supposed to be September of like two years from now because I'm really good at this stuff we're going to rebuild the infrastructure of our country. We're going to rebuild the infrastructure and we're going to do it for a fraction of the cost and it's going to be better than what they were projecting. And we're going to save and we're going to -- OK we're going to reinvigorate our military. We're going to knock the hell out of ISIS. We've got to get rid of them. They cut off heads. We've got to get rid of it. We're going to knock the hell -- they're not going to know what happened. We're going to knock the hell out. We're going to take care of our great veterans. Our veterans have been absolutely treated unfairly. We're getting rid of Common Core. We're bringing education locally. We're one of the worst in the world in education. And we spend the most per pupil. So we're getting rid of Common Core. We're going to do it locally with love, with love, with love. And I've seen that. We're getting rid of Obamacare, it's a total disaster and it's being replaced. And we'll have great health care at a fraction of the cost. You'll have your do -- all the lies that we're told to get Obamacare passed. And friends of mine are showing you your costs are going up 35, 45, 55%. In 17 it dies anyway, unless the Republicans extend it. These Republicans they keep extending. They keep giving the money to extend Obamacare to allow people to come into the country, to allow the Syrians to come in and we have no idea who they are. So here's what we're going to do, right. Quiet. Don't worry about it. Sit down. Sit down. Boy, did he get out fast. He's gone. You know it's amazing. He stood up. He started shouting. I said sit down and he sat down. Oh, that's OK. You can keep going. No thank you I appreciate it. Thank you, Mr. protester. I never saw a protester drop so fast. I said sit down. He sat down that was the end of the protest. OK. Thank you. I like that protester. That's somebody we can reason with. All right. So look. We are going to do things that are so great. You are going to be so proud of what you do today. I'm going to see you in a few minutes over at caucus but you will get -- and I -- I do wish you could just walk in this whole caucus system. I don't want to knock it because we're living with it right now. But don't you like it when you have a vote. You walk in you press Trump, Trump, Trump, Trump and you leave. Instead of walking, oh, let's discuss it. Let's talk for a couple of hours. What a ridiculous system. But you know what. We got to live with it, right. We have to live with it. So get in there, do a job. Hello. All right. Get him out. Thank you. Thank you. That's all right. He's he's another quiet one. I know how tough the people of Kansas. You are tough people. How come the protesters are so weak. What's going on? What's going on? You know why? You know why they're weak? Because they know you're tough. That's why they're weak. OK. So we're going to do things you're going to be very proud. You're going to say in a couple of years from now that was one of the greatest mornings and one of the most important things I've ever done because you're going to see changes made. We're no longer going to be the stupid country. We're no longer going to be the country that gives Iran a terror nation $150 billion and doesn't get anything. You're going to get your prisoners back four years early. You're not going to have deals. We're not going to pay them 150 billion. We're not going to pay them anything. That's the kind of jobs we're going to make. We're going to make real deals. We're not going to make -- We're not going to make a deal where we give over a dirty-rotten trade or we get him and they get five of the people terrorists that they most covet. Sergeant Bergdahl, OK. We're not making deals where five people were killed going after Sergeant Bergdahl. Five wonderful, young people killed going after him and he was a deserter. And we take Bergdahl and they get five people, not one person, they get five people that they most wanted anywhere, anywhere, anywhere, okay. Not going to happen. These stupid deals aren't going to happen anymore, folks. OK. And let me tell you, if I have a guy like Phil Ruffin, you know, Phil Ruffin is great. If I have a guy like Phil Ruffin one of your own. Believe me you should be very proud of him. I'll have him. Let's say, \"Phil, do me a favor. Look over the trade deal with Japan. They're sending millions of cars. They take practically nothing from us. There's a trade imbalance that's massive. Do me a favor Phil. look it over.\" You know what, folks. Go to sleep at night. You're going to be well protected. We're not using -- We're not going to use our hacks. We're not going to use political hacks to negotiate the biggest deals. The other thing is, Carl Icahn, many of the great -- Phil's another one, but Carl Icahn. Many of the greatest business leaders in the country have endorsed me. They say Trump's the only one that knows what he's doing. We're losing companies. We're losing companies. A company like Pfizer is leaving. Pfizer, massive pharmaceutical company. They're leaving the United States and moving to Ireland. We're losing many. It's called corporate inversion. The politicians I don't even think they ever heard the words. OK. I don't think they ever heard the word, so we're losing. Forget about -- we're not going to let him go. Carrier. Carrier air conditioners said they're moving to Mexico. Nabisco, moving to Mexico. Ford, moving to Mexico. Mexico is the new China. Not going to happen. Carrier just announced. I will tell Carrier, \"Good luck in Mexico but every air conditioning unit that you make, you're going to pay a 35% tax when you move it back into this country.\" The hell with no taxes, folks. To hell with these guys and I'm a conservative guy but the hell with these conservative guys who say free trade. \"Trump doesn't believe in free trade.\" I believe in free trade more than they do. But I also believe in smart trade and fair trade. And it's not fair. With China, we have a trade imbalance. Think of this, $505 billion a year. OK. Now that's not free trade. Because you want to do business? Try it. You people know. Some of you know. Try selling a product in China. You can't do it. You can't get your product in. And if you do, you have to pay a massive tax. With us they send it in no tax, no nothing. That's dumb trade. We're not going to have that anymore. That's why there's such a trade imbalance and we can't have that anymore. When I say Mexico's paying for the wall, I mean it. There's a 58-billion-dollar imbalance in their favor, of course. Because it's always in the other countries. We don't have wins at any level. There's a 58 -- Now I'm going to say the wall is going to cost if I do it because I'll be under budget ahead of schedule always. But look. The wall's going to cost $10 billion. That's what the wall's going to cost, $10 billion. That's what it's going to cost. Sounds like a lot of money. Really not that much. Oh, it's going to get tall. It's going to be very tall. And every time Mexico protested it's going to gain another 10 feet. OK. He said that. You saw the president of Mexico the other day throw out the f-bomb if I ever did that. Give me the electric chair. OK. Nobody even talks about it. But you know what I didn't like? One thing I didn't like, he said, \"We will not pay for the wall.\" In other words, now he's accepted the wall. Because a few months ago they said, \"We will not allow a wall.\" Well now they said we won't pay for it. You see so we made progress. So now they know the wall's going to happen. So now he's going to say, We won't pay for that F, you know, the wall.\" at wall but he used the word I didn't. I'll probably get more publicity even for doing this. You know when I do this, you know what they do? They go bleep. And everyone thinks I used the word. That's what happened last time. I said we're not going to pay for the. And I went like that, quiet, and they go, the dishonest press, most dishonest people in the world. They go bleep. And I got calls, \"Don, you shouldn't use foul language.\" I said I didn't but they bleep you out. So now you're here that you said nothing. These are really dishonest people. OK. So what happens now. Vicente Fox, the ex-president, was so angered that he used the F bomb. Right? Nobody said anything about that. But what I really noticed is his anger was incredible. Not at the fact that the wall is being built not at the fact that way -- but you know where his anger was? That the fact that the United States would actually be tough with Mexico for a change. He couldn't believe it. How dare they talk to us that way. How dare they talk about the wall. This guy was insensi -- Anyway, look we're going to have a better relationship with Mexico than we do now. Remember Sergeant Tahmooressi? They kept him for so long. They should've let him. We never even made a phone call. They had him in the worst prison. He shouldn't have been there. We -- China shouldn't be building a massive military place in the middle, right in the middle of the South China Sea. So they make a fortune. They have no respect for us. They're going to make out a lot less and they're going to like us a lot more, you watch. That's what I do. That's what I do. That's what I do. So you are going to go -- You are going to caucus. We are going to win. You're going to say that was one of the great mornings of your life. And in two years, three years, and four years you're going to say, \"Wow, has our country changed for the better.\" You're going to say and you're going to see that our country will be the smart country. It will make the smart deals. We have to become rich again to be great -- come great again. A woman told me, \"Mr. Trump I don't like it when you say our country is going to become rich again.\" I'd say, you know, what a beautiful woman very nice woman she said, \"I really -- I love you, Mr. Trump, I'm voting for you but you should leave the rich again.\" I said, \"I can't do that because unless we're going to become rich again we can never become great again.\" We're a debtor nation. We have no money. We owe all this money, we have no money and we can't afford to have Germany, Japan, South Korea, Saudi Arabia was making a billion dollars a day. Now they're making half. Still a -- and we we take care of their military. Why aren't they helping us out. They got to help us. They got to help us. So just watch. Do me a favor. Just relax. I'll take care of all of this stuff. You have one thing to do. You have one thing to do. Go out and caucus and you're going to see us win, win, win. We're going to win with the military. You watch. And I hope that thousands of people that are outside trying to get in can hear this. You're going to win with the military. You're going to win on health care. You're going to win with education. We have to have great education. We have horrible education. You're going to win with education. Our vets are going to be big winners, we're going to take care of our vets finally. All these politicians for 20 years they're not helping. We're going to help the vets. All they do is spend money. It's a corrupt organization. The Veterans Administration is a corrupt organization and incompetently run, except for themselves. So we are going to take care of our vets and we're going to take care of trade. We're going to get rid of these horrible trade deals that are being left at all over the world. These countries -- I have so many friends in China I have so many friends in Mexico. They can't believe they get away with it. We're going to end it and we're going to end drugs pouring in through our southern border. And let me tell you, New Hampshire we had a tremendous victory in New Hampshire, and I told the people of New Hampshire they have a tremendous problem with heroin and drugs. I said, \"I am going to take care.\" That was such an amazing victory, they're such incredible people. The first thing they mentioned all the time is heroin. And number one, you wouldn't think with New Hampshire. So beautiful. Heroin. I said we are going to stop it. We are going to get rid of that. We are going to help your kids get better. They have so many addicted young people and people generally. We are going to do something for the people of New Hampshire and the people of the country. We are going to stop the drugs from flowing in like it's water. OK. It's not going to happen anywhere, folks. So we're going to win. And we're going to win so much. You may, I jokingly say, \"You may say, please, please, Mr. Perry, we just can't stand it anymore. We're winning too much.\" We're winning with the military we're going to knock out ISIS. We're winning with trade. We're winning with health care. \"Mr. President we can't stand. We're winning too much.\" And I'm going to say, \"I don't care whether I keep winning. We're going to make America great again.\" I love you, folks. Go over. I'll see you over there. Go, go, go, caucus. We're going to be very proud of this morning. I love you. Thank you. Thank you. Thank you."}