{"id":433,"author":"Donald Trump","title":"Speech: Donald Trump Delivers a Speech in Orlando","date":"2016-03-05","link":"https://factba.se/transcript/donald-trump-speech-orlando-fl-march-5-2016","paragraphs":["We're going to be the smart people. We're not going to let our politicians destroy our country. We're not going to let it happen. We're not going to let it happen. And you know, I talk about Little Marco Rubio, he's a total disaster. He's a disaster. He's a nasty guy, said nasty things, and you know, we hit him hard.","We hit him hard. Little nasty guy. He even complained about my hands. Look at those hands, look at those hands. Look at that. You know, I hit him only in response to him. You know, I always am a counterpuncher, right? Only in response to him. And he's looking, I said, what can I say? What can I say? Well, maybe I'll say, oh, he's got small hands.","Look at those. I mean, give me a break, OK? Where did he get that one? That was the first. I'm saying to myself, where did that one come from, right? But you know, the problem was I was shaking hands with people about two days, three days later and they're all saying, geez, Mr. Trump, you actually have large and strong hands.","I said yeah. So I did want to get the word out, folks, you know. I didn't want to go the rest of my life having everyone say I have small hands. I've heard of worse things but who needs it, right? I want to thank you all, really. I mean, it's amazing, this crowd. Look at that, all the way up to the rafters, all the way up. Unbelievable.","Unbelievable. Unbelievable. And the fire marshal, you know, we have thousands of people outside, we've lost about 10,000 people. They've had to leave but we still have thousands of people. And I think because the police are so incredible. We love our police. And your fire departments and everything, they're going to try and let another few hundred people come right up here.","I said, don't worry about it. We're not going to have any problems, OK? So we're going to fill it in and it's great. You know, the one I work on most when I go to a site are fire marshals. They're my most important people because they're the ones that let us pack. You know, nobody has crowds like we do, nobody.","And you take a look today. Here's a day -- now in all fairness to you, right now I'm supposed to be at the Cadillac World Golf Championships at Trump National Doral, and I'm here, I'm here. And I just left Rory -- actually I just left Kansas and hopefully we'll do well in Kansas and Kentucky. And you know, I have a list.","Look at this, New Hampshire, we won; South Carolina, we won; Nevada, Nevada, we won in a massive landslide. That was supposed to be for lying Ted Cruz, lying Ted. He holds up the Bible and then he puts it down and he lies. I don't like that. And you know what, that's why I'm winning virtually every category with the Evangelicals who I love.","And you heard today Paula White, who is fantastic and I appreciate Paula's being here. But Pastor Paula White was so great. And you know, Jerry Falwell Jr. from Liberty University was so great to me. And he doesn't endorse people, he doesn't do it, but he felt this was important. And remember this, every one of the candidates goes to Liberty.","They all go to Liberty. They speak -- when he endorsed me, that was a great, great thing. All right. So we won, we won Nevada big. We won Georgia in a landslide. We won Tennessee really big. We won Alabama in a massive landslide. We won -- Vermont was incredible. Vermont, everybody thought that would be Marco.","Marco didn't even show up. By the way, he doesn't show up to vote for the Senate. He doesn't show up, so why the hell should he show up to Vermont, right? Yeah. We won Virginia. We won Arkansas. We won Massachusetts. Many polls have come out that I easily beat Hillary Clinton. And I want to tell you, you know, you don't hear that on television.","You watch these dishonest pundits. Well, Trump can't win the general election. We will beat her so badly, folks, we will beat her so badly. I used to listen to Jeb Bush before he flamed out, and they'd say, Donald Trump cannot beat Hillary Clinton. And I said, well, why can't you beat me, right? He got nothing.","Low energy, low energy. And his people are now on television fighting me, saying, we have to stop Donald Trump. He's not going to beat Hillary Clinton. They worked for Jeb Bush. And I say to my people, you know, I have these debaters, right? And they say, why don't you just say you work for Jeb Bush and that they were terrible?","But I see it all the time. We're going to beat Hillary. And I'll tell you something, the one person that Hillary doesn't want to run against, I will tell you this, is Donald Trump. That I could tell you. That I can tell you. And it's amazing, I watched it the other day where little Marco was going, well, Donald will not win.","I mean, this guy's got so many problems. I don't think he'll come close to winning his own state. How would you like to be this? I'm 21 points up now. I happen to love Florida, in all fairness. Truly, truly my second home. I'm here all the time, as you know, all the time. I love this area, by the way, but I'm here all the time.","I've done many, many jobs in Miami with Related and with Jorge Prez, and with you know, Gil Dezer and Michael Dezer. We've had great success. And we've had many of the buildings on the Miami, we have a lot of stuff. And it's been great. And as you know, Doral and in Jupiter we did a big job, very, very successful.","And in West Palm Beach, we did the big, big job, very, very successful. And the Mar-a-Lago Club and many more. And in fact, tonight, we're having our news conference. Hopefully it'll be a victory conference in West Palm Beach, in West Palm Beach. See, with all the places I could pick, I picked Florida. I want to pick Florida.","So we all love. But I hear these people and they talk about the general election. Look, the general election is very important, but I'm the one that's going to beat her. And I will say this, the one person that she does not want to run against is Trump. You know, she got a dose, I didn't. I haven't even, folks, I'm beating her in many polls.","I'm beating her in many polls, and I haven't even started yet. I haven't started with her yet. Only once, only once. Four weeks ago, she said something about me being sexist, remember? And I'll tell you, the press treated me very unfairly because right after she said that, I attacked her and Bill, and Bill -- we talked about the word, we came up to the word enabler.","You know what an enabler is? And we talked about Bill. I said, you mean to tell me I'm bad but her husband's, OK? Maybe one of the worst in the history of politics, right? And I had to put up -- OK. This was a disaster for them. I guarantee you, they had one of the worst weekends of their life. This was -- this was not a friendly weekend that they had sitting together at home, wherever they are at home if they were together.","So here's the story. So here's the story. Here's a story. We can't play games. Our is in deep trouble. We have to beat her. It looks like she's going to make it. Bernie is gone. Bernie's gone, regardless. Bernie, Bernie is -- Bernie had his time. You know, he had his time in the sun and I watch -- I've seen this so often with politicians.","They blow it. What happens, he had his time in the sun, he was doing great. And then they asked him the question about emails a month and a half ago, right? And he said, I'm tired of them discussing it, like, in other words, they shouldn't be discussing it. And I said, bye-bye Bernie, you just blew the election.","And I was right. But when I attacked Hillary six weeks ago, people don't realize this, and the press gave me zero and I want credit, do you understand? You are the most dishonest human beings on earth, the most. They are disgusting, dishonest human beings. And I'll tell you, well, not all of them. Actually, amazingly, because I'm no fan of the New York Times, I had a front-page story today in The New York Times, was a phenomenal story.","I can't believe it. Get them out of here. Get them out, right? We had an amazing, amazing story today on the front page. I'm going to have to be nicer to the New York Times, you know. They give me all bad stuff then I attack. Today was really amazing because somebody said in this story that there's been nothing like has happened with this movement in the United States for over 100 years.","Can you imagine? Over 100 years. And it's true, no matter where we go, we're packed. We have the biggest audiences, the biggest crowds, by far. I must tell you, Bernie was second, a distant second, but Bernie was second. Where are these people? Come on, get them out fast. We want speed. Oh, there he is. Look, a little wise guy, a little wise guy.","Lot of guts, a lot of guts. I wonder who sent him in. You know, they send them in, by the way. It's very -- but I love, I love my protesters because these guys never move the cameras. I said it all the time. I called my wife, Melania, by the way, she's done a great job on television lately, right? Well, she'd be a great and very beautiful first lady, right?","And she's very, very smart and she's got a big heart. I will tell you, she's got a great heart. But I love my protesters because I'll go home and I'll see Melania say, how did you like the crowd? Didn't see the crowd. What do you mean you didn't see it? I Heard it. You know, when you hear this crowd, you know there's a lot of people.","Can you imagine where we had to have over 10,000 people not come in today. But I promised I'm going to come back. None of you can come here when I come back. None of you. Were going to let the -- OK? I also know you got here at six o'clock in the morning, many of you. So pretty amazing but we're going to come back.","But can you imagine, I'd go home and I'll say, did you see the size of that crowd? We filled up Dallas. You know, the -- Mark Cuban the Dallas Mavericks are a wonderful team. They have a beautiful stadium. I spoke with Mark, I said, you know what, that would be good. He said you'd fill it up fast. We took it over on Thursday, we filled it up on Monday, 21,000 people.","Nobody knew. And the reason they didn't know, number one, the reporters don't want to report it. They don't want to say -- they had a case where Bernie, they had a press -- it's unbelievable. That's why I like my protesters. The only time they move the camera if there's a protester up on the top in the rafters.","They'll move it because it's a negative thing in their mind. It's actually very positive. But you know, I'll tell you what, we have a thing going on here that's incredible. There hasn't been anything like it. The biggest story in politics which really isn't talked about as much as it should be is voter turnout during the primaries.","50% up, 60% up, in some cases 100-percenter. There it is, cameras. Look up there, camera. Look up there at the protester, camera. USA. USA. USA. Are the Trump rallies the greatest? Are they the greatest? You know what, little Marco has the rally when they get 300 people, 200 people.","It's fine. I'm not knocking it. But that's sort of a normal thing. This is not a normal situation, folks, this is not a normal situation. So -- so it's been an amazing period of time for me. You know, on June 16, I took a deep breath. This is not something that's so easy. I want to say. I took a deep breath.","I came down the escalator with Melania. I said, let's go. We have to straighten out. Get out of here. Get out, out, out. Go home to mommy. So why is it that that young lady can use filthy, disgusting language and they won't report that? And if I say something in fun that's not even bad, I end up on the front page of every paper in the world, OK? You think that's fair?","She's disgusting. She's disgusting. It reminds me of this weekend, this last weekend, the former President of Mexico, right? Vicente Fox We will build the wall, don't worry. We will build the wall. We will build the wall, and who is going to pay for the wall? Who? You better believe it, they're going to pay for the wall.","You know, we have a trade deficit with Mexico of $58 billion, $58 billion. And these politicians, lying Ted Cruz and little Marco Rubio, they cut -- who, actually he's not bad because he never shows up anywhere. I don't know what the hell -- what does he do with all his free time? He's got the highest delinquency record in the United States Senate in many, many years.","It could be decades, OK? That is not the kind of person you want representing Florida. That's not the deal you made. You know, I built an incredible company. Look, just in Florida you know what I have. I got -- went over it all along the beach, Doral, Mar-a-Lago, all these things. And I built -- and I have to listen to this guy, a lightweight, a total lightweight, say, Donald Trump is con.","I file financial papers that show I'm worth over $10 billion and I don't say that bragging, folks, I don't it bragging. Some of the greatest assets in the world, great buildings, Trump Tower, 40 Wall Street, 1290 Avenue, the America's big chunk, Bank of America buil -- all of this stuff, all of this stuff.","Don't worry, get him out. They're quiet, they don't have much of a voice. And then I have to listen to this lightweight, say, I'm a con man. I can't -- nobody's ever called me a con man before. That's a horrible thing. Then when I hit him back, they say, Donald Trump was very rough. That was not good. But let me tell you, did I kill him in the debate the other night?","One of the big announcers said, and it was very interesting, they said, Donald got in his head. He was really off that Donald got in his head. And, not me, we, we won every single poll as to who won the debate the other night. Every single poll. Drudge, Drudge had us at almost 70% about every single poll as to who won the debate and we won by a lot, OK? So, look, we need greatness in this country now.","We don't need mediocrity. We don't need it. We don't need phonies. We don't need politicians, all talk, no action. Get him out. Is this fun? Do we love this? I love it. I love it. Those cameras are turning up there. Look at them. They're like pretzels. They're like pretzels. All right, good. Get them out.","Go home. You're lucky. You're lucky it's not 10 years ago. 10 years ago, it would have been a much tougher situation for him. You know, different. You know, you know, speaking of that, they talk about waterboarding and all of these different things, right? And we have to obey the laws. We have to obey the laws.","But do you think ISIS is obeying the laws? Can you imagine that? And we have to, and I say this, and I say it very strongly, I wish we had some real protesters, some protesters with guts. Remember when the two young women came up and they took over the podium and microphone from Bernie Sanders? Do you remember what he did?","They're screaming at him. He's standing there like this. And what did he do? He retreated. He went back here. They took over the microphone. I promise, I'm representing you. I promise, that will never happen to Trump, ever. See, our great belief. They did a good job. Thank you, police. We love you. We love you.","They don't play games. The police in this country, believe me, the police are not treated fairly. One act which was a mistake or somebody was a bad apple, and it's played in the news all the time. We have to give more credit to our police, folks. And we have to stick with them. So then, on top of everyone else and everything else, we have Mitt Romney who choked in the last election.","I never thought he was a smart guy, and I keep wondering, I see he's with Steve Forbes today. And I thought Steve Forbes liked me. And they put me down at $4.5 billion net worth. I'm not complaining, but it's much more than that, OK? And I couldn't understand. Why is it that Forbes, they just raised me $400 million this year?","Now, I should be happy, right? And I am happy. What difference does it make? But I couldn't understand, why are the Forbes numbers so much lower than the value of what I built? And I started off with very little, by the way. How about this idiot gets up. My father gave me $200 million. $200 million? I only wish because we own the world, but I like this better, I'm having this.","This is much better. But I got a call from my brother and my sister, two great people, I love them, and they said why don't you correct that? That's so ridiculous. $200 million, that is so ridiculous. In fact, they said, by the way, if he gave you $200 million, please, let us know about it. We'd like a chunk of it, OK? I started off with very little.","I started off with great knowledge because I had a father who was a great guy. I had a father, who if he would have seen the Iran deal, and if he would have seen that we gave them $150 billion to a terrorist state, and, you know where they're spending that money? Buying Airbus jets. 118 Airbus jets. They're spending it all over Europe.","They're spending it in Russia, buying missiles, right? They're spending it in Russia buying missiles. They're spending it with everybody. But the good old USA, not going to happen anymore, folks, not going to happen. And we should have never agreed to negotiate. Remember The Art of the Deal, with great success, all that stuff.","We should have never agreed to negotiate four years ago as they got him. They should have released our prisoners. We should have never, ever agreed to negotiate. And I tell people, I have fun telling, it's one of the dumbest deals I've ever seen. Let's say they have our four people, actually used to be three then they added somebody from the Washington Post, OK? So they had four.","But I would have gone in very easily, now they would have said that's not presidential. Let me be not presidential, but I, or one of my great representatives, you know. You heard about Andy Beal, you heard about Phil Ruffin, you heard about all of these Carl Icahn or -- many of the great businesspeople are endorsing me, many of the great.","And we're going to use them to negotiate our trade deals. These are the best people in the world. These are the greatest negotiators in the world. These are the greatest business people in the world. They don't want anything. They don't give campaign contributions and then say, oh, now appoint me to Chief Negotiator against China.","China is so smart. Mexico is so smart. If you look at Japan, the deals they've made are so smart. Saudi Arabia. We protect Saudi Arabia. Before the oil went down, so now they're making half, they were making $1 billion a day. And we protect them for peanuts. Going to all change, folks, it's all going to change, it's all going to change.","It's all going to change. And it's going to go fast. But my father used to say, and somebody from one of the big papers loved this story, they said could you repeat the story? But I'll repeat it. But my father used to say to me, you're too tough. You got to take the lumps out. That was the expression he used.","He loved me. And he was a strong guy with a great heart. But it's a -- Donald, you're too tough. Take it easy. You got to take the lumps out. And he'd go like this, take the lumps out. Is somebody -- is somebody protesting back there? Get out of here. Out, out. Get him out. Don't hurt him. Don't hurt him.","Don't hurt him. Get out of here. Get out of here. Yeah, sure. Sure, man. You had your five seconds of fame, man. Get out. Don't hurt him. You know, it's funny when I say, like, I'll say don't hurt him and the press will say, Trump is getting soft. When I go, get him out and bomb, bomb, you know, then they go, then they go, it was terrible, the way he talked.","So I sort of have a middle ground. I say, get him out. And if it's too tough, I say, don't hurt him, don't hurt him. This way I don't get criticized by the press. But my father, he had a great way and he was a very, very good negotiator. I learned so much from my father. Wasn't the money he gave because the money -- he loaned me a small amount of money when I started, 1979, 1980. And I built it into a great fortune.","And I will tell you, I learned a lot. He used to say, son, take the lumps out. You're too tough. You're too direct. You'll make too many enemies. Me, make enemies? Didn't he do a great job with me? Didn't he do a great job. Me, enemies, look at Romney, the poor guy can't even breathe. He hears the name Trump, he goes, oh, I can't breathe.","What a dope. I mean, look, he did one of the worst jobs in the history of politics, he should have won his election if he devoted the energy and the time to winning his election against Obama four years ago, we wouldn't be wasting time here today. This guy was a disaster, OK? You know, I always hate second guessers.","There's something about second guessers. And Romney, and I said this, Romney came to see me, and he begged, he begged me for my support. He begged me. And what did I do? I said, drop to your knees. Drop to your knee. No, I didn't say that. But if I did he would have, I'm telling you. Now, he wasn't worth $200 million to me, but Steve Forbes is his friend, so Forbes raised me just a little while ago, $400 million.","They said I made $400 million. It's much more than that. They said, and now I know why, it's over $10 billion. But now I know why. He's meeting with Romney all the time. They're friends. The whole deal, I'm telling you, we have something going. This whole thing that we're doing is so special. We are really derailing against those they've never seen.","The Establishment is a disaster. The Republican Establishment, they don't know what they're doing. The only reason I mention this is the fact that we need this kind of thinking to get rid of our $19 trillion in debt, to get rid of our tremendous deficits with every single country we do business with. Why should we be protecting Saudi Arabia for practically nothing?","They wouldn't exist if it wasn't for us. Why should we -- every time I order thousands of television sets, thousands, I order them from South Korea. Get him out. Get him out. See, these are bad people. You know the funny thing? We all come, we want security, we want a strong military, we want borders, we want to have a country, we want education, we want good healthcare, we're going to appeal, I tell you what, we get -- we are going to get rid of Obamacare so fast, but we want to have a good life for our families and ourselves.","And we all want that whether you're Democrat or Republican. And these people did just that -- what's going on. It's really ridiculous. It's really ridiculous. It's really ridiculous. So let's go back to my father, right? So my father would always say, take the lumps out. Son, take -- and he'd always go like this, I remember my father passed away a number of years ago, but he'd always say, take the lumps out.","Take the -- and I learned. So here's what we do with Iran. Let's say I'm the negotiator. I'll be the negotiator. Even though it's not very presidential. We're supposed to have your so-called John Kerry-type do it. What a disaster John Kerry was. He never once walked. So here's what we do. We take the lumps out.","Now, before my father gave me this lesson, I would've walked in, I would have said, I -- I would have said, I want those prisoners back now. I want them back. And, you know, it would have not taken a long time. Probably would have gotten it. Now, we say, fellas, we got a problem. The prisoners are with you.","The prisoners are with you. You don't want them. We do want them, going to make for a better negotiation. Let them go. We leave because they're not going to do it. We leave. The Persians are great negotiators. We take off. We double up the sanctions. They will call you within 28 hours and they will say, very nicely, congratulations, you have your prisoners.","We got our prisoners. Now we have our prisoners back. Now in the old days, I would have said, they landed, they're safe. This is four years ago before we start. I would have said, I would have walked in, I would have said, we're not giving you the $150 billion, do you understand me? We're not giving you the $150 billion.","OK. But because of the fact -- hey, I went to the Wharton School of Finance but my father was still a better teacher. So -- and they were great, but he's the best. So now, I want to say to you, now I go in differently. I'd say, fellas, we've got a problem. We're bust. The country has no money. We owe $19 trillion, $19 trillion.","The horrible omnibus deal that was signed, can you believe that deal? The horrible deal that was signed recently, it's going to bring us up to $21 billion. We don't have the money, I'm so sorry. I want to give it to you so badly. We don't have $150 billion, we don't have $150 billion. And here's what's going to happen, we're going to leave.","We're going to double up the sanctions. They're going to call us again. We're going to start. We've just gotten our prisoners back four years ago, and we've just gotten out of giving them $150 billion and it's so simple. And by the way, and by the way, that's not like 80% sure, 95%, 98.7%. 100% we'd get the prisoners back, right?","And we'd get the money, we're never going to give them the money. They would never get the money. I feel so badly that we gave them $150 billion. And the sad part is, if I win, I don't get that money back, but I'll find out a way to get it back. I will find that way, I will find it. OK, I'll find a way. So the new thing is this, the new thing is how do we stop Trump?","Everyone is trying to figure out how to stop Trump. Get him out of here, out. You know, we have a divided country, folks. We have a terrible President who happens to be African-American. There has never been a greater division just about than what we have right now.","The hatred, the animosity. I will bring people together. I'm going to bring people together, you watch. We're going to bring people together. We're going to bring our jobs back from China and all of these other countries that have taken our jobs, and Mexico. And we're going to bring people together, folks.","We're going to bring them together. It's sort of exciting, isn't it? Sort of exciting, right? Sort of exciting, in all fairness. All right, look, we're going to bring people together. We're going to bring jobs back. We're going to bring a lot of things and we're going to unify the country because our country is terribly divided.","In so many ways, our country is divided. So we want to be -- you have to say, it is exciting, though, all right? This is not like your normal, low key, really boring rally that nobody cares about, nobody cares. Look at all those cameras back there, folks, look at all those. You know how many cameras you have for other people?","Like maybe none, like maybe none. Look at all of that. And I love the way they twist and turn and get into those little corners where you have the protesters because for us, when I tell them please turn your camera and show this massive crowd, right? They would never do it. They would never do never do it. Go ahead, turn the cameras, folks, turn the cameras.","Go ahead, turn the cameras. See that, they don't even move. They don't even move. Honestly, they're disgusting. We had a thing not so long ago near Massachusetts, which was so great. Did you see? Well, it helped that Tom Brady loves me, I will say that that. I mean, if Tom Brady loves you and you don't win Massachusetts by a landslide, you're not doing a very good job, right?","We love Tom Brady. But we had a thing where we had an arena, we had 12,000 people. Bernie Sanders, the same exact hour, had 3,000 people at a different site. The next day they talked about how big the crowds were for Bernie Sanders. And I said, wow, that's unfair. That's really unfair. All right, you ready?","Can the protesters stop for a couple of seconds, so we can talk here? Just for a couple of seconds. Give us, you know, like five minutes and then you can protest again because I'm so proud of selling out this, but this place is crazy. By the way, and I have to say this, we really sold it out twice because the people that were told, I'm sorry we can't get you in, are more than what we have inside.","So we really sold it out twice, which is pretty high. So now the move by guys like choker Mitt, I call him choker. He's a choker. He choked. You know, when somebody -- we all play sports, a lot of us. Usually, don't admit if you are, but usually if a person's a choker, it never changes, right? Right? I mean, if you look at Secretary Kerry, he choked on the Iran deal.","He choked. He should have left that room a couple of times, walked away, doubled up the sanctions and he would have made a much better deal. He never did that. He was afraid to leave the room. He choked. But usually, if you look at it, a choker -- we don't want chokers, do we agree? We don't want chokers.","We don't want chokers. When I watch what Chris Christie did to your no-show senator at the debate before last, when Chris grilled him and Chris endorsed me, by the way, which I love, but Chris Christie, I never saw anything like it. Little Marco was right next to me and Chris Christie is grilling him like a good prosecutor.","And Chris is grilling him, grilling him. And Marco keeps -- uh-oh, we have somebody else. What is it? We need a doctor, a doctor. We have a doctor? A woman fainted, a woman fainted. We love, we love people that faint. And I think it's only faint. Are you OK, darling? OK. Take your time, take your time. Those are the people we like the best.","She's been here for seven hours. I love you, darling. Get better, get better. We'll send you flowers. You're gonna be fine. We love you. Those are the people we love, right? Those are great people. They love our country. I will tell you that. So we have a lot of decisions to be made. So now I hear the new way of stopping Trump, because they are giving up. Oh -- that's -- you know what, those flowers are for me? Here's what I want you to do, run up and catch that woman and give those flowers to that woman.","I love that. How are you doing, Matt? That's nice. That's nice. So in the Times today, and in many other newspapers, they're sort of starting to give up about Trump. If we win Florida, believe me, it's over. If we win, and we're going to win, and you're gonna have a great President, then you're gonna have a great, great country again.","And you're going to feel so proud of your country again. You're not going to be embarrassed with Sergeant Bergdahl. We get Bergdahl. We get Bergdahl, right? We get a dirty rotten traitor, six people, five people, probably six people died trying to find him. So we get Bergdahl, and they get five of the biggest killers that they've been coveting and that they've wanted for years.","I call them the 1-for-5 President. That's no trade, folks. We're not going to make deals like that anymore, folks. We don't make deals like that. And as far as the waterboarding is concerned, we have to stay within the laws. We have to stay within the laws. Hey, who here thinks that ISIS, who chops off heads, who drowns people in a cage, who here thinks that ISIS stays within the laws, right?","We're like a bunch of babies but we're going to stay within the laws. But you know what we're going to do, we're going to have those laws broadened. Because we're playing with two sets of rules, their rules and our rules. And those laws are going to be broadened. It's embarrassing to see what's happening.","We fight, oh, waterboarding is so bad. It's so bad. It's so horrible. Waterboarding is such a terrible thing, OK? We're going to stay within the law, but we're going to increase it. But think of us, waterboarding is such a terrible thing. And think back in the Mideast, now you have ISIS guys sitting around a table, celebrating the fact that they just cut off the heads of 30 Christians, right?","Do you think they obey the laws, the laws? You know, I told this story and then some people said it wasn't necessarily true. And then it turned out to be true. But I tell this story, it's a rough story. Should I tell it or not? Remember, they asked me to tell it so it's not my fault. But in the old days, when we were strong and respected, we had a general named General Pershing, very tough cookie.","We have, hey, General Patton. How long do you think -- how long do you think ISIS would last with the great General George Patton? With the great General Douglas MacArthur? Believe me. But around 1919, they had a problem with Islam. I mean, they had a problem with terrorism. Radical Islamic terrorism, OK? They had a big, big problem.","Tremendous atrocities were being committed. And General Pershing and his group were sent out to solve the problem. And they caught 50 terrorists. And they took those terrorists and they stood them up, all 50, and they took the bullets. And they cut open two pigs. And they dropped the bullets into the pigs and they took the pigs' blood and they splash it around.","And they then took those bullets. They put them in the guns. They shot 49 of the terrorists with the bullets loaded up with pig fat and big blood, which is not something that -- let me explain, not nice not, politically correct. I don't think that allowed that today, do you agree? They shot 49 of the 50 terrorists.","And the final terrorists, just before he was going to be shot, they went up to him. They said, here, take this bullet. This bullet was meant to you. And he hardly wanted to touch it. Take this bullet. It was meant for you. Go back and tell your people, there'll be no more terrorism. For 28 years, there was no more terrorism.","For 28 years, there was no more terrorism. Look it up, in the Philippines, General -- General Pershing, rough guy, tough guy. 28 years, they say there was no more terrorism. Now we can be babies, we can be foolish. We have to be vigilant. We have to be strong. We have to be smart. When Paris happened, it was sort of an amazing thing, that attack in Paris where the press was calling the leader the mastermind.","And the kids, you know, we're losing our children. They're going over there fighting for ISIS. Because the press calls people masterminds. He's not a mastermind. He's not a mastermind at all. He's not even an intelligent person. I call him the guy with the dirty hat, remember the white hat, I call him the guy.","So they send people in because -- Paris, by the way, has the toughest gun laws in the world, just about. France has the toughest gun laws in the world. Only the bad guys have the guns. Now, if a few of you like that guy with his hand up, a few of you had guns wrapped around your hips or guns wrapped around your ankles and you were in that room, and you had bullets going in the opposite direction, I guarantee there wouldn't have been 130 people killed, many other people in the hospital right now.","So we have to totally protect our Second Amendment, folks. We have to do it. We have to protect our Second Amendment. In California, when you had the radicalized woman come over and radicalized probably the young man, now they're radicalized and they go in and they kill their fellow workers. Workers that gave them baby showers and parties.","Workers that they knew. Workers that, from what I hear, they liked. They went in and they killed 14 of them. Others, like in Paris, in the hospital, will never ever be the same. They went in, boom, boom, boom. No guns coming the other way. The military, the five military people that were killed in a gun-free zone, think of it, in a gun-free zone on a military base?","Now we have soldiers protecting us. Why do we have gun-free zones on a military base. I mean, that would mean that you should never have your soldiers have guns. And all these guys, all these guys that complain about guns like Michael Bloomberg, who used to be a friend of mine, by the way. No, no. Like many of them, they're complaining about guns.","So here's what you do. Tell them immediately to take the guns away from their bodyguards right now. Take the guns away from their bodyguards and let's see how they feel walking around certain places, OK? Let's see if they're happy. I don't think they're going to be too happy. So we're going to protect our Second Amendment.","Me, more than anybody else up here, we're going to protect our Second Amendment. We are going to get rid of Common Core. We are going to bring our education locally with love. Unlike Jeb Bush, he used to say that people come in as an act of love. Oh, there's no act of love. So we're going to get rid, we're going to get rid of a lot of things.","We're getting rid of Obamacare, we're replacing it, OK? We're getting rid of Common Core and we're going to have our education locally. You know, I tell this story, in the -- in 30 countries, in education, 30 countries, the United States is rated number 30. You have Denmark, Sweden, Norway, China and others.","They're the best. And yet in terms of cost per pupil, we're number one by far. Number two doesn't even exist. It doesn't even exist. It's so far down. Now here's what's happened with the campaign. So we're number one in cost and we're the least, we're the worst in terms of education. We -- you have back -- you have third-world nations with better educational systems than our country that we love.","We can't have, you know, we talk about the American dream, people can't have the American Dream if they don't get educated. I mean, it's just not going to happen. We need education. So remember, the most expensive, the least for the buck, right? Now my campaign, let's talk, I've spent the least amount of money.","And I'm number one by a lot. I'm killing everybody. Wouldn't that be nice? Wouldn't that be nice? Wouldn't it be beautiful? I mean, in New Hampshire, which was really just a great place and a great state, and -- and I told them we're going to stop heroin from coming in. We're going to clog up that border.","We're going to stop heroin that's all over the country. But in New Hampshire, they have an unbelievable thing. But in New Hampshire, I spent $2 million and I was number one in a landslide, right? It was a landslide, do we agree? Even those people would say it was a landslide. They don't know what's happening.","It was a landslide. I was number one and I spent very little. Somebody else spent $48 million. So I spent in New Hampshire very, very little money. And somebody, I won't mention names, but somebody spent $48 million and lost and came at the bottom of the pack. We don't want that, folks.","Wouldn't you rather be with me and let's spend less and have the best? It's what's going to happen. I'm building a hotel now on Pennsylvania Avenue in Washington. And I guess I'm doing it for two reasons. Number one, I do it because I do it. That's what I do. But I got it from General Services, GSA, very professional people, by the way.","Of course, if I didn't get it I probably wouldn't be saying that, but that's OK. But I got it. One of the most heavily bid, one of the most heavily contested in the history of the GSA, it was probably wanted by more people than any other thing. You know, it's on Pennsylvania Avenue, right between the White House and the Capitol Building.","The most incredible building, the most incredible location. They gave it to Trump for two reasons. I have the best statement you've ever seen. They're going to make sure it gets done. And they love the project. It's going to be one of the world's most luxurious hotels. We'll employ a lot of people and all of that.","And they made the decision and they boiled it down to 10 companies, great companies. I won't name the companies but you heard of every one of them. And they chose, in the Obama administration, they chose Trump. Can you imagine that? Can you imagine? Which tells you two things. Number one, I have a great statement.","And it also tells you we have a great concept. And it will, it will be one of the great hotels of the world. But here's the story. So we started construction. We're two years ahead of schedule. We were supposed to open in September, two years from now. And instead we're opening up in September, before the election.","Isn't that great? So -- so listen to this, so we're under budget and two years ahead of schedule. Wouldn't we love to have a country that could do that? You ever see these -- you ever see these -- these projects that we have where there's a 2,000% cost overrun and 1,000%, you know, 1,000% it would cost many times what they projected.","That won't happen with me, folks, it doesn't happen with me. You know, we have contractors in this country that bid on these government jobs. They are so rich you have no idea. They are so rich. They make so much money. They take the money from government. That's not gonna happen with me. I will start a new set of procedures where that stuff doesn't happen, folks.","We can do that. It won't happen. Now, the nice part about the hotel if I don't win, I'm living on Pennsylvania Avenue, anyway, OK? All right? So now, so now the new group is trying to stop Trump. And that's going to make a lot of people happy. And they actually mentioned in some of the papers that if that happened, where we're doing so well, that almost would be a revolution.","It would be, I mean, because the last thing that you people are going to take is having a lightweight like a Marco Rubio, who is terrible, having a guy like this or lying Ted Cruz or some politician in charge of this guy. We can't have it anymore. We can't have it anymore. I really mean, they're talking about serious, serious, serious problems.","But here's the story. So now what they're doing is they're saying, you know what, we may not be able to stop Trump. And by the way, speaking of Trump, and speaking of stopping and helping. You've got to get out to vote, folks. You've got to. Now remember this, it's Tuesday the 15th, Tuesday. So it's not this Tuesday, it's the following Tuesday.","It's Tuesday. It's Tuesday the 15th. You know what I would do? Just in case you get sick, you don't feel good. And even if you get sick and you can't walk, you've got to get up, have somebody lift you up. I'll even call you. I'll pay for it. I'll get an ambulance. But listen, listen here's what you have to do, you have to get up. So it's not this Tuesday, it's the following Tuesday.","If we win, Florida, it's over. If we win if we win Florida and Ohio it's really over, OK? And I think we have a good chance. Now, look, in Florida, you can early-vote. You can get, right? You can go out and you can vote early. So go and do it. Go vote, you got to. OK, wait let's do a pledge. Everybody -- who likes me in this room?","OK. I've never done this before. Can I have a pledge, a swearing. Raise your right hand. I do solemnly swear, that, I, no matter how I feel, no matter what the conditions, if there's hurricanes or whatever, that's good enough, will vote on before the 12th for Donald J. Trump for President. Thank you. Now I know.","Don't forget, you all raised your hand, you swore. Bad things happen if you don't live up to what you just did. No, I really appreciate. I mean, we're having an amazing period. It's an amazing thing. You know, they used to call this the silent majority but it wasn't nearly as big like this. They used to call it the silent majority.","And I was sort of using that name and some people didn't like that name because, for whatever reason, they said it had sort of bad connotations, OK? But I don't need that name because we're not the silent majority. We're the really noisy majority, right? So now what they're trying to do, The Establishment, and, you know, they had the wrong messenger in Romney.","I mean, how do you use a guy who should have won an election and lost horribly and made a fool out of himself? So they had a bad messenger. They -- there are messengers that could be good. There are messengers that could be good, but he's the wrong messenger. But -- but let me just tell you. So now, what they're thinking of doing, because they don't think they can stop us. All right?","Maybe they can. I don't know. Hey, look, my life is OK. I mean, a lot of people say, why are you doing this? You have such a great life. You built this great company you. Have a wonderful family. I'm doing it because this country was so great to me. It's payback time, folks. It's payback time. So now, what these absolute naive people -- they're naive.","What they want to do now, they don't know if they can stop Trump, so they want to start a third party. Remember, I did the pledge that I wouldn't do that. So I do a pledge. And then they do it, right? OK. Thank you. That's all right. Get him out. Get him out of here. So I do a pledge, and then they don't do a pledge, but they did a pledge but they don't honor anything.","But here's the story. So they want to start a third party and they want to put a couple of clowns in there that will take away enough votes that we won't be able to beat Hillary, right? So this will mean, let me just think of it, we lost a great Justice. Justice Scalia. My sister is a high judge and she knew Justice Scalia and she said he was a great man.","She said he was a great man. My sister knew him very well. And we lost a great judge unexpectedly. See, this is what happens in life. Nobody ever talked about him. It wasn't going to be him. You have people that are older on the court. You have people that they thought were going to be leaving you at other.","Nobody ever talked, and all of a sudden, it happened out of nowhere. One day you pick up -- he was a great judge, a conservative judge, a brilliant judge, a fair judge. He had so many qualities, and a brilliant judge. And that's what we want to replace with, as close to him as we can get. And I even gave some names.","I won't give it now, but I even gave some names of great conservative judges. OK. So here's the story. Here's the Republicans, and this is where it doesn't work for them. It's called the Supreme Court because, let's say they put a couple of Republicans just as scapegoats. They can't win but they'll put in a couple of Republicans, and these Republicans will take off 5%, 2%, 3% of the vote, right?","And now Hillary goes in. We're going to have to replace, probably over the next four-year term, it could be as many as four Supreme Court Justices including Judge Scalia. Can you imagine what will happen if that happens? Now I don't know if these people are thinking right because I pledged that I'm going to put on good, conservative, brilliant judges.","right? If a Hillary gets in or whoever, I don't know how she can run. I'll be honest, I don't know how she can. But let's assume, let's assume, let's assume she'll run. Don't forget you have a statute of limitations question here. Let's assume that she runs. And do you know what she would do with the Supreme Court?","She would have four judges, and maybe more, that she'll do over the next four years including, Scalia. All this work that everybody is doing not to appoint a judge, that would go to Hillary if she wins. So when the Republicans want to play games and when they want to. Look, this establishment group headed by Mitt Romney, who's not a smart man, I'm telling you, and Steve Forbes.","I'm telling you, I finally found out why they never give me the right number in Forbes Magazine. I finally find it out. I read it this morning, they're friends. I can't believe it. I always like Steve until now. But here's a start. But I don't care. I don't care. But remember this, if they do that, folks, number one, they're doing it to you.","They're not doing it to me. My life will be a lot easier, believe me. They're doing it to you. They're doing it to the movement. Take a look at Time Magazine four weeks ago, the most incredible story I've ever had. It talks about this movement, that there's never been anything like it, that the people are in love with each other.","We have a great country. We have a country where Apple is going to start making their iPhones in our country. Believe me when I get finished, believe me. We have a great country but we have leadership that almost is nonexistent. We have incompetent leaders. We're going to have really, really smart leadership.","And when that happens, you're going to be so happy. I'm going to give you one quick story. One quick story. Carrier, did you see it? Two weeks ago. Carrier, Carrier aircon. I'd buy a lot of Carrier aircon. I'm not going to buy it anymore. I'll go with Trane. But Carrier air conditioners, made in this country, they announced that they're moving to Mexico.","They did -- somebody had the cell phone going. Somebody had the cell phone going, taking the pictures. And 1,400 jobs are gone, right? They're gone. Like nothing, like magic. They announce, it's probably a mid-level guy, is up on a stage. I'm sorry, but we're moving to Mexico. They fired everybody, essentially.","And I said that's terrible. Now, Ford is building in Mexico. Nabisco is building in Mexico. So many people are building in Mexico. I love Mexico. I have thousands of Hispanics that work for me. When I won Nevada, I won with the Hispanics. I love the Hispanics. I love you. I love you, but I have thousands of Hispanics that work for me and they are great people.","And remember, in Nevada, I won with the Hispanics, the poll. So what happens is this. We have these eggheads that think they're -- they call them the elites. I say, why are they elite? they're more elite than me? Why are they elite? Half of them can't tie their shoes. And they say, Donald Trump is not a free trader.","I am the greatest free trader. I'm the biggest free trader, but it has to be smart trade. It has to be even trade. We can't have trade where we have imbalances like $58 million with Mexico, $58 billion. We can't lose $500 billion a year with China. We can't do this. So here's what we do. We tell Carrier, and I want to do it myself but they're all going to say it's not presidential, I'm not supposed to be calling as President, Carrier.","Do we agree? But maybe I'll do it anyway. Let him say, I'm not great. But I'll get Carl Icahn or I'll get Phil Ruffin or I'll get Andy Beal or -- and it'll all be very good. Believe me, folks. So here's what happens. We call up Carrier and we say, I'd like to congratulate you on your move to Mexico. Congratulations.","I think it's wonderful. You hurt 1,400 people and many more. And by the way, United Technologies which owns Carrier, is moving a lot of other divisions there, too. OK? Not going to happen. By the way, if I'm elected, not going to happen. So here's what I tell Carrier. I'd say, congratulations. I hope you build a beautiful place.","I hope you employ a lot of people from Mexico, but you're hurting our country. So here's the story, folks. Every air conditioning unit that you make that's put across the border, which will be a real border now, it's not coming across unless they have our permission, right? Every single air conditioning unit that you make that comes across the border, we're going to impose a 35% tax on that good, all right?","Now, if little Marco is President, which isn't going to happen, or if Lying Ted is president, OK? Here's what's going to happen. They're going to be called by their lobbyists. They're going to court be called by the special interests. They're going to be called by donors and stockholders that gave them money for their campaigns.","By the way, I'm self-funded, you know, I'm self-funding. I'm putting up my own money, OK? I don't think I get any credit. I don't think anybody says, in Florida, oh, I'm voting for Trump because he's self-funded. Let me tell you something, that's a good reason to vote for me. Because all of these guys, remember what I said, all of these guys are bought and paid for, folks.","All right? So -- and they're not stupid people. So they know it's bad to have Carrier leave. They don't have to go to Wharton and they don't have to go to high school. Anybody knows it. So here's what's going to happen, if Rubio gets a call, if Ted gets a call, if Hillary gets a call, whoever gets a call, immediate, oh, they're going to say, you can't do that.","They contributed $5 million to your campaign. And immediately, OK. OK, you're right. We can't do that. We don't want to be disloyal. I understand that. But nobody gave me anything. I've turned down so much money. I feel so foolish, I feel so foolish. You know, my whole life has been a life of accumulation.","Money, money I want more money I want -- I don't even know why. You know, it's like just keep going. Money, money. I want to build more buildings. Many, many buildings along Miami. I want to build more. But -- and I say sometimes it's been greedy. I want to be greedy, greedy. Now I want to be greedy for the United States of America.","I'm going to be greedy. I'm going to be so greedy for you people. And we have to be rich before we can be great again. We have to get rid of our debt. We have to get rid of so many things. We have to balance our budgets but we're going to take care -- look, when these countries -- and we've protected them for nothing.","You know what, we're going to speak to them. I'm a great messenger. We're going to speak to them properly. They're going to love us. And they're going to help. They're going to pay. They're going to help defray the cost. They're going to pay. You're going to see changes made so fast and so good. So here's the story.","So here's the story. Some people would say that's not free trading. Every single person in this room understands that's the right thing to do. And I'll tell you what's going to happen. Carrier is going to call me. And they're going to say, Mr. President, we've decided that we're not moving, sir. OK? We're not going to. It's the only way.","By the way, just so you know, I know more formulas, I know more about tax abatements, I know more about taxes than any human being that God ever created. I'll be -- and by the way, speaking about God, the greatest jobs-producing President that God ever created. I will tell you that. I will tell you that.","And Carrier won't move. Now, they'll build a new plant. Maybe they'll use their old plant. They'll negotiate with their employees. Maybe they're going to move down to Orlando. Who the hell knows. But they're going to be in the United States. All right? They're going to be in the United States. So look, we have a chance to do something monumental.","There's never been anything like this. And this isn't me saying it. This is these people saying it. We have a chance to do something monumental. We're going to start winning again. We don't win anymore. We don't win with the military. We can't beat ISIS. We don't win with health care. We don't win with education.","We don't win anymore. We're going to start winning again. We're going to win with our military. We're going to build up our military intelligently, not even necessarily with such great cost, intelligently. We're going to buy the weapons that our generals and our soldiers want not the weapons that we buy -- not the weapons that we buy because one company is politically stronger than another.","I mean, you've read this. I've read it all my life. They buy an airplane that's slower, doesn't maneuver as well, and is more costly because that company had more political punch than the other company whose plane the generals want, right? Not going to happen anymore. We're going to bid out the drugs. We're going to bid out everything.","People are now going to pay. The drug companies, you take a look, the drug companies, they take care of all these people. And then we wonder, why aren't we going to bid with the drug companies? Because the senators don't want that. They don't want that. So here's the story, we're going to start winning again like we've never won before.","I'm telling you. Our military, you're going to be so proud of it, and we're going to knock the hell out of ISIS, OK? Quickly, quick. We're going to take care of our vets. We're going to take care of our healthcare. We're going to take care of education. We're going to take care of our borders. No longer -- they're no longer going to be Swiss cheese, people walking.","We're going to have really powerful borders. And people are going to come into our country but they're going to come into our country legally, legally. And you're going to remember this afternoon because we're all together, we're partners. You're going to remember this afternoon and you're going to say in two years from now and three years from now and four years from now, that this was one of the great afternoons I've ever spent.","And you're going to go, and you're going to go, and on the 15th, Tuesday, you'll going to vote, or before then, hopefully, before then. Do it now, do it today, do it tomorrow but you'll get to go an early vote. I'd love you to early-vote but I won't hold you to it. But remember, you all swore. You're voting for Trump.","You can't change. And you are going to be, and I promise, you are going to be so proud of your President. And you are going to be so proud of your country. I love you all. Thank you very much. I'll see you soon. Thank you. I love you. Thank you, everybody. Thank you very much."],"text":" We're going to be the smart people. We're not going to let our politicians destroy our country. We're not going to let it happen. We're not going to let it happen. And you know, I talk about Little Marco Rubio, he's a total disaster. He's a disaster. He's a nasty guy, said nasty things, and you know, we hit him hard. We hit him hard. Little nasty guy. He even complained about my hands. Look at those hands, look at those hands. Look at that. You know, I hit him only in response to him. You know, I always am a counterpuncher, right? Only in response to him. And he's looking, I said, what can I say? What can I say? Well, maybe I'll say, oh, he's got small hands. Look at those. I mean, give me a break, OK? Where did he get that one? That was the first. I'm saying to myself, where did that one come from, right? But you know, the problem was I was shaking hands with people about two days, three days later and they're all saying, geez, Mr. Trump, you actually have large and strong hands. I said yeah. So I did want to get the word out, folks, you know. I didn't want to go the rest of my life having everyone say I have small hands. I've heard of worse things but who needs it, right? I want to thank you all, really. I mean, it's amazing, this crowd. Look at that, all the way up to the rafters, all the way up. Unbelievable. Unbelievable. Unbelievable. And the fire marshal, you know, we have thousands of people outside, we've lost about 10,000 people. They've had to leave but we still have thousands of people. And I think because the police are so incredible. We love our police. And your fire departments and everything, they're going to try and let another few hundred people come right up here. I said, don't worry about it. We're not going to have any problems, OK? So we're going to fill it in and it's great. You know, the one I work on most when I go to a site are fire marshals. They're my most important people because they're the ones that let us pack. You know, nobody has crowds like we do, nobody. And you take a look today. Here's a day -- now in all fairness to you, right now I'm supposed to be at the Cadillac World Golf Championships at Trump National Doral, and I'm here, I'm here. And I just left Rory -- actually I just left Kansas and hopefully we'll do well in Kansas and Kentucky. And you know, I have a list. Look at this, New Hampshire, we won; South Carolina, we won; Nevada, Nevada, we won in a massive landslide. That was supposed to be for lying Ted Cruz, lying Ted. He holds up the Bible and then he puts it down and he lies. I don't like that. And you know what, that's why I'm winning virtually every category with the Evangelicals who I love. And you heard today Paula White, who is fantastic and I appreciate Paula's being here. But Pastor Paula White was so great. And you know, Jerry Falwell Jr. from Liberty University was so great to me. And he doesn't endorse people, he doesn't do it, but he felt this was important. And remember this, every one of the candidates goes to Liberty. They all go to Liberty. They speak -- when he endorsed me, that was a great, great thing. All right. So we won, we won Nevada big. We won Georgia in a landslide. We won Tennessee really big. We won Alabama in a massive landslide. We won -- Vermont was incredible. Vermont, everybody thought that would be Marco. Marco didn't even show up. By the way, he doesn't show up to vote for the Senate. He doesn't show up, so why the hell should he show up to Vermont, right? Yeah. We won Virginia. We won Arkansas. We won Massachusetts. Many polls have come out that I easily beat Hillary Clinton. And I want to tell you, you know, you don't hear that on television. You watch these dishonest pundits. Well, Trump can't win the general election. We will beat her so badly, folks, we will beat her so badly. I used to listen to Jeb Bush before he flamed out, and they'd say, Donald Trump cannot beat Hillary Clinton. And I said, well, why can't you beat me, right? He got nothing. Low energy, low energy. And his people are now on television fighting me, saying, we have to stop Donald Trump. He's not going to beat Hillary Clinton. They worked for Jeb Bush. And I say to my people, you know, I have these debaters, right? And they say, why don't you just say you work for Jeb Bush and that they were terrible? But I see it all the time. We're going to beat Hillary. And I'll tell you something, the one person that Hillary doesn't want to run against, I will tell you this, is Donald Trump. That I could tell you. That I can tell you. And it's amazing, I watched it the other day where little Marco was going, well, Donald will not win. I mean, this guy's got so many problems. I don't think he'll come close to winning his own state. How would you like to be this? I'm 21 points up now. I happen to love Florida, in all fairness. Truly, truly my second home. I'm here all the time, as you know, all the time. I love this area, by the way, but I'm here all the time. I've done many, many jobs in Miami with Related and with Jorge Prez, and with you know, Gil Dezer and Michael Dezer. We've had great success. And we've had many of the buildings on the Miami, we have a lot of stuff. And it's been great. And as you know, Doral and in Jupiter we did a big job, very, very successful. And in West Palm Beach, we did the big, big job, very, very successful. And the Mar-a-Lago Club and many more. And in fact, tonight, we're having our news conference. Hopefully it'll be a victory conference in West Palm Beach, in West Palm Beach. See, with all the places I could pick, I picked Florida. I want to pick Florida. So we all love. But I hear these people and they talk about the general election. Look, the general election is very important, but I'm the one that's going to beat her. And I will say this, the one person that she does not want to run against is Trump. You know, she got a dose, I didn't. I haven't even, folks, I'm beating her in many polls. I'm beating her in many polls, and I haven't even started yet. I haven't started with her yet. Only once, only once. Four weeks ago, she said something about me being sexist, remember? And I'll tell you, the press treated me very unfairly because right after she said that, I attacked her and Bill, and Bill -- we talked about the word, we came up to the word enabler. You know what an enabler is? And we talked about Bill. I said, you mean to tell me I'm bad but her husband's, OK? Maybe one of the worst in the history of politics, right? And I had to put up -- OK. This was a disaster for them. I guarantee you, they had one of the worst weekends of their life. This was -- this was not a friendly weekend that they had sitting together at home, wherever they are at home if they were together. So here's the story. So here's the story. Here's a story. We can't play games. Our is in deep trouble. We have to beat her. It looks like she's going to make it. Bernie is gone. Bernie's gone, regardless. Bernie, Bernie is -- Bernie had his time. You know, he had his time in the sun and I watch -- I've seen this so often with politicians. They blow it. What happens, he had his time in the sun, he was doing great. And then they asked him the question about emails a month and a half ago, right? And he said, I'm tired of them discussing it, like, in other words, they shouldn't be discussing it. And I said, bye-bye Bernie, you just blew the election. And I was right. But when I attacked Hillary six weeks ago, people don't realize this, and the press gave me zero and I want credit, do you understand? You are the most dishonest human beings on earth, the most. They are disgusting, dishonest human beings. And I'll tell you, well, not all of them. Actually, amazingly, because I'm no fan of the New York Times, I had a front-page story today in The New York Times, was a phenomenal story. I can't believe it. Get them out of here. Get them out, right? We had an amazing, amazing story today on the front page. I'm going to have to be nicer to the New York Times, you know. They give me all bad stuff then I attack. Today was really amazing because somebody said in this story that there's been nothing like has happened with this movement in the United States for over 100 years. Can you imagine? Over 100 years. And it's true, no matter where we go, we're packed. We have the biggest audiences, the biggest crowds, by far. I must tell you, Bernie was second, a distant second, but Bernie was second. Where are these people? Come on, get them out fast. We want speed. Oh, there he is. Look, a little wise guy, a little wise guy. Lot of guts, a lot of guts. I wonder who sent him in. You know, they send them in, by the way. It's very -- but I love, I love my protesters because these guys never move the cameras. I said it all the time. I called my wife, Melania, by the way, she's done a great job on television lately, right? Well, she'd be a great and very beautiful first lady, right? And she's very, very smart and she's got a big heart. I will tell you, she's got a great heart. But I love my protesters because I'll go home and I'll see Melania say, how did you like the crowd? Didn't see the crowd. What do you mean you didn't see it? I Heard it. You know, when you hear this crowd, you know there's a lot of people. Can you imagine where we had to have over 10,000 people not come in today. But I promised I'm going to come back. None of you can come here when I come back. None of you. Were going to let the -- OK? I also know you got here at six o'clock in the morning, many of you. So pretty amazing but we're going to come back. But can you imagine, I'd go home and I'll say, did you see the size of that crowd? We filled up Dallas. You know, the -- Mark Cuban the Dallas Mavericks are a wonderful team. They have a beautiful stadium. I spoke with Mark, I said, you know what, that would be good. He said you'd fill it up fast. We took it over on Thursday, we filled it up on Monday, 21,000 people. Nobody knew. And the reason they didn't know, number one, the reporters don't want to report it. They don't want to say -- they had a case where Bernie, they had a press -- it's unbelievable. That's why I like my protesters. The only time they move the camera if there's a protester up on the top in the rafters. They'll move it because it's a negative thing in their mind. It's actually very positive. But you know, I'll tell you what, we have a thing going on here that's incredible. There hasn't been anything like it. The biggest story in politics which really isn't talked about as much as it should be is voter turnout during the primaries. 50% up, 60% up, in some cases 100-percenter. There it is, cameras. Look up there, camera. Look up there at the protester, camera. USA. USA. USA. Are the Trump rallies the greatest? Are they the greatest? You know what, little Marco has the rally when they get 300 people, 200 people. It's fine. I'm not knocking it. But that's sort of a normal thing. This is not a normal situation, folks, this is not a normal situation. So -- so it's been an amazing period of time for me. You know, on June 16, I took a deep breath. This is not something that's so easy. I want to say. I took a deep breath. I came down the escalator with Melania. I said, let's go. We have to straighten out. Get out of here. Get out, out, out. Go home to mommy. So why is it that that young lady can use filthy, disgusting language and they won't report that? And if I say something in fun that's not even bad, I end up on the front page of every paper in the world, OK? You think that's fair? She's disgusting. She's disgusting. It reminds me of this weekend, this last weekend, the former President of Mexico, right? Vicente Fox We will build the wall, don't worry. We will build the wall. We will build the wall, and who is going to pay for the wall? Who? You better believe it, they're going to pay for the wall. You know, we have a trade deficit with Mexico of $58 billion, $58 billion. And these politicians, lying Ted Cruz and little Marco Rubio, they cut -- who, actually he's not bad because he never shows up anywhere. I don't know what the hell -- what does he do with all his free time? He's got the highest delinquency record in the United States Senate in many, many years. It could be decades, OK? That is not the kind of person you want representing Florida. That's not the deal you made. You know, I built an incredible company. Look, just in Florida you know what I have. I got -- went over it all along the beach, Doral, Mar-a-Lago, all these things. And I built -- and I have to listen to this guy, a lightweight, a total lightweight, say, Donald Trump is con. I file financial papers that show I'm worth over $10 billion and I don't say that bragging, folks, I don't it bragging. Some of the greatest assets in the world, great buildings, Trump Tower, 40 Wall Street, 1290 Avenue, the America's big chunk, Bank of America buil -- all of this stuff, all of this stuff. Don't worry, get him out. They're quiet, they don't have much of a voice. And then I have to listen to this lightweight, say, I'm a con man. I can't -- nobody's ever called me a con man before. That's a horrible thing. Then when I hit him back, they say, Donald Trump was very rough. That was not good. But let me tell you, did I kill him in the debate the other night? One of the big announcers said, and it was very interesting, they said, Donald got in his head. He was really off that Donald got in his head. And, not me, we, we won every single poll as to who won the debate the other night. Every single poll. Drudge, Drudge had us at almost 70% about every single poll as to who won the debate and we won by a lot, OK? So, look, we need greatness in this country now. We don't need mediocrity. We don't need it. We don't need phonies. We don't need politicians, all talk, no action. Get him out. Is this fun? Do we love this? I love it. I love it. Those cameras are turning up there. Look at them. They're like pretzels. They're like pretzels. All right, good. Get them out. Go home. You're lucky. You're lucky it's not 10 years ago. 10 years ago, it would have been a much tougher situation for him. You know, different. You know, you know, speaking of that, they talk about waterboarding and all of these different things, right? And we have to obey the laws. We have to obey the laws. But do you think ISIS is obeying the laws? Can you imagine that? And we have to, and I say this, and I say it very strongly, I wish we had some real protesters, some protesters with guts. Remember when the two young women came up and they took over the podium and microphone from Bernie Sanders? Do you remember what he did? They're screaming at him. He's standing there like this. And what did he do? He retreated. He went back here. They took over the microphone. I promise, I'm representing you. I promise, that will never happen to Trump, ever. See, our great belief. They did a good job. Thank you, police. We love you. We love you. They don't play games. The police in this country, believe me, the police are not treated fairly. One act which was a mistake or somebody was a bad apple, and it's played in the news all the time. We have to give more credit to our police, folks. And we have to stick with them. So then, on top of everyone else and everything else, we have Mitt Romney who choked in the last election. I never thought he was a smart guy, and I keep wondering, I see he's with Steve Forbes today. And I thought Steve Forbes liked me. And they put me down at $4.5 billion net worth. I'm not complaining, but it's much more than that, OK? And I couldn't understand. Why is it that Forbes, they just raised me $400 million this year? Now, I should be happy, right? And I am happy. What difference does it make? But I couldn't understand, why are the Forbes numbers so much lower than the value of what I built? And I started off with very little, by the way. How about this idiot gets up. My father gave me $200 million. $200 million? I only wish because we own the world, but I like this better, I'm having this. This is much better. But I got a call from my brother and my sister, two great people, I love them, and they said why don't you correct that? That's so ridiculous. $200 million, that is so ridiculous. In fact, they said, by the way, if he gave you $200 million, please, let us know about it. We'd like a chunk of it, OK? I started off with very little. I started off with great knowledge because I had a father who was a great guy. I had a father, who if he would have seen the Iran deal, and if he would have seen that we gave them $150 billion to a terrorist state, and, you know where they're spending that money? Buying Airbus jets. 118 Airbus jets. They're spending it all over Europe. They're spending it in Russia, buying missiles, right? They're spending it in Russia buying missiles. They're spending it with everybody. But the good old USA, not going to happen anymore, folks, not going to happen. And we should have never agreed to negotiate. Remember The Art of the Deal, with great success, all that stuff. We should have never agreed to negotiate four years ago as they got him. They should have released our prisoners. We should have never, ever agreed to negotiate. And I tell people, I have fun telling, it's one of the dumbest deals I've ever seen. Let's say they have our four people, actually used to be three then they added somebody from the Washington Post, OK? So they had four. But I would have gone in very easily, now they would have said that's not presidential. Let me be not presidential, but I, or one of my great representatives, you know. You heard about Andy Beal, you heard about Phil Ruffin, you heard about all of these Carl Icahn or -- many of the great businesspeople are endorsing me, many of the great. And we're going to use them to negotiate our trade deals. These are the best people in the world. These are the greatest negotiators in the world. These are the greatest business people in the world. They don't want anything. They don't give campaign contributions and then say, oh, now appoint me to Chief Negotiator against China. China is so smart. Mexico is so smart. If you look at Japan, the deals they've made are so smart. Saudi Arabia. We protect Saudi Arabia. Before the oil went down, so now they're making half, they were making $1 billion a day. And we protect them for peanuts. Going to all change, folks, it's all going to change, it's all going to change. It's all going to change. And it's going to go fast. But my father used to say, and somebody from one of the big papers loved this story, they said could you repeat the story? But I'll repeat it. But my father used to say to me, you're too tough. You got to take the lumps out. That was the expression he used. He loved me. And he was a strong guy with a great heart. But it's a -- Donald, you're too tough. Take it easy. You got to take the lumps out. And he'd go like this, take the lumps out. Is somebody -- is somebody protesting back there? Get out of here. Out, out. Get him out. Don't hurt him. Don't hurt him. Don't hurt him. Get out of here. Get out of here. Yeah, sure. Sure, man. You had your five seconds of fame, man. Get out. Don't hurt him. You know, it's funny when I say, like, I'll say don't hurt him and the press will say, Trump is getting soft. When I go, get him out and bomb, bomb, you know, then they go, then they go, it was terrible, the way he talked. So I sort of have a middle ground. I say, get him out. And if it's too tough, I say, don't hurt him, don't hurt him. This way I don't get criticized by the press. But my father, he had a great way and he was a very, very good negotiator. I learned so much from my father. Wasn't the money he gave because the money -- he loaned me a small amount of money when I started, 1979, 1980. And I built it into a great fortune. And I will tell you, I learned a lot. He used to say, son, take the lumps out. You're too tough. You're too direct. You'll make too many enemies. Me, make enemies? Didn't he do a great job with me? Didn't he do a great job. Me, enemies, look at Romney, the poor guy can't even breathe. He hears the name Trump, he goes, oh, I can't breathe. What a dope. I mean, look, he did one of the worst jobs in the history of politics, he should have won his election if he devoted the energy and the time to winning his election against Obama four years ago, we wouldn't be wasting time here today. This guy was a disaster, OK? You know, I always hate second guessers. There's something about second guessers. And Romney, and I said this, Romney came to see me, and he begged, he begged me for my support. He begged me. And what did I do? I said, drop to your knees. Drop to your knee. No, I didn't say that. But if I did he would have, I'm telling you. Now, he wasn't worth $200 million to me, but Steve Forbes is his friend, so Forbes raised me just a little while ago, $400 million. They said I made $400 million. It's much more than that. They said, and now I know why, it's over $10 billion. But now I know why. He's meeting with Romney all the time. They're friends. The whole deal, I'm telling you, we have something going. This whole thing that we're doing is so special. We are really derailing against those they've never seen. The Establishment is a disaster. The Republican Establishment, they don't know what they're doing. The only reason I mention this is the fact that we need this kind of thinking to get rid of our $19 trillion in debt, to get rid of our tremendous deficits with every single country we do business with. Why should we be protecting Saudi Arabia for practically nothing? They wouldn't exist if it wasn't for us. Why should we -- every time I order thousands of television sets, thousands, I order them from South Korea. Get him out. Get him out. See, these are bad people. You know the funny thing? We all come, we want security, we want a strong military, we want borders, we want to have a country, we want education, we want good healthcare, we're going to appeal, I tell you what, we get -- we are going to get rid of Obamacare so fast, but we want to have a good life for our families and ourselves. And we all want that whether you're Democrat or Republican. And these people did just that -- what's going on. It's really ridiculous. It's really ridiculous. It's really ridiculous. So let's go back to my father, right? So my father would always say, take the lumps out. Son, take -- and he'd always go like this, I remember my father passed away a number of years ago, but he'd always say, take the lumps out. Take the -- and I learned. So here's what we do with Iran. Let's say I'm the negotiator. I'll be the negotiator. Even though it's not very presidential. We're supposed to have your so-called John Kerry-type do it. What a disaster John Kerry was. He never once walked. So here's what we do. We take the lumps out. Now, before my father gave me this lesson, I would've walked in, I would have said, I -- I would have said, I want those prisoners back now. I want them back. And, you know, it would have not taken a long time. Probably would have gotten it. Now, we say, fellas, we got a problem. The prisoners are with you. The prisoners are with you. You don't want them. We do want them, going to make for a better negotiation. Let them go. We leave because they're not going to do it. We leave. The Persians are great negotiators. We take off. We double up the sanctions. They will call you within 28 hours and they will say, very nicely, congratulations, you have your prisoners. We got our prisoners. Now we have our prisoners back. Now in the old days, I would have said, they landed, they're safe. This is four years ago before we start. I would have said, I would have walked in, I would have said, we're not giving you the $150 billion, do you understand me? We're not giving you the $150 billion. OK. But because of the fact -- hey, I went to the Wharton School of Finance but my father was still a better teacher. So -- and they were great, but he's the best. So now, I want to say to you, now I go in differently. I'd say, fellas, we've got a problem. We're bust. The country has no money. We owe $19 trillion, $19 trillion. The horrible omnibus deal that was signed, can you believe that deal? The horrible deal that was signed recently, it's going to bring us up to $21 billion. We don't have the money, I'm so sorry. I want to give it to you so badly. We don't have $150 billion, we don't have $150 billion. And here's what's going to happen, we're going to leave. We're going to double up the sanctions. They're going to call us again. We're going to start. We've just gotten our prisoners back four years ago, and we've just gotten out of giving them $150 billion and it's so simple. And by the way, and by the way, that's not like 80% sure, 95%, 98.7%. 100% we'd get the prisoners back, right? And we'd get the money, we're never going to give them the money. They would never get the money. I feel so badly that we gave them $150 billion. And the sad part is, if I win, I don't get that money back, but I'll find out a way to get it back. I will find that way, I will find it. OK, I'll find a way. So the new thing is this, the new thing is how do we stop Trump? Everyone is trying to figure out how to stop Trump. Get him out of here, out. You know, we have a divided country, folks. We have a terrible President who happens to be African-American. There has never been a greater division just about than what we have right now. The hatred, the animosity. I will bring people together. I'm going to bring people together, you watch. We're going to bring people together. We're going to bring our jobs back from China and all of these other countries that have taken our jobs, and Mexico. And we're going to bring people together, folks. We're going to bring them together. It's sort of exciting, isn't it? Sort of exciting, right? Sort of exciting, in all fairness. All right, look, we're going to bring people together. We're going to bring jobs back. We're going to bring a lot of things and we're going to unify the country because our country is terribly divided. In so many ways, our country is divided. So we want to be -- you have to say, it is exciting, though, all right? This is not like your normal, low key, really boring rally that nobody cares about, nobody cares. Look at all those cameras back there, folks, look at all those. You know how many cameras you have for other people? Like maybe none, like maybe none. Look at all of that. And I love the way they twist and turn and get into those little corners where you have the protesters because for us, when I tell them please turn your camera and show this massive crowd, right? They would never do it. They would never do never do it. Go ahead, turn the cameras, folks, turn the cameras. Go ahead, turn the cameras. See that, they don't even move. They don't even move. Honestly, they're disgusting. We had a thing not so long ago near Massachusetts, which was so great. Did you see? Well, it helped that Tom Brady loves me, I will say that that. I mean, if Tom Brady loves you and you don't win Massachusetts by a landslide, you're not doing a very good job, right? We love Tom Brady. But we had a thing where we had an arena, we had 12,000 people. Bernie Sanders, the same exact hour, had 3,000 people at a different site. The next day they talked about how big the crowds were for Bernie Sanders. And I said, wow, that's unfair. That's really unfair. All right, you ready? Can the protesters stop for a couple of seconds, so we can talk here? Just for a couple of seconds. Give us, you know, like five minutes and then you can protest again because I'm so proud of selling out this, but this place is crazy. By the way, and I have to say this, we really sold it out twice because the people that were told, I'm sorry we can't get you in, are more than what we have inside. So we really sold it out twice, which is pretty high. So now the move by guys like choker Mitt, I call him choker. He's a choker. He choked. You know, when somebody -- we all play sports, a lot of us. Usually, don't admit if you are, but usually if a person's a choker, it never changes, right? Right? I mean, if you look at Secretary Kerry, he choked on the Iran deal. He choked. He should have left that room a couple of times, walked away, doubled up the sanctions and he would have made a much better deal. He never did that. He was afraid to leave the room. He choked. But usually, if you look at it, a choker -- we don't want chokers, do we agree? We don't want chokers. We don't want chokers. When I watch what Chris Christie did to your no-show senator at the debate before last, when Chris grilled him and Chris endorsed me, by the way, which I love, but Chris Christie, I never saw anything like it. Little Marco was right next to me and Chris Christie is grilling him like a good prosecutor. And Chris is grilling him, grilling him. And Marco keeps -- uh-oh, we have somebody else. What is it? We need a doctor, a doctor. We have a doctor? A woman fainted, a woman fainted. We love, we love people that faint. And I think it's only faint. Are you OK, darling? OK. Take your time, take your time. Those are the people we like the best. She's been here for seven hours. I love you, darling. Get better, get better. We'll send you flowers. You're gonna be fine. We love you. Those are the people we love, right? Those are great people. They love our country. I will tell you that. So we have a lot of decisions to be made. So now I hear the new way of stopping Trump, because they are giving up. Oh -- that's -- you know what, those flowers are for me? Here's what I want you to do, run up and catch that woman and give those flowers to that woman. I love that. How are you doing, Matt? That's nice. That's nice. So in the Times today, and in many other newspapers, they're sort of starting to give up about Trump. If we win Florida, believe me, it's over. If we win, and we're going to win, and you're gonna have a great President, then you're gonna have a great, great country again. And you're going to feel so proud of your country again. You're not going to be embarrassed with Sergeant Bergdahl. We get Bergdahl. We get Bergdahl, right? We get a dirty rotten traitor, six people, five people, probably six people died trying to find him. So we get Bergdahl, and they get five of the biggest killers that they've been coveting and that they've wanted for years. I call them the 1-for-5 President. That's no trade, folks. We're not going to make deals like that anymore, folks. We don't make deals like that. And as far as the waterboarding is concerned, we have to stay within the laws. We have to stay within the laws. Hey, who here thinks that ISIS, who chops off heads, who drowns people in a cage, who here thinks that ISIS stays within the laws, right? We're like a bunch of babies but we're going to stay within the laws. But you know what we're going to do, we're going to have those laws broadened. Because we're playing with two sets of rules, their rules and our rules. And those laws are going to be broadened. It's embarrassing to see what's happening. We fight, oh, waterboarding is so bad. It's so bad. It's so horrible. Waterboarding is such a terrible thing, OK? We're going to stay within the law, but we're going to increase it. But think of us, waterboarding is such a terrible thing. And think back in the Mideast, now you have ISIS guys sitting around a table, celebrating the fact that they just cut off the heads of 30 Christians, right? Do you think they obey the laws, the laws? You know, I told this story and then some people said it wasn't necessarily true. And then it turned out to be true. But I tell this story, it's a rough story. Should I tell it or not? Remember, they asked me to tell it so it's not my fault. But in the old days, when we were strong and respected, we had a general named General Pershing, very tough cookie. We have, hey, General Patton. How long do you think -- how long do you think ISIS would last with the great General George Patton? With the great General Douglas MacArthur? Believe me. But around 1919, they had a problem with Islam. I mean, they had a problem with terrorism. Radical Islamic terrorism, OK? They had a big, big problem. Tremendous atrocities were being committed. And General Pershing and his group were sent out to solve the problem. And they caught 50 terrorists. And they took those terrorists and they stood them up, all 50, and they took the bullets. And they cut open two pigs. And they dropped the bullets into the pigs and they took the pigs' blood and they splash it around. And they then took those bullets. They put them in the guns. They shot 49 of the terrorists with the bullets loaded up with pig fat and big blood, which is not something that -- let me explain, not nice not, politically correct. I don't think that allowed that today, do you agree? They shot 49 of the 50 terrorists. And the final terrorists, just before he was going to be shot, they went up to him. They said, here, take this bullet. This bullet was meant to you. And he hardly wanted to touch it. Take this bullet. It was meant for you. Go back and tell your people, there'll be no more terrorism. For 28 years, there was no more terrorism. For 28 years, there was no more terrorism. Look it up, in the Philippines, General -- General Pershing, rough guy, tough guy. 28 years, they say there was no more terrorism. Now we can be babies, we can be foolish. We have to be vigilant. We have to be strong. We have to be smart. When Paris happened, it was sort of an amazing thing, that attack in Paris where the press was calling the leader the mastermind. And the kids, you know, we're losing our children. They're going over there fighting for ISIS. Because the press calls people masterminds. He's not a mastermind. He's not a mastermind at all. He's not even an intelligent person. I call him the guy with the dirty hat, remember the white hat, I call him the guy. So they send people in because -- Paris, by the way, has the toughest gun laws in the world, just about. France has the toughest gun laws in the world. Only the bad guys have the guns. Now, if a few of you like that guy with his hand up, a few of you had guns wrapped around your hips or guns wrapped around your ankles and you were in that room, and you had bullets going in the opposite direction, I guarantee there wouldn't have been 130 people killed, many other people in the hospital right now. So we have to totally protect our Second Amendment, folks. We have to do it. We have to protect our Second Amendment. In California, when you had the radicalized woman come over and radicalized probably the young man, now they're radicalized and they go in and they kill their fellow workers. Workers that gave them baby showers and parties. Workers that they knew. Workers that, from what I hear, they liked. They went in and they killed 14 of them. Others, like in Paris, in the hospital, will never ever be the same. They went in, boom, boom, boom. No guns coming the other way. The military, the five military people that were killed in a gun-free zone, think of it, in a gun-free zone on a military base? Now we have soldiers protecting us. Why do we have gun-free zones on a military base. I mean, that would mean that you should never have your soldiers have guns. And all these guys, all these guys that complain about guns like Michael Bloomberg, who used to be a friend of mine, by the way. No, no. Like many of them, they're complaining about guns. So here's what you do. Tell them immediately to take the guns away from their bodyguards right now. Take the guns away from their bodyguards and let's see how they feel walking around certain places, OK? Let's see if they're happy. I don't think they're going to be too happy. So we're going to protect our Second Amendment. Me, more than anybody else up here, we're going to protect our Second Amendment. We are going to get rid of Common Core. We are going to bring our education locally with love. Unlike Jeb Bush, he used to say that people come in as an act of love. Oh, there's no act of love. So we're going to get rid, we're going to get rid of a lot of things. We're getting rid of Obamacare, we're replacing it, OK? We're getting rid of Common Core and we're going to have our education locally. You know, I tell this story, in the -- in 30 countries, in education, 30 countries, the United States is rated number 30. You have Denmark, Sweden, Norway, China and others. They're the best. And yet in terms of cost per pupil, we're number one by far. Number two doesn't even exist. It doesn't even exist. It's so far down. Now here's what's happened with the campaign. So we're number one in cost and we're the least, we're the worst in terms of education. We -- you have back -- you have third-world nations with better educational systems than our country that we love. We can't have, you know, we talk about the American dream, people can't have the American Dream if they don't get educated. I mean, it's just not going to happen. We need education. So remember, the most expensive, the least for the buck, right? Now my campaign, let's talk, I've spent the least amount of money. And I'm number one by a lot. I'm killing everybody. Wouldn't that be nice? Wouldn't that be nice? Wouldn't it be beautiful? I mean, in New Hampshire, which was really just a great place and a great state, and -- and I told them we're going to stop heroin from coming in. We're going to clog up that border. We're going to stop heroin that's all over the country. But in New Hampshire, they have an unbelievable thing. But in New Hampshire, I spent $2 million and I was number one in a landslide, right? It was a landslide, do we agree? Even those people would say it was a landslide. They don't know what's happening. It was a landslide. I was number one and I spent very little. Somebody else spent $48 million. So I spent in New Hampshire very, very little money. And somebody, I won't mention names, but somebody spent $48 million and lost and came at the bottom of the pack. We don't want that, folks. Wouldn't you rather be with me and let's spend less and have the best? It's what's going to happen. I'm building a hotel now on Pennsylvania Avenue in Washington. And I guess I'm doing it for two reasons. Number one, I do it because I do it. That's what I do. But I got it from General Services, GSA, very professional people, by the way. Of course, if I didn't get it I probably wouldn't be saying that, but that's OK. But I got it. One of the most heavily bid, one of the most heavily contested in the history of the GSA, it was probably wanted by more people than any other thing. You know, it's on Pennsylvania Avenue, right between the White House and the Capitol Building. The most incredible building, the most incredible location. They gave it to Trump for two reasons. I have the best statement you've ever seen. They're going to make sure it gets done. And they love the project. It's going to be one of the world's most luxurious hotels. We'll employ a lot of people and all of that. And they made the decision and they boiled it down to 10 companies, great companies. I won't name the companies but you heard of every one of them. And they chose, in the Obama administration, they chose Trump. Can you imagine that? Can you imagine? Which tells you two things. Number one, I have a great statement. And it also tells you we have a great concept. And it will, it will be one of the great hotels of the world. But here's the story. So we started construction. We're two years ahead of schedule. We were supposed to open in September, two years from now. And instead we're opening up in September, before the election. Isn't that great? So -- so listen to this, so we're under budget and two years ahead of schedule. Wouldn't we love to have a country that could do that? You ever see these -- you ever see these -- these projects that we have where there's a 2,000% cost overrun and 1,000%, you know, 1,000% it would cost many times what they projected. That won't happen with me, folks, it doesn't happen with me. You know, we have contractors in this country that bid on these government jobs. They are so rich you have no idea. They are so rich. They make so much money. They take the money from government. That's not gonna happen with me. I will start a new set of procedures where that stuff doesn't happen, folks. We can do that. It won't happen. Now, the nice part about the hotel if I don't win, I'm living on Pennsylvania Avenue, anyway, OK? All right? So now, so now the new group is trying to stop Trump. And that's going to make a lot of people happy. And they actually mentioned in some of the papers that if that happened, where we're doing so well, that almost would be a revolution. It would be, I mean, because the last thing that you people are going to take is having a lightweight like a Marco Rubio, who is terrible, having a guy like this or lying Ted Cruz or some politician in charge of this guy. We can't have it anymore. We can't have it anymore. I really mean, they're talking about serious, serious, serious problems. But here's the story. So now what they're doing is they're saying, you know what, we may not be able to stop Trump. And by the way, speaking of Trump, and speaking of stopping and helping. You've got to get out to vote, folks. You've got to. Now remember this, it's Tuesday the 15th, Tuesday. So it's not this Tuesday, it's the following Tuesday. It's Tuesday. It's Tuesday the 15th. You know what I would do? Just in case you get sick, you don't feel good. And even if you get sick and you can't walk, you've got to get up, have somebody lift you up. I'll even call you. I'll pay for it. I'll get an ambulance. But listen, listen here's what you have to do, you have to get up. So it's not this Tuesday, it's the following Tuesday. If we win, Florida, it's over. If we win if we win Florida and Ohio it's really over, OK? And I think we have a good chance. Now, look, in Florida, you can early-vote. You can get, right? You can go out and you can vote early. So go and do it. Go vote, you got to. OK, wait let's do a pledge. Everybody -- who likes me in this room? OK. I've never done this before. Can I have a pledge, a swearing. Raise your right hand. I do solemnly swear, that, I, no matter how I feel, no matter what the conditions, if there's hurricanes or whatever, that's good enough, will vote on before the 12th for Donald J. Trump for President. Thank you. Now I know. Don't forget, you all raised your hand, you swore. Bad things happen if you don't live up to what you just did. No, I really appreciate. I mean, we're having an amazing period. It's an amazing thing. You know, they used to call this the silent majority but it wasn't nearly as big like this. They used to call it the silent majority. And I was sort of using that name and some people didn't like that name because, for whatever reason, they said it had sort of bad connotations, OK? But I don't need that name because we're not the silent majority. We're the really noisy majority, right? So now what they're trying to do, The Establishment, and, you know, they had the wrong messenger in Romney. I mean, how do you use a guy who should have won an election and lost horribly and made a fool out of himself? So they had a bad messenger. They -- there are messengers that could be good. There are messengers that could be good, but he's the wrong messenger. But -- but let me just tell you. So now, what they're thinking of doing, because they don't think they can stop us. All right? Maybe they can. I don't know. Hey, look, my life is OK. I mean, a lot of people say, why are you doing this? You have such a great life. You built this great company you. Have a wonderful family. I'm doing it because this country was so great to me. It's payback time, folks. It's payback time. So now, what these absolute naive people -- they're naive. What they want to do now, they don't know if they can stop Trump, so they want to start a third party. Remember, I did the pledge that I wouldn't do that. So I do a pledge. And then they do it, right? OK. Thank you. That's all right. Get him out. Get him out of here. So I do a pledge, and then they don't do a pledge, but they did a pledge but they don't honor anything. But here's the story. So they want to start a third party and they want to put a couple of clowns in there that will take away enough votes that we won't be able to beat Hillary, right? So this will mean, let me just think of it, we lost a great Justice. Justice Scalia. My sister is a high judge and she knew Justice Scalia and she said he was a great man. She said he was a great man. My sister knew him very well. And we lost a great judge unexpectedly. See, this is what happens in life. Nobody ever talked about him. It wasn't going to be him. You have people that are older on the court. You have people that they thought were going to be leaving you at other. Nobody ever talked, and all of a sudden, it happened out of nowhere. One day you pick up -- he was a great judge, a conservative judge, a brilliant judge, a fair judge. He had so many qualities, and a brilliant judge. And that's what we want to replace with, as close to him as we can get. And I even gave some names. I won't give it now, but I even gave some names of great conservative judges. OK. So here's the story. Here's the Republicans, and this is where it doesn't work for them. It's called the Supreme Court because, let's say they put a couple of Republicans just as scapegoats. They can't win but they'll put in a couple of Republicans, and these Republicans will take off 5%, 2%, 3% of the vote, right? And now Hillary goes in. We're going to have to replace, probably over the next four-year term, it could be as many as four Supreme Court Justices including Judge Scalia. Can you imagine what will happen if that happens? Now I don't know if these people are thinking right because I pledged that I'm going to put on good, conservative, brilliant judges. right? If a Hillary gets in or whoever, I don't know how she can run. I'll be honest, I don't know how she can. But let's assume, let's assume, let's assume she'll run. Don't forget you have a statute of limitations question here. Let's assume that she runs. And do you know what she would do with the Supreme Court? She would have four judges, and maybe more, that she'll do over the next four years including, Scalia. All this work that everybody is doing not to appoint a judge, that would go to Hillary if she wins. So when the Republicans want to play games and when they want to. Look, this establishment group headed by Mitt Romney, who's not a smart man, I'm telling you, and Steve Forbes. I'm telling you, I finally found out why they never give me the right number in Forbes Magazine. I finally find it out. I read it this morning, they're friends. I can't believe it. I always like Steve until now. But here's a start. But I don't care. I don't care. But remember this, if they do that, folks, number one, they're doing it to you. They're not doing it to me. My life will be a lot easier, believe me. They're doing it to you. They're doing it to the movement. Take a look at Time Magazine four weeks ago, the most incredible story I've ever had. It talks about this movement, that there's never been anything like it, that the people are in love with each other. We have a great country. We have a country where Apple is going to start making their iPhones in our country. Believe me when I get finished, believe me. We have a great country but we have leadership that almost is nonexistent. We have incompetent leaders. We're going to have really, really smart leadership. And when that happens, you're going to be so happy. I'm going to give you one quick story. One quick story. Carrier, did you see it? Two weeks ago. Carrier, Carrier aircon. I'd buy a lot of Carrier aircon. I'm not going to buy it anymore. I'll go with Trane. But Carrier air conditioners, made in this country, they announced that they're moving to Mexico. They did -- somebody had the cell phone going. Somebody had the cell phone going, taking the pictures. And 1,400 jobs are gone, right? They're gone. Like nothing, like magic. They announce, it's probably a mid-level guy, is up on a stage. I'm sorry, but we're moving to Mexico. They fired everybody, essentially. And I said that's terrible. Now, Ford is building in Mexico. Nabisco is building in Mexico. So many people are building in Mexico. I love Mexico. I have thousands of Hispanics that work for me. When I won Nevada, I won with the Hispanics. I love the Hispanics. I love you. I love you, but I have thousands of Hispanics that work for me and they are great people. And remember, in Nevada, I won with the Hispanics, the poll. So what happens is this. We have these eggheads that think they're -- they call them the elites. I say, why are they elite? they're more elite than me? Why are they elite? Half of them can't tie their shoes. And they say, Donald Trump is not a free trader. I am the greatest free trader. I'm the biggest free trader, but it has to be smart trade. It has to be even trade. We can't have trade where we have imbalances like $58 million with Mexico, $58 billion. We can't lose $500 billion a year with China. We can't do this. So here's what we do. We tell Carrier, and I want to do it myself but they're all going to say it's not presidential, I'm not supposed to be calling as President, Carrier. Do we agree? But maybe I'll do it anyway. Let him say, I'm not great. But I'll get Carl Icahn or I'll get Phil Ruffin or I'll get Andy Beal or -- and it'll all be very good. Believe me, folks. So here's what happens. We call up Carrier and we say, I'd like to congratulate you on your move to Mexico. Congratulations. I think it's wonderful. You hurt 1,400 people and many more. And by the way, United Technologies which owns Carrier, is moving a lot of other divisions there, too. OK? Not going to happen. By the way, if I'm elected, not going to happen. So here's what I tell Carrier. I'd say, congratulations. I hope you build a beautiful place. I hope you employ a lot of people from Mexico, but you're hurting our country. So here's the story, folks. Every air conditioning unit that you make that's put across the border, which will be a real border now, it's not coming across unless they have our permission, right? Every single air conditioning unit that you make that comes across the border, we're going to impose a 35% tax on that good, all right? Now, if little Marco is President, which isn't going to happen, or if Lying Ted is president, OK? Here's what's going to happen. They're going to be called by their lobbyists. They're going to court be called by the special interests. They're going to be called by donors and stockholders that gave them money for their campaigns. By the way, I'm self-funded, you know, I'm self-funding. I'm putting up my own money, OK? I don't think I get any credit. I don't think anybody says, in Florida, oh, I'm voting for Trump because he's self-funded. Let me tell you something, that's a good reason to vote for me. Because all of these guys, remember what I said, all of these guys are bought and paid for, folks. All right? So -- and they're not stupid people. So they know it's bad to have Carrier leave. They don't have to go to Wharton and they don't have to go to high school. Anybody knows it. So here's what's going to happen, if Rubio gets a call, if Ted gets a call, if Hillary gets a call, whoever gets a call, immediate, oh, they're going to say, you can't do that. They contributed $5 million to your campaign. And immediately, OK. OK, you're right. We can't do that. We don't want to be disloyal. I understand that. But nobody gave me anything. I've turned down so much money. I feel so foolish, I feel so foolish. You know, my whole life has been a life of accumulation. Money, money I want more money I want -- I don't even know why. You know, it's like just keep going. Money, money. I want to build more buildings. Many, many buildings along Miami. I want to build more. But -- and I say sometimes it's been greedy. I want to be greedy, greedy. Now I want to be greedy for the United States of America. I'm going to be greedy. I'm going to be so greedy for you people. And we have to be rich before we can be great again. We have to get rid of our debt. We have to get rid of so many things. We have to balance our budgets but we're going to take care -- look, when these countries -- and we've protected them for nothing. You know what, we're going to speak to them. I'm a great messenger. We're going to speak to them properly. They're going to love us. And they're going to help. They're going to pay. They're going to help defray the cost. They're going to pay. You're going to see changes made so fast and so good. So here's the story. So here's the story. Some people would say that's not free trading. Every single person in this room understands that's the right thing to do. And I'll tell you what's going to happen. Carrier is going to call me. And they're going to say, Mr. President, we've decided that we're not moving, sir. OK? We're not going to. It's the only way. By the way, just so you know, I know more formulas, I know more about tax abatements, I know more about taxes than any human being that God ever created. I'll be -- and by the way, speaking about God, the greatest jobs-producing President that God ever created. I will tell you that. I will tell you that. And Carrier won't move. Now, they'll build a new plant. Maybe they'll use their old plant. They'll negotiate with their employees. Maybe they're going to move down to Orlando. Who the hell knows. But they're going to be in the United States. All right? They're going to be in the United States. So look, we have a chance to do something monumental. There's never been anything like this. And this isn't me saying it. This is these people saying it. We have a chance to do something monumental. We're going to start winning again. We don't win anymore. We don't win with the military. We can't beat ISIS. We don't win with health care. We don't win with education. We don't win anymore. We're going to start winning again. We're going to win with our military. We're going to build up our military intelligently, not even necessarily with such great cost, intelligently. We're going to buy the weapons that our generals and our soldiers want not the weapons that we buy -- not the weapons that we buy because one company is politically stronger than another. I mean, you've read this. I've read it all my life. They buy an airplane that's slower, doesn't maneuver as well, and is more costly because that company had more political punch than the other company whose plane the generals want, right? Not going to happen anymore. We're going to bid out the drugs. We're going to bid out everything. People are now going to pay. The drug companies, you take a look, the drug companies, they take care of all these people. And then we wonder, why aren't we going to bid with the drug companies? Because the senators don't want that. They don't want that. So here's the story, we're going to start winning again like we've never won before. I'm telling you. Our military, you're going to be so proud of it, and we're going to knock the hell out of ISIS, OK? Quickly, quick. We're going to take care of our vets. We're going to take care of our healthcare. We're going to take care of education. We're going to take care of our borders. No longer -- they're no longer going to be Swiss cheese, people walking. We're going to have really powerful borders. And people are going to come into our country but they're going to come into our country legally, legally. And you're going to remember this afternoon because we're all together, we're partners. You're going to remember this afternoon and you're going to say in two years from now and three years from now and four years from now, that this was one of the great afternoons I've ever spent. And you're going to go, and you're going to go, and on the 15th, Tuesday, you'll going to vote, or before then, hopefully, before then. Do it now, do it today, do it tomorrow but you'll get to go an early vote. I'd love you to early-vote but I won't hold you to it. But remember, you all swore. You're voting for Trump. You can't change. And you are going to be, and I promise, you are going to be so proud of your President. And you are going to be so proud of your country. I love you all. Thank you very much. I'll see you soon. Thank you. I love you. Thank you, everybody. Thank you very much."}