{"id":434,"author":"Donald Trump","title":"Speech: Donald Trump in Warren, MI","date":"2016-03-04","link":"https://factba.se/transcript/donald-trump-speech-warren-mi-march-4-2016","paragraphs":["Thank you. So nice, so nice. So good. Thank you very much. We had a very -- we had a very, I love you too. U.S.A. U.S.A. U.S.A. So good -- so good. Thank you very much for being here. This is an amazing crowd. And we have thousands of people outside trying to get in. The fire marshal was very nice to us. We're stacked right into the corners.","So I thank the fire marshal but about two, 3,000 people, they're going home. That's bad. Does anybody want to give up their place to the people outside? Is there one person in this whole room raise your hand please? Now what? Ok. That's good. That means we want to be here right? So we have had an amazing period of time.","You know, I -- I started this whole journey on June 16th and from practically the time I began till now we've been a No. 1 position. Can you believe that? Amazing. And a couple of days ago CNN came out with the latest poll where we're 49 for Trump. Rubio is 16 but after last night's -- Little Marco, little Marco.","You know that in Florida, they hate Little Marco Rubio so much, its true. Because of the fact that he never votes. He never shows up to vote. So what do you think? I mean actually if you use -- I'll use a phrase -- a word that he uses -- he has calmed the people of Florida into voting for him.","And I'll tell you what? They are angry because he never shows. He is the worst voting record in all of Florida. He has the worst voting record in the United States Senate. And one of the worst voting records in the history of the United States Senate. I don't think he's going to do too well. They are angry at him he couldn't be elected dogcatcher.","So -- so last night, he had a very, very bad night according to the various polls. He lost the debate badly and -- but he's at 16. So he's going to go down. So it's Trump at 49. Little -- Little Marco Rubio at 16. Cruz, lying Ted Cruz, lying Ted. You know it's amazing no matter what you say with Ted, he'll change it. He'll do whatever he has to do. You call up, \"Oh I didn't know I did that.\" So it's Ted, remember what he did to Dr. Carson, to Ben Carson.","He said, \"Oh no. Oh no, no he's quit the race. He's out of the race. Vote for me. Vote for me. Thousands of him.\" So Carson was a good guy. So Cruz is at 15. And Casey is only at six. I don't know. Sounds like. And we just signed on to -- you know, Jeff Sessions just enjoy -- he's really one of the greats, one of the greats in terms of law and order in terms of border in terms of judicial.","But Jeff Sessions just came on and actually he's a very good friend of Cruz and Cruz could not believe that it had happened. But Senator Jeff Sessions, highly respected, great guy. And another one, in terms of the border, Sheriff Joe right? Sheriff Joe. So we're doing really well. And it's -- it's been amazing and we're going to talk about today trade.","We're going to talk about borders. We're going to have a lot of fun. Even though it's -- you know it's fun. It's sort of interesting. We get to talk about cars. We're going to talk about -- we're going to talk about cars. Don't worry folks. We're going to be building the wall.","We're going to build the wall. Are you ready? And who is going to pay for the wall? Who? You better believe it. Did you see where the former president of Mexico, Vicente Fox? He said, \"We will not pay for that F wall.\" Now, could you imagine if I said it and he said he threw out the F bomb.","And I'm just saying to myself, \"If I said it, I probably wouldn't be here today.\" Right? This guy used the F bomb in a major interview with CNN or somebody. And I want to tell you that was shocking and a disgrace. And I think he should apologize to the people of Mexico and to the people of the United States.","We are calling on him to apologize. And he said he will not pay for the wall. So we've come a long way. Because he actually said, \"I will not.\" It's interesting when he says, I will not. Right. He doesn't say Mexico will not. He says -- I say, he thinks a lot of himself. But he said, \"I will not, meaning Mexico will not pay for the F wall.\" And -- and I thought it was a horrible thing.","And what's interesting is that. At least now he knows the wall is going up. He didn't say we're not going to allow a wall. In other words, we've come a long way. He now said, \"He's not going to pay for the wall.\" Before he used to say, \"We will not allow a wall.\" Now he says, \"We will pay for the wall.\" He will pay for the wall, folks.","OK? He will pay for the wall. And you know what happened when the press called up and they told me about it. They said Well do you have a response. They said the wall just got 10 feet higher. You know that, 10 feet higher. We don't play games. We're not playing games. We're not playing games.","We are not going to play games. There's no, no, no games with us. You know the thing that bothered me about ex-president Fox is the the arrogance. The -- the way, you know, it wasn't so much the wall. It wasn't that, \"We're not going to pay.\" and they're not going to pay for the wall, what he said. It was he couldn't believe that the United States would actually be asking them for something.","The arrogance, he couldn't believe, how dare you ask us. The hatred and the arrogance of this guy because they used to getting their way a 100%. They're not going to get their way anymore folks. They're not are not getting their way anymore. They're not getting their way. And speaking of that, I'm not going to go through the whole thing with the escalator ride you've all heard.","Let me tell you, I'm going to go right to the car business you mind? Because this car -- this is car country rapidly becoming not car country. But we're going to keep it car country, OK? So about a year and a half ago I heard that Ford, everybody works for Ford here? Good company, smart company but I heard that Ford is going to build a plant in Mexico.","Two and a half billion dollars. That's -- And I have to tell you know, for a one story building that's got to be about the most expensive plant I've ever heard of. Is that a correct saving? You guys are in the car business. It has to be one of the most expensive. So they're going to build it in Mexico.","They're going to make cars, trucks and parts. And they're going to sell them all up but they're going to sell a lot of them right into the United States. Now -- now listen to this -- listen to this. Don't worry I'm with you folks. I'm with you. And -- and by the way, this is the reason I'm leading by a lot in Michigan because everyone knows all I talk about is cars.","I have friends in other industries they say, \"All you talk about is cars. Will you start talking about us.\" I said, \"No, I like cars. I like cars.\" But when I do, I devote a lot of time because Mexico is becoming the car capital of the world. Whether you like it or not. True.","And we're going to turn that around. You know, in Tennessee, a great state that I won by the way, by a tremendous -- You know, when I won, of course most of them of all fairness, so far I like it. But -- but when I win them I feel like a warm spot. Now, March 8th, Tuesday you got to do me one favor. You I'm self funding my campaign.","I'm self funding. You got to get out and vote. Because I promise you'll be very happy. Oh, you will be happy with me. You more than most. Michigan, I tell you what? Michigan more than most because what's happened to you people is disgraceful. And Michigan more than most. You got to get out. I'm going to say it again later.","But March 8th. Tuesday, Tuesday, Tuesday no matter what's happening, no matter what you're doing. If you get laid off on Tuesday, I still want you voting. I'll get you a new job. Don't worry about it. In a couple of years, you'll go home to your wife or you'll go home to your husband and say, \"Darling, I have so many job opportunities I'm going absolutely crazy.","I don't know what's happening.\" As opposed to now -- now you get laid off. You don't know what's happening. So we're going to -- we're going to take care of it. But Tuesday, you have to go out. You know -- so I'm self funding my campaign. I'm putting up my own money. So I'm not controlled by the unions, I'm not controlled by anything.","I'm controlled only -- But -- You know what? You have a representative union. I have to say this. You have a representative union. Who -- who is in a union? OK. You like your unions? You like them? Oh oh, oh oh, I said, \"You like your union? Nah.\" I don't know about that. Well anyway -- but you do love your industry, right?","The industries. All right. So I don't want your money but I do want your vote. So on Tuesday you go on. OK? Now, we're going to get this thing -- we're going to get this thing going. So Tennessee was going to get a massive car plant and it was going to be -- they're going to manufacture a tremendous plant.","And look, we want it within the United States. OK? I mean, we want it in Michigan but we wanted it within the United States, as our second choice in this room, all right? We don't want to go into Mexico. We don't want him going to lots of other places. We want to stop the cars from Japan. If Japan wants to send -- you know I was in Los Angeles, folks.","I have never seen more cars pour in. I have never seen larger ships. These ships are massive and they pull up and these cars just roll right off the ship. And I've never seen anything like it in my life. You know we got NASCAR the other day. NASCAR endorsed us. You have to say, \"That's a hell of an endorsement.\" Right?","That's like -- that's like getting the NFL. Ladies and gentlemen the NFL endorsed Donald Trump or ladies and gentlemen Major League Baseball endorsed Donald Trump. Think of it. Think of it. NASCAR endorsed us with many of their drivers. And Brian France, who's the head of NASCAR and an unbelievable guy, the great job he's done.","And they just said, \"There's a movement and the people that are NASCAR fans are Trump fans and there's a tremendous movement.\" But when I'm thinking about these ships. Are these ships pull into Los Angeles? Biggest I've ever seen. They pull into the Los Angeles docks and I stood there and I thought of NASCAR because those cars were coming off that ship so fast so many of them and they're saying, \"How is that helping us really?","Right. I want those cars made in Michigan. I want those cars made here. Right? Right? And you know what? The Japanese can do it. The Japanese can do it but let them make them here. They have so many cars. You know they give us these little spots, OK. We'll build a little plant there. We'll build a little one there, will keep the Americans happy.","We'll build one here. They have stupid leadership. Let's keep them happy. We'll build one here. But when you see those ships fall in, any one of -- any cars that you see that's peanuts compared to what we're doing. You have to see, these cars were coming off the ships at like 50 miles an hour. I've never seen anything like it. So folks, we want them to build the cars here.","You know when China, ordered some Boeing's and China is a tremendous abuser of our country -- and I love China, they're great. Their leaders are too smart for our leaders it's very simple. OK. And I have the smartest businessmen in the world. We have the smartest business people in the world in this. And right now, what -- you know what you have right now, you have political hacks negotiating the biggest deals.","You know, no matter what business deal you do, like I'm the big businessman. I -- I have tremendous business . You know it's funny they keep talking about my little deals. They talk about water, which I still have. They talk about a magazine, which I still have. You know I have magazines, my clubs and they talk about little deals.","They don't talk about the buildings that are 60, 70 stories all over the place. I'm building buildings all over. We're doing deals. Nobody talks about that. Why not? I mean, Forbes just came out and they said I'm worth four and a half for $5 billion and they have no idea. Actually they have no ideas much more than that but I won't tell them.","But, they don't want to talk about the big deals, they don't want to talk about Trump World Tower. They don't want to talk about Trump Tower. They don't want to talk about 40 Wall Street. They don't want to talk about the Bank of America building in San Francisco. They don't want to talk about the city I built on the West Side of Manhattan.","They don't want to talk about 1290 Avenue of the Americas. They only want to talk about, a steak. Oh yes, a little company -- a little tiny thing or Trump University which by the way I'll win that lawsuit so easy. I'll win that lawsuit sorry. And you know, it's sort of interesting with Trump University a small deal, but you know, a deal that they devoted a lot of time too.","And frankly, everybody -- everybody -- Many of the people that took the courses, many many of the people had -- they signed report cards when they were completed and it got rave reviews. Everybody, good good good good. Then a law firm comes along says, \"Listen if we sue so they form a closed -- a class-action if we sue, we'll get your money back.\" So let's say, you took the course and you liked it, and then somebody comes, \"Hey, you liked your course?","It's over, we'll get your money back\" You'll say, \"OK. OK.\" They all signed documents. I don't know even why? They all signed document we call them report cards saying, \"It's wonderful. It's great.\" So when they come to settle, I said, \"I'm not going to settle.\" And you know, the problem with settlers, when you settle, everybody sues you.","I watch these banks -- you ever notice the banks they get sued -- they get sued over and over again. They have executives at the banks, which is ridiculous, they're being paid $50 million a year, some of these guys and they always settle. And I say to them, \"You're getting paid all this money. Why don't you fight the case?\" Well, it's the government.","I said, \"You should fight the case. You should fight it right to the end and you make maybe a settlement down the end.\" But the problem is, when you settle cases, everybody keeps suing you. Does it make sense? When they have to go through a case, it takes years and years, like this case have been going on for four or five years.","When they have to go through the pain, of really going through a case and really fight. I don't get sued very often. The reason I don't is they say, \"Oh, Trump will never settle.\" They'd like to go to the settlements. They sue him. Two days later, they have a lawsuit settled. They put a lot of money in their pockets, the lawyers sort of way.","So Trump University I'm going to win that case. It's a civil case, not a big deal. I look forward to going to trial. I'm going to win that case but they don't talk about all of these massive buildings that they have. They don't talk about the city I built on the West Side of Manhattan which was a tremendous success.","They don't talk about all of the deals we're doing all over the country and all over the world, actually. You know, Turnberry in Scotland etc. They don't talk about Doral, where right now we have the World Golf Championships. You saw that the Cadillac World Golf Championship. Sponsored by Cadillac. So right now -- and I'm supposed to be there and I'm here with you.","I'm supposed to be there. I am right now. I had it marked for two years, I have right now. So we have the Cadillac World Golf Championships, Rory McIlroy, everybody said, right? Phil -- Phil's doing well by the way, Phil Mickelson. He's doing great, 2nd place. So I'm supposed to be in Miami at my place. Watching these great golfers play golf and here I am in Michigan and I love it. OK? I am. I love it. So -- so we're going to talk about -- because one thing is guy Romney came out yesterday.","I mean, the hatred he has, the hatred, the jealousy, the hatred, the -- It's hard to believe. Now look, let me just say, \"No, no.\" You guys should like him, right? I mean you should like him but, no. Remember the 47%? Remember when he made the statement 47% and in one speech he lost.","Thank you. In one speech, he lost 47% of the voters. Can you believe it? He's not a smart guy. This is -- this is not a smart guy. But anyway, so he came out yesterday and the reason he doesn't like me is that I said, \"You shouldn't run because you're a choke artist.\" You ran -- You ran against -- You ran against Obama four years ago.","It was a race that should have been an easy win. He made a fool of himself in the second and third debate. I don't know what happened to him. Honestly, I don't know what happened to him. He didn't campaign. He didn't campaign. What the hell did happen? Does anyone know? He what ? He was he didn't campaign.","And you know, the sad part is, I really helped the guy. I mean, I gave him a lot of money. I raised a lot of money. I had two fundraisers in my apartment. In fact, one of them was such a rainy day that it ruined the Conference of my apartment. Everyone's coming in and I had hundreds of people. My carpets were ruined.","I think I'm going to send him a bill for new carpet. But here's a disloyal guy. See he's -- he's an elitist. I don't -- see to me, I don't consider Malik, but you know. Hey, I don't consider Malik because I'm much richer than he is. He's worth -- you know I have a store. I have a store that's worth more money than him.","Was a very into it . I -- I jokingly said that because I don't like Romney. I don't like him. He thinks he's hot stuff and he thinks he's -- I hate people that think they're hot stuff and they're nothing. OK nothing. But I was in -- I was in Iowa. I was in Iowa and we -- I -- I love Iowa. And by the way, do I love New Hampshire?","Do I love South Carolina? And do I love Nevada? And do I love the last -- as you saw the SCC, we had the big night by far. Everyone's saying, \"Landslide for Trump\" And now on Tuesday -- and by the way, over the weekend we're going to do really well with Maine and lots of other places and I think that's gonna be great and then Tuesday comes.","But what happens is with -- with Mitt, when you run, when people entrust you. When people entrust you. You people are entrusting somebody to carry the banner because you don't want to have Hillary. Hillary will be a disaster. So -- so when -- when they entrust you, when you know, you're given the trust of billions of people to go out, you've got to work hard.","You got a what . And if you don't win that's OK. But Romney didn't work hard. Romney disappeared the final month and say what you want about Obama. He was on Jay Leno. He was on David Letterman, he was all over the place. And I used to say to the people, \"Where is Romney? What happened to Romney?\" Oh, is that a problem?","I get the hell out of here, folks. Get him out. Out. Get him out. All right. Let's go. Get him out of here. You know, you'll never know. If I say it too rough -- Look at all the media back there. Look. Oh, look the cameras are turned. I love it. They turn the cameras.","Oh, that's beautiful. That's so beautiful. By the way, I have to tell you about the media. They are the most dishonest people. They're worse than Rubio. And they're worse -- they're worse than Cruz. They are worse than Little Marco and they're worse than lying Ted Cruz. I'm telling you. Lying Ted, lying Ted.","What's your name? My name's lying Ted Cruz. I lie about anything. You know this guy, I've got to tell you. He goes and he holds up the Bible. And then he lies. So most unbelievable thing I've ever seen. It's a little, it's an unbelievable haul . He holds up the Bible -- and here's the story, in South Carolina, that was supposed to be an easy victory for Cruz.","I guess 67% -- percent are evangelical, right. Sixty seven percent evangelical. I won in a landslide and I won or -- I won the evangelicals by a lot. Now we have Jerry Falwell junior from Liberty University who sees everybody because they all come through Liberty University. Everybody goes there makes his speech and spends time with them.","And Jerry Falwell junior endorsed me. I think it was a big endorsement. I will tell you, I think it was a really big and we have many, many, many ministers and -- and pastors that endorsed me. But I win with the evangelicals because you know what? The evangelicals they probably know I'm not perfect but they know I'm the best for security.","I'm the best for the military. I'm the best for taking care of the vets. I'm the best for knocking the hell out of ISIS. And these other guys, they don't -- believe me, they don't have a clue. They talk. Their politicians, all-talk-no-action. So anyway, so just to finish off, so Romney's a bitter man.","He looks like a bitter man. He's attacking really your front runner by a lot. And he wanted to run. And he was going to run. And I put up with it long enough and I said, \"Look you can't let him run. He's a joke artist.\" He joked the last time. And you know, if you ever see in sports -- now unfortunately, some of you may be joke artist.","So be quiet about it, but don't worry about it. But do you ever see in sports -- you have it, just keep it to yourselves. Don't tell anybody. But you ever see in sports, once a joker always a joker. When you miss the kick one year, you miss the kick the next year. Once a joker, always a joker. And that's the way it goes.","You know, that Jack Nicklaus is of the world. Jack was great. The Jack Nicklaus is of the world and -- and Fran -- and the Tom Brady's. I know some of you might not love Tom but I do. I do. You know in Massachusetts, I got close to 50%. I think I got over 50% of the vote. And you know what happened, Tom Brady was saying all these great things, \"Trump is a winner.","He's my friend.\" And he's my friend. He's a great guy. But you know when Tom said that, I have to say, \"In New England, you cannot have a better reference in the great Tom Brady.\" Do we agree? You just care. So anyway, we won Massachusetts with record numbers. I got 50,000 more votes than Mitt Romney who is from there and ran for governor and the whole thing.","So you know, although, he did lose -- he did lose very badly when he ran for the Senate. He got -- he got killed. So here's the story. Here's this. Get out of here. Get out. Out. Out. Out. That was the meekest protester that I've ever seen. We said, \"Get out of here.\" And he just, \"OK.\" That's the kind of protest we like, right?","His uncle. Don't hurt him. Don't hurt him. I always say that. Because every once in a while we say, \"Knock him.\" And I get, \"How do I get killed? By these characters.\" You know, like they're legit, right? Like they're legit. You know, we had a case where Ted Cruz was asked about waterboarding. And he couldn't answer the question because you know, he was politically correct.","And in all fairness to him, it was essentially what do you think of waterboarding. Would you approve it. Would you this, would do that. And he didn't want to get into it. And I understand that because he wants to be politically correct. You know, they're allowed to chop off the heads of people including ourselves but we're not allowed to waterboard.","Do you think, they think we are the dumbest weakest people in the world? As they say. So they asked Ted Cruz about waterboarding and you can see his answer two debates ago and he's going like, \"Oh well, waterboarding. What do I say? What do I say? it's so vicious, it's so violent.\" You know, it's sort of the minimal minimal minimal and I don't know.","I'm sure it's not pleasant but it's minimal. So he didn't want to get into it. He didn't sort of answer the question. They did, \"What do you think Mr. Trump? So I said, \"Well, throughout the Middle East they're chopping off heads of Christians. They're chopping off heads of people. Anybody gets in the way.","They're drowning 30, 40 people at a time, in heavy steel cages. As far as I'm concerned, waterboarding is absolutely fine but we should go much further.\" And I've got a standing ovation. Standing ovation. Standing ovation. Right? Standing ovation. No pollster told me that.","You know, these guys can't think without a pollster. So a lot of times, I'll go up in the debates, so I'll give an answer. I'll give an answer from the heart. I give an answer, whatever it is. Hey look, if it doesn't work out you know what's going to happen? I'm going to go back to my old job. That was a good job.","You know you built a great company. You saw, I filed. I did the filing and the filing shows great great great company. Tremendous. And you know what? And I mentioned that for one reason, because it's the kind of thinking we need as our leader. We have to straighten out the 19 trillion in debt. All of the problems that we have.","We have -- we have a lot of problems to straighten out. So anyway, so Mitt is a -- is a very sad guy. He is getting absolutely killed, if you look on the internet. People are disgusted by him and it's pretty -- it's a pretty sad thing. You know, it's very interesting though. So I was in Iowa and the Des Moines Register which honestly is a terrible newspaper.","Terrible. Horrible. And not that because it's very liberal, which it is, but it's a terrible newspaper, a third-rate. It'll be out of business soon. So will the New York Times be out of business soon. So a lot of. I love it. I love it. But . When I hear the bad ones go out of business.","But the New York Times is in serious trouble. It'll be out of business soon. So here's the story -- here's the story which is sort of amazing. The Des Moines Register comes to interview. Man I give them and they ask me about Mitt Romney and he's nasty. You know, he's a nasty guy's like a spoiled brat.","So -- So I said -- they said, \"Well he's very wealthy.\" I said, \"Put him in his wealthy. I have a store that's worth more than him.\" So they wrote, I have a store but they didn't believe me. They didn't believe me. So they came the following day. We got a call, \"You don't have a store. This is an exaggeration.","You don't have a store that's worth.\" Well he's supposed to be worth $150 million. So I said, \"What do you mean I don't? Here take it.\" They went out and retained three appraisers. And they looked at the store, the Gucci store on Fifth Avenue and 56th there. All right. Which I own. I said, \"Just look at this store.","Don't look at the building, which I own. Just look at the store. \"Guess the store, on the corner of Fifth Avenue and 56th Street. So they said, they call up and said, \"You're right. It was worth between 400 million and 1.4 billion.\" So they did a story on my store. Now nobody talks about that, they talk about Trump University.","Don't -- they don't talk about that. They don't talk about these great buildings that I have all over. The great jobs we're doing all over the world. They talk about you know, whatever they can find. And I've always been told, as a rich person, as a successful person, you cannot run for government. You can't. Because I do like a deal a second.","I do many many deals. Most of them work out. Some of them don't work out, they turn out to be great because that's when you find out if somebody is a good deal maker. The market collapses in the middle of a big project or something happens. That's when you find out how good somebody is. That's when you find out if they've got the stomach.","That's when you find -- that you go to those banks and you say, \"Bomb. Bomb. Bomb.\" And you beat the hell out of everybody. And I'll tell you what? I have made deals that should have been disasters into among the best deals I've ever had. Because during the bad time when the market collapses -- I mean, if you're building a big building and you're going up 90 stores but on the 45th floor the market collapses.","Everything looks good, you're selling, everything's good then the market collapses. Now you're building a building and there's no market. It's a total disaster is not your fault. Your timing might be your fault. Because you know, I always like to pick good timing but not your fault. And then you go in. Yeah, that's true.","You have to beat up the banks and you have to beat up everybody around and you just see. But many of the deals I've had that should have been disasters turned out to be among my best deals. That's when you learn about deal-making. That's when you learn who's a good deal maker. So important. So important.","So anyway, so -- so let me just -- let me just -- let me just tell you a couple of things. We are going to do something that's going to be great. We are. A very big beneficiary is going to be Michigan because I talk about the car business all the time. Because the car business is being abused more than most other businesses, right?","And a lot of the business comes from overseas and a lot of the business that you have is now moving to Mexico. Mexico is becoming the new China. China -- what China has done to our country is incredible. They have -- they have stolen more money from the United States. It's the worst theft in the history of the world.","What they've done to our country. They've taken our jobs. They've taken our money. And I like China. The biggest bank in the world is a tenant of mine in China. They pay their rent on time, I promise. They have 400 million customers. It's the biggest bank in the world. I like China. They're great. But you know what?","Their leaders are too smart for our leaders because that's not free trade. When you hear these stupid people that think they're very conservative or we are conservative. Donald Trump is not a conservative. You know why do they think I'm not a conservative? I believe totally in free trade but it's got to be fair trade.","It's got to be fair. Got to be fair. See when they say free trade, they're talking about any free trade. And what they're really talking about is stupid trade. Because in China they send their products in here, right? And there's no barriers, no nothing. They send whatever the hell they want.","How often do you see it where a product is really defective? Or where it poisons you kids. I mean, you see or -- they just send the stuff in. When you want to do business with China, folks. It's them impossible. When you want to get your product -- I have friends that are manufacturers. They can't get their product into China.","When they do, they charge a big tax. They charge a very very big tax. And you know what? It's not going to happen like that anymore. We're losing $500 billion a year. We have a trade deficit with China. Five -- that means, they're sending in $500 billion but -- you know what 500 billion? That's a year. So then I hear -- then I hear the stupid people and some of the stupid people back there.","One of them, whom I'm looking at. Then I see. No. No. Then I hear the stupid people, \"Donald Trump is not a conservative because he doesn't believe in free trade.\" I believe in free trade but It's got to be smart trade. It's got to be fair trade. It's got to be even trade. So what we have is stupid trade and we -- we're going to have very smart trade and we're going to stop this.","Because how many nations -- And we can't go on like this. How many light nations can have a trade deficit of -- with one country $505 billion. OK? Nobody. You can't go on like that. And by the way, it's been like that for years. So you know, what we do? We roll up printing presses, folks. We roll up printing presses and that's why our middle income people are making less money.","And our workers, who built this country, folks. Are making less money now than they did 12 years ago. OK? Not going to happen, folks. It's not going to happen. We're not going to let it happen. So all we do, is we roll our printing presses faster and faster and faster so that China and Japan and Mexico and Vietnam and India and all sorts of places continue to take money out of your hides.","Look at it, we're going to change it. And you know what? We're going to have a better relationship than we have now. If you look at it now. We don't have a good relationship with any of these countries. So it's the worst of all worlds. No. 1 they're ripping us off. No. 2 they don't even like us. Look at China in the South China Sea.","They're building one of the big military fortresses of all time. Airports and also military. They're not allowed to do it. They're doing it because they don't respect us. So they take our money and then they do things that they're not supposed to be doing. So it's going to change. And you know what? They're going to like us better.","Believe it or not. I'm a unifier. I will unify the country. I'm going to unify blacks and whites. I'm going to unify. And we are not unified now. You know, when I -- when we had an African-American president the one thing I said is, I said, \"Great. Because we'll have much more unity. We'll have the African-Americans the whites will have something.\" Nothing happened.","Nothing happened. It's worse now than ever before. We are going to unify our country. A recent poll came out. A recent poll came out, where the African-Americans -- I was at 25%. This is a Republican. As a Republican at 25% -- normally like Romney got 6%. Normally you get like 5, 6%, 4%, 3%. And one of the commentators said, \"You know, if Donald Trump gets 25% with the African-American community, this election is over.","Trump wins. Trump wins\" But the other thing is, I'm going to bring in, Michigan. These are -- these are States just say you understand, that you know, a guy like a Marco or a guy like lying Ted Cruz. These -- these States that a -- a normal Republican -- because I'm not a normal Republican.","Anyway, but a normal Republican cannot take your turns. Frankly, I hate to say this, cannot think in terms of bringing in Michigan. And if you don't bring in Michigan that's you know, it's tough. It makes you -- you have a very narrow road. Structurally, it's very hard for a Republican to get elected.","Structurally. But I'm going to bring in places like Michigan -- I think we're going to win Michigan who I -- Who is going to vote? Who is going to vote for Hillary over Trump? You want Trump? Who wants Hillary? Who wants Trump? You'll be happy.","Oh, you're going to be happy. Oh, you're going to be. So what -- what is happening, is I've been winning a lot of polls against Hillary and I haven't even started on her yet. Other than four weeks ago, where I had to give her a little shot. Right? You know, the sad thing Bernie Sanders got all the credit.","Four weeks ago she said, \"I was sexist.\" Which I'm not. And I said, \"You can't call me sexist.\" And then I sort of alluded to the husband. I don't want to go through it right now but let's put it this way, they had a very tough weekend together. Right? And she totally silent. She totally stuff. And because of the tremendous press that got, not only did she have a bad weekend -- but Bernie Sanders looks like a genius because her poll numbers went down because of me. Her poll numbers -- and Bernie Sanders all of a sudden -- remember the big surge, Bernie Sanders.","This guy doesn't have a chance. OK? Bernie Sanders is surging. Hillary's way down. That's four weeks ago. Take a look. The day I hit her. The day I hit her. And her husband -- Because he was fair game because he's in the campaign. I said, \"Let me ask you. Is he campaigning?\" Yes. OK. Then here's the story.","Right? Right? And I said -- and I said, \"Hillary is an enabler, right?\" I said, \"She's an enabler.\" She enabled him. Get out of here. Get out. Out. Out. Get him out of here. That's strange. He looks like an Elvis impersonator. That's -- that's strange. Because all the Elvis impersonators love Donald Trump.","They love me. That's very sad. That's very -- that makes me very unhappy. So -- so I said that, \"Hillary's an enabler.\" And that was the end of it. But she crashed. Remember that? She totally crashed and they gave Bernie the credit. Like he's some mastermind. Let me tell you something, Bernie never had a chance.","Bernie's going down and it's over. Now the only thing that can save him, is if something happens to Hillary with regard to the e-mails. Which should happen. Should happen. Should happen. Do you remember though it -- it was a sad day. Do you remember when Bernie, when the microphones were taken over, when the two girls came up? And they took over the mics, they start screaming as he's speaking.","And here's what he did, \"Oh, OK.\" And he went to the back of the stage and he watched them speak. I said, \"That's never happening with Trump, folks.\" That's never happened. That's not going to happen with your Trump. So -- so here's a story -- and I want credit. Press I want credit. For the big down moment in Hillary.","OK? You never gave me credit for that, you gave it to Bernie. Bernie you should thank me. I want Bernie to make a speech today and thank me. Because if you -- If you look at that. I should get credit. Thank you media, you designers people. Thank you. World's most designers people, the media.","They are disgusting. They know. They write stories about me that they know are wrong. But a -- and just before I get back to the cars -- because I do want to talk about cars and then we get the hell out of here. OK? But -- but I do want to talk about cars. But I have to say this, \"They will write stories, knowing that the stories are wrong.\" You will say, the New York Times.","The failing New York Times wrote a story about me last week, that was so wrong. That actually called -- I usually I don't even go. I just say, \"Oh, forget it.\" Because the good news is, for the most part, it's just like newspaper. You throw it away the next day. Nobody even -- you know you make a big deal.","You read the story so wrong. Nobody even sees it. It's like, does it matter? Fortunately, a lot of power has been lost maybe it's because there's so many different sources or whatever. But the level of dishonesty is absolutely incredible. So, it's good. But I want to do something. Because I think when they write false reports, you and I and anybody else, where they're writing falsely, should have the ability to sue like the New York Times.","Now you know, this only makes it more difficult for me because now they'll come after me even more. But they can't be any worse than they are. They are real scum. So -- so we should have the ability to sue the New York Times or sue the Washington Post. We should have -- which is highly inaccurate about me. And look, the Washington Post was bought by the man that runs and -- and has a big chunk of Amazon, right?","Right? Right? That's right. Get him out. Get him out. OK. There goes the cameras. Look at that. The only way we get those cameras to turn. Get him out. Hey, are Trump rallies the most fun? Right? Do we have a good time? We're having a good time. So the Washington Post is owned by the guy, who owns Amazon.","Much bigger business. Owns a big chunk. Rich guy. He bought it. And he uses the Washington Post as his power tool. So that they don't raise taxes on Amazon and they don't raise taxes on other things he owns. And it's smart. I mean, I -- I have to tell you, it's smart. It's peanuts for him. So you won't see it closing or anything.","They have more reporters than I've ever seen. No no. But we're going to -- look, we got to do something about it. Now he loses a lot of money with the Washington Post, but that's fine. Because it doesn't mean it's small money compared to what he has. But he uses that, as his lobbying tool as his political tool and he's allowed a tax deduction on his losses.","So we can explain the whole thing. I've been explaining the whole thing. I actually think, he's a very nice guy. I think, it's a very smart move. But I just want you to understand, these newspapers are so corrupt and so dishonest. We had to do something about it. We got to do something about it. So -- so Tennessee was going to have a car plant.","And what happened, they're all set. Big foreign company. And boom, one day they read, they've decided to go to Mexico just before signing. You all heard about it. It was a terrible thing. And Tennessee lost that plant. And I love Tennessee because they voted for me last week. I mean, Super Tuesday was incredible.","Right? I love -- I don't forget those places that vote for me. The ones that don't, I can maybe forget them. But they haven't been -- they haven't been too many of them have there. But Tennessee was great. We won by a lot. And they're great people. Amazing people. Great country music by the way.","But amazing amazing people. And they were going to have a car plant and at the last moment they went to -- to Mexico. Now, let me just tell you, So Ford -- and this has been my favorite source. I'll give you the A plus story, as opposed to the D, because we're in Michigan, right? So Ford, good company. Done a good job and all that.","Good new person taking over and -- and the person that ran it is a fantastic guy. No complaints. But Ford decides to build a two and a half billion dollar plant in Mexico. And I'm saying to myself, \"That's a lot. That's a big plant.\" Now to do that, I mean, they don't want to talk about that. But to do that, they had to close plenty of things.","Is that right? Do you know about it? I assume they closed a lot in Michigan to build that. Is that correct? You're -- you're in the company. So they closed how many plants that they closed in Michigan? To build that one big massive one. A lot? He thinks at least two. OK. OK. Get out of here.","Get out. Out. This is amazing. So much fun. I love it. I love it. We having a good time? U.S.A. U.S.A. All right. You get him out. Try not to hurt him. If you do, I'll defend you in court. Don't worry about it. You know, one of the things that happened -- some of the -- he wasn't. He wasn't. But some of these protesters, they are really violent people.","Now if we're tough with them, we get criticized. We had one guy in New Hampshire, actually. Who was a rough guy. And he was swinging and swinging and punching. And he was really going down for the count. And we had a couple of people in the audience who were equally rough and they took him out. They took him out.","And no. Now they took him out and I'll tell you what? It was -- it was really amazing to watch. And you know, this was a seriously tough cookie. Guy look like an NFL football player. We had four guys they jumped at him. They were swinging and swinging. The next day we got killed in the press. That we were too rough.","Give me a break, you know. Right? We don't want to be too politically correct anymore. Right, folks? So anyway. You know, it's very unfair. You know, they're allowed to swing and punch the hell out of people. But if we get a little bit rough in taking them out, oh, we're terrible people.","You know, that's the way it is. It's one of the many reasons our country's going to hell. All right. So Ford wants to open a plant -- so two years ago, they announced they're going to open this massive plant in -- in Mexico. And I'm saying to myself, \"Hey, I was a very good student. I went to the best school, Wharton.","You don't have to go to work and you don't have to go to a good school. You don't have to go to school.\" It's not going to do us any good. OK? It's not. All I know, is they're closing, as you say, at least two plants. These men works for Ford. But they closed plants somewhere in the United States. Plants are closing because this thing is massive.","So they're going to make cars, trucks and ports. OK? So I'm saying to myself, \"Boy, that's a big deal.\" Now in the meantime, Carrier just announced they're going down to Mexico, you saw that. They just announced it. Divisions of United Technologies are now moving into Mexico. Nabisco from Chicago -- No more Oreos, folks.","No more. Nabisco is closing their big plant in Chicago. They're moving to Mexico. We better be careful. We better be careful. We're losing our businesses, folks. Pfizer you know, is moving out of the United States. A big massive pharmacy. They're moving to Ireland. They're moving to Ireland. We better be careful.","You know this corporate inversion is really a big problem. But Pfizer is moving and we -- we have a lot of company. That -- that will all change if I'm president because I know how to do it. OK. So here's what happens. So here's what happens and I put myself in the position. If a guy like Little Marco becomes president -- which I think is unlikely.","I think it's unlikely. Look, when you are rated at 31% likability in your own state because he's terrible. You're going to have a hard time being president. But whether it's little Marco or lying Ted. One of the other let's say -- because you know we are down to four people. And the people are going against Hillary and she is not going to be tough to beat.","She is so flawed. She's got such problems. And I -- and I do believe this. I do believe that, if the government does the right thing -- and I'm a big fan and a big believer in the FBI. If the government does the right thing under no circumstances will she be allowed to run. Even though, I most want to run against her.","I most want to. So what happens -- What happens is, if you have one of these people or Hillary as president, what will happen is the following: No. 1 they're totally controlled by the special interests and their donors and their lobbyists, 100%. So -- and these are not stupid people. So they will look at it and they'll say, \"Oh, this is ridiculous.","This is bad for the country.\" Then Ford will send its lobbyist up to see the president. And Ford will have raised many millions of dollars for him or her. And will send other people up special interest, donors, stockholders to see the president. Just say you can't do this. I gave you $5 million. You can't do this.","I gave you a PAC -- these super PACs are a disaster, by the way. Just say you know. I don't have any super PACs. I'm the only one doesn't have a super PAC. I feel. I'm not so happy. I just wonder, Is it worth it? You know, I don't know if it's appreciated. I'm the only one. I don't have super PACs, I don't have money, I don't have people.","Going out buying. I don't have to put it. I -- I just wonder, I'm spending a fortune. OK? Even though I spend less than anybody else -- and I'm in first place. I'm here, there. But still, it's a lot of money. And I wonder, do I get credit for not having super PACs? And do I get credit? Do I get credit? Because you know, I have friends that call me -- I had one friend from Michigan just called me -- actually, good guy.","Rich guy, said, \"Donald, I want to give you $5 million.\" I said, \"I can't take it.\" \"No, no, no, you don't understand. I want to give it to you.\" I said, \"I can't take it. I'm not taking money.\" Other than the little donations from people that send in $200 and a hundred and fifty and $17. Because frankly, those are people that really believe.","And those are people that invest. OK? And -- and it doesn't matter to a whole lot. And -- and how do you send it back to him? A woman sends me a check for $17.50 with a four-page note. What do I do say, \"Sorry I'm not taking your money.\" You know. So it's one of those things. You read the letter.","You sit down all night and read those long letters. We get the longest letters from people because they -- they want hope. And usually, the less the money, the longer the letter. It's really an interesting phenomena. So anyway, so I'm not taking the money. I'm not taking the money. And I say -- I say to myself, \"I really.\" -- and I really believe this.","I -- I know when you go into the booth you might like Trump, you might like somebody else. But nobody says, \"Well, I -- I sort of like Trump. And I like the other guy too, but I'm going to vote for the other guy.\" I know, that I don't get credit for the fact that I'm the only one that's not bought and paid for, folks.","So big thing. It's a big. And -- and you know it's hard for me because you know, my whole life has been about taking money, right? Taking money. I take, take, take, take. I'm a businessman. That's what I'm supposed to do. My job is to take money. My job is in a sense, I hate to say it, to be greedy and I'm greedy.","I go like, this more, more. I want more, more, more. Now, I'm going to be greedy for the United States. I'm going to be really greedy for the United States. So with Ford, so Ford is going to open the plant. Now, when Hillary or -- or Ted or any of these people, they become president. They're all taken care of. They're all bought.","They're all 100% bought. So they know what's right. It's a bad thing. But they'll be told, \"You can't do it. This guy gave you 10 million. This guy gave you five million. And you know what? I understand, that psychologically they can't do it. Well, how can I do that? They helped me when I needed money. How can I say, \"You've got to move back.\" OK. So here's what I'm doing.","When a company wants to move, I'm going to have the top people talk to them. And I will -- I know they're going to say, \"It's not presidential.\" You know, they're always saying, they said the other night, when I wanted and when I had the big victory in the Super -- you saw that. The SEC. the big big night.","We won -- we won seven -- seven states. And then we came in second. I mean second is like a bad, bad thing. I mean, we -- we won. We won so much. I mean we won. It was so -- you know, sort of semi record-setting, I guess. But anyway, so we had this great night. But -- but here's the story, so what happens is I'm going to say the following.","I'm going to say: No. 1 I'm going to call. They thought I was very presidential, that night. They thought I was so -- they said, \"Why -- \" No the press. They said -- I got great reviews. I made a speech afterwards. I had a news conference. I took questions. And they said -- during that night, where we won seven states.","They said -- I was at Mar-a-Lago in Palm Beach, Florida. And they said, \"He was so presidential.\" Well, when I'm on a debate stage and I have all these people throwing things at me, you got to fight back. Somebody said -- somebody said, \"Donald, you're the leader. The prohibitive favorite. Just stand there and take it.\" I can't do that.","Right? I can't. They actually said, \"Be presidential.\" I said, \"Does that mean, that I can't fight?\" So when little Marco spews his crap about the size of my hands which are big. The size of my head. Now he made a thing. He says, \"Well, Donald Trump has a -- let's see. What can I say? What can I say?\" So I looked at him.","I said, \"Marco.\" No, I just wanted to set -- look at that -- that those hands can hit a golf ball 285 yards. Right? Those are good strong. I've never been criticized about the size of my hands before. I'm saying to myself, \"What the -- what's going on here?\" So anyway, so I have to -- So what do I do? For the rest of my life, I have the curse that I have little hands.","Little hands. Take that guy. So -- so I said to my people, \"So what do I do? Do I stand back and just take incoming and act presidential.\" So now, I'm for -- Donald Trump is a con man. Donald Trump is this. And I've seen like that. You know what would happen? You know how many people I'd have in this room if I did that?","I'd have about seven. I'd have seven. And they would be mostly the protesters that were thrown out. . Now, we can't take it. That's the problem with our country. Our country takes abuse from everybody. We don't do anything about it. When Vicente Fox gets angry because we are actually, telling him that, we're going to have a wall and we're going to build a wall and he's going to pay for it. He can't believe that this country is saying this to him.","That's why I loved my statement when I said, \"Now it's got all.\" I've just loved it. I don't want to repeat it but I love that. OK. Are you ready? So here's what happens, these guys are going to do nothing. They -- You understand that. They're going to do nothing because they are bought and paid for.","In fact, you have special lobbyists. It has Marco Rubio on the forehead. It's like stamp. You need Marco Rubio's vote? You call up a certain guy in Washington. You need Ted Cruz's vote? Who by the way, is totally under the ether of the oil companies. Which is fine. But that's the way it is. You need Ted Cruz's vote?","It says, \"Call up so-and-so on K Street.\" Hundred percent, he'll take care of it. He gets his million dollars, $2 million and you have your vote. You know, it's just the way it works, folks. No good. With me? Nobody gave me anything. Nobody gave me. So here's what's going to happen. Here's what's going to happen.","Smart people -- So they get called and they -- they immediately get turned off by their lobbyist, special interest and donors. OK? So that's the end. So Ford will build and -- and -- and by the way, three days ago, I'm reading the paper. And because there was no pressure put on Ford, they're now doubling down.","Did you see that? They're now going up with more. That you know, the two and a half billion was two years ago. I've been talking about this for two years. And what a better place to speak than Michigan about this, right? Right? But I've been talking about this Ford plant because it bugged me. I've been talking about Carrier and I've been talking about others.","But the Ford plant bugged me because it was so damn big. OK? And because it's the car industry. So what happened is this. So what happened is this. They will not do anything and I think we agree. Now, OK. Now let's assume Donald Trump becomes the president of the United States. No game. Now I'm going to be so presidential.","I'll be so presidential, that you people will be screaming, \"Loosen up President. Loosen up.\" They'll be saying, \"You know, I wish the president would loosen up a little bit.\" All right. OK. But here's the thing, I had the best business men and best business women in the world. Normal. So what we're doing is this -- and they're from -- We have the greatest business people in this country.","So I will have people but this is too easy. I want to do it myself because I love doing this stuff. You know, Obama likes relaxing and going on vacations. Me? I like working. I like working. I really do. I like it. So I want to do it myself. So I have Carl Icahn, I have all of these people.","I want to do it myself. So here's what happens, I call up the head of Ford and I say, here's a story, \"I want you to enjoy your new plant. I hope it goes up on time, on budget, on schedule. I wanted to be a beautiful plant and I hope you produce beautiful cars, trucks and plants. And I hope you have wonderful labor relations with all of your Mexican employees.","OK.\" But you've heard the United States because thousands and thousands of people are put out of jobs. And you're sort of leading the way into Mexico because since you've announced many other people have announced. And the problem is, we have very stupid leaders. We have leaders that are very stupid. But now we have a very smart leader.","And here is the story. And here is the story -- and here's what some of the super conservatives don't like about me. Because I'm a free trader but I'm a really smart trader, right? So I'm going to tell them, \"Sorry folks, but every car, truck and part that you make and is shipped into the United States, you are going to pay a 35% tax on it.\" You're going to pay.","So you're going to pay a 35% tax any time you ship a car, truck or part into the United States. Now they're going to say, \"Mr. President, no way. No way. We can't do that.\" Then I'm going to be besieged by lobbyists and all these people. Half of whom I know. I'm not going to do anything for them.","I know them. Some are good guys, some are real sleazy. By the way. I want to tell you. These are serious sleaze. These are really dishonest people. These are players at the highest level. So I will be besieged by these people and I'll just laugh at them and hang up and that will be it. Within 24 to 48 hours, I will get a call from the head of Ford and he will say, \"Mr. President, we have decided that we will build our new plant in the United States.\" Now, that's not 90% sure.","It's not 95% sure, not 98 point. That's 100%. One hundred percent. One hundred percent. And I want to do it myself. I'm sorry. And they'll say, \"I can't believe the president of the United States is calling Ford and Carrier.\" How about I call Carrier, air condition. \"This is the President of the United States.","By the way, any air conditioning unit that you make and ship it to the United States, you're going to be paying a 35% tax.\" \"Oh, oh no, Mr. President, I promise, we're not leaving. We're staying in the United States. We love the United States.\" OK. Now they've got all kinds of formulas. They've got all sorts of nonsense.","It's the only way you're going to keep your companies, folks. And if you want to keep your companies, get used to it because that's what's going to have to do. And -- and don't call it free trade anymore. Call it really, really, really, smart trade. All right? One of these guys said yesterday, \"Oh my God, Donald.","Oh, is this stupid Romney. Stupid Mitt.\" He is a dumb guy. I -- I so -- I've always said he's a dumb guy. Stupid Mitt said, \"Donald Trump will ruin our economy.\" Well, our economy had last quarter GDP zero. We had no growth. You know, if China has seven or eight%. It's like a catastrophe. With us, we had no growth.","Last quarter, no growth. We're growing and yet that's going down. We're going to be negative. We're going to be negative GDP. That means, that people are leaving. That means, that our industries are leaving. That's what's happening. He's -- I'm telling you, he's a stupid person. Here's the story. Here's the story.","He said, \"We will ruin our relations with other countries.\" Now, China -- I'm very friendly with them at the highest levels. I love China. Great. But I made a lot of money on China. They pay me tens of millions for my condos. I told you, I have the biggest bank in the world is my tenant. We have I -- I own the bank of America building in San Francisco.","A big chunk of it. 1290 Avenue of the Americas, one of the biggest buildings in New York City. Largest floor plates in New York City. All through China. And I don't mean friendly, I mean sort of unfriendly. But I think Chinese great. They're smart. They come at you in waves. They don't have a meeting with one person, they have like 15 people.","So that if the one guy makes a mistake, they catch it. These guys are smart and we'll have some -- you know, hack. Sitting across the table from the 16, 15 killers. The poor guy doesn't have a chance. That's going to end. Okay. So here's the story. So Romney said, \"He'll ruin our economy. We won't be able to trade anywhere.\" Let me tell you something.","Hey folks, when you lose $500 billion a year with a company. When you lose $500 billion a year with all of these companies that we do business with in China. But more importantly, when you lose 505 billion to be exact in trade deficits with China. With China. Who the hell cares if you do business or not?","Who cares? We can't do that. We can't have trade. We can't have trade deficits of the magnitude that we're talking about. You know, breaking even is not great. But if you're broke even, I can see it. But you know, we're worried about we have politicians like a Romney guy. You know these are people from -- from the wrong age.","When you have that kind of a loss -- Mexico. We have a trade deficit with Mexico of $58 billion a year. That's why a lot of people say these politicians come off the stage recently. They say, \"You can't get Mexico to pay for the war.\" I said, \"Of course we can.\" Now, they can. By the way, I could give them all the ammunition.","They still would -- look at the Iran deal. A hundred and fifty billion dollars, we got nothing. And we should add our prisoners back four years ago. Not now. We should have been back four years ago. And we shouldn't have started the negotiations until they came back. That deal was made by incompetent people.","So here's the story. Here's the story. So here's the story. So with Ford, they're going to move back. And they'll tell me -- and it'll be so beautiful and I'll be so happy. Even though I'm not supposed to make the call. But I'm going to make the call. Not presidential. But I'm gonna make the call because it's too easy.","And they'll say, \"Mr. President, we're moving back. Would you like him to move to Michigan?\" I said, \"Yeah, I really want it move it to Michigan.\" OK. I want it to move them. So all of the polls and -- and they'll move back. We're going to stop this long slow. We're going -- we're going to lose.","I tell you what, this election about to take place first because we're not going to -- By the time I take office, we're not going to have any companies left in this country. China has taken alone millions of jobs. Thousands and thousands of plants and factories. Thousands. You wouldn't believe that. But then, I gave that -- actually gave me a number of 50,000. I can't believe.","So I'm not going to say 50,000. But I hear 50. But let's just say thousands. They've taken thousands of plants and businesses and we're going to stop it. We're going to stop it. We have rebuilt China. Now China is just one. And I use that because it's by far the biggest and it's the biggest abuser. But China -- But Mexico, I'll tell you what, for your industry, Mexico's a disaster.","Mexico is to the car industry. Mexico is a total and complete disaster. Now, in all fairness to Michigan, we're going to try and get him to go to Michigan. But you know what? At least they got to stay in the United States, right? They have to stay here. They've got to stay here. And they're going to stay here and ideally, they're going to stay in Michigan.","So here's the story, folks. When I first started, it was about trade. It was about the border. Then you had the horror show in Paris. And by the way, I will protect 100% the second amendment. The second amendment. I will repeal and replace Obamacare which is a catastrophe. I will totally terminate Common Core.","Education will be a local. And I will totally, totally, totally rebuild our military. It'll be bigger and better and stronger than ever before. And nobody will -- nobody will mess with them. And one thing and I have to say this because I say it all the time. We have to take care of our vets.","Our vets are being treated horribly . You know our vets -- this is a number that's hard to believe also. Thank you. Thank you. Thank you. Our vets are being -- just treated horribly. Think of this, 22 suicides a day. Twenty -- Is that -- It's not even a believable number.","Twenty two suicides a day, a day. So we're going to do -- we're going to help our vets. Right now, illegal immigrants are treated better than many of our vets. Not going to happen. It's not going to happen. But today, was special because it's Michigan. I did want to talk about industry. I didn't want to talk about the cars.","That's why I spent so much time talking about cars. We're going to bring the industry back to Michigan. We're going to bring a lot of industry back to our country. Someday, Apple is going to make -- someday, Apple is going to make their iPhones in the United States and not in China. And it's not going to be too far off.","We're going to make it, so that they do that. We're going to make it so that it makes economic sense for them to do that. Because we have people in Washington that truly don't know what they're doing. So this has been an amazing honor. This is an amazing place. An amazing state. We're way way up in the Michigan polls.","And I want to keep it that way. You know the polls don't mean anything. Because the worst is, your way up and you win by a little bit and then they say, \"Oh, he had a bad day.\" We got a show -- just do me one favor. Give me that big margin. I want the margin because it gives us more power. Right?","So on Tuesday please, everybody. No money. I don't want anything. I just want you go out and raise your hand. Raise your hand. Go out. And vote. I love you. I love you Michigan. I love you Michigan. Thank you. Thank you Michigan. Go out and vote. You're going to be very happy. Thank you everybody. Thank you."],"text":" Thank you. So nice, so nice. So good. Thank you very much. We had a very -- we had a very, I love you too. U.S.A. U.S.A. U.S.A. So good -- so good. Thank you very much for being here. This is an amazing crowd. And we have thousands of people outside trying to get in. The fire marshal was very nice to us. We're stacked right into the corners. So I thank the fire marshal but about two, 3,000 people, they're going home. That's bad. Does anybody want to give up their place to the people outside? Is there one person in this whole room raise your hand please? Now what? Ok. That's good. That means we want to be here right? So we have had an amazing period of time. You know, I -- I started this whole journey on June 16th and from practically the time I began till now we've been a No. 1 position. Can you believe that? Amazing. And a couple of days ago CNN came out with the latest poll where we're 49 for Trump. Rubio is 16 but after last night's -- Little Marco, little Marco. You know that in Florida, they hate Little Marco Rubio so much, its true. Because of the fact that he never votes. He never shows up to vote. So what do you think? I mean actually if you use -- I'll use a phrase -- a word that he uses -- he has calmed the people of Florida into voting for him. And I'll tell you what? They are angry because he never shows. He is the worst voting record in all of Florida. He has the worst voting record in the United States Senate. And one of the worst voting records in the history of the United States Senate. I don't think he's going to do too well. They are angry at him he couldn't be elected dogcatcher. So -- so last night, he had a very, very bad night according to the various polls. He lost the debate badly and -- but he's at 16. So he's going to go down. So it's Trump at 49. Little -- Little Marco Rubio at 16. Cruz, lying Ted Cruz, lying Ted. You know it's amazing no matter what you say with Ted, he'll change it. He'll do whatever he has to do. You call up, \"Oh I didn't know I did that.\" So it's Ted, remember what he did to Dr. Carson, to Ben Carson. He said, \"Oh no. Oh no, no he's quit the race. He's out of the race. Vote for me. Vote for me. Thousands of him.\" So Carson was a good guy. So Cruz is at 15. And Casey is only at six. I don't know. Sounds like. And we just signed on to -- you know, Jeff Sessions just enjoy -- he's really one of the greats, one of the greats in terms of law and order in terms of border in terms of judicial. But Jeff Sessions just came on and actually he's a very good friend of Cruz and Cruz could not believe that it had happened. But Senator Jeff Sessions, highly respected, great guy. And another one, in terms of the border, Sheriff Joe right? Sheriff Joe. So we're doing really well. And it's -- it's been amazing and we're going to talk about today trade. We're going to talk about borders. We're going to have a lot of fun. Even though it's -- you know it's fun. It's sort of interesting. We get to talk about cars. We're going to talk about -- we're going to talk about cars. Don't worry folks. We're going to be building the wall. We're going to build the wall. Are you ready? And who is going to pay for the wall? Who? You better believe it. Did you see where the former president of Mexico, Vicente Fox? He said, \"We will not pay for that F wall.\" Now, could you imagine if I said it and he said he threw out the F bomb. And I'm just saying to myself, \"If I said it, I probably wouldn't be here today.\" Right? This guy used the F bomb in a major interview with CNN or somebody. And I want to tell you that was shocking and a disgrace. And I think he should apologize to the people of Mexico and to the people of the United States. We are calling on him to apologize. And he said he will not pay for the wall. So we've come a long way. Because he actually said, \"I will not.\" It's interesting when he says, I will not. Right. He doesn't say Mexico will not. He says -- I say, he thinks a lot of himself. But he said, \"I will not, meaning Mexico will not pay for the F wall.\" And -- and I thought it was a horrible thing. And what's interesting is that. At least now he knows the wall is going up. He didn't say we're not going to allow a wall. In other words, we've come a long way. He now said, \"He's not going to pay for the wall.\" Before he used to say, \"We will not allow a wall.\" Now he says, \"We will pay for the wall.\" He will pay for the wall, folks. OK? He will pay for the wall. And you know what happened when the press called up and they told me about it. They said Well do you have a response. They said the wall just got 10 feet higher. You know that, 10 feet higher. We don't play games. We're not playing games. We're not playing games. We are not going to play games. There's no, no, no games with us. You know the thing that bothered me about ex-president Fox is the the arrogance. The -- the way, you know, it wasn't so much the wall. It wasn't that, \"We're not going to pay.\" and they're not going to pay for the wall, what he said. It was he couldn't believe that the United States would actually be asking them for something. The arrogance, he couldn't believe, how dare you ask us. The hatred and the arrogance of this guy because they used to getting their way a 100%. They're not going to get their way anymore folks. They're not are not getting their way anymore. They're not getting their way. And speaking of that, I'm not going to go through the whole thing with the escalator ride you've all heard. Let me tell you, I'm going to go right to the car business you mind? Because this car -- this is car country rapidly becoming not car country. But we're going to keep it car country, OK? So about a year and a half ago I heard that Ford, everybody works for Ford here? Good company, smart company but I heard that Ford is going to build a plant in Mexico. Two and a half billion dollars. That's -- And I have to tell you know, for a one story building that's got to be about the most expensive plant I've ever heard of. Is that a correct saving? You guys are in the car business. It has to be one of the most expensive. So they're going to build it in Mexico. They're going to make cars, trucks and parts. And they're going to sell them all up but they're going to sell a lot of them right into the United States. Now -- now listen to this -- listen to this. Don't worry I'm with you folks. I'm with you. And -- and by the way, this is the reason I'm leading by a lot in Michigan because everyone knows all I talk about is cars. I have friends in other industries they say, \"All you talk about is cars. Will you start talking about us.\" I said, \"No, I like cars. I like cars.\" But when I do, I devote a lot of time because Mexico is becoming the car capital of the world. Whether you like it or not. True. And we're going to turn that around. You know, in Tennessee, a great state that I won by the way, by a tremendous -- You know, when I won, of course most of them of all fairness, so far I like it. But -- but when I win them I feel like a warm spot. Now, March 8th, Tuesday you got to do me one favor. You I'm self funding my campaign. I'm self funding. You got to get out and vote. Because I promise you'll be very happy. Oh, you will be happy with me. You more than most. Michigan, I tell you what? Michigan more than most because what's happened to you people is disgraceful. And Michigan more than most. You got to get out. I'm going to say it again later. But March 8th. Tuesday, Tuesday, Tuesday no matter what's happening, no matter what you're doing. If you get laid off on Tuesday, I still want you voting. I'll get you a new job. Don't worry about it. In a couple of years, you'll go home to your wife or you'll go home to your husband and say, \"Darling, I have so many job opportunities I'm going absolutely crazy. I don't know what's happening.\" As opposed to now -- now you get laid off. You don't know what's happening. So we're going to -- we're going to take care of it. But Tuesday, you have to go out. You know -- so I'm self funding my campaign. I'm putting up my own money. So I'm not controlled by the unions, I'm not controlled by anything. I'm controlled only -- But -- You know what? You have a representative union. I have to say this. You have a representative union. Who -- who is in a union? OK. You like your unions? You like them? Oh oh, oh oh, I said, \"You like your union? Nah.\" I don't know about that. Well anyway -- but you do love your industry, right? The industries. All right. So I don't want your money but I do want your vote. So on Tuesday you go on. OK? Now, we're going to get this thing -- we're going to get this thing going. So Tennessee was going to get a massive car plant and it was going to be -- they're going to manufacture a tremendous plant. And look, we want it within the United States. OK? I mean, we want it in Michigan but we wanted it within the United States, as our second choice in this room, all right? We don't want to go into Mexico. We don't want him going to lots of other places. We want to stop the cars from Japan. If Japan wants to send -- you know I was in Los Angeles, folks. I have never seen more cars pour in. I have never seen larger ships. These ships are massive and they pull up and these cars just roll right off the ship. And I've never seen anything like it in my life. You know we got NASCAR the other day. NASCAR endorsed us. You have to say, \"That's a hell of an endorsement.\" Right? That's like -- that's like getting the NFL. Ladies and gentlemen the NFL endorsed Donald Trump or ladies and gentlemen Major League Baseball endorsed Donald Trump. Think of it. Think of it. NASCAR endorsed us with many of their drivers. And Brian France, who's the head of NASCAR and an unbelievable guy, the great job he's done. And they just said, \"There's a movement and the people that are NASCAR fans are Trump fans and there's a tremendous movement.\" But when I'm thinking about these ships. Are these ships pull into Los Angeles? Biggest I've ever seen. They pull into the Los Angeles docks and I stood there and I thought of NASCAR because those cars were coming off that ship so fast so many of them and they're saying, \"How is that helping us really? Right. I want those cars made in Michigan. I want those cars made here. Right? Right? And you know what? The Japanese can do it. The Japanese can do it but let them make them here. They have so many cars. You know they give us these little spots, OK. We'll build a little plant there. We'll build a little one there, will keep the Americans happy. We'll build one here. They have stupid leadership. Let's keep them happy. We'll build one here. But when you see those ships fall in, any one of -- any cars that you see that's peanuts compared to what we're doing. You have to see, these cars were coming off the ships at like 50 miles an hour. I've never seen anything like it. So folks, we want them to build the cars here. You know when China, ordered some Boeing's and China is a tremendous abuser of our country -- and I love China, they're great. Their leaders are too smart for our leaders it's very simple. OK. And I have the smartest businessmen in the world. We have the smartest business people in the world in this. And right now, what -- you know what you have right now, you have political hacks negotiating the biggest deals. You know, no matter what business deal you do, like I'm the big businessman. I -- I have tremendous business . You know it's funny they keep talking about my little deals. They talk about water, which I still have. They talk about a magazine, which I still have. You know I have magazines, my clubs and they talk about little deals. They don't talk about the buildings that are 60, 70 stories all over the place. I'm building buildings all over. We're doing deals. Nobody talks about that. Why not? I mean, Forbes just came out and they said I'm worth four and a half for $5 billion and they have no idea. Actually they have no ideas much more than that but I won't tell them. But, they don't want to talk about the big deals, they don't want to talk about Trump World Tower. They don't want to talk about Trump Tower. They don't want to talk about 40 Wall Street. They don't want to talk about the Bank of America building in San Francisco. They don't want to talk about the city I built on the West Side of Manhattan. They don't want to talk about 1290 Avenue of the Americas. They only want to talk about, a steak. Oh yes, a little company -- a little tiny thing or Trump University which by the way I'll win that lawsuit so easy. I'll win that lawsuit sorry. And you know, it's sort of interesting with Trump University a small deal, but you know, a deal that they devoted a lot of time too. And frankly, everybody -- everybody -- Many of the people that took the courses, many many of the people had -- they signed report cards when they were completed and it got rave reviews. Everybody, good good good good. Then a law firm comes along says, \"Listen if we sue so they form a closed -- a class-action if we sue, we'll get your money back.\" So let's say, you took the course and you liked it, and then somebody comes, \"Hey, you liked your course? It's over, we'll get your money back\" You'll say, \"OK. OK.\" They all signed documents. I don't know even why? They all signed document we call them report cards saying, \"It's wonderful. It's great.\" So when they come to settle, I said, \"I'm not going to settle.\" And you know, the problem with settlers, when you settle, everybody sues you. I watch these banks -- you ever notice the banks they get sued -- they get sued over and over again. They have executives at the banks, which is ridiculous, they're being paid $50 million a year, some of these guys and they always settle. And I say to them, \"You're getting paid all this money. Why don't you fight the case?\" Well, it's the government. I said, \"You should fight the case. You should fight it right to the end and you make maybe a settlement down the end.\" But the problem is, when you settle cases, everybody keeps suing you. Does it make sense? When they have to go through a case, it takes years and years, like this case have been going on for four or five years. When they have to go through the pain, of really going through a case and really fight. I don't get sued very often. The reason I don't is they say, \"Oh, Trump will never settle.\" They'd like to go to the settlements. They sue him. Two days later, they have a lawsuit settled. They put a lot of money in their pockets, the lawyers sort of way. So Trump University I'm going to win that case. It's a civil case, not a big deal. I look forward to going to trial. I'm going to win that case but they don't talk about all of these massive buildings that they have. They don't talk about the city I built on the West Side of Manhattan which was a tremendous success. They don't talk about all of the deals we're doing all over the country and all over the world, actually. You know, Turnberry in Scotland etc. They don't talk about Doral, where right now we have the World Golf Championships. You saw that the Cadillac World Golf Championship. Sponsored by Cadillac. So right now -- and I'm supposed to be there and I'm here with you. I'm supposed to be there. I am right now. I had it marked for two years, I have right now. So we have the Cadillac World Golf Championships, Rory McIlroy, everybody said, right? Phil -- Phil's doing well by the way, Phil Mickelson. He's doing great, 2nd place. So I'm supposed to be in Miami at my place. Watching these great golfers play golf and here I am in Michigan and I love it. OK? I am. I love it. So -- so we're going to talk about -- because one thing is guy Romney came out yesterday. I mean, the hatred he has, the hatred, the jealousy, the hatred, the -- It's hard to believe. Now look, let me just say, \"No, no.\" You guys should like him, right? I mean you should like him but, no. Remember the 47%? Remember when he made the statement 47% and in one speech he lost. Thank you. In one speech, he lost 47% of the voters. Can you believe it? He's not a smart guy. This is -- this is not a smart guy. But anyway, so he came out yesterday and the reason he doesn't like me is that I said, \"You shouldn't run because you're a choke artist.\" You ran -- You ran against -- You ran against Obama four years ago. It was a race that should have been an easy win. He made a fool of himself in the second and third debate. I don't know what happened to him. Honestly, I don't know what happened to him. He didn't campaign. He didn't campaign. What the hell did happen? Does anyone know? He what ? He was he didn't campaign. And you know, the sad part is, I really helped the guy. I mean, I gave him a lot of money. I raised a lot of money. I had two fundraisers in my apartment. In fact, one of them was such a rainy day that it ruined the Conference of my apartment. Everyone's coming in and I had hundreds of people. My carpets were ruined. I think I'm going to send him a bill for new carpet. But here's a disloyal guy. See he's -- he's an elitist. I don't -- see to me, I don't consider Malik, but you know. Hey, I don't consider Malik because I'm much richer than he is. He's worth -- you know I have a store. I have a store that's worth more money than him. Was a very into it . I -- I jokingly said that because I don't like Romney. I don't like him. He thinks he's hot stuff and he thinks he's -- I hate people that think they're hot stuff and they're nothing. OK nothing. But I was in -- I was in Iowa. I was in Iowa and we -- I -- I love Iowa. And by the way, do I love New Hampshire? Do I love South Carolina? And do I love Nevada? And do I love the last -- as you saw the SCC, we had the big night by far. Everyone's saying, \"Landslide for Trump\" And now on Tuesday -- and by the way, over the weekend we're going to do really well with Maine and lots of other places and I think that's gonna be great and then Tuesday comes. But what happens is with -- with Mitt, when you run, when people entrust you. When people entrust you. You people are entrusting somebody to carry the banner because you don't want to have Hillary. Hillary will be a disaster. So -- so when -- when they entrust you, when you know, you're given the trust of billions of people to go out, you've got to work hard. You got a what . And if you don't win that's OK. But Romney didn't work hard. Romney disappeared the final month and say what you want about Obama. He was on Jay Leno. He was on David Letterman, he was all over the place. And I used to say to the people, \"Where is Romney? What happened to Romney?\" Oh, is that a problem? I get the hell out of here, folks. Get him out. Out. Get him out. All right. Let's go. Get him out of here. You know, you'll never know. If I say it too rough -- Look at all the media back there. Look. Oh, look the cameras are turned. I love it. They turn the cameras. Oh, that's beautiful. That's so beautiful. By the way, I have to tell you about the media. They are the most dishonest people. They're worse than Rubio. And they're worse -- they're worse than Cruz. They are worse than Little Marco and they're worse than lying Ted Cruz. I'm telling you. Lying Ted, lying Ted. What's your name? My name's lying Ted Cruz. I lie about anything. You know this guy, I've got to tell you. He goes and he holds up the Bible. And then he lies. So most unbelievable thing I've ever seen. It's a little, it's an unbelievable haul . He holds up the Bible -- and here's the story, in South Carolina, that was supposed to be an easy victory for Cruz. I guess 67% -- percent are evangelical, right. Sixty seven percent evangelical. I won in a landslide and I won or -- I won the evangelicals by a lot. Now we have Jerry Falwell junior from Liberty University who sees everybody because they all come through Liberty University. Everybody goes there makes his speech and spends time with them. And Jerry Falwell junior endorsed me. I think it was a big endorsement. I will tell you, I think it was a really big and we have many, many, many ministers and -- and pastors that endorsed me. But I win with the evangelicals because you know what? The evangelicals they probably know I'm not perfect but they know I'm the best for security. I'm the best for the military. I'm the best for taking care of the vets. I'm the best for knocking the hell out of ISIS. And these other guys, they don't -- believe me, they don't have a clue. They talk. Their politicians, all-talk-no-action. So anyway, so just to finish off, so Romney's a bitter man. He looks like a bitter man. He's attacking really your front runner by a lot. And he wanted to run. And he was going to run. And I put up with it long enough and I said, \"Look you can't let him run. He's a joke artist.\" He joked the last time. And you know, if you ever see in sports -- now unfortunately, some of you may be joke artist. So be quiet about it, but don't worry about it. But do you ever see in sports -- you have it, just keep it to yourselves. Don't tell anybody. But you ever see in sports, once a joker always a joker. When you miss the kick one year, you miss the kick the next year. Once a joker, always a joker. And that's the way it goes. You know, that Jack Nicklaus is of the world. Jack was great. The Jack Nicklaus is of the world and -- and Fran -- and the Tom Brady's. I know some of you might not love Tom but I do. I do. You know in Massachusetts, I got close to 50%. I think I got over 50% of the vote. And you know what happened, Tom Brady was saying all these great things, \"Trump is a winner. He's my friend.\" And he's my friend. He's a great guy. But you know when Tom said that, I have to say, \"In New England, you cannot have a better reference in the great Tom Brady.\" Do we agree? You just care. So anyway, we won Massachusetts with record numbers. I got 50,000 more votes than Mitt Romney who is from there and ran for governor and the whole thing. So you know, although, he did lose -- he did lose very badly when he ran for the Senate. He got -- he got killed. So here's the story. Here's this. Get out of here. Get out. Out. Out. Out. That was the meekest protester that I've ever seen. We said, \"Get out of here.\" And he just, \"OK.\" That's the kind of protest we like, right? His uncle. Don't hurt him. Don't hurt him. I always say that. Because every once in a while we say, \"Knock him.\" And I get, \"How do I get killed? By these characters.\" You know, like they're legit, right? Like they're legit. You know, we had a case where Ted Cruz was asked about waterboarding. And he couldn't answer the question because you know, he was politically correct. And in all fairness to him, it was essentially what do you think of waterboarding. Would you approve it. Would you this, would do that. And he didn't want to get into it. And I understand that because he wants to be politically correct. You know, they're allowed to chop off the heads of people including ourselves but we're not allowed to waterboard. Do you think, they think we are the dumbest weakest people in the world? As they say. So they asked Ted Cruz about waterboarding and you can see his answer two debates ago and he's going like, \"Oh well, waterboarding. What do I say? What do I say? it's so vicious, it's so violent.\" You know, it's sort of the minimal minimal minimal and I don't know. I'm sure it's not pleasant but it's minimal. So he didn't want to get into it. He didn't sort of answer the question. They did, \"What do you think Mr. Trump? So I said, \"Well, throughout the Middle East they're chopping off heads of Christians. They're chopping off heads of people. Anybody gets in the way. They're drowning 30, 40 people at a time, in heavy steel cages. As far as I'm concerned, waterboarding is absolutely fine but we should go much further.\" And I've got a standing ovation. Standing ovation. Standing ovation. Right? Standing ovation. No pollster told me that. You know, these guys can't think without a pollster. So a lot of times, I'll go up in the debates, so I'll give an answer. I'll give an answer from the heart. I give an answer, whatever it is. Hey look, if it doesn't work out you know what's going to happen? I'm going to go back to my old job. That was a good job. You know you built a great company. You saw, I filed. I did the filing and the filing shows great great great company. Tremendous. And you know what? And I mentioned that for one reason, because it's the kind of thinking we need as our leader. We have to straighten out the 19 trillion in debt. All of the problems that we have. We have -- we have a lot of problems to straighten out. So anyway, so Mitt is a -- is a very sad guy. He is getting absolutely killed, if you look on the internet. People are disgusted by him and it's pretty -- it's a pretty sad thing. You know, it's very interesting though. So I was in Iowa and the Des Moines Register which honestly is a terrible newspaper. Terrible. Horrible. And not that because it's very liberal, which it is, but it's a terrible newspaper, a third-rate. It'll be out of business soon. So will the New York Times be out of business soon. So a lot of. I love it. I love it. But . When I hear the bad ones go out of business. But the New York Times is in serious trouble. It'll be out of business soon. So here's the story -- here's the story which is sort of amazing. The Des Moines Register comes to interview. Man I give them and they ask me about Mitt Romney and he's nasty. You know, he's a nasty guy's like a spoiled brat. So -- So I said -- they said, \"Well he's very wealthy.\" I said, \"Put him in his wealthy. I have a store that's worth more than him.\" So they wrote, I have a store but they didn't believe me. They didn't believe me. So they came the following day. We got a call, \"You don't have a store. This is an exaggeration. You don't have a store that's worth.\" Well he's supposed to be worth $150 million. So I said, \"What do you mean I don't? Here take it.\" They went out and retained three appraisers. And they looked at the store, the Gucci store on Fifth Avenue and 56th there. All right. Which I own. I said, \"Just look at this store. Don't look at the building, which I own. Just look at the store. \"Guess the store, on the corner of Fifth Avenue and 56th Street. So they said, they call up and said, \"You're right. It was worth between 400 million and 1.4 billion.\" So they did a story on my store. Now nobody talks about that, they talk about Trump University. Don't -- they don't talk about that. They don't talk about these great buildings that I have all over. The great jobs we're doing all over the world. They talk about you know, whatever they can find. And I've always been told, as a rich person, as a successful person, you cannot run for government. You can't. Because I do like a deal a second. I do many many deals. Most of them work out. Some of them don't work out, they turn out to be great because that's when you find out if somebody is a good deal maker. The market collapses in the middle of a big project or something happens. That's when you find out how good somebody is. That's when you find out if they've got the stomach. That's when you find -- that you go to those banks and you say, \"Bomb. Bomb. Bomb.\" And you beat the hell out of everybody. And I'll tell you what? I have made deals that should have been disasters into among the best deals I've ever had. Because during the bad time when the market collapses -- I mean, if you're building a big building and you're going up 90 stores but on the 45th floor the market collapses. Everything looks good, you're selling, everything's good then the market collapses. Now you're building a building and there's no market. It's a total disaster is not your fault. Your timing might be your fault. Because you know, I always like to pick good timing but not your fault. And then you go in. Yeah, that's true. You have to beat up the banks and you have to beat up everybody around and you just see. But many of the deals I've had that should have been disasters turned out to be among my best deals. That's when you learn about deal-making. That's when you learn who's a good deal maker. So important. So important. So anyway, so -- so let me just -- let me just -- let me just tell you a couple of things. We are going to do something that's going to be great. We are. A very big beneficiary is going to be Michigan because I talk about the car business all the time. Because the car business is being abused more than most other businesses, right? And a lot of the business comes from overseas and a lot of the business that you have is now moving to Mexico. Mexico is becoming the new China. China -- what China has done to our country is incredible. They have -- they have stolen more money from the United States. It's the worst theft in the history of the world. What they've done to our country. They've taken our jobs. They've taken our money. And I like China. The biggest bank in the world is a tenant of mine in China. They pay their rent on time, I promise. They have 400 million customers. It's the biggest bank in the world. I like China. They're great. But you know what? Their leaders are too smart for our leaders because that's not free trade. When you hear these stupid people that think they're very conservative or we are conservative. Donald Trump is not a conservative. You know why do they think I'm not a conservative? I believe totally in free trade but it's got to be fair trade. It's got to be fair. Got to be fair. See when they say free trade, they're talking about any free trade. And what they're really talking about is stupid trade. Because in China they send their products in here, right? And there's no barriers, no nothing. They send whatever the hell they want. How often do you see it where a product is really defective? Or where it poisons you kids. I mean, you see or -- they just send the stuff in. When you want to do business with China, folks. It's them impossible. When you want to get your product -- I have friends that are manufacturers. They can't get their product into China. When they do, they charge a big tax. They charge a very very big tax. And you know what? It's not going to happen like that anymore. We're losing $500 billion a year. We have a trade deficit with China. Five -- that means, they're sending in $500 billion but -- you know what 500 billion? That's a year. So then I hear -- then I hear the stupid people and some of the stupid people back there. One of them, whom I'm looking at. Then I see. No. No. Then I hear the stupid people, \"Donald Trump is not a conservative because he doesn't believe in free trade.\" I believe in free trade but It's got to be smart trade. It's got to be fair trade. It's got to be even trade. So what we have is stupid trade and we -- we're going to have very smart trade and we're going to stop this. Because how many nations -- And we can't go on like this. How many light nations can have a trade deficit of -- with one country $505 billion. OK? Nobody. You can't go on like that. And by the way, it's been like that for years. So you know, what we do? We roll up printing presses, folks. We roll up printing presses and that's why our middle income people are making less money. And our workers, who built this country, folks. Are making less money now than they did 12 years ago. OK? Not going to happen, folks. It's not going to happen. We're not going to let it happen. So all we do, is we roll our printing presses faster and faster and faster so that China and Japan and Mexico and Vietnam and India and all sorts of places continue to take money out of your hides. Look at it, we're going to change it. And you know what? We're going to have a better relationship than we have now. If you look at it now. We don't have a good relationship with any of these countries. So it's the worst of all worlds. No. 1 they're ripping us off. No. 2 they don't even like us. Look at China in the South China Sea. They're building one of the big military fortresses of all time. Airports and also military. They're not allowed to do it. They're doing it because they don't respect us. So they take our money and then they do things that they're not supposed to be doing. So it's going to change. And you know what? They're going to like us better. Believe it or not. I'm a unifier. I will unify the country. I'm going to unify blacks and whites. I'm going to unify. And we are not unified now. You know, when I -- when we had an African-American president the one thing I said is, I said, \"Great. Because we'll have much more unity. We'll have the African-Americans the whites will have something.\" Nothing happened. Nothing happened. It's worse now than ever before. We are going to unify our country. A recent poll came out. A recent poll came out, where the African-Americans -- I was at 25%. This is a Republican. As a Republican at 25% -- normally like Romney got 6%. Normally you get like 5, 6%, 4%, 3%. And one of the commentators said, \"You know, if Donald Trump gets 25% with the African-American community, this election is over. Trump wins. Trump wins\" But the other thing is, I'm going to bring in, Michigan. These are -- these are States just say you understand, that you know, a guy like a Marco or a guy like lying Ted Cruz. These -- these States that a -- a normal Republican -- because I'm not a normal Republican. Anyway, but a normal Republican cannot take your turns. Frankly, I hate to say this, cannot think in terms of bringing in Michigan. And if you don't bring in Michigan that's you know, it's tough. It makes you -- you have a very narrow road. Structurally, it's very hard for a Republican to get elected. Structurally. But I'm going to bring in places like Michigan -- I think we're going to win Michigan who I -- Who is going to vote? Who is going to vote for Hillary over Trump? You want Trump? Who wants Hillary? Who wants Trump? You'll be happy. Oh, you're going to be happy. Oh, you're going to be. So what -- what is happening, is I've been winning a lot of polls against Hillary and I haven't even started on her yet. Other than four weeks ago, where I had to give her a little shot. Right? You know, the sad thing Bernie Sanders got all the credit. Four weeks ago she said, \"I was sexist.\" Which I'm not. And I said, \"You can't call me sexist.\" And then I sort of alluded to the husband. I don't want to go through it right now but let's put it this way, they had a very tough weekend together. Right? And she totally silent. She totally stuff. And because of the tremendous press that got, not only did she have a bad weekend -- but Bernie Sanders looks like a genius because her poll numbers went down because of me. Her poll numbers -- and Bernie Sanders all of a sudden -- remember the big surge, Bernie Sanders. This guy doesn't have a chance. OK? Bernie Sanders is surging. Hillary's way down. That's four weeks ago. Take a look. The day I hit her. The day I hit her. And her husband -- Because he was fair game because he's in the campaign. I said, \"Let me ask you. Is he campaigning?\" Yes. OK. Then here's the story. Right? Right? And I said -- and I said, \"Hillary is an enabler, right?\" I said, \"She's an enabler.\" She enabled him. Get out of here. Get out. Out. Out. Get him out of here. That's strange. He looks like an Elvis impersonator. That's -- that's strange. Because all the Elvis impersonators love Donald Trump. They love me. That's very sad. That's very -- that makes me very unhappy. So -- so I said that, \"Hillary's an enabler.\" And that was the end of it. But she crashed. Remember that? She totally crashed and they gave Bernie the credit. Like he's some mastermind. Let me tell you something, Bernie never had a chance. Bernie's going down and it's over. Now the only thing that can save him, is if something happens to Hillary with regard to the e-mails. Which should happen. Should happen. Should happen. Do you remember though it -- it was a sad day. Do you remember when Bernie, when the microphones were taken over, when the two girls came up? And they took over the mics, they start screaming as he's speaking. And here's what he did, \"Oh, OK.\" And he went to the back of the stage and he watched them speak. I said, \"That's never happening with Trump, folks.\" That's never happened. That's not going to happen with your Trump. So -- so here's a story -- and I want credit. Press I want credit. For the big down moment in Hillary. OK? You never gave me credit for that, you gave it to Bernie. Bernie you should thank me. I want Bernie to make a speech today and thank me. Because if you -- If you look at that. I should get credit. Thank you media, you designers people. Thank you. World's most designers people, the media. They are disgusting. They know. They write stories about me that they know are wrong. But a -- and just before I get back to the cars -- because I do want to talk about cars and then we get the hell out of here. OK? But -- but I do want to talk about cars. But I have to say this, \"They will write stories, knowing that the stories are wrong.\" You will say, the New York Times. The failing New York Times wrote a story about me last week, that was so wrong. That actually called -- I usually I don't even go. I just say, \"Oh, forget it.\" Because the good news is, for the most part, it's just like newspaper. You throw it away the next day. Nobody even -- you know you make a big deal. You read the story so wrong. Nobody even sees it. It's like, does it matter? Fortunately, a lot of power has been lost maybe it's because there's so many different sources or whatever. But the level of dishonesty is absolutely incredible. So, it's good. But I want to do something. Because I think when they write false reports, you and I and anybody else, where they're writing falsely, should have the ability to sue like the New York Times. Now you know, this only makes it more difficult for me because now they'll come after me even more. But they can't be any worse than they are. They are real scum. So -- so we should have the ability to sue the New York Times or sue the Washington Post. We should have -- which is highly inaccurate about me. And look, the Washington Post was bought by the man that runs and -- and has a big chunk of Amazon, right? Right? Right? That's right. Get him out. Get him out. OK. There goes the cameras. Look at that. The only way we get those cameras to turn. Get him out. Hey, are Trump rallies the most fun? Right? Do we have a good time? We're having a good time. So the Washington Post is owned by the guy, who owns Amazon. Much bigger business. Owns a big chunk. Rich guy. He bought it. And he uses the Washington Post as his power tool. So that they don't raise taxes on Amazon and they don't raise taxes on other things he owns. And it's smart. I mean, I -- I have to tell you, it's smart. It's peanuts for him. So you won't see it closing or anything. They have more reporters than I've ever seen. No no. But we're going to -- look, we got to do something about it. Now he loses a lot of money with the Washington Post, but that's fine. Because it doesn't mean it's small money compared to what he has. But he uses that, as his lobbying tool as his political tool and he's allowed a tax deduction on his losses. So we can explain the whole thing. I've been explaining the whole thing. I actually think, he's a very nice guy. I think, it's a very smart move. But I just want you to understand, these newspapers are so corrupt and so dishonest. We had to do something about it. We got to do something about it. So -- so Tennessee was going to have a car plant. And what happened, they're all set. Big foreign company. And boom, one day they read, they've decided to go to Mexico just before signing. You all heard about it. It was a terrible thing. And Tennessee lost that plant. And I love Tennessee because they voted for me last week. I mean, Super Tuesday was incredible. Right? I love -- I don't forget those places that vote for me. The ones that don't, I can maybe forget them. But they haven't been -- they haven't been too many of them have there. But Tennessee was great. We won by a lot. And they're great people. Amazing people. Great country music by the way. But amazing amazing people. And they were going to have a car plant and at the last moment they went to -- to Mexico. Now, let me just tell you, So Ford -- and this has been my favorite source. I'll give you the A plus story, as opposed to the D, because we're in Michigan, right? So Ford, good company. Done a good job and all that. Good new person taking over and -- and the person that ran it is a fantastic guy. No complaints. But Ford decides to build a two and a half billion dollar plant in Mexico. And I'm saying to myself, \"That's a lot. That's a big plant.\" Now to do that, I mean, they don't want to talk about that. But to do that, they had to close plenty of things. Is that right? Do you know about it? I assume they closed a lot in Michigan to build that. Is that correct? You're -- you're in the company. So they closed how many plants that they closed in Michigan? To build that one big massive one. A lot? He thinks at least two. OK. OK. Get out of here. Get out. Out. This is amazing. So much fun. I love it. I love it. We having a good time? U.S.A. U.S.A. All right. You get him out. Try not to hurt him. If you do, I'll defend you in court. Don't worry about it. You know, one of the things that happened -- some of the -- he wasn't. He wasn't. But some of these protesters, they are really violent people. Now if we're tough with them, we get criticized. We had one guy in New Hampshire, actually. Who was a rough guy. And he was swinging and swinging and punching. And he was really going down for the count. And we had a couple of people in the audience who were equally rough and they took him out. They took him out. And no. Now they took him out and I'll tell you what? It was -- it was really amazing to watch. And you know, this was a seriously tough cookie. Guy look like an NFL football player. We had four guys they jumped at him. They were swinging and swinging. The next day we got killed in the press. That we were too rough. Give me a break, you know. Right? We don't want to be too politically correct anymore. Right, folks? So anyway. You know, it's very unfair. You know, they're allowed to swing and punch the hell out of people. But if we get a little bit rough in taking them out, oh, we're terrible people. You know, that's the way it is. It's one of the many reasons our country's going to hell. All right. So Ford wants to open a plant -- so two years ago, they announced they're going to open this massive plant in -- in Mexico. And I'm saying to myself, \"Hey, I was a very good student. I went to the best school, Wharton. You don't have to go to work and you don't have to go to a good school. You don't have to go to school.\" It's not going to do us any good. OK? It's not. All I know, is they're closing, as you say, at least two plants. These men works for Ford. But they closed plants somewhere in the United States. Plants are closing because this thing is massive. So they're going to make cars, trucks and ports. OK? So I'm saying to myself, \"Boy, that's a big deal.\" Now in the meantime, Carrier just announced they're going down to Mexico, you saw that. They just announced it. Divisions of United Technologies are now moving into Mexico. Nabisco from Chicago -- No more Oreos, folks. No more. Nabisco is closing their big plant in Chicago. They're moving to Mexico. We better be careful. We better be careful. We're losing our businesses, folks. Pfizer you know, is moving out of the United States. A big massive pharmacy. They're moving to Ireland. They're moving to Ireland. We better be careful. You know this corporate inversion is really a big problem. But Pfizer is moving and we -- we have a lot of company. That -- that will all change if I'm president because I know how to do it. OK. So here's what happens. So here's what happens and I put myself in the position. If a guy like Little Marco becomes president -- which I think is unlikely. I think it's unlikely. Look, when you are rated at 31% likability in your own state because he's terrible. You're going to have a hard time being president. But whether it's little Marco or lying Ted. One of the other let's say -- because you know we are down to four people. And the people are going against Hillary and she is not going to be tough to beat. She is so flawed. She's got such problems. And I -- and I do believe this. I do believe that, if the government does the right thing -- and I'm a big fan and a big believer in the FBI. If the government does the right thing under no circumstances will she be allowed to run. Even though, I most want to run against her. I most want to. So what happens -- What happens is, if you have one of these people or Hillary as president, what will happen is the following: No. 1 they're totally controlled by the special interests and their donors and their lobbyists, 100%. So -- and these are not stupid people. So they will look at it and they'll say, \"Oh, this is ridiculous. This is bad for the country.\" Then Ford will send its lobbyist up to see the president. And Ford will have raised many millions of dollars for him or her. And will send other people up special interest, donors, stockholders to see the president. Just say you can't do this. I gave you $5 million. You can't do this. I gave you a PAC -- these super PACs are a disaster, by the way. Just say you know. I don't have any super PACs. I'm the only one doesn't have a super PAC. I feel. I'm not so happy. I just wonder, Is it worth it? You know, I don't know if it's appreciated. I'm the only one. I don't have super PACs, I don't have money, I don't have people. Going out buying. I don't have to put it. I -- I just wonder, I'm spending a fortune. OK? Even though I spend less than anybody else -- and I'm in first place. I'm here, there. But still, it's a lot of money. And I wonder, do I get credit for not having super PACs? And do I get credit? Do I get credit? Because you know, I have friends that call me -- I had one friend from Michigan just called me -- actually, good guy. Rich guy, said, \"Donald, I want to give you $5 million.\" I said, \"I can't take it.\" \"No, no, no, you don't understand. I want to give it to you.\" I said, \"I can't take it. I'm not taking money.\" Other than the little donations from people that send in $200 and a hundred and fifty and $17. Because frankly, those are people that really believe. And those are people that invest. OK? And -- and it doesn't matter to a whole lot. And -- and how do you send it back to him? A woman sends me a check for $17.50 with a four-page note. What do I do say, \"Sorry I'm not taking your money.\" You know. So it's one of those things. You read the letter. You sit down all night and read those long letters. We get the longest letters from people because they -- they want hope. And usually, the less the money, the longer the letter. It's really an interesting phenomena. So anyway, so I'm not taking the money. I'm not taking the money. And I say -- I say to myself, \"I really.\" -- and I really believe this. I -- I know when you go into the booth you might like Trump, you might like somebody else. But nobody says, \"Well, I -- I sort of like Trump. And I like the other guy too, but I'm going to vote for the other guy.\" I know, that I don't get credit for the fact that I'm the only one that's not bought and paid for, folks. So big thing. It's a big. And -- and you know it's hard for me because you know, my whole life has been about taking money, right? Taking money. I take, take, take, take. I'm a businessman. That's what I'm supposed to do. My job is to take money. My job is in a sense, I hate to say it, to be greedy and I'm greedy. I go like, this more, more. I want more, more, more. Now, I'm going to be greedy for the United States. I'm going to be really greedy for the United States. So with Ford, so Ford is going to open the plant. Now, when Hillary or -- or Ted or any of these people, they become president. They're all taken care of. They're all bought. They're all 100% bought. So they know what's right. It's a bad thing. But they'll be told, \"You can't do it. This guy gave you 10 million. This guy gave you five million. And you know what? I understand, that psychologically they can't do it. Well, how can I do that? They helped me when I needed money. How can I say, \"You've got to move back.\" OK. So here's what I'm doing. When a company wants to move, I'm going to have the top people talk to them. And I will -- I know they're going to say, \"It's not presidential.\" You know, they're always saying, they said the other night, when I wanted and when I had the big victory in the Super -- you saw that. The SEC. the big big night. We won -- we won seven -- seven states. And then we came in second. I mean second is like a bad, bad thing. I mean, we -- we won. We won so much. I mean we won. It was so -- you know, sort of semi record-setting, I guess. But anyway, so we had this great night. But -- but here's the story, so what happens is I'm going to say the following. I'm going to say: No. 1 I'm going to call. They thought I was very presidential, that night. They thought I was so -- they said, \"Why -- \" No the press. They said -- I got great reviews. I made a speech afterwards. I had a news conference. I took questions. And they said -- during that night, where we won seven states. They said -- I was at Mar-a-Lago in Palm Beach, Florida. And they said, \"He was so presidential.\" Well, when I'm on a debate stage and I have all these people throwing things at me, you got to fight back. Somebody said -- somebody said, \"Donald, you're the leader. The prohibitive favorite. Just stand there and take it.\" I can't do that. Right? I can't. They actually said, \"Be presidential.\" I said, \"Does that mean, that I can't fight?\" So when little Marco spews his crap about the size of my hands which are big. The size of my head. Now he made a thing. He says, \"Well, Donald Trump has a -- let's see. What can I say? What can I say?\" So I looked at him. I said, \"Marco.\" No, I just wanted to set -- look at that -- that those hands can hit a golf ball 285 yards. Right? Those are good strong. I've never been criticized about the size of my hands before. I'm saying to myself, \"What the -- what's going on here?\" So anyway, so I have to -- So what do I do? For the rest of my life, I have the curse that I have little hands. Little hands. Take that guy. So -- so I said to my people, \"So what do I do? Do I stand back and just take incoming and act presidential.\" So now, I'm for -- Donald Trump is a con man. Donald Trump is this. And I've seen like that. You know what would happen? You know how many people I'd have in this room if I did that? I'd have about seven. I'd have seven. And they would be mostly the protesters that were thrown out. . Now, we can't take it. That's the problem with our country. Our country takes abuse from everybody. We don't do anything about it. When Vicente Fox gets angry because we are actually, telling him that, we're going to have a wall and we're going to build a wall and he's going to pay for it. He can't believe that this country is saying this to him. That's why I loved my statement when I said, \"Now it's got all.\" I've just loved it. I don't want to repeat it but I love that. OK. Are you ready? So here's what happens, these guys are going to do nothing. They -- You understand that. They're going to do nothing because they are bought and paid for. In fact, you have special lobbyists. It has Marco Rubio on the forehead. It's like stamp. You need Marco Rubio's vote? You call up a certain guy in Washington. You need Ted Cruz's vote? Who by the way, is totally under the ether of the oil companies. Which is fine. But that's the way it is. You need Ted Cruz's vote? It says, \"Call up so-and-so on K Street.\" Hundred percent, he'll take care of it. He gets his million dollars, $2 million and you have your vote. You know, it's just the way it works, folks. No good. With me? Nobody gave me anything. Nobody gave me. So here's what's going to happen. Here's what's going to happen. Smart people -- So they get called and they -- they immediately get turned off by their lobbyist, special interest and donors. OK? So that's the end. So Ford will build and -- and -- and by the way, three days ago, I'm reading the paper. And because there was no pressure put on Ford, they're now doubling down. Did you see that? They're now going up with more. That you know, the two and a half billion was two years ago. I've been talking about this for two years. And what a better place to speak than Michigan about this, right? Right? But I've been talking about this Ford plant because it bugged me. I've been talking about Carrier and I've been talking about others. But the Ford plant bugged me because it was so damn big. OK? And because it's the car industry. So what happened is this. So what happened is this. They will not do anything and I think we agree. Now, OK. Now let's assume Donald Trump becomes the president of the United States. No game. Now I'm going to be so presidential. I'll be so presidential, that you people will be screaming, \"Loosen up President. Loosen up.\" They'll be saying, \"You know, I wish the president would loosen up a little bit.\" All right. OK. But here's the thing, I had the best business men and best business women in the world. Normal. So what we're doing is this -- and they're from -- We have the greatest business people in this country. So I will have people but this is too easy. I want to do it myself because I love doing this stuff. You know, Obama likes relaxing and going on vacations. Me? I like working. I like working. I really do. I like it. So I want to do it myself. So I have Carl Icahn, I have all of these people. I want to do it myself. So here's what happens, I call up the head of Ford and I say, here's a story, \"I want you to enjoy your new plant. I hope it goes up on time, on budget, on schedule. I wanted to be a beautiful plant and I hope you produce beautiful cars, trucks and plants. And I hope you have wonderful labor relations with all of your Mexican employees. OK.\" But you've heard the United States because thousands and thousands of people are put out of jobs. And you're sort of leading the way into Mexico because since you've announced many other people have announced. And the problem is, we have very stupid leaders. We have leaders that are very stupid. But now we have a very smart leader. And here is the story. And here is the story -- and here's what some of the super conservatives don't like about me. Because I'm a free trader but I'm a really smart trader, right? So I'm going to tell them, \"Sorry folks, but every car, truck and part that you make and is shipped into the United States, you are going to pay a 35% tax on it.\" You're going to pay. So you're going to pay a 35% tax any time you ship a car, truck or part into the United States. Now they're going to say, \"Mr. President, no way. No way. We can't do that.\" Then I'm going to be besieged by lobbyists and all these people. Half of whom I know. I'm not going to do anything for them. I know them. Some are good guys, some are real sleazy. By the way. I want to tell you. These are serious sleaze. These are really dishonest people. These are players at the highest level. So I will be besieged by these people and I'll just laugh at them and hang up and that will be it. Within 24 to 48 hours, I will get a call from the head of Ford and he will say, \"Mr. President, we have decided that we will build our new plant in the United States.\" Now, that's not 90% sure. It's not 95% sure, not 98 point. That's 100%. One hundred percent. One hundred percent. And I want to do it myself. I'm sorry. And they'll say, \"I can't believe the president of the United States is calling Ford and Carrier.\" How about I call Carrier, air condition. \"This is the President of the United States. By the way, any air conditioning unit that you make and ship it to the United States, you're going to be paying a 35% tax.\" \"Oh, oh no, Mr. President, I promise, we're not leaving. We're staying in the United States. We love the United States.\" OK. Now they've got all kinds of formulas. They've got all sorts of nonsense. It's the only way you're going to keep your companies, folks. And if you want to keep your companies, get used to it because that's what's going to have to do. And -- and don't call it free trade anymore. Call it really, really, really, smart trade. All right? One of these guys said yesterday, \"Oh my God, Donald. Oh, is this stupid Romney. Stupid Mitt.\" He is a dumb guy. I -- I so -- I've always said he's a dumb guy. Stupid Mitt said, \"Donald Trump will ruin our economy.\" Well, our economy had last quarter GDP zero. We had no growth. You know, if China has seven or eight%. It's like a catastrophe. With us, we had no growth. Last quarter, no growth. We're growing and yet that's going down. We're going to be negative. We're going to be negative GDP. That means, that people are leaving. That means, that our industries are leaving. That's what's happening. He's -- I'm telling you, he's a stupid person. Here's the story. Here's the story. He said, \"We will ruin our relations with other countries.\" Now, China -- I'm very friendly with them at the highest levels. I love China. Great. But I made a lot of money on China. They pay me tens of millions for my condos. I told you, I have the biggest bank in the world is my tenant. We have I -- I own the bank of America building in San Francisco. A big chunk of it. 1290 Avenue of the Americas, one of the biggest buildings in New York City. Largest floor plates in New York City. All through China. And I don't mean friendly, I mean sort of unfriendly. But I think Chinese great. They're smart. They come at you in waves. They don't have a meeting with one person, they have like 15 people. So that if the one guy makes a mistake, they catch it. These guys are smart and we'll have some -- you know, hack. Sitting across the table from the 16, 15 killers. The poor guy doesn't have a chance. That's going to end. Okay. So here's the story. So Romney said, \"He'll ruin our economy. We won't be able to trade anywhere.\" Let me tell you something. Hey folks, when you lose $500 billion a year with a company. When you lose $500 billion a year with all of these companies that we do business with in China. But more importantly, when you lose 505 billion to be exact in trade deficits with China. With China. Who the hell cares if you do business or not? Who cares? We can't do that. We can't have trade. We can't have trade deficits of the magnitude that we're talking about. You know, breaking even is not great. But if you're broke even, I can see it. But you know, we're worried about we have politicians like a Romney guy. You know these are people from -- from the wrong age. When you have that kind of a loss -- Mexico. We have a trade deficit with Mexico of $58 billion a year. That's why a lot of people say these politicians come off the stage recently. They say, \"You can't get Mexico to pay for the war.\" I said, \"Of course we can.\" Now, they can. By the way, I could give them all the ammunition. They still would -- look at the Iran deal. A hundred and fifty billion dollars, we got nothing. And we should add our prisoners back four years ago. Not now. We should have been back four years ago. And we shouldn't have started the negotiations until they came back. That deal was made by incompetent people. So here's the story. Here's the story. So here's the story. So with Ford, they're going to move back. And they'll tell me -- and it'll be so beautiful and I'll be so happy. Even though I'm not supposed to make the call. But I'm going to make the call. Not presidential. But I'm gonna make the call because it's too easy. And they'll say, \"Mr. President, we're moving back. Would you like him to move to Michigan?\" I said, \"Yeah, I really want it move it to Michigan.\" OK. I want it to move them. So all of the polls and -- and they'll move back. We're going to stop this long slow. We're going -- we're going to lose. I tell you what, this election about to take place first because we're not going to -- By the time I take office, we're not going to have any companies left in this country. China has taken alone millions of jobs. Thousands and thousands of plants and factories. Thousands. You wouldn't believe that. But then, I gave that -- actually gave me a number of 50,000. I can't believe. So I'm not going to say 50,000. But I hear 50. But let's just say thousands. They've taken thousands of plants and businesses and we're going to stop it. We're going to stop it. We have rebuilt China. Now China is just one. And I use that because it's by far the biggest and it's the biggest abuser. But China -- But Mexico, I'll tell you what, for your industry, Mexico's a disaster. Mexico is to the car industry. Mexico is a total and complete disaster. Now, in all fairness to Michigan, we're going to try and get him to go to Michigan. But you know what? At least they got to stay in the United States, right? They have to stay here. They've got to stay here. And they're going to stay here and ideally, they're going to stay in Michigan. So here's the story, folks. When I first started, it was about trade. It was about the border. Then you had the horror show in Paris. And by the way, I will protect 100% the second amendment. The second amendment. I will repeal and replace Obamacare which is a catastrophe. I will totally terminate Common Core. Education will be a local. And I will totally, totally, totally rebuild our military. It'll be bigger and better and stronger than ever before. And nobody will -- nobody will mess with them. And one thing and I have to say this because I say it all the time. We have to take care of our vets. Our vets are being treated horribly . You know our vets -- this is a number that's hard to believe also. Thank you. Thank you. Thank you. Our vets are being -- just treated horribly. Think of this, 22 suicides a day. Twenty -- Is that -- It's not even a believable number. Twenty two suicides a day, a day. So we're going to do -- we're going to help our vets. Right now, illegal immigrants are treated better than many of our vets. Not going to happen. It's not going to happen. But today, was special because it's Michigan. I did want to talk about industry. I didn't want to talk about the cars. That's why I spent so much time talking about cars. We're going to bring the industry back to Michigan. We're going to bring a lot of industry back to our country. Someday, Apple is going to make -- someday, Apple is going to make their iPhones in the United States and not in China. And it's not going to be too far off. We're going to make it, so that they do that. We're going to make it so that it makes economic sense for them to do that. Because we have people in Washington that truly don't know what they're doing. So this has been an amazing honor. This is an amazing place. An amazing state. We're way way up in the Michigan polls. And I want to keep it that way. You know the polls don't mean anything. Because the worst is, your way up and you win by a little bit and then they say, \"Oh, he had a bad day.\" We got a show -- just do me one favor. Give me that big margin. I want the margin because it gives us more power. Right? So on Tuesday please, everybody. No money. I don't want anything. I just want you go out and raise your hand. Raise your hand. Go out. And vote. I love you. I love you Michigan. I love you Michigan. Thank you. Thank you Michigan. Go out and vote. You're going to be very happy. Thank you everybody. Thank you."}