{"id":435,"author":"Donald Trump","title":"Speech: Donald Trump in Cadillac, MI","date":"2016-03-04","link":"https://factba.se/transcript/donald-trump-speech-cadillac-mi-march-4-2016","paragraphs":["Thank you, Michigan. Thank you. Thank you. USA, USA, USA. Well, I want to thank everybody. This is an amazing turnout. This is a record. Outside we have 4,000 people, you do know that. Well, meaning when I'm finished with you I'll go see them for a couple of minutes. But you got the prime location.","Great. And you set a record today. Biggest crowd they've ever had here so that's beautiful. A lot of things are happening. The new polls came out CNN a couple of days ago, 49% for Trump, right? Lightweight Senator Marco Rubio 16 Lying Senator Ted Cruz 15 Kasich is at 6. So that's the new CNN poll.","So I thought I'd give you that. It's nice. I love those polls when they're good. Now if they're no good. I don't report them. People always say why do you always talk about the polls? They said when you're number one, you talk about it. If you're number two, three, four, five, six, seven. When we had 17 people, somebody was 17, I wouldn't talk about the poll if I was 17, right?","So I just want to thank everybody. Special place. Great state. And remember on Tuesday, you have to get out and vote. Otherwise, we're all wasting time. You got to get out and vote. Got to get out and vote. I just had another group. We had a fantastic group at a different pardon and they're very much into the world of automobiles and cars, and I actually devoted most of the speech to that, and what's going on with the car industry and how Mexico is taking our business away from us. We're not, we're not letting it happen anymore, folks.","Japan, Mexico every place. I mean, they're all, they're all taking it away. You know, we're like the people that don't know what they're doing. That's not going to happen anymore. That's not going to happen anymore. So we had a whole day of that and we had an amazing group of fantastic -- a massive room and it was packed.","It was packed and they're all packed because people are tired of being pushed around. You know in a certain way, I used to say it's the silent majority, but it's really not a silent majority anymore, you know. It's a very, very noisy majority. Very, very noisy. And you know, the establishment people, the people that lost the last two elections, and frankly, would have lost more than that.","I mean, they are losing. They are losing a lot. But they have no clue. They have no clue. They don't know how to win. They don't know. I love you, too. Even though it's a guy. I love you, too. I love the people. I love my people. You know we have -- every poll said that Trump has people.","They won't leave him. It doesn't make any difference. They love him. And I'll tell you, I love you and I mean that too. Loyalty. You know some of these people have like a 10% loyalty meaning if they sneezed in the wrong direction they're gone. With me, I think I can do almost anything and you're with me, right?","We had a good debate last night. Last night was great. I enjoyed it. I thought it was going to be even tougher. It was pretty nasty actually. But I thought it was even going to be tougher. You take a deep breath. You walk in and then you go boom, boom, boom. But it was, it was really, it was really interesting.","And every one of the polls, every single one of them, Drudge and everyone, Drudge is an incredible guy by the way. But Drudge and all of them, every single poll had me winning big league. So that's good. I like that. Don't we love to win? I love to win. You know our country does not win anymore, you understand that.","And we don't win with our military, it's depleted. We can't beat ISIS, OK? Can you believe this? You know there was a time when we could beat Germany. We could beat Japan. We could beat anybody. Today, we can't beat ISIS. Well, that'll change very quickly. I would tell you. It'll change very quickly. That's going to change so quickly.","We're going to win so much. So what I thought I'd do is talk a little bit about trade because you don't like what's happening. You don't like to see what's happening with your manufacturing businesses in particular. And it's -- and we're not going to let it happen anymore. We're not going to let it happen.","We have trade imbalances that are so ridiculous with Japan and China and India, every place. I mean, it's not a question of a couple of places. China is the great abuser. You know they're the best of all in terms of size, in terms of magnitude. We have rebuilt China. They have taken our jobs. They've taken our money.","They've taken everything. And by the way just so you understand, I have a great relationship with China. I just extended the lease on the largest bank in the world, the Chinese Bank. Four hundred million customers, think of that. Four hundred. That's bigger than our country, OK? They're 400 million customers and they're great.","They're wonderful. I deal with the -- I mean, I sell apartments to them for tens of millions of dollars. I got the Bank of America building in San Francisco, in 1290 avenue, the America's big, big chunks, and I own that. I own -- by the way, I own many, many big jobs, many, many big buildings all over the place.","We're building all over the world. We have many jobs going on right now. We're signing new deals, of course, a lot of those deals, I'll just have to let my kids handle I guess if we win, right? Because I will have absolutely no interest in those deals. I will only have interest in one thing, Making America Great Again, much more too.","Much more too. Much much more too. And so I just look and you know, it began on June 16th when I came down the famous escalator ride and I came down and I've never seen so many cameras. I always say I joke it was like the Academy Awards. I've never seen so many cameras in Trump Tower in New York. And I made a speech and I talked about illegal immigration and all of a sudden it became like a storm.","It was unbelievable. And it was a tough period actually because I had no idea that I hit something so severely and that was something, I knew it was a big problem, I didn't know to the extent of the problem. It turned out to be a much bigger problem than anyone knew. I was right 100%. I shot to the top of the polls and I've been there ever since.","I mean, we've been there ever since. Build the wall. Build the wall. We will build the wall, believe me. Believe me. And who is going to pay for the wall? Who? 100%, folks. 100 -- I don't mean like, I don't mean like 99.2%, I mean 100%. So we have a trade deficit with Mexico of $58 billion a year.","We have real geniuses negotiating these deals, right? We lose $58 billion a year. The wall's going to cost $10 billion. So immediately you say, well, if essentially they're swapping out $58 billion and if the wall's going to close $10 billion, there aren't too many people that have to be totally genius to know we are going to have Mexico pay for the wall.","You know these, these politicians come up here like lightweight Marco Rubio, like lying Ted Cruz. He gets in and he holds up the Bible and he talks the Bible and then he puts the Bible down and then he lies. I never saw a guy lie like this guy. I call him lying Ted. He's lying Ted Cruz. He can lie about anything.","And you know it's interesting. The Evangelicals who I love. They got wise to lying Ted Cruz. And you know what, I have every single poll now I'm winning with the Evangelicals. I won in -- I won in South Carolina. I won -- they don't like liars. They don't like liars. These are very smart people and they're wise to it. So it's been amazing because he was supposed to win in South Carolina with 67% Evangelicals and I won in a landslide.","And I won with Evangelicals substantially too by a lot. And in Nevada, I won with Evangelicals. I win with Evangelicals. It's been an amazing thing. So we had some amazing wonderful places. I've gotten to know so many parts of New Hampshire. I love New Hampshire because that's the start. And by the way, I made a pledge to New Hampshire.","They have a And you drive through the roads in the back valleys and you see these magnificent trees and everything's so beautiful and there were a couple of days where it's snowing. I said please don't snow on Election Day, please, please. I looked up please don't let it snow and it stopped snowing.","Just in time. And I won that one in a landslide and it was -- it was great. And Nevada, Nevada was won in a landslide. But in New Hampshire, so I made a pledge to them. They have a tremendous -- you would look and you'd say this can't be possible. They have a tremendous drug problem in New Hampshire. It's a heroin problem and so do you.","And by the way, by the way, so does the whole country, OK? So does the whole country. And I made a pledge to them and it goes for the country. We're going to stop these drugs from pouring in and destroying the lifeblood of our country. We're going to stop it. This is why when we say wall, we're going to build a wall.","That's going to be a real wall. It's going to be a wall that works. It's going to be a wall that people aren't going to come through with their trucks. They drive over. We have walls this big. They drive over the wall. Did you ever see the picture of the ramp? They do a ramp up, down. Trucks loaded up with drugs into our country.","We get the drugs, they get the cash and it goes back into Mexico. Not going to happen anymore, folks. So we're going to stop it and we're going to build a real wall and you probably saw the -- and it's going to be -- see that ceiling right -- that ceiling is peanuts. That ceiling is peanuts.","Well, you know the story. When Vincente Fox, right? He came out and he used the F-word. He used the F-bomb. He threw out the F-bomb. Can you imagine if I did that? I wouldn't be allowed to be here today. It would be a national disgrace. Nobody even called him on it. He said we will not build a you-know-what wall and we will not pay for the wall.","Now, it's sort of interesting. His anger was so incredible and it wasn't because of the wall. It was because somebody was actually telling them that it's not going to happen that way anymore. They're not used to it. Mexico and all of these other countries. I have a great relationship with Mexico and the Mexican people.","I employ thousands of Hispanics, thousands right now. Over the year tens of thousands, over the years. And I understand -- these are great people but their leaders are too smart for our leaders. They're too cunning. They're too quick. We don't know what the hell we're doing. We have people in Washington that don't know what they're doing.","We have great Border Patrol people. And if we had -- if we let them do the job even before the wall gets built and which is getting built anyway. But if we let them do their job -- these are great people. I went to Laredo, Texas at the invitation of Border Patrol and they're devastated. These are great people that want to do their job.","And they're told to stand back and people will walk right through. Just walk right through. We have no control and without a border, without strong borders, you don't have a country, folks. You don't have a country. So we're going to straighten that out. But I was interested when he said that we will not pay for that wall.","The anger on his face, the anger and I watched him, and I said, that anger is not about paying for the wall. It's that somebody would actually speak back and would actually look at them and say well, this is the way it's going to be because they used to -- think of it. We lose $58 billion, we have a trade deficit of $58 billion with Mexico.","So when these lightweights come up to me and they say you can't get Mexico to pay for the wall I said 100%. I said 100% not, not 99%, I said 100%. They say how can you get them? Now, you have to understand, three months ago they said you can't build a wall. Now, they're all saying you can. In fact, when Fox was interviewed he said, we won't pay for the wall.","He used to say we won't let you build a wall. So we've come a long way. Now he knows the wall is going to be built. But as I explained to these people, these people that I'm running against, nasty people, they're nasty. As I explained to little Marco and the other one, I said look, I said Marco, Marco when you're losing $58 billion, when you have a trade deficit of $58 billion, it's really, really, really easy to get a $10 billion dollar wall built and they will pay, OK? It's really easy but I don't think he understood what I meant, right?","We understand. So it's going to happen. It's going to happen but we need somebody. We need somebody that's done great in business and we need somebody with a business instinct. And believe me, we need it -- bigger, bigger than that. One example, we have now $19 trillion in debt. Nobody even knows what that means, $19 trillion.","We have the greatest businesspeople in the world in our country and we don't use them to negotiate trade deals and they're dying to do it. They're dying to do it. They called me. Carl Icahn, a great, great guy. Carl Icahn, we have others, the best in the world. They want to do it. They don't want money. They don't want to be paid.","Right now we have political hacks negotiating the biggest deals. When China negotiates they have waves of people. All the smartest people, they put their smartest people, negotiate with the United States, drained them of their money, drained them of their jobs, bring the jobs back to China and I'm not knocking China.","I think China's great. But again, they're too smart. I want our leaders to be the same way. I want our leaders to do that. So we're not knocking them. You know the anger of all of us is not with China and is not with Mexico, the anger is with our leaders because we have people that don't know what the hell they're doing.","They don't know what they're doing. They don't have a clue. Look at the Iran deal where we pay $150 billion for the worst deal I've ever seen in my life. We pay $150 billion, we get nothing. Those prisoners should have been back years ago. We should have gone in. OK, here's Trump, right?","I say, let's say I took over that deal. First of all, and it's for -- do you ever see a deal took so long. So let's say three or four years ago I go in and I say, fellas before we start negotiating, you have to let the prisoners go. You got to let them go. You don't want him. We do want him. It'll make it easier for us to make a deal.","You've got to let him go. Now, the Persians are great negotiators. They really are all through history. The Persia -- persian gotten -- negotiators have been great. I say you got to let it go. They'll say no, and you know what you do, you stand up. Bye-bye, bye, everybody. Enjoy your stay. See you soon and you leave and you leave.","Then you go out and you double up the sanctions. You now double up the sanctions. You choke them with the sanctions, right? And within 24 hours you're going to get a call. You've got the prisoners. Come on back please negotiate. When the prisoners land, they're on our soil, I would hit them with the second point.","You know the $150 billion, fellas? We don't have it. We owe $19 trillion, we can give you the $150 billion. We love you. We love you. We think you're the greatest in the world. We really want to help you but we can not give you a -- my father told me that. I learned from my father. He used to say you're too rough, you're too tough.","You don't have to be that tough. He'd probably like me to be a little bit softer in the debates. Actually, I'm thinking about maybe I'll be a little bit softer on little Marco, little Marco. No? But that means you disagree with my father. That's no good. We can't do that. But my father used to have it -- he'd say Donald, darling.","He loved me. He really loved me. He'd say Donald take the lumps out, take the lumps out, be softer. Just don't tell him, no. Just soft. So here's what my father would say. Fellas, we're bust, we have no money. We owe $19 trillion. We want to give you the money but we don't have it. So we're not going to be able to give you the $150 billion, OK? Now, I understand my father because that way, you know, they would get angry but not as angry.","So here's what I would have used to said if I didn't have a good teacher, my father. I would have said we're not giving you the $150 billion and they'd be so furious it would take them a while to recover. This way, we say, fellas we don't have it. We owe $19 trillion, we owe $1.7 trillion to China. We owe $1.5 trillion to Japan.","How do you like that? They come in, they sell their cars, we owe them money. I mean think of it. They sell us cars. They take over our businesses and we owe them money. The whole thing is so crazy. It's going to change, folks. It's going to change. It's going to change. So what would happen if the Iran deal is then we now we have our prisoners back.","Now, after a few days, they'll get used to the fact that they're not getting their $150 billion because you would have done two walks. You would've walked in the prisoners and you would have walked when they got angry about the $150 billion. But again, you go back and now you negotiate a deal, OK? Now you know.","Because on nuclear, it's a good thing to negotiate a deal. But we'll make a much better deal than they make us -- that deal is horrible. We lost every single point like Sergeant Bergdahl. We have a spy. We have a traitor. He's a traitor. He's a terrible traitor. He left. He was all into what their life. I don't think he likes their life so much anymore.","They treated him pretty rough. I'd like to take that guy, I'd like to fly him over, drop him right back where he came from. I'll tell you. But, but think of it. Think of it, Bergdahl. So we knew he was a traitor. We lost five and maybe six people got killed, young, beautiful soldiers got killed looking for him, right?","We had a General and a Colonel interviewing him -- the people he worked with. They knew he was a traitor. So you know it's one thing like we didn't know which is bad if we didn't know. But you can understand that. But we knew he was a traitor when we were negotiating. So we get Bergdahl, a dirty, rotten traitor, right?","And they get five of the people they most coveted. They get five of these killers who will soon be back on the battlefield, already are some of them trying to kill everybody including us, right? This is the way we negotiate, not going to happen anymore. Not going to happen. Those days are gone. Those days are gone.","Those days are gone. So I just want to tell you that so many changes are going to be made. We're going to be like the smart country, not the stupid country because right now people look at us, we're like the big bully that gets beat to hell all the time. And we're not going to let that go. So what we're going to do and I'll tell you just briefly because I know you're hot as hell in this room.","By the way, this room does not have lots of air conditioning, do we agree, huh? Well, it wasn't even built for this crowd. You know this room was built for what? basketball. Yeah. A nice little basketball but it wasn't built. This is your all-time record crowd in the history of this room and it'll never be broken.","It'll never be broken but we're going to do a lot of things. Number one, we're going to terminate, we're going to absolutely terminate and replace Obamacare. It's going to be great. It's a disaster. You're having increases of 25%, 35%, 45%, and you don't get coverage like you were supposed to get and you don't have your doctor by the way, and you don't have your plan.","You were lied to. It's going to be terminated and it's going to be replaced with something that's going to be terrific and a lot less expensive and much better coverage, OK? We're going to get rid of Common Core. We're going to educate your kids locally. We are going to educate your children locally. Just scream where have you been, right?","Where's the guy? There's my guy with that beautiful beard. Look at that beard. Where have you been is right. Where have you been? You know it's almost like, it's such common sense. Somebody said Donald Trump is a conservative but he's not conservative on certain things. I am a conservative but it's called common conservative.","As an example, if China is charging our companies tax and making it impossible for you people to sell your goods and you have great manufacturers here in China and yet they sell their goods in from China to here with no tax, no prohibitions, just dump your stuff on us. What good does that do? And that's why we're losing $505 billion, OK? So we have to call it -- we want smart trade.","I want -- I'm a free trader. If everyone would free trade that's a different story. I'm OK with it but it's not free trade. It's not free trade when they don't have to pay tax, right? And we have to pay tax to get our goods in. It's not free trade when in order to buy planes from Boeing, Boeing has to build massive plants over in China to build planes.","And you know what they're going to do. Those plants will be -- those, those plants will be built and then China will devalue its currency. They're the greatest. They're like grandmaster chess players. And all of a sudden, Seattle, South Carolina -- and I love South Carolina because they gave me such an incredible victory two, three weeks ago.","They gave me -- and we're going to protect them. And I've been telling them you have those nice new Boeing plants but they're building bigger plants over in China. And when those plants are built, when those plants are built, and then they say listen we're going to devalue and then all of a sudden South Carolina and Seattle aren't building planes anymore.","You're going to see but that's not going to happen if I'm President. I can tell you right now. I can tell you right now. So we need smart trade. I don't even call it fair trade anymore. I call it smart trade. We need smart trade. We can't have dumb trade. We have dumb trade right now. It's called free market.","I'm for a free market. But the markets aren't free. If you look at what's going on with devaluations in Japan. It's unbelievable what they're doing, devaluation. You look at Komatsu tractors compared to Caterpillar tractors. Caterpillar's having a very hard time because they devalue the Yen to such an extent that it's very hard for Caterpillar to compete with some of these companies, in particular, a company called Komatsu.","Then you see Carrier move to Mexico. You saw that three weeks ago, right? It was all over because somebody had their cellphone on, these cellphones are wonderful sometimes, right? But these cellphones are wonderful but they showed the devastation of 1,400 people that just lost their jobs. And I'll tell you what, you may not call it free trade, but if I'm president I'm going to call up the head of Carrier.","I know it's not the Presidential thing to do but I don't need all of these great guys that I will have negotiated -- because it's too easy, it's just too easy. It's very unpresidential. A President Trump calling for the head of Carrier air conditioner and I would say very -- Romney doesn't know. Romney, this poor guy, he's so confused.","Here's a guy, by the way, thank you for mentioning that. Here's a guy, Mitt Romney doesn't have a clue. This poor guy. I watched him yesterday and the Internet is exploding. What's he doing? He's making a fool out of himself. I watched him yesterday and it was sad. By the way, I have a huge business.","They only want to talk about the little things you know and many of the things that he mentioned they're still going. He talked about water. He talked about different things. I have it -- it's all over the place. But I'll tell you what. I watched Mitt Romney yesterday and this is the problem with the Republican Party.","He choked. He should've won the election, should have won it easily. He was running against a failed President. That was an election -- and I backed him. I gave him money. I did everything for him, very loyal guy. I backed him and he lost. He lost and he lost big. He didn't lose close. He lost big. He didn't inspire people.","They stayed home. If people would have gotten out to vote. Now since I've been involved -- I don't know if you've been seeing the biggest story in all of politics is what's happening to the Republican Party and I'm getting zero credit for it. And I should get all because they're not coming in for a little Marco that I can tell you.","Millions of people are coming to vote. Millions and millions of people are coming to vote for the Republicans and joining the Republican Party because of me, because of me. And if I ever left they would go away as fast as I would. They would go away because they want commonsense, they want intelligence. They don't want this stupidity that they've seen for the last long period of time.","And the biggest story in all of politics. One of the biggest stories, period. It's on the cover of Time Magazine this week and I've been on the cover of Time Magazine so many times in the last three, four months. It's like almost like, Am I on the cover of Time this week? The biggest story and the best story I've almost ever had, three or four weeks ago, the cover of Time Magazine wrote a story about us all of us together.","It's a movement. It's a movement and, and they described it so beautifully. The writer, the writer was amazing. They described it so beautifully, so incredibly. And I'm on the cover this week. Actually, it's the same writer and it's a good story. But the one that really hit the pay dirt was the one from three or four weeks ago because they were describing a movement that is so incredible.","That's never happened before. That's never happened before. And one of the biggest things in all of politics for many, many decades is what's going on with this sleepy old party, the GOP where we were losing, losing, losing where structurally, it was almost impossible to beat Hillary Clinton which I'll do easily, easily.","and millions of people are voting. And millions and millions of people are voting in the Republican Party and you know where they're coming from? The Democrats are just switching over and they're independents and this hasn't happened for years. And I will tell you, I will take 100% credit for it because that's the story.","They're coming over to vote for us, to vote for us. I'll take the credit with you because they're coming over to be with us and to vote for us. The enthusiasm, one guy said today, he was actually a very good pundit, smart and he was a Democrat. And they said let me tell you, we don't know what's with this Trump guy but we're concerned.","We never saw anything like this. Millions of people are coming over. You look at what happened in South Carolina where we had so many more people voting, so many more people are voting for the Republicans. What? Get him out of here.","Get him out. Get him. These people. Beautiful. He's a friend. He's a friend of Mitt Romney. But millions of people millions and millions of people are coming out and they're voting Republican now instead of Democrat. And nobody's ever seen a movement like this so it's a great thing. It is a movement, folks.","It's an incredible movement and it's a great thing. Thank you. I want to -- by the way, I just watched that. I want to thank our police officers. We have great, great people. They don't get the credit they should get. They don't get the credit they should get. You know you'll have one incident which is a bad incident.","Maybe it was a mistake. Maybe it was a bad apple. Who the hell knows. But it's on the news for weeks and weeks and they don't stop. Our police officers are incredible and without them, we wouldn't be here right now, believe me. And by the way, I have such support. I think it's unanimous support across the country from the police and I just appreciate them very much.","Also our vets. We've got to take care of our vets. We've got to take care of our vets. So we had an interesting day, the debate was great. Mitt is a failed candidate. This is a guy who failed, failed, failed, didn't know what to do. Doesn't know what to do. It's a sad case but he's a choker. He just choked.","He choked, he choked almost as bad probably worse than Marco Rubio when Chris Christie who endorsed me by the way, when Chris Christie went after him in the last debate previous. I never saw -- I'm standing here and I'm looking at Marco and I'm saying is he OK? And I see the sweat pouring. And Chris is going at him and Marco, you know he's got that little flippant mouth but a lot of times it doesn't work under pressure.","And Marco is sweating, it's pouring down and then he repeats himself once, twice, three times. I said after the third time, I said well, what's going on? Four times and then a fifth time. And I thought he was going down for the count and I was ready to go -- because I wanted to show off. You know what a good athlete I am. I want to show the size of my hand so I could grab him, so I could grab him.","I could grab that guy like nothing, bomb, hold him up. And I didn't want him to get hurt hitting his head when he went down. But this is not what we need when we negotiate against China and Putin and all of these killers, all right? It's not what we need. So anyway, but, but get him out of here.","Get him out of here. Are these rallies the most fun, right? We have the most fun. Do we have the most fun? Yeah, get him out of here. Get him out. Get him out, so disruptive. Remember when Bernie Sanders, they took the mic away from him. That's not going to happen with us, folks. That's not going to happen.","Remember that? He walked away from the mic and he stood back and he watched these two young girls talk into the audience and they said we came to listen to him and he was standing in the back as two women took the mic away. Now, that doesn't happen to us. Get that guy out of here. Get him out. Get that guy out of here.","Get him out of here. Get him out. I think you should arrest him. Do you like him? I think he should be arrested. Arrest him. I think he should be arrested for what he just did and for the fresh mouth he's got. I would arrest him, officer. So I don't want to give any recommendation officer.","I would arrest him for a filthy, dirty mouth. And then we'll see what his mommy and daddy say when they have to go and bail him out. So what we do, look, so what we do is we take care of Obamacare, it's out. We take care of Common Core, it's out. We build up our -- oh, we totally build up our depleted military and nobody is going to mess with us. Nobody is going to mess with us. Nobody.","Nobody is going to mess. We're going to knock out ISIS so fast, folks, your head's going to spin, your head is going to spin. ISIS will be gone so fast. Can you imagine General Douglas MacArthur, the great Douglas MacArthur or Jet -- how about George, how about George Patton?","These guys right now, they're spinning in their graves, they don't believe what's going on. How about the unpredictability? We have a President that gets up and he said we will attack them here. We are then going to leave. We're going to leave here. We're going to leave that -- this guy gets up and tells everything we're ever going to do. How about a couple of months ago he said we're sending 50 people over to Iraq or to Syria, right?","We're sending 50 people. Now by saying that he's just put a target -- you know, they're being looked at and watched. They will -- you know we're not dealing with a stupid enemy. They are looking for those 50 people like you wouldn't believe. Why can't he just keep his mouth shut and send your 50 people or send your 100 people?","But don't put a target on their back. We need unpredictability with our military. We can't have our Generals talking. Every time I turn on I have a General talking, saying what we should do, how we should do it, what we're going to do or we have a President saying we're sending troops here and then they're going to go there.","Why is it anybody's knowledge? Why is it anybody's business? Why do we have to tell the enemy? We want to go in a stealth way. We want to knock the hell out of ISIS, OK? And we'll do it. We want to take care of our vets. Our vets are being treated worse than the illegal immigrants that we're not letting in this country anymore.","The migration, the Syrians, you look and there's so many young, strong men. So many young, strong men. And you say what's going on? Where are the women and the children and they're there but not very many. We can't allow them to come into our country. We don't know who they are. We don't know anything about them.","They could be ISIS. It could be the great Trojan horse. We can't allow them to come in. We'll build a safe zone, a free zone, but a safe zone in Syria and we'll get the Gulf states to pay for it because we can't pay. We don't have the money to pay. We have to rebuild our country. We have to rebuild the infrastructure of our country.","Our country is going to hell as we spend trillions and trillions of dollars in places they don't want us. Look at Iraq. We spent $2 trillion in Iraq, $2 trillion. What did we get? Nothing, nothing. We spent $2 trillion, thousands of lives, wounded warriors all over the place who we all love. I love -- these are stronger than all of us put together.","Some of these young, great soldiers with no legs, no arms with worse. And these people have an attitude that's better than all of us. What did we get? So we have $2 trillion spent, we could have rebuild the most of our country with that. We have $2 trillion spent, right? We have absolutely, we have thousands of lives lost.","Young, wonderful people. Wounded warriors all over the place. We have nothing. And you know what happens? Iran is taking over Iraq. It's already done. It's done. Iraq has the second-largest oil reserves in the world. Some of the finest oil in the world. They have the second largest. We made it possible for Iran to go in and take over Iraq.","What the hell are we doing? Now, we shouldn't have been there but Obama should have never gotten out the way he got out. What a disaster. He gives the exact date. We are going to be leaving Iraq in 18 months and then he spells out the exact time. So the enemy naturally pulls back. What do we have to fight for?","They pull back. We leave and they just go in and take the place. So we can't even call Iraq now. So with all of this money, all of these lives, all of this bloodshed, we end up with nothing. Do you remember that I said keep the oil? Do you remember that? And I said that for a long time.","Keep the oil. I didn't want to go in but once we went in, when we were going out I said keep the oil. You know we used to have an expression to the victor belong the spoils. We're the only country that fights, we knocked the hell out of a country and we leave. You say what do we get?","What are we doing? What do we do? We're nation-building. Why are we nation-building over there? We want to nation build over here. We want to rebuild our country. We want to rebuild our country. So I said because I knew the power of that and I knew the kind of -- the kind of reserves they had. Nobody even knows that.","Nobody knows that Iraq has among the largest oil reserves in the world. So I said keep the oil. And I said it strongly and I said it loudly and I said it loud enough that they actually had a couple of Generals come out, and say well, we disagree with Mr. Trump. Why? Tell me why. Why do you disagree? They disagreed because politically, they disagreed, and they were told to say what they said.","So I said keep the oil. Well, you know has the oil right now? ISIS and Iran, OK? And the stuff they don't have they will very shortly have because Iran wanted to merge or wanted to knock out that country for many, many, many, many years, forever. And now we made it possible. They had two militaries that were of the same strength.","They'd fight and fight and fight and fight, then they'd rest. Then they'd fight and fight. Nothing would happen. They'd go 10 feet, 10 feet, 10 feet. Nothing would happen. So we obliterate the one military just totally obliterate it. And now, you know I used to say the greatest deal I've ever seen was the deal recently made with Iran and the United States where they got the $150 billion and we get nothing, OK? That's not the greatest deal.","The greatest deal is they got Iraq. They got Iraq. They got the second-largest oil reserves that we handed them on a silver platter. Now, let me tell you a little secret because I'm very good at this stuff. I mean, I really have -- I just for some reason, I've been very good at prognosticating. They're in Yemen and they don't want Yemen but Yemen has this very long border with a place called Saudi Arabia.","And they want to go and get these oil in Saudi Arabia. So what's going to happen. What's going to happen is very simple. Mark my words. I'm -- I've been saying the oil for years, and by the way, all of a sudden we started not taking the oil, bombing the oil. Now, it was ok to bomb the oil because we want to get in there and then you get Exxon Mobil and some of these great companies within about 12 seconds they'll have it rebuilt and it'll be just fine with brand new stuff, right?","And we take the oil but that -- we didn't use that. We didn't do that. What happened is we had a catastrophe called Paris. And when Paris happened people said, wow, this is getting really, really serious. Radical Islamic terrorism. Then we had in California happened, the 14 people, the two people, they became -- she, she probably radicalized him.","Something happened and they killed their co-workers, people that threw them parties for their baby, we killed them. And we've got to get smart, folks. We've got to be vigilant. We've got to be smart. We've got to be great, again. We're not great. We're laughed at throughout the world. We can be great again.","We can be so great again. I see it. I see it with the people. I meet with people. They're so incredible. I want to see Apple making their iPhones in this country. I don't want it made in China. I want it made this country and we're going to have that and we're going to have that. So I just finished by saying this, we haven't won in a long time.","We don't win with our military. We can't. We don't. We don't have the right leadership, probably at a military level, but certainly, at a Presidential level, we don't have the right leadership. We can't beat ISIS, right? We can't beat ISIS. That's going to happen so fast. You're going to see something so fast.","And a lot of it is attitude you know that. A lot of it is attitude. But we're going to win with our military. We're going to win on trade. We're going to win on the borders. We're going to win so much, folks. We're going to win and win and win. I sometimes joke I say, we're going to win so much that you people are going to get so tired of winning.","You're going to say, Mr. President, Mr. President, we can't stand winning anymore. Please give us at least a couple of losses and you know what I'm going to say? No way. No way. We're going to Make America Great Again. No way. So, so I just want to thank you and I have to leave it at this. Look, you have to do -- and by the way, this was a long drive to get up here.","My people said, oh, I think you could skip that one if you want. I said there's no way I'm skipping it, all right? Can you imagine? Can you imagine? This was a little bit of a long drive and I loved it. It was beautiful and I wouldn't miss it for the world and you people are great. But listen, you have to do this.","You have to go out on Tuesday. You have to go out and vote. You have to go out. I don't want your money. I'm self-funding. I'm putting up my own money. I'm not going to be subject like these guys. They're controlled by every guy that gives them money. I'm not controlled by anybody. I'm controlled by you.","I don't want your money. What you have to do is on Tuesday, go out and vote and we will Make America Great Again. I love you. I love you, Michigan. I love you. I love you. Thank you. Thank you very --"],"text":" Thank you, Michigan. Thank you. Thank you. USA, USA, USA. Well, I want to thank everybody. This is an amazing turnout. This is a record. Outside we have 4,000 people, you do know that. Well, meaning when I'm finished with you I'll go see them for a couple of minutes. But you got the prime location. Great. And you set a record today. Biggest crowd they've ever had here so that's beautiful. A lot of things are happening. The new polls came out CNN a couple of days ago, 49% for Trump, right? Lightweight Senator Marco Rubio 16 Lying Senator Ted Cruz 15 Kasich is at 6. So that's the new CNN poll. So I thought I'd give you that. It's nice. I love those polls when they're good. Now if they're no good. I don't report them. People always say why do you always talk about the polls? They said when you're number one, you talk about it. If you're number two, three, four, five, six, seven. When we had 17 people, somebody was 17, I wouldn't talk about the poll if I was 17, right? So I just want to thank everybody. Special place. Great state. And remember on Tuesday, you have to get out and vote. Otherwise, we're all wasting time. You got to get out and vote. Got to get out and vote. I just had another group. We had a fantastic group at a different pardon and they're very much into the world of automobiles and cars, and I actually devoted most of the speech to that, and what's going on with the car industry and how Mexico is taking our business away from us. We're not, we're not letting it happen anymore, folks. Japan, Mexico every place. I mean, they're all, they're all taking it away. You know, we're like the people that don't know what they're doing. That's not going to happen anymore. That's not going to happen anymore. So we had a whole day of that and we had an amazing group of fantastic -- a massive room and it was packed. It was packed and they're all packed because people are tired of being pushed around. You know in a certain way, I used to say it's the silent majority, but it's really not a silent majority anymore, you know. It's a very, very noisy majority. Very, very noisy. And you know, the establishment people, the people that lost the last two elections, and frankly, would have lost more than that. I mean, they are losing. They are losing a lot. But they have no clue. They have no clue. They don't know how to win. They don't know. I love you, too. Even though it's a guy. I love you, too. I love the people. I love my people. You know we have -- every poll said that Trump has people. They won't leave him. It doesn't make any difference. They love him. And I'll tell you, I love you and I mean that too. Loyalty. You know some of these people have like a 10% loyalty meaning if they sneezed in the wrong direction they're gone. With me, I think I can do almost anything and you're with me, right? We had a good debate last night. Last night was great. I enjoyed it. I thought it was going to be even tougher. It was pretty nasty actually. But I thought it was even going to be tougher. You take a deep breath. You walk in and then you go boom, boom, boom. But it was, it was really, it was really interesting. And every one of the polls, every single one of them, Drudge and everyone, Drudge is an incredible guy by the way. But Drudge and all of them, every single poll had me winning big league. So that's good. I like that. Don't we love to win? I love to win. You know our country does not win anymore, you understand that. And we don't win with our military, it's depleted. We can't beat ISIS, OK? Can you believe this? You know there was a time when we could beat Germany. We could beat Japan. We could beat anybody. Today, we can't beat ISIS. Well, that'll change very quickly. I would tell you. It'll change very quickly. That's going to change so quickly. We're going to win so much. So what I thought I'd do is talk a little bit about trade because you don't like what's happening. You don't like to see what's happening with your manufacturing businesses in particular. And it's -- and we're not going to let it happen anymore. We're not going to let it happen. We have trade imbalances that are so ridiculous with Japan and China and India, every place. I mean, it's not a question of a couple of places. China is the great abuser. You know they're the best of all in terms of size, in terms of magnitude. We have rebuilt China. They have taken our jobs. They've taken our money. They've taken everything. And by the way just so you understand, I have a great relationship with China. I just extended the lease on the largest bank in the world, the Chinese Bank. Four hundred million customers, think of that. Four hundred. That's bigger than our country, OK? They're 400 million customers and they're great. They're wonderful. I deal with the -- I mean, I sell apartments to them for tens of millions of dollars. I got the Bank of America building in San Francisco, in 1290 avenue, the America's big, big chunks, and I own that. I own -- by the way, I own many, many big jobs, many, many big buildings all over the place. We're building all over the world. We have many jobs going on right now. We're signing new deals, of course, a lot of those deals, I'll just have to let my kids handle I guess if we win, right? Because I will have absolutely no interest in those deals. I will only have interest in one thing, Making America Great Again, much more too. Much more too. Much much more too. And so I just look and you know, it began on June 16th when I came down the famous escalator ride and I came down and I've never seen so many cameras. I always say I joke it was like the Academy Awards. I've never seen so many cameras in Trump Tower in New York. And I made a speech and I talked about illegal immigration and all of a sudden it became like a storm. It was unbelievable. And it was a tough period actually because I had no idea that I hit something so severely and that was something, I knew it was a big problem, I didn't know to the extent of the problem. It turned out to be a much bigger problem than anyone knew. I was right 100%. I shot to the top of the polls and I've been there ever since. I mean, we've been there ever since. Build the wall. Build the wall. We will build the wall, believe me. Believe me. And who is going to pay for the wall? Who? 100%, folks. 100 -- I don't mean like, I don't mean like 99.2%, I mean 100%. So we have a trade deficit with Mexico of $58 billion a year. We have real geniuses negotiating these deals, right? We lose $58 billion a year. The wall's going to cost $10 billion. So immediately you say, well, if essentially they're swapping out $58 billion and if the wall's going to close $10 billion, there aren't too many people that have to be totally genius to know we are going to have Mexico pay for the wall. You know these, these politicians come up here like lightweight Marco Rubio, like lying Ted Cruz. He gets in and he holds up the Bible and he talks the Bible and then he puts the Bible down and then he lies. I never saw a guy lie like this guy. I call him lying Ted. He's lying Ted Cruz. He can lie about anything. And you know it's interesting. The Evangelicals who I love. They got wise to lying Ted Cruz. And you know what, I have every single poll now I'm winning with the Evangelicals. I won in -- I won in South Carolina. I won -- they don't like liars. They don't like liars. These are very smart people and they're wise to it. So it's been amazing because he was supposed to win in South Carolina with 67% Evangelicals and I won in a landslide. And I won with Evangelicals substantially too by a lot. And in Nevada, I won with Evangelicals. I win with Evangelicals. It's been an amazing thing. So we had some amazing wonderful places. I've gotten to know so many parts of New Hampshire. I love New Hampshire because that's the start. And by the way, I made a pledge to New Hampshire. They have a And you drive through the roads in the back valleys and you see these magnificent trees and everything's so beautiful and there were a couple of days where it's snowing. I said please don't snow on Election Day, please, please. I looked up please don't let it snow and it stopped snowing. Just in time. And I won that one in a landslide and it was -- it was great. And Nevada, Nevada was won in a landslide. But in New Hampshire, so I made a pledge to them. They have a tremendous -- you would look and you'd say this can't be possible. They have a tremendous drug problem in New Hampshire. It's a heroin problem and so do you. And by the way, by the way, so does the whole country, OK? So does the whole country. And I made a pledge to them and it goes for the country. We're going to stop these drugs from pouring in and destroying the lifeblood of our country. We're going to stop it. This is why when we say wall, we're going to build a wall. That's going to be a real wall. It's going to be a wall that works. It's going to be a wall that people aren't going to come through with their trucks. They drive over. We have walls this big. They drive over the wall. Did you ever see the picture of the ramp? They do a ramp up, down. Trucks loaded up with drugs into our country. We get the drugs, they get the cash and it goes back into Mexico. Not going to happen anymore, folks. So we're going to stop it and we're going to build a real wall and you probably saw the -- and it's going to be -- see that ceiling right -- that ceiling is peanuts. That ceiling is peanuts. Well, you know the story. When Vincente Fox, right? He came out and he used the F-word. He used the F-bomb. He threw out the F-bomb. Can you imagine if I did that? I wouldn't be allowed to be here today. It would be a national disgrace. Nobody even called him on it. He said we will not build a you-know-what wall and we will not pay for the wall. Now, it's sort of interesting. His anger was so incredible and it wasn't because of the wall. It was because somebody was actually telling them that it's not going to happen that way anymore. They're not used to it. Mexico and all of these other countries. I have a great relationship with Mexico and the Mexican people. I employ thousands of Hispanics, thousands right now. Over the year tens of thousands, over the years. And I understand -- these are great people but their leaders are too smart for our leaders. They're too cunning. They're too quick. We don't know what the hell we're doing. We have people in Washington that don't know what they're doing. We have great Border Patrol people. And if we had -- if we let them do the job even before the wall gets built and which is getting built anyway. But if we let them do their job -- these are great people. I went to Laredo, Texas at the invitation of Border Patrol and they're devastated. These are great people that want to do their job. And they're told to stand back and people will walk right through. Just walk right through. We have no control and without a border, without strong borders, you don't have a country, folks. You don't have a country. So we're going to straighten that out. But I was interested when he said that we will not pay for that wall. The anger on his face, the anger and I watched him, and I said, that anger is not about paying for the wall. It's that somebody would actually speak back and would actually look at them and say well, this is the way it's going to be because they used to -- think of it. We lose $58 billion, we have a trade deficit of $58 billion with Mexico. So when these lightweights come up to me and they say you can't get Mexico to pay for the wall I said 100%. I said 100% not, not 99%, I said 100%. They say how can you get them? Now, you have to understand, three months ago they said you can't build a wall. Now, they're all saying you can. In fact, when Fox was interviewed he said, we won't pay for the wall. He used to say we won't let you build a wall. So we've come a long way. Now he knows the wall is going to be built. But as I explained to these people, these people that I'm running against, nasty people, they're nasty. As I explained to little Marco and the other one, I said look, I said Marco, Marco when you're losing $58 billion, when you have a trade deficit of $58 billion, it's really, really, really easy to get a $10 billion dollar wall built and they will pay, OK? It's really easy but I don't think he understood what I meant, right? We understand. So it's going to happen. It's going to happen but we need somebody. We need somebody that's done great in business and we need somebody with a business instinct. And believe me, we need it -- bigger, bigger than that. One example, we have now $19 trillion in debt. Nobody even knows what that means, $19 trillion. We have the greatest businesspeople in the world in our country and we don't use them to negotiate trade deals and they're dying to do it. They're dying to do it. They called me. Carl Icahn, a great, great guy. Carl Icahn, we have others, the best in the world. They want to do it. They don't want money. They don't want to be paid. Right now we have political hacks negotiating the biggest deals. When China negotiates they have waves of people. All the smartest people, they put their smartest people, negotiate with the United States, drained them of their money, drained them of their jobs, bring the jobs back to China and I'm not knocking China. I think China's great. But again, they're too smart. I want our leaders to be the same way. I want our leaders to do that. So we're not knocking them. You know the anger of all of us is not with China and is not with Mexico, the anger is with our leaders because we have people that don't know what the hell they're doing. They don't know what they're doing. They don't have a clue. Look at the Iran deal where we pay $150 billion for the worst deal I've ever seen in my life. We pay $150 billion, we get nothing. Those prisoners should have been back years ago. We should have gone in. OK, here's Trump, right? I say, let's say I took over that deal. First of all, and it's for -- do you ever see a deal took so long. So let's say three or four years ago I go in and I say, fellas before we start negotiating, you have to let the prisoners go. You got to let them go. You don't want him. We do want him. It'll make it easier for us to make a deal. You've got to let him go. Now, the Persians are great negotiators. They really are all through history. The Persia -- persian gotten -- negotiators have been great. I say you got to let it go. They'll say no, and you know what you do, you stand up. Bye-bye, bye, everybody. Enjoy your stay. See you soon and you leave and you leave. Then you go out and you double up the sanctions. You now double up the sanctions. You choke them with the sanctions, right? And within 24 hours you're going to get a call. You've got the prisoners. Come on back please negotiate. When the prisoners land, they're on our soil, I would hit them with the second point. You know the $150 billion, fellas? We don't have it. We owe $19 trillion, we can give you the $150 billion. We love you. We love you. We think you're the greatest in the world. We really want to help you but we can not give you a -- my father told me that. I learned from my father. He used to say you're too rough, you're too tough. You don't have to be that tough. He'd probably like me to be a little bit softer in the debates. Actually, I'm thinking about maybe I'll be a little bit softer on little Marco, little Marco. No? But that means you disagree with my father. That's no good. We can't do that. But my father used to have it -- he'd say Donald, darling. He loved me. He really loved me. He'd say Donald take the lumps out, take the lumps out, be softer. Just don't tell him, no. Just soft. So here's what my father would say. Fellas, we're bust, we have no money. We owe $19 trillion. We want to give you the money but we don't have it. So we're not going to be able to give you the $150 billion, OK? Now, I understand my father because that way, you know, they would get angry but not as angry. So here's what I would have used to said if I didn't have a good teacher, my father. I would have said we're not giving you the $150 billion and they'd be so furious it would take them a while to recover. This way, we say, fellas we don't have it. We owe $19 trillion, we owe $1.7 trillion to China. We owe $1.5 trillion to Japan. How do you like that? They come in, they sell their cars, we owe them money. I mean think of it. They sell us cars. They take over our businesses and we owe them money. The whole thing is so crazy. It's going to change, folks. It's going to change. It's going to change. So what would happen if the Iran deal is then we now we have our prisoners back. Now, after a few days, they'll get used to the fact that they're not getting their $150 billion because you would have done two walks. You would've walked in the prisoners and you would have walked when they got angry about the $150 billion. But again, you go back and now you negotiate a deal, OK? Now you know. Because on nuclear, it's a good thing to negotiate a deal. But we'll make a much better deal than they make us -- that deal is horrible. We lost every single point like Sergeant Bergdahl. We have a spy. We have a traitor. He's a traitor. He's a terrible traitor. He left. He was all into what their life. I don't think he likes their life so much anymore. They treated him pretty rough. I'd like to take that guy, I'd like to fly him over, drop him right back where he came from. I'll tell you. But, but think of it. Think of it, Bergdahl. So we knew he was a traitor. We lost five and maybe six people got killed, young, beautiful soldiers got killed looking for him, right? We had a General and a Colonel interviewing him -- the people he worked with. They knew he was a traitor. So you know it's one thing like we didn't know which is bad if we didn't know. But you can understand that. But we knew he was a traitor when we were negotiating. So we get Bergdahl, a dirty, rotten traitor, right? And they get five of the people they most coveted. They get five of these killers who will soon be back on the battlefield, already are some of them trying to kill everybody including us, right? This is the way we negotiate, not going to happen anymore. Not going to happen. Those days are gone. Those days are gone. Those days are gone. So I just want to tell you that so many changes are going to be made. We're going to be like the smart country, not the stupid country because right now people look at us, we're like the big bully that gets beat to hell all the time. And we're not going to let that go. So what we're going to do and I'll tell you just briefly because I know you're hot as hell in this room. By the way, this room does not have lots of air conditioning, do we agree, huh? Well, it wasn't even built for this crowd. You know this room was built for what? basketball. Yeah. A nice little basketball but it wasn't built. This is your all-time record crowd in the history of this room and it'll never be broken. It'll never be broken but we're going to do a lot of things. Number one, we're going to terminate, we're going to absolutely terminate and replace Obamacare. It's going to be great. It's a disaster. You're having increases of 25%, 35%, 45%, and you don't get coverage like you were supposed to get and you don't have your doctor by the way, and you don't have your plan. You were lied to. It's going to be terminated and it's going to be replaced with something that's going to be terrific and a lot less expensive and much better coverage, OK? We're going to get rid of Common Core. We're going to educate your kids locally. We are going to educate your children locally. Just scream where have you been, right? Where's the guy? There's my guy with that beautiful beard. Look at that beard. Where have you been is right. Where have you been? You know it's almost like, it's such common sense. Somebody said Donald Trump is a conservative but he's not conservative on certain things. I am a conservative but it's called common conservative. As an example, if China is charging our companies tax and making it impossible for you people to sell your goods and you have great manufacturers here in China and yet they sell their goods in from China to here with no tax, no prohibitions, just dump your stuff on us. What good does that do? And that's why we're losing $505 billion, OK? So we have to call it -- we want smart trade. I want -- I'm a free trader. If everyone would free trade that's a different story. I'm OK with it but it's not free trade. It's not free trade when they don't have to pay tax, right? And we have to pay tax to get our goods in. It's not free trade when in order to buy planes from Boeing, Boeing has to build massive plants over in China to build planes. And you know what they're going to do. Those plants will be -- those, those plants will be built and then China will devalue its currency. They're the greatest. They're like grandmaster chess players. And all of a sudden, Seattle, South Carolina -- and I love South Carolina because they gave me such an incredible victory two, three weeks ago. They gave me -- and we're going to protect them. And I've been telling them you have those nice new Boeing plants but they're building bigger plants over in China. And when those plants are built, when those plants are built, and then they say listen we're going to devalue and then all of a sudden South Carolina and Seattle aren't building planes anymore. You're going to see but that's not going to happen if I'm President. I can tell you right now. I can tell you right now. So we need smart trade. I don't even call it fair trade anymore. I call it smart trade. We need smart trade. We can't have dumb trade. We have dumb trade right now. It's called free market. I'm for a free market. But the markets aren't free. If you look at what's going on with devaluations in Japan. It's unbelievable what they're doing, devaluation. You look at Komatsu tractors compared to Caterpillar tractors. Caterpillar's having a very hard time because they devalue the Yen to such an extent that it's very hard for Caterpillar to compete with some of these companies, in particular, a company called Komatsu. Then you see Carrier move to Mexico. You saw that three weeks ago, right? It was all over because somebody had their cellphone on, these cellphones are wonderful sometimes, right? But these cellphones are wonderful but they showed the devastation of 1,400 people that just lost their jobs. And I'll tell you what, you may not call it free trade, but if I'm president I'm going to call up the head of Carrier. I know it's not the Presidential thing to do but I don't need all of these great guys that I will have negotiated -- because it's too easy, it's just too easy. It's very unpresidential. A President Trump calling for the head of Carrier air conditioner and I would say very -- Romney doesn't know. Romney, this poor guy, he's so confused. Here's a guy, by the way, thank you for mentioning that. Here's a guy, Mitt Romney doesn't have a clue. This poor guy. I watched him yesterday and the Internet is exploding. What's he doing? He's making a fool out of himself. I watched him yesterday and it was sad. By the way, I have a huge business. They only want to talk about the little things you know and many of the things that he mentioned they're still going. He talked about water. He talked about different things. I have it -- it's all over the place. But I'll tell you what. I watched Mitt Romney yesterday and this is the problem with the Republican Party. He choked. He should've won the election, should have won it easily. He was running against a failed President. That was an election -- and I backed him. I gave him money. I did everything for him, very loyal guy. I backed him and he lost. He lost and he lost big. He didn't lose close. He lost big. He didn't inspire people. They stayed home. If people would have gotten out to vote. Now since I've been involved -- I don't know if you've been seeing the biggest story in all of politics is what's happening to the Republican Party and I'm getting zero credit for it. And I should get all because they're not coming in for a little Marco that I can tell you. Millions of people are coming to vote. Millions and millions of people are coming to vote for the Republicans and joining the Republican Party because of me, because of me. And if I ever left they would go away as fast as I would. They would go away because they want commonsense, they want intelligence. They don't want this stupidity that they've seen for the last long period of time. And the biggest story in all of politics. One of the biggest stories, period. It's on the cover of Time Magazine this week and I've been on the cover of Time Magazine so many times in the last three, four months. It's like almost like, Am I on the cover of Time this week? The biggest story and the best story I've almost ever had, three or four weeks ago, the cover of Time Magazine wrote a story about us all of us together. It's a movement. It's a movement and, and they described it so beautifully. The writer, the writer was amazing. They described it so beautifully, so incredibly. And I'm on the cover this week. Actually, it's the same writer and it's a good story. But the one that really hit the pay dirt was the one from three or four weeks ago because they were describing a movement that is so incredible. That's never happened before. That's never happened before. And one of the biggest things in all of politics for many, many decades is what's going on with this sleepy old party, the GOP where we were losing, losing, losing where structurally, it was almost impossible to beat Hillary Clinton which I'll do easily, easily. and millions of people are voting. And millions and millions of people are voting in the Republican Party and you know where they're coming from? The Democrats are just switching over and they're independents and this hasn't happened for years. And I will tell you, I will take 100% credit for it because that's the story. They're coming over to vote for us, to vote for us. I'll take the credit with you because they're coming over to be with us and to vote for us. The enthusiasm, one guy said today, he was actually a very good pundit, smart and he was a Democrat. And they said let me tell you, we don't know what's with this Trump guy but we're concerned. We never saw anything like this. Millions of people are coming over. You look at what happened in South Carolina where we had so many more people voting, so many more people are voting for the Republicans. What? Get him out of here. Get him out. Get him. These people. Beautiful. He's a friend. He's a friend of Mitt Romney. But millions of people millions and millions of people are coming out and they're voting Republican now instead of Democrat. And nobody's ever seen a movement like this so it's a great thing. It is a movement, folks. It's an incredible movement and it's a great thing. Thank you. I want to -- by the way, I just watched that. I want to thank our police officers. We have great, great people. They don't get the credit they should get. They don't get the credit they should get. You know you'll have one incident which is a bad incident. Maybe it was a mistake. Maybe it was a bad apple. Who the hell knows. But it's on the news for weeks and weeks and they don't stop. Our police officers are incredible and without them, we wouldn't be here right now, believe me. And by the way, I have such support. I think it's unanimous support across the country from the police and I just appreciate them very much. Also our vets. We've got to take care of our vets. We've got to take care of our vets. So we had an interesting day, the debate was great. Mitt is a failed candidate. This is a guy who failed, failed, failed, didn't know what to do. Doesn't know what to do. It's a sad case but he's a choker. He just choked. He choked, he choked almost as bad probably worse than Marco Rubio when Chris Christie who endorsed me by the way, when Chris Christie went after him in the last debate previous. I never saw -- I'm standing here and I'm looking at Marco and I'm saying is he OK? And I see the sweat pouring. And Chris is going at him and Marco, you know he's got that little flippant mouth but a lot of times it doesn't work under pressure. And Marco is sweating, it's pouring down and then he repeats himself once, twice, three times. I said after the third time, I said well, what's going on? Four times and then a fifth time. And I thought he was going down for the count and I was ready to go -- because I wanted to show off. You know what a good athlete I am. I want to show the size of my hand so I could grab him, so I could grab him. I could grab that guy like nothing, bomb, hold him up. And I didn't want him to get hurt hitting his head when he went down. But this is not what we need when we negotiate against China and Putin and all of these killers, all right? It's not what we need. So anyway, but, but get him out of here. Get him out of here. Are these rallies the most fun, right? We have the most fun. Do we have the most fun? Yeah, get him out of here. Get him out. Get him out, so disruptive. Remember when Bernie Sanders, they took the mic away from him. That's not going to happen with us, folks. That's not going to happen. Remember that? He walked away from the mic and he stood back and he watched these two young girls talk into the audience and they said we came to listen to him and he was standing in the back as two women took the mic away. Now, that doesn't happen to us. Get that guy out of here. Get him out. Get that guy out of here. Get him out of here. Get him out. I think you should arrest him. Do you like him? I think he should be arrested. Arrest him. I think he should be arrested for what he just did and for the fresh mouth he's got. I would arrest him, officer. So I don't want to give any recommendation officer. I would arrest him for a filthy, dirty mouth. And then we'll see what his mommy and daddy say when they have to go and bail him out. So what we do, look, so what we do is we take care of Obamacare, it's out. We take care of Common Core, it's out. We build up our -- oh, we totally build up our depleted military and nobody is going to mess with us. Nobody is going to mess with us. Nobody. Nobody is going to mess. We're going to knock out ISIS so fast, folks, your head's going to spin, your head is going to spin. ISIS will be gone so fast. Can you imagine General Douglas MacArthur, the great Douglas MacArthur or Jet -- how about George, how about George Patton? These guys right now, they're spinning in their graves, they don't believe what's going on. How about the unpredictability? We have a President that gets up and he said we will attack them here. We are then going to leave. We're going to leave here. We're going to leave that -- this guy gets up and tells everything we're ever going to do. How about a couple of months ago he said we're sending 50 people over to Iraq or to Syria, right? We're sending 50 people. Now by saying that he's just put a target -- you know, they're being looked at and watched. They will -- you know we're not dealing with a stupid enemy. They are looking for those 50 people like you wouldn't believe. Why can't he just keep his mouth shut and send your 50 people or send your 100 people? But don't put a target on their back. We need unpredictability with our military. We can't have our Generals talking. Every time I turn on I have a General talking, saying what we should do, how we should do it, what we're going to do or we have a President saying we're sending troops here and then they're going to go there. Why is it anybody's knowledge? Why is it anybody's business? Why do we have to tell the enemy? We want to go in a stealth way. We want to knock the hell out of ISIS, OK? And we'll do it. We want to take care of our vets. Our vets are being treated worse than the illegal immigrants that we're not letting in this country anymore. The migration, the Syrians, you look and there's so many young, strong men. So many young, strong men. And you say what's going on? Where are the women and the children and they're there but not very many. We can't allow them to come into our country. We don't know who they are. We don't know anything about them. They could be ISIS. It could be the great Trojan horse. We can't allow them to come in. We'll build a safe zone, a free zone, but a safe zone in Syria and we'll get the Gulf states to pay for it because we can't pay. We don't have the money to pay. We have to rebuild our country. We have to rebuild the infrastructure of our country. Our country is going to hell as we spend trillions and trillions of dollars in places they don't want us. Look at Iraq. We spent $2 trillion in Iraq, $2 trillion. What did we get? Nothing, nothing. We spent $2 trillion, thousands of lives, wounded warriors all over the place who we all love. I love -- these are stronger than all of us put together. Some of these young, great soldiers with no legs, no arms with worse. And these people have an attitude that's better than all of us. What did we get? So we have $2 trillion spent, we could have rebuild the most of our country with that. We have $2 trillion spent, right? We have absolutely, we have thousands of lives lost. Young, wonderful people. Wounded warriors all over the place. We have nothing. And you know what happens? Iran is taking over Iraq. It's already done. It's done. Iraq has the second-largest oil reserves in the world. Some of the finest oil in the world. They have the second largest. We made it possible for Iran to go in and take over Iraq. What the hell are we doing? Now, we shouldn't have been there but Obama should have never gotten out the way he got out. What a disaster. He gives the exact date. We are going to be leaving Iraq in 18 months and then he spells out the exact time. So the enemy naturally pulls back. What do we have to fight for? They pull back. We leave and they just go in and take the place. So we can't even call Iraq now. So with all of this money, all of these lives, all of this bloodshed, we end up with nothing. Do you remember that I said keep the oil? Do you remember that? And I said that for a long time. Keep the oil. I didn't want to go in but once we went in, when we were going out I said keep the oil. You know we used to have an expression to the victor belong the spoils. We're the only country that fights, we knocked the hell out of a country and we leave. You say what do we get? What are we doing? What do we do? We're nation-building. Why are we nation-building over there? We want to nation build over here. We want to rebuild our country. We want to rebuild our country. So I said because I knew the power of that and I knew the kind of -- the kind of reserves they had. Nobody even knows that. Nobody knows that Iraq has among the largest oil reserves in the world. So I said keep the oil. And I said it strongly and I said it loudly and I said it loud enough that they actually had a couple of Generals come out, and say well, we disagree with Mr. Trump. Why? Tell me why. Why do you disagree? They disagreed because politically, they disagreed, and they were told to say what they said. So I said keep the oil. Well, you know has the oil right now? ISIS and Iran, OK? And the stuff they don't have they will very shortly have because Iran wanted to merge or wanted to knock out that country for many, many, many, many years, forever. And now we made it possible. They had two militaries that were of the same strength. They'd fight and fight and fight and fight, then they'd rest. Then they'd fight and fight. Nothing would happen. They'd go 10 feet, 10 feet, 10 feet. Nothing would happen. So we obliterate the one military just totally obliterate it. And now, you know I used to say the greatest deal I've ever seen was the deal recently made with Iran and the United States where they got the $150 billion and we get nothing, OK? That's not the greatest deal. The greatest deal is they got Iraq. They got Iraq. They got the second-largest oil reserves that we handed them on a silver platter. Now, let me tell you a little secret because I'm very good at this stuff. I mean, I really have -- I just for some reason, I've been very good at prognosticating. They're in Yemen and they don't want Yemen but Yemen has this very long border with a place called Saudi Arabia. And they want to go and get these oil in Saudi Arabia. So what's going to happen. What's going to happen is very simple. Mark my words. I'm -- I've been saying the oil for years, and by the way, all of a sudden we started not taking the oil, bombing the oil. Now, it was ok to bomb the oil because we want to get in there and then you get Exxon Mobil and some of these great companies within about 12 seconds they'll have it rebuilt and it'll be just fine with brand new stuff, right? And we take the oil but that -- we didn't use that. We didn't do that. What happened is we had a catastrophe called Paris. And when Paris happened people said, wow, this is getting really, really serious. Radical Islamic terrorism. Then we had in California happened, the 14 people, the two people, they became -- she, she probably radicalized him. Something happened and they killed their co-workers, people that threw them parties for their baby, we killed them. And we've got to get smart, folks. We've got to be vigilant. We've got to be smart. We've got to be great, again. We're not great. We're laughed at throughout the world. We can be great again. We can be so great again. I see it. I see it with the people. I meet with people. They're so incredible. I want to see Apple making their iPhones in this country. I don't want it made in China. I want it made this country and we're going to have that and we're going to have that. So I just finished by saying this, we haven't won in a long time. We don't win with our military. We can't. We don't. We don't have the right leadership, probably at a military level, but certainly, at a Presidential level, we don't have the right leadership. We can't beat ISIS, right? We can't beat ISIS. That's going to happen so fast. You're going to see something so fast. And a lot of it is attitude you know that. A lot of it is attitude. But we're going to win with our military. We're going to win on trade. We're going to win on the borders. We're going to win so much, folks. We're going to win and win and win. I sometimes joke I say, we're going to win so much that you people are going to get so tired of winning. You're going to say, Mr. President, Mr. President, we can't stand winning anymore. Please give us at least a couple of losses and you know what I'm going to say? No way. No way. We're going to Make America Great Again. No way. So, so I just want to thank you and I have to leave it at this. Look, you have to do -- and by the way, this was a long drive to get up here. My people said, oh, I think you could skip that one if you want. I said there's no way I'm skipping it, all right? Can you imagine? Can you imagine? This was a little bit of a long drive and I loved it. It was beautiful and I wouldn't miss it for the world and you people are great. But listen, you have to do this. You have to go out on Tuesday. You have to go out and vote. You have to go out. I don't want your money. I'm self-funding. I'm putting up my own money. I'm not going to be subject like these guys. They're controlled by every guy that gives them money. I'm not controlled by anybody. I'm controlled by you. I don't want your money. What you have to do is on Tuesday, go out and vote and we will Make America Great Again. I love you. I love you, Michigan. I love you. I love you. Thank you. Thank you very --"}