{"id":437,"author":"Donald Trump","title":"Speech: Donald Trump Delivers a Speech in Madison, AL","date":"2016-02-28","link":"https://factba.se/transcript/donald-trump-speech-madison-al-february-28-2016","paragraphs":["Hey cameras, take a look over here. Take a look. Unbelievable. 32,000 people. This is amazing. And by the way, look over there, we can't get them in. They won't let them in. Why can't they come in? Fire Department let them in. Let them in. We've got thousands of people over there. Let them in if you can.","All right. So look, first of all, that's the first time that Senator Sessions has ever endorsed it's a big deal. That's, to me, a big deal. So, we've had some interesting times and together... you know Time magazine, a couple of weeks ago, they did a cover story that this is a movement. This isn't me a movement.","We're going to there's never been... there's never been a time where we've made so many decisions that have been so wrong. Whether it's the Iran deal, the borders like wrong. Whether it's the Iran deal, the borders like Swiss cheese. We are going to great. We are going to do things so smart.","We are going to be so competent. You're going to be so proud of your President, believe me. You're not proud now but you're going to be proud of your President. So, over the last period of a couple of weeks, nasty, nasty things are said, right? Nasty things. Now, Marco... Marco's a lightweight but so many... this guy.","I mean, when you're up 20 points in Florida... we're up. The guy, they hate him in Florida. He can't be elected dogcatcher in Florida. This guy. You know, little... I call him Little Marco. He's a nice guy. But you know, I watch... you saw, yesterday, I got the endorsement of Chris Christie. Tough guy, good guy, smart, wonderful guy and he was so enthusiastic.","But I watched... what... what Chris was running... I watched something I don't see often. I watched a man melt in front of me. Chris started grilling lightweight Marco Rubio, and Marco was standing right here, right next to me during the debate. The one before last. And Chris went into him. And I thought it was OK. He mentioned the Obama phrase once.","Then he mentioned it a second time. I said, huh, that's strange. And then I noticed he was like pouring water. He was sweating... I've never seen anything like it. I thought he just got out of a swimming pool with his suit on. I said, what's going on? And I'm saying to myself, I hope he's OK. Oy oy oy. Folks, folks.","Look, we have to love everybody. All lives matter. Remember that. Remember that. All lives matter. So, we'll have these little interruptions. So what? You know, when you have 32... now it's 35 because they're starting... when you have 35,000 people, if you have a few protesters, I guess it sort of has to happen, right?","So I'm looking at Little Marco and I say, man, there's something happening with him and he's like melting. Then he said the phrase a third time, a fourth time, a fifth time. I said he's just melted down. That's really bad. Then I get ready. You know, I'm a strong guy, believe it or not. I get ready and I think he's going to faint.","Now, we don't need a fainter to negotiate with China and Putin. We don't need a fainter to knock the hell out of ISIS, do we? We don't need a fainter. We don't need a guy who's sweating and scared. And I never saw anything like it. So, that's it. Now he wants to act like a big man. Oh, Trump's a con man.","Trump's a con man. I'm a con man. I built an incredible business. I filed papers with the Federal Elections that are so unbelievable. And believe me, if they weren't unbelievable I wouldn't be here right now and these guys would have never ever... they could not believe how great a company I built. And I got to listen to this guy... to this guy that took money to build a driveway, and when they caught him he said, oh, let me reimburse.","I used the wrong credit card, right? Took it out of the Republican Party. When you look at what he's done, he takes a house, he buys a house for $178,000 or so, he sells it to a lobbyist for $380,000. A lobbyist that's dealing with him in the state of Florida. You tell me. That's what we're going to have as our senator and that's what we're going to have as our President?","There's no way. There's no way. You can't do it. You can't do it. You know, we have a problem. These guys, all of them. I'm self-funding my campaign folks. I don't care. We're going to make the right decisions. I'm self-funded. But these guys are all taken care of. When you get right down to it. Whether it's the drug industry, where we don't bid competitively, drugs, you know, drugs to make you better.","We have pharmaceutical companies and we have an industry, they take care of these people. Tell me, tell me. Isn't it fun to be at a Trump rally? Isn't this it's part of the deal. You know, it's like part of the deal. I remember... OK. You remember this? I said, well he's not going to make it. Bernie Sanders is speaking and these two young women came up and they took over the microphone.","Do you remember that? And he walked away, he was, oh, oh... and I said to myself, wow. But you remember, they came up... no microphone's going to be taking over from me. I guarantee you that. I guarantee you that. Because they're not taking it over from me, they're taking it over from you. Can't happen. And I'll never forget that scene.","He looked so weak and so pathetic. And by the way, he's over anyway. It's not going to happen. You saw what happened yesterday. Now, in all fairness, Hillary should not be allowed to run because she broke the law. It's true, broke the law. She should not be allowed to run. She's probably protected by the Democrats but she should not be allowed to run folks, I'll tell you.","You either have laws or you don't have laws and what she did... you look at General Petraeus, you look at so many people, have gotten into such hot water over that and gone away. You know where I'm talking about. And with her... and by the way, did you ever see so many... how do you do 10,000 e-mails? 20,000, 40,000. How the hell do you do so many e-mails?","Does anybody do e-mails like... So, let's see what happens. I think we're going to have to run against her, which is good. Frankly, I think it's great. And I will beat her. The other guys are not going to beat her folks. They're not going to win. They're not going to win. And I guarantee you one thing, we're going to be talking about those e-mails every moment of every day.","And we're going to shame them into doing the right thing. But we're going to beat Hillary. Polls have come out where I'm leading her. Recently, rolls have come out where I'm... USA Today, the Q-poll, others. Fox recently came out with a poll, I'm beating her. I haven't even started on her yet folks. I haven't even started.","She's not, right now, part of the equation. You know, to be honest with you, I like to do one thing first. And if you look... take a look at the people. Governor Walker, nice guy, but he attacked Trump, right? Jeb Bush, very nice person, right? OK. So I don't want to get... I mean, Lindsey Graham, this poor guy.","This poor guy. And you know, he was so vicious... I mean, he was so vicious. And his idea of the war, you know, he thinks he's a military expert. He says, I'm a military expert. We've been listening to this guy for years, where are we? We're nowhere. I know what to do. You know what to do. What I told you to do is the right way to do it. If we listen to some of these guys on the military, we're going to be over there for... for another 20 years.","We can't do it. Look, we've spent two trillion dollars in Iraq. We have absolutely nothing. We've lost thousands and thousands of great, great military, young, beautiful people. We've got wounded warriors, who I love all over the place. And you know what we have? Nothing. We have nothing. We don't even call them anymore.","And you know who's taking over Iraq and the second largest oil supplies? We have the second largest reserves in the world, people don't even know that, in Iraq. Iran has taken... we... hey, for years they'd fight. They'd fight for years, then stop, then rest, then they'd that fight for years. Saddam Hussein gassed, they don't like it, everybody complains, they'd stop.","Then it goes the other way. They move to... they had the same power. And then we get up, we blast the hell out of one of the plower. So now what happens? Iran is taking over. So, not only do they make the greatest deal that I've ever seen made. They got $150 billion dollars. They should have never gotten that money.","They should have released our prisoners four years ago, not after they get the money like it's ransom. You know, I tell that story all the time. One of the dumbest deals, one of the... I mean, they never walked. I kept saying, they're going to walk now, they're going to walk now. Because I kept... we kept giving up on every single point.","In Iran, they were dancing in the streets, the people are dancing. Obama's calling the head, the Supreme Leader. I will never call him, I promise you, the Supreme Leader. I will never. But you know what you do? OK. So, let's say three and a half, four years ago they had the prisoners and you walk in... because this deal was going on forever.","Did you ever see a deal so long? And it's a... it's a horrible deal. So you walk in and you say, fellas... great negotiators, the Persians. The Persians are great negotiators. They all read The Art Of The Deal too, by the way, I can tell you. Our people didn't read it. Our people did not read it. But you walk in and you say, very nicely... and I tell the story... and actually, one of the reporters from The New York Times thought this story... they love this story.","I'll tell you a little bit. My father was a good guy. He taught me how to negotiate a little bit and he was a really good guy. Oh, by the way, by the way, this little Rubio guy said my father gave me $200 million. My sister called me up. She said, no, are you kidding? My brother called up. What the hell?","I started off with a million dollars and built a company that's worth over $10 billion. That's what it is. Man. I heard about the 200 million, I said 200 million? They actually copied... he actually copied a false story from the New York Times. I have to tell you, the New York Times is one of the most dishonest media groups that I've ever seen in my life.","One of the most dishonest. Now here's the good news. It's losing its shirt. It's gonna be out of business soon, although somebody's gonna buy it as a vanity project. But the New York Times is so dishonest. They did a story, recently, that was highly inaccurate. They realized it was inaccurate. They agreed with me. I said, are you going to pull it? No. Why?","Why wouldn't you pull if a story is inaccurate? And I said... and I said to the press, and they're giving me a little heat because, obviously, they don't want this. They have to report accurately and if they don't report accurately, we, all of us, should have the right to sue them. OK? And you know what?","This has nothing to do with freedom of the press, which I believe in totally. But when they don't report accurately, we should have the right to sue them and get them to report accurately, and also damages. Because, right now, we have libel laws that don't mean a thing. And I will tell you, and it's gonna make it tougher because they'll be tougher on me now.","They will be... they are so dishonest, these reporters. They are the worst. They are, I think... I'll tell you what. I'll tell you what. Here. I'm running against people, I've dealt with politicians all my life. And watch, you'll leave here, you're not going to see this crowd. Then I'm going to show the crowd.","You're going to leave here and you'll say, you know, we had 32,000 people, 35,000 standing out there, which they just won't allow more than that. And you know what's going to happen? You're going to read a story tomorrow, it's going to say, Donald Trump made a speech in front of a, you know, OK crowd. They won't even say OK. But here's the story.","When they write inaccurately, we have to have the right to hold them to what they write, and if it's inaccurate, we have the right to get damages. Right now we get nothing. They are going to regret all of the bad stories they write so much. I will say this. I'm running against very dishonest people, all right?","Little Marco Rubio. A total, total featherweight. He's not a lightweight, he's a... this guy. And honestly, I have to tell you, until Marco started going to town calling me a con man... I'm a con man. You know, when you build a great business and you build a tremendous net worth, and you build Trump Tower and you build... all of these jobs I've built.","I have Turnberry now in Scotland. I have Doral Country Club, where you're gonna have the big tournament next week in Miami. Hundreds and hundreds of acres. I have so many jobs. Buildings all over. The Bank of America building, a big chunk in San Francisco. One of the great buildings of the world. 1290 Avenue of the Americas, among the largest floor plates in the country.","Big, big, beautiful stuff. Built a city on the West Side of Manhattan, on the Hudson River. From 72nd Street all the way down. And I say, I'm a con man. It was such an insulting thing. You don't call somebody of achievement. You know do that. You don't call somebody of achievement when you've done nothing.","This guy... this guy is a dishonest guy. He bought the house, he sold it to a lobbyist. He did so many things. Ask him about his driveway. You just don't do that stuff folks. Besides that, he's not cool. He sweats too much and I don't want him negotiating for us. Now with that being said, we have lying Ted Cruz.","I have to be honest, these people that I'm dealing with are the worst people. Ted Cruz will get up and say things. I am totally against Obamacare. Anybody that's followed me from the time that thing was implemented, which should have never been allowed, frankly, by the Republicans. But Obama lied 28 different times.","You can keep your doctor, you can keep your plan, all the stuff, and got just enough Democrats to get it done, right? And I'll tell you what. When Ted Cruz says Donald Trump likes Obamacare... and he knows it's a lie. When he says other things... I won't even go into it because it's disgusting. These people are really bad.","Now I've dealt with politicians all my life, some are very good. But many, many, many are really, really dishonest. I don't think they're as bad as the press, I'll be honest with you. I think the press is probably worse. But we're going to straighten out our country. We're going to come up with solutions.","When these guys... and you can ask the Disney folks, you can ask the people that came up, who were just killed at Disney. Killed. Where they're being replaced. They have to change jobs. They have to train people. You... and you heard the story. You know who was in charge of that and the biggest proponent of doing that is little Marco Rubio.","OK? I mean, this guy is bad news. But here's the story folks, we're going to start making great deals for our country. We have a poor country. We have a... we're like... I mean, we are in trouble. We have 19 trillion dollars in debt. It's going up to 21 trillion dollars. We have people that don't have a clue.","We have a budget that was just passed, which is a total disaster. You saw the budget. The omnibus. They call it the omnibus budget. Just passed. We are going to start having wonderful budgets. We're going to make this country so strong again. We're going to build up our military, which is so depleted. Our military is so depleted from mismanagement and misuse, and going all over not knowing what to do. And by listening to guys like Lindsey Graham dropped bombs here, drop bombs on Assad, drop bombs on ISIS.","Oh, but they're fighting each other. So maybe we shouldn't do that. How can you do this one if you're doing that one? That's why we're there for so long folks. You got to do one thing at a time. We take out ISIS. Number one, we take out ISIS. And you know, I got a lot of heat. Putin was very nice to me, he said Donald Trump is a genius.","But I'll take that, right? Not gonna... hey, let me tell you, he's not getting anything for it. OK? He said, Donald Trump is a genius and Donald Trump is going to be the great leader of the party. So he said that. I don't know if he meant it. Probably did, to be honest with you. He sees crowds like this, why not?","So these guys come up, these... these people come up, they say, we want Mr. Trump to disavow that statement. Why would I disavow? Guy calls you a genius, is anybody going to disavow. We don't disavow. What's wrong with having Russia work with us instead of always fighting, fighting? What's wrong with having Russia drop bombs all the hell over ISIS?","What's wrong with that? What's wrong with it? So, I mean, we just have so many wrong things. So, when this all started, June 16th I came down, and a lot of the pundits said, oh, he's never going to run, he's never going to run. Then I announce I'm running. Then they said he's never going to sign Form A. That's where you sign your life away.","I mean, you literally... you think this is fun? I want to tell you, running for President takes guts. It takes guts. It's not easy. And my wife told me, it was very interesting, Melania. She said, you know, if you run... You love Melania? That's beautiful. She's great.","She's great. She's great. And it's not easy for her either. I will tell you this, it is a tough thing. When we came down that escalator and I said let's go. I took a deep breath and I made a speech and I talked about illegal immigration, and all hell broke out. And you wouldn't even be talking about immigration and illegal immigration, which is a far bigger problem than anyone knew.","Nobody knew how grave it was. I knew because I have friends that live in California. I have friends that live in Texas. I have friends that live all over the place. And I have friends, also, that have become addicted to drugs. Drugs that flow through that border. We won New Hampshire. I was treated so well in the state of New Hampshire.","Not only did I win it but there are great people up there. And you go up to New Hampshire and you see the people and their biggest problem... the first thing they always tell me about is they have a tremendous heroin problem. Tremendous. And it doesn't seem right. Because, you know, the beautiful trees and the beautiful... I mean everything's beautiful.","It's like a beautiful place. And it doesn't seem right. It's pouring through the southern border. We're going to stop drugs for New Hampshire. And I made them a promise. I said, we're going to get this stuff ended. We're going to end it. So I really... I went out and we brought this up and we said we're going to have strong borders, we're going to have the wall.","Mexico's going to pay for the wall 100%. By the way, 100%. You know? These... these politicians... you know, the other day, I heard two of them. I never heard it before. I heard Little Marc... you know, I heard Little Marco. He's up here. And he said... and my wife said to me, I've never heard that before.","And honestly I hadn't. But Little Marco Rubio said, we are going to build a wall. It's the first time ever... I said, what happened? He's going to build a wall. Because I thought that we couldn't build it, according to these guys. And I heard the same thing from Ted Cruz. They're going to build a wall. Sheriff Joe Arpaio, who's... who's terrific by the way.","He's endorsed me. And let me tell you, Joe Arpaio from Arizona knows about borders. Do we agree? And he endorsed Trump. So, what happened is I gave the speech and then people sort of were very critical. Rush Limbaugh actually said, I have never seen anybody take more incoming... mean, take a beating from the press.","It was brutal for a couple of weeks. Then people started to realize I'm right. And between the crime and the drugs, and the economic development that's lost... and by the way, we're going to have people come in. They're coming in legally. We know that. But we have to... we have to straighten up our borders.","So I talked about borders. I talked about trade on June 16. And then it morphed into something much different because you had the attack in Paris, you had the attack in Los Angeles. You had many other attacks. And all of a sudden people started looking to me for protection and safety. Because, trust me, I will be so good, I won't be so tough, I will be so strong.","We.. we are going to protect our country. Militarily and at the borders, we're going to protect our country. So, I went from trade... now trade's a big thing because you cannot lose $500 billion a year with China. Which is what we lost last year. $500 billion with China. And then I hear these very not smart people.","I'm trying to be nice. They say Donald Trump is not a free trader. I'm a free trader. But folks, I'm a free trader. We got to do something. We've got to get something out of it, right? I'm a free trader. When we lose $500 billion dollars a year, guess what? I guess I'm not a free trader because it's not going to work that way.","I know China very well. I have great friends in China. They pay me tens of millions of dollars for apartments in Manhattan. The largest bank in the world, from China, is a tenant of mine and one of my buildings. OK? I know more about China than... I have the Bank of America building in San Francisco because of China.","And I got it in a very hostile fashion. You would be very proud of me actually if you want to know the truth. But... but let me tell you... and China's fine. And by the way, Mexico, I didn't like that leader, I didn't like his filthy language. You want to know the truth. I didn't like his attitude because he thought that, you know, we're supposed to give him everything.","It's gonna be... those days are over folks. But let me just tell you, Mexico is great and the people are great. I have thousands and thousands of Hispanics working for me and have worked for me over the years. They're great. They have great spirit. They're great people. The problem we have is, the leaders of Mexico, the leaders of China, the leaders of Japan, all of the leaders all over the world are smarter, tougher more cunning than our leaders.","Our leaders are stupid people folks. They're stupid people. And we can't afford it anymore. We have 19 trillion, we can't afford it anymore. We're going to... we are going to change that so fast. So, for the first part I talked about borders and I talked about trade. And I love talking about trade. Believe me, and I say it all the time, I will be the greatest jobs producing President that God ever created.","That I can tell you. The great. So, I talked about trade... and just so you know, it's not free trade with China. China sends their stuff in here, no tax. We send stuff over there... I have many friends in the manufacturing business, they can't get it into China. And if they do, they pay a massive tariff or tax.","Believe me, it's a one sided deal. And our people don't want to talk about it. Well we're going to start talking about it because we're not going to lose that kind of money. You can't. If we're going to remain a country... we have rebuilt China. That is the greatest theft in the history of the world, what China has done to the United States.","OK? In fact, the other day, the bank... the big bank from China, renewed their lease. I said, I can't believe it, you're really renewing it? Yeah. They love the building. It's a great building. What can I tell you? They renewed their lease, I was a little surprised, with the way I talk about China. But I talk about it with respect.","I wish our leaders were doing to them what they're doing to us. I'd be so happy with our leaders. I wouldn't even be doing this. So, we're going to straighten out trade. Let me tell you, I know you've seen this story, about a week ago, Carrier air conditioners... I buy Carrier, the good company. Now I'm going to a different brand, probably Trane.","But I buy a lot of Carriers. I buy everything. But I buy a lot of stuff, and I'll tell you, it's all moving. It's moving to Mexico now. It's moving... you know, Pfizer is moving to Ireland. Pfizer. It's a massive company. The big pharmaceutical company. We got to stop it folks. So here's what happens. They announce... you know Ford is building a two and a half billion dollar plant in Mexico, just in case.","Nobody did anything and now they're doubling down. That was... I've been talking about that for two years and now, the other day in the newspaper, I said, Ford now is going to double up. They're going to build much more. And the reason is, nobody talks to them and nobody tells them there are going to be repercussions if you do this.","So, I went to the Wharton School of Finance, you all went to good schools, colleges... or no schools. It doesn't make any difference. Anybody knows, when... if you take Carrier, when they say... and it was terrible. 1,400 people out of a job. When you take carrier, right, and you say, you're out of a job, we're moving to Mexico.","And you had to see the people, they were devastated. They worked there for years, great people, they worked there for years. They're going to move to... they're going to move right into Mexico. What the hell good does that do? They're going to make air conditioners. They're going to sell them, many of them, into the United States.","No tax, no nothing. So we lose the jobs, we lose the buildings, we lose real estate taxes, we lose all sorts of taxes. We get nothing. And then, not only that, Carrier is going to sell air conditioners. So they're going to be competing with companies that we have, like Trane and others that sell air conditioners, that ideally make them in the United States.","Of course, there aren't too many of those companies left. Because I can say the same thing for South Korea. You want to buy a television? I buy thousands of television sets a year. You want to buy a television set? You got to go to South Korea. Unless you want to go to Sony, and Sony is a little bit... lost its way but we won't say that.","OK? But you go LG and you go Samsung, you have to go. So here's the story. If I'm President, what I do is the following... and you know it's not very Presidential. I know when. Everyone always says that, when, when, when. But I don't want to say that because they'll say I'm egotistical. OK? So... but... well, look, the big thing is you got to go out on Tuesday, you got to vote folks.","You got to vote. You got to vote. You got to vote. Got to vote. You got to vote or the movement ends. Our movement... look at that. Look at that. Oh, I love that. Look at that amount of people. Boy, I wish you could have gotten a better location. Look at that. I wish the cameras would just focus what's on that area.","It's so unbelievable, it's so crazy. And I wish they'd focus on that area where we have 4,000 people standing, that they won't let in. That's so sad. I don't know. I would have let him in. I mean, why is there a fire hazard when you're standing outside? Why... in all fairness, I'm sure I'd like the Fire... I have this problem.","You know, I work very hard. My best friends have become Fire Marshals. Because every time I go to a place, we need the help of the Fire Marshals. But usually it's on the inside of a building. And even there I say, do me a favor, let the people come in because have to go. You've got thousands of people standing out there.","How the hell can you have a problem? We're outside. There's no building. We're outside. Let them in Mr. Fire Marshal, whoever the hell you are. Let them come in. Let them come in. Come on. I don't get it. I don't get it. We have to be... see, that's what... we need common sense in the world, right? We need common sense.","You know, if we're on the inside of a building I say, OK, could you let some in at least? Because we send away thousands of people. I hate it. I hate it. I've gone back to areas just to take care of the people that we sent in. But when you're in a building like... when you're in a thing like this, it's ridiculous.","OK, so here's what we do. It's not very Presidential, right? I shouldn't be calling up Carrier, I'm the president of the United States. Now, if one of these other guys heard about it, like Rubio or like Cruz, they would... Number one, they don't care. You're right.","Number two, they're taken care of and a lobbyist will see them and say you can't do that. The lobbyist represents and he's this and they gave you money. OK, so nothing's going to happen. But me, I'm not asking... I have turned down so much money. I feel so damn foolish. I have... I tell people, my whole life... my whole life is about money accumulation.","I tell people. I'm sort of greedy. It's like money, money and money. That's what I do. Money, I care. Now, I'd say... I tell people... I have a friend who's a great guy, from Las Vegas, a very, very powerful guy, very big guy, Phil Ruffin. Very rich guy. He wants to give me $10 million. Another one wants to give me five million dollars.","I have guys who want to give me 20, 20... they'll give me anything I want. I would have the greatest fund ever assembled by mankind. OK? And I keep saying no, no, no. And Phil comes over and says, Donald... sees me a month later. When can I give it? No, no, no, I don't want it. And I sort of feel foolish.","I've never done that before. I feel like, what am I doing? I keep turning down... and I don't even know if people appreciate it. I'm not sure that they appreciate it. I don't know. I have a man who's a member of the Mar-a-Lago Club... I like you too. I actually love you.","I love everybody here. I tell you, we have... every poll says that Donald Trump has by far the most loyal people. That... I shouldn't say this. I shouldn't say this but they say I could do anything and they still love me. And you know what? You could do anything and I'm still going to love you too, believe me. Believe it. So I have a member of the Mar-a-Lago Club, very, very rich guy.","Tremendously rich guy. He's in the credit card business and he's fantastic. And he sees me, Don, uh, I'd like to give you as much money as you'd want for the campaign. Don't forget, I've been number one since I started, right? Since June. I mean, we started off at five percent, seven percent. Every time we'd go five percent and these guys would say, well, he's reached his cap.","Then the next week it goes to 12%. And these people back there, this moron, Karl Rove. He is a total moron. You listen to guys like Karl Rove, you are never going to win another Presidential election. I will tell you that. But Karl Rove, I mean he is the worst. Any time I see him I say, turn off the set.","He still thinks Romney won the election. Do you know that? He's going around, Romney won the election, he won the the election. You listen to these people, you're never going to win again folks. I'm telling you. I'm telling you. So then I go to 12... I go to 12% and they say, oh, he's reached a cap. Then I go to 20%. Then I went to 24, 25%. Then I went to... and every time.","Now, today, Reuters has been at 44% nationally. 44. And don't forget. Don't forget. That's with five people. And actually more than that probably, because they probably have a couple of others before... who knows. But that's with other people. So 44. So now they don't say that anymore. Because you know what?","I'll take 44 all day long with five people, right? But then I listen to Rove and he'll say... in particular him but others too. They'll say, well you know what they're going to do? They're going to gang up on Trump. The only way you're going to beat him... I feel so strong. I feel so great. Because they say, he's unbeatable one on one.","And you can't beat him in the debates. You have to gang up like these two morons, they ganged up. Did you see them? They're shaking hands. They're waving to each other. I'm standing in the middle... and by the way, every single online poll said I won that debate. Every single one. But did you see them? They're... did you see?","They're behind me. They're shaking hands. They're high fiving behind... what a bunch... Hey folks. Folks, can I be honest? We just want to make our country so great. I mean what's the big deal, right? We want security. We want good health care. We want to get rid of Common Core. We want to strengthen our Second Amendment.","We want to have our Second Amendment. They want to decimate our Second Amendment. It's not going to happen. There are certain things. We want to have a good life. We want to have a wonderful family. We want to have a great job. I mean, what's the big... we want to take care of ourselves. And you know, this whole thing with the viciousness and the stupidity and the craziness.","We want to do it right. But... so Karl Rove said, well, he has 45. I had just won Nevada and it was a big victory. I won by so much. And we had just won also, you know, shortly before that, we won South Carolina. Big. And that was supposed to be... don't forget, that was supposed to be Ted Cruz's stronghold.","High evangelical population. I love the evangelicals. They are so good. I'm leading with evangelicals everywhere. Because... because they want competent people. They want somebody that's going to finally... they are so tired of listening to these dead, boring, do-nothing, all-talk, no-action politicians.","They can't do it any more. Jerry Falwell Jr. has been one of the endorsers. He's been great. He's been so great. Sarah Palin has been a great endorser. She's been a great... but Jerry... and she's a terrific person by the way. Jerry Falwell Jr., Liberty University, they have done such a job. And he said two things that I really loved.","First of all, everybody goes through... everybody knows Jerry. Highly, highly respected. Every candidate, automatically, they go through Liberty. And you know, what they built there is a college and university is incredible. But Jerry Falwell Jr., he said, Donald Trump most reminds me of my father. Which was a great compliment because I knew of his father.","I knew him a little bit but he was terrific. But he said, my father had to make a decision. And he had Jimmy Carter, who was a person that read the Bible, knew the Bible, taught Sunday school. And he had Ronald Reagan, who actually wasn't quite as good in terms of the Bible but he felt he was going to be a much better leader.","And he took a lot of heat because he went and endorsed Ronald Reagan instead of Jimmy Carter. And Ronald Reagan turned out to be a great president. And I just think it's a great story. So I just wanted to thank... because, I'll tell you, Jerry Jr. has been amazing. He's been on the phone. He's been doing interviews and he's had a... Thank you.","Thank you folks. And he's just had a great... he's had a great impact on the success that we've had. So... so what we're going to do is we're going to turn things around. What we're going to do is we're going to turn trade. What we're going to do is the following. I'm telling you about Carrier. It's not presidential.","I will call Carrier. I can get... and by the way, just so you understand, we have the greatest business minds in the world. We don't use them. We use political hacks. Political hacks. Oftentimes they get there because of contributions to these candidates. We have political hacks negotiating the biggest deals in the world.","These trade deals are the biggest... there's... no company has deals like this. So we are going to use... and I know them all. I know the good ones, the bad ones, the overrated, ones the ones you never heard of, that are better than all of them. Carl Icahn just endorsed me. A great business leader. I have others endorsing me all the time.","We have a... by the way, I'm becoming... I hate to say it, I'm becoming mainstream. All these people are now endorsing me. I'll tell you. But I... but I do love a... let me tell you, when I get Jeff Sessions, that means a lot to me. That means a lot. That means a lot. That's a biggie. Specially since he never... he's never done it before.","He's never ever wanted to do it but he sees this. So I would say to Carrier, look... I want to do it myself. I'm going to want to... I know it's not Presidential. These characters in the back, they're going to say, Donald Trump would call up, as the President, Carrier... you know what? I'll do it. I'll do it quietly.","I'll say, here... they'll say, oh, the President the United States is on the phone, right? And I'll say, listen Mr. So-and-so, here's the story. I hope you enjoy your plant. I know it's going to be beautiful. I love the fact that you're going to put a lot of Mexicans to work. I think it's a wonderful thing.","But you know you hurt a lot of people in the United States and you're closing up plants and it's costing us a lot of money, and I know you're going to sell those air conditioners back in the United States. So here's the deal. Here's the deal... and enjoy it. You're going to make air conditioners in Mexico.","Every single time you sell an air conditioner in the United States, you're going to pay a 35% tax. OK? Every single time. And by the way, I hate to tell you this, I would say the exact same thing to Ford and I would say the exact same thing to Nabisco, and I'd say the same thing to every damn company that wants to leave our country.","And again, folks, I'm a free trader. But we can't have it. We can't have it. We're losing our country. We're losing our business. You know Caterpillar tractor, take a look at what's happening with them. Komatsu, Japan cuts their currency. Cuts the hell out of the yen, right? They devalue their currency. It's like they're masters at it. China is the all time great chess master with what to do to currency.","What they do to us... and by the way TPP, the trade deal, Trans-Pacific Partnership, a horrible deal for our country. A horrible deal. And one of the things I love is that Jeff Sessions is totally opposed to it. This is a horrible deal for our country. This is more jobs lost. More money lost. We're not going to do it. So I hope they don't approve it, and I don't know if they're going to or not, it's going to be a... it's an another disaster.","It's another Iran deal. It's... every single deal we do is bad. We're to change it, that every single deal we do is going to be phenomenal for us. It's going to bring back jobs. So... so here's the story. So I'm going to say, you're got to pay 35% tax and I really hope you enjoy your stay. I hope you enjoy your new building in Mexico.","I really hope it works out well. I will be called by special interests and I will be called by the lawyers and all of the lobbyists and all of these bloodsuckers that get, you know, the lightweight Senator that I have on my right and the lying Senator that I have on my left. And it gets these people... he's a liar too.","He's maybe a bigger liar, which is interesting. But... but I will get... I will get these people and they will say to me the following... these people won't. They won't do anything because by the time... and you know what? These are not stupid people. What they're going to do is say, oh, that's right, that's right.","But by the time they start thinking about it, they will be contacted by their lobbyist. You know, in Washington, you have lobbyists that go to certain people. It's like they have a sign on their head. I'll take care of Rubio. I have Rubio. I have Ted Cruz. And these guys have such power. Such power over our Senate.","That's why we make all these bad deals. A lot of times you think we're making bad deals. A lot of times you think the people that run it are so stupid. They're not stupid. They know it's bad. But they do it because they get, essentially, paid a fortune in campaign contributions and probably other things, honestly, that we don't know about.","OK? Probably other things. I don't want to be accusing anybody. I would never want to accuse anybody of that of course. But they probably get things that you don't want to know about. Although I'd like to know about it. OK. So I will tell him, no, no, you're going to pay 35%. Couple of people call me, they haven't given me anything.","Again, I don't want their money, right? They haven't given me anything. So I'll say, no, no, you have to go. Within 24 hours I will get a call from either one of their representatives or the head guy, probably the head guy, and they'll say, Mr. President we've decided to stay in the United States. OK? Gonna happen.","Gonna happen. Now... now let me just tell you something. That is not 80% sure or 90%, that's 100%. It's 100%. We're not talking about... we're talking about... we're talking about 100%. It's not like, oh, gee, maybe we can get lucky. We can make such incredible deals. Our military. We protect the world. We spend more money on military than other countries, many, many countries put together.","We spend more than any country has ever spent times 10. One of the reasons is we're protecting everybody else. It's not for us. We protect Germany. We protect Japan. With Japan, if we get attacked, they don't have to do anything. They can watch it and say, wow, that's really exciting to watch. If they get attacked, we have to go and protect them and probably end up in World War 3. What kind of deals are these?","What kind of deals? So, Japan, we protect Japan. We protect South Korea. I have buildings in South Korea. I like South Korea but we don't have the money to do it anymore. We... What is that? Oh. Uh oh. It's ISIS. Get them down. Oh, I'd shoot that guy down so fast your head would spin. What do you think General MacArthur would do? What do you think General George Patton would do with ISIS huh?","Hey, how long do you think ISIS would been around, right, with General George Patton? Who's... who was a rough, tough guy. You don't get rougher but his people loved him. They'd do anything for him and they'd die for them. We don't have that today. Today we have generals that go on television and say, well, you know ISIS is very tough.","It's very... believe me. We have the right people. We have the right minds. We have the great military. It... it is seriously... by the way, it is seriously depleted. General Odierno, when he left, again he goes on television. People shouldn't do this. He goes on television and he says our military is the most depleted of any time that he's ever seen or heard of. That might mean like from... like the beginning.","Now, honestly he's a good man but he shouldn't say that. Why should we tell the enemy that? That's what we're doing. We're going to build it up. I'm going to build it up fast. By the way, it's the cheapest thing we can do. Nobody is going to mess with us folks. It's the cheapest thing we can do. I don't want to use it. I don't want to use it but it's the cheapest thing we can do. So, we are going to buy and we are going to get all of these countries that are making a fortune.","South Korea is making a fortune. Germany is making a fortune. Japan, with the cars, millions of cars. We send them practically nothing. These deals are no good. They're going to come up and they're going to pay, and they're going to pay for protection, and we want to be very nice. And you know what? We'll have a better relationship with them than we do now.","We don't even have a good relationship. China is building a military fortress in the South China Sea. They did not go through the environmental impact process. Do we agree? I don't think... I don't think they're worried about the snails and the fish and the snakes. They build. You know what they do? They say, on Tuesday morning we want to build there.","They start around two... two hours later. With us, to do that, it would take 45 years of environmental impact studies. Oh, this country, this country. Obama, he's always talking about the carbon footprint. He has a news conference, he talks about the carbon footprint, then he takes Air Force One, an old 747 with engines that spew it, right?","And he flies to Hawaii and he plays golf and he's there for almost like three weeks. This guy plays more golf than the people on the PGA Tour, I'm telling you. More. So, we're going to get our jobs back folks. We're going to get our jobs back. We're going to take care of our military. We're going to do such an incredible job.","We're going to take care of our vets. Our vets are treated so badly. The illegal immigrants, in many cases, and I'm serious about this, are treated better than our vets and they get more than our vets, and we're not going to let that happen anymore. We're not letting it happen. So we're going to make unbelievable trade deals and we're going to become a rich nation again.","You know, recently, a woman came up to me, a very nice woman, beautiful woman. She said, Mr. Trump, I don't like one thing you say. I love you as President, I think you're going to be great but please don't say we're going to become a rich nation again. It doesn't sound good. I said, no, it sounds so great because we can't become great unless we're going to become rich again.","We can't become great if we're losing $500 billion dollars a year to China, and hundreds and hundreds and hundreds of billions of dollars to every other country. We don't make good deals anymore. So here's the deal. I don't want your money. I don't want anything. You know, other guys come up, please send money to such and such an address even if... I don't want any money.","I don't need any money. I want you to do one thing on Tuesday. This is our movement. This is our... happy birthday. It's his birthday. It's his birthday. You believe this? I love you. Can you hear me over there? I love you people. I love you. I love you people.","Man is that a lot of people. I love you... I love you people. Don't kid yourself folks, I have to say. Listen to this. So, everybody thinks that you have the best location, right? They do. You know why? Tomorrow morning they're going to become famous and only... they can only see the back of your head. They're all going to be famous.","So, look, here's the story. No money. I don't want money. But on Tuesday you have to get out and vote. And we have to win big. We have to win big. I love Alabama. I do love your football team. How good is that team? How good? How good? Man. I love champs and I love champs. And I don't know your coach but I tell you what... and I don't know, maybe he's endorsing somebody else.","I don't care. You got a hell of a coach. The job he's done here, right? I mean, in all fairness, he's done a hell of a job. But I love the team. I love watching that team. So professional. So, are you ready? You got to get out. You got to vote on Tuesday. Everybody here, you vote. We're going to win so big.","Well... you know we're leading in every single state and we're almost leading in Texas. And I have a feeling we're going to win Texas also. And we want to keep this movement. You know, one of the big writers said, in the history of politics, in the history of politics in the United States... and I don't even understand it. They said there has never been anything like this that has ever happened.","They have never seen anything like it. It's so amazing. They call it a phenomena. You're a phenomena. We're all a phenomena. You're a phenomena. So here's the story... and one of them said to me, congratulations. I said, on what? It's never been done before. One of the biggest writers. Highly respected. Liberal but that's OK. He said it's never been done before, what you've done.","I said, what have I done? He said, what you've done, the crowds, the enthusiasm. You've changed politics. Don't forget. I spend my money. I've spent less money than some of these guys. Some of these guys... one of them spent 158 million and he was close to last place, and I spent peanuts and I was first place.","Wouldn't it be nice if our country could do that? Wouldn't it be great, right? Would that be great? And we'll do that. In education... so important because it's about the American dream, right? I always say, the American dream is dead. Which it is. The American dream is dead, but we're going to make it bigger and better and stronger than ever before.","But... but.... but to be a piece, and to get a piece of the American Dream, education is so important. It's so... kids. All you kids out there, just go and do something you like and your parents but education's so important. So, in the world, the top 30 countries, we're last. And yet we're first in money spent.","So we're first. We spend more money per pupil by so much more than number two, your head... you wouldn't even believe it. It's like number two doesn't even exist. So we spend much more money than anybody else per pupil and yet we're last. You have Sweden. You have Norway. You have Denmark. You have China.","And we're number 30. You have countries on that list that you've never even heard of, and we're number 30. So we spend the most and we are the worst. OK? We are going to change it around folks. And that goes with purchasing. That goes... we are going to purchase... you know, we're going to... we're going to start competitive bidding in the drug industry.","We don't competitively bid. We're losing billions and billions and billions of dollars. We don't even bid stuff. We don't bid properly in the military. How often do you read, where they're getting a plane that they don't want? Because that company has more political muscle than the company that makes the plane that everybody wants, which is cheaper, faster better.","I mean, I see it all the time. It's terrible. Those days are over because nobody's taking care of me folks. Those days are over. So here's what I want. You are going to go on Tuesday, hopefully... first of all, I love you. I love you people. I love you people. True. Thank you man. Thank you. Thank you. So, on Tuesday, you got to go out.","You're going to vote. And we, ideally, you know, we want to have a resounding victory. Especially I respect this place so much. I have so many friends from this area. It's an amazing area. It's an amazing place. It's an amazing state. Diverse, incredible people. You've got to go out. You've got to vote. We've got to win by a lot.","We've got to knock the hell out of everybody. The movement is going and I promise you this. I promise you this. You're got to remember this gorgeous, beautiful, beautiful evening. This is beautiful isn't it? Everything's perfect, temperature, a little windy. I could have left the head off but I decided, what that hell.","It's a little bit windy. I figured, you know, why should my hair be blown all over the place? But... and then when Jeff Sessions put it on I actually felt better. But here's the story. We're going to start winning again. We're going to win at trade. We're going to win with the military. We're going to knock the hell out of ISIS.","We're going to do it fast, fast, fast. We're going to win with health care. We're going to win with education. We'll get rid of Common Core. We're going to win at the borders. We're going to win and we're going to keep winning, and we are going to make America great again, greater than ever before. Greater than ever before. And I love you all. Tuesday go out and vote. I love you all. Thank you. Thank you. Thank you. Love you. Thank you."],"text":" Hey cameras, take a look over here. Take a look. Unbelievable. 32,000 people. This is amazing. And by the way, look over there, we can't get them in. They won't let them in. Why can't they come in? Fire Department let them in. Let them in. We've got thousands of people over there. Let them in if you can. All right. So look, first of all, that's the first time that Senator Sessions has ever endorsed it's a big deal. That's, to me, a big deal. So, we've had some interesting times and together... you know Time magazine, a couple of weeks ago, they did a cover story that this is a movement. This isn't me a movement. We're going to there's never been... there's never been a time where we've made so many decisions that have been so wrong. Whether it's the Iran deal, the borders like wrong. Whether it's the Iran deal, the borders like Swiss cheese. We are going to great. We are going to do things so smart. We are going to be so competent. You're going to be so proud of your President, believe me. You're not proud now but you're going to be proud of your President. So, over the last period of a couple of weeks, nasty, nasty things are said, right? Nasty things. Now, Marco... Marco's a lightweight but so many... this guy. I mean, when you're up 20 points in Florida... we're up. The guy, they hate him in Florida. He can't be elected dogcatcher in Florida. This guy. You know, little... I call him Little Marco. He's a nice guy. But you know, I watch... you saw, yesterday, I got the endorsement of Chris Christie. Tough guy, good guy, smart, wonderful guy and he was so enthusiastic. But I watched... what... what Chris was running... I watched something I don't see often. I watched a man melt in front of me. Chris started grilling lightweight Marco Rubio, and Marco was standing right here, right next to me during the debate. The one before last. And Chris went into him. And I thought it was OK. He mentioned the Obama phrase once. Then he mentioned it a second time. I said, huh, that's strange. And then I noticed he was like pouring water. He was sweating... I've never seen anything like it. I thought he just got out of a swimming pool with his suit on. I said, what's going on? And I'm saying to myself, I hope he's OK. Oy oy oy. Folks, folks. Look, we have to love everybody. All lives matter. Remember that. Remember that. All lives matter. So, we'll have these little interruptions. So what? You know, when you have 32... now it's 35 because they're starting... when you have 35,000 people, if you have a few protesters, I guess it sort of has to happen, right? So I'm looking at Little Marco and I say, man, there's something happening with him and he's like melting. Then he said the phrase a third time, a fourth time, a fifth time. I said he's just melted down. That's really bad. Then I get ready. You know, I'm a strong guy, believe it or not. I get ready and I think he's going to faint. Now, we don't need a fainter to negotiate with China and Putin. We don't need a fainter to knock the hell out of ISIS, do we? We don't need a fainter. We don't need a guy who's sweating and scared. And I never saw anything like it. So, that's it. Now he wants to act like a big man. Oh, Trump's a con man. Trump's a con man. I'm a con man. I built an incredible business. I filed papers with the Federal Elections that are so unbelievable. And believe me, if they weren't unbelievable I wouldn't be here right now and these guys would have never ever... they could not believe how great a company I built. And I got to listen to this guy... to this guy that took money to build a driveway, and when they caught him he said, oh, let me reimburse. I used the wrong credit card, right? Took it out of the Republican Party. When you look at what he's done, he takes a house, he buys a house for $178,000 or so, he sells it to a lobbyist for $380,000. A lobbyist that's dealing with him in the state of Florida. You tell me. That's what we're going to have as our senator and that's what we're going to have as our President? There's no way. There's no way. You can't do it. You can't do it. You know, we have a problem. These guys, all of them. I'm self-funding my campaign folks. I don't care. We're going to make the right decisions. I'm self-funded. But these guys are all taken care of. When you get right down to it. Whether it's the drug industry, where we don't bid competitively, drugs, you know, drugs to make you better. We have pharmaceutical companies and we have an industry, they take care of these people. Tell me, tell me. Isn't it fun to be at a Trump rally? Isn't this it's part of the deal. You know, it's like part of the deal. I remember... OK. You remember this? I said, well he's not going to make it. Bernie Sanders is speaking and these two young women came up and they took over the microphone. Do you remember that? And he walked away, he was, oh, oh... and I said to myself, wow. But you remember, they came up... no microphone's going to be taking over from me. I guarantee you that. I guarantee you that. Because they're not taking it over from me, they're taking it over from you. Can't happen. And I'll never forget that scene. He looked so weak and so pathetic. And by the way, he's over anyway. It's not going to happen. You saw what happened yesterday. Now, in all fairness, Hillary should not be allowed to run because she broke the law. It's true, broke the law. She should not be allowed to run. She's probably protected by the Democrats but she should not be allowed to run folks, I'll tell you. You either have laws or you don't have laws and what she did... you look at General Petraeus, you look at so many people, have gotten into such hot water over that and gone away. You know where I'm talking about. And with her... and by the way, did you ever see so many... how do you do 10,000 e-mails? 20,000, 40,000. How the hell do you do so many e-mails? Does anybody do e-mails like... So, let's see what happens. I think we're going to have to run against her, which is good. Frankly, I think it's great. And I will beat her. The other guys are not going to beat her folks. They're not going to win. They're not going to win. And I guarantee you one thing, we're going to be talking about those e-mails every moment of every day. And we're going to shame them into doing the right thing. But we're going to beat Hillary. Polls have come out where I'm leading her. Recently, rolls have come out where I'm... USA Today, the Q-poll, others. Fox recently came out with a poll, I'm beating her. I haven't even started on her yet folks. I haven't even started. She's not, right now, part of the equation. You know, to be honest with you, I like to do one thing first. And if you look... take a look at the people. Governor Walker, nice guy, but he attacked Trump, right? Jeb Bush, very nice person, right? OK. So I don't want to get... I mean, Lindsey Graham, this poor guy. This poor guy. And you know, he was so vicious... I mean, he was so vicious. And his idea of the war, you know, he thinks he's a military expert. He says, I'm a military expert. We've been listening to this guy for years, where are we? We're nowhere. I know what to do. You know what to do. What I told you to do is the right way to do it. If we listen to some of these guys on the military, we're going to be over there for... for another 20 years. We can't do it. Look, we've spent two trillion dollars in Iraq. We have absolutely nothing. We've lost thousands and thousands of great, great military, young, beautiful people. We've got wounded warriors, who I love all over the place. And you know what we have? Nothing. We have nothing. We don't even call them anymore. And you know who's taking over Iraq and the second largest oil supplies? We have the second largest reserves in the world, people don't even know that, in Iraq. Iran has taken... we... hey, for years they'd fight. They'd fight for years, then stop, then rest, then they'd that fight for years. Saddam Hussein gassed, they don't like it, everybody complains, they'd stop. Then it goes the other way. They move to... they had the same power. And then we get up, we blast the hell out of one of the plower. So now what happens? Iran is taking over. So, not only do they make the greatest deal that I've ever seen made. They got $150 billion dollars. They should have never gotten that money. They should have released our prisoners four years ago, not after they get the money like it's ransom. You know, I tell that story all the time. One of the dumbest deals, one of the... I mean, they never walked. I kept saying, they're going to walk now, they're going to walk now. Because I kept... we kept giving up on every single point. In Iran, they were dancing in the streets, the people are dancing. Obama's calling the head, the Supreme Leader. I will never call him, I promise you, the Supreme Leader. I will never. But you know what you do? OK. So, let's say three and a half, four years ago they had the prisoners and you walk in... because this deal was going on forever. Did you ever see a deal so long? And it's a... it's a horrible deal. So you walk in and you say, fellas... great negotiators, the Persians. The Persians are great negotiators. They all read The Art Of The Deal too, by the way, I can tell you. Our people didn't read it. Our people did not read it. But you walk in and you say, very nicely... and I tell the story... and actually, one of the reporters from The New York Times thought this story... they love this story. I'll tell you a little bit. My father was a good guy. He taught me how to negotiate a little bit and he was a really good guy. Oh, by the way, by the way, this little Rubio guy said my father gave me $200 million. My sister called me up. She said, no, are you kidding? My brother called up. What the hell? I started off with a million dollars and built a company that's worth over $10 billion. That's what it is. Man. I heard about the 200 million, I said 200 million? They actually copied... he actually copied a false story from the New York Times. I have to tell you, the New York Times is one of the most dishonest media groups that I've ever seen in my life. One of the most dishonest. Now here's the good news. It's losing its shirt. It's gonna be out of business soon, although somebody's gonna buy it as a vanity project. But the New York Times is so dishonest. They did a story, recently, that was highly inaccurate. They realized it was inaccurate. They agreed with me. I said, are you going to pull it? No. Why? Why wouldn't you pull if a story is inaccurate? And I said... and I said to the press, and they're giving me a little heat because, obviously, they don't want this. They have to report accurately and if they don't report accurately, we, all of us, should have the right to sue them. OK? And you know what? This has nothing to do with freedom of the press, which I believe in totally. But when they don't report accurately, we should have the right to sue them and get them to report accurately, and also damages. Because, right now, we have libel laws that don't mean a thing. And I will tell you, and it's gonna make it tougher because they'll be tougher on me now. They will be... they are so dishonest, these reporters. They are the worst. They are, I think... I'll tell you what. I'll tell you what. Here. I'm running against people, I've dealt with politicians all my life. And watch, you'll leave here, you're not going to see this crowd. Then I'm going to show the crowd. You're going to leave here and you'll say, you know, we had 32,000 people, 35,000 standing out there, which they just won't allow more than that. And you know what's going to happen? You're going to read a story tomorrow, it's going to say, Donald Trump made a speech in front of a, you know, OK crowd. They won't even say OK. But here's the story. When they write inaccurately, we have to have the right to hold them to what they write, and if it's inaccurate, we have the right to get damages. Right now we get nothing. They are going to regret all of the bad stories they write so much. I will say this. I'm running against very dishonest people, all right? Little Marco Rubio. A total, total featherweight. He's not a lightweight, he's a... this guy. And honestly, I have to tell you, until Marco started going to town calling me a con man... I'm a con man. You know, when you build a great business and you build a tremendous net worth, and you build Trump Tower and you build... all of these jobs I've built. I have Turnberry now in Scotland. I have Doral Country Club, where you're gonna have the big tournament next week in Miami. Hundreds and hundreds of acres. I have so many jobs. Buildings all over. The Bank of America building, a big chunk in San Francisco. One of the great buildings of the world. 1290 Avenue of the Americas, among the largest floor plates in the country. Big, big, beautiful stuff. Built a city on the West Side of Manhattan, on the Hudson River. From 72nd Street all the way down. And I say, I'm a con man. It was such an insulting thing. You don't call somebody of achievement. You know do that. You don't call somebody of achievement when you've done nothing. This guy... this guy is a dishonest guy. He bought the house, he sold it to a lobbyist. He did so many things. Ask him about his driveway. You just don't do that stuff folks. Besides that, he's not cool. He sweats too much and I don't want him negotiating for us. Now with that being said, we have lying Ted Cruz. I have to be honest, these people that I'm dealing with are the worst people. Ted Cruz will get up and say things. I am totally against Obamacare. Anybody that's followed me from the time that thing was implemented, which should have never been allowed, frankly, by the Republicans. But Obama lied 28 different times. You can keep your doctor, you can keep your plan, all the stuff, and got just enough Democrats to get it done, right? And I'll tell you what. When Ted Cruz says Donald Trump likes Obamacare... and he knows it's a lie. When he says other things... I won't even go into it because it's disgusting. These people are really bad. Now I've dealt with politicians all my life, some are very good. But many, many, many are really, really dishonest. I don't think they're as bad as the press, I'll be honest with you. I think the press is probably worse. But we're going to straighten out our country. We're going to come up with solutions. When these guys... and you can ask the Disney folks, you can ask the people that came up, who were just killed at Disney. Killed. Where they're being replaced. They have to change jobs. They have to train people. You... and you heard the story. You know who was in charge of that and the biggest proponent of doing that is little Marco Rubio. OK? I mean, this guy is bad news. But here's the story folks, we're going to start making great deals for our country. We have a poor country. We have a... we're like... I mean, we are in trouble. We have 19 trillion dollars in debt. It's going up to 21 trillion dollars. We have people that don't have a clue. We have a budget that was just passed, which is a total disaster. You saw the budget. The omnibus. They call it the omnibus budget. Just passed. We are going to start having wonderful budgets. We're going to make this country so strong again. We're going to build up our military, which is so depleted. Our military is so depleted from mismanagement and misuse, and going all over not knowing what to do. And by listening to guys like Lindsey Graham dropped bombs here, drop bombs on Assad, drop bombs on ISIS. Oh, but they're fighting each other. So maybe we shouldn't do that. How can you do this one if you're doing that one? That's why we're there for so long folks. You got to do one thing at a time. We take out ISIS. Number one, we take out ISIS. And you know, I got a lot of heat. Putin was very nice to me, he said Donald Trump is a genius. But I'll take that, right? Not gonna... hey, let me tell you, he's not getting anything for it. OK? He said, Donald Trump is a genius and Donald Trump is going to be the great leader of the party. So he said that. I don't know if he meant it. Probably did, to be honest with you. He sees crowds like this, why not? So these guys come up, these... these people come up, they say, we want Mr. Trump to disavow that statement. Why would I disavow? Guy calls you a genius, is anybody going to disavow. We don't disavow. What's wrong with having Russia work with us instead of always fighting, fighting? What's wrong with having Russia drop bombs all the hell over ISIS? What's wrong with that? What's wrong with it? So, I mean, we just have so many wrong things. So, when this all started, June 16th I came down, and a lot of the pundits said, oh, he's never going to run, he's never going to run. Then I announce I'm running. Then they said he's never going to sign Form A. That's where you sign your life away. I mean, you literally... you think this is fun? I want to tell you, running for President takes guts. It takes guts. It's not easy. And my wife told me, it was very interesting, Melania. She said, you know, if you run... You love Melania? That's beautiful. She's great. She's great. She's great. And it's not easy for her either. I will tell you this, it is a tough thing. When we came down that escalator and I said let's go. I took a deep breath and I made a speech and I talked about illegal immigration, and all hell broke out. And you wouldn't even be talking about immigration and illegal immigration, which is a far bigger problem than anyone knew. Nobody knew how grave it was. I knew because I have friends that live in California. I have friends that live in Texas. I have friends that live all over the place. And I have friends, also, that have become addicted to drugs. Drugs that flow through that border. We won New Hampshire. I was treated so well in the state of New Hampshire. Not only did I win it but there are great people up there. And you go up to New Hampshire and you see the people and their biggest problem... the first thing they always tell me about is they have a tremendous heroin problem. Tremendous. And it doesn't seem right. Because, you know, the beautiful trees and the beautiful... I mean everything's beautiful. It's like a beautiful place. And it doesn't seem right. It's pouring through the southern border. We're going to stop drugs for New Hampshire. And I made them a promise. I said, we're going to get this stuff ended. We're going to end it. So I really... I went out and we brought this up and we said we're going to have strong borders, we're going to have the wall. Mexico's going to pay for the wall 100%. By the way, 100%. You know? These... these politicians... you know, the other day, I heard two of them. I never heard it before. I heard Little Marc... you know, I heard Little Marco. He's up here. And he said... and my wife said to me, I've never heard that before. And honestly I hadn't. But Little Marco Rubio said, we are going to build a wall. It's the first time ever... I said, what happened? He's going to build a wall. Because I thought that we couldn't build it, according to these guys. And I heard the same thing from Ted Cruz. They're going to build a wall. Sheriff Joe Arpaio, who's... who's terrific by the way. He's endorsed me. And let me tell you, Joe Arpaio from Arizona knows about borders. Do we agree? And he endorsed Trump. So, what happened is I gave the speech and then people sort of were very critical. Rush Limbaugh actually said, I have never seen anybody take more incoming... mean, take a beating from the press. It was brutal for a couple of weeks. Then people started to realize I'm right. And between the crime and the drugs, and the economic development that's lost... and by the way, we're going to have people come in. They're coming in legally. We know that. But we have to... we have to straighten up our borders. So I talked about borders. I talked about trade on June 16. And then it morphed into something much different because you had the attack in Paris, you had the attack in Los Angeles. You had many other attacks. And all of a sudden people started looking to me for protection and safety. Because, trust me, I will be so good, I won't be so tough, I will be so strong. We.. we are going to protect our country. Militarily and at the borders, we're going to protect our country. So, I went from trade... now trade's a big thing because you cannot lose $500 billion a year with China. Which is what we lost last year. $500 billion with China. And then I hear these very not smart people. I'm trying to be nice. They say Donald Trump is not a free trader. I'm a free trader. But folks, I'm a free trader. We got to do something. We've got to get something out of it, right? I'm a free trader. When we lose $500 billion dollars a year, guess what? I guess I'm not a free trader because it's not going to work that way. I know China very well. I have great friends in China. They pay me tens of millions of dollars for apartments in Manhattan. The largest bank in the world, from China, is a tenant of mine and one of my buildings. OK? I know more about China than... I have the Bank of America building in San Francisco because of China. And I got it in a very hostile fashion. You would be very proud of me actually if you want to know the truth. But... but let me tell you... and China's fine. And by the way, Mexico, I didn't like that leader, I didn't like his filthy language. You want to know the truth. I didn't like his attitude because he thought that, you know, we're supposed to give him everything. It's gonna be... those days are over folks. But let me just tell you, Mexico is great and the people are great. I have thousands and thousands of Hispanics working for me and have worked for me over the years. They're great. They have great spirit. They're great people. The problem we have is, the leaders of Mexico, the leaders of China, the leaders of Japan, all of the leaders all over the world are smarter, tougher more cunning than our leaders. Our leaders are stupid people folks. They're stupid people. And we can't afford it anymore. We have 19 trillion, we can't afford it anymore. We're going to... we are going to change that so fast. So, for the first part I talked about borders and I talked about trade. And I love talking about trade. Believe me, and I say it all the time, I will be the greatest jobs producing President that God ever created. That I can tell you. The great. So, I talked about trade... and just so you know, it's not free trade with China. China sends their stuff in here, no tax. We send stuff over there... I have many friends in the manufacturing business, they can't get it into China. And if they do, they pay a massive tariff or tax. Believe me, it's a one sided deal. And our people don't want to talk about it. Well we're going to start talking about it because we're not going to lose that kind of money. You can't. If we're going to remain a country... we have rebuilt China. That is the greatest theft in the history of the world, what China has done to the United States. OK? In fact, the other day, the bank... the big bank from China, renewed their lease. I said, I can't believe it, you're really renewing it? Yeah. They love the building. It's a great building. What can I tell you? They renewed their lease, I was a little surprised, with the way I talk about China. But I talk about it with respect. I wish our leaders were doing to them what they're doing to us. I'd be so happy with our leaders. I wouldn't even be doing this. So, we're going to straighten out trade. Let me tell you, I know you've seen this story, about a week ago, Carrier air conditioners... I buy Carrier, the good company. Now I'm going to a different brand, probably Trane. But I buy a lot of Carriers. I buy everything. But I buy a lot of stuff, and I'll tell you, it's all moving. It's moving to Mexico now. It's moving... you know, Pfizer is moving to Ireland. Pfizer. It's a massive company. The big pharmaceutical company. We got to stop it folks. So here's what happens. They announce... you know Ford is building a two and a half billion dollar plant in Mexico, just in case. Nobody did anything and now they're doubling down. That was... I've been talking about that for two years and now, the other day in the newspaper, I said, Ford now is going to double up. They're going to build much more. And the reason is, nobody talks to them and nobody tells them there are going to be repercussions if you do this. So, I went to the Wharton School of Finance, you all went to good schools, colleges... or no schools. It doesn't make any difference. Anybody knows, when... if you take Carrier, when they say... and it was terrible. 1,400 people out of a job. When you take carrier, right, and you say, you're out of a job, we're moving to Mexico. And you had to see the people, they were devastated. They worked there for years, great people, they worked there for years. They're going to move to... they're going to move right into Mexico. What the hell good does that do? They're going to make air conditioners. They're going to sell them, many of them, into the United States. No tax, no nothing. So we lose the jobs, we lose the buildings, we lose real estate taxes, we lose all sorts of taxes. We get nothing. And then, not only that, Carrier is going to sell air conditioners. So they're going to be competing with companies that we have, like Trane and others that sell air conditioners, that ideally make them in the United States. Of course, there aren't too many of those companies left. Because I can say the same thing for South Korea. You want to buy a television? I buy thousands of television sets a year. You want to buy a television set? You got to go to South Korea. Unless you want to go to Sony, and Sony is a little bit... lost its way but we won't say that. OK? But you go LG and you go Samsung, you have to go. So here's the story. If I'm President, what I do is the following... and you know it's not very Presidential. I know when. Everyone always says that, when, when, when. But I don't want to say that because they'll say I'm egotistical. OK? So... but... well, look, the big thing is you got to go out on Tuesday, you got to vote folks. You got to vote. You got to vote. You got to vote. Got to vote. You got to vote or the movement ends. Our movement... look at that. Look at that. Oh, I love that. Look at that amount of people. Boy, I wish you could have gotten a better location. Look at that. I wish the cameras would just focus what's on that area. It's so unbelievable, it's so crazy. And I wish they'd focus on that area where we have 4,000 people standing, that they won't let in. That's so sad. I don't know. I would have let him in. I mean, why is there a fire hazard when you're standing outside? Why... in all fairness, I'm sure I'd like the Fire... I have this problem. You know, I work very hard. My best friends have become Fire Marshals. Because every time I go to a place, we need the help of the Fire Marshals. But usually it's on the inside of a building. And even there I say, do me a favor, let the people come in because have to go. You've got thousands of people standing out there. How the hell can you have a problem? We're outside. There's no building. We're outside. Let them in Mr. Fire Marshal, whoever the hell you are. Let them come in. Let them come in. Come on. I don't get it. I don't get it. We have to be... see, that's what... we need common sense in the world, right? We need common sense. You know, if we're on the inside of a building I say, OK, could you let some in at least? Because we send away thousands of people. I hate it. I hate it. I've gone back to areas just to take care of the people that we sent in. But when you're in a building like... when you're in a thing like this, it's ridiculous. OK, so here's what we do. It's not very Presidential, right? I shouldn't be calling up Carrier, I'm the president of the United States. Now, if one of these other guys heard about it, like Rubio or like Cruz, they would... Number one, they don't care. You're right. Number two, they're taken care of and a lobbyist will see them and say you can't do that. The lobbyist represents and he's this and they gave you money. OK, so nothing's going to happen. But me, I'm not asking... I have turned down so much money. I feel so damn foolish. I have... I tell people, my whole life... my whole life is about money accumulation. I tell people. I'm sort of greedy. It's like money, money and money. That's what I do. Money, I care. Now, I'd say... I tell people... I have a friend who's a great guy, from Las Vegas, a very, very powerful guy, very big guy, Phil Ruffin. Very rich guy. He wants to give me $10 million. Another one wants to give me five million dollars. I have guys who want to give me 20, 20... they'll give me anything I want. I would have the greatest fund ever assembled by mankind. OK? And I keep saying no, no, no. And Phil comes over and says, Donald... sees me a month later. When can I give it? No, no, no, I don't want it. And I sort of feel foolish. I've never done that before. I feel like, what am I doing? I keep turning down... and I don't even know if people appreciate it. I'm not sure that they appreciate it. I don't know. I have a man who's a member of the Mar-a-Lago Club... I like you too. I actually love you. I love everybody here. I tell you, we have... every poll says that Donald Trump has by far the most loyal people. That... I shouldn't say this. I shouldn't say this but they say I could do anything and they still love me. And you know what? You could do anything and I'm still going to love you too, believe me. Believe it. So I have a member of the Mar-a-Lago Club, very, very rich guy. Tremendously rich guy. He's in the credit card business and he's fantastic. And he sees me, Don, uh, I'd like to give you as much money as you'd want for the campaign. Don't forget, I've been number one since I started, right? Since June. I mean, we started off at five percent, seven percent. Every time we'd go five percent and these guys would say, well, he's reached his cap. Then the next week it goes to 12%. And these people back there, this moron, Karl Rove. He is a total moron. You listen to guys like Karl Rove, you are never going to win another Presidential election. I will tell you that. But Karl Rove, I mean he is the worst. Any time I see him I say, turn off the set. He still thinks Romney won the election. Do you know that? He's going around, Romney won the election, he won the the election. You listen to these people, you're never going to win again folks. I'm telling you. I'm telling you. So then I go to 12... I go to 12% and they say, oh, he's reached a cap. Then I go to 20%. Then I went to 24, 25%. Then I went to... and every time. Now, today, Reuters has been at 44% nationally. 44. And don't forget. Don't forget. That's with five people. And actually more than that probably, because they probably have a couple of others before... who knows. But that's with other people. So 44. So now they don't say that anymore. Because you know what? I'll take 44 all day long with five people, right? But then I listen to Rove and he'll say... in particular him but others too. They'll say, well you know what they're going to do? They're going to gang up on Trump. The only way you're going to beat him... I feel so strong. I feel so great. Because they say, he's unbeatable one on one. And you can't beat him in the debates. You have to gang up like these two morons, they ganged up. Did you see them? They're shaking hands. They're waving to each other. I'm standing in the middle... and by the way, every single online poll said I won that debate. Every single one. But did you see them? They're... did you see? They're behind me. They're shaking hands. They're high fiving behind... what a bunch... Hey folks. Folks, can I be honest? We just want to make our country so great. I mean what's the big deal, right? We want security. We want good health care. We want to get rid of Common Core. We want to strengthen our Second Amendment. We want to have our Second Amendment. They want to decimate our Second Amendment. It's not going to happen. There are certain things. We want to have a good life. We want to have a wonderful family. We want to have a great job. I mean, what's the big... we want to take care of ourselves. And you know, this whole thing with the viciousness and the stupidity and the craziness. We want to do it right. But... so Karl Rove said, well, he has 45. I had just won Nevada and it was a big victory. I won by so much. And we had just won also, you know, shortly before that, we won South Carolina. Big. And that was supposed to be... don't forget, that was supposed to be Ted Cruz's stronghold. High evangelical population. I love the evangelicals. They are so good. I'm leading with evangelicals everywhere. Because... because they want competent people. They want somebody that's going to finally... they are so tired of listening to these dead, boring, do-nothing, all-talk, no-action politicians. They can't do it any more. Jerry Falwell Jr. has been one of the endorsers. He's been great. He's been so great. Sarah Palin has been a great endorser. She's been a great... but Jerry... and she's a terrific person by the way. Jerry Falwell Jr., Liberty University, they have done such a job. And he said two things that I really loved. First of all, everybody goes through... everybody knows Jerry. Highly, highly respected. Every candidate, automatically, they go through Liberty. And you know, what they built there is a college and university is incredible. But Jerry Falwell Jr., he said, Donald Trump most reminds me of my father. Which was a great compliment because I knew of his father. I knew him a little bit but he was terrific. But he said, my father had to make a decision. And he had Jimmy Carter, who was a person that read the Bible, knew the Bible, taught Sunday school. And he had Ronald Reagan, who actually wasn't quite as good in terms of the Bible but he felt he was going to be a much better leader. And he took a lot of heat because he went and endorsed Ronald Reagan instead of Jimmy Carter. And Ronald Reagan turned out to be a great president. And I just think it's a great story. So I just wanted to thank... because, I'll tell you, Jerry Jr. has been amazing. He's been on the phone. He's been doing interviews and he's had a... Thank you. Thank you folks. And he's just had a great... he's had a great impact on the success that we've had. So... so what we're going to do is we're going to turn things around. What we're going to do is we're going to turn trade. What we're going to do is the following. I'm telling you about Carrier. It's not presidential. I will call Carrier. I can get... and by the way, just so you understand, we have the greatest business minds in the world. We don't use them. We use political hacks. Political hacks. Oftentimes they get there because of contributions to these candidates. We have political hacks negotiating the biggest deals in the world. These trade deals are the biggest... there's... no company has deals like this. So we are going to use... and I know them all. I know the good ones, the bad ones, the overrated, ones the ones you never heard of, that are better than all of them. Carl Icahn just endorsed me. A great business leader. I have others endorsing me all the time. We have a... by the way, I'm becoming... I hate to say it, I'm becoming mainstream. All these people are now endorsing me. I'll tell you. But I... but I do love a... let me tell you, when I get Jeff Sessions, that means a lot to me. That means a lot. That means a lot. That's a biggie. Specially since he never... he's never done it before. He's never ever wanted to do it but he sees this. So I would say to Carrier, look... I want to do it myself. I'm going to want to... I know it's not Presidential. These characters in the back, they're going to say, Donald Trump would call up, as the President, Carrier... you know what? I'll do it. I'll do it quietly. I'll say, here... they'll say, oh, the President the United States is on the phone, right? And I'll say, listen Mr. So-and-so, here's the story. I hope you enjoy your plant. I know it's going to be beautiful. I love the fact that you're going to put a lot of Mexicans to work. I think it's a wonderful thing. But you know you hurt a lot of people in the United States and you're closing up plants and it's costing us a lot of money, and I know you're going to sell those air conditioners back in the United States. So here's the deal. Here's the deal... and enjoy it. You're going to make air conditioners in Mexico. Every single time you sell an air conditioner in the United States, you're going to pay a 35% tax. OK? Every single time. And by the way, I hate to tell you this, I would say the exact same thing to Ford and I would say the exact same thing to Nabisco, and I'd say the same thing to every damn company that wants to leave our country. And again, folks, I'm a free trader. But we can't have it. We can't have it. We're losing our country. We're losing our business. You know Caterpillar tractor, take a look at what's happening with them. Komatsu, Japan cuts their currency. Cuts the hell out of the yen, right? They devalue their currency. It's like they're masters at it. China is the all time great chess master with what to do to currency. What they do to us... and by the way TPP, the trade deal, Trans-Pacific Partnership, a horrible deal for our country. A horrible deal. And one of the things I love is that Jeff Sessions is totally opposed to it. This is a horrible deal for our country. This is more jobs lost. More money lost. We're not going to do it. So I hope they don't approve it, and I don't know if they're going to or not, it's going to be a... it's an another disaster. It's another Iran deal. It's... every single deal we do is bad. We're to change it, that every single deal we do is going to be phenomenal for us. It's going to bring back jobs. So... so here's the story. So I'm going to say, you're got to pay 35% tax and I really hope you enjoy your stay. I hope you enjoy your new building in Mexico. I really hope it works out well. I will be called by special interests and I will be called by the lawyers and all of the lobbyists and all of these bloodsuckers that get, you know, the lightweight Senator that I have on my right and the lying Senator that I have on my left. And it gets these people... he's a liar too. He's maybe a bigger liar, which is interesting. But... but I will get... I will get these people and they will say to me the following... these people won't. They won't do anything because by the time... and you know what? These are not stupid people. What they're going to do is say, oh, that's right, that's right. But by the time they start thinking about it, they will be contacted by their lobbyist. You know, in Washington, you have lobbyists that go to certain people. It's like they have a sign on their head. I'll take care of Rubio. I have Rubio. I have Ted Cruz. And these guys have such power. Such power over our Senate. That's why we make all these bad deals. A lot of times you think we're making bad deals. A lot of times you think the people that run it are so stupid. They're not stupid. They know it's bad. But they do it because they get, essentially, paid a fortune in campaign contributions and probably other things, honestly, that we don't know about. OK? Probably other things. I don't want to be accusing anybody. I would never want to accuse anybody of that of course. But they probably get things that you don't want to know about. Although I'd like to know about it. OK. So I will tell him, no, no, you're going to pay 35%. Couple of people call me, they haven't given me anything. Again, I don't want their money, right? They haven't given me anything. So I'll say, no, no, you have to go. Within 24 hours I will get a call from either one of their representatives or the head guy, probably the head guy, and they'll say, Mr. President we've decided to stay in the United States. OK? Gonna happen. Gonna happen. Now... now let me just tell you something. That is not 80% sure or 90%, that's 100%. It's 100%. We're not talking about... we're talking about... we're talking about 100%. It's not like, oh, gee, maybe we can get lucky. We can make such incredible deals. Our military. We protect the world. We spend more money on military than other countries, many, many countries put together. We spend more than any country has ever spent times 10. One of the reasons is we're protecting everybody else. It's not for us. We protect Germany. We protect Japan. With Japan, if we get attacked, they don't have to do anything. They can watch it and say, wow, that's really exciting to watch. If they get attacked, we have to go and protect them and probably end up in World War 3. What kind of deals are these? What kind of deals? So, Japan, we protect Japan. We protect South Korea. I have buildings in South Korea. I like South Korea but we don't have the money to do it anymore. We... What is that? Oh. Uh oh. It's ISIS. Get them down. Oh, I'd shoot that guy down so fast your head would spin. What do you think General MacArthur would do? What do you think General George Patton would do with ISIS huh? Hey, how long do you think ISIS would been around, right, with General George Patton? Who's... who was a rough, tough guy. You don't get rougher but his people loved him. They'd do anything for him and they'd die for them. We don't have that today. Today we have generals that go on television and say, well, you know ISIS is very tough. It's very... believe me. We have the right people. We have the right minds. We have the great military. It... it is seriously... by the way, it is seriously depleted. General Odierno, when he left, again he goes on television. People shouldn't do this. He goes on television and he says our military is the most depleted of any time that he's ever seen or heard of. That might mean like from... like the beginning. Now, honestly he's a good man but he shouldn't say that. Why should we tell the enemy that? That's what we're doing. We're going to build it up. I'm going to build it up fast. By the way, it's the cheapest thing we can do. Nobody is going to mess with us folks. It's the cheapest thing we can do. I don't want to use it. I don't want to use it but it's the cheapest thing we can do. So, we are going to buy and we are going to get all of these countries that are making a fortune. South Korea is making a fortune. Germany is making a fortune. Japan, with the cars, millions of cars. We send them practically nothing. These deals are no good. They're going to come up and they're going to pay, and they're going to pay for protection, and we want to be very nice. And you know what? We'll have a better relationship with them than we do now. We don't even have a good relationship. China is building a military fortress in the South China Sea. They did not go through the environmental impact process. Do we agree? I don't think... I don't think they're worried about the snails and the fish and the snakes. They build. You know what they do? They say, on Tuesday morning we want to build there. They start around two... two hours later. With us, to do that, it would take 45 years of environmental impact studies. Oh, this country, this country. Obama, he's always talking about the carbon footprint. He has a news conference, he talks about the carbon footprint, then he takes Air Force One, an old 747 with engines that spew it, right? And he flies to Hawaii and he plays golf and he's there for almost like three weeks. This guy plays more golf than the people on the PGA Tour, I'm telling you. More. So, we're going to get our jobs back folks. We're going to get our jobs back. We're going to take care of our military. We're going to do such an incredible job. We're going to take care of our vets. Our vets are treated so badly. The illegal immigrants, in many cases, and I'm serious about this, are treated better than our vets and they get more than our vets, and we're not going to let that happen anymore. We're not letting it happen. So we're going to make unbelievable trade deals and we're going to become a rich nation again. You know, recently, a woman came up to me, a very nice woman, beautiful woman. She said, Mr. Trump, I don't like one thing you say. I love you as President, I think you're going to be great but please don't say we're going to become a rich nation again. It doesn't sound good. I said, no, it sounds so great because we can't become great unless we're going to become rich again. We can't become great if we're losing $500 billion dollars a year to China, and hundreds and hundreds and hundreds of billions of dollars to every other country. We don't make good deals anymore. So here's the deal. I don't want your money. I don't want anything. You know, other guys come up, please send money to such and such an address even if... I don't want any money. I don't need any money. I want you to do one thing on Tuesday. This is our movement. This is our... happy birthday. It's his birthday. It's his birthday. You believe this? I love you. Can you hear me over there? I love you people. I love you. I love you people. Man is that a lot of people. I love you... I love you people. Don't kid yourself folks, I have to say. Listen to this. So, everybody thinks that you have the best location, right? They do. You know why? Tomorrow morning they're going to become famous and only... they can only see the back of your head. They're all going to be famous. So, look, here's the story. No money. I don't want money. But on Tuesday you have to get out and vote. And we have to win big. We have to win big. I love Alabama. I do love your football team. How good is that team? How good? How good? Man. I love champs and I love champs. And I don't know your coach but I tell you what... and I don't know, maybe he's endorsing somebody else. I don't care. You got a hell of a coach. The job he's done here, right? I mean, in all fairness, he's done a hell of a job. But I love the team. I love watching that team. So professional. So, are you ready? You got to get out. You got to vote on Tuesday. Everybody here, you vote. We're going to win so big. Well... you know we're leading in every single state and we're almost leading in Texas. And I have a feeling we're going to win Texas also. And we want to keep this movement. You know, one of the big writers said, in the history of politics, in the history of politics in the United States... and I don't even understand it. They said there has never been anything like this that has ever happened. They have never seen anything like it. It's so amazing. They call it a phenomena. You're a phenomena. We're all a phenomena. You're a phenomena. So here's the story... and one of them said to me, congratulations. I said, on what? It's never been done before. One of the biggest writers. Highly respected. Liberal but that's OK. He said it's never been done before, what you've done. I said, what have I done? He said, what you've done, the crowds, the enthusiasm. You've changed politics. Don't forget. I spend my money. I've spent less money than some of these guys. Some of these guys... one of them spent 158 million and he was close to last place, and I spent peanuts and I was first place. Wouldn't it be nice if our country could do that? Wouldn't it be great, right? Would that be great? And we'll do that. In education... so important because it's about the American dream, right? I always say, the American dream is dead. Which it is. The American dream is dead, but we're going to make it bigger and better and stronger than ever before. But... but.... but to be a piece, and to get a piece of the American Dream, education is so important. It's so... kids. All you kids out there, just go and do something you like and your parents but education's so important. So, in the world, the top 30 countries, we're last. And yet we're first in money spent. So we're first. We spend more money per pupil by so much more than number two, your head... you wouldn't even believe it. It's like number two doesn't even exist. So we spend much more money than anybody else per pupil and yet we're last. You have Sweden. You have Norway. You have Denmark. You have China. And we're number 30. You have countries on that list that you've never even heard of, and we're number 30. So we spend the most and we are the worst. OK? We are going to change it around folks. And that goes with purchasing. That goes... we are going to purchase... you know, we're going to... we're going to start competitive bidding in the drug industry. We don't competitively bid. We're losing billions and billions and billions of dollars. We don't even bid stuff. We don't bid properly in the military. How often do you read, where they're getting a plane that they don't want? Because that company has more political muscle than the company that makes the plane that everybody wants, which is cheaper, faster better. I mean, I see it all the time. It's terrible. Those days are over because nobody's taking care of me folks. Those days are over. So here's what I want. You are going to go on Tuesday, hopefully... first of all, I love you. I love you people. I love you people. True. Thank you man. Thank you. Thank you. So, on Tuesday, you got to go out. You're going to vote. And we, ideally, you know, we want to have a resounding victory. Especially I respect this place so much. I have so many friends from this area. It's an amazing area. It's an amazing place. It's an amazing state. Diverse, incredible people. You've got to go out. You've got to vote. We've got to win by a lot. We've got to knock the hell out of everybody. The movement is going and I promise you this. I promise you this. You're got to remember this gorgeous, beautiful, beautiful evening. This is beautiful isn't it? Everything's perfect, temperature, a little windy. I could have left the head off but I decided, what that hell. It's a little bit windy. I figured, you know, why should my hair be blown all over the place? But... and then when Jeff Sessions put it on I actually felt better. But here's the story. We're going to start winning again. We're going to win at trade. We're going to win with the military. We're going to knock the hell out of ISIS. We're going to do it fast, fast, fast. We're going to win with health care. We're going to win with education. We'll get rid of Common Core. We're going to win at the borders. We're going to win and we're going to keep winning, and we are going to make America great again, greater than ever before. Greater than ever before. And I love you all. Tuesday go out and vote. I love you all. Thank you. Thank you. Thank you. Love you. Thank you."}