{"id":438,"author":"Donald Trump","title":"Speech: Donald Trump in Bentonville, AR","date":"2016-02-27","link":"https://factba.se/transcript/donald-trump-speech-bentonville-ar-february-27-2016","paragraphs":["Thank you, Chris. Thank you very much. I really appreciate it. Look at this turnout. This is incredible. And there are many people outside that can't get into the hangar. The fire marshal won't let him in. Fire Marshal, let me talk to you please, please. But it's such an honor and you know we've had tremendous results here.","And I think we're going to do very well here. We're going to do well everywhere. I think the only place we're tied actually is Texas. We're tied in Texas and I think we have a really good chance of winning Texas. People are so tired of these politicians is all talk, no action. And I've been watching it. I've dealt with them all my life.","I've been watching it all my life. I got a little glimpse of it just now coming and I watched this lightweight Rubio, a total lightweight and little mouth on him. Bing! Bing! Bing! Bing! Bing! Bing! Bing! Bing! and his new attack as he calls me a con artist. I'm a con man, right? You know I built a great business.","And believe me I wish my father loaned me 200 million or gave me 200 million. I wish he had 200 million in those days. I'll tell you what. I wish my father gave me that money. I borrowed a tiny amount of money, a million dollars. I started a business that's worth much more than $10 billion right now. I filed unbelievable statements with the SEC, federal elections and the press knows they fully understand because they went down there.","They were like a bunch of ants. They were all over the place and they were so disappointed to see what a great company it is. Some of the great assets of the world, very little debt, tremendous cash flow. And it says it all first time I've ever done that because I'm a private company and believe me if I didn't have a good statement I wouldn't have been able to run because I wouldn't have been able to file and the filing is amazing and the company is amazing.","And the reason I tell you that, is because that's the thinking we need. We have $19 trillion in debt. We're going up to $21 trillion as a country. Our country is a mess. We're losing our business. Companies are moving into Mexico. They're moving to China. They're moving to Ireland. Pfizer just announced they're going to move to Ireland, great company.","They're moving to Ireland. They're moving all over the world. They're leaving us and our numbers, that 5% number you hear unemployment, total fiction. It's probably 25. It could even be 30% because when somebody looks for a job and they give up like most people do, they go home. They say, \"I can't do it anymore.\" They're considered statistically employed.","We have a real problem, folks and we're going to get it solved. OK? We're gonna get it solved. But I will address you know, little Rubio. This guy has a fresh mouth. He's a very nasty guy. And I actually thought that Ted Cruz was a liar. But Rubio is worse. I mean he's worse. And I watched. I must tell you what are the reasons I love having Chris and Chris call me a couple of days ago and say, \"You know what?","What you have is a movement. I've never seen anything like it.\" he said and he's a pro. He's one of the real endorsements that I wanted and he called me. I would have called him. I was sort of like getting ready to call him and out of the blue, Chris called and he said, \"I want to endorse you and your campaign.","I've never seen anything like it.\" And many people have never seen anything like it. Peggy Noonan, who is terrific. She writes a fantastic piece today in The Wall Street Journal talking about it. What's happening is amazing. Time magazine, a few weeks ago, a cover story about the movement that we've created.","But just to address, so I was in New Hampshire which we won by the way. We, not me, we! We won. And I saw a meltdown of a human being like I've never seen. It was Rubio and it was Chris who started. And I'll tell you what. He is one prosecutor, isn't he? With all fairness but he started and he looked at Rubio and they went back and forth and all of a sudden and you have to understand.","I'm in this and I've been the center for every single debate now which is nice. CNN means good. I told CNN, well are you going to announce that I'm No.1? \"No.\" I said, \"Well nobody's going to know I'm No.1 unless you announce it.\" They said you're in CNN. I said, \"I don't care. Nobody knows that.\" But they don't want to do that.","They should do that, right? But they don't want to do that. They never want to do that. So, they never want to do anything good. I'm not just talking to them, I'm talking about the other ones too. The media, the most dishonest human beings on earth. I'm telling you, the most, and we're going to, by the way, while I'm on that subject I am going to do everything I can if I win.","They write false stories. They write nasty false stories, and they know they're false. I've had some written more than I've ever seen before in the last period of a few months. They write false stories you can't really sue because the libel laws are essentially nonexistent. We're going to open up the libel laws so when they write falsely we can sue the media and we can get this story corrected and get damages.","Right. Believe me. So important. And you know what, it'll be amazing how honest they become. Right now, they can say anything they want to say. Someday in the not too distant future, if I win they're not going to get away with this stuff that they get away with. And I think we all feel that. Don't we feel that way?","It's terrible. Very, very dishonest people. But I watched Chris go after this lightweight Rubio. I call him lightweight Rubio. I watched it and I'm sitting here and he's over here. Somebody on my left doesn't matter and he's over here and I see him starting to sweat like I have never seen anything like it. Thank God he has really large ears, the biggest ears I've ever seen because they were protecting him and was gone.","I have never seen any human being sweat like this guy. And he said the Obama statement once and that was fine and then he said it twice and I'm standing. I have nothing to do with it because Chris is over here. He's over here just to my right. He said it a second time and I said, \"Huh! that's strange. I'm going like this.","That's strange.\" Then he said the same exact words. You know he memorizes phrases like the con man. I saw Brett Baer yesterday say I never said -- he said con man so many times during the interview. Trump's a con man. Trump's a con man. The last thing I am is a con man, folks. I built a great business, OK. I built a great business.","And by the way think of this. Then I do a television show called The Apprentice, and it becomes one of the top shows on television, tremendously successful. And by the way, they wanted to renew me and I couldn't do it because I was doing this. And Steve Burke, the head of Comcast, great guy comes into my office.","Donald we want to renew you. I said, \"Steve I'm going to run for president. You can't do both.\" OK. It's called equal time laws or whatever it's called but you can't. He said, \"Please, please.\" I said, \"No, I'm going to do this.\" And we chose because I have a big stake in The Apprentice going forward and everything else and we chose Arnold Schwarzenegger.","Let's see how he does, right? Let's see. I hope he does well but who knows, right? I know Trump did well. Fourteen seasons! So I had this tremendous show. That was one of the most successful shows on television and really one of the most successful and we came up with the expression, \"You are fired.\" And it's been, it's been great.","And you got to know my kids, Ivanka, Don Eric, and a lot of other people and my family, I'm so proud of. But so we do a show. It's greatly successful. I do books, right? I do The Art of the Deal. One of the most successful, probably the most successful, but one of the most successful business books and books of its kind ever written.","And I did many other books. Twelve other books, many are bestsellers. And then I built this business that is unbelievable. Some of the greatest assets in the world, Turnberry in Scotland, Doral and Miami. Buildings all over the place. Big chunks of the Bank of America building in San Francisco, built a city practically on the West Side of Manhattan.","A big chunk of 12 90 Avenue of the Americas biggest floor plates in New York just above the biggest floor plates. I think they are the biggest floor plates and just built 40 Wall Street, Trump Tower. So many things. And then I listen to this like little nothing say, \"Trump's a con man.\" Isn't it a disgrace?","I mean seriously. You know it's -- it's really. It really is. Maybe you will make the libel laws also so we can sue lying politicians you know because -- but, but it's, you know, it's very insulting when you hear it. And thank goodness I have this where I can get off and counteract it because they say things that are so wrong.","I don't know what Cruz is saying but these two guys are in big trouble. They're in big trouble. Yeah. It's almost like who cares but they're in big trouble. Rubio's won nothing. He couldn't get elected dog catcher in Florida. They hate him in the state of Florida. No, no, think of it. He's a politician. Chris went over it, never votes, never anything, he couldn't right now if he ran for office in Florida, he wouldn't get elected to any office.","They cannot stand him because Florida is like a second home. They cannot stand the guy. And he abandoned them. Think of it. He runs for Senate. He wins. They give him the confidence. He wins. And before he even runs he is looking for another position. And he never goes to vote. And some of the most important bills he's never voting.","They hate him in Florida. That's why I'm up 22 points, can you imagine? We have, we have a sitting senator. At least with Cruz, where even that's not so great for him either because he's a sitting senator in Texas. So, but in Florida we have a sitting senator and I'm up by a tremendous amount, every poll, because they can't stand the guy.","Now here's the story. He sat and he stood and I thought he was going down and I said, \"Man, I think he's choking.\" I love -- I love -- it's called human whatever. I love watching whatever happens. I said, \"I'm about to witness history. This guy's going down. This guy's going down.\" and I'm looking and I'm getting ready because I'm you know, it's like there's a lot of people.","Pretty strong guy. And I'm getting ready to grab him because I thought he was, I thought he was out. And he starts sweating and honestly this is true. I've got a problem. I have never seen a human being sweat like he sweats. So Chris Christie is grilling him so he says it twice. Now he says that the third time I said no that's not good because three times the exact same line, memorized and then a fourth and then a fifth.","And I'm looking like, \"Wow!\" but I'm getting ready to grab him because I'm telling you he's going down. I have never -- it looked like he jumped in a swimming pool with his clothing on and then came back. Now for the last debate, I go back and I see him with makeup and it's like he's putting it on with a trowel.","OK. And then he got very aggressive right at the beginning. Now I knew they were going to do that. Both of them. They double-teamed me because, and I got great reviews. You know that every single Paul, Drudge, Slate, I think Time magazine, every single poll had me winning that debate which is amazing. Every single vote.","Not all of the pundits had me winning but every single poll and many of the pundits but not all of them. Some of them no matter what, if I was Abraham Lincoln debating. He was a very good debater. He'd say, \"It wasn't a great night.\" You know a couple of -- and so it was not a great night. There was a great night but right -- but I was double-teamed by these two.","But with Rubio just to finish off with him, so I knew it was gonna be one of these nights, because everybody was saying, \"Oh they've got to do it, they have no choice because they're getting killed.\" We're, we're way ahead, we're way ahead nationally. We're way ahead here. And every place. We got to win.","We got to win Arkansas. We got to win Arkansas. We gotta win. Maybe I'll start shopping permanently at Walmart if we win Arkansas. I'll never go anywhere. Now we got to win Arkansas. I love it. I love the people of Arkansas. I know so many people. They're great people. These are great people. But, but just remember this.","That's right. Thank you. But just remember these. Politicians are never going to get you to the promised land. They're never ever going to get you to the promised land and things were said in previous speeches and probably by Cruz also. But I didn't get to see Cruz. Which are just false. So many things I've done so well.","For instance, they talk Trump University. It's a small deal, very small. But I got sued by a lawyer who says they sue because they want to see if they get some money back. I could have settled this suit numerous times, could settle it now. But I don't like settling suits because when you settle lawsuits everybody says it's a little business story.","I have friends, they settle lawsuits and they can't understand why they are always sued. I don't settle lawsuits. We have people at Trump University that wrote most of them, that wrote statements and they wrote the statement where I love the school. I love this for some reason, I never saw this before. We call them report cards.","They did like report cards essentially report cards where at the end of the class at the end of the period of time they did study they did a report card on how you like it. Some even did film clips where they actually are at film saying great things. The person that started the suit wrote a great statement saying it was fantastic and did a film clip saying that was fantastic.","And they've just asked that she be taken out of the case. She doesn't want to be in the case anymore. And the reason they won is because she's a terrible plaintiff because she said all these great things about Trump University and she's on film saying how great it is. So they put on a motion, which of course, the papers don't write this.","They put in a motion saying that, \"Take her. Her name is Tarla or something, take her out of the case.\" The reason they want her out of the cases, she is a horrible, horrible witness. She's got in writing that she loves it. And I could have settled it and when I saw her documentation, I said, why would I give her money?","She loved the case and she's on tape. Why would I give her money? Probably should have settled it but I just can't do that. Mentally I can't do it. I'd rather spend a lot more money and fight. Now you got to, you've got to pay. Would have been much easier if I settled, I would have probably been cheaper.","But I don't care. It would have been much easier. It would've been cheaper, would have been much easier. But just so you understand. So these people all it is just people put up something and now they get letters. \"Oh, can you get your money back? Oh, we'll get our money back. Yeah. Let's join.\" The attorney general of New York.","This is all a civil case by the way, is a simple civil case. The attorney general of New York meets with Barack Obama in Syracuse the following day. He sues me. What they don't say is I believe 15,000 or a lot of money was paid to the attorney general by the law firm in California. They're suing me. See, I'm giving you sort of a life experience cause it's it. Isn't this more interesting than talking about trade?","A trade is easy for us. Trade is easy but this is not a life. This is almost like a story on success because this is the way the world works. This is sort of the way the world works. So the attorney general gets a campaign contribution from the law firm, that's suing me. All of a sudden the attorney general his name is Eric Schneiderman, not respected in New York, doing a terrible job, probably is not electable in New York but who knows?","And he meets with Obama, gets a campaign contribution, I think. I think it's $15,000 and all of a sudden he meets with Obama in I believe Syracuse and the following day or two he brings a lawsuit against me. Now much of that lawsuit has been won by me. He's appealing it. It's on appeal right now. But much of that case, it's so long time already.","But much of that case, we won. It's won. I don't mean we settled that. We've won. Much of that case, they missed the statute, the limitations and most of it is going away but nobody writes that nobody wants to write that. The rest of it we're doing very well. We have a very hostile judge because to be honest with you, the judge should have thrown the case out on summary judgment.","But because it was me, and because there's a hostility toward me by the judge, tremendous hostility beyond belief. I believe he happens to be Spanish, which is fine. He's Hispanic, which is fine. And we haven't asked for recusal which may, may do. But we have a judge is very hostile. Should have been thrown out wasn't thrown out.","And I say I'd rather go to court because when you go to court and you have witnesses get up there and then they have to say, \"But why did you sign a document saying that you love the school etc., etc.\" Why should you pay money for that? So I just wanted to give you a little bit of the parameters because you keep hearing about, \"Trump University.\" So it's a civil case.","It's a sleazebag law firm that does these class action cases. They're very routine and I will win the case in the end. I just didn't want to be forced to settle and I could have settled it before I did this and I knew somebody would try and use it for publicity but I believe I can turn it around just to show you how dishonest these people are.","And that's the case. And just to finish if I didn't have a hostile judge in California this case would have ended years ago. It would have ended a long time ago. OK. Are you ready? So, that took place with Rubio. Rubio's going nowhere. I think he's going nowhere. Hasn't won at all. They're fighting. Now, what they want to do is they want to take Trump on individually.","They're all fighting. I saw this morning. We should get out. This one should get out, that one should get out, should get out. He is a nice guy, by the way. Even though he's a little tougher than you think, he's another one. He's very nice. \"Oh just so terrible you're fighting. Oh it's so terrible, it's so terrible.\" He's always in the end, you know, close to getting out.","You know when you're on those end positions. I won't mention what I told other people. But when you're in the end position that means you're close to it's close to over. But every time these, these two guys were hitting me, he looks like, \"Oh that's so terrible that you guys are fighting.\" \"You know, this, we should have peace.\" That's all good.","But the worst ads that would take it against me were taken by . And you know like he's such a nice guy. Any yes, he's fine. But I'm in the -- I'm in New Hampshire which we won, by the way. We won New Hampshire, we won Nevada, we won Nevada, we won South Carolina. It was so beautiful and I'm watching them.","I actually tweeted today, \"We won South Carolina, we won South Carolina! What a great memory.\" And now I'm watching Bernie and Hillary fighting in South Carolina. And I have the victory on the Republican side. And you know what I saw, which was amazing? We had the largest turnout in the history of South Carolina.","I won by tremendous numbers, right? Landslide, right? Beyond! And don't forget that was supposed to be 100% Ted Cruz. That was going to be his, you couldn't beat him. They're impossible to beat him. Not only did I beat him, we killed him by what was it, like 20 points, some unbelievable amount. I won with every single category.","I won with women, with men, with evangelicals, with military, with the vets. We won with rich. We won with less than rich. We won with highly educated. We won with pretty good education and we won with people that didn't do so much with the education. But they're doing well, anyway. I love them. OK. I love them.","I love them. They're my people. They're my people. But we won with virtually every category and then we go to Nevada and we win. I mean that was a blowout. We just won with everything. And I felt it because that was a caucus I was a little word with the caucus stuff because caucuses can get a little dishonest.","Can I say that word dishonest? And I went to one caucus which is the biggest one in Las Vegas. And I'll tell you there was such love. They went crazy and there were probably 2,000 people in the room and of the 2,000 people a hundred people maybe. I don't even think that we're possibly going to vote for somebody else.","Everybody was on our side. And I said there's a good side. I got back to the room. It was long before seven o'clock when the polls actually close over there at seven o'clock and they're already saying, \"This thing's over because they've been all over the state. It was the same way.\" And we ended up getting a tremendous victory by it wasn't even a contest.","So. Again with evangelicals, with military, with everybody. So it's been like a great, great experience. And part of it is anger. And part of it is you tired of the politicians. You're tired of guys -- you're tired. You know what, I'm tired. And you're tired of guys like little Rubio, who you know a little mouthpiece goes like a mile a minute.","You were tired of these people. They're never going to get anything done. They're never going to get -- Hey by the way, Rubio bought a house for $178,000. He sold the house for $380,000. Probably the only good deal he ever made. To a lobbyist who I think was in front of them or close to in front of them up in the Senate, this was in Florida, wanting something approved.","Now that's really dishonest. Rubio stole from the Republican Party. But you know what happened? They said you stole from the party. Says, \"No I didn't.\" \"Yes you did.\" \"You had a driveway built.\" \"No I didn't.\" \"Yes you did.\" \"Oh, OK.\" Well, he reimbursed them, OK. And for some reason he didn't get indicted.","Why doesn't he get indicted? I'll guarantee you one thing. Chris Christie would have indicted him so fast. But why doesn't somebody look into his house there? Why is it? How can he make that kind of a profit on a house to a lobbyist? And that's the problem. People are controlled up here by lobbyists. You know that, right?","We have the lobbyists and the special interests that have total control over these folks. But not Ben, because Ben is not controlled by them although I don't know where he is getting money from. I don't even care. Ben is such a nice guy. And by the way, what Ted Cruz did to Ben Carson was a disgrace in Iowa.","That was a disgrace. He said Ben Carson has left the race because he went to Florida. He was heading out to Florida which is where he lives in all fairness. Ben Carson has left the race and vote for us and at caucus you know you can actually take the people and walk around. I don't like caucus. I like where you walk into a voting booth.","You walk, you vote and you leave like what you people are going to do. OK. I don't like this caucus stuff but they said, \"Ben Carson has left the race. Vote for us.\" and they wine and dine him and bring him around. I'll bet you have thousands of votes. And I want to win Iowa in my opinion if that happened.","Because these extra votes, these extra votes went to him and you know what? Honestly, if we had a strong Republican Party, they would disqualify him for what he did. Honestly, I mean if I were the head of the Republican Party I wouldn't throw him out. You know, maybe for Canada will throw him out. We'll see about that.","But that's a serious problem you know, he's being sued and I didn't sue him. I'm so not litigious. It's amazing. But, but he's being sued now. I heard he's being sued because he was born in Canada, lived there for years. Who knows? I always thought you had to be born here like on this soil right here in Arkansas.","So we'll find out what happens. Hey, I hope that's not the reason he has to get out. I hope we beat them. But, but you know what, Ted has that problem. But if I were the head of the Republican Party I would disqualify his Iowa situation where she also did another thing. Did you ever see that voter violation?","Did you ever see this? It's like a fraudulent document. Looks like it came out of a government agency so professional says, \"Voter violation.\" And it talks about you're in violation of all these things. Listen to this. Essentially, this isn't exact but close enough. But if you vote for Ted Cruz and bring this in and vote for Ted Cruz, the violations canceled.","Now you have people that honestly sort of believe it. I looked at one of them and I said man that comes right out of a government agency. That's a fraud. And I saw lawyers talking about it and some of these crazy talk shows and they said. They said it's a fraud. I mean it's like a fraud. I would have disqualified him from his victory in Iowa because you can't do business like that.","You just can't do it. You can't do it. Then you take everybody, move them up a notch. Now I won four in a row instead of three. I like that, OK. And it doesn't matter. I got almost the same number of delegates. I got one last. But doesn't matter. But, but you can't do that stuff. You can't do that stuff.","And frankly, but Cruz is smarter than Rubio. Intellectually, he's smarter than Rubio and, but, but both they lie. You know I deal in the real estate business. I deal in a lot of different business. I meet some bad people. I meet much tougher people than a Rubio or Cruz. Much tougher. But I've never met people that could lie like these guys.","These guys are world class liars. It's unbelievable. And I was helped in Cruz's case because Rubio looked at him and said, \"You're a liar.\" And he was actually right because he actually did lie about that particular point. But once he said he was a liar, I was able to say he's a liar. You know I've never seen politics.","I know politicians very well. I've dealt with them all my life. A lot of them are bad people. You have some good ones but you have a lot of really seedy, horrible people. I've never -- and I've seen some bad stuff. I've never seen a politician call another politician a liar when he called him a liar, I said, \"Great! Now I can call him a liar.\" So, so much lying.","But Rubio is probably a worse liar than Cruz. I don't know who to pick. I'll pick at the end of three or four weeks. I'll give you my, I'll give you my pick. Does that sound OK? So, we have an amazing story. I have decided that with my life. If I win, I'm going to do something that's going to be so amazing for our country.","We're going to have great trade deals. We have the worst trade deals ever made in history. We have trade deals that are so bad. We have deals period that are so bad. The Iran deal, we give one $150 billion to Iran. They're now spending that money. It's one of the worst deals. Forget about country to country.","One of the dumbest deals I've ever seen. But all of our deals are like that. That's a horror deal. That deal -- those, those hostages should have been back four years ago. They should have been back before you started the negotiation. They go in this guy Carry. They go in, they go in. It's, it's horrible.","They go in and you say we have to have our hostages back and they'll say no. The Persians, great negotiators. Persians always been great negotiators. They'll say no. And you'll say bye-bye we're leaving. Bye. Enjoy yourself. Now they're sitting at a table. Nobody on the other side of the table and you let them know, \"We're not going to negotiate until the hostages are released.\" and then you double up on the sanctions.","You just go ratchet, ratchet, ratchet. Within 24 hours, you'll be called. You've got your hostages back, folks. Then I go a step further and I tell this story about my father because my father did not give me $200 million. Believe me. Oh, I told you, my sister. She calls and I have a great sister, a great brother.","They both call that after the debate. Dad, never gave you? Are you kidding? Where's our piece of it, you know?\" It's unbelievable. Took a million dollars borrowed and paid it back and that's now morphed into 200 part of the reason in all fairness to Rubio. He read that in the New York Times. It was such a false piece.","The New York Times, it's going out of business. It's the worst newspaper. It is a dead newspaper going out of business. I'll tell you what. Unless somebody buys it like me as a vanity project. All right. It loses a fortune but they are the most dishonest people at the New York Times. They'll write, they will write, they wrote a story about me a couple a few days ago.","It was so wrong. They knew it was wrong. I said then pull the story. No we won't do that. Why wouldn't you pull it if you know the story is wrong? Why won't you pull it? And they admit it is wrong. We won't pull it. They are really dishonest, New York Times. I call it the failing New York Times. You know it's very interesting.","They bought The Boston Globe. They paid $1.3 billion for the Boston Globe, right -- 1.3 billion. They spent a fortune. Hundreds of millions of dollars on modernizing it, right? At the end of a number of years they just sold it for essentially one dollar. They lost a billion and a half dollars. They have no money.","They sell their headquarters, this beautiful -- like the cathedral. I used to go there when they had real people running the paper. It's like a cathedral, old beautiful building on I think West 40, 30, 40, 50, 43rd. Beautiful, beautiful building. They used to call it The Cathedral to Journalism. They sold it to move into an office building.","That's a horrible office building, opposite the port authority bus terminal. Horrible. But they sold the cathedral and they sold it for, I believe about $150 million. The guy that bought it, they're friends of mine. They flipped it for $525 million. A short time later, and I say to myself, so why are we listening to their editorials?","They tell you what to do. They tell you this and that. They write stories that are inaccurate. So why does anybody even read the New York Times? They lost a billion and a half dollars on a -- on a simple newspaper. They lost hundreds of millions of dollars. They should have never left their Cathedral because now you walk into that place and it's like you're walking into a store.","It's like walking down this concrete right here. There's nothing. It's just a very average office building with bars on the front of it. It's terrible. And I'd say, \"Why?\" My friend and the group, they made hundreds of millions of dollars in a short just buying it, keeping it for a little while, selling it and then we're supposed to listen to the New York Times.","These people are incompetent and they're bad people. They have a bad agenda. They're really bad people. That's one of the reasons I want to straighten out the libel laws so that we can go after them because they're bad people. These are really bad. So, what we're going to do is we're going to make trade deals that are going to be fantastic.","We're going to get our best. You know, we have the greatest negotiators in the world. We have the best. We use political hacks to negotiate with China. With China, we are losing right now $500 billion. With a B, billion dollars a year. OK, that's our trade deficit. We have a trade deficit of China with China -- 500 billion.","We have a massive trade deficit with Japan. They bring in millions of cars. You look at those boats in Los Angeles. They bring in millions and millions of cars. It never stops. We send them beef. We send them beef. That's the deal, OK, which is a fraction. And they don't take the beef. You know that, right?","You know what happens. Goes back forth, back forth. Finally they take it. They call it aged. It's Kobe beef and they sell it for 10 times more. That's what happened. It's what happens. But we don't get the price. They get the price, OK. But with Japan, same thing. With Mexico, they're killing us at the border.","They're killing us with trade. You saw the other day, Carrier just moved to Mexico. Carrier, they now, it's very sad somebody had their cell phone going. They're taking these shots. Everyone's devastated. Fourteen hundred people gone. Ford moved to Mexico, two and a half billion dollar plan. Nobody did anything that was two years ago.","Now they're doubling up. They're going to build more there. I would've let them have it so hard, they would never have the guts to build more there. Never have the guts. Nabisco, Nabisco just moved. They're big, they're big plant, where they make Oreos. They moved there. Which we don't eat anymore, right?","No more Oreos. That's a good thing. That's a good thing. But Nabisco just moved their plant from Chicago into Mexico. OK, no more. But let me tell you about Carrier as I watch Carrier because it just happened a week ago and I watched these people that were devastated that were there for a long time. Good people, good air conditioners, I buy a lot of Carrier aircon.","I'm not buying them anymore by the way. But I buy a lot of Carrier air conditions and I saw this executive up front, \"We're going to close our operations and we're going to move to Mexico.\" Lots of luck folks, right? People are devastated. So I went to the Wharton School of Finance which is considered the best business school, OK and be very smart to get into that school.","Very smart. The Rubios of the world cannot get into that school. They don't have the capacity. Actually, Cruz could, in all fairness, Cruz could. I, I don't know that he has the temperament. I think neither has the temperament but academically, certainly. But, I go to Wharton. I'm smart. You're smart, but you don't have to be smart.","How do we solve the problem where all these countries are moving into these places and people like yourselves and friends of yourselves and people that I know are losing all their jobs? We're being devastated. So here's what we're doing with as an example, Carrier. I would call Carrier through one of my people, because I don't know, it's not cool if the president calls, right?","The president's calling an air conditioning guy. I mean listen, I don't like what you don't. I may make some of those calls. They're going to say it's terribly unpresidential, but I don't care, right? You know. Now they'll say it's un-presidential. They'll say it's un-presidential. When Vicente Fox, the former president of Mexico, when he used the \"F\" bomb I thought it would be a national thing because I know if I used it, it would be the biggest story in the history of the world, right?","So, he is and nobody cares. And then he was and he was so angry, you know. Why he was angry? Because they used to getting their way, right? They used to getting their way. \"How dare they do this? How dare they say that? And I won't build that.\" You know, \"What wall? We will not build that. You know, \"What wall?\" See?","I've learned.","By the way I don't use that word. The words I use are peanuts compared to that word. I couldn't -- I couldn't, I wouldn't be able to get off the airplane. Do you like the plane made in the United States? Boeing: Made in the United States. Speaking of that, Iran just ordered 118 airbus planes. Nothing in the United States.","They just ordered a lot of equipment from Italy and all over Europe. They just ordered missiles. I didn't know they could buy missiles with $150 billion. They just ordered missiles from Russia and nothing from the United States. They capture our 10 wonderful sailors. They put guns to their heads. They put them in a begging position.","They were scared and frightened and they let them go two days later, because you know what the money was going to pass. If the money was not going to pass, if they already had the money, the billions and billions of dollars, they would have kept them. But they wouldn't have kept them if I won the race. That I can tell you.","They would have been out so fast. They would have been out so fast. So, with Carrier, I'll call them up. I say, \"Folks, congratulations on your new plant. I think it's wonderful. I love that you're building in Mexico. It's great. I hate what you did with the 1,400 people and more.\" And this is also United Technologies just to shame them because they laid off additional people where they're going to Mexico.","Mexico is becoming the new China. You better be careful folks and their leaders are much smarter than our leaders. And they are ripping us not only at the border, but they're ripping us like crazy with trade. So I'd say to the head of Carrier, \"Congratulations on the new plant.\" But here's the story folks.","Every single air conditioner that you make, as it passes the border and we will have a real border, OK. We will have a real border. The illegals will not be able to carry those air conditioners in, OK. Chris we're going to have a real wall. We're going to have a wall. It's going to be a real wall, folks.","And by the way, congratulations Mexico. You're paying for the wall. Just so you understand. Congratulations. So, I would say to them, \"Every air conditioner that you make that goes into the United States and over our border, every single one you're going to pay a 35% tax on, OK.\" Now some of the stupid people because I'm a conservative person but I like to say I'm a conservative person with common sense.","All right. Some of the stupid people that say, \"Oh he's not a free trader.\" No, no, I'm a smart trader. I'm a fair trader. I'm a free trader. But it's got to be fair when China is making $500 billion on trade deficits. I'm not a free trader, folks because when you try and do business in China, they charge you tax.","I have many friends. I can't do business in China. They can't get their product into China. China dumps it over here. You can't get it over there. And when he does get it in it's a big tax, OK. So I'd say to Carrier, \"Congratulations! but you're paying the 35% tax.\" Here's what's going to happen. I do it early before they start building and I like to get them.","Here's what's going to happen, \"Mr. President, no you can't do that. That's not free trade. Like all these stupid people, they talk about free trade. We want free trade. Mr. President, that's not free trade.\" I said, \"Here's the story. I'm just telling you, every single unit you make comes over that border, you're paying a 35% tax and that's going to make up for all the jobs we lost and everything else.","And I hope it works in your bottom.\" So here's what will happen. If I am one of these characters like a Rubio. Take a look at who's giving him money. Look at the guys giving him money. Take a look at the guys giving Rubio money. Take a look at the guys giving Cruz money. I'm not even blaming him. It's the system.","But when those guys need something, it's 100%. Look at the lobbyists. Look at these special interests given these characters money. A hundred percent control over them. They have 100% control. Me, I'm free -- I'm self-funding. I'm not doing the money thing. So I'm putting it, you know. I think somebody said to me, I said the other day \"How much have I got?\" You know, I was always proud of the fact, I think I'm in it for over $25 million already.","I didn't have to spend any money. I didn't have to spend any money but within. I'll tell you what. And that's a big thing. I don't think I get credit for that. I'm self-funding my campaign. I'm the only one in either party. I'm self-funding my campaign. I'll go a step further. I think I'm the only one in many, many years.","I mean, I don't remember anybody. Maybe Ross Perot many, many years ago but I don't remember anybody's self-funding. They all take money from these people and during the debates you probably saw that somebody would get up make a fool out of himself and they're all standing up clapping like he made a great answer.","I'd give a good answer and it was like dead silence in the room. And I had friends in that room and I said, \"Boy those are, that's a rich room.\" Because I know a lot of the guys, lobbyists, special interest and one of them the other night actually is laughing, having a great time, waving at me as a friend of mine and then booing me when I give an answer.","He's \"Boo! Boo! Boo!\" and he's like that. They're all playing games, folks OK. In fact, I just spoke to him. It's fun and it's cute. It's fine. It's life. It's the way life is, OK. It's the way life is. But that room, those rooms were packed. They're packed with special interest and they're packed with donors and lobbyists.","And those people have totally control over the -- total control over the people I'm running against. So what will happen if you have a President Rubio? Or if you have a guy like you know nasty Ted? Then what's going to happen? Is there going to be called by their lobbyist? Because you know, you have lobbyists, what they specialize in politicians.","I mean there's the way it works because I've had many lobbyists and do a great job actually, it's almost guaranteed. If you need something, I say, \"What do you think? You know anybody for Senator Rubio?\" \"Oh yeah. We have this one, this one, that one, they're all good.\" Who's the best?\" \"This one.\" \"Call a man.","Tell him what I need.\" Goes in, gets it, sends you a massive bill. Sometimes it's two minutes work. You know, \"Hey, do me a favor or don't do me a favor, just do it.\" I mean it's terrible. That's the way the system works. OK. So if you have Rubio, Cruz and what happens is the lobbyists special interest or donors will call and they'll get 100%. Here's what happens with me. Carrier will call friends of mine.","But the friends I won't accept them and I've turned down, by the way, I've turned down tens of millions of dollars. I feel stupid doing it. I must tell you. My whole life, I've been taking money, my whole life. I mean despite listening to the sleazebag, my whole life has been about making money. And I give a lot of money away and all that stuff.","But you know, I take money. That's what I'm supposed to do, right? I'm a business person. You're a business person. I also gave to Democrats. I gave to liberals and conservatives are Republicans. I was loved by everybody. And that, I owed it to my family, and myself, to my company. I mean I got along with everybody when I needed something.","I mean I just got along with everybody. But what happens is this, when they're called they do what they do when they call me. So here's what happens. They call me, I say no interest. I say I have no interest. Carrier will call me within 48 hours saying, \"Mr. President we're moving back into the United States.\" It's very simple.","It's very simple. Within a short period of time they will call and they move back and honestly, look, we're losing so many companies and I want to see free trade. I want to talk about free trade. I love free trade. It's not working folks. We're losing. We're losing everything. We're losing our jobs. We're losing our money.","We're losing our base. We're losing everything. We're losing our respect. China, we have rebuilt China. You know what, China, and I love China. They give me tens of millions of dollars for condos. I have the largest bank in the world which is a Chinese bank. That 400 million customers, the largest bank in the world is a tenant of mine in Manhattan.","They pay me a lot of rent and they wonder if I like the Chinese. I love the Mexicans, the Mexican people are phenomenal people. I just won in Nevada. I won with the Hispanics. Did you see that? Everyone said 46%. Everybody said, \"Trump won with Hispanics. Oh that can't be right.\" And I said to everybody, \"How many Hispanics do we have here, do we have a -- is a Hispanic.\" You know what in Arkansas, we have about three.","That's OK, but they're three and they're right up front and they like Trump, right? But I won with Hispanics. Now, we have to use our head because China is the single greatest theft in the history of the world. We have rebuilt China with the money they've taken out. We have rebuilt China. Not gonna happen anymore folks.","Not gonna happen anymore. We're going to have great trade deals. We're going to have great, everything. We're going to be so smart. We're not going to make Sergeant Bergdahl where we get Bergdahl and they get five killers that they've been after for years. Not gonna happen anymore. And five to six people probably six, but five people at least were killed trying to find him.","So he's a traitor. We knew he was a traitor because we had a general and a colonel there prior to, and they before we made the deal. So we make a deal where we get a dirty rotten traitor and they get five people that they most coveted for nine years. They've wanted these people. Those people are now back on the battlefield or will soon be back on the battlefield trying to kill us all, OK. Not going to happen anymore.","We're not making those deals. We're not making the Iran deals anymore. We're not making. We're going to build up our military. It's totally depleted. Can you imagine General Douglas MacArthur? I thought he was great. General Douglas MacArthur, General George Patton. Can you imagine saying to them we can't beat ISIS?","They'd knock him out in 24 hours, I swear.","It would be brutal. It would be brutal. And we have great people going to Air Force academy, going to Annapolis, going to West. We have great people, but we don't have a leader. We don't have a leader. So we're going to build up our depleted military. And by the way, we're going to get the things that the generals want.","Not the things -- do you notice we order planes that they don't want because it's made by a certain company instead of another? They want another plane. It's better, it's faster, it's cheaper. Not bad quality is right? The planes better, faster, cheaper. And we ordered, we ordered the one they don't want.","I see it all the time and we're going to get the right stuff and we're going to make great deals and we're going to bid like crazy. But we're going to bid and we're going to make up, we're going to -- There is so much fraud, waste abuse in our system. I'll give you an example. The drug companies take care of all these guys I'm running with all of them.","They give money to them. You wouldn't believe. Do you know a friend of mine, a doctor comes up to me and he says very, very like you can't believe it. \"Donald could you look into this? The United States is the largest drug buyer in the world.\" You know, drugs, good drugs make you better, right? Hopefully make you better.","Some probably don't. But drugs that make you better, we don't bid. I said, \"No way. We don't bid.\" Now once he said it, \"I'm smart.\" I go, \"Oh I know what it is. The politicians don't make us. So if we bid, we would save $300 billion a year on drugs for all of the stuff we buy.\" We would save billions, and billions, and billions of dollars.","We don't bid. Why don't we bid? Because the drug companies have these guys totally under control. I don't give a damn about the drug companies. I don't give a damn. So the money that we'll save and here's the end result. The end result is the product will be better. Years ago, a certain senator who's actually a very good senator.","I won't use his name because I don't like to subdue the people I respect. I want to at least get their approval. But I was called by, I believe the ambassador from Sweden and they were going to spend a billion and a half dollars on renovating the United Nations building. And I had just built a building across the street that was 92 stories, beautiful Trump World Tower.","And I did it for like $360 million. And this guy called up and he said, \"Mr. Trump I don't understand.\" You know he was a good man. I think he was the ambassador to Sweden, but whatever. He called up, he said, \"I don't understand. We're going to spend one and a half billion dollars on fixing up the United Nations, not building, fixing.","But I read where you spent $360 million to build that massive building right across the street. Could that be possible?\" I said \"Yes.\" He said, \"Why?\" I said, \"Very simple. Corruption and incompetence\" \"OK.\" He said, \"Could I set you up with meetings with the head people at the United Nations?\" Kofi Annan at that time, the head man.","I said, \"Yeah, I'll come over.\" I mean because he said, \"What do you think it should cost?\" He sent me the plans. I said, \"No more than $500 million. That's what it should cost to do a complete beautiful with marble floors instead of terrazzo.\" That's what I do. Nobody builds better than me folks, really.","Even the builders in New York will tell you, \"Call up Richard left Rick. Call up The Builders.\" They will tell you. Nobody builds better than me. So what happens? They called me and I go to the United Nations and I'm talking to them. And the head guy doesn't know. I said, \"Is it a boiler system or is it New York State?\" \"I don't know.\" I said, \"But aren't you in charge?\" \"Yeah.","But I just don't know. I don't know what New York's name is.\" He tells me. I said you got a guy who just doesn't know anything. So anyway, I said, \"Look, I will do it for 500 men. I'll save you a billion dollars. I'll do it.\" And somebody said to me, \"Yeah, but it won't be the same job.\" I said, \"That's right.","It'll be much better.\" In other words, in other words, he'll use linoleum, or you'll use terrazzo, and I'll use marble. It will be a better job and you don't have to move. I'll do three floors at a time and nobody's even going to be disturbed and you won't even have to move. And that was it. I never heard from them again.","And the numbers came out recently and they're close to $4 billion to renovate some buildings. And I think it's such a shame. I never even heard from them. I was going to save them a billion dollars. But the point of it is this. They said, \"Well it won't be the same.\" Honestly my $500 million renovation of the United Nations would have been a much better job.","A much higher end job than their one and a half billion dollars a year and they actually called hearings. I went down to Washington. I testified before a congressional panel. But nothing's done. You know, they're politicians. They're asking, \"Well how come this? How come? Then I said, \"Hey, look you tell me.\" So they had these big hearings that lasted for a long time.","The books got closed. Nothing was ever done. But I tell you better. Same thing with the military. I'll get better stuff for less money. And even as an example, they're going to order a new Air Force One, right from Boeing, $3 billion. Now, I don't want to get into it because I'd like to have it. If I win, you know, I'd love to have it and blame Obama.","You know, because that plane is old. You know, he played golf the other day in Hawaii. He went out for Christmas to play golf. He was talking about the carbon footprint and then he got into this plane that's very old and we should have a new Air Force One. I mean it's a very old Boeing with the old engine-spewing stuff.","But he was talking about \"The carbon footprint and we must stop what's happening and pollution and global warming and all of this, right?\" Then he gets on the plane and he flies to Hawaii to play golf and he flies back and he talks about the carbon footprint. Give me a break, folks. Give me a break. So, so look, we're going to start winning with everything.","We're going to knock out Common core. We're going to bring our education love. We're going to repeal and replace the horror that's known as Obamacare. It is a horror. We are going to save and enhance and always protect our Second Amendment which is under siege. We're going to save our borders. Right now this Swiss cheese people just pouring through.","We're going to create strong borders. We're going to build a wall. Believe me it's going to be build. You heard -- you heard I think that one of the sessions I had with the press. They said, \"How do you respond to Vicente Fox?\" He was the ex-president. I said, \"I think he's got a filthy mouth to use that word.","I think it's a disgrace.\" I'm like the only one that said it. \"But how do you respond? He said that he will never build that wall.\" What did I say? I said, \"The wall just got 10 feet taller.\" Here's the thing. We have a $58 billion trade deficit with Mexico, $58 billion trade deficit. The war is gonna cost $10 billion, maybe 12, depending.","Goes higher, higher, higher, it's OK. Nobody's going over the Trump Wall. Let me tell you. Nobody. To go deep and you got to go high. The deep will stop some of those tunnels. Is it amazing how they can't stop a tunnel? I mean it's called like check the area, right? So we are going to do that. But, but it's gonna be there and it's going to work.","And you know, I won in New Hampshire and the people in New Hampshire which I love, because they gave me that first great victory. And I love those people and they have a huge heroin problem up there. You wouldn't think of it. You know, you see these beautiful fields and you see the beautiful trees and roadways.","It is so beautiful. The biggest thing whenever I went to a meeting was heroin, heroin. Their kids are being addicted to heroin flowing across the southern border and I never made a pledge to them. I said we get it when it first hit. I help your kids trying to get them unaddicted. They are so addicted, they have such a problem up there.","You wouldn't think of it from New Hampshire. You could take over for some places, not New Hampshire. These are incredible people. And I made a pledge. We're going to stop that flow from coming in because the easiest way to create to stop the problem is just don't let them have it. Don't let them have it. Once they're addicted it's really tough stuff to get off.","But we're going to stop the problem. So, the other day though, I heard our great Vice President Joe Biden apologize. Now here's a guy, uses the \"f\" bomb. He's angry at the United States because he's so arrogant because they've always gotten their way. And that was where that came from. How dare they say that to Mexico.","Well, we went all the time against the United States. Why would they say that? That's why essentially, he was saying. And then I see Joe Biden apologizing to Mexico. I'd like to apologize. He was apologizing for me. Do you believe it? They call him the Republican candidates. But hopefully he was apologizing just for me. I love that.","You know. Even the pope was very nice. He did a thing right before the election right. In South Carolina. I heard, oh the pope the pope said something I said to my people. \"Wait a minute they're going to vote tomorrow morning. Was it good or was it bad?\" This was like 10 hours before the polls opened, right?","In South Carolina and my people said, \"Mr. Trump it was bad?\" I said, \"Oh this could only happen to me.\" The pope, the pope! What did he say? And basically, the Mexicans convinced the pope that Trump was a bad guy because I want to have a strong border. And when the pope figured it out and when we -- you know a lot of people will call in the Vatican, I can tell you because a lot of people agree with me that we have to have strong borders.","But by the time he figured out about the crime and everything else, the next day he was great and they really, they were very nice. But I was just saying this could only happen to me, with a pope 10 hours before an election comes out with something. So we're going to make our military strong. We're going to knock the hell out of ISIS, folks.","We've got to do it. We're going to -- we're going to knock the hell out of ISIS. Got to do it. We have no choice. We're going to take care of our vets. And here's a story, very simply, we're going to be a great country again. We're going to be the smart country. We're not going to be the dummies that don't know what they're doing.","We're not going to be the stupid people that are left out all over the world. We're not going to be the people that are afraid to even talk the word waterboarding. And yet in the Middle East you have people chopping off heads. Can you imagine? Can you imagine what ISIS and the others are saying in the Middle East as they chop off head after head after head of Christian?","As they drown people in big steel cages just drop them right in the water or drown and blow them up. They're all dead and then we talk about waterboarding is severe. They are saying to themselves, these are the weakest, the dumbest people. They cannot believe it. And when they asked Ted Cruz the question, remember in the last debate just before the last one, \"What about waterboarding?\" He couldn't. \"Well, I don't want to get involved.","That's a tough question.\" Then they said to Trump, \"What do you think about waterboarding? I think it's great. But we have to go stronger.\" I got a standing ovation. I got a standing ovation. And I didn't ask a pollster to go and poll the question. They said it to me again. \"Chop off heads.\" We're going to be very strong folks.","We're going to be this smart country again. So look, I want to thank you all. I would love to win Arkansas, special place. Many friends. Many. I don't want your money. I don't need your money. I don't want it. I want you to go out and vote on Tuesday. And just knock them dead and let's go. Let's create a mandate.","We are going to make America great again. We're going to win, win, win. Thank you everybody. Thank you. Thank you everybody. I love you."],"text":" Thank you, Chris. Thank you very much. I really appreciate it. Look at this turnout. This is incredible. And there are many people outside that can't get into the hangar. The fire marshal won't let him in. Fire Marshal, let me talk to you please, please. But it's such an honor and you know we've had tremendous results here. And I think we're going to do very well here. We're going to do well everywhere. I think the only place we're tied actually is Texas. We're tied in Texas and I think we have a really good chance of winning Texas. People are so tired of these politicians is all talk, no action. And I've been watching it. I've dealt with them all my life. I've been watching it all my life. I got a little glimpse of it just now coming and I watched this lightweight Rubio, a total lightweight and little mouth on him. Bing! Bing! Bing! Bing! Bing! Bing! Bing! Bing! and his new attack as he calls me a con artist. I'm a con man, right? You know I built a great business. And believe me I wish my father loaned me 200 million or gave me 200 million. I wish he had 200 million in those days. I'll tell you what. I wish my father gave me that money. I borrowed a tiny amount of money, a million dollars. I started a business that's worth much more than $10 billion right now. I filed unbelievable statements with the SEC, federal elections and the press knows they fully understand because they went down there. They were like a bunch of ants. They were all over the place and they were so disappointed to see what a great company it is. Some of the great assets of the world, very little debt, tremendous cash flow. And it says it all first time I've ever done that because I'm a private company and believe me if I didn't have a good statement I wouldn't have been able to run because I wouldn't have been able to file and the filing is amazing and the company is amazing. And the reason I tell you that, is because that's the thinking we need. We have $19 trillion in debt. We're going up to $21 trillion as a country. Our country is a mess. We're losing our business. Companies are moving into Mexico. They're moving to China. They're moving to Ireland. Pfizer just announced they're going to move to Ireland, great company. They're moving to Ireland. They're moving all over the world. They're leaving us and our numbers, that 5% number you hear unemployment, total fiction. It's probably 25. It could even be 30% because when somebody looks for a job and they give up like most people do, they go home. They say, \"I can't do it anymore.\" They're considered statistically employed. We have a real problem, folks and we're going to get it solved. OK? We're gonna get it solved. But I will address you know, little Rubio. This guy has a fresh mouth. He's a very nasty guy. And I actually thought that Ted Cruz was a liar. But Rubio is worse. I mean he's worse. And I watched. I must tell you what are the reasons I love having Chris and Chris call me a couple of days ago and say, \"You know what? What you have is a movement. I've never seen anything like it.\" he said and he's a pro. He's one of the real endorsements that I wanted and he called me. I would have called him. I was sort of like getting ready to call him and out of the blue, Chris called and he said, \"I want to endorse you and your campaign. I've never seen anything like it.\" And many people have never seen anything like it. Peggy Noonan, who is terrific. She writes a fantastic piece today in The Wall Street Journal talking about it. What's happening is amazing. Time magazine, a few weeks ago, a cover story about the movement that we've created. But just to address, so I was in New Hampshire which we won by the way. We, not me, we! We won. And I saw a meltdown of a human being like I've never seen. It was Rubio and it was Chris who started. And I'll tell you what. He is one prosecutor, isn't he? With all fairness but he started and he looked at Rubio and they went back and forth and all of a sudden and you have to understand. I'm in this and I've been the center for every single debate now which is nice. CNN means good. I told CNN, well are you going to announce that I'm No.1? \"No.\" I said, \"Well nobody's going to know I'm No.1 unless you announce it.\" They said you're in CNN. I said, \"I don't care. Nobody knows that.\" But they don't want to do that. They should do that, right? But they don't want to do that. They never want to do that. So, they never want to do anything good. I'm not just talking to them, I'm talking about the other ones too. The media, the most dishonest human beings on earth. I'm telling you, the most, and we're going to, by the way, while I'm on that subject I am going to do everything I can if I win. They write false stories. They write nasty false stories, and they know they're false. I've had some written more than I've ever seen before in the last period of a few months. They write false stories you can't really sue because the libel laws are essentially nonexistent. We're going to open up the libel laws so when they write falsely we can sue the media and we can get this story corrected and get damages. Right. Believe me. So important. And you know what, it'll be amazing how honest they become. Right now, they can say anything they want to say. Someday in the not too distant future, if I win they're not going to get away with this stuff that they get away with. And I think we all feel that. Don't we feel that way? It's terrible. Very, very dishonest people. But I watched Chris go after this lightweight Rubio. I call him lightweight Rubio. I watched it and I'm sitting here and he's over here. Somebody on my left doesn't matter and he's over here and I see him starting to sweat like I have never seen anything like it. Thank God he has really large ears, the biggest ears I've ever seen because they were protecting him and was gone. I have never seen any human being sweat like this guy. And he said the Obama statement once and that was fine and then he said it twice and I'm standing. I have nothing to do with it because Chris is over here. He's over here just to my right. He said it a second time and I said, \"Huh! that's strange. I'm going like this. That's strange.\" Then he said the same exact words. You know he memorizes phrases like the con man. I saw Brett Baer yesterday say I never said -- he said con man so many times during the interview. Trump's a con man. Trump's a con man. The last thing I am is a con man, folks. I built a great business, OK. I built a great business. And by the way think of this. Then I do a television show called The Apprentice, and it becomes one of the top shows on television, tremendously successful. And by the way, they wanted to renew me and I couldn't do it because I was doing this. And Steve Burke, the head of Comcast, great guy comes into my office. Donald we want to renew you. I said, \"Steve I'm going to run for president. You can't do both.\" OK. It's called equal time laws or whatever it's called but you can't. He said, \"Please, please.\" I said, \"No, I'm going to do this.\" And we chose because I have a big stake in The Apprentice going forward and everything else and we chose Arnold Schwarzenegger. Let's see how he does, right? Let's see. I hope he does well but who knows, right? I know Trump did well. Fourteen seasons! So I had this tremendous show. That was one of the most successful shows on television and really one of the most successful and we came up with the expression, \"You are fired.\" And it's been, it's been great. And you got to know my kids, Ivanka, Don Eric, and a lot of other people and my family, I'm so proud of. But so we do a show. It's greatly successful. I do books, right? I do The Art of the Deal. One of the most successful, probably the most successful, but one of the most successful business books and books of its kind ever written. And I did many other books. Twelve other books, many are bestsellers. And then I built this business that is unbelievable. Some of the greatest assets in the world, Turnberry in Scotland, Doral and Miami. Buildings all over the place. Big chunks of the Bank of America building in San Francisco, built a city practically on the West Side of Manhattan. A big chunk of 12 90 Avenue of the Americas biggest floor plates in New York just above the biggest floor plates. I think they are the biggest floor plates and just built 40 Wall Street, Trump Tower. So many things. And then I listen to this like little nothing say, \"Trump's a con man.\" Isn't it a disgrace? I mean seriously. You know it's -- it's really. It really is. Maybe you will make the libel laws also so we can sue lying politicians you know because -- but, but it's, you know, it's very insulting when you hear it. And thank goodness I have this where I can get off and counteract it because they say things that are so wrong. I don't know what Cruz is saying but these two guys are in big trouble. They're in big trouble. Yeah. It's almost like who cares but they're in big trouble. Rubio's won nothing. He couldn't get elected dog catcher in Florida. They hate him in the state of Florida. No, no, think of it. He's a politician. Chris went over it, never votes, never anything, he couldn't right now if he ran for office in Florida, he wouldn't get elected to any office. They cannot stand him because Florida is like a second home. They cannot stand the guy. And he abandoned them. Think of it. He runs for Senate. He wins. They give him the confidence. He wins. And before he even runs he is looking for another position. And he never goes to vote. And some of the most important bills he's never voting. They hate him in Florida. That's why I'm up 22 points, can you imagine? We have, we have a sitting senator. At least with Cruz, where even that's not so great for him either because he's a sitting senator in Texas. So, but in Florida we have a sitting senator and I'm up by a tremendous amount, every poll, because they can't stand the guy. Now here's the story. He sat and he stood and I thought he was going down and I said, \"Man, I think he's choking.\" I love -- I love -- it's called human whatever. I love watching whatever happens. I said, \"I'm about to witness history. This guy's going down. This guy's going down.\" and I'm looking and I'm getting ready because I'm you know, it's like there's a lot of people. Pretty strong guy. And I'm getting ready to grab him because I thought he was, I thought he was out. And he starts sweating and honestly this is true. I've got a problem. I have never seen a human being sweat like he sweats. So Chris Christie is grilling him so he says it twice. Now he says that the third time I said no that's not good because three times the exact same line, memorized and then a fourth and then a fifth. And I'm looking like, \"Wow!\" but I'm getting ready to grab him because I'm telling you he's going down. I have never -- it looked like he jumped in a swimming pool with his clothing on and then came back. Now for the last debate, I go back and I see him with makeup and it's like he's putting it on with a trowel. OK. And then he got very aggressive right at the beginning. Now I knew they were going to do that. Both of them. They double-teamed me because, and I got great reviews. You know that every single Paul, Drudge, Slate, I think Time magazine, every single poll had me winning that debate which is amazing. Every single vote. Not all of the pundits had me winning but every single poll and many of the pundits but not all of them. Some of them no matter what, if I was Abraham Lincoln debating. He was a very good debater. He'd say, \"It wasn't a great night.\" You know a couple of -- and so it was not a great night. There was a great night but right -- but I was double-teamed by these two. But with Rubio just to finish off with him, so I knew it was gonna be one of these nights, because everybody was saying, \"Oh they've got to do it, they have no choice because they're getting killed.\" We're, we're way ahead, we're way ahead nationally. We're way ahead here. And every place. We got to win. We got to win Arkansas. We got to win Arkansas. We gotta win. Maybe I'll start shopping permanently at Walmart if we win Arkansas. I'll never go anywhere. Now we got to win Arkansas. I love it. I love the people of Arkansas. I know so many people. They're great people. These are great people. But, but just remember this. That's right. Thank you. But just remember these. Politicians are never going to get you to the promised land. They're never ever going to get you to the promised land and things were said in previous speeches and probably by Cruz also. But I didn't get to see Cruz. Which are just false. So many things I've done so well. For instance, they talk Trump University. It's a small deal, very small. But I got sued by a lawyer who says they sue because they want to see if they get some money back. I could have settled this suit numerous times, could settle it now. But I don't like settling suits because when you settle lawsuits everybody says it's a little business story. I have friends, they settle lawsuits and they can't understand why they are always sued. I don't settle lawsuits. We have people at Trump University that wrote most of them, that wrote statements and they wrote the statement where I love the school. I love this for some reason, I never saw this before. We call them report cards. They did like report cards essentially report cards where at the end of the class at the end of the period of time they did study they did a report card on how you like it. Some even did film clips where they actually are at film saying great things. The person that started the suit wrote a great statement saying it was fantastic and did a film clip saying that was fantastic. And they've just asked that she be taken out of the case. She doesn't want to be in the case anymore. And the reason they won is because she's a terrible plaintiff because she said all these great things about Trump University and she's on film saying how great it is. So they put on a motion, which of course, the papers don't write this. They put in a motion saying that, \"Take her. Her name is Tarla or something, take her out of the case.\" The reason they want her out of the cases, she is a horrible, horrible witness. She's got in writing that she loves it. And I could have settled it and when I saw her documentation, I said, why would I give her money? She loved the case and she's on tape. Why would I give her money? Probably should have settled it but I just can't do that. Mentally I can't do it. I'd rather spend a lot more money and fight. Now you got to, you've got to pay. Would have been much easier if I settled, I would have probably been cheaper. But I don't care. It would have been much easier. It would've been cheaper, would have been much easier. But just so you understand. So these people all it is just people put up something and now they get letters. \"Oh, can you get your money back? Oh, we'll get our money back. Yeah. Let's join.\" The attorney general of New York. This is all a civil case by the way, is a simple civil case. The attorney general of New York meets with Barack Obama in Syracuse the following day. He sues me. What they don't say is I believe 15,000 or a lot of money was paid to the attorney general by the law firm in California. They're suing me. See, I'm giving you sort of a life experience cause it's it. Isn't this more interesting than talking about trade? A trade is easy for us. Trade is easy but this is not a life. This is almost like a story on success because this is the way the world works. This is sort of the way the world works. So the attorney general gets a campaign contribution from the law firm, that's suing me. All of a sudden the attorney general his name is Eric Schneiderman, not respected in New York, doing a terrible job, probably is not electable in New York but who knows? And he meets with Obama, gets a campaign contribution, I think. I think it's $15,000 and all of a sudden he meets with Obama in I believe Syracuse and the following day or two he brings a lawsuit against me. Now much of that lawsuit has been won by me. He's appealing it. It's on appeal right now. But much of that case, it's so long time already. But much of that case, we won. It's won. I don't mean we settled that. We've won. Much of that case, they missed the statute, the limitations and most of it is going away but nobody writes that nobody wants to write that. The rest of it we're doing very well. We have a very hostile judge because to be honest with you, the judge should have thrown the case out on summary judgment. But because it was me, and because there's a hostility toward me by the judge, tremendous hostility beyond belief. I believe he happens to be Spanish, which is fine. He's Hispanic, which is fine. And we haven't asked for recusal which may, may do. But we have a judge is very hostile. Should have been thrown out wasn't thrown out. And I say I'd rather go to court because when you go to court and you have witnesses get up there and then they have to say, \"But why did you sign a document saying that you love the school etc., etc.\" Why should you pay money for that? So I just wanted to give you a little bit of the parameters because you keep hearing about, \"Trump University.\" So it's a civil case. It's a sleazebag law firm that does these class action cases. They're very routine and I will win the case in the end. I just didn't want to be forced to settle and I could have settled it before I did this and I knew somebody would try and use it for publicity but I believe I can turn it around just to show you how dishonest these people are. And that's the case. And just to finish if I didn't have a hostile judge in California this case would have ended years ago. It would have ended a long time ago. OK. Are you ready? So, that took place with Rubio. Rubio's going nowhere. I think he's going nowhere. Hasn't won at all. They're fighting. Now, what they want to do is they want to take Trump on individually. They're all fighting. I saw this morning. We should get out. This one should get out, that one should get out, should get out. He is a nice guy, by the way. Even though he's a little tougher than you think, he's another one. He's very nice. \"Oh just so terrible you're fighting. Oh it's so terrible, it's so terrible.\" He's always in the end, you know, close to getting out. You know when you're on those end positions. I won't mention what I told other people. But when you're in the end position that means you're close to it's close to over. But every time these, these two guys were hitting me, he looks like, \"Oh that's so terrible that you guys are fighting.\" \"You know, this, we should have peace.\" That's all good. But the worst ads that would take it against me were taken by . And you know like he's such a nice guy. Any yes, he's fine. But I'm in the -- I'm in New Hampshire which we won, by the way. We won New Hampshire, we won Nevada, we won Nevada, we won South Carolina. It was so beautiful and I'm watching them. I actually tweeted today, \"We won South Carolina, we won South Carolina! What a great memory.\" And now I'm watching Bernie and Hillary fighting in South Carolina. And I have the victory on the Republican side. And you know what I saw, which was amazing? We had the largest turnout in the history of South Carolina. I won by tremendous numbers, right? Landslide, right? Beyond! And don't forget that was supposed to be 100% Ted Cruz. That was going to be his, you couldn't beat him. They're impossible to beat him. Not only did I beat him, we killed him by what was it, like 20 points, some unbelievable amount. I won with every single category. I won with women, with men, with evangelicals, with military, with the vets. We won with rich. We won with less than rich. We won with highly educated. We won with pretty good education and we won with people that didn't do so much with the education. But they're doing well, anyway. I love them. OK. I love them. I love them. They're my people. They're my people. But we won with virtually every category and then we go to Nevada and we win. I mean that was a blowout. We just won with everything. And I felt it because that was a caucus I was a little word with the caucus stuff because caucuses can get a little dishonest. Can I say that word dishonest? And I went to one caucus which is the biggest one in Las Vegas. And I'll tell you there was such love. They went crazy and there were probably 2,000 people in the room and of the 2,000 people a hundred people maybe. I don't even think that we're possibly going to vote for somebody else. Everybody was on our side. And I said there's a good side. I got back to the room. It was long before seven o'clock when the polls actually close over there at seven o'clock and they're already saying, \"This thing's over because they've been all over the state. It was the same way.\" And we ended up getting a tremendous victory by it wasn't even a contest. So. Again with evangelicals, with military, with everybody. So it's been like a great, great experience. And part of it is anger. And part of it is you tired of the politicians. You're tired of guys -- you're tired. You know what, I'm tired. And you're tired of guys like little Rubio, who you know a little mouthpiece goes like a mile a minute. You were tired of these people. They're never going to get anything done. They're never going to get -- Hey by the way, Rubio bought a house for $178,000. He sold the house for $380,000. Probably the only good deal he ever made. To a lobbyist who I think was in front of them or close to in front of them up in the Senate, this was in Florida, wanting something approved. Now that's really dishonest. Rubio stole from the Republican Party. But you know what happened? They said you stole from the party. Says, \"No I didn't.\" \"Yes you did.\" \"You had a driveway built.\" \"No I didn't.\" \"Yes you did.\" \"Oh, OK.\" Well, he reimbursed them, OK. And for some reason he didn't get indicted. Why doesn't he get indicted? I'll guarantee you one thing. Chris Christie would have indicted him so fast. But why doesn't somebody look into his house there? Why is it? How can he make that kind of a profit on a house to a lobbyist? And that's the problem. People are controlled up here by lobbyists. You know that, right? We have the lobbyists and the special interests that have total control over these folks. But not Ben, because Ben is not controlled by them although I don't know where he is getting money from. I don't even care. Ben is such a nice guy. And by the way, what Ted Cruz did to Ben Carson was a disgrace in Iowa. That was a disgrace. He said Ben Carson has left the race because he went to Florida. He was heading out to Florida which is where he lives in all fairness. Ben Carson has left the race and vote for us and at caucus you know you can actually take the people and walk around. I don't like caucus. I like where you walk into a voting booth. You walk, you vote and you leave like what you people are going to do. OK. I don't like this caucus stuff but they said, \"Ben Carson has left the race. Vote for us.\" and they wine and dine him and bring him around. I'll bet you have thousands of votes. And I want to win Iowa in my opinion if that happened. Because these extra votes, these extra votes went to him and you know what? Honestly, if we had a strong Republican Party, they would disqualify him for what he did. Honestly, I mean if I were the head of the Republican Party I wouldn't throw him out. You know, maybe for Canada will throw him out. We'll see about that. But that's a serious problem you know, he's being sued and I didn't sue him. I'm so not litigious. It's amazing. But, but he's being sued now. I heard he's being sued because he was born in Canada, lived there for years. Who knows? I always thought you had to be born here like on this soil right here in Arkansas. So we'll find out what happens. Hey, I hope that's not the reason he has to get out. I hope we beat them. But, but you know what, Ted has that problem. But if I were the head of the Republican Party I would disqualify his Iowa situation where she also did another thing. Did you ever see that voter violation? Did you ever see this? It's like a fraudulent document. Looks like it came out of a government agency so professional says, \"Voter violation.\" And it talks about you're in violation of all these things. Listen to this. Essentially, this isn't exact but close enough. But if you vote for Ted Cruz and bring this in and vote for Ted Cruz, the violations canceled. Now you have people that honestly sort of believe it. I looked at one of them and I said man that comes right out of a government agency. That's a fraud. And I saw lawyers talking about it and some of these crazy talk shows and they said. They said it's a fraud. I mean it's like a fraud. I would have disqualified him from his victory in Iowa because you can't do business like that. You just can't do it. You can't do it. Then you take everybody, move them up a notch. Now I won four in a row instead of three. I like that, OK. And it doesn't matter. I got almost the same number of delegates. I got one last. But doesn't matter. But, but you can't do that stuff. You can't do that stuff. And frankly, but Cruz is smarter than Rubio. Intellectually, he's smarter than Rubio and, but, but both they lie. You know I deal in the real estate business. I deal in a lot of different business. I meet some bad people. I meet much tougher people than a Rubio or Cruz. Much tougher. But I've never met people that could lie like these guys. These guys are world class liars. It's unbelievable. And I was helped in Cruz's case because Rubio looked at him and said, \"You're a liar.\" And he was actually right because he actually did lie about that particular point. But once he said he was a liar, I was able to say he's a liar. You know I've never seen politics. I know politicians very well. I've dealt with them all my life. A lot of them are bad people. You have some good ones but you have a lot of really seedy, horrible people. I've never -- and I've seen some bad stuff. I've never seen a politician call another politician a liar when he called him a liar, I said, \"Great! Now I can call him a liar.\" So, so much lying. But Rubio is probably a worse liar than Cruz. I don't know who to pick. I'll pick at the end of three or four weeks. I'll give you my, I'll give you my pick. Does that sound OK? So, we have an amazing story. I have decided that with my life. If I win, I'm going to do something that's going to be so amazing for our country. We're going to have great trade deals. We have the worst trade deals ever made in history. We have trade deals that are so bad. We have deals period that are so bad. The Iran deal, we give one $150 billion to Iran. They're now spending that money. It's one of the worst deals. Forget about country to country. One of the dumbest deals I've ever seen. But all of our deals are like that. That's a horror deal. That deal -- those, those hostages should have been back four years ago. They should have been back before you started the negotiation. They go in this guy Carry. They go in, they go in. It's, it's horrible. They go in and you say we have to have our hostages back and they'll say no. The Persians, great negotiators. Persians always been great negotiators. They'll say no. And you'll say bye-bye we're leaving. Bye. Enjoy yourself. Now they're sitting at a table. Nobody on the other side of the table and you let them know, \"We're not going to negotiate until the hostages are released.\" and then you double up on the sanctions. You just go ratchet, ratchet, ratchet. Within 24 hours, you'll be called. You've got your hostages back, folks. Then I go a step further and I tell this story about my father because my father did not give me $200 million. Believe me. Oh, I told you, my sister. She calls and I have a great sister, a great brother. They both call that after the debate. Dad, never gave you? Are you kidding? Where's our piece of it, you know?\" It's unbelievable. Took a million dollars borrowed and paid it back and that's now morphed into 200 part of the reason in all fairness to Rubio. He read that in the New York Times. It was such a false piece. The New York Times, it's going out of business. It's the worst newspaper. It is a dead newspaper going out of business. I'll tell you what. Unless somebody buys it like me as a vanity project. All right. It loses a fortune but they are the most dishonest people at the New York Times. They'll write, they will write, they wrote a story about me a couple a few days ago. It was so wrong. They knew it was wrong. I said then pull the story. No we won't do that. Why wouldn't you pull it if you know the story is wrong? Why won't you pull it? And they admit it is wrong. We won't pull it. They are really dishonest, New York Times. I call it the failing New York Times. You know it's very interesting. They bought The Boston Globe. They paid $1.3 billion for the Boston Globe, right -- 1.3 billion. They spent a fortune. Hundreds of millions of dollars on modernizing it, right? At the end of a number of years they just sold it for essentially one dollar. They lost a billion and a half dollars. They have no money. They sell their headquarters, this beautiful -- like the cathedral. I used to go there when they had real people running the paper. It's like a cathedral, old beautiful building on I think West 40, 30, 40, 50, 43rd. Beautiful, beautiful building. They used to call it The Cathedral to Journalism. They sold it to move into an office building. That's a horrible office building, opposite the port authority bus terminal. Horrible. But they sold the cathedral and they sold it for, I believe about $150 million. The guy that bought it, they're friends of mine. They flipped it for $525 million. A short time later, and I say to myself, so why are we listening to their editorials? They tell you what to do. They tell you this and that. They write stories that are inaccurate. So why does anybody even read the New York Times? They lost a billion and a half dollars on a -- on a simple newspaper. They lost hundreds of millions of dollars. They should have never left their Cathedral because now you walk into that place and it's like you're walking into a store. It's like walking down this concrete right here. There's nothing. It's just a very average office building with bars on the front of it. It's terrible. And I'd say, \"Why?\" My friend and the group, they made hundreds of millions of dollars in a short just buying it, keeping it for a little while, selling it and then we're supposed to listen to the New York Times. These people are incompetent and they're bad people. They have a bad agenda. They're really bad people. That's one of the reasons I want to straighten out the libel laws so that we can go after them because they're bad people. These are really bad. So, what we're going to do is we're going to make trade deals that are going to be fantastic. We're going to get our best. You know, we have the greatest negotiators in the world. We have the best. We use political hacks to negotiate with China. With China, we are losing right now $500 billion. With a B, billion dollars a year. OK, that's our trade deficit. We have a trade deficit of China with China -- 500 billion. We have a massive trade deficit with Japan. They bring in millions of cars. You look at those boats in Los Angeles. They bring in millions and millions of cars. It never stops. We send them beef. We send them beef. That's the deal, OK, which is a fraction. And they don't take the beef. You know that, right? You know what happens. Goes back forth, back forth. Finally they take it. They call it aged. It's Kobe beef and they sell it for 10 times more. That's what happened. It's what happens. But we don't get the price. They get the price, OK. But with Japan, same thing. With Mexico, they're killing us at the border. They're killing us with trade. You saw the other day, Carrier just moved to Mexico. Carrier, they now, it's very sad somebody had their cell phone going. They're taking these shots. Everyone's devastated. Fourteen hundred people gone. Ford moved to Mexico, two and a half billion dollar plan. Nobody did anything that was two years ago. Now they're doubling up. They're going to build more there. I would've let them have it so hard, they would never have the guts to build more there. Never have the guts. Nabisco, Nabisco just moved. They're big, they're big plant, where they make Oreos. They moved there. Which we don't eat anymore, right? No more Oreos. That's a good thing. That's a good thing. But Nabisco just moved their plant from Chicago into Mexico. OK, no more. But let me tell you about Carrier as I watch Carrier because it just happened a week ago and I watched these people that were devastated that were there for a long time. Good people, good air conditioners, I buy a lot of Carrier aircon. I'm not buying them anymore by the way. But I buy a lot of Carrier air conditions and I saw this executive up front, \"We're going to close our operations and we're going to move to Mexico.\" Lots of luck folks, right? People are devastated. So I went to the Wharton School of Finance which is considered the best business school, OK and be very smart to get into that school. Very smart. The Rubios of the world cannot get into that school. They don't have the capacity. Actually, Cruz could, in all fairness, Cruz could. I, I don't know that he has the temperament. I think neither has the temperament but academically, certainly. But, I go to Wharton. I'm smart. You're smart, but you don't have to be smart. How do we solve the problem where all these countries are moving into these places and people like yourselves and friends of yourselves and people that I know are losing all their jobs? We're being devastated. So here's what we're doing with as an example, Carrier. I would call Carrier through one of my people, because I don't know, it's not cool if the president calls, right? The president's calling an air conditioning guy. I mean listen, I don't like what you don't. I may make some of those calls. They're going to say it's terribly unpresidential, but I don't care, right? You know. Now they'll say it's un-presidential. They'll say it's un-presidential. When Vicente Fox, the former president of Mexico, when he used the \"F\" bomb I thought it would be a national thing because I know if I used it, it would be the biggest story in the history of the world, right? So, he is and nobody cares. And then he was and he was so angry, you know. Why he was angry? Because they used to getting their way, right? They used to getting their way. \"How dare they do this? How dare they say that? And I won't build that.\" You know, \"What wall? We will not build that. You know, \"What wall?\" See? I've learned. By the way I don't use that word. The words I use are peanuts compared to that word. I couldn't -- I couldn't, I wouldn't be able to get off the airplane. Do you like the plane made in the United States? Boeing: Made in the United States. Speaking of that, Iran just ordered 118 airbus planes. Nothing in the United States. They just ordered a lot of equipment from Italy and all over Europe. They just ordered missiles. I didn't know they could buy missiles with $150 billion. They just ordered missiles from Russia and nothing from the United States. They capture our 10 wonderful sailors. They put guns to their heads. They put them in a begging position. They were scared and frightened and they let them go two days later, because you know what the money was going to pass. If the money was not going to pass, if they already had the money, the billions and billions of dollars, they would have kept them. But they wouldn't have kept them if I won the race. That I can tell you. They would have been out so fast. They would have been out so fast. So, with Carrier, I'll call them up. I say, \"Folks, congratulations on your new plant. I think it's wonderful. I love that you're building in Mexico. It's great. I hate what you did with the 1,400 people and more.\" And this is also United Technologies just to shame them because they laid off additional people where they're going to Mexico. Mexico is becoming the new China. You better be careful folks and their leaders are much smarter than our leaders. And they are ripping us not only at the border, but they're ripping us like crazy with trade. So I'd say to the head of Carrier, \"Congratulations on the new plant.\" But here's the story folks. Every single air conditioner that you make, as it passes the border and we will have a real border, OK. We will have a real border. The illegals will not be able to carry those air conditioners in, OK. Chris we're going to have a real wall. We're going to have a wall. It's going to be a real wall, folks. And by the way, congratulations Mexico. You're paying for the wall. Just so you understand. Congratulations. So, I would say to them, \"Every air conditioner that you make that goes into the United States and over our border, every single one you're going to pay a 35% tax on, OK.\" Now some of the stupid people because I'm a conservative person but I like to say I'm a conservative person with common sense. All right. Some of the stupid people that say, \"Oh he's not a free trader.\" No, no, I'm a smart trader. I'm a fair trader. I'm a free trader. But it's got to be fair when China is making $500 billion on trade deficits. I'm not a free trader, folks because when you try and do business in China, they charge you tax. I have many friends. I can't do business in China. They can't get their product into China. China dumps it over here. You can't get it over there. And when he does get it in it's a big tax, OK. So I'd say to Carrier, \"Congratulations! but you're paying the 35% tax.\" Here's what's going to happen. I do it early before they start building and I like to get them. Here's what's going to happen, \"Mr. President, no you can't do that. That's not free trade. Like all these stupid people, they talk about free trade. We want free trade. Mr. President, that's not free trade.\" I said, \"Here's the story. I'm just telling you, every single unit you make comes over that border, you're paying a 35% tax and that's going to make up for all the jobs we lost and everything else. And I hope it works in your bottom.\" So here's what will happen. If I am one of these characters like a Rubio. Take a look at who's giving him money. Look at the guys giving him money. Take a look at the guys giving Rubio money. Take a look at the guys giving Cruz money. I'm not even blaming him. It's the system. But when those guys need something, it's 100%. Look at the lobbyists. Look at these special interests given these characters money. A hundred percent control over them. They have 100% control. Me, I'm free -- I'm self-funding. I'm not doing the money thing. So I'm putting it, you know. I think somebody said to me, I said the other day \"How much have I got?\" You know, I was always proud of the fact, I think I'm in it for over $25 million already. I didn't have to spend any money. I didn't have to spend any money but within. I'll tell you what. And that's a big thing. I don't think I get credit for that. I'm self-funding my campaign. I'm the only one in either party. I'm self-funding my campaign. I'll go a step further. I think I'm the only one in many, many years. I mean, I don't remember anybody. Maybe Ross Perot many, many years ago but I don't remember anybody's self-funding. They all take money from these people and during the debates you probably saw that somebody would get up make a fool out of himself and they're all standing up clapping like he made a great answer. I'd give a good answer and it was like dead silence in the room. And I had friends in that room and I said, \"Boy those are, that's a rich room.\" Because I know a lot of the guys, lobbyists, special interest and one of them the other night actually is laughing, having a great time, waving at me as a friend of mine and then booing me when I give an answer. He's \"Boo! Boo! Boo!\" and he's like that. They're all playing games, folks OK. In fact, I just spoke to him. It's fun and it's cute. It's fine. It's life. It's the way life is, OK. It's the way life is. But that room, those rooms were packed. They're packed with special interest and they're packed with donors and lobbyists. And those people have totally control over the -- total control over the people I'm running against. So what will happen if you have a President Rubio? Or if you have a guy like you know nasty Ted? Then what's going to happen? Is there going to be called by their lobbyist? Because you know, you have lobbyists, what they specialize in politicians. I mean there's the way it works because I've had many lobbyists and do a great job actually, it's almost guaranteed. If you need something, I say, \"What do you think? You know anybody for Senator Rubio?\" \"Oh yeah. We have this one, this one, that one, they're all good.\" Who's the best?\" \"This one.\" \"Call a man. Tell him what I need.\" Goes in, gets it, sends you a massive bill. Sometimes it's two minutes work. You know, \"Hey, do me a favor or don't do me a favor, just do it.\" I mean it's terrible. That's the way the system works. OK. So if you have Rubio, Cruz and what happens is the lobbyists special interest or donors will call and they'll get 100%. Here's what happens with me. Carrier will call friends of mine. But the friends I won't accept them and I've turned down, by the way, I've turned down tens of millions of dollars. I feel stupid doing it. I must tell you. My whole life, I've been taking money, my whole life. I mean despite listening to the sleazebag, my whole life has been about making money. And I give a lot of money away and all that stuff. But you know, I take money. That's what I'm supposed to do, right? I'm a business person. You're a business person. I also gave to Democrats. I gave to liberals and conservatives are Republicans. I was loved by everybody. And that, I owed it to my family, and myself, to my company. I mean I got along with everybody when I needed something. I mean I just got along with everybody. But what happens is this, when they're called they do what they do when they call me. So here's what happens. They call me, I say no interest. I say I have no interest. Carrier will call me within 48 hours saying, \"Mr. President we're moving back into the United States.\" It's very simple. It's very simple. Within a short period of time they will call and they move back and honestly, look, we're losing so many companies and I want to see free trade. I want to talk about free trade. I love free trade. It's not working folks. We're losing. We're losing everything. We're losing our jobs. We're losing our money. We're losing our base. We're losing everything. We're losing our respect. China, we have rebuilt China. You know what, China, and I love China. They give me tens of millions of dollars for condos. I have the largest bank in the world which is a Chinese bank. That 400 million customers, the largest bank in the world is a tenant of mine in Manhattan. They pay me a lot of rent and they wonder if I like the Chinese. I love the Mexicans, the Mexican people are phenomenal people. I just won in Nevada. I won with the Hispanics. Did you see that? Everyone said 46%. Everybody said, \"Trump won with Hispanics. Oh that can't be right.\" And I said to everybody, \"How many Hispanics do we have here, do we have a -- is a Hispanic.\" You know what in Arkansas, we have about three. That's OK, but they're three and they're right up front and they like Trump, right? But I won with Hispanics. Now, we have to use our head because China is the single greatest theft in the history of the world. We have rebuilt China with the money they've taken out. We have rebuilt China. Not gonna happen anymore folks. Not gonna happen anymore. We're going to have great trade deals. We're going to have great, everything. We're going to be so smart. We're not going to make Sergeant Bergdahl where we get Bergdahl and they get five killers that they've been after for years. Not gonna happen anymore. And five to six people probably six, but five people at least were killed trying to find him. So he's a traitor. We knew he was a traitor because we had a general and a colonel there prior to, and they before we made the deal. So we make a deal where we get a dirty rotten traitor and they get five people that they most coveted for nine years. They've wanted these people. Those people are now back on the battlefield or will soon be back on the battlefield trying to kill us all, OK. Not going to happen anymore. We're not making those deals. We're not making the Iran deals anymore. We're not making. We're going to build up our military. It's totally depleted. Can you imagine General Douglas MacArthur? I thought he was great. General Douglas MacArthur, General George Patton. Can you imagine saying to them we can't beat ISIS? They'd knock him out in 24 hours, I swear. It would be brutal. It would be brutal. And we have great people going to Air Force academy, going to Annapolis, going to West. We have great people, but we don't have a leader. We don't have a leader. So we're going to build up our depleted military. And by the way, we're going to get the things that the generals want. Not the things -- do you notice we order planes that they don't want because it's made by a certain company instead of another? They want another plane. It's better, it's faster, it's cheaper. Not bad quality is right? The planes better, faster, cheaper. And we ordered, we ordered the one they don't want. I see it all the time and we're going to get the right stuff and we're going to make great deals and we're going to bid like crazy. But we're going to bid and we're going to make up, we're going to -- There is so much fraud, waste abuse in our system. I'll give you an example. The drug companies take care of all these guys I'm running with all of them. They give money to them. You wouldn't believe. Do you know a friend of mine, a doctor comes up to me and he says very, very like you can't believe it. \"Donald could you look into this? The United States is the largest drug buyer in the world.\" You know, drugs, good drugs make you better, right? Hopefully make you better. Some probably don't. But drugs that make you better, we don't bid. I said, \"No way. We don't bid.\" Now once he said it, \"I'm smart.\" I go, \"Oh I know what it is. The politicians don't make us. So if we bid, we would save $300 billion a year on drugs for all of the stuff we buy.\" We would save billions, and billions, and billions of dollars. We don't bid. Why don't we bid? Because the drug companies have these guys totally under control. I don't give a damn about the drug companies. I don't give a damn. So the money that we'll save and here's the end result. The end result is the product will be better. Years ago, a certain senator who's actually a very good senator. I won't use his name because I don't like to subdue the people I respect. I want to at least get their approval. But I was called by, I believe the ambassador from Sweden and they were going to spend a billion and a half dollars on renovating the United Nations building. And I had just built a building across the street that was 92 stories, beautiful Trump World Tower. And I did it for like $360 million. And this guy called up and he said, \"Mr. Trump I don't understand.\" You know he was a good man. I think he was the ambassador to Sweden, but whatever. He called up, he said, \"I don't understand. We're going to spend one and a half billion dollars on fixing up the United Nations, not building, fixing. But I read where you spent $360 million to build that massive building right across the street. Could that be possible?\" I said \"Yes.\" He said, \"Why?\" I said, \"Very simple. Corruption and incompetence\" \"OK.\" He said, \"Could I set you up with meetings with the head people at the United Nations?\" Kofi Annan at that time, the head man. I said, \"Yeah, I'll come over.\" I mean because he said, \"What do you think it should cost?\" He sent me the plans. I said, \"No more than $500 million. That's what it should cost to do a complete beautiful with marble floors instead of terrazzo.\" That's what I do. Nobody builds better than me folks, really. Even the builders in New York will tell you, \"Call up Richard left Rick. Call up The Builders.\" They will tell you. Nobody builds better than me. So what happens? They called me and I go to the United Nations and I'm talking to them. And the head guy doesn't know. I said, \"Is it a boiler system or is it New York State?\" \"I don't know.\" I said, \"But aren't you in charge?\" \"Yeah. But I just don't know. I don't know what New York's name is.\" He tells me. I said you got a guy who just doesn't know anything. So anyway, I said, \"Look, I will do it for 500 men. I'll save you a billion dollars. I'll do it.\" And somebody said to me, \"Yeah, but it won't be the same job.\" I said, \"That's right. It'll be much better.\" In other words, in other words, he'll use linoleum, or you'll use terrazzo, and I'll use marble. It will be a better job and you don't have to move. I'll do three floors at a time and nobody's even going to be disturbed and you won't even have to move. And that was it. I never heard from them again. And the numbers came out recently and they're close to $4 billion to renovate some buildings. And I think it's such a shame. I never even heard from them. I was going to save them a billion dollars. But the point of it is this. They said, \"Well it won't be the same.\" Honestly my $500 million renovation of the United Nations would have been a much better job. A much higher end job than their one and a half billion dollars a year and they actually called hearings. I went down to Washington. I testified before a congressional panel. But nothing's done. You know, they're politicians. They're asking, \"Well how come this? How come? Then I said, \"Hey, look you tell me.\" So they had these big hearings that lasted for a long time. The books got closed. Nothing was ever done. But I tell you better. Same thing with the military. I'll get better stuff for less money. And even as an example, they're going to order a new Air Force One, right from Boeing, $3 billion. Now, I don't want to get into it because I'd like to have it. If I win, you know, I'd love to have it and blame Obama. You know, because that plane is old. You know, he played golf the other day in Hawaii. He went out for Christmas to play golf. He was talking about the carbon footprint and then he got into this plane that's very old and we should have a new Air Force One. I mean it's a very old Boeing with the old engine-spewing stuff. But he was talking about \"The carbon footprint and we must stop what's happening and pollution and global warming and all of this, right?\" Then he gets on the plane and he flies to Hawaii to play golf and he flies back and he talks about the carbon footprint. Give me a break, folks. Give me a break. So, so look, we're going to start winning with everything. We're going to knock out Common core. We're going to bring our education love. We're going to repeal and replace the horror that's known as Obamacare. It is a horror. We are going to save and enhance and always protect our Second Amendment which is under siege. We're going to save our borders. Right now this Swiss cheese people just pouring through. We're going to create strong borders. We're going to build a wall. Believe me it's going to be build. You heard -- you heard I think that one of the sessions I had with the press. They said, \"How do you respond to Vicente Fox?\" He was the ex-president. I said, \"I think he's got a filthy mouth to use that word. I think it's a disgrace.\" I'm like the only one that said it. \"But how do you respond? He said that he will never build that wall.\" What did I say? I said, \"The wall just got 10 feet taller.\" Here's the thing. We have a $58 billion trade deficit with Mexico, $58 billion trade deficit. The war is gonna cost $10 billion, maybe 12, depending. Goes higher, higher, higher, it's OK. Nobody's going over the Trump Wall. Let me tell you. Nobody. To go deep and you got to go high. The deep will stop some of those tunnels. Is it amazing how they can't stop a tunnel? I mean it's called like check the area, right? So we are going to do that. But, but it's gonna be there and it's going to work. And you know, I won in New Hampshire and the people in New Hampshire which I love, because they gave me that first great victory. And I love those people and they have a huge heroin problem up there. You wouldn't think of it. You know, you see these beautiful fields and you see the beautiful trees and roadways. It is so beautiful. The biggest thing whenever I went to a meeting was heroin, heroin. Their kids are being addicted to heroin flowing across the southern border and I never made a pledge to them. I said we get it when it first hit. I help your kids trying to get them unaddicted. They are so addicted, they have such a problem up there. You wouldn't think of it from New Hampshire. You could take over for some places, not New Hampshire. These are incredible people. And I made a pledge. We're going to stop that flow from coming in because the easiest way to create to stop the problem is just don't let them have it. Don't let them have it. Once they're addicted it's really tough stuff to get off. But we're going to stop the problem. So, the other day though, I heard our great Vice President Joe Biden apologize. Now here's a guy, uses the \"f\" bomb. He's angry at the United States because he's so arrogant because they've always gotten their way. And that was where that came from. How dare they say that to Mexico. Well, we went all the time against the United States. Why would they say that? That's why essentially, he was saying. And then I see Joe Biden apologizing to Mexico. I'd like to apologize. He was apologizing for me. Do you believe it? They call him the Republican candidates. But hopefully he was apologizing just for me. I love that. You know. Even the pope was very nice. He did a thing right before the election right. In South Carolina. I heard, oh the pope the pope said something I said to my people. \"Wait a minute they're going to vote tomorrow morning. Was it good or was it bad?\" This was like 10 hours before the polls opened, right? In South Carolina and my people said, \"Mr. Trump it was bad?\" I said, \"Oh this could only happen to me.\" The pope, the pope! What did he say? And basically, the Mexicans convinced the pope that Trump was a bad guy because I want to have a strong border. And when the pope figured it out and when we -- you know a lot of people will call in the Vatican, I can tell you because a lot of people agree with me that we have to have strong borders. But by the time he figured out about the crime and everything else, the next day he was great and they really, they were very nice. But I was just saying this could only happen to me, with a pope 10 hours before an election comes out with something. So we're going to make our military strong. We're going to knock the hell out of ISIS, folks. We've got to do it. We're going to -- we're going to knock the hell out of ISIS. Got to do it. We have no choice. We're going to take care of our vets. And here's a story, very simply, we're going to be a great country again. We're going to be the smart country. We're not going to be the dummies that don't know what they're doing. We're not going to be the stupid people that are left out all over the world. We're not going to be the people that are afraid to even talk the word waterboarding. And yet in the Middle East you have people chopping off heads. Can you imagine? Can you imagine what ISIS and the others are saying in the Middle East as they chop off head after head after head of Christian? As they drown people in big steel cages just drop them right in the water or drown and blow them up. They're all dead and then we talk about waterboarding is severe. They are saying to themselves, these are the weakest, the dumbest people. They cannot believe it. And when they asked Ted Cruz the question, remember in the last debate just before the last one, \"What about waterboarding?\" He couldn't. \"Well, I don't want to get involved. That's a tough question.\" Then they said to Trump, \"What do you think about waterboarding? I think it's great. But we have to go stronger.\" I got a standing ovation. I got a standing ovation. And I didn't ask a pollster to go and poll the question. They said it to me again. \"Chop off heads.\" We're going to be very strong folks. We're going to be this smart country again. So look, I want to thank you all. I would love to win Arkansas, special place. Many friends. Many. I don't want your money. I don't need your money. I don't want it. I want you to go out and vote on Tuesday. And just knock them dead and let's go. Let's create a mandate. We are going to make America great again. We're going to win, win, win. Thank you everybody. Thank you. Thank you everybody. I love you."}