{"id":439,"author":"Donald Trump","title":"Speech: Donald Trump in Millington, TN","date":"2016-02-27","link":"https://factba.se/transcript/donald-trump-speech-millington-tn-february-27-2016","paragraphs":["Thank you, Chris. Wow. Thank you. This is one endorsement, really, that I wanted. He's the right guy. Thank you very much, Chris. Appreciated. Folks, I love you. I tell you what, we got to win. You got to get out to vote. I don't want your money. I just want your vote. Just get out. You know, we've been going around long time now.","It started June 16th and it's been incredible. It's been a really incredible experience. And you look at the cover of Time magazine from a couple of weeks ago, you look at just today we're seeing coming up. People are saying this is a movement like they've never seen before in this country. I mean, it's incredible.","Ever, ever, ever. Ever is a long time. And crowds like this, we have them. The people of this country are truly amazing. They're great. And we will in fact make America better. I think better than ever before. That's what we're going to do. So I've been watching and reading and studying and seeing things and it's a nasty business as well, the politics.","I'll tell you what, the lies, the deception, it's -- I used to think real estate in Manhattan was bad. That's peanuts compared to this town. You deal with liars. You deal with major, major sleaze. Do we know what sleaze is? And you know, Little Marco Rubio, this guy that -- he's going around. He's going crazy.","He's No. 2 or 3 in Florida. He's a senator. He's 22 points behind. If he ran in Florida today for an office, he couldn't run for dogcatcher. He wouldn't be elected. He wouldn't be elected. He's unelectable, and we're going to beat him badly in Florida. That's going to be in a couple of weeks. And you know, it goes around and he misconstrues -- his new thing is he's got to be tough now.","You know tough guy, right? This is not a tough person, believe me. I can tell you this, speaking about not tough. That man right there Chris Christie -- I saw it happen right in front of my eyes. I was standing in the middle, which had been from the beginning. That's the one who's in No. 1 position. And Little Marco was right over here and Chris went after him.","And I said, \"Uh-oh.\" Because I never saw a human being sweat like this guy. And I said, \"There's something wrong. What's going on?\" And he was pouring. It was like he just got out of a swimming pool with his suit on. And Chris went after him and he made the Obama statement and you made it once and then he made it twice.","I said, \"That's strange.\" And then it went to third time, a fourth time, and a fifth time. And I was ready to grab him because I thought he was going down. I was ready I was standing here like this. I thought he was going to pass out, and it was a bad performance. And he's a choke artist. And let me just tell you about choke artists.","You know, because you have a lot of athletes here. You have a lot of sports fans. Once a choker, always a choker. Is that true? Once a choker, always a choker. And we can't have chokers. We have too many problems in our country. We have problems like you wouldn't believe. Marco goes out, he buys a house for $179,000. He sells it for $380,000 to a lobbyist.","Terrible. He takes money. And by the way, the lobbyist was, I think, doing business with Florida trying to get legislation passed, which is part of the problem we have. We have people that are in office that have deals with everybody. I'm self-funding my campaign. I'm putting up my own money. Nobody's going to tell us what to do. I'm working for you.","I'm working for you folks, believe me. So, I then look at another thing in Marco, credit cards. They say he stole from the Republican Party in Florida, and they went again and again. He said, \"No, no, no.\" Then they caught him. He said, \"Oh, I made a mistake. I used the wrong credit card,\" and he put the money back.","Now I can tell you one thing. If Chris Christie was your U.S. Attorney then, he gets indicted. Would you say that's right, Chris? He would have been indicted for a lot of different things. But look, we're going to be running against Hillary probably. She's going to get a pass on the e-mails. Can you believe this?","Can you believe it? She's going to get a pass on the e-mails and I will tell you, I will tell you it shouldn't happen. We're getting some good training, you know. I started -- I've been now a politician. I hate to say it but, I guess, that's what I am for about eight months. We've had really great training.","I love the debate stuff. By the way, every single debate, the online polls, Drudge a fantastic guy. Drudge does a poll. Time magazine does a poll. Slate, many of these people do polls. We've won every single poll for every single debate. Can you believe this? Great. And the last debate, I got double-teamed by these two characters.","I'm sitting in the middle. And I saw them shaking hands before the debate. And I knew there was something going on. And then they have a picture of I'm standing there and they're shaking hands behind me, getting ready to go. So we got double-teamed by two crooked senators. You have one who's a liar and then you have the other one who made me a worse liar, that's Rubio.","I will say this Cruz is smarter than Rubio. I will let you know in a few months who's the better liar, OK? I haven't determined but they do lie. But they're politicians, all talk no action. They're never going to get you there, folks. They're never going to get you there. It's not going to happen. So when I came down the escalator at Trump Tower the press, it was -- see all of that back there?","We had so many cameras it was like the Academy Awards. And I came down I said to my wife, \"Come on.\" I took a deep breath. I said, \"We have to do it. We're going to do something that's gonna be great.\" I never knew it was going to happen like this. I never knew this was going to be happening, honestly. I had -- one of the great writers, one of the great, great writers call me up and he said, \"How does it feel?\" I said, \"What?\" He said, \"What you've done has never been done before.\" He said, \"You've totally changed -- you've totally changed politics the way we know it. And it'll be written about -- and it doesn't matter whether you win or lose, it'll be written about so favorably for many, many years forever.\" And I say, \"Let me tell you.\" I say, \"Let me tell you, it does matter whether we win or lose.","That I can tell you. It does matter.\" So I've really enjoyed the process. I love the people. And you know, I've said, \"Make America great again. All these hats, make America great again.\" But the truth is over the last two or three weeks, I've been saying very strongly better than ever before. We can be better than ever before.","The people in this country are great. We're going to have Apple start to make their iPhones and their computers and everything else they make in this country not in China. We're going to bring our jobs back from China. We're going to bring our jobs back from Japan and Vietnam and India and Mexico and we're going to have a strong southern border.","We're going to have a real border. We're going to have a real wall. And who is going to pay for the wall? Who? You better believe it 100%, 100%. Is that amazing? I mean, it's amazing. It's amazing. They will pay. Now you saw Vicente Fox, right? He was the past president of Mexico. Now can you imagine if Trump used that word?","They don't even say anything about it. Joe Biden got up today and he apologized. This guy, the anger of Fox, the anger. Did you see the anger? Now Joe Biden apologized on behalf of the nation. I would like to apologize. Now he uses the F bomb and Biden says nothing. Nobody says anything. It's really disgusting.","And you know why he was angry? He was angry not at the wall just at the fact that we would even be talking to them because they get their way and everything, so does every other country. And he's saying essentially, \"How dare you tell Mexico what to do. We always tell you what to do.\" It's not going to happen that way anymore, folks.","Not gonna happen that way. The anger. And the reporters, one of them standing right back there, they called up and they said, \"Mr. Fox said he's not gonna build the wall and there's no way he's going to build the wall.\" And he used a horrible word when he said he's not going to build the wall. So they said to me, \"Do you have a comment about that?\" And I said, \"Yes.\" \"What is it?\" The wall just got 10 feet taller, true.","True. If he uses the F bomb again, we're going to go 20 feet taller, believe me, believe me. So when I came down and I came down that escalator with Melania, and we just looked and we said, \"It's gonna be -- it's going to be great.\" But I came down and I mentioned illegal immigration, and it was craziness.","You remember, right? It was crazy. The world went crazy. Everything went crazy. I said we either have a country or we don't. We either have borders or we don't. And then it turned out that I was right and everybody started pivoting back. And even a couple of these people that I'm running against -- the other day, I heard Ted Cruz say, \"We are going to have a wall.\" That's the first time I ever heard this.","And Rubio, little Rubio. He says, \"We are going to have a wall.\" They don't have a clue, folks. And you know what? As soon as the lobbyists from Mexico get a hold of them, there's not going to be a wall. Just words. All talk, no action, politicians, believe me. All talk, no action. And in the case of Rubio, very, very weak on illegal immigration.","In the case of Cruz, in all fairness, pretty weak. Not as weak but pretty weak and he was in favor of amnesty and there's nothing you can do about it. We're not going to do amnesty. We're going to have our country back. We're going to take our country back. And people are going to come into our country but they're going to come into our country legally, legally.","So we're going to have a strong border and we're going to stop drugs from coming in because the drugs are pouring through that border. That's like -- it's like water. They're pouring through the border. And you know, I won New Hampshire. And by the way, we just had some big victories, Nevada, right? South Carolina, right?","And they were big. We won every single category in every one of the three states. And I'll tell you what, we won with men, we won with women. We won with geniuses. We won with less than geniuses. We won with every -- we have won -- we won with the evangelicals. I love the evangelicals. I love the evangelicals.","We won with the vets and we won with the military. True, but we did. We won with the highly educated and the less than highly educated. We just won every single category and we won by landslides. You know, the Wall Street Journal did a poll. It was a phony poll but it sure shook us up because it was two days before the election and they came out with a poll.","And in the poll they interviewed people that are, you know, not really representative of who's going to vote. So it was like we were only up by a very little bit. Then when the election took place, we blew them away. It was a total landslide, a total absolute landslide. And by the way, each one got bigger and bigger and bigger.","And in Nevada we were at 46. So somebody said -- now, you got to remember, when you're at 45 and 46, you're running against, you know, five people, right, five. So you have almost half the vote. And then you have these idiots get up and say, \"Well, you know, he's at 45. That means 55% of the people are against him.\" That's not really what it means.","That means if somebody else would drop out, they would accumulate and instead of Trump winning, they'd accumulate and Trump would lose, 55 to 45. What they don't understand is when they drop out I get a lot of those votes but they don't want to say that. They don't want to say it. For instance, when my very dear friend Jeb Bush dropped out, he dropped out.","Now he'll come by, he'll come by and he'll support somebody one of these days. You know, I used to say. What Marco Rubio did to him was very disloyal because he was under Jeb and Jeb gave him some chances, etc. and they said, \"Rubio would never run.\" Nobody thought he was going to run because it would be very disloyal.","He ran. And Jeb would say, \"He is my dear, dear friend. He is my very good friend.\" And Marco would say, \"Jeb is my very good friend.\" They hate each other, folks. They hate each other. And yet you'll probably see Jeb support him at some point because we know one thing. He's not supporting Trump. Do we agree?","He's not -- oh, boy. They did a cover story in The Wall Street Journal about that. They said -- and it was very interesting. They said Jeb Bush had everything planned. He was automatic. It was going to happen. Everything was perfect. He had the money, he had the pedigree, he had every single thing. There were just three words that he never thought about Donald John Trump.","All right. That's OK. That's -- I think he's a very nice person. We wish him well, right? Let's go. Good luck, Jeb. We love you, Jeb. We love you. So we're getting close. We have a very big lead. Super Tuesday is coming up, a lot of states. We're going to win. Are we going to win? Are we going to win? Got to win Tennessee.","Got to win Tennessee. I'll tell you, we got to win Tennessee. If we don't win Tennessee, I'll still love you. I don't know, you know. We will. Hey, let me tell you something. The second place person doesn't come here with crowds like this in all fairness. You don't have crowds -- Chris was telling me, the second -- when you look -- we looked down the plane and we said, \"Wow, look at this.\" And we just had a similar thing in Arkansas.","It was incredible. Big, big hangar. We had a very similar thing but you look out and you see this crowd. This is a massive crowd, all standing up, no seats. Sorry about that, folks. Too many people. But the second place person doesn't have crowds like this. So hopefully we're going to win Tennessee. We're going to win everything.","I think we're even -- I think we're even really have a great chance to win Texas. I mean, I know we're going to win Florida. In a couple of weeks, we go to Florida. Remember, Tuesday is your day. Tuesday, Tuesday. But I think in a couple of weeks -- you know, we go to Florida in a couple of weeks and we're going to win Florida big league because we're, I think, 22 points up. And that'll be great and hopefully we can run the table.","I mean, just run the table. And a lot of people are saying -- they're saying, you know, these pundits. These guys get paid. They don't know what the hell they're talking about. First of all, they said in June, \"He will never run.\" I ran. Then they said, \"He will never sign for me.\" That's where you sign your life away.","I signed. They said, \"Wow.\" Then they said, \"He will never put in his financials.\" And by the way, by the way, the financials are all about like what you're worth. Tax returns don't mean anything about worth, just so you understand. And you never give a tax return when you're being audited. Do you know I get audited every single year.","You tell me that's fair. I have friends of mine -- I have friends of mine that are rich people. They've never been audited. I say, \"How often do you get audited?\" Never, never. They don't even know what the hell I'm talking about. I'm audited every year but I file my financials and they were phenomenal. And believe me, if they weren't phenomenal, you would've heard about it from the press.","You would've heard about it. That would have been a big, big, beautiful, fat story. And built a great company, some of the great assets of the world, very little debt, tremendous cash flow. And I say that only because that's the kind of thinking we need for our country. We owe $19 trillion. We've got to make great deals.","We lose with China in trade deficit $500 billion a year, $500 billion. We lose a massive amount of money and deficit with Japan. With Mexico -- we lose with everybody, just in case you had any -- we lose all the time. We don't win. Honestly, we don't win anymore. We don't win in any level with trade, with military.","We can't beat ISIS. Can you imagine telling General George Patton we can't beat ISIS? Now General Patton would be here right now and General Douglas MacArthur they are right now spinning in their grave. They don't get it. They don't get it. This is a thing that had not come out in a week. They don't get it. We're going to knock the hell out of ISIS.","OK. We're going to knock the hell out of them. So when I started it was about very much about the border because I knew what was going on. I have friends. And when I won New Hampshire -- and by the way, I made a pledge to the people of New Hampshire. They are incredible people and they're the one that started this thing because they gave me a tremendous victory, far greater than it was supposed to be. I mean, it was a landslide.","But I talked to the people and it was so strange because it's a beautiful state, the most beautiful trees and pastures and roadways going through these incredible settings and yet their big problem was always heroin. I said, \"Heroin? That just doesn't fit.\" You know, I can tell you places that it does fit but I don't want to insult anybody, right?","It didn't fit with New Hampshire. And I said to the people, I said, \"We're going to solve the problem, the drugs that pour in through the southern border.\" The heroin is coming through, and they have a bigger problem for whatever reason than most. We're going to stop that. We're going to work on getting the addicted to be unaddicted as quickly as possible.","But I made a pledge we're going to stop that heroin from pouring in to this country, to in this country, to New Hampshire. We have an obligation to do it, and that's what we're going to do. So when I first started I talked about the border. I talked about trade. I'm really good at trade and I'm really good at jobs, by the way.","I will be the greatest jobs president that God ever created, that I could tell you. The greatest. That was sort of easy. When they do the polls, they do polls. And in the polls with the economy, I'm always double and triple and quadruple what others are with jobs, with the economy, with ISIS, by the way, with the military, with the border.","I mean, I'm not talking about like where somebody is at 20 and I'm at 22. I'm talking where they're at nine and I'm at 70. That's a big difference. With leadership, way above everybody else, way, way, way above. So every single category, and I think a lot of it morphed in to the fact that I'm the strongest on the border.","Sheriff Joe Arpaio from Arizona. No games, right. You know what, they call him no-games Joe. He doesn't play games. Do we agree? This is -- right? Sheriff Joe, he endorsed me last week. Now when you know that Sheriff Joe is endorsing you. You are the toughest on the border. There is no doubt about that. So when it began it was about the borders, it was about trade, and all of that.","And then we had the attack, and it was a horrible attack, all over the world in Paris where 130 people were killed. Many, many people dying right now in the hospital, horribly hurt. And by the way, speaking of that, I will protect your Second Amendment 100%. OK? 100% And then we had the attack in California.","The two radicalized people, they get married, they go in and they shoot their co-workers and supposedly their friends. Something going wrong here folks. There's some anger out there. We got to solve the problem. But I guarantee you one thing, these Syrians are not coming into our country until we find out what the hell is going on. Not coming in. And the ones that are here, I'm sorry.","And I've been saying it for three months. They got to go. They got to go. They got to go. You know, you have that migration -- and we all have a heart and we're going to build safe zones in Syria. We're not paying for it, by the way. Don't worry about it. We'll get the Gulf states -- the Gulf states are making and have made so much money.","They have so much money. They're not taking any of the migration, any of the migrants. They're not taking any. They're not spending any money, and I have many friends in the Gulf states but they're going to have to shell out. They will spend. We will supervise, get it done but we will get the money from the Gulf states.","Did you know that Saudi Arabia before the oil came down, now they're making half, was making $1 billion. Think of this, $1 billion a day and we protect them. We get practically nothing. Why? South Korea makes a fortune. I order thousands a year -- thousands of television sets are all made in South -- Samsung, LG. They're all made in South Korea.","I order thousands of sets. South Korea, we have 28,000 soldiers on the line. You have the maniac in North Korea. You have the maniac -- get him out of here. Get him out. Get him out. Get him out. Unbelievable, right? It's one wise guy. And tomorrow the press will say, \"Oh, there was a protest.\" Unbelievable.","You know, we've got 15,000 thousand people here today. So we have 15,000 people. We have one wise guy and that'll be the headline, protest. But I love the protesters because the only way the dishonest media, the most dishonest people in the world, I think may be more dishonest than the politicians. Hard to believe.","The only way they turn their cameras if there's trouble, if there is a protest. Do you notice all those cameras were turned, so I'm very happy. In fact, some time I'm just bringing my own protesters, the only way I get them to turn. So, anyways, it's really unbelievable. Yeah, get him out. That's fine. That's fine.","Don't hurt him. Don't hurt him. Don't hurt him. So when it began, it began there and then all of a sudden everybody liked me from the standpoint of the military because I get it. I understand it. And believe me, we're going to be strong because our military is being decimated. It's being decimated. Now we are going to be so strong at the military level we're going to build it bigger, better, stronger than ever and nobody is going to mess with us, nobody, nobody.","And by the way, just as a little adjunct, which is very important because, you know, we talk about the American dream and without education there is no real good chance at the American dream. We're getting rid of Common Core. It's gone. Getting rid of Common Core. We're getting rid of Obamacare, by the way.","Getting rid of it. We're getting rid of it. It's gone. It's gone. It's a disaster. It's a disgrace. It's a disaster. That's going to be replaced with lots of options that are going to be excellent at a lot less expensive and better. It's called better and less expensive. So we're getting rid of Obamacare.","But what happened is people came up and they all of a sudden started saying Trump is the right one for basically it's security, and every poll showed it. Where I did the worst in the polls, I hate to say, do you know where I did the worst? My personality. Who cares, right? Who cares? And I'll tell you what, I'm a nicer person -- I really think I am. I'm a nicer person than the person -- the people that I'm on the dais with.","I really believe that. I want to take care of people. You know we're all in this together. I'm a messenger, that's all I am. We're all in this together. There is a great anger out there. And people say, Oh, Trump has captured the anger of the world and the anger -- it is actually a world anger. It's not even -- it's this country because this country has made so many bad decisions it overflows outside of this country.","But there is a real anger and they always write about the anger. I don't think about it. I don't think like I captured anything. I just say what I say. And I say what I say because it's common sense. It's common sense. And at the debate they asked me because a certain politician made a speech and she talked about Nikki Haley.","She talked about Trump -- essentially, she was saying Trump is angry. And I'm not an angry person, believe me. I'm not. And you're not angry people. But during the debate, the one before last, they said Nikki Haley said you're essentially an angry person. And I was supposed to say, \"Oh, no I'm not. I love the way things are going.","The country's going to hell. The Iran deal is just wonderful. We give him $150 billion for nothing, right. We're all thrilled. Sergeant Bergdahl, a wonderful deal. We get a dirty rotten traitor. They get five killers that they wanted forever, right. Five people died going after Sergeant Bergdahl. And then we're supposed to say we're thrilled with the way our country is run, right.","Our country is in trouble. Our jobs are a disaster. Our real number is 25%, not 5%. When you look for a job and can't get it, you quit. You look, you go home, you stay home with your wife or your husband. You no longer look. And you know what, statistically they think you're employed. We have a real problem.","Our jobs have been taken from us. They've been taken by China and so many other countries. They've been taken by everybody. Last week you read about it, Carrier. They make air conditioners. I buy air conditioners from Carrier, no longer. They're moving to Mexico like so many other people. So here's the story folks.","And I tell this story. I want to be smart. We have to be smart. I like free trade but it has to be fair trade. It has to be smart trade. But the only thing you can do is one thing. I saw the pictures probably a cell phone camera where this executive is saying, \"Sorry, folks your jobs are gone.\" 100 -- I mean, a lot of jobs.","What was it? 1,400 jobs, I think. 1,400 jobs. And by the way, United Technologies also is closing up some stuff and moving to Mexico. So here's what we do. I'm a free trader. You know, I get a lot of heat. He's not conservative. He is not -- folks, I call myself commonsense conservative, you know, commonsense conservative because, you know, a conservative would never do what I'm going to say.","And they'll say he cannot be a conservative if he does what he says OK. People are taking our jobs. They're moving out of our country. Pfizer is leaving going to Ireland. Many many -- we have corporate inversion. We have billions of dollars and trillions of dollars outside. We can't get it back because the politicians can't. He can't move.","The Democrats want it back. The Republicans want it back. They can't make a deal because they have no leadership, right. So here's what we're going to do with Carrier and here's what we're going to do with a lot of other countries. We have to do it. There's -- look I went to the great Wharton School of Finance.","I was very good. I was a good student and all that stuff. But you don't have to go to Wharton. You don't have to go to high school to understand this. So we're leaving Carrier. We're leaving and we're going to Mexico, right? How is that good for us? They're going to make our conditioners and sell them to our country.","How is it good? So here's what happens. Very simple. We have the greatest business people in the world in our country. I'll use that but this just too simple I want to do it myself even though it's very unpresidential. I think it's very unpresidential for me to be calling the head of Carrier about air conditioners.","Do you agree? But I'm going to do it anyway. OK. I'll be on unpresidential and I'm going to say, \"Look, here's the story. I hope you enjoy your new factory in Mexico. I hope it looks beautiful and you're very happy. But just so you understand, if you move to Mexico, you leave the United States, you let down those 1,400 great people, who I saw in that video, and they are devastated, we are going to charge you a 35% tax for every air conditioner you sell that comes across the border.\" It's the only solution.","It's -- you know a lot of people say I'm giving a big tax cut and all of that but that's not going to stop these companies from moving. There's more to it than that. So I'm going to say that and here's what's going to happen. I am not taking money from the lobbyists and from the special interest and the donors.","Everybody else, if you put like little Rubio up there and he's president, they'll say, \"Mr. President.\" In between his sweating. Hey, can you imagine Rubio negotiating with Putin and he walks into the room and he's pouring sweat and Putin looks at him and says, \"Man, what's wrong with that guy.\" So I will say this.","Look, within 24 hours. Carrier will call me and they'll say, Mr. President, we're moving back to the United States. That's what's going to happen, very simple. Now the so-called brilliant conservatives, as they say, don't like that because they don't like to charge tax, and I don't either. Ideally, I don't either.","But it's not fair anymore, folks. We can't continue to be the stupid people. We cannot continue to be the stupid people. I have a friend who's a great great manufacturer. He deals with China. He said it's a virtual impossibility. Number one, they sell everything over here. No tax, they just pour it in, make a fortune.","We have rebuilt China, the bridges, the tunnels, the airports. You've never seen anything like it. We have rebuilt China and yet our country is falling apart. Our infrastructure is falling apart, our schools -- we don't have money for schools, for roadways, for airports. Our airports are like third world.","You come in, you leave some of these airports in Europe, you leave some of these airports like Qatar and Dubai and you see these airports are the most incredible things you've ever seen. I'm there a lot. And then we come in and we land at LaGuardia with our potholes all over the place. We're like a third-world country.","We can't be the stupid people anymore. We can't be led by this stupid people anymore, folks. We can't. We can't. So Carrier is going to move back forward. Ford, it's the same thing. Two years ago they announced $2.5 billion. I would tell them there's just no way we don't want their cars. Just keep your cars.","We don't want -- I want those plants to be built in Michigan or here or wherever the hell they want to build them as long as it's in the United States. We want people to build in this country. We want jobs in this country. I don't know if you saw the last jobs report but one thing that took place, it's an amazing phenomena and it has to do with Obamacare is tremendous numbers of part-time jobs because they don't want to be in the Obamacare reign.","They don't want to be within the grasp of Obamacare. So these companies, I mean, people that have worked for the same company for years all of a sudden are being made part time. Not gonna happen, folks. It's not going to happen. The other thing is the quality of the job is the lowest we've ever had. The jobs are bad because the good jobs are all going to different countries.","We have the bad jobs and they say it. They say they're bad, bad jobs. They're low-level jobs, no good. Our country is in trouble. We're going to fix our country. We're going to fix it like you've never seen, and it's going to go fast. So here's what we have to do, look, here's what we have to do, on Tuesday, you have a big day.","You have to get up and you know I joke and I do joke and I'll say. I don't care how you're feeling. I don't care if your doctor says you're not going to make it till 7 o'clock. I won't say your wife is leaving you but perhaps she might. She's fallen in love with another man. I don't give a damn. You get up, you go to the polls, and you vote.","Now I really mean it, so important. And you know, we have a real opportunity because we really do have the potential to have this country be greater than ever before. But if we have Hillary, I was just watching Hillary on television. It's a nightmare. And I'll tell you I'll tell you what was very interesting.","In South Carolina, we had like 400-some-odd thousand people vote in the last cycle four years ago and fewer before that. And we were almost at 800,000 people a few weeks ago when I won. The number of -- and they were talking about it. The number of voters has, like, doubled -- more than doubled. And I'm taking from the Democrats, I'm taking from the independents.","We're taking -- because the Republicans do have a structural disadvantage. It's harder to win as a Republican, and I hate to tell you that. We have states that if I get the nomination, we're going to win Michigan, we're going to win Pennsylvania, we're going to win Ohio, we're going to win Florida. We're going to win Florida.","We have a chance to win New York. I mean, if we win New York, it's over. And no Republican can even think about it. So it's so important but what they're doing and what they were just talking about, they're saying the Republicans have gone way, way, way up. I mean, like from 400-and-some-odd thousand to 800-and-some-odd thousand.","And that's just from the last cycle and it's gone -- and by the way, it was just even -- it was just going nowhere. But even the ratings we got for that last debate like almost 16 million people and the last time they had about 3 million people. Now you know that I did that nobody else did it. I did it, right.","I just wonder what would those ratings be on the debates if I wasn't there. I will tell you but it would not be a pretty picture. So the last cycle, I think they had about 3 million or 3.5 million, and we had almost 16 million people. So it's an amazing thing that's happening. We have got a different Republican Party.","We've got a Republican Party but a lot of outsiders are coming in because they like what I say. And we're going to get we're going to get a lot of people coming in and we don't care where they're coming from. We have to win, right? We're going to get independents. We're going to get Democrats. Remember the term Reagan Democrats?","Remember all the Democrats that Reagan got? And you know what, if you don't get them, if you don't get them, you're really not going to win, folks. One of the other things that happened in Nevada, they did the polls. And who won with Hispanics? Donald Trump won with Hispanics. OK? Big league, big league.","We're going to do great with Hispanics and we're going to do great with African-Americans. The polls are showing great. One of the polls the Republicans get 5% African-American, which is terrible. One of the polls showed 25%, 25%. And one of the announcers said, \"Well, I'll tell you what if Donald Trump gets 25% of the African-American vote, this election is over.","The Republicans win immediately.\" It's true. It's true. It's true. So look, we are involved together, together, with something that's very special. Again, they say it never happened before. I mean, I watched just a little while ago. They say what's happening now has never ever happened before in the history of our nation.","I can't even believe that. I don't even understand why that is necessarily -- but they're talking about we've changed the whole playing field of politics and it will never be the same. And I love that and I love that. So here's the story. Tuesday. Go out and vote. Big big big strong vote. I promise you that you're going to look back on this night and you're going to say this was a very important night.","Everybody in this huge hangar. This was a very important evening in your life because things started to happen. We're going to start winning again we're going to win so much. We are going to win in the military. We're going to win with health care. We're going to win at the borders. We're going to win with education.","We're going to win with everything. We're going to win with everything. And we are going to make America great again. I love you. I love you. I love you. Thank you very much. Thank you, everybody. Thank you. Thank you."],"text":" Thank you, Chris. Wow. Thank you. This is one endorsement, really, that I wanted. He's the right guy. Thank you very much, Chris. Appreciated. Folks, I love you. I tell you what, we got to win. You got to get out to vote. I don't want your money. I just want your vote. Just get out. You know, we've been going around long time now. It started June 16th and it's been incredible. It's been a really incredible experience. And you look at the cover of Time magazine from a couple of weeks ago, you look at just today we're seeing coming up. People are saying this is a movement like they've never seen before in this country. I mean, it's incredible. Ever, ever, ever. Ever is a long time. And crowds like this, we have them. The people of this country are truly amazing. They're great. And we will in fact make America better. I think better than ever before. That's what we're going to do. So I've been watching and reading and studying and seeing things and it's a nasty business as well, the politics. I'll tell you what, the lies, the deception, it's -- I used to think real estate in Manhattan was bad. That's peanuts compared to this town. You deal with liars. You deal with major, major sleaze. Do we know what sleaze is? And you know, Little Marco Rubio, this guy that -- he's going around. He's going crazy. He's No. 2 or 3 in Florida. He's a senator. He's 22 points behind. If he ran in Florida today for an office, he couldn't run for dogcatcher. He wouldn't be elected. He wouldn't be elected. He's unelectable, and we're going to beat him badly in Florida. That's going to be in a couple of weeks. And you know, it goes around and he misconstrues -- his new thing is he's got to be tough now. You know tough guy, right? This is not a tough person, believe me. I can tell you this, speaking about not tough. That man right there Chris Christie -- I saw it happen right in front of my eyes. I was standing in the middle, which had been from the beginning. That's the one who's in No. 1 position. And Little Marco was right over here and Chris went after him. And I said, \"Uh-oh.\" Because I never saw a human being sweat like this guy. And I said, \"There's something wrong. What's going on?\" And he was pouring. It was like he just got out of a swimming pool with his suit on. And Chris went after him and he made the Obama statement and you made it once and then he made it twice. I said, \"That's strange.\" And then it went to third time, a fourth time, and a fifth time. And I was ready to grab him because I thought he was going down. I was ready I was standing here like this. I thought he was going to pass out, and it was a bad performance. And he's a choke artist. And let me just tell you about choke artists. You know, because you have a lot of athletes here. You have a lot of sports fans. Once a choker, always a choker. Is that true? Once a choker, always a choker. And we can't have chokers. We have too many problems in our country. We have problems like you wouldn't believe. Marco goes out, he buys a house for $179,000. He sells it for $380,000 to a lobbyist. Terrible. He takes money. And by the way, the lobbyist was, I think, doing business with Florida trying to get legislation passed, which is part of the problem we have. We have people that are in office that have deals with everybody. I'm self-funding my campaign. I'm putting up my own money. Nobody's going to tell us what to do. I'm working for you. I'm working for you folks, believe me. So, I then look at another thing in Marco, credit cards. They say he stole from the Republican Party in Florida, and they went again and again. He said, \"No, no, no.\" Then they caught him. He said, \"Oh, I made a mistake. I used the wrong credit card,\" and he put the money back. Now I can tell you one thing. If Chris Christie was your U.S. Attorney then, he gets indicted. Would you say that's right, Chris? He would have been indicted for a lot of different things. But look, we're going to be running against Hillary probably. She's going to get a pass on the e-mails. Can you believe this? Can you believe it? She's going to get a pass on the e-mails and I will tell you, I will tell you it shouldn't happen. We're getting some good training, you know. I started -- I've been now a politician. I hate to say it but, I guess, that's what I am for about eight months. We've had really great training. I love the debate stuff. By the way, every single debate, the online polls, Drudge a fantastic guy. Drudge does a poll. Time magazine does a poll. Slate, many of these people do polls. We've won every single poll for every single debate. Can you believe this? Great. And the last debate, I got double-teamed by these two characters. I'm sitting in the middle. And I saw them shaking hands before the debate. And I knew there was something going on. And then they have a picture of I'm standing there and they're shaking hands behind me, getting ready to go. So we got double-teamed by two crooked senators. You have one who's a liar and then you have the other one who made me a worse liar, that's Rubio. I will say this Cruz is smarter than Rubio. I will let you know in a few months who's the better liar, OK? I haven't determined but they do lie. But they're politicians, all talk no action. They're never going to get you there, folks. They're never going to get you there. It's not going to happen. So when I came down the escalator at Trump Tower the press, it was -- see all of that back there? We had so many cameras it was like the Academy Awards. And I came down I said to my wife, \"Come on.\" I took a deep breath. I said, \"We have to do it. We're going to do something that's gonna be great.\" I never knew it was going to happen like this. I never knew this was going to be happening, honestly. I had -- one of the great writers, one of the great, great writers call me up and he said, \"How does it feel?\" I said, \"What?\" He said, \"What you've done has never been done before.\" He said, \"You've totally changed -- you've totally changed politics the way we know it. And it'll be written about -- and it doesn't matter whether you win or lose, it'll be written about so favorably for many, many years forever.\" And I say, \"Let me tell you.\" I say, \"Let me tell you, it does matter whether we win or lose. That I can tell you. It does matter.\" So I've really enjoyed the process. I love the people. And you know, I've said, \"Make America great again. All these hats, make America great again.\" But the truth is over the last two or three weeks, I've been saying very strongly better than ever before. We can be better than ever before. The people in this country are great. We're going to have Apple start to make their iPhones and their computers and everything else they make in this country not in China. We're going to bring our jobs back from China. We're going to bring our jobs back from Japan and Vietnam and India and Mexico and we're going to have a strong southern border. We're going to have a real border. We're going to have a real wall. And who is going to pay for the wall? Who? You better believe it 100%, 100%. Is that amazing? I mean, it's amazing. It's amazing. They will pay. Now you saw Vicente Fox, right? He was the past president of Mexico. Now can you imagine if Trump used that word? They don't even say anything about it. Joe Biden got up today and he apologized. This guy, the anger of Fox, the anger. Did you see the anger? Now Joe Biden apologized on behalf of the nation. I would like to apologize. Now he uses the F bomb and Biden says nothing. Nobody says anything. It's really disgusting. And you know why he was angry? He was angry not at the wall just at the fact that we would even be talking to them because they get their way and everything, so does every other country. And he's saying essentially, \"How dare you tell Mexico what to do. We always tell you what to do.\" It's not going to happen that way anymore, folks. Not gonna happen that way. The anger. And the reporters, one of them standing right back there, they called up and they said, \"Mr. Fox said he's not gonna build the wall and there's no way he's going to build the wall.\" And he used a horrible word when he said he's not going to build the wall. So they said to me, \"Do you have a comment about that?\" And I said, \"Yes.\" \"What is it?\" The wall just got 10 feet taller, true. True. If he uses the F bomb again, we're going to go 20 feet taller, believe me, believe me. So when I came down and I came down that escalator with Melania, and we just looked and we said, \"It's gonna be -- it's going to be great.\" But I came down and I mentioned illegal immigration, and it was craziness. You remember, right? It was crazy. The world went crazy. Everything went crazy. I said we either have a country or we don't. We either have borders or we don't. And then it turned out that I was right and everybody started pivoting back. And even a couple of these people that I'm running against -- the other day, I heard Ted Cruz say, \"We are going to have a wall.\" That's the first time I ever heard this. And Rubio, little Rubio. He says, \"We are going to have a wall.\" They don't have a clue, folks. And you know what? As soon as the lobbyists from Mexico get a hold of them, there's not going to be a wall. Just words. All talk, no action, politicians, believe me. All talk, no action. And in the case of Rubio, very, very weak on illegal immigration. In the case of Cruz, in all fairness, pretty weak. Not as weak but pretty weak and he was in favor of amnesty and there's nothing you can do about it. We're not going to do amnesty. We're going to have our country back. We're going to take our country back. And people are going to come into our country but they're going to come into our country legally, legally. So we're going to have a strong border and we're going to stop drugs from coming in because the drugs are pouring through that border. That's like -- it's like water. They're pouring through the border. And you know, I won New Hampshire. And by the way, we just had some big victories, Nevada, right? South Carolina, right? And they were big. We won every single category in every one of the three states. And I'll tell you what, we won with men, we won with women. We won with geniuses. We won with less than geniuses. We won with every -- we have won -- we won with the evangelicals. I love the evangelicals. I love the evangelicals. We won with the vets and we won with the military. True, but we did. We won with the highly educated and the less than highly educated. We just won every single category and we won by landslides. You know, the Wall Street Journal did a poll. It was a phony poll but it sure shook us up because it was two days before the election and they came out with a poll. And in the poll they interviewed people that are, you know, not really representative of who's going to vote. So it was like we were only up by a very little bit. Then when the election took place, we blew them away. It was a total landslide, a total absolute landslide. And by the way, each one got bigger and bigger and bigger. And in Nevada we were at 46. So somebody said -- now, you got to remember, when you're at 45 and 46, you're running against, you know, five people, right, five. So you have almost half the vote. And then you have these idiots get up and say, \"Well, you know, he's at 45. That means 55% of the people are against him.\" That's not really what it means. That means if somebody else would drop out, they would accumulate and instead of Trump winning, they'd accumulate and Trump would lose, 55 to 45. What they don't understand is when they drop out I get a lot of those votes but they don't want to say that. They don't want to say it. For instance, when my very dear friend Jeb Bush dropped out, he dropped out. Now he'll come by, he'll come by and he'll support somebody one of these days. You know, I used to say. What Marco Rubio did to him was very disloyal because he was under Jeb and Jeb gave him some chances, etc. and they said, \"Rubio would never run.\" Nobody thought he was going to run because it would be very disloyal. He ran. And Jeb would say, \"He is my dear, dear friend. He is my very good friend.\" And Marco would say, \"Jeb is my very good friend.\" They hate each other, folks. They hate each other. And yet you'll probably see Jeb support him at some point because we know one thing. He's not supporting Trump. Do we agree? He's not -- oh, boy. They did a cover story in The Wall Street Journal about that. They said -- and it was very interesting. They said Jeb Bush had everything planned. He was automatic. It was going to happen. Everything was perfect. He had the money, he had the pedigree, he had every single thing. There were just three words that he never thought about Donald John Trump. All right. That's OK. That's -- I think he's a very nice person. We wish him well, right? Let's go. Good luck, Jeb. We love you, Jeb. We love you. So we're getting close. We have a very big lead. Super Tuesday is coming up, a lot of states. We're going to win. Are we going to win? Are we going to win? Got to win Tennessee. Got to win Tennessee. I'll tell you, we got to win Tennessee. If we don't win Tennessee, I'll still love you. I don't know, you know. We will. Hey, let me tell you something. The second place person doesn't come here with crowds like this in all fairness. You don't have crowds -- Chris was telling me, the second -- when you look -- we looked down the plane and we said, \"Wow, look at this.\" And we just had a similar thing in Arkansas. It was incredible. Big, big hangar. We had a very similar thing but you look out and you see this crowd. This is a massive crowd, all standing up, no seats. Sorry about that, folks. Too many people. But the second place person doesn't have crowds like this. So hopefully we're going to win Tennessee. We're going to win everything. I think we're even -- I think we're even really have a great chance to win Texas. I mean, I know we're going to win Florida. In a couple of weeks, we go to Florida. Remember, Tuesday is your day. Tuesday, Tuesday. But I think in a couple of weeks -- you know, we go to Florida in a couple of weeks and we're going to win Florida big league because we're, I think, 22 points up. And that'll be great and hopefully we can run the table. I mean, just run the table. And a lot of people are saying -- they're saying, you know, these pundits. These guys get paid. They don't know what the hell they're talking about. First of all, they said in June, \"He will never run.\" I ran. Then they said, \"He will never sign for me.\" That's where you sign your life away. I signed. They said, \"Wow.\" Then they said, \"He will never put in his financials.\" And by the way, by the way, the financials are all about like what you're worth. Tax returns don't mean anything about worth, just so you understand. And you never give a tax return when you're being audited. Do you know I get audited every single year. You tell me that's fair. I have friends of mine -- I have friends of mine that are rich people. They've never been audited. I say, \"How often do you get audited?\" Never, never. They don't even know what the hell I'm talking about. I'm audited every year but I file my financials and they were phenomenal. And believe me, if they weren't phenomenal, you would've heard about it from the press. You would've heard about it. That would have been a big, big, beautiful, fat story. And built a great company, some of the great assets of the world, very little debt, tremendous cash flow. And I say that only because that's the kind of thinking we need for our country. We owe $19 trillion. We've got to make great deals. We lose with China in trade deficit $500 billion a year, $500 billion. We lose a massive amount of money and deficit with Japan. With Mexico -- we lose with everybody, just in case you had any -- we lose all the time. We don't win. Honestly, we don't win anymore. We don't win in any level with trade, with military. We can't beat ISIS. Can you imagine telling General George Patton we can't beat ISIS? Now General Patton would be here right now and General Douglas MacArthur they are right now spinning in their grave. They don't get it. They don't get it. This is a thing that had not come out in a week. They don't get it. We're going to knock the hell out of ISIS. OK. We're going to knock the hell out of them. So when I started it was about very much about the border because I knew what was going on. I have friends. And when I won New Hampshire -- and by the way, I made a pledge to the people of New Hampshire. They are incredible people and they're the one that started this thing because they gave me a tremendous victory, far greater than it was supposed to be. I mean, it was a landslide. But I talked to the people and it was so strange because it's a beautiful state, the most beautiful trees and pastures and roadways going through these incredible settings and yet their big problem was always heroin. I said, \"Heroin? That just doesn't fit.\" You know, I can tell you places that it does fit but I don't want to insult anybody, right? It didn't fit with New Hampshire. And I said to the people, I said, \"We're going to solve the problem, the drugs that pour in through the southern border.\" The heroin is coming through, and they have a bigger problem for whatever reason than most. We're going to stop that. We're going to work on getting the addicted to be unaddicted as quickly as possible. But I made a pledge we're going to stop that heroin from pouring in to this country, to in this country, to New Hampshire. We have an obligation to do it, and that's what we're going to do. So when I first started I talked about the border. I talked about trade. I'm really good at trade and I'm really good at jobs, by the way. I will be the greatest jobs president that God ever created, that I could tell you. The greatest. That was sort of easy. When they do the polls, they do polls. And in the polls with the economy, I'm always double and triple and quadruple what others are with jobs, with the economy, with ISIS, by the way, with the military, with the border. I mean, I'm not talking about like where somebody is at 20 and I'm at 22. I'm talking where they're at nine and I'm at 70. That's a big difference. With leadership, way above everybody else, way, way, way above. So every single category, and I think a lot of it morphed in to the fact that I'm the strongest on the border. Sheriff Joe Arpaio from Arizona. No games, right. You know what, they call him no-games Joe. He doesn't play games. Do we agree? This is -- right? Sheriff Joe, he endorsed me last week. Now when you know that Sheriff Joe is endorsing you. You are the toughest on the border. There is no doubt about that. So when it began it was about the borders, it was about trade, and all of that. And then we had the attack, and it was a horrible attack, all over the world in Paris where 130 people were killed. Many, many people dying right now in the hospital, horribly hurt. And by the way, speaking of that, I will protect your Second Amendment 100%. OK? 100% And then we had the attack in California. The two radicalized people, they get married, they go in and they shoot their co-workers and supposedly their friends. Something going wrong here folks. There's some anger out there. We got to solve the problem. But I guarantee you one thing, these Syrians are not coming into our country until we find out what the hell is going on. Not coming in. And the ones that are here, I'm sorry. And I've been saying it for three months. They got to go. They got to go. They got to go. You know, you have that migration -- and we all have a heart and we're going to build safe zones in Syria. We're not paying for it, by the way. Don't worry about it. We'll get the Gulf states -- the Gulf states are making and have made so much money. They have so much money. They're not taking any of the migration, any of the migrants. They're not taking any. They're not spending any money, and I have many friends in the Gulf states but they're going to have to shell out. They will spend. We will supervise, get it done but we will get the money from the Gulf states. Did you know that Saudi Arabia before the oil came down, now they're making half, was making $1 billion. Think of this, $1 billion a day and we protect them. We get practically nothing. Why? South Korea makes a fortune. I order thousands a year -- thousands of television sets are all made in South -- Samsung, LG. They're all made in South Korea. I order thousands of sets. South Korea, we have 28,000 soldiers on the line. You have the maniac in North Korea. You have the maniac -- get him out of here. Get him out. Get him out. Get him out. Unbelievable, right? It's one wise guy. And tomorrow the press will say, \"Oh, there was a protest.\" Unbelievable. You know, we've got 15,000 thousand people here today. So we have 15,000 people. We have one wise guy and that'll be the headline, protest. But I love the protesters because the only way the dishonest media, the most dishonest people in the world, I think may be more dishonest than the politicians. Hard to believe. The only way they turn their cameras if there's trouble, if there is a protest. Do you notice all those cameras were turned, so I'm very happy. In fact, some time I'm just bringing my own protesters, the only way I get them to turn. So, anyways, it's really unbelievable. Yeah, get him out. That's fine. That's fine. Don't hurt him. Don't hurt him. Don't hurt him. So when it began, it began there and then all of a sudden everybody liked me from the standpoint of the military because I get it. I understand it. And believe me, we're going to be strong because our military is being decimated. It's being decimated. Now we are going to be so strong at the military level we're going to build it bigger, better, stronger than ever and nobody is going to mess with us, nobody, nobody. And by the way, just as a little adjunct, which is very important because, you know, we talk about the American dream and without education there is no real good chance at the American dream. We're getting rid of Common Core. It's gone. Getting rid of Common Core. We're getting rid of Obamacare, by the way. Getting rid of it. We're getting rid of it. It's gone. It's gone. It's a disaster. It's a disgrace. It's a disaster. That's going to be replaced with lots of options that are going to be excellent at a lot less expensive and better. It's called better and less expensive. So we're getting rid of Obamacare. But what happened is people came up and they all of a sudden started saying Trump is the right one for basically it's security, and every poll showed it. Where I did the worst in the polls, I hate to say, do you know where I did the worst? My personality. Who cares, right? Who cares? And I'll tell you what, I'm a nicer person -- I really think I am. I'm a nicer person than the person -- the people that I'm on the dais with. I really believe that. I want to take care of people. You know we're all in this together. I'm a messenger, that's all I am. We're all in this together. There is a great anger out there. And people say, Oh, Trump has captured the anger of the world and the anger -- it is actually a world anger. It's not even -- it's this country because this country has made so many bad decisions it overflows outside of this country. But there is a real anger and they always write about the anger. I don't think about it. I don't think like I captured anything. I just say what I say. And I say what I say because it's common sense. It's common sense. And at the debate they asked me because a certain politician made a speech and she talked about Nikki Haley. She talked about Trump -- essentially, she was saying Trump is angry. And I'm not an angry person, believe me. I'm not. And you're not angry people. But during the debate, the one before last, they said Nikki Haley said you're essentially an angry person. And I was supposed to say, \"Oh, no I'm not. I love the way things are going. The country's going to hell. The Iran deal is just wonderful. We give him $150 billion for nothing, right. We're all thrilled. Sergeant Bergdahl, a wonderful deal. We get a dirty rotten traitor. They get five killers that they wanted forever, right. Five people died going after Sergeant Bergdahl. And then we're supposed to say we're thrilled with the way our country is run, right. Our country is in trouble. Our jobs are a disaster. Our real number is 25%, not 5%. When you look for a job and can't get it, you quit. You look, you go home, you stay home with your wife or your husband. You no longer look. And you know what, statistically they think you're employed. We have a real problem. Our jobs have been taken from us. They've been taken by China and so many other countries. They've been taken by everybody. Last week you read about it, Carrier. They make air conditioners. I buy air conditioners from Carrier, no longer. They're moving to Mexico like so many other people. So here's the story folks. And I tell this story. I want to be smart. We have to be smart. I like free trade but it has to be fair trade. It has to be smart trade. But the only thing you can do is one thing. I saw the pictures probably a cell phone camera where this executive is saying, \"Sorry, folks your jobs are gone.\" 100 -- I mean, a lot of jobs. What was it? 1,400 jobs, I think. 1,400 jobs. And by the way, United Technologies also is closing up some stuff and moving to Mexico. So here's what we do. I'm a free trader. You know, I get a lot of heat. He's not conservative. He is not -- folks, I call myself commonsense conservative, you know, commonsense conservative because, you know, a conservative would never do what I'm going to say. And they'll say he cannot be a conservative if he does what he says OK. People are taking our jobs. They're moving out of our country. Pfizer is leaving going to Ireland. Many many -- we have corporate inversion. We have billions of dollars and trillions of dollars outside. We can't get it back because the politicians can't. He can't move. The Democrats want it back. The Republicans want it back. They can't make a deal because they have no leadership, right. So here's what we're going to do with Carrier and here's what we're going to do with a lot of other countries. We have to do it. There's -- look I went to the great Wharton School of Finance. I was very good. I was a good student and all that stuff. But you don't have to go to Wharton. You don't have to go to high school to understand this. So we're leaving Carrier. We're leaving and we're going to Mexico, right? How is that good for us? They're going to make our conditioners and sell them to our country. How is it good? So here's what happens. Very simple. We have the greatest business people in the world in our country. I'll use that but this just too simple I want to do it myself even though it's very unpresidential. I think it's very unpresidential for me to be calling the head of Carrier about air conditioners. Do you agree? But I'm going to do it anyway. OK. I'll be on unpresidential and I'm going to say, \"Look, here's the story. I hope you enjoy your new factory in Mexico. I hope it looks beautiful and you're very happy. But just so you understand, if you move to Mexico, you leave the United States, you let down those 1,400 great people, who I saw in that video, and they are devastated, we are going to charge you a 35% tax for every air conditioner you sell that comes across the border.\" It's the only solution. It's -- you know a lot of people say I'm giving a big tax cut and all of that but that's not going to stop these companies from moving. There's more to it than that. So I'm going to say that and here's what's going to happen. I am not taking money from the lobbyists and from the special interest and the donors. Everybody else, if you put like little Rubio up there and he's president, they'll say, \"Mr. President.\" In between his sweating. Hey, can you imagine Rubio negotiating with Putin and he walks into the room and he's pouring sweat and Putin looks at him and says, \"Man, what's wrong with that guy.\" So I will say this. Look, within 24 hours. Carrier will call me and they'll say, Mr. President, we're moving back to the United States. That's what's going to happen, very simple. Now the so-called brilliant conservatives, as they say, don't like that because they don't like to charge tax, and I don't either. Ideally, I don't either. But it's not fair anymore, folks. We can't continue to be the stupid people. We cannot continue to be the stupid people. I have a friend who's a great great manufacturer. He deals with China. He said it's a virtual impossibility. Number one, they sell everything over here. No tax, they just pour it in, make a fortune. We have rebuilt China, the bridges, the tunnels, the airports. You've never seen anything like it. We have rebuilt China and yet our country is falling apart. Our infrastructure is falling apart, our schools -- we don't have money for schools, for roadways, for airports. Our airports are like third world. You come in, you leave some of these airports in Europe, you leave some of these airports like Qatar and Dubai and you see these airports are the most incredible things you've ever seen. I'm there a lot. And then we come in and we land at LaGuardia with our potholes all over the place. We're like a third-world country. We can't be the stupid people anymore. We can't be led by this stupid people anymore, folks. We can't. We can't. So Carrier is going to move back forward. Ford, it's the same thing. Two years ago they announced $2.5 billion. I would tell them there's just no way we don't want their cars. Just keep your cars. We don't want -- I want those plants to be built in Michigan or here or wherever the hell they want to build them as long as it's in the United States. We want people to build in this country. We want jobs in this country. I don't know if you saw the last jobs report but one thing that took place, it's an amazing phenomena and it has to do with Obamacare is tremendous numbers of part-time jobs because they don't want to be in the Obamacare reign. They don't want to be within the grasp of Obamacare. So these companies, I mean, people that have worked for the same company for years all of a sudden are being made part time. Not gonna happen, folks. It's not going to happen. The other thing is the quality of the job is the lowest we've ever had. The jobs are bad because the good jobs are all going to different countries. We have the bad jobs and they say it. They say they're bad, bad jobs. They're low-level jobs, no good. Our country is in trouble. We're going to fix our country. We're going to fix it like you've never seen, and it's going to go fast. So here's what we have to do, look, here's what we have to do, on Tuesday, you have a big day. You have to get up and you know I joke and I do joke and I'll say. I don't care how you're feeling. I don't care if your doctor says you're not going to make it till 7 o'clock. I won't say your wife is leaving you but perhaps she might. She's fallen in love with another man. I don't give a damn. You get up, you go to the polls, and you vote. Now I really mean it, so important. And you know, we have a real opportunity because we really do have the potential to have this country be greater than ever before. But if we have Hillary, I was just watching Hillary on television. It's a nightmare. And I'll tell you I'll tell you what was very interesting. In South Carolina, we had like 400-some-odd thousand people vote in the last cycle four years ago and fewer before that. And we were almost at 800,000 people a few weeks ago when I won. The number of -- and they were talking about it. The number of voters has, like, doubled -- more than doubled. And I'm taking from the Democrats, I'm taking from the independents. We're taking -- because the Republicans do have a structural disadvantage. It's harder to win as a Republican, and I hate to tell you that. We have states that if I get the nomination, we're going to win Michigan, we're going to win Pennsylvania, we're going to win Ohio, we're going to win Florida. We're going to win Florida. We have a chance to win New York. I mean, if we win New York, it's over. And no Republican can even think about it. So it's so important but what they're doing and what they were just talking about, they're saying the Republicans have gone way, way, way up. I mean, like from 400-and-some-odd thousand to 800-and-some-odd thousand. And that's just from the last cycle and it's gone -- and by the way, it was just even -- it was just going nowhere. But even the ratings we got for that last debate like almost 16 million people and the last time they had about 3 million people. Now you know that I did that nobody else did it. I did it, right. I just wonder what would those ratings be on the debates if I wasn't there. I will tell you but it would not be a pretty picture. So the last cycle, I think they had about 3 million or 3.5 million, and we had almost 16 million people. So it's an amazing thing that's happening. We have got a different Republican Party. We've got a Republican Party but a lot of outsiders are coming in because they like what I say. And we're going to get we're going to get a lot of people coming in and we don't care where they're coming from. We have to win, right? We're going to get independents. We're going to get Democrats. Remember the term Reagan Democrats? Remember all the Democrats that Reagan got? And you know what, if you don't get them, if you don't get them, you're really not going to win, folks. One of the other things that happened in Nevada, they did the polls. And who won with Hispanics? Donald Trump won with Hispanics. OK? Big league, big league. We're going to do great with Hispanics and we're going to do great with African-Americans. The polls are showing great. One of the polls the Republicans get 5% African-American, which is terrible. One of the polls showed 25%, 25%. And one of the announcers said, \"Well, I'll tell you what if Donald Trump gets 25% of the African-American vote, this election is over. The Republicans win immediately.\" It's true. It's true. It's true. So look, we are involved together, together, with something that's very special. Again, they say it never happened before. I mean, I watched just a little while ago. They say what's happening now has never ever happened before in the history of our nation. I can't even believe that. I don't even understand why that is necessarily -- but they're talking about we've changed the whole playing field of politics and it will never be the same. And I love that and I love that. So here's the story. Tuesday. Go out and vote. Big big big strong vote. I promise you that you're going to look back on this night and you're going to say this was a very important night. Everybody in this huge hangar. This was a very important evening in your life because things started to happen. We're going to start winning again we're going to win so much. We are going to win in the military. We're going to win with health care. We're going to win at the borders. We're going to win with education. We're going to win with everything. We're going to win with everything. And we are going to make America great again. I love you. I love you. I love you. Thank you very much. Thank you, everybody. Thank you. Thank you."}