{"id":440,"author":"Donald Trump","title":"Speech: Donald Trump Delivers a Campaign Speech in Valdosta, GA","date":"2016-02-26","link":"https://factba.se/transcript/donald-trump-speech-valdosta-ga-february-26-2016","paragraphs":["You people are amazing. So here's the story. Here's the story. I love you. I love you. I love Georgia, frankly. Georgia. Georgia. So here's the story. We have 7,500 people in the room. Outside, we have 12,000 people. And we set up speakers. Would anybody like to give some of the people outside your position?","Would? Please, raise your hand. We'll get you out of here fast, right? OK. I'm only kidding. So we had a lot of good news today. CNN. CNN just came out with a poll -- just came out. Trump, 49%. Little lightweight, Marco Rubio, 16%. Lying Ted Cruz, 15%. Good guy, Ben Carson, 10%. And Kasich at six. So we're 49%. Can you believe it? And we got the endorsement yesterday of Senator Jeff Sessions, who's an incredible guy.","And we have Sarah Palin, and we -- we have so many incredible people. We have -- I'll tell you, Jerry Falwell Junior. You know, we're winning at every level with evangelicals. Jerry Falwell Junior did -- was unbelievable, and maybe that's one of the reasons that we've had such help. But the evangelicals, the Tea Party people.","We're winning with old, we're winning with young. We're winning with highly educated. We're -- well, right? We're winning with the little bit less than highly educated, which is OK. I love you. And we're winning with the veterans. I love the veterans. We're winning with the military. In other words, we're winning with everybody.","So I just want to thank everybody. It's been so much fun. Who would have known this was going to happen? So I have a special treat. I love NASCAR. Do we love NASCAR? I love it. So we had an endorsement a little while ago. And you know, my son, Don, is very, very friendly with the folks over at NASCAR, and in particular, Brian France.","And how good is Brian France? Is this guy like a winner? And you know, I've grown up -- and George Steinbrenner of the Yankees, he was a great friend of mine, and so many of the owners. And honestly, Brian France, there's nobody like this man. There's nobody like him. The job he's done. And the f -- and the family is so incredible.","So some of the NASCAR folks came over here today because guess what? They are endorsing Donald Trump. Can you believe this? Can you believe this? You know, I'll tell you what, if the people that like and watch NASCAR vote for Donald Trump, they can cancel the election right now. Nobody can win. Nobody. Nobody can win.","So what I want to do, I'll bring them up individually, but these are incredible. First of all, the owner, the whole deal, the big guy, Brian France. Brian, come on up here. Come on up. He's getting pretty dapper, you know. Used to be one on the beaches of Daytona. Look at him. Brian, we love. Do you want to say a few words, Brian, before we ?","All right. So we have some of the great drivers -- one of the great drivers o -- of the world in history, the great, the legendary, Bill Elliott. Come on, Bill. We love Bill.","Do these guys have guts? I could not press it, I'm telling you. You know, I want to go about 60. That's enough, right, for most of us. So we have Ryan Newman -- great Ryan. Come on up here, Ryan. We have David -- do you know who going to say? David Lee Ragan. David, come in. Come in. And then because of genes, he was really helped a lot.","You know, Bill and his incredible wife had a son. And the son -- you got it. And the son -- I don't know. Are you going to be upset if he turns out greater than you, Bill, or you going to be happy? He's going to be thrilled. That's a good father. That's a good father. I know a lot of fathers, they have a son that become successful, they're not happy.","That's a great father. Most fathers are that way. Chase Elliott, the hottest young driver in the world. Say something. Say something.","Thank you, fellas. That's cute. They just said keep that war going. We're going to keep the war going, believe me. Believe me. So it's been an amazing period of time. And you know, I just have to thank NASCAR so much because that's something that to do is just incredible. These are incredible people, incredible athletes.","Brian's an incredible guy who I've known for so long, and the job he's done is -- is legendary. So I just -- I just could not be happier that they were here. I just want to discuss a few other things. Tomorrow's a really big day. We have to get out and vote, you know. You know, I don't want your money because I'm self-funding, right?","I'm self-funding. I don't even want Brian's money. Brian's good for some money, but I don't want Brian's money. What I want is I want everybody. We've -- I guess I just heard, we have 13 -- 14,000 people outside. They hear me very well. We have a good mic system. But I just want you folks to go out and vote.","We have the head of Time, one of the top writers of Time Magazine here. He did a story, three -- four weeks ago talking about a movement, and I said, \"What are you talking about? You're going to do another story? We're going to -- \" Where is he by the way? Where's David? Where the hell is David? He did such an amazing story and he's talking about a movement.","This is in fact a movement. This is not like me. This isn't about me. It's about you, it's about all of -- I'm just the messenger. And -- I'm just the messenger, folks. And there's not -- there's never been. You know, they've said -- I've gotten calls from a lot of the biggest writers, the media is back there, a lot of media, but they're very dishonest people.","But some are good and I've -- they're terrible. They are so terrible. They are terrible. But you know, no, 20% of them are good, 80% are bad, 40% are disgusting. But you know, the end result, it doesn't make any difference. What we have going is so special, it's incredible. It's incredible. So the big thing -- and I'm going to -- well, I will tell you one more time before we finish, which will be in a little while, we'll talk about a few things like the wall.","We'll talk about like not getting ripped off at trade, like rebuilding our military, like taking care of our vets. But I just want to say, so you know, I'm self-funding that means that nobody's going to say, \"Please, don't. I gave you a contribution. You've got to help me with the pharmaceutical industry or you have to help me with something.\" No -- no, there's not going to be any of that.","Do you know that in bidding, that when -- we're the largest purchaser of drugs in the world, right? In the world, by far. So I mean, drugs like to make you better, right? And do you know that in bidding, we don't bid? It's like if you go out to buy -- to get some drugs at your local pharmacy, the government is paying a similar amount of money, that we would save billions and billions of dollars.","Now, the problem is that all of these guys that I'm running against, they're all taken care of by the pharmaceutical industry. They're taking care of by all of the industries. And when it comes time to bid, they say, \"No -- no, you can't have them bid. They gave me a million dollars and they gave me five million dollars.\" It's a bad system.","And we're going to change the system, we're going to clean it up. We're going to clean it up. You know, we could save as much as $300 billion if we went out and bid, 300 billion. That gets to be big money, right? That gets to be big money. The numbers of a fraud, waste, abuse in this system are incredible.","We're going to take care of Social Security, we're going to cut in terms of -- not cut what you're getting, we're going to cut all of the waste, fraud, abuse, and we're going to save you Social Security without cuts. Just mark my words. And we're going to have something that's going to be so exciting. And look, I -- I deal with these people, and now I've dealt with politicians all my life.","Somebody said, \"Donald isn't been political.\" I've gotten zone changes. I've been all over the world. We're doing over a 114 projects now all over the world -- all over. And I've dealt with politicians. I dealt with politicians worldwide. And I want to tell you, they're never going to get you to the promised land, folks.","They're never going to do it. And you know, I saw this -- like -- like this little Marco Rubio, this -- this guy. I call him lightweight. I call him lightweight Marco. No, I see him -- I'm on the stage. You saw Chris Christie endorse me the other day, right? Great guy, tough guy. And a few weeks ago, we're at one of the many debates.","These debates, they're -- they're just brutal. They're coming out of my ears. Who wants to do anymore debates? It's enough. And we have another one coming up I think on Thursday. The last one, I was double teamed and I won every single poll had me winning. Can you believe it? And these two guys, I see them backstage, they're talking, \"You know, you do this.","I'll do that. You do this. Don't cut me off.\" And then they're high fiving. And they're actually -- there's one picture where I'm standing here in the middle. By the way, I've been in the middle from the beginning. Brian would like that. I've been in the middle from the beginning, from virtually the time I announced.","The middle means like that's the one that's winning. And I've been in the middle right from the beginning, and that's great. But I see these two guys as a picture. What do they do? Newspapers, big picture. I'm standing here like this. There's a little bit of a break, and they're both behind me shaking hands like isn't everything wonderful?","So every single online poll -- Drudge who's an incredible guy by the way, incredible. Drudge, Time, Slate, every -- everybody, every one of them, every single event, I've been number one in this whole thing with the crazy debating. And -- and the reason is I've never done this before, you know I'm not a politician.","These guys, all they do is talk. It's all talk, no action. They debate. They talk. Nothing gets done. They then go to get campaign contributions. \"Yup, I promise I'll do this. Will you give me a contribution?\" That's what they do. But I am so convinced that our country can be greater than ever before. I am so convinced.","That's why I'm doing this. Greater than ever before. But this guy, I watched him, and he's standing there. Think about this negotiating with the Chinese. I do a lot of business with the Chinese. I've made some great deals. I have the Bank of America building because of the Chinese, big chunk of it. I have 1290 Avenue of the Americas, that's Sixth Avenue in New York, the largest floor -- just about the largest floor plates, this massive building -- Chinese.","I deal -- I have the largest bank in the world, the Chinese banks has 400 million customers, largest in the world. They're a tenant of mine in one of my buildings in Manhattan. I sell tens of millions of condos. Dealing with the Chinese is fine, but their leaders are too smart for our leaders. They're killing us, folks.","And we can't let it happen anymore. Carl Icahn is one of the great business people, you know Carl, and so many other business people. I have the greatest negotiators in the world. We use political hacks to negotiate these massive trade deals, bigger than any deal. Even Brian would say these deals are big, OK? Bigger than any deal.","We lose every year with China $500 billion. Think of it. $500 billion. And this has been going on forever. We always lose. We're going to start winning. We're going to win. We're not going to lose. Why are we losing? We get these political guys, they're in there because they gave campaign contributions or whatever or they raised money.","I have a good friend of mine, Mel, here. But I won't tell you his last name. But he does very well in this world. He raises a lot of money for politicians. He said to me before, \"Can I raise money for you?\" I said, \"I don't want any money.\" You know how much money I turned down? I would have made Jeb Bush's 148 million, which was so far the biggest.","I would have made that fund looked like peanuts. I could had -- I turned down money after money. And you know, it's not my life. It's not my life. My whole life has been money. I want money. I want money. Greed -- I was greedy -- greedy. I want more money, more money. Now, they come up. \"Donald, I'd like to give you $10 million for your campaign.\" I go, \"I don't want it.\" It's hard, because my whole life -- so I take money -- take money.","Now, I'm going to be greedy for the United States. I'm going to take and take and take. We're going to take -- take -- take -- take. We're going to become rich again and then we're going to become great again. A wonderful woman came up to me at one of the events. She said, \"Mr. Trump, I love you.","I'm going to vote for you. But please, don't say you're going to make us rich again. That doesn't sound good.\" I said, \"It sounds good to me.\" We can't be great unless we're going to make ourselves rich again. We have to make ourselves rich. We're losing all of our jobs to China, to Japan. The cars coming in from -- by the millions they come in. I was in Los Angeles.","I saw the largest ships you've ever seen in your life with cars. It looks like a NASCAR track. They're coming off that thing so fast. I'm not sure that Chase could drive the car as fast as these guys drive off the boats. I don't even know how they do it. But I'll tell you what, they come off like just -- you never saw anything like it. You know what we do? We get nothing.","We do nothing. We give them beef. We give them beef. This is the trade. It's a tiny fraction. You talk about a trade imbalance, a tiny fraction. And you know what they do with the beef? They don't want it. They send the boats back. You know that, right? They don't even take it. And then we go again and they send it back again.","The third or fourth time, they take it. And by that time, it's all rotted. And you know what they do with it? They sell it as Kobe beef and they charge you 10 times more, right? You know that. It's terrible. But no, they -- they literally -- that the imbalance that we have -- now Mexico. Everybody talks about the wall.","Everybody. The wall's going to be built, folks. The wall's going to be built. We're going to have a strong border. We're going to have a strong border. And by the way -- by the way, who is going to pay for the wall? 100% -- a 100%. So Vicente Fox was on television the other day throwing out the f bomb. Can you imagine if I did it? I would be so gone.","I wouldn't be up here tonight if I did that. So he say, \"There is no way we're going to pay for the, you know what, wall.\" And I watch this guy and I watch the anger, and you know why he's angry? Not because of the wall, because nobody's ever told them no. Nobody ever tells them no. He can't believe that a guy named Trump -- he even got the Pope after me, right, the Pope.","The Pope was after me. Listen to this. I'm in South Carolina. I love South Carolina. And by the way, I love Nevada. I love South Carolina. And do I love New Hampshire? New Hampshire got it started. And by -- and I promise the people of New Hampshire that we're going to stop the heroin from flowing in. Can you believe it? They have such a problem.","We're going to stop it. We're going to stop it at the border. It's coming in from the water. We're going to stop it. So here's the story. So the Pope -- we're ready to vote in South Carolina. And I'm doing great. I'm up, and the polls are showing, everything's going to be wonderful. And my people come, \"Mr. Trump, could we speak to you?","What? \"The Pope.\" I say, \"The Pope.\" That's big league. Let's face it. Is that bigger than Brian France? I'm not sure. I don't know. I don't know. The Pope -- the pope is big league. They said, \"Mr. Trump, the Pope just made a big statement about you.\" Now, this is like eight hours before the election.","I say -- took a deep breath. \"Is it good or is it bad?\" They said, \"Mr. Trump, it's really bad.\" I said, \"This can only happen to me.\" The Pope is hitting me just before the election in South Carolina. I said,\" What is it?\" \"He didn't like the idea that you're building a wall and that you're going to wall off the United States from Mexico.\" I said, \"Yeah, but he doesn't understand, tremendous criminal elements are coming in, tremendous drugs are pouring in. People are coming into the country illegally.\" He doesn't understand that we have to explain it to the Pope.","He's not hearing that side of it. They said, \"No, it's very serious.\" So the Pope came out with a nasty statement. Here's the good news, he corrected the statement the following day, just in time -- just in time -- just in time. That was a close one. That was a close one. Now I like the Pope again. OK? But with this guy Fox, I watch the anger in his face, and he was really angry at the fact that somebody who -- how dare you tell Mexico, because they have gotten their way -- and I love Mexico.","I love the Mexican people. I respect the Mexican leaders. The problem is the Chinese leaders, the Mexico leaders, the Japanese leaders, all of them, they're too smart for our leaders. They're killing us. They devalue their currency. Hey, I know the game better than anybody. Do I know the game? That new TPP pact, you know, Trans-Pacific Partnership.","We're making it with 12 different -- it is so bad. You know, the biggest thing they have is devaluation. It's not even covered in the agreement. Virtually, not covered. That's how they beat us. They don't make a great product, they make a good product. It's fine. A friend of mine, I tell this story all the time, he's an excavator.","He buys Caterpillar. That's what he buys. He buys Cat -- and for years, for his whole life, he's bought Caterpillar. He sees me fairly recently and he's depressed. I said, \"What happened? Is your wife leaving you finally?\" She's want to leave him for years, I probably . Am I going to be in trouble with him when he hears this?","Hopefully, she's not watching because she would know exactly who I'm talking about. But that's OK, it's got to end. This relationship is one of the truly worst, really. It's maybe the worst relationship I've ever seen. OK. I hate to say it. They don't believe in that stuff, but I'm doing him a big favor, OK? I'm doing them both a big favor.","OK. So what happens -- what happens is he's depressed. And I say, \"So what's the problem?\" He said, \"I just ordered a tremendous amount of Komatsu equipment from Japan.\" I said, \"Is it good?\" \"Yeah, it's good.\" \"Is it as good as Caterpillar?\" \"No, but it's good. It's very good.\" I said, \"Why?\" He said, \"They have so devalued the yen that I owe it to my family, I owe it to my company, I owe it to my employees.","I have to do what's right for my company.\" And he bought a tremendous amount of Komatsu tractors and excavators, and I could see he was very upset. And now you take a look at Caterpillar. Take a look at their stock. See what's going on. A lot of bad things are going on. These companies and these countries, they're devaluing and they're devaluing like grand chess masters.","China is the best of all. China is killing us, folks. China has -- I -- I say it. It's the single greatest robbery what China has done to the United States. I love you too, darling. It's the single greatest robbery what they've done to the United States. In the history of the world, there's never been a robbery like this.","We have rebuilt China. We have rebuilt China because we don't have the right people negotiating for us, and we have the best people in the world. We have the best business people in the world. We don't have the right people negotiating. And it's going to end, folks. It's going to end. It's going to end fast.","And then I hear, you know, I'm -- I used like to say I'm a commonsense conservative. I'm actually very conservative when it comes to the military, it comes to the wall. We're going to get rid of Obamacare very, very much, right? Thank you. We're going to get rid of Common Core. Our education is going to be local -- local.","And I've seen it, this -- this Common Core is a disaster. Do you know, in the world -- 30 countries in the world, we're number 30th, we're last. We're last on education. We're number one per pupil and cost, and number two doesn't even exist because we spend so much more than number two, you might as well forget number two.","You have Denmark, Sweden, China, Norway. United States is number 30. And yet we're number one in cost. You know, it's very interesting, my campaign. Somebody wrote an article, one of these people back there. One of these of many. Boy, that's a lot of cameras. You know -- do you know the biggest problem with my speeches?","They're always live. I got like all these cameras. That's why I can never make the same stump speech. All these other guys, they go and they read the same speech, right? Ladies and gentlemen, thank you. 12 minutes, everyone's sleeping and then they leave, OK? You can't do that if you're on live television every night.","It's nice to have that ability. We don't want a teleprompter president again, do we? Do we? No more teleprompter, no more. It's too easy. Tell me what I should say. Write it out. I'll read it. But you look at what's going on, you look at what's going on in the world. It's going to change. It's going to change so fast for us. I'm telling you, we can do things so fast.","My campaign, I spent less money than anyone else, and I'm by far the front runner. I mean, by far. My son, Don -- where is Don by the way? Is Don here? Where's Don? Where is my boy? He's done such a great job. Where is Don? Come here. My son, Don, and Eric, and Ivanka. Come here, Don. My boy is working on a big project on Pennsylvania Avenue.","You know, he loves his dad and his sister and his brother, they know. I mean, those are the three that are grown up and they're doing a great job. And they know I want to be on Pennsylvania Avenue, right? So I got, from the Obama administration -- can you believe this -- the most valuable site, the -- probably the most heavily been on site in the history of the General Services Administration.","It's called the Old Post Office. It was built in the 1880s. It's an incredible building. We're converting it to a hotel. The reason I got it is I had the greatest statement. One of the best statements they've ever seen. They want to make sure it gets done. And we had a great concept. We're building a super luxury hotel.","It'll be one of the great hotels of the world, not only of the country. It's a great thing. They did the right thing. They chose Trump. What can I tell you? We're right now -- we're right now -- two years -- right now, we're two years ahead of schedule. Two years. Of course, we're going by government schedule.","And by the way, the people at G -- GSA are terrific people. They're really good people, really talented people. Of course, if they didn't choose me, I don't know if I'd say that. But these are . But I think they started out with over a 100 bidders, they broke it down to 10, all the great hotel companies, all of the great real estate companies, and we got it because of the statement and because of the concept.","And I will tell you, Don loves that project, and Ivanka and Eric, because they know that we're going to make America great again. They know that I want to live on Pennsylvania Avenue, and they know if I don't make the White House, I can still live on Pennsylvania Avenue because this is on Pennsylvania Avenue, right?","Right? Say something.","I -- I will tell you this. You know, a lot of people ask me to speak on success and what it takes to be successful and all this. But, you know, I've known a lot of very successful people. The most successful people are the people with great families I will tell you. Not the most money, but the people with the great families.","When you have -- I'm just going to interject this in between trade, in between the Second Amendment, which by the way we are going to keep and solidify. But -- but I must tell you, it's the people with the great wife or the great husband and the great children, that love their children and adore their families, those are the happiest people, not the people with the most money.","I speak against myself perhaps, maybe not. But I'll tell you what, cherish your family because there's nothing more important. Just remember that. OK. Now back on to trade. So the Second Amendment is under siege. And I'll tell you what else is under siege, Christianity. It's under siege. I've had tremendous support from pastors.","I've had such incredible support from pastors and ministers and clergy. And you know, it's amazing. I'm winning all of the evangelicals. If you look at -- if you look at South Carolina, Ted Cruz was supposed to win that easily and I won in a landslide, and I won the evangelicals. And Jerry Falwell Junior got up and made the most incredible speech.","He talked about his father. I was very complimented because he said nice things, and you know, everybody that walks through -- that goes through, they all go through Liberty University, Jerry's Liberty University. And he knows all the candidates. And he came out and endorsed to me, Jerry Falwell Junior, which was a really great thing.","And people saw it. But he said about me -- of all of the people, he said that I most remind him of his father who he adored, and he tells a story that, in theory, Jimmy Carter should have been endorsed by the evangelical leaders. And they went and his father -- and they went and they loved Ronald Reagan.","But Jimmy Carter was perfect, Sunday school teacher, knew the Bible without question, a good person -- a very good person. And you had Ronald Reagan who was a little bit different -- a little bit different, but Jerry Senior felt that Ronald Reagan would be a better president. He was tougher, he was stronger.","He was much more into the military and protection. And he went out and took a lot of heat on it. He went out and didn't endorse Jimmy Carter, he endorsed Ronald Reagan. And it turned out to be a great, great decision, right? Great decision. And -- and so Jerry Junior felt similarly. But you know, for him to go endorse because they don't endorse, they don't like to endorse, they don't get involved in that.","But he just felt so good, and I really think between Jerry and Paula and -- and so many different people from the church and -- and just the ministers and the pastors, I've had such incredible support. So for the evangelicals among you, I love you and we're going to do things -- good things together. Believe me. And one thing that came up, by the way, which I think is very important.","I was at a meeting with many, many pastors and ministers. God bless America. You're right. Good man. Stand up. I like that, I like to hear that. And by the way, when it's Christmas, we're going to start saying Merry Christmas again, folks. OK? You better believe it. You haven't notice, the stores you go Christmas time, they'll have like a red wall and there won't be anything on it. And I have friends that frankly aren't Christian, and I'm Protestant.","I'm Presbyterian. But I have friends, they're not Christian and they like saying Merry Christmas, and you put Merry Christmas, Happy Holidays. The stores, you go to Macy's, you go to these stores, they don't have Merry Christmas. We're going to have Merry Christmas on our stores again, all right? So I was at a meeting with probably 55 or 60 pastors, ministers, people -- great people of the church and they were talking.","And I said, \"Let me ask you a question. How many Christians -- evangelicals and Christians altogether do you think we have in the country?\" And they probably figured like 250, 260 million. I said, \"So as a political bloc, that's bigger than women and it's bigger than men. There is no political bloc like that.\" Why is it that we get pushed around?","For instance, I made the statement about Muslims. Great respect, I have many friends that are Muslims. But there's something going wrong here, folks. And they said we have to do something temporarily, we have to find out what's going wrong. We can't let the Syrians come in. We don't know who they are. We don't know where they come from.","We don't know where they come from. And I said, \"We have to figure out what is going on.\" We have Paris, and you have in -- in Los Angeles, and you have so many different things happening. The event that took place in California with the 14 people killed by the woman who radicalized the guy, they get married, they go, they kill people that is supposed to be their friends.","There's something going on, right? But I said -- but I said to the people assembled -- I said, \"Let me ask you this question\", it -- cause it's so to me important. I said, \"You have such power, but you guys are all afraid to use your power. What is it?\" And then after about two minutes, I figured out. During the Lyndon Johnson administration, the power was taken away because they going to lose their tax exempt status if they get a little bit political.","So you have people that are incredible pastors and ministers and everything, and they're strong people and they're great people, and they're afraid to go out and fight for Christianity in the truest sense of the form, so I said essentially, \"What you're telling me is that a man or woman on the street, walking down the street, has more power than you do and you're a minister or you're a pastor, that's something wrong.\" I said, \"We are going to work like hell to get rid of that legislation so that you can have your power back.","You've got to have your power back.\" And we're going to do that. We're going to get that done. I don't know how it was allowed to happen, but the fact is we have the most powerful group of people in this country by far and they're not treated properly because Christianity, piece by piece by piece, is being destroyed.","So we're going to get it back, folks. Remember what I said. Just remember what I said. So just in finishing up. Second Amendment very important. I talk about the case with the 14 people because they were killed. If there were guns on the other side of the room, if a couple of like this guy, that guy right there, that guy, the big guy with a beautiful beard, with a beautiful -- almost as good a head of hair as I have, that guy right there.","Better -- better -- he's got better. But if -- if we had a couple of people in that room -- if we had a couple of people -- as an example, the worst -- quiet, quiet, quiet, quiet, quiet, quiet. Let him come on, quiet. Get out. Get him out. Get him out. Get him out. Thank you. Thank you. That's OK. I -- it's sort of crazy, right?","You know, whether you're Republican, whether you're Democrat, Liberal, Conservative, we want certain things. We want to have a beautiful family, we want to have good safe borders, we want to have a strong military, we want protection, we want to have jobs which are being taken away from us left and right.","You know, you wouldn't think -- you think everybody would be like on the same side. There's like six or seven things you want to have. You want to have freedom of religion. You want to have things -- you want to have certain things, and you would think that people would sort of all be in the same. But every once in a while, you have that happen and it's fine.","Listen -- listen. Paris is the toughest in the world for guns. You can't have a gun. France is probably the toughest nation anywhere in the world for guns. The only one that has the guns are the bad guys, right? So you have the strongest gun control laws in the world in Paris and in France, and you have these thugs, these -- these scum, these garbage.","They walk in to three or four different places and they start going , you , you . And you know what folks, if we would've had a few guns firing bullets in the opposite direction, it wouldn't have been that way. It wouldn't have been that way. It wouldn't have been that way.","You have a 130 people dead. You have many, many gravely injured, lying in the hospital, many of whom are going to die. It's a horrible scene, they tell me. But you wouldn't have that scene. So we're going to protect that Second Amendment. And believe me, it's not going to be touched -- not going to be touched.","So -- so just in closing, you got to vote. Got to go to -- tomorrow's a big day. And I want Georgia. I want you to lead the pack. We're going have a lot of success. We're going to have a lot of success. But I love Georgia and I want you to lead the pack if you can. But look, we don't win anymore. We don't win on trade.","We don't win at the borders. We don't win with our military. Our military, the -- the great -- great -- the greatest military in the world, we can't even beat ISIS. So we're going to knock ISIS out so fast. Our health care is horrible. It's highly expensive, it doesn't work, it's broken, it's going to be terminated.","So we don't win at health care. We don't win at anything. We certainly don't win with education. Here's the story, folks. You'll going to look back on this night and you'll going to say in two years, in three years, in four years, in -- in 20 years. You're going to say this was an amazing evening because it is a movement.","You're going to say -- you're going to say -- you're going to say that was an evening when Donald Trump stood up and he said -- and he said -- and she will be a great first lady, say that again. She's -- she will be. You're going to say that was an evening when we really became great again. We are going to win at every single level.","We are going to win with health. We are going to win with education. We are going to win at the borders. We're going to win with our military. We're going to win, win, win, win. We are going to make America great again, greater than ever before. I love you. Go out and vote. I love you all. Thank you, Georgia. Thank you. We love you. Thank you."],"text":" You people are amazing. So here's the story. Here's the story. I love you. I love you. I love Georgia, frankly. Georgia. Georgia. So here's the story. We have 7,500 people in the room. Outside, we have 12,000 people. And we set up speakers. Would anybody like to give some of the people outside your position? Would? Please, raise your hand. We'll get you out of here fast, right? OK. I'm only kidding. So we had a lot of good news today. CNN. CNN just came out with a poll -- just came out. Trump, 49%. Little lightweight, Marco Rubio, 16%. Lying Ted Cruz, 15%. Good guy, Ben Carson, 10%. And Kasich at six. So we're 49%. Can you believe it? And we got the endorsement yesterday of Senator Jeff Sessions, who's an incredible guy. And we have Sarah Palin, and we -- we have so many incredible people. We have -- I'll tell you, Jerry Falwell Junior. You know, we're winning at every level with evangelicals. Jerry Falwell Junior did -- was unbelievable, and maybe that's one of the reasons that we've had such help. But the evangelicals, the Tea Party people. We're winning with old, we're winning with young. We're winning with highly educated. We're -- well, right? We're winning with the little bit less than highly educated, which is OK. I love you. And we're winning with the veterans. I love the veterans. We're winning with the military. In other words, we're winning with everybody. So I just want to thank everybody. It's been so much fun. Who would have known this was going to happen? So I have a special treat. I love NASCAR. Do we love NASCAR? I love it. So we had an endorsement a little while ago. And you know, my son, Don, is very, very friendly with the folks over at NASCAR, and in particular, Brian France. And how good is Brian France? Is this guy like a winner? And you know, I've grown up -- and George Steinbrenner of the Yankees, he was a great friend of mine, and so many of the owners. And honestly, Brian France, there's nobody like this man. There's nobody like him. The job he's done. And the f -- and the family is so incredible. So some of the NASCAR folks came over here today because guess what? They are endorsing Donald Trump. Can you believe this? Can you believe this? You know, I'll tell you what, if the people that like and watch NASCAR vote for Donald Trump, they can cancel the election right now. Nobody can win. Nobody. Nobody can win. So what I want to do, I'll bring them up individually, but these are incredible. First of all, the owner, the whole deal, the big guy, Brian France. Brian, come on up here. Come on up. He's getting pretty dapper, you know. Used to be one on the beaches of Daytona. Look at him. Brian, we love. Do you want to say a few words, Brian, before we ? Well, I -- I'll just -- real quick. I've known Donald for over 20 years, and I'm going to tell you one thing about him. You know about his winning in -- in business and success. I'm here to tell you, he wins with his family. He does. He does. And I'll tell you one thing. If you -- if you -- if you leave on one other thing. Any of his children, you'd be proud to have him as part of your family. That's how I judge a winner, how somebody manages their family, raises their family. That's all I did with him. All right. So we have some of the great drivers -- one of the great drivers o -- of the world in history, the great, the legendary, Bill Elliott. Come on, Bill. We love Bill. I don't know what to say. I mean, I -- I've known him just a little bit, but for what he can do I think for our country, I'm -- I'm all for it. I mean, we need -- we need a change, guys. That's all there is to it. And I think this is the man for the job. Do these guys have guts? I could not press it, I'm telling you. You know, I want to go about 60. That's enough, right, for most of us. So we have Ryan Newman -- great Ryan. Come on up here, Ryan. We have David -- do you know who going to say? David Lee Ragan. David, come in. Come in. And then because of genes, he was really helped a lot. You know, Bill and his incredible wife had a son. And the son -- you got it. And the son -- I don't know. Are you going to be upset if he turns out greater than you, Bill, or you going to be happy? He's going to be thrilled. That's a good father. That's a good father. I know a lot of fathers, they have a son that become successful, they're not happy. That's a great father. Most fathers are that way. Chase Elliott, the hottest young driver in the world. Say something. Say something. I'm not sure why you let me say anything. Just happy to be here. This is a great man. I think he is a guy who can -- who can do some great things for us, so thank you. Thanks for having us. Thank you, fellas. That's cute. They just said keep that war going. We're going to keep the war going, believe me. Believe me. So it's been an amazing period of time. And you know, I just have to thank NASCAR so much because that's something that to do is just incredible. These are incredible people, incredible athletes. Brian's an incredible guy who I've known for so long, and the job he's done is -- is legendary. So I just -- I just could not be happier that they were here. I just want to discuss a few other things. Tomorrow's a really big day. We have to get out and vote, you know. You know, I don't want your money because I'm self-funding, right? I'm self-funding. I don't even want Brian's money. Brian's good for some money, but I don't want Brian's money. What I want is I want everybody. We've -- I guess I just heard, we have 13 -- 14,000 people outside. They hear me very well. We have a good mic system. But I just want you folks to go out and vote. We have the head of Time, one of the top writers of Time Magazine here. He did a story, three -- four weeks ago talking about a movement, and I said, \"What are you talking about? You're going to do another story? We're going to -- \" Where is he by the way? Where's David? Where the hell is David? He did such an amazing story and he's talking about a movement. This is in fact a movement. This is not like me. This isn't about me. It's about you, it's about all of -- I'm just the messenger. And -- I'm just the messenger, folks. And there's not -- there's never been. You know, they've said -- I've gotten calls from a lot of the biggest writers, the media is back there, a lot of media, but they're very dishonest people. But some are good and I've -- they're terrible. They are so terrible. They are terrible. But you know, no, 20% of them are good, 80% are bad, 40% are disgusting. But you know, the end result, it doesn't make any difference. What we have going is so special, it's incredible. It's incredible. So the big thing -- and I'm going to -- well, I will tell you one more time before we finish, which will be in a little while, we'll talk about a few things like the wall. We'll talk about like not getting ripped off at trade, like rebuilding our military, like taking care of our vets. But I just want to say, so you know, I'm self-funding that means that nobody's going to say, \"Please, don't. I gave you a contribution. You've got to help me with the pharmaceutical industry or you have to help me with something.\" No -- no, there's not going to be any of that. Do you know that in bidding, that when -- we're the largest purchaser of drugs in the world, right? In the world, by far. So I mean, drugs like to make you better, right? And do you know that in bidding, we don't bid? It's like if you go out to buy -- to get some drugs at your local pharmacy, the government is paying a similar amount of money, that we would save billions and billions of dollars. Now, the problem is that all of these guys that I'm running against, they're all taken care of by the pharmaceutical industry. They're taking care of by all of the industries. And when it comes time to bid, they say, \"No -- no, you can't have them bid. They gave me a million dollars and they gave me five million dollars.\" It's a bad system. And we're going to change the system, we're going to clean it up. We're going to clean it up. You know, we could save as much as $300 billion if we went out and bid, 300 billion. That gets to be big money, right? That gets to be big money. The numbers of a fraud, waste, abuse in this system are incredible. We're going to take care of Social Security, we're going to cut in terms of -- not cut what you're getting, we're going to cut all of the waste, fraud, abuse, and we're going to save you Social Security without cuts. Just mark my words. And we're going to have something that's going to be so exciting. And look, I -- I deal with these people, and now I've dealt with politicians all my life. Somebody said, \"Donald isn't been political.\" I've gotten zone changes. I've been all over the world. We're doing over a 114 projects now all over the world -- all over. And I've dealt with politicians. I dealt with politicians worldwide. And I want to tell you, they're never going to get you to the promised land, folks. They're never going to do it. And you know, I saw this -- like -- like this little Marco Rubio, this -- this guy. I call him lightweight. I call him lightweight Marco. No, I see him -- I'm on the stage. You saw Chris Christie endorse me the other day, right? Great guy, tough guy. And a few weeks ago, we're at one of the many debates. These debates, they're -- they're just brutal. They're coming out of my ears. Who wants to do anymore debates? It's enough. And we have another one coming up I think on Thursday. The last one, I was double teamed and I won every single poll had me winning. Can you believe it? And these two guys, I see them backstage, they're talking, \"You know, you do this. I'll do that. You do this. Don't cut me off.\" And then they're high fiving. And they're actually -- there's one picture where I'm standing here in the middle. By the way, I've been in the middle from the beginning. Brian would like that. I've been in the middle from the beginning, from virtually the time I announced. The middle means like that's the one that's winning. And I've been in the middle right from the beginning, and that's great. But I see these two guys as a picture. What do they do? Newspapers, big picture. I'm standing here like this. There's a little bit of a break, and they're both behind me shaking hands like isn't everything wonderful? So every single online poll -- Drudge who's an incredible guy by the way, incredible. Drudge, Time, Slate, every -- everybody, every one of them, every single event, I've been number one in this whole thing with the crazy debating. And -- and the reason is I've never done this before, you know I'm not a politician. These guys, all they do is talk. It's all talk, no action. They debate. They talk. Nothing gets done. They then go to get campaign contributions. \"Yup, I promise I'll do this. Will you give me a contribution?\" That's what they do. But I am so convinced that our country can be greater than ever before. I am so convinced. That's why I'm doing this. Greater than ever before. But this guy, I watched him, and he's standing there. Think about this negotiating with the Chinese. I do a lot of business with the Chinese. I've made some great deals. I have the Bank of America building because of the Chinese, big chunk of it. I have 1290 Avenue of the Americas, that's Sixth Avenue in New York, the largest floor -- just about the largest floor plates, this massive building -- Chinese. I deal -- I have the largest bank in the world, the Chinese banks has 400 million customers, largest in the world. They're a tenant of mine in one of my buildings in Manhattan. I sell tens of millions of condos. Dealing with the Chinese is fine, but their leaders are too smart for our leaders. They're killing us, folks. And we can't let it happen anymore. Carl Icahn is one of the great business people, you know Carl, and so many other business people. I have the greatest negotiators in the world. We use political hacks to negotiate these massive trade deals, bigger than any deal. Even Brian would say these deals are big, OK? Bigger than any deal. We lose every year with China $500 billion. Think of it. $500 billion. And this has been going on forever. We always lose. We're going to start winning. We're going to win. We're not going to lose. Why are we losing? We get these political guys, they're in there because they gave campaign contributions or whatever or they raised money. I have a good friend of mine, Mel, here. But I won't tell you his last name. But he does very well in this world. He raises a lot of money for politicians. He said to me before, \"Can I raise money for you?\" I said, \"I don't want any money.\" You know how much money I turned down? I would have made Jeb Bush's 148 million, which was so far the biggest. I would have made that fund looked like peanuts. I could had -- I turned down money after money. And you know, it's not my life. It's not my life. My whole life has been money. I want money. I want money. Greed -- I was greedy -- greedy. I want more money, more money. Now, they come up. \"Donald, I'd like to give you $10 million for your campaign.\" I go, \"I don't want it.\" It's hard, because my whole life -- so I take money -- take money. Now, I'm going to be greedy for the United States. I'm going to take and take and take. We're going to take -- take -- take -- take. We're going to become rich again and then we're going to become great again. A wonderful woman came up to me at one of the events. She said, \"Mr. Trump, I love you. I'm going to vote for you. But please, don't say you're going to make us rich again. That doesn't sound good.\" I said, \"It sounds good to me.\" We can't be great unless we're going to make ourselves rich again. We have to make ourselves rich. We're losing all of our jobs to China, to Japan. The cars coming in from -- by the millions they come in. I was in Los Angeles. I saw the largest ships you've ever seen in your life with cars. It looks like a NASCAR track. They're coming off that thing so fast. I'm not sure that Chase could drive the car as fast as these guys drive off the boats. I don't even know how they do it. But I'll tell you what, they come off like just -- you never saw anything like it. You know what we do? We get nothing. We do nothing. We give them beef. We give them beef. This is the trade. It's a tiny fraction. You talk about a trade imbalance, a tiny fraction. And you know what they do with the beef? They don't want it. They send the boats back. You know that, right? They don't even take it. And then we go again and they send it back again. The third or fourth time, they take it. And by that time, it's all rotted. And you know what they do with it? They sell it as Kobe beef and they charge you 10 times more, right? You know that. It's terrible. But no, they -- they literally -- that the imbalance that we have -- now Mexico. Everybody talks about the wall. Everybody. The wall's going to be built, folks. The wall's going to be built. We're going to have a strong border. We're going to have a strong border. And by the way -- by the way, who is going to pay for the wall? 100% -- a 100%. So Vicente Fox was on television the other day throwing out the f bomb. Can you imagine if I did it? I would be so gone. I wouldn't be up here tonight if I did that. So he say, \"There is no way we're going to pay for the, you know what, wall.\" And I watch this guy and I watch the anger, and you know why he's angry? Not because of the wall, because nobody's ever told them no. Nobody ever tells them no. He can't believe that a guy named Trump -- he even got the Pope after me, right, the Pope. The Pope was after me. Listen to this. I'm in South Carolina. I love South Carolina. And by the way, I love Nevada. I love South Carolina. And do I love New Hampshire? New Hampshire got it started. And by -- and I promise the people of New Hampshire that we're going to stop the heroin from flowing in. Can you believe it? They have such a problem. We're going to stop it. We're going to stop it at the border. It's coming in from the water. We're going to stop it. So here's the story. So the Pope -- we're ready to vote in South Carolina. And I'm doing great. I'm up, and the polls are showing, everything's going to be wonderful. And my people come, \"Mr. Trump, could we speak to you? What? \"The Pope.\" I say, \"The Pope.\" That's big league. Let's face it. Is that bigger than Brian France? I'm not sure. I don't know. I don't know. The Pope -- the pope is big league. They said, \"Mr. Trump, the Pope just made a big statement about you.\" Now, this is like eight hours before the election. I say -- took a deep breath. \"Is it good or is it bad?\" They said, \"Mr. Trump, it's really bad.\" I said, \"This can only happen to me.\" The Pope is hitting me just before the election in South Carolina. I said,\" What is it?\" \"He didn't like the idea that you're building a wall and that you're going to wall off the United States from Mexico.\" I said, \"Yeah, but he doesn't understand, tremendous criminal elements are coming in, tremendous drugs are pouring in. People are coming into the country illegally.\" He doesn't understand that we have to explain it to the Pope. He's not hearing that side of it. They said, \"No, it's very serious.\" So the Pope came out with a nasty statement. Here's the good news, he corrected the statement the following day, just in time -- just in time -- just in time. That was a close one. That was a close one. Now I like the Pope again. OK? But with this guy Fox, I watch the anger in his face, and he was really angry at the fact that somebody who -- how dare you tell Mexico, because they have gotten their way -- and I love Mexico. I love the Mexican people. I respect the Mexican leaders. The problem is the Chinese leaders, the Mexico leaders, the Japanese leaders, all of them, they're too smart for our leaders. They're killing us. They devalue their currency. Hey, I know the game better than anybody. Do I know the game? That new TPP pact, you know, Trans-Pacific Partnership. We're making it with 12 different -- it is so bad. You know, the biggest thing they have is devaluation. It's not even covered in the agreement. Virtually, not covered. That's how they beat us. They don't make a great product, they make a good product. It's fine. A friend of mine, I tell this story all the time, he's an excavator. He buys Caterpillar. That's what he buys. He buys Cat -- and for years, for his whole life, he's bought Caterpillar. He sees me fairly recently and he's depressed. I said, \"What happened? Is your wife leaving you finally?\" She's want to leave him for years, I probably . Am I going to be in trouble with him when he hears this? Hopefully, she's not watching because she would know exactly who I'm talking about. But that's OK, it's got to end. This relationship is one of the truly worst, really. It's maybe the worst relationship I've ever seen. OK. I hate to say it. They don't believe in that stuff, but I'm doing him a big favor, OK? I'm doing them both a big favor. OK. So what happens -- what happens is he's depressed. And I say, \"So what's the problem?\" He said, \"I just ordered a tremendous amount of Komatsu equipment from Japan.\" I said, \"Is it good?\" \"Yeah, it's good.\" \"Is it as good as Caterpillar?\" \"No, but it's good. It's very good.\" I said, \"Why?\" He said, \"They have so devalued the yen that I owe it to my family, I owe it to my company, I owe it to my employees. I have to do what's right for my company.\" And he bought a tremendous amount of Komatsu tractors and excavators, and I could see he was very upset. And now you take a look at Caterpillar. Take a look at their stock. See what's going on. A lot of bad things are going on. These companies and these countries, they're devaluing and they're devaluing like grand chess masters. China is the best of all. China is killing us, folks. China has -- I -- I say it. It's the single greatest robbery what China has done to the United States. I love you too, darling. It's the single greatest robbery what they've done to the United States. In the history of the world, there's never been a robbery like this. We have rebuilt China. We have rebuilt China because we don't have the right people negotiating for us, and we have the best people in the world. We have the best business people in the world. We don't have the right people negotiating. And it's going to end, folks. It's going to end. It's going to end fast. And then I hear, you know, I'm -- I used like to say I'm a commonsense conservative. I'm actually very conservative when it comes to the military, it comes to the wall. We're going to get rid of Obamacare very, very much, right? Thank you. We're going to get rid of Common Core. Our education is going to be local -- local. And I've seen it, this -- this Common Core is a disaster. Do you know, in the world -- 30 countries in the world, we're number 30th, we're last. We're last on education. We're number one per pupil and cost, and number two doesn't even exist because we spend so much more than number two, you might as well forget number two. You have Denmark, Sweden, China, Norway. United States is number 30. And yet we're number one in cost. You know, it's very interesting, my campaign. Somebody wrote an article, one of these people back there. One of these of many. Boy, that's a lot of cameras. You know -- do you know the biggest problem with my speeches? They're always live. I got like all these cameras. That's why I can never make the same stump speech. All these other guys, they go and they read the same speech, right? Ladies and gentlemen, thank you. 12 minutes, everyone's sleeping and then they leave, OK? You can't do that if you're on live television every night. It's nice to have that ability. We don't want a teleprompter president again, do we? Do we? No more teleprompter, no more. It's too easy. Tell me what I should say. Write it out. I'll read it. But you look at what's going on, you look at what's going on in the world. It's going to change. It's going to change so fast for us. I'm telling you, we can do things so fast. My campaign, I spent less money than anyone else, and I'm by far the front runner. I mean, by far. My son, Don -- where is Don by the way? Is Don here? Where's Don? Where is my boy? He's done such a great job. Where is Don? Come here. My son, Don, and Eric, and Ivanka. Come here, Don. My boy is working on a big project on Pennsylvania Avenue. You know, he loves his dad and his sister and his brother, they know. I mean, those are the three that are grown up and they're doing a great job. And they know I want to be on Pennsylvania Avenue, right? So I got, from the Obama administration -- can you believe this -- the most valuable site, the -- probably the most heavily been on site in the history of the General Services Administration. It's called the Old Post Office. It was built in the 1880s. It's an incredible building. We're converting it to a hotel. The reason I got it is I had the greatest statement. One of the best statements they've ever seen. They want to make sure it gets done. And we had a great concept. We're building a super luxury hotel. It'll be one of the great hotels of the world, not only of the country. It's a great thing. They did the right thing. They chose Trump. What can I tell you? We're right now -- we're right now -- two years -- right now, we're two years ahead of schedule. Two years. Of course, we're going by government schedule. And by the way, the people at G -- GSA are terrific people. They're really good people, really talented people. Of course, if they didn't choose me, I don't know if I'd say that. But these are . But I think they started out with over a 100 bidders, they broke it down to 10, all the great hotel companies, all of the great real estate companies, and we got it because of the statement and because of the concept. And I will tell you, Don loves that project, and Ivanka and Eric, because they know that we're going to make America great again. They know that I want to live on Pennsylvania Avenue, and they know if I don't make the White House, I can still live on Pennsylvania Avenue because this is on Pennsylvania Avenue, right? Right? Say something. Well, it's great to be here, and I -- I just got to say, as I've traveled across the country for these last few weeks now, now that I've been a politician for 12, maybe 13 days, it's incredible to see the outpouring, the warmth, and we're just excited. I mean, I really love what my father's doing here. He really loves this country. He loves the family it's given him, the opportunity it's given him, the businesses it's given him, and he wants to give back. He could sit back and play golf and enjoy for the rest of his life, and just have a good time. Well, that is Obama. But he doesn't want to do that. He wants to put what he's done in business and make it work for you guys, and he's going to do a phenomenal job. He's going to fix the mess. He's going to cut the nonsense, and he's going to make America great again. And I couldn't be more proud of him. Thank you very much. I -- I will tell you this. You know, a lot of people ask me to speak on success and what it takes to be successful and all this. But, you know, I've known a lot of very successful people. The most successful people are the people with great families I will tell you. Not the most money, but the people with the great families. When you have -- I'm just going to interject this in between trade, in between the Second Amendment, which by the way we are going to keep and solidify. But -- but I must tell you, it's the people with the great wife or the great husband and the great children, that love their children and adore their families, those are the happiest people, not the people with the most money. I speak against myself perhaps, maybe not. But I'll tell you what, cherish your family because there's nothing more important. Just remember that. OK. Now back on to trade. So the Second Amendment is under siege. And I'll tell you what else is under siege, Christianity. It's under siege. I've had tremendous support from pastors. I've had such incredible support from pastors and ministers and clergy. And you know, it's amazing. I'm winning all of the evangelicals. If you look at -- if you look at South Carolina, Ted Cruz was supposed to win that easily and I won in a landslide, and I won the evangelicals. And Jerry Falwell Junior got up and made the most incredible speech. He talked about his father. I was very complimented because he said nice things, and you know, everybody that walks through -- that goes through, they all go through Liberty University, Jerry's Liberty University. And he knows all the candidates. And he came out and endorsed to me, Jerry Falwell Junior, which was a really great thing. And people saw it. But he said about me -- of all of the people, he said that I most remind him of his father who he adored, and he tells a story that, in theory, Jimmy Carter should have been endorsed by the evangelical leaders. And they went and his father -- and they went and they loved Ronald Reagan. But Jimmy Carter was perfect, Sunday school teacher, knew the Bible without question, a good person -- a very good person. And you had Ronald Reagan who was a little bit different -- a little bit different, but Jerry Senior felt that Ronald Reagan would be a better president. He was tougher, he was stronger. He was much more into the military and protection. And he went out and took a lot of heat on it. He went out and didn't endorse Jimmy Carter, he endorsed Ronald Reagan. And it turned out to be a great, great decision, right? Great decision. And -- and so Jerry Junior felt similarly. But you know, for him to go endorse because they don't endorse, they don't like to endorse, they don't get involved in that. But he just felt so good, and I really think between Jerry and Paula and -- and so many different people from the church and -- and just the ministers and the pastors, I've had such incredible support. So for the evangelicals among you, I love you and we're going to do things -- good things together. Believe me. And one thing that came up, by the way, which I think is very important. I was at a meeting with many, many pastors and ministers. God bless America. You're right. Good man. Stand up. I like that, I like to hear that. And by the way, when it's Christmas, we're going to start saying Merry Christmas again, folks. OK? You better believe it. You haven't notice, the stores you go Christmas time, they'll have like a red wall and there won't be anything on it. And I have friends that frankly aren't Christian, and I'm Protestant. I'm Presbyterian. But I have friends, they're not Christian and they like saying Merry Christmas, and you put Merry Christmas, Happy Holidays. The stores, you go to Macy's, you go to these stores, they don't have Merry Christmas. We're going to have Merry Christmas on our stores again, all right? So I was at a meeting with probably 55 or 60 pastors, ministers, people -- great people of the church and they were talking. And I said, \"Let me ask you a question. How many Christians -- evangelicals and Christians altogether do you think we have in the country?\" And they probably figured like 250, 260 million. I said, \"So as a political bloc, that's bigger than women and it's bigger than men. There is no political bloc like that.\" Why is it that we get pushed around? For instance, I made the statement about Muslims. Great respect, I have many friends that are Muslims. But there's something going wrong here, folks. And they said we have to do something temporarily, we have to find out what's going wrong. We can't let the Syrians come in. We don't know who they are. We don't know where they come from. We don't know where they come from. And I said, \"We have to figure out what is going on.\" We have Paris, and you have in -- in Los Angeles, and you have so many different things happening. The event that took place in California with the 14 people killed by the woman who radicalized the guy, they get married, they go, they kill people that is supposed to be their friends. There's something going on, right? But I said -- but I said to the people assembled -- I said, \"Let me ask you this question\", it -- cause it's so to me important. I said, \"You have such power, but you guys are all afraid to use your power. What is it?\" And then after about two minutes, I figured out. During the Lyndon Johnson administration, the power was taken away because they going to lose their tax exempt status if they get a little bit political. So you have people that are incredible pastors and ministers and everything, and they're strong people and they're great people, and they're afraid to go out and fight for Christianity in the truest sense of the form, so I said essentially, \"What you're telling me is that a man or woman on the street, walking down the street, has more power than you do and you're a minister or you're a pastor, that's something wrong.\" I said, \"We are going to work like hell to get rid of that legislation so that you can have your power back. You've got to have your power back.\" And we're going to do that. We're going to get that done. I don't know how it was allowed to happen, but the fact is we have the most powerful group of people in this country by far and they're not treated properly because Christianity, piece by piece by piece, is being destroyed. So we're going to get it back, folks. Remember what I said. Just remember what I said. So just in finishing up. Second Amendment very important. I talk about the case with the 14 people because they were killed. If there were guns on the other side of the room, if a couple of like this guy, that guy right there, that guy, the big guy with a beautiful beard, with a beautiful -- almost as good a head of hair as I have, that guy right there. Better -- better -- he's got better. But if -- if we had a couple of people in that room -- if we had a couple of people -- as an example, the worst -- quiet, quiet, quiet, quiet, quiet, quiet. Let him come on, quiet. Get out. Get him out. Get him out. Get him out. Thank you. Thank you. That's OK. I -- it's sort of crazy, right? You know, whether you're Republican, whether you're Democrat, Liberal, Conservative, we want certain things. We want to have a beautiful family, we want to have good safe borders, we want to have a strong military, we want protection, we want to have jobs which are being taken away from us left and right. You know, you wouldn't think -- you think everybody would be like on the same side. There's like six or seven things you want to have. You want to have freedom of religion. You want to have things -- you want to have certain things, and you would think that people would sort of all be in the same. But every once in a while, you have that happen and it's fine. Listen -- listen. Paris is the toughest in the world for guns. You can't have a gun. France is probably the toughest nation anywhere in the world for guns. The only one that has the guns are the bad guys, right? So you have the strongest gun control laws in the world in Paris and in France, and you have these thugs, these -- these scum, these garbage. They walk in to three or four different places and they start going , you , you . And you know what folks, if we would've had a few guns firing bullets in the opposite direction, it wouldn't have been that way. It wouldn't have been that way. It wouldn't have been that way. You have a 130 people dead. You have many, many gravely injured, lying in the hospital, many of whom are going to die. It's a horrible scene, they tell me. But you wouldn't have that scene. So we're going to protect that Second Amendment. And believe me, it's not going to be touched -- not going to be touched. So -- so just in closing, you got to vote. Got to go to -- tomorrow's a big day. And I want Georgia. I want you to lead the pack. We're going have a lot of success. We're going to have a lot of success. But I love Georgia and I want you to lead the pack if you can. But look, we don't win anymore. We don't win on trade. We don't win at the borders. We don't win with our military. Our military, the -- the great -- great -- the greatest military in the world, we can't even beat ISIS. So we're going to knock ISIS out so fast. Our health care is horrible. It's highly expensive, it doesn't work, it's broken, it's going to be terminated. So we don't win at health care. We don't win at anything. We certainly don't win with education. Here's the story, folks. You'll going to look back on this night and you'll going to say in two years, in three years, in four years, in -- in 20 years. You're going to say this was an amazing evening because it is a movement. You're going to say -- you're going to say -- you're going to say that was an evening when Donald Trump stood up and he said -- and he said -- and she will be a great first lady, say that again. She's -- she will be. You're going to say that was an evening when we really became great again. We are going to win at every single level. We are going to win with health. We are going to win with education. We are going to win at the borders. We're going to win with our military. We're going to win, win, win, win. We are going to make America great again, greater than ever before. I love you. Go out and vote. I love you all. Thank you, Georgia. Thank you. We love you. Thank you."}