{"id":441,"author":"Donald Trump","title":"Speech: Donald Trump in Virginia Beach, VA","date":"2016-02-24","link":"https://factba.se/transcript/donald-trump-speech-virginia-beach-va-february-24-2016","paragraphs":["Thank you very much. Thank you everybody. Thank you. So nice. Thank you very much. Please sit down. So we had a very exciting evening last night and I went all around. You know the word caucus? It's a little complicated because you don't know how it's going to work out. And they say it's hard to poll but we polled fine and we really won big last night.","So we ended up getting 46% of the vote. And you know during the day I was walking, I saw all these people and they're all saying, \"Donald! We love you Donald! We love you!\" but you never know what's going to happen. And as soon as we turned on the television last night when the results started coming in, it was obvious from the beginning.","So we had a really extraordinary night. And one of the things that made me so happy is we -- what we, as you saw, we totally won with evangelicals. I mean we were big league with evangelicals and it was, it was such a good thing. And we've worked very hard. You know I'm a Presbyterian. I'm Protestant and there really is and I was going to talk to Pat later on who is a great gentleman by the way over the years I've met him, I've watched him the job he's done over here is incredible.","And I just have to tell you it's an honor to be with Pat and I look forward to having him grill me. He'll probably be grilling me. But he's a great man and a great guy and I've known him really. The last time I was with him was about four years ago. I was getting an award, the Boone Pickens Award for Entrepreneurship and Pat was there and I got to know him a little bit and it was, it was really great.","So I think the reason we've been doing well and doing quite well in the polls and leading by a lot with almost everybody is that I talk about what we have to do for our country and our country is in deep trouble. We owe $19 trillion. Most people don't even know what a trillion dollars is. You know, how many hundreds of millions is in a trillion?","It's such a number and you know it's a name that 10 years ago you'd never even heard the word trillion. But we owe $19 trillion, a very bad budget was passed just about four weeks ago. That's going to add at least two trillion to it. So we'll be up essentially to $21 trillion and you know at a certain point this is really the point of no return.","And you really have to have somebody that knows what he or she is doing. And I do know what I'm doing when it comes to business, I know what I'm doing. It's been an amazing period of time for me. It's been great. In fact, my two sons are backstage. Maybe I'm allowed to bring them up because I'm very proud of my boys so maybe I'll bring them.","Maybe I'll bring them on. Good. That's beautiful. This is Don and this is Eric. They were with me for the last week and they go around making speeches and this way. I'll send them they do a better job than me anyway so I go into the room and I watch television, you know and they say the Trumps are making the speeches. Say \"Hello Don.\"","Thank you. Thank you, sweetie. So a lot of times people ask me to speak about success. Friends of mine and they'll even make big payments and we give it to charity and stuff but I'll do it. And so often I'll say, \"You know the really successful people are the people not with the great wealth but with the great families where they have great kids and wives and husbands and those are the people that are the happiest.\" And I don't know if I'm speaking against myself here but the fact is, you know, you can have it. I know the most successful people in the world.","I deal with them all the time. I know and I know I'm in many cases very well. These are not the happiest people generally, a couple of happy. Not too many because you know, no matter how successful, they all want more, more, more. It's never satisfied. And I guess, I get a little bit guilty of that also.","But the fact is, that the happiest people I know are the people with great families, have loved their families and when their families loved them. So, it's something I talk about during the success seminars and a lot of times the people running the seminar don't want to hear that. That's not exactly what they want to hear.","But I have to be truthful. So and there's a good example. I have two really great boys. I have five children altogether and they're all then -- they've been fantastic. You know Ivanka? Most of you know Ivanka's going to have a baby in about a week. We've been waiting. We thought Iowa, we thought New Hampshire, right?","We thought South Carolina. We thought Vegas would be an interesting place to have a baby. A much different deal, but she probably like it during the next week or two she'll have a baby and she's been spectacular to have Tiffany and have Baron and they're all -- they're all very good kids. So, hopefully they'll stay that way.","Where's wood? I think I should knock on wood. I have to find some. Wait. Is anybody superstitious? Oh that's real wood, too. That's not -- that's the real deal. So anyway, they're good kids and it's really great. What we have to do and I think the reason we're resonating is we have to straighten out our trade deals.","They're horrible. With China, we lose in trade $500 billion a year. What kind of a deal is that? With Japan, we lose hundreds of billions of dollars. It's much smaller than China but hundreds. We owe Japan $1.6 trillion. We owe China $1.7 trillion. Sort of an amazing thing, right? They take our money and then we owe them money.","They take our jobs, we owe them money. They take our factories. You have no idea how many are closing up and have closed them. And I have great relationships with China. I have great relationships with Japan. I have great relationships with Mexico. But Mexico is killing us at the border and they are killing us in trade.","You know, you read the other day were Carrier's moving into Mexico. Did anybody read that story? I thought it was very sad. Carrier, the maker of air conditioners, and they're moving in and they released 1,400 people and I guess somebody had a cellphone going which I'm sure Carrier was not thrilled with because it went all over the world.","And the executive was standing up saying we're closing up and we're going to move, too. All those jobs are gone and we're going to move to Mexico. And I said to myself, \"What does that help us? How does it help us?\" So they're going to make air conditioners. They're going to sell them across the border, probably have illegals walk them in because it's cheaper that way and nobody, nobody checks them.","Nobody checks them. So you know just every illegal gets an air conditioner. Walks across. Oh, Ford does the same thing. You know they're probably, when they, you know, Ford is building a $2.5 billion plant and they'll have illegals drive the cars across the border. So it's very sad. Honestly, it's very sad.","It's so, it's so bad that sometimes you have to laugh. You can't even believe it. So, Ford is building a massive plant. Nabisco is moving from Chicago into Mexico. I mean Mexico is literally the new China. They're taking our business, is going to become the car capital of the world. They took a plant out of Tennessee.","It was going to -- it was scheduled to be built in Tennessee and boom! Tennessee is such a great place. They took it. Last moment it decided, it's going to Mexico. So we have to do something and we have to have borders. We have to have strong borders. If we don't have borders we don't have a country and people can come into our country but they have to come in legally.","They can't do what they're doing. We have right now 179,000 illegal immigrants who are criminals, who have criminal convictions. That means all 178. Think of that. That's like filling up Yankee Stadium four times. We have all over the country. These are criminals. This is not just you know, these are people that were convicted of a crime.","So we're going to be very strong in the borders, we're going to be very, very strong in trade. We're going to be very strong in protecting our Second Amendment. We're going to get rid of Common Core which is basically education through Washington which is a disaster, by the way and you understand that. And we're going to get rid of Obamacare.","Obamacare is totally turned out to be a total disaster and it's really hurting our country. It's really hurting our country because you have so many part time jobs right now because people don't want to register under Obamacare and you have part time -- everyone has part time jobs. I mean you look at these people.","They never had a part time job in their life and now all of a sudden companies are putting them on part time and now they have to go get a second job. So it's a very unfair thing and we're going to get rid of it. We're going to come up with a plan. There's so many different plans whether it's the health care savings accounts or we have to get rid of the lines between the states that's only there for one reason because all of these politicians that I'm running against and more are taken care of by the insurance companies and they're taken care of by the oil and gas companies and they're taken care of by everybody.","I'm the only one, that's not. You know why I'm not? Because I'm self-funding. I don't know if that's smart or not so smart but as a big contributor I've been over the years a very big contributor. I understand. I mean I understand what it takes. We have a situation right now with drugs. we don't bid our drugs.","Can you believe it, the United States is the largest drug buyer in the world. Drugs to make you better, pharmaceuticals and we don't bid it out. And a friend of mine who's a doctor, great guy, came up to me and said, \"Donald why don't we? I don't understand it.\" Well once I found out what he was talking about because it's not my world.","I knew exactly why. Because the pharmaceutical industry takes care of all the senators and all the congressmen, have a very strong lobby and they don't want to bid our drugs. If you bid them up we'll save $300 billion -- $300 billion and we don't even do it. We're going to do it because what happens if I'm there, they'll be calling, \"Donald you can't do that.","You can't do it.\" Trust me I can do it. They can't do it, because they've been given millions of dollars. You don't know how corrupt it is and I guess it's called legal corruption but you don't know how corrupt it is and whether it's timber industries, anything. I'll do the right thing. By the way I'm going to be great for industries too but I'll do the right thing.","But we have to straighten our country out. One of the other things bigger than that is military. I mean for years we've been seeing the military and we see I've been reading about it for years where they order a plane that they don't want or they order missiles that they don't want. They want a different one because the company making that missile has more political influence.","So they're ordering things that even the generals don't want and they're ordering too much equipment and they're ordering the wrong equipment. Those days are over and we're going to make our military bigger, better, stronger than ever before. We need it more than -- it's the cheapest thing we can do by the way.","And nobody is going to mess with us. I don't want to use it. Nobody is going to mess with us. Remember I'm the one -- I didn't want to go into Iraq. It was one of the worst decisions ever made and we lost $2 trillion. Thousands and thousands of lives, thousands of lives. We have wounded warriors who I love, all over the place.","And what happens, Iran is now taking over Iraq. When you think of how Iran is doing lately right between the Iran deal we get $150 billion. We got nothing for it. We should have gotten our prisoners back long before we started negotiating. And all you do is say, \"Listen, we're not negotiating until we get our prisoners back.","We can't.\" And they'll say no and you leave the room. They didn't leave the room. They never left. They just stood there. Kerry he's the worst negotiator I think I've ever seen. He never left the room. But all you have to do is say, \"We need our prisoners back.\" This is like four years ago when they started this longest negotiation I've ever seen, too.","But you say we have to have our prisoners back. They're going to say, \"No, the Persians, I mean, fact and tell you that the Persians are great negotiators and they're smart and it's tough. But you go and you say, \"We need our prisoners back. You don't want them. You don't need them. Your people don't even know they're there.\" We need them and we got to have them and we'll make a better deal because it's easier.","So then they'll say, \"No.\" I will leave the room. I'll say, \"Bye-bye.\" And then we double up the sanctions. And within 24 hours they are going to call and say, \"You got your prisoners back.\" Right? Then you go in for seconds because you have to do this. So you go in and you say, \"Listen\" and I tell the story which is so cute.","My father was a very good negotiator and he thought I was too rough. He thought -- he said, \"Too tough, you're too tough. You kind of just take the lumps out.\" He used to use, the expression. He'd always go like this when he said -- he'd say, \"Son, take the lumps out.\" So if I didn't have my father I would have said this.","We're not giving you the $150 billion. So they'd be over there and they'd be angry and you know, probably never bring it back. But I'd say it very tough, \"We're not giving it to you.\" But now I learned so much from my father. So I take the lumps out and so now say, \"Listen, we have a problem.\" Now, in the meantime, our prisoners back, they landed, I'd say, \"Did they land yet?\" No, I won't say it yet.","Let's wait till the next day. \"Did they land?\" \"Yes. They just landed on American soil.\" So now I say, \"Fellas we have a problem, big problem. We have a country not doing well. We owe $19 trillion. Essentially we're bust. Got no money, we got no money. We just had a budget approved for $2 trillion with 21 trillion.","We have no money. Fellas, we can't give you the $150 billion.\" They're going to go crazy. They're going to go crazy. One day, one day and now I'd say, \"I'm sorry. I want to give it to you so badly. You have no idea. I'm dying to give it to you but I can't. We don't have any money.\" So that's better than saying, \"We're not giving it to you.\" Right?","Do we all agree? Just the same effect except this way, they recover faster. They probably both work. I know the second one works, the first one you know, you could end up in a position. It's going to be a long time before you stand. No way I would have given them $150 billion. No way in a million years and one of the saddest things is, the money's gone.","And by the way two days before the money left see, The Art of the Deal. Hold that book up. See? The Art of the Deal here. Is there everyone who didn't read the Art of the Deal? Everybody is. But I always say the bible is much better. There's not a contest, right? Because that's one of the great books but the bible is much better.","I know. So there are so many -- not even close. Do we agree? I will tell you, right? We agree. But the Art of the Deal has been a great book. Obviously Kerry did not read The Art of The Deal. Probably didn't read the bible either. But these are -- but it's a very sad thing that whole that whole episode with Iran is a very sad thing and then two days before the money is sent, they capture 10 beautiful young sailors.","They put guns to their heads. They're roughed them up in terms of at least mentally. They were devastated and they humiliated our country. They humiliated the 10 people, one woman and nine men and that's the work that's what we're dealing with. Not going to happen anymore, folks. Not going to happen anymore.","We're going to do we're going to be the smart country instead of the dummies that everyone laughs at. They laugh at us because we have people that don't know what they're doing. Like Sergeant Bergdahl, we get Bergdahl, a traitor. They get five killers that they've coveted. They're wanted for nine years and those five killers are back on the battlefield or soon will be. But these are the ones they wanted, these five.","So we knew he was a traitor before we made the deal because at a general and a colonel interviewing all of the people that he worked with in the military. They knew he left. Six people died, looking for him. Five, definitely, probably six died they went out looking for him. They tried to get him back. He left and we get -- that's the way we negotiate.","We get Bergdahl, they get five great killers for them, the people that they want. Not going to happen anymore, not going to happen. So I tell these stories and I go around and I meet with crowds and we have tremendous crowds. We have by far, the biggest crowds far, far, far bigger than Bernie and Bernie is heading down now, I think.","Bernie looks like he's over and it looks like Hillary is going to be protected from the email scandal by the Democrats. I mean can you believe it? So many people for doing much less than she did, are in prison. And just you know, devastated. No, think of it. Think of it. For doing less than she did and she looks like she's just going to be you know, she's gonna point at you.","Did you ever see anybody so nice to the president, though? \"Oh, the president is wonderful.\" she says \"Oh, the president is great. Whatever -- he wants to do this. Oh that's wonderful. Whatever you want.\" You know why she's doing that, right? You know why I know why? Boy, oh boy she's become like a marshmallow.","She's become she's everything he does. \"Oh it's wonderful. Whatever he wants to do is wonderful. The president \" Man, I couldn't be there. Her life cannot be so easy. But she is what she said is so wrong and it's so unfair and it looks like she'll be the nominee and it looks like nothing will happen but it'll be something that will be discussed.","I promise you it will be discussed often, often, often. So with that, I think we're really doing well. Looks like we're in a great trend and we have tremendous support and we have amazing people in this country. And one of the most amazing people in the whole country is our great friend, Pat. Will you come out here, Pat?","Look at him. One of the great people. Thank you.","It's great to be here. Good. Good morning to be here. Supposing I lost, I probably wouldn't call. \"Pat, I don't ever want to be there today, right?\" We had a great -- we had a great evening.","Well, it's a great building. It's the old post office built in the 1880s. It's an amazing building with walls that are five and six feet thick of solid ground and you know they don't build them that way and today they use like plastic, right? And this is an amazing, one of the most beautiful buildings in Washington.","And for years it was the post office and you always say, I always say to people,\" If you can get the post office in a city you always get the best location because they're always there first.\" And this is the one for Washington. So they put it out to bid and every was one of the most hotly contested projects ever in the history of the GSA, Government services where they sort of the landlord for United States real estate.","Big landlord. And they chose us. And it's a great honor because we were chosen in the Obama administration which is sort of amazing. A lot of people thought we wouldn't be able to get it. But we had -- we have a great financial statement. I want to make sure it gets done. And we have a great track record for this stuff and we're building now a hotel, 300 rooms that is going to be, I think one of the great hotels of the world.","We're a year and a half ahead of schedule even more than that but we're a year and a half ahead of schedule which is a little unusual when you're talking about governments because they're never even close. But we're one and a half years and we're under budget and it will open in September of this year and we're supposed to open up in September and two years from now.","And I thought I could do something you know we really have a great team. Eric and Don working on it and Ivanka is really in charge of that one and she's done an amazing job and it's going to be one of the most beautiful hotels. I think it'll be one of the great hotels of the world.","Well, I would do that and we expect to cancel many of the executive orders that were passed because you know Obama has not been able to run things the way you're supposed to run. He's supposed to get the congressmen in, the senators in. You're supposed to make deals like Ronald Reagan, Tip O'Neill they were opposites but they made deals and they liked each other.","I will say this Pat, I've been involved in politics for a long time all my life. I've gotten tremendous zoning changes I deal in politics in other countries because we're building all over the world and we have jobs going up all over the world, a lot of jobs. But I have never seen division like you have now.","You know it used to be in a good old restaurant in Washington. You'd see a Republican having dinner with a Democrat and they're best friends. You don't see that anymore. This hatred, the country is so divided, whether it's African-American, white, Congressmen, Democrat or Republican. I mean it's just like we have a whole divided country.","I've never seen anything like it but we used to see and I used to be part of Democrats and Republicans having dinners together with their families and their wives. And it was a nice thing and then you know they'd be in combat the next day, but there would be they get along and they'd get things done. So today we have a president that can't get anything done.","And he signs executive orders. So one of the first ones I'd knock out is his executive order and the Second Amendment where he's chipping away at it which is so important, the Second Amendment and the other one would be the one on the border where basically he wants people to pour into the country unchecked and the courts have been following that one and amazingly we had a couple of pretty good decisions, so far.","But it's still out there. So I'd saved the legal fees frankly I'd get rid of it and knock it out very fast but because we do have to and I know you believe in this you have to have strong borders. If we don't have strong borders. You saw the pope came out against me a little bit but that was before. He was very nice because the next day he issued a statement.","Very bright, very bright. It was right. I mean he was told probably that, \"Oh you have this man named Trump. He wants to create very strong borders and he wants to build a wall.\" We've got to build a wall. We're going to build a wall. Drugs are pouring across the border. People are coming in just like -- it's like we don't even -- we don't even have a country.","You don't have a border, you don't have a country. So but he was -- he was good. He was a little bit strong at first. Sort of interesting because that's the day before the election, right? And I said to myself \"Oh no.\" And my people came up to me. They said, \"Mr. Trump, the pope just made a big statement about you.\" I said, \"Good or bad?\" Now you have to say it, we have the election like the next morning.","So is it good or bad? They said, \"Not good.\" I said , \"Oh, this is a disaster.\" And it turned out to be that, you know, he talked about the border and he did mention the wall and then I said the first thing I thought of, I said, \"But I've seen the Vatican that's the most incredible wall. That wall goes up to that ceiling, right?\" I said, \"What about this?\" So I think he actually took a little heat.","He actually was very, very nice the next day. You know nobody explained to him about the crime. Nobody explained to him about the drugs pouring across -- and the economy. And he was actually very nice. But it was a very interesting period. You don't want to hear the day before the election that the pope said something about you this time.","Well no other than and I think I could add to it a lot though because I'm going to bring jobs back to the country. Our country has been stripped. We've rebuilt China. And again I like China. I think China is wonderful. I'm not angry at China. I'm angry at our representatives, our people our president for doing such bad deals and not just Obama.","This goes back. You know this isn't just now but Obama's been horrible and others have been also. And so I'm not upset with China. I have them as tenants in my back. I have the biggest bank in the world as a tenant in one of my buildings in Manhattan. I sell millions and millions of dollars' worth of condominiums to the Chinese so I can't be angry at them.","Same thing with Mexico. I mean I have great relationships with Mexico. Problem is, in both cases, but really in all cases, all countries. Every country is killing us because we have people that are political hacks that are negotiating trade deals and know nothing about it and they have the smartest, sharpest people that they pick out when they're practically three years old.","Do you understand that? They go up this pyramid chain and they pick them out very early and our people cannot deal with it because we're not using -- we have the greatest business people in the world. We don't use them. So Carl Icahn as an example endorsed me, many of the business people endorsed me. The great ones and we're going to use the greatest business people to negotiate trade deals and we're going to not be losing this kind of money.","We have horrible, horrible deals with Japan and everyone else.","Yeah. Well, I would start with China.","Because China has absolute power. The stuff comes through China. I'd also -- I would have done Iran but I don't think you're going to get anywhere with Iran now, because they're a hostile nation. They took our money. They spent the money. They bought 118 Airbus planes instead of Boeing's, OK. In other words the money goes to Europe.","They bought a lot of things in Italy. They bought a lot of things all over Europe and they've bought missiles which I didn't know they had the right to buy. They bought a lot of missiles from Russia. They gave us nothing. We gave them $150 billion. Out of $150 billion, they've spent a lot of it. Nothing goes to the United States.","I would have been very strong in the negotiation that Iran has to push them and I would have been -- I would now be very strong on China because again, we have a lot of power over China because China takes out so much money.","Again, I said before $500 billion trade deficit with China. Can't do that. How can you have a country if you do that? So, I hate to tell you, folks. You need somebody like me. I'm good at this stuff. Did you know -- you know Pat, that the politicians don't even know about it. They don't even know, they don't even know what it means.","They really don't. They talk about free trade. I'm a free trader. But you get a smart trade too. You have to have intelligence here. And I say there'll be taxes, like Carrier. I was just saying Carrier's moving over to Mexico. They're going to make air conditioners. They are going to sell them to us, no tax, no, nothing.","So we lose 1,400 jobs. They move to Mexico. They build a plant. They employ Mexican people, which is fine. They make air conditioners. They sell. I would tell them, \"Here's the story folks, here's the \" and this is the only thing you can do to stop it. I mean, in all fairness. \"Here's the story. You're going to make air conditioners.","We wish you a lot of luck. I hope you build a nice plant. Enjoy yourselves. But every time you put an air conditioner into this country, you send in air conditioner, you're going to have a 35% tax.\" They're not going to move. They're not moving, because you have to do it. That's called Now Pat, there are people that would say, \"Oh you're not a conservative.\" Well I'm the most conservative guy in many ways.","But you have to be smart. Otherwise, everyone's going to move. We're not going to have anybody left. You know, you know the kind of thousands and thousands of factories have closed in our country. And Pat said it before, corporate inversion. You have people that can't get money back in that they have. And they're actually moving companies not only because their taxes are too high but they're moving companies out of the United States like Pfizer.","Pfizer's a great company. They're moving out thousands of jobs. They're moving to get money because there's $2.5 trillion outside of the United States. They can't get it in. And yet the Democrats and the Republicans agree to bring it in. So all you have to do if you're Obama is sit down with both. Within 10 minutes, you should make a deal -- there's a case where everyone agrees on that guy.","I can't tell you the story. But I -- I mean I liked that example because -- so there's 2.5 trillion. I think it could be five trillion. Could be more than that. But you know the government says two and a half but they don't know. They have no idea. If they say two and a half it's probably much more. But here's a case where Democrats and Republicans are in total agreement.","You know it's one thing, they disagree on health care. They disagree on all these other things and we get it. All the right stuff. But here's something they all agree on. We want the money back in our country. You know what's not to agree on, right? So you can work on a little tax. A little less, a little bit but it should be -- it should be 10 minutes to solve that problem.","So they agree here. They agree here. The money is going to come back in. No deal. They've agreed now for three years. And what that is, is leadership. If I were president I would get them all in an office, big office and if I would say, fellas we're going to make this deal. Folks, because we have a lot of women now and that's good.","We have to make this deal. We have to make this deal and let's get it done. I think you'd have it done in a half hour. But you need leadership. You know you can't fly to Hawaii to play golf on a Boeing 747. Talking about the -- talking about the carbon footprint. You know Pat, he talks about the carbon footprint, right?","And then he gets on a 747 to play golf and spews that stuff and comes back a long time later. It wasn't like he came back the next day, comes back, played a lot of -- he plays a lot of golf. Well, sorry. But you got to get people into an office and you've got to make deals.","Three? It could be four.","Well, we have some good ones. We have Judge Alito, who's terrific. Terrific. We have Judge Thomas, who I think is a terrific judge. Real strong, very, very good guy. And we have some that didn't work out as well. I mean if you look at Justice Roberts, he could have killed Obamacare twice. No matter what he does, it's like you know, he was appointed by Bush.","By the way, I will tell you that Senator Cruz is the one that pushed him. He was the one that most wanted him. In fact he wrote editorials. But you've got to have Roberts. You've got to have Roberts and Justice Roberts was in a terrible, terrible situation because he approved Obamacare when everybody said it was going to be terminated.","He has the vote that said, \"We're going to keep it.\" It was then he had a second time at it which would have also killed it and he passed it then too. And some of the other judges, other conservative I mean the rumors are that some of them wouldn't even speak to him. But what he did was terrible. Now he was a Bush appointee and he was really proposed.","He was the one that pushed him harder than anybody was, Cruz, Senator Cruz. And so Senator Cruz gave us Obamacare in the true sense because any good can it's true, it's true. In fact, you have you have right now -- they have editorials where he wrote -- he wrote actually papers on why he should be the one chosen, signed by Ted Cruz.","So, I mean he has been -- no matter what he does. He's been a disastrous judge because Obamacare is killing everybody. It's killing everybody.","Pro-life. We want -- we want, starts with that. Starts with that. Very conservative, very, very smart. I mean like Judge Scalia would be a perfect, you know that, he was like a perfect -- he was a perfect representative. I've always said that Justice Thomas. Does he get enough credit? He's a wonderful man.","He is. He's a wonderful man. He's a wonderful guy. And I've always said it. And as I said Judge Alito is a terrific guy. So, in that realm is what we're talking about. For me.","Thank you, David.","I heard that.","I see a lot of people up there. It's beautiful.","I can forgive. I mean, I'm pretty good at that. I do have every once in a while there'll be somebody that went too far and I won't like it. I mean you've been hearing what I've been saying over the last few weeks. And you know things were said that were lies, frankly, there were real lies and I won't mention because I can't mention in Pat's presence.","I don't want to. I've got to I've got to be a good person today at least for the next hour. I'm sorry. But there have been many -- there have been many untruths told and you know just knowing, knowing. I mean, I think what happened to Ben Carson was terrible when they said, \"He left the race. He left the race.","Here, come on over vote for me.\" That affected me, too because I think I would have won Iowa, if you want to know the truth. But we're doing OK. We got a second and three first. So, I'm not complaining. But I like four first, I want four first. But you know what happened to Ben Carson? What happened there was horrible.","The noticed violation, the you know, they called it the auto bailout. That's like a fraudulent document that was sent. So there have been some bad things happening out there. And I tell people real estate is pretty tough. In real estate in Manhattan. You meet some tough people. These politicians are not such good people.","Well you know it's interesting as a one of the magazines said Donald Trump is a world class businessman and it was sort of interesting. I'm all over the world. And I deal with all politicians and honestly I never thought I'd be doing this. I just got exasperated. I would have done it four years ago. I looked at it very seriously with Romney.","I was actually leading in the polls. And I decided -- I had a lot of jobs going. My children were younger and now they can do a great job and I have excellent executives. But, but. It's this is not something I really was going to do or really wanted to do. I loved what I was doing. The fact is that as a businessman you get along with all politicians or you have a problem.","So I get along with Democrats. I got along with liberals and conservatives and Republicans. I got along with everybody. Because that was my thing. You know it was very important. I got along with Bob, where's Bob? I saw Bob in the audience. Where is he? Where is he? By the way, and a fantastic person, OK. You know that.","Stand up, Bob. He's a fantastic person and but I get along with everybody I get along with them and that was important and I tell people and people would forgive me for that. They'd say, \"Well you know it's true.\" But as a businessman, you want to get along with Democrats, Republicans, everyone. And I think for the most part, you know, that's been used on me and I understand it but once I explain it. Most people understand.","Actually there are some names that I've gotten the respect that, you know, that have been. We'd started off with 17. We're now down to five. And you know some of the people that I've dealt with, I do have a lot of respect for and I like. Look, the main quality that you want is somebody that can be a great president.","If something happens to you, that's got to be don't you think? That's got to be number one. And then I would want somebody that could help me with governments so most likely that would be a political person, because you know, I'm businessman and I'm very good at what I do and all of that. And I'm also very, very political.","You've seen me when you can get zoning on the West Side of Manhattan, to build almost 6,000 units of housing and you have to go through New York City politics. Believe me. That's is tough. I don't say Israel -- Palestine. But it's about as tough a deal. It's about as tough a deal. I view that as the single toughest deal.","Anybody can make that deal. And we're going to give it a shot, OK. We're going to give it a shot. But a lot of good people have gone down trying to give that one a shot. But, the most important thing is you have to have somebody that can be a great president. But after that, you want somebody that can help you with legislation, getting it through etc., etc.","So I would say without -- it's too early. I'm not thinking about it a lot. I'm thinking about getting the ball over the line and you know, get this thing done and it's a very interesting thing because some people know how to do that. Some people don't. But I do want somebody that's political because I want to get lots of great legislation that we all want passed.","It's just sitting there for years and years and years. We have things sitting there that would be so good, including proper health care and other things. So we're going to -- we're going to probably choose somebody that's somewhat political.","Well it's an amazing question because you know there's a six-year statute of limitations, might be five but probably six. And the answer is, I would have. I would instruct them to take a look at it, you know, because it's not really our call to say indict.","But certainly you would have to take a look at it because you look at General Petraeus, who suffered greatly. They gave him two years, suspended and lots of things. They wanted to take his rank away from him. I fought that very hard. I said, \"This man suffered enough. Why didn't you focus on beating ISIS instead and leave General Petraeus alone?","Just leave him alone.\" I think -- I think it helped him. But they want to cut his rank way down and a lot of other things they want to do. But you know he suffered greatly over this and what he did is nothing compared to what she did. So I would instruct my attorney general, \"Please look at it and if there's something there.","There seems to be a lot there, because you know every day we see people and we read about people that are experts in the field and there. How often you see somebody saying she did nothing wrong. They're all saying she did something very wrong but they're protecting her because she's the number one runner and she's saying, \"How wonderful Obama is.\" Do you ever see anything like it? Every single thing that he wants to do, she is saying \"Great.\" So she's doing it for that reason. Believe me folks."],"text":" Thank you very much. Thank you everybody. Thank you. So nice. Thank you very much. Please sit down. So we had a very exciting evening last night and I went all around. You know the word caucus? It's a little complicated because you don't know how it's going to work out. And they say it's hard to poll but we polled fine and we really won big last night. So we ended up getting 46% of the vote. And you know during the day I was walking, I saw all these people and they're all saying, \"Donald! We love you Donald! We love you!\" but you never know what's going to happen. And as soon as we turned on the television last night when the results started coming in, it was obvious from the beginning. So we had a really extraordinary night. And one of the things that made me so happy is we -- what we, as you saw, we totally won with evangelicals. I mean we were big league with evangelicals and it was, it was such a good thing. And we've worked very hard. You know I'm a Presbyterian. I'm Protestant and there really is and I was going to talk to Pat later on who is a great gentleman by the way over the years I've met him, I've watched him the job he's done over here is incredible. And I just have to tell you it's an honor to be with Pat and I look forward to having him grill me. He'll probably be grilling me. But he's a great man and a great guy and I've known him really. The last time I was with him was about four years ago. I was getting an award, the Boone Pickens Award for Entrepreneurship and Pat was there and I got to know him a little bit and it was, it was really great. So I think the reason we've been doing well and doing quite well in the polls and leading by a lot with almost everybody is that I talk about what we have to do for our country and our country is in deep trouble. We owe $19 trillion. Most people don't even know what a trillion dollars is. You know, how many hundreds of millions is in a trillion? It's such a number and you know it's a name that 10 years ago you'd never even heard the word trillion. But we owe $19 trillion, a very bad budget was passed just about four weeks ago. That's going to add at least two trillion to it. So we'll be up essentially to $21 trillion and you know at a certain point this is really the point of no return. And you really have to have somebody that knows what he or she is doing. And I do know what I'm doing when it comes to business, I know what I'm doing. It's been an amazing period of time for me. It's been great. In fact, my two sons are backstage. Maybe I'm allowed to bring them up because I'm very proud of my boys so maybe I'll bring them. Maybe I'll bring them on. Good. That's beautiful. This is Don and this is Eric. They were with me for the last week and they go around making speeches and this way. I'll send them they do a better job than me anyway so I go into the room and I watch television, you know and they say the Trumps are making the speeches. Say \"Hello Don.\" Well, thank you very much. It's great to be here. It's nice to be able to be a proxy for him because we know what he feels about this country. We know the values that he's instilled in us growing up. Education, family, work ethics, all of these things that are often lost on children of similar fortune. You don't read about many children that came from the kind of wealth that we were able to brought up with in the way that you perhaps read about us and I won't talk about myself that way but I'll talk about my brother and sister that way. So those are all things that he doesn't get credit for. Those are the things that you don't see. Those are the things you don't see when he's a father, when he's now a grandfather to my five children. It's really incredible that he likes to talk about business and he's phenomenal at that. But if you knew the real Donald you'd also see something really special. He's an incredible guy and we're just thankful that he's doing this for not only ourselves, our children behind them but for everyone in this country because he'll do a phenomenal job. You know, to reiterate -- to reiterate what you know, Don really said he's been our best friend. He's been our mentor. He's just the greatest. We've walked across table with him for the last 10 years building hotels and golf course and everything all over the world and you know everything he touches turns to gold. I say that all the time but everything he touches turns to gold and you know that's the touch that this country needs. It really is and there will be no better commander-in-chief. I said a long time ago I said it three, four months ago that we're going to win this thing and I really think we are and he will be such a great president so we're proud of you Paps, we love you to death and we'll give it back to you. Thank you. Thank you, sweetie. So a lot of times people ask me to speak about success. Friends of mine and they'll even make big payments and we give it to charity and stuff but I'll do it. And so often I'll say, \"You know the really successful people are the people not with the great wealth but with the great families where they have great kids and wives and husbands and those are the people that are the happiest.\" And I don't know if I'm speaking against myself here but the fact is, you know, you can have it. I know the most successful people in the world. I deal with them all the time. I know and I know I'm in many cases very well. These are not the happiest people generally, a couple of happy. Not too many because you know, no matter how successful, they all want more, more, more. It's never satisfied. And I guess, I get a little bit guilty of that also. But the fact is, that the happiest people I know are the people with great families, have loved their families and when their families loved them. So, it's something I talk about during the success seminars and a lot of times the people running the seminar don't want to hear that. That's not exactly what they want to hear. But I have to be truthful. So and there's a good example. I have two really great boys. I have five children altogether and they're all then -- they've been fantastic. You know Ivanka? Most of you know Ivanka's going to have a baby in about a week. We've been waiting. We thought Iowa, we thought New Hampshire, right? We thought South Carolina. We thought Vegas would be an interesting place to have a baby. A much different deal, but she probably like it during the next week or two she'll have a baby and she's been spectacular to have Tiffany and have Baron and they're all -- they're all very good kids. So, hopefully they'll stay that way. Where's wood? I think I should knock on wood. I have to find some. Wait. Is anybody superstitious? Oh that's real wood, too. That's not -- that's the real deal. So anyway, they're good kids and it's really great. What we have to do and I think the reason we're resonating is we have to straighten out our trade deals. They're horrible. With China, we lose in trade $500 billion a year. What kind of a deal is that? With Japan, we lose hundreds of billions of dollars. It's much smaller than China but hundreds. We owe Japan $1.6 trillion. We owe China $1.7 trillion. Sort of an amazing thing, right? They take our money and then we owe them money. They take our jobs, we owe them money. They take our factories. You have no idea how many are closing up and have closed them. And I have great relationships with China. I have great relationships with Japan. I have great relationships with Mexico. But Mexico is killing us at the border and they are killing us in trade. You know, you read the other day were Carrier's moving into Mexico. Did anybody read that story? I thought it was very sad. Carrier, the maker of air conditioners, and they're moving in and they released 1,400 people and I guess somebody had a cellphone going which I'm sure Carrier was not thrilled with because it went all over the world. And the executive was standing up saying we're closing up and we're going to move, too. All those jobs are gone and we're going to move to Mexico. And I said to myself, \"What does that help us? How does it help us?\" So they're going to make air conditioners. They're going to sell them across the border, probably have illegals walk them in because it's cheaper that way and nobody, nobody checks them. Nobody checks them. So you know just every illegal gets an air conditioner. Walks across. Oh, Ford does the same thing. You know they're probably, when they, you know, Ford is building a $2.5 billion plant and they'll have illegals drive the cars across the border. So it's very sad. Honestly, it's very sad. It's so, it's so bad that sometimes you have to laugh. You can't even believe it. So, Ford is building a massive plant. Nabisco is moving from Chicago into Mexico. I mean Mexico is literally the new China. They're taking our business, is going to become the car capital of the world. They took a plant out of Tennessee. It was going to -- it was scheduled to be built in Tennessee and boom! Tennessee is such a great place. They took it. Last moment it decided, it's going to Mexico. So we have to do something and we have to have borders. We have to have strong borders. If we don't have borders we don't have a country and people can come into our country but they have to come in legally. They can't do what they're doing. We have right now 179,000 illegal immigrants who are criminals, who have criminal convictions. That means all 178. Think of that. That's like filling up Yankee Stadium four times. We have all over the country. These are criminals. This is not just you know, these are people that were convicted of a crime. So we're going to be very strong in the borders, we're going to be very, very strong in trade. We're going to be very strong in protecting our Second Amendment. We're going to get rid of Common Core which is basically education through Washington which is a disaster, by the way and you understand that. And we're going to get rid of Obamacare. Obamacare is totally turned out to be a total disaster and it's really hurting our country. It's really hurting our country because you have so many part time jobs right now because people don't want to register under Obamacare and you have part time -- everyone has part time jobs. I mean you look at these people. They never had a part time job in their life and now all of a sudden companies are putting them on part time and now they have to go get a second job. So it's a very unfair thing and we're going to get rid of it. We're going to come up with a plan. There's so many different plans whether it's the health care savings accounts or we have to get rid of the lines between the states that's only there for one reason because all of these politicians that I'm running against and more are taken care of by the insurance companies and they're taken care of by the oil and gas companies and they're taken care of by everybody. I'm the only one, that's not. You know why I'm not? Because I'm self-funding. I don't know if that's smart or not so smart but as a big contributor I've been over the years a very big contributor. I understand. I mean I understand what it takes. We have a situation right now with drugs. we don't bid our drugs. Can you believe it, the United States is the largest drug buyer in the world. Drugs to make you better, pharmaceuticals and we don't bid it out. And a friend of mine who's a doctor, great guy, came up to me and said, \"Donald why don't we? I don't understand it.\" Well once I found out what he was talking about because it's not my world. I knew exactly why. Because the pharmaceutical industry takes care of all the senators and all the congressmen, have a very strong lobby and they don't want to bid our drugs. If you bid them up we'll save $300 billion -- $300 billion and we don't even do it. We're going to do it because what happens if I'm there, they'll be calling, \"Donald you can't do that. You can't do it.\" Trust me I can do it. They can't do it, because they've been given millions of dollars. You don't know how corrupt it is and I guess it's called legal corruption but you don't know how corrupt it is and whether it's timber industries, anything. I'll do the right thing. By the way I'm going to be great for industries too but I'll do the right thing. But we have to straighten our country out. One of the other things bigger than that is military. I mean for years we've been seeing the military and we see I've been reading about it for years where they order a plane that they don't want or they order missiles that they don't want. They want a different one because the company making that missile has more political influence. So they're ordering things that even the generals don't want and they're ordering too much equipment and they're ordering the wrong equipment. Those days are over and we're going to make our military bigger, better, stronger than ever before. We need it more than -- it's the cheapest thing we can do by the way. And nobody is going to mess with us. I don't want to use it. Nobody is going to mess with us. Remember I'm the one -- I didn't want to go into Iraq. It was one of the worst decisions ever made and we lost $2 trillion. Thousands and thousands of lives, thousands of lives. We have wounded warriors who I love, all over the place. And what happens, Iran is now taking over Iraq. When you think of how Iran is doing lately right between the Iran deal we get $150 billion. We got nothing for it. We should have gotten our prisoners back long before we started negotiating. And all you do is say, \"Listen, we're not negotiating until we get our prisoners back. We can't.\" And they'll say no and you leave the room. They didn't leave the room. They never left. They just stood there. Kerry he's the worst negotiator I think I've ever seen. He never left the room. But all you have to do is say, \"We need our prisoners back.\" This is like four years ago when they started this longest negotiation I've ever seen, too. But you say we have to have our prisoners back. They're going to say, \"No, the Persians, I mean, fact and tell you that the Persians are great negotiators and they're smart and it's tough. But you go and you say, \"We need our prisoners back. You don't want them. You don't need them. Your people don't even know they're there.\" We need them and we got to have them and we'll make a better deal because it's easier. So then they'll say, \"No.\" I will leave the room. I'll say, \"Bye-bye.\" And then we double up the sanctions. And within 24 hours they are going to call and say, \"You got your prisoners back.\" Right? Then you go in for seconds because you have to do this. So you go in and you say, \"Listen\" and I tell the story which is so cute. My father was a very good negotiator and he thought I was too rough. He thought -- he said, \"Too tough, you're too tough. You kind of just take the lumps out.\" He used to use, the expression. He'd always go like this when he said -- he'd say, \"Son, take the lumps out.\" So if I didn't have my father I would have said this. We're not giving you the $150 billion. So they'd be over there and they'd be angry and you know, probably never bring it back. But I'd say it very tough, \"We're not giving it to you.\" But now I learned so much from my father. So I take the lumps out and so now say, \"Listen, we have a problem.\" Now, in the meantime, our prisoners back, they landed, I'd say, \"Did they land yet?\" No, I won't say it yet. Let's wait till the next day. \"Did they land?\" \"Yes. They just landed on American soil.\" So now I say, \"Fellas we have a problem, big problem. We have a country not doing well. We owe $19 trillion. Essentially we're bust. Got no money, we got no money. We just had a budget approved for $2 trillion with 21 trillion. We have no money. Fellas, we can't give you the $150 billion.\" They're going to go crazy. They're going to go crazy. One day, one day and now I'd say, \"I'm sorry. I want to give it to you so badly. You have no idea. I'm dying to give it to you but I can't. We don't have any money.\" So that's better than saying, \"We're not giving it to you.\" Right? Do we all agree? Just the same effect except this way, they recover faster. They probably both work. I know the second one works, the first one you know, you could end up in a position. It's going to be a long time before you stand. No way I would have given them $150 billion. No way in a million years and one of the saddest things is, the money's gone. And by the way two days before the money left see, The Art of the Deal. Hold that book up. See? The Art of the Deal here. Is there everyone who didn't read the Art of the Deal? Everybody is. But I always say the bible is much better. There's not a contest, right? Because that's one of the great books but the bible is much better. I know. So there are so many -- not even close. Do we agree? I will tell you, right? We agree. But the Art of the Deal has been a great book. Obviously Kerry did not read The Art of The Deal. Probably didn't read the bible either. But these are -- but it's a very sad thing that whole that whole episode with Iran is a very sad thing and then two days before the money is sent, they capture 10 beautiful young sailors. They put guns to their heads. They're roughed them up in terms of at least mentally. They were devastated and they humiliated our country. They humiliated the 10 people, one woman and nine men and that's the work that's what we're dealing with. Not going to happen anymore, folks. Not going to happen anymore. We're going to do we're going to be the smart country instead of the dummies that everyone laughs at. They laugh at us because we have people that don't know what they're doing. Like Sergeant Bergdahl, we get Bergdahl, a traitor. They get five killers that they've coveted. They're wanted for nine years and those five killers are back on the battlefield or soon will be. But these are the ones they wanted, these five. So we knew he was a traitor before we made the deal because at a general and a colonel interviewing all of the people that he worked with in the military. They knew he left. Six people died, looking for him. Five, definitely, probably six died they went out looking for him. They tried to get him back. He left and we get -- that's the way we negotiate. We get Bergdahl, they get five great killers for them, the people that they want. Not going to happen anymore, not going to happen. So I tell these stories and I go around and I meet with crowds and we have tremendous crowds. We have by far, the biggest crowds far, far, far bigger than Bernie and Bernie is heading down now, I think. Bernie looks like he's over and it looks like Hillary is going to be protected from the email scandal by the Democrats. I mean can you believe it? So many people for doing much less than she did, are in prison. And just you know, devastated. No, think of it. Think of it. For doing less than she did and she looks like she's just going to be you know, she's gonna point at you. Did you ever see anybody so nice to the president, though? \"Oh, the president is wonderful.\" she says \"Oh, the president is great. Whatever -- he wants to do this. Oh that's wonderful. Whatever you want.\" You know why she's doing that, right? You know why I know why? Boy, oh boy she's become like a marshmallow. She's become she's everything he does. \"Oh it's wonderful. Whatever he wants to do is wonderful. The president \" Man, I couldn't be there. Her life cannot be so easy. But she is what she said is so wrong and it's so unfair and it looks like she'll be the nominee and it looks like nothing will happen but it'll be something that will be discussed. I promise you it will be discussed often, often, often. So with that, I think we're really doing well. Looks like we're in a great trend and we have tremendous support and we have amazing people in this country. And one of the most amazing people in the whole country is our great friend, Pat. Will you come out here, Pat? Look at him. One of the great people. Thank you. Man, it's good to have you here with us. You inspire us all. It's great to be here. Good. Good morning to be here. Supposing I lost, I probably wouldn't call. \"Pat, I don't ever want to be there today, right?\" We had a great -- we had a great evening. A great evening. But let me ask, you're working on a project here in Washington on Pennsylvania Avenue, the Old Post Office building. Everybody wanted it. But you got it. The Art of the Deal. What did you do? Well, it's a great building. It's the old post office built in the 1880s. It's an amazing building with walls that are five and six feet thick of solid ground and you know they don't build them that way and today they use like plastic, right? And this is an amazing, one of the most beautiful buildings in Washington. And for years it was the post office and you always say, I always say to people,\" If you can get the post office in a city you always get the best location because they're always there first.\" And this is the one for Washington. So they put it out to bid and every was one of the most hotly contested projects ever in the history of the GSA, Government services where they sort of the landlord for United States real estate. Big landlord. And they chose us. And it's a great honor because we were chosen in the Obama administration which is sort of amazing. A lot of people thought we wouldn't be able to get it. But we had -- we have a great financial statement. I want to make sure it gets done. And we have a great track record for this stuff and we're building now a hotel, 300 rooms that is going to be, I think one of the great hotels of the world. We're a year and a half ahead of schedule even more than that but we're a year and a half ahead of schedule which is a little unusual when you're talking about governments because they're never even close. But we're one and a half years and we're under budget and it will open in September of this year and we're supposed to open up in September and two years from now. And I thought I could do something you know we really have a great team. Eric and Don working on it and Ivanka is really in charge of that one and she's done an amazing job and it's going to be one of the most beautiful hotels. I think it'll be one of the great hotels of the world. Now let's assume that you run the team will and that you are about a year from now that you've got your hand on the Bible and you're swearing an oath before the chief justice of United States and then you're president. At that point. You're in. There's a little office underneath the Capitol where you can go to and by the stroke of the pen you could cancel a great many of the executive orders of your predecessor. You don't need Congress Executive Order you know. What would you do? Well, I would do that and we expect to cancel many of the executive orders that were passed because you know Obama has not been able to run things the way you're supposed to run. He's supposed to get the congressmen in, the senators in. You're supposed to make deals like Ronald Reagan, Tip O'Neill they were opposites but they made deals and they liked each other. I will say this Pat, I've been involved in politics for a long time all my life. I've gotten tremendous zoning changes I deal in politics in other countries because we're building all over the world and we have jobs going up all over the world, a lot of jobs. But I have never seen division like you have now. You know it used to be in a good old restaurant in Washington. You'd see a Republican having dinner with a Democrat and they're best friends. You don't see that anymore. This hatred, the country is so divided, whether it's African-American, white, Congressmen, Democrat or Republican. I mean it's just like we have a whole divided country. I've never seen anything like it but we used to see and I used to be part of Democrats and Republicans having dinners together with their families and their wives. And it was a nice thing and then you know they'd be in combat the next day, but there would be they get along and they'd get things done. So today we have a president that can't get anything done. And he signs executive orders. So one of the first ones I'd knock out is his executive order and the Second Amendment where he's chipping away at it which is so important, the Second Amendment and the other one would be the one on the border where basically he wants people to pour into the country unchecked and the courts have been following that one and amazingly we had a couple of pretty good decisions, so far. But it's still out there. So I'd saved the legal fees frankly I'd get rid of it and knock it out very fast but because we do have to and I know you believe in this you have to have strong borders. If we don't have strong borders. You saw the pope came out against me a little bit but that was before. He was very nice because the next day he issued a statement. He realized, he had a pretty big wall around the Vatican. Very bright, very bright. It was right. I mean he was told probably that, \"Oh you have this man named Trump. He wants to create very strong borders and he wants to build a wall.\" We've got to build a wall. We're going to build a wall. Drugs are pouring across the border. People are coming in just like -- it's like we don't even -- we don't even have a country. You don't have a border, you don't have a country. So but he was -- he was good. He was a little bit strong at first. Sort of interesting because that's the day before the election, right? And I said to myself \"Oh no.\" And my people came up to me. They said, \"Mr. Trump, the pope just made a big statement about you.\" I said, \"Good or bad?\" Now you have to say it, we have the election like the next morning. So is it good or bad? They said, \"Not good.\" I said , \"Oh, this is a disaster.\" And it turned out to be that, you know, he talked about the border and he did mention the wall and then I said the first thing I thought of, I said, \"But I've seen the Vatican that's the most incredible wall. That wall goes up to that ceiling, right?\" I said, \"What about this?\" So I think he actually took a little heat. He actually was very, very nice the next day. You know nobody explained to him about the crime. Nobody explained to him about the drugs pouring across -- and the economy. And he was actually very nice. But it was a very interesting period. You don't want to hear the day before the election that the pope said something about you this time. We've had a massive deficit and we're running a deficit every year and the wasteful spending is out of control. There was a commission, Senator Simpson and Erskine Bowles got together and gave him very reasonable proposal. Have you in the . We've got to have some way of cutting the spending now. Well no other than and I think I could add to it a lot though because I'm going to bring jobs back to the country. Our country has been stripped. We've rebuilt China. And again I like China. I think China is wonderful. I'm not angry at China. I'm angry at our representatives, our people our president for doing such bad deals and not just Obama. This goes back. You know this isn't just now but Obama's been horrible and others have been also. And so I'm not upset with China. I have them as tenants in my back. I have the biggest bank in the world as a tenant in one of my buildings in Manhattan. I sell millions and millions of dollars' worth of condominiums to the Chinese so I can't be angry at them. Same thing with Mexico. I mean I have great relationships with Mexico. Problem is, in both cases, but really in all cases, all countries. Every country is killing us because we have people that are political hacks that are negotiating trade deals and know nothing about it and they have the smartest, sharpest people that they pick out when they're practically three years old. Do you understand that? They go up this pyramid chain and they pick them out very early and our people cannot deal with it because we're not using -- we have the greatest business people in the world. We don't use them. So Carl Icahn as an example endorsed me, many of the business people endorsed me. The great ones and we're going to use the greatest business people to negotiate trade deals and we're going to not be losing this kind of money. We have horrible, horrible deals with Japan and everyone else. You know there was a law passed Sarbanes-Oxley and the numbers of appeals that have been brought forth since then have been drastically curtailed. Now we've got the inversions where people go from Ireland to Canada. They have some low tax and put their headquarters there. And yet our tax burden on corporations is probably the highest in the world. What are you going to do with them? So we have the highest taxes in the world the United States. Think of it with deficits like this and yet we have high taxes. I'm cutting taxes very substantially for businesses we're going to bring businesses back. We're going to bring our jobs back. We're going to make sure that you know look, China is one of the great money currency manipulators in history. Ever, ever. There's nobody ever like this. Japan is really good but China's even better. And they have done a number on us with, with manipulation, with devaluations. In fact our dollar goes up and everyone says oh isn't that wonderful In the meantime look at Caterpillar they can't sell their tractor. It's a very bad situation going on. So, and they have no fear of us, they have no respect for us anymore in the South China Sea. Just before I left I was watching where they're building this massive, massive military complex in the middle of the South China Sea. They are not supposed to be doing it, but they're doing it because they don't respect our president. They don't. I mean he gives them state dinners when they come over and he has no -- they have no respect and we have a lot of power over China. We just don't know it. We have people that don't know it. The power is straight. We've rebuilt them. They are taking so much money out of our country. What they've done and I said it's the greatest robbery in the history of the world. What they've done. We've rebuilt China. You just take a look. We have rebuilt. They've taken so much money and we have to stop it. And we have to use our power because we have a lot of power because of trade. We have to stop it. And we can get them to do things like they have to solve the North Korea problem. We have a North Korea problem that you probably know better than I do because I know that's also part of the world that you look at. But we have a big problem. You know they don't exist without China. But China \"Well we don't have that kind of control.\" They're just toying with us have total control over him. The other one that does is Iran. So why didn't we, when we made our deal a month ago. Why didn't we insist that they take care of this guy instead of us going over always going over with the ships and the weapons and the planes and dropping bombs if we have to. And then you have South Korea with who -- I love them. I have buildings in South Korea. But they make a fortune. I buy television sets, I buy tremendous amounts of things from there because we don't make television sets anymore folks that we'd like to make them. I mean we don't make them. We used to make them. You remember Sylvania, RCA. But those days are gone. We're not even supposed to be talking about that because it shows that we're not as young as we used to be. But we don't make it anymore. And here you have an economic behemoth in South Korea. They pay us peanuts. But every turn, we have 28,000 soldiers between North and South Korea who has a dangerous job, by the way, but we have 28,000 soldiers. We get paid peanuts. They make a lot of money and they're good people everything's good. But they have to take care of us. We're not in a position to be the policemen of the world. We have to be taken care of. And so there are a lot of things we can do when we're president. But what are we going to do? How would you specifically go after the North? I mean they're claiming they have thermonuclear weapon. You think that's true? Yeah. Well, I would start with China. Alright. Because China has absolute power. The stuff comes through China. I'd also -- I would have done Iran but I don't think you're going to get anywhere with Iran now, because they're a hostile nation. They took our money. They spent the money. They bought 118 Airbus planes instead of Boeing's, OK. In other words the money goes to Europe. They bought a lot of things in Italy. They bought a lot of things all over Europe and they've bought missiles which I didn't know they had the right to buy. They bought a lot of missiles from Russia. They gave us nothing. We gave them $150 billion. Out of $150 billion, they've spent a lot of it. Nothing goes to the United States. I would have been very strong in the negotiation that Iran has to push them and I would have been -- I would now be very strong on China because again, we have a lot of power over China because China takes out so much money. And the Middle East. Again, I said before $500 billion trade deficit with China. Can't do that. How can you have a country if you do that? So, I hate to tell you, folks. You need somebody like me. I'm good at this stuff. Did you know -- you know Pat, that the politicians don't even know about it. They don't even know, they don't even know what it means. They really don't. They talk about free trade. I'm a free trader. But you get a smart trade too. You have to have intelligence here. And I say there'll be taxes, like Carrier. I was just saying Carrier's moving over to Mexico. They're going to make air conditioners. They are going to sell them to us, no tax, no, nothing. So we lose 1,400 jobs. They move to Mexico. They build a plant. They employ Mexican people, which is fine. They make air conditioners. They sell. I would tell them, \"Here's the story folks, here's the \" and this is the only thing you can do to stop it. I mean, in all fairness. \"Here's the story. You're going to make air conditioners. We wish you a lot of luck. I hope you build a nice plant. Enjoy yourselves. But every time you put an air conditioner into this country, you send in air conditioner, you're going to have a 35% tax.\" They're not going to move. They're not moving, because you have to do it. That's called Now Pat, there are people that would say, \"Oh you're not a conservative.\" Well I'm the most conservative guy in many ways. But you have to be smart. Otherwise, everyone's going to move. We're not going to have anybody left. You know, you know the kind of thousands and thousands of factories have closed in our country. And Pat said it before, corporate inversion. You have people that can't get money back in that they have. And they're actually moving companies not only because their taxes are too high but they're moving companies out of the United States like Pfizer. Pfizer's a great company. They're moving out thousands of jobs. They're moving to get money because there's $2.5 trillion outside of the United States. They can't get it in. And yet the Democrats and the Republicans agree to bring it in. So all you have to do if you're Obama is sit down with both. Within 10 minutes, you should make a deal -- there's a case where everyone agrees on that guy. Why hasn't he done it? I can't tell you the story. But I -- I mean I liked that example because -- so there's 2.5 trillion. I think it could be five trillion. Could be more than that. But you know the government says two and a half but they don't know. They have no idea. If they say two and a half it's probably much more. But here's a case where Democrats and Republicans are in total agreement. You know it's one thing, they disagree on health care. They disagree on all these other things and we get it. All the right stuff. But here's something they all agree on. We want the money back in our country. You know what's not to agree on, right? So you can work on a little tax. A little less, a little bit but it should be -- it should be 10 minutes to solve that problem. So they agree here. They agree here. The money is going to come back in. No deal. They've agreed now for three years. And what that is, is leadership. If I were president I would get them all in an office, big office and if I would say, fellas we're going to make this deal. Folks, because we have a lot of women now and that's good. We have to make this deal. We have to make this deal and let's get it done. I think you'd have it done in a half hour. But you need leadership. You know you can't fly to Hawaii to play golf on a Boeing 747. Talking about the -- talking about the carbon footprint. You know Pat, he talks about the carbon footprint, right? And then he gets on a 747 to play golf and spews that stuff and comes back a long time later. It wasn't like he came back the next day, comes back, played a lot of -- he plays a lot of golf. Well, sorry. But you got to get people into an office and you've got to make deals. One last question, I know David's got some questions from the audience. Scalia, he is a dear friend, here in the region, a dear friend of all of us, and a great justice. The court was in a conservative mode, five to four on a lot of votes anyhow. And now we've got to -- the next president may have Ginsburg, there maybe three judges, three. Three? It could be four. What criteria would you use to select them? Well, we have some good ones. We have Judge Alito, who's terrific. Terrific. We have Judge Thomas, who I think is a terrific judge. Real strong, very, very good guy. And we have some that didn't work out as well. I mean if you look at Justice Roberts, he could have killed Obamacare twice. No matter what he does, it's like you know, he was appointed by Bush. By the way, I will tell you that Senator Cruz is the one that pushed him. He was the one that most wanted him. In fact he wrote editorials. But you've got to have Roberts. You've got to have Roberts and Justice Roberts was in a terrible, terrible situation because he approved Obamacare when everybody said it was going to be terminated. He has the vote that said, \"We're going to keep it.\" It was then he had a second time at it which would have also killed it and he passed it then too. And some of the other judges, other conservative I mean the rumors are that some of them wouldn't even speak to him. But what he did was terrible. Now he was a Bush appointee and he was really proposed. He was the one that pushed him harder than anybody was, Cruz, Senator Cruz. And so Senator Cruz gave us Obamacare in the true sense because any good can it's true, it's true. In fact, you have you have right now -- they have editorials where he wrote -- he wrote actually papers on why he should be the one chosen, signed by Ted Cruz. So, I mean he has been -- no matter what he does. He's been a disastrous judge because Obamacare is killing everybody. It's killing everybody. So one more question. In your selection, as president, what criteria would you use to pick somebody? Pro-life. We want -- we want, starts with that. Starts with that. Very conservative, very, very smart. I mean like Judge Scalia would be a perfect, you know that, he was like a perfect -- he was a perfect representative. I've always said that Justice Thomas. Does he get enough credit? He's a wonderful man. He is. He's a wonderful man. He's a wonderful guy. And I've always said it. And as I said Judge Alito is a terrific guy. So, in that realm is what we're talking about. For me. We've got some questions. All right. They've come in from all around and I'll turn this over to our friend, David. Thank you sir. Hello, Mr. Trump. Thank you, David. Good to see you. Here's a question from the simulcast room because this event is huge, you know, and we've got an overflow room by the way. I heard that. I thought you'd like to know that. I see a lot of people up there. It's beautiful. That's right. We're everywhere. All right. Here's the question. It's about Israel. It's from Kerry from the simulcast room. Support of Israel, a central for continuing stability in the Middle East obviously, and for maintaining a firm stance against terrorism, will you emphatically stand with Israel? Yes. Very simple answer. Yes. They've been our most reliable ally especially in the Middle East. And you look at you know, what's happened with Israel. They were so against this horrible Iran deal. They were so against it. And I tell you what, Obama was the worst thing that's ever happened to Israel. You can look at it. He is not a good president and he's not doing a good job. And you look at Bibi Netanyahu. You look at what he has gone through. I mean you could just see the level of exasperation on that man's face. How they just -- the most basic things, they weren't winning anything. Why did we make a deal like this with these people? And they look at us like they have no respect for us, whatsoever. They can't believe themselves that they were able to get this deal. I don't get it. I mean, I don't get it. There are a lot of theories out there but I don't get it. This will be studied and studied for a long time. And this will prove to be a very bad deal. This will lead to nuclear proliferation, a 100% true and all the money we gave, everything we gave even the keeping of their hostages and you know ultimately, they released hostages $450 billion, they released. So it looks like ransom. The other way it wouldn't have been ransom. The way I said it, it would have been back four years earlier. No, I'm with Israel, 100%. Our next question. This is also from the simulcast room. James wants to know about the Constitution. As president, what will you do to restore adherence to the Constitution by all levels of government? Well I'm a very strong constitutionalist. I mean, I feel so strongly about it and we've gotten away. I mean, frankly I think you could say it. Not giving it a lot of thought, but all these executive orders that's not a constitutional thing and nobody ever saw this. I mean, we have a president who just goes and does a -- spend three minutes trying to talk somebody into it. You'll see he's got a little burden and he just goes and signs an executive order and he says, \"Hey five years later the courts will decide. So it's not the way it's supposed to be. The good thing about executive orders is the new president can come in and immediately void them. That's the one good thing. All right. That's an interesting one. Right from here in the studio audience, from Bernard. During this campaign there have been a great deal of tough a lot of tough language. Among the candidates can you forgive and forget to put it aside to join together and also pick a V.P. choice made from one of these folks that might have been saying a few things? I can forgive. I mean, I'm pretty good at that. I do have every once in a while there'll be somebody that went too far and I won't like it. I mean you've been hearing what I've been saying over the last few weeks. And you know things were said that were lies, frankly, there were real lies and I won't mention because I can't mention in Pat's presence. I don't want to. I've got to I've got to be a good person today at least for the next hour. I'm sorry. But there have been many -- there have been many untruths told and you know just knowing, knowing. I mean, I think what happened to Ben Carson was terrible when they said, \"He left the race. He left the race. Here, come on over vote for me.\" That affected me, too because I think I would have won Iowa, if you want to know the truth. But we're doing OK. We got a second and three first. So, I'm not complaining. But I like four first, I want four first. But you know what happened to Ben Carson? What happened there was horrible. The noticed violation, the you know, they called it the auto bailout. That's like a fraudulent document that was sent. So there have been some bad things happening out there. And I tell people real estate is pretty tough. In real estate in Manhattan. You meet some tough people. These politicians are not such good people. All right. Lexy, from the audience right here. \"Mr. Trump, there are some who say that in the past you have supported Democrat's liberal views. How can voters be sure that you will truly hold and would actually continue to uphold Republican ideals and values?\" Well you know it's interesting as a one of the magazines said Donald Trump is a world class businessman and it was sort of interesting. I'm all over the world. And I deal with all politicians and honestly I never thought I'd be doing this. I just got exasperated. I would have done it four years ago. I looked at it very seriously with Romney. I was actually leading in the polls. And I decided -- I had a lot of jobs going. My children were younger and now they can do a great job and I have excellent executives. But, but. It's this is not something I really was going to do or really wanted to do. I loved what I was doing. The fact is that as a businessman you get along with all politicians or you have a problem. So I get along with Democrats. I got along with liberals and conservatives and Republicans. I got along with everybody. Because that was my thing. You know it was very important. I got along with Bob, where's Bob? I saw Bob in the audience. Where is he? Where is he? By the way, and a fantastic person, OK. You know that. Stand up, Bob. He's a fantastic person and but I get along with everybody I get along with them and that was important and I tell people and people would forgive me for that. They'd say, \"Well you know it's true.\" But as a businessman, you want to get along with Democrats, Republicans, everyone. And I think for the most part, you know, that's been used on me and I understand it but once I explain it. Most people understand. All right. Ken, from right here in the audience wants to know. \"Assuming you will be the nominee of the party, what are the most important qualities you are going to look for in a vice presidential candidate? And feel free to name some names.\" That was my part. That was my part. Actually there are some names that I've gotten the respect that, you know, that have been. We'd started off with 17. We're now down to five. And you know some of the people that I've dealt with, I do have a lot of respect for and I like. Look, the main quality that you want is somebody that can be a great president. If something happens to you, that's got to be don't you think? That's got to be number one. And then I would want somebody that could help me with governments so most likely that would be a political person, because you know, I'm businessman and I'm very good at what I do and all of that. And I'm also very, very political. You've seen me when you can get zoning on the West Side of Manhattan, to build almost 6,000 units of housing and you have to go through New York City politics. Believe me. That's is tough. I don't say Israel -- Palestine. But it's about as tough a deal. It's about as tough a deal. I view that as the single toughest deal. Anybody can make that deal. And we're going to give it a shot, OK. We're going to give it a shot. But a lot of good people have gone down trying to give that one a shot. But, the most important thing is you have to have somebody that can be a great president. But after that, you want somebody that can help you with legislation, getting it through etc., etc. So I would say without -- it's too early. I'm not thinking about it a lot. I'm thinking about getting the ball over the line and you know, get this thing done and it's a very interesting thing because some people know how to do that. Some people don't. But I do want somebody that's political because I want to get lots of great legislation that we all want passed. It's just sitting there for years and years and years. We have things sitting there that would be so good, including proper health care and other things. So we're going to -- we're going to probably choose somebody that's somewhat political. All right. Please. Well, He's had a busy day and you win a lot and come to Virginia and it's a big deal. Hillary, if you were president would you instruct the attorney general to indict her for what she's done in relation to the e-mails. Well it's an amazing question because you know there's a six-year statute of limitations, might be five but probably six. And the answer is, I would have. I would instruct them to take a look at it, you know, because it's not really our call to say indict. Yeah. But certainly you would have to take a look at it because you look at General Petraeus, who suffered greatly. They gave him two years, suspended and lots of things. They wanted to take his rank away from him. I fought that very hard. I said, \"This man suffered enough. Why didn't you focus on beating ISIS instead and leave General Petraeus alone? Just leave him alone.\" I think -- I think it helped him. But they want to cut his rank way down and a lot of other things they want to do. But you know he suffered greatly over this and what he did is nothing compared to what she did. So I would instruct my attorney general, \"Please look at it and if there's something there. There seems to be a lot there, because you know every day we see people and we read about people that are experts in the field and there. How often you see somebody saying she did nothing wrong. They're all saying she did something very wrong but they're protecting her because she's the number one runner and she's saying, \"How wonderful Obama is.\" Do you ever see anything like it? Every single thing that he wants to do, she is saying \"Great.\" So she's doing it for that reason. Believe me folks."}