{"id":443,"author":"Donald Trump","title":"Speech: Donald Trump in Las Vegas, NV","date":"2016-02-23","link":"https://factba.se/transcript/donald-trump-speech-las-vegas-nv-february-23-2016","paragraphs":["We love Nevada. We love Nevada. Thank you. Thank you.","Oh. This is a great place.","Thank you.","Thank you very much. Great evening. We will be celebrating for a long time tonight. Have a good time.","Have a good time.","You know, we weren't expected -- a couple of months ago we weren't expected to win this one. You know that, right? We weren't.","Of course if you listen to the pundits we weren't expected to win too much and now we're winning, winning, winning the country.","And soon the country is going to start winning, winning, winning.","So I want to thank the volunteers. They've been unbelievable. These people, they work like endlessly, endlessly.","We're not going to forget it.","And we've had some great numbers coming out of Texas.","And amazing numbers coming out of Tennessee and Georgia and Arkansas. And then a couple of weeks later Florida. We love Florida.","We're going to do very well in Ohio. We're beating the governor. That's good. It's always nice to be beating the governor. And Michigan. I mean the whole thing. It's going to be an amazing two months.","We might not even need the two months, folks, to be honest, all right?","So tonight we had 45-46 percent. And tomorrow you'll be hearing, you know, if they could just take the other candidates and add them up. And if you could add them up, because you know the other candidates amount to 55 percent. So if they could just add.","They keep forgetting that when people drop out we're going to get a lot of votes.","They keep forgetting. They don't say it.","So I want to begin by thanking my boys. Eric has been all over the place making speeches. He's getting better than me, so I'm a little jealous.","And Don went up to Elko. And you were all over, right? And he loves the rifle stuff. This is serious rifle. This is serious NRA. Both of them.","So -- both of them.","We love the Second Amendment, folks. Nobody loves it more than us. So just remember that. .","And Cory and Hope, the staff, the whole group, and Charles and Dan. And what a group we have. It's just been amazing.","I want to just thank a couple of friends of mine that are here. The owner of this incredible hotel, Mr. and Mrs. Phil Ruffin. Stand up.","Great guy. Phil said, Donald --\"like for the last three months he's driving me crazy. He said","Now -- I'll tell you what we're going to do right. We get greedy, right? Now we're going to get greedy for the United States. We're going to grab and grab and grab.","We're going to bring in so much money and so much everything. We're going to make America great again, folks. I'm telling you. We're going to make America great again.","And another great friend of mine, somebody respected by everybody, a great friend of Phil too, Mr. and Mrs. Steve Wynn. Stand up, Steve.","Stand up. Two great people.","Steve is always calling. He's always got advice. Right, Steve? Donald","So Phil and Steve and families, we appreciate it. You've been great friends. Thank you. Thank you.","So, this was very exciting tonight. But I'll tell you. It looks like we won by a lot Evangelicals. I love the Evangelicals.","And I have to tell you, Pastor Jeffress has been so incredible on television and elsewhere. He has been great. And as you know, Liberty University. Do we love Liberty University?","Jerry Falwell Junior, an unbelievable guy. And he has been with us and with us from the beginning. And I want to thank Jerry and his family. It's been amazing, the relationship.","So we won the Evangelicals. We won with young. We won with old. We won with highly educated. We won with poorly educated. I love the poorly educated.","We're the smartest people. We're the most loyal people. And you know what I really am happy about because I've been saying it for a long time, 46 percent with the Hispanics, 46 percent.","Number one with Hispanics.","I'm really happy about that.","Thank you.","So I'm very proud of you. This is an amazing night. And you know I love the country. I love the country.","We're going...","We're going in the wrong direction. We're going to keep, as you know get -- keeping that open. And we're going to load it up with bad dudes. We're going to load it up with a lot of bad dudes out there. We're going to have our borders nice and strong. We're going to build the wall. You know that. Going to build the wall.","And I have a lot of respect for Mexico. And you just heard we won Hispanics. But let me tell you. Mexico is going to pay for the wall. Right?","Going to happen. Going to happen. They know it. I know it. We all know it.","We have a tremendous deficit. We have a trade deficit with Mexico. They'll pay for the wall. They'll be very happy about it. Believe me. I'll talk to them. They'll be very, very thrilled. They're going to be thrilled to be paying for the wall.","We're going to be the smart people. We're not going to be the people that get pushed around all over the place. We're going to be the smart people.","You're going to be proud of your president. And you're going to be even prouder of your country. OK?","So tonight, folks, this was a great evening. I love this place. I love this state. I love Las Vegas. I have spent and invested so much money over here. Trump International Hotel. I keep telling Steve we have the best hotel in Las Vegas. He's fighting me all the time. But that's...","But I just want to say it's a great state. And they have great people. And I was so proud.","You know I went to caucus. I was all over the place tonight. The people are amazing. The enthusiasm, it was unbelievable to see.","The people of this country are absolutely amazing. I love you folks very much. Remember, make America great again. We're going to do it. And it's going to happen fast.","Thank you very much, everybody. Thank you.","Thank you very much. We love you. We love you.","Thank you. Thank you.","Thank you, everybody. I love you. Thank you."],"text":" We love Nevada. We love Nevada. Thank you. Thank you. Oh. This is a great place. Trump. Trump. Trump. Trump. Trump. Thank you. Trump. Trump. Trump. Trump. Trump. Trump. Trump. Trump. Trump. Trump. Trump. Trump. Trump. Thank you very much. Great evening. We will be celebrating for a long time tonight. Have a good time. Have a good time. You know, we weren't expected -- a couple of months ago we weren't expected to win this one. You know that, right? We weren't. Of course if you listen to the pundits we weren't expected to win too much and now we're winning, winning, winning the country. And soon the country is going to start winning, winning, winning. So I want to thank the volunteers. They've been unbelievable. These people, they work like endlessly, endlessly. We're not going to forget it. And we've had some great numbers coming out of Texas. And amazing numbers coming out of Tennessee and Georgia and Arkansas. And then a couple of weeks later Florida. We love Florida. We're going to do very well in Ohio. We're beating the governor. That's good. It's always nice to be beating the governor. And Michigan. I mean the whole thing. It's going to be an amazing two months. We might not even need the two months, folks, to be honest, all right? So tonight we had 45-46 percent. And tomorrow you'll be hearing, you know, if they could just take the other candidates and add them up. And if you could add them up, because you know the other candidates amount to 55 percent. So if they could just add. They keep forgetting that when people drop out we're going to get a lot of votes. They keep forgetting. They don't say it. So I want to begin by thanking my boys. Eric has been all over the place making speeches. He's getting better than me, so I'm a little jealous. And Don went up to Elko. And you were all over, right? And he loves the rifle stuff. This is serious rifle. This is serious NRA. Both of them. So -- both of them. We love the Second Amendment, folks. Nobody loves it more than us. So just remember that. . And Cory and Hope, the staff, the whole group, and Charles and Dan. And what a group we have. It's just been amazing. I want to just thank a couple of friends of mine that are here. The owner of this incredible hotel, Mr. and Mrs. Phil Ruffin. Stand up. Great guy. Phil said, Donald --\"like for the last three months he's driving me crazy. He said Now -- I'll tell you what we're going to do right. We get greedy, right? Now we're going to get greedy for the United States. We're going to grab and grab and grab. We're going to bring in so much money and so much everything. We're going to make America great again, folks. I'm telling you. We're going to make America great again. And another great friend of mine, somebody respected by everybody, a great friend of Phil too, Mr. and Mrs. Steve Wynn. Stand up, Steve. Stand up. Two great people. Steve is always calling. He's always got advice. Right, Steve? Donald So Phil and Steve and families, we appreciate it. You've been great friends. Thank you. Thank you. So, this was very exciting tonight. But I'll tell you. It looks like we won by a lot Evangelicals. I love the Evangelicals. And I have to tell you, Pastor Jeffress has been so incredible on television and elsewhere. He has been great. And as you know, Liberty University. Do we love Liberty University? Jerry Falwell Junior, an unbelievable guy. And he has been with us and with us from the beginning. And I want to thank Jerry and his family. It's been amazing, the relationship. So we won the Evangelicals. We won with young. We won with old. We won with highly educated. We won with poorly educated. I love the poorly educated. We're the smartest people. We're the most loyal people. And you know what I really am happy about because I've been saying it for a long time, 46 percent with the Hispanics, 46 percent. Number one with Hispanics. I'm really happy about that. Trump. Trump. Trump. Trump. Trump. Trump. Trump. Trump. Trump. Trump. Trump. Trump. Trump. Trump... Thank you. So I'm very proud of you. This is an amazing night. And you know I love the country. I love the country. We love you too. We're going... We're going in the wrong direction. We're going to keep, as you know get -- keeping that open. And we're going to load it up with bad dudes. We're going to load it up with a lot of bad dudes out there. We're going to have our borders nice and strong. We're going to build the wall. You know that. Going to build the wall. And I have a lot of respect for Mexico. And you just heard we won Hispanics. But let me tell you. Mexico is going to pay for the wall. Right? Going to happen. Going to happen. They know it. I know it. We all know it. We have a tremendous deficit. We have a trade deficit with Mexico. They'll pay for the wall. They'll be very happy about it. Believe me. I'll talk to them. They'll be very, very thrilled. They're going to be thrilled to be paying for the wall. We're going to be the smart people. We're not going to be the people that get pushed around all over the place. We're going to be the smart people. You're going to be proud of your president. And you're going to be even prouder of your country. OK? So tonight, folks, this was a great evening. I love this place. I love this state. I love Las Vegas. I have spent and invested so much money over here. Trump International Hotel. I keep telling Steve we have the best hotel in Las Vegas. He's fighting me all the time. But that's... But I just want to say it's a great state. And they have great people. And I was so proud. You know I went to caucus. I was all over the place tonight. The people are amazing. The enthusiasm, it was unbelievable to see. The people of this country are absolutely amazing. I love you folks very much. Remember, make America great again. We're going to do it. And it's going to happen fast. Thank you very much, everybody. Thank you. Thank you very much. We love you. We love you. Thank you. Thank you. USA. USA. USA. USA. USA. USA. USA. USA. USA... ... Thank you, everybody. I love you. Thank you. "}