{"id":444,"author":"Donald Trump","title":"Speech: Donald Trump Delivers a Campaign Speech in Las Vegas, NV","date":"2016-02-22","link":"https://factba.se/transcript/donald-trump-speech-las-vegas-nv-february-22-2016","paragraphs":["Wow. This is something. Wow. This is a big beautiful building. Wow. Unbelievable. Unbelievable. Oh boy, you better get out tomorrow. You got to vote tomorrow. You got to vote, vote, vote Build that wall? We're going to build that wall. Don't worry about it. We're going to build that wall.","We're going to build the wall. And who's going to pay for that wall? Who? They think we're kidding too don't they folks. We're not kidding. We're not kidding. We're not going to be the dummies anymore folks. We're going to be the smart ones. We're going to be the smart ones. So I want to thank you. Is it great?","This is like a record setting crowd I understand. They say the biggest they've ever had. The biggest they've ever had at doing this stuff. Is that incredible? Incredible, ten thousand people in this beautiful arena. I want to thank Michael and his wife. They own the place, it was so nice. They were so nice but they've really done a good job.","But I just want to tell you setting records like this so important. But tomorrow you have to go out and vote. We have so -- we have such momentum with what happened in South Carolina last week, what a great group of people. What happened in New Hampshire the week before was so incredible. And we're leading and everybody's talking.","I'm watching television tonight and they're all say, \"Oh, Trump is going to win tomorrow. Trump's going to win.\" Believe me, just assume we'll get a tie. OK. Don't ever assume you're going to lose. We never want to even think about that. But if you assume we get a tie you're going to go out and vote. You know or as they would say in the old school caucus but forget the word caucus just go out and vote.","OK. So a lot of things have happened since June 16th when I announced I was running. Who knew this was going to happen. I figured maybe we'd be in the middle of the pack by this time. But we were going to edge it out at the end. You know, like a racehorse, we edge it out. We win in the end. But we have a big lead and we don't want to blow it. And you know frankly we've got to go all the way.","We're going to make America great again folks and to make America great again. We're going to make it better than ever before. You know the fact is that over the last six months, seven months I've been going around in every crowd. It's like this all the time. The people are amazing. The people are amazing and I've been saying that make America great again.","Make it. It's gonna be better than ever before because our people are people in this country are incredible. Now it started on June 16th and I came down I talked about illegal immigration. In fact, we have Sheriff Joe. Where Sheriff Joe? I love Sheriff Joe. I'll tell you what -- there he is right there. When Sheriff Joe endorses Trump, that means is nobody like Trump on immigration.","That we know. That we know, thank you Sheriff Joe. Thank you. And so it started with that and it started with Trey. And I made a speech in Trump Tower. I took a deep breath because you know it takes guts to run for president I want to tell you. And I don't do this, you know, I don't do this. Other guys have spent $148 million and I'm self funding by the way, I'm spending my own money.","I don't need these people, I don't need their money. Very important, I don't know if I get the credit for that, you know to be honest, when you go into a booth and you vote, I don't know that I get the credit. But I will tell you, these people are all taken care of by their donors, their special interests and their lobbyists.","A hundred percent -- a hundred percent. Well, I used to be those people just so you understand. Who knows the game, right? Who knows the game. But I understand what it takes and when somebody gives you 5 million and they represent the pharmaceutical industry and they come to you and you -- they need a favor.","You know, you want to be an honest guy but you know it's hard to say like, \"No.\". You don't have to say but believe me they have you a hundred percent. And what's good for the country is not going to be the thing that's done. When they come to see me and they say, you know, \"We need this and we need that.\" I say folks, I have no interest.","I got to do what's right for the country. We're going to straighten this thing out. We're going to straighten it out. You know I'll give you an example. Terrible thing happened this week. You saw Carrier right? Carrier Air Conditioning. So my son, Eric, was here with Don. They said, \"You know we ought to write a letter.\" These are activist sons, they're actually great sons.","Where are they? Where are they? These are great sons. There they are. And they said, \"You know we ought to write a letter to Carrier.\" And here's what happened. Do people know what went on with carrier last week? It's very sad. And there's nothing we're going to do about it unless we get very smart and tough.","You know, I went to the best school and you don't have to go to the best school. You don't have to go through high school to understand it. What they are doing is they announced 14 hundred jobs, they just fired everybody. And they said we're moving to Mexico. And somebody took a cell phone some -- well, a lot of people are moving to Mexico.","It's become like the new China. And they took a cell phone -- they took a cell phone. Fourteen hundred people were devastated. Now they say they're going to go to Mexico. So if I'm the president here's what we do. We write them a little note, we congratulate them and then move. We hope it goes well. We hope they don't have too many cost overruns when they build a new beautiful building.","And we tell them the following. We tell them that every time you make an air conditioning unit and every time you send that unit into the United States you're going to pay a 35% tax, OK. Thirty five percent. And it's going to be amazing how those numbers are going to change right. Going to be amazing. And I don't care.","And they're going to call me. They won't even bother with the lobbyists because the lobbyists won't have give me money. The special interests won't have given me money. Their donors won't have given me money. When I went to the last debate you saw that mess. I didn't have anybody there I had my sons, my wife and a couple of people there.","And the whole room was stacked with special interests and donors. And guys got up and spoke so badly. And the audience went crazy. And I looked and I knew half the people in the room, they're all special interest guys. One represented pharmaceuticals. You know I mean, you look -- look, we've got to put our country back together.","It's a mess. It's a mess. We've got to do it. So as an example, the drug companies, a doctor comes up to me, very big doctor, he says to me, \"You know Don, we're dying with Obamacare. It's a killer, it's no good, not working. It's not working. He tells me as more accountants than he has nurses. Not too good, right, to hear that.","But he said, \"You know that they don't bid out drugs with the largest drug buyer in the world, the United States, and we don't bid them out.\" I said, \"Well, I'm surprised to hear that, but not that surprise, because the drug companies and pharmaceutical companies are all making massive campaign contributions to the people I'm running against and to all the others.\" And I say -- I will, but I won't use -- but I won't use that expression because I'll get in trouble with these people.","They'll say, \"Do you know what he just said it was so.\" Right? So I won't say it but we will do that. We will do exactly what you said. So I said, \"What happened.\" I said -- Yeah, that's OK. You can sit down. I said, \"What happened is that they're all being taken care of. If we bid out pharmaceuticals drugs and those things we would save each year $300 billion.\" Three hundred billion dollars as a country.","Now you have that with the military going on because the military outfits that make the weapons, even if they're weapons -- What's wrong you have a you have a little protester? Get them the hell out. Get them out. Ah, get them out. Where's the protest? Where is it? I don't even see him. I don't even see him.","Look, I love protesters because the only way the cameras turn and show how big the audience is is when there's a protester, otherwise they never turn. I love protesters don't worry it's okay. You know for a long time I didn't know these guys it was like solid. They always -- they're on my face and you know the story, I've said it before.","My wife, I go home I say, \"How did I do. Did you see how big the crowd was. I've had 35,000 people, 25,000, 20?\" We have the biggest crowds by far of anybody. Much bigger than Bernie, although I will say Bernie is second -- he is second but much bigger. But I think he's heading down -- he's heading down.","Looks like Bernie is heading down. Looks like Hillary's going to get a pass on her email scandal. But we will be bringing it up. We'll be bringing it up. Looks like we're going to be running against Hillary which is good. How did -- how did she get a pass on that deal. How? Right? It won't happen. Will won't happen.","It won't happen. So with these cameras so they never show the audience. So I said to my wife, \"Did you see the size of that audience today. We had 25,000 people did you -- \" \"No. They just keep it on your face.\" And then I realized they were instructed never ever show the audience. And the other night, recently, I had 12,000 people.","Yeah, go ahead. Go ahead. Go ahead. I love it. You know, the other night we had 12,000 people. Bernie had 3,000. I turn on the television, because I do like watching myself to be totally -- OK. But I turn on the television and they're saying, \"Bernie Sanders had a massive crowd of 3,000 people.\" Bah, bah, bah, you know the tax is everything -- OK. Then they go to Trump and Donald Trump spoke before a crowd today, at 12,000 people here, three.","So he had a massive crowd at three, 12, they don't mention. This is really bad. These are the most dishonest people I think I've ever dealt with. It's true. It's true. They're bad people. Bad people. But we learn to live with it. Not all of them, they're not all bad. There's about 80% bad. 10% OK, 5% good and 5% very good.","All right, that's not bad. That's not bad. So what I did on June 16th we came out we started talking about trade how we're being ripped off with China, ripped off with Japan, ripped off with Mexico at the border and in trade, ripped off by Vietnam and by India and by every country, every single country. Every single country because they're all represented by these people that we think are representing us. That's why when I say I'm self funding folks it means much more than you think.","It means much more. I'm telling you. You know, if it's a tie they should vote for me is what I'm saying. And if it's like somebody like somebody 20% better than me and I don't know why that would be possible. They should vote for me. Anything more than 20 25% go with the other guy. I will say this look, these are the most dishonest people I've ever dealt with.","Politicians, now I've dealt with them all my life so I'm not surprised. It's not like I'm shaken up. But this guy, Cruz, lies more than any human being I've ever dealt with. Unbelievable. And he holds up the Bible and he lies and then he holds up the Bible again and he lies. And -- and you know it was sort of cool because at the last debate Rubio, nice guy.","Nice guy. No, but he looked across and he said, \"You're a liar.\" And I've never heard a politician call another politician a liar. It was a thing of beauty. I've never heard it. So it then gave me cover but he says so many things. You know in the last election, in South Carolina, the morning of the election -- the morning of the election.","Think of it, you think it's all done. And now you're going to wait around. You can have a nice easy day but tomorrow I'm going out to all the caucus sites by the way, just in case you -- OK. I'll beat -- I'll beat a lot of them. I'll be -- and you better be there if you're not there I'm going to be so angry.","I don't want to I don't want to turn on the television and say, \"You know, Trump has the biggest crowds, the highest popularity, everybody loves the job he's going to do. But his people were too damn lazy to go out and caucus.\" Don't do it. Don't -- don't make me ever miserable evening. And then after this, you know what happens right, after this?","We have the whole FCC, we're gonna do so great. We have Georgia, Tennessee, we have so many -- so many great ones. We have Texas, I think we're going to do very well in Texas. Because you know the evangelicals were supposed to go with Cruz. They were supposed to go with Cruz. But you know what, honestly I won the evangelicals by a lot.","You saw that right? Actually, I won everything. I won short people, tall people. True. I won fat people, skinny people. I won highly educated, OK educated and practically not educated at all. I love them all. I won the evangelicals big and I won the military.The military I won big. Big. I won the Vets. The Vets, oh those Vets.","I love those Vets that we're going to take care of those Vets. We are going to take care of our Vets right? These are the greatest people I meet so many. The wounded warriors, I love these people. They have more courage, more guts, I hate to say it, than all of us put together. These are the most -- these are the most courageous, most incredible people and they always have a smile on their face when I meet them.","And boy, oh boy, oh boy. They've taken some shots and they are amazing people. We've got to take care of those people those people are great. We wouldn't be here if it wasn't for those people. And we're going to take care of them. We're going to straighten out that V.A. mess. We're going to straighten out that corrupt -- How about this 20 -- It's hard to even believe.","It's not even like a believable number. Twenty two suicides a day. No, no, think of it from the Vets, 22 suicides. That's unthinkable. It's unthinkable. Look at the signs. Oh that's so incredible. Wow. That's so incredible. I didn't know this. That is -- .That is incredible. Who would think this. Who would think it's possible?","That is absolutely incredible. I didn't know you're going to be doing that. That is good. So we're going -- we're going to straighten out the Vets. So Vets, don't worry we're coming, we're coming. We're going to straighten out a lot of things. We're going to straighten out -- we're going to get rid of Common Core.","You know we're last. We're getting rid of Common Core. We're going to make education local. You know in the world -- in the world, top 30 in the world, we're number 30. That means we're at the bottom of the list but we're number one in terms of cost per pupil by far. Number two doesn't even exist. Number two, is so far away it doesn't even exist.","We're number 30 and yet we're number one in the cost per pupil right? So let's look at my campaign, I spent by far, I spent a lot of money, but I spent by far the least amount of money and I'm by far number one. OK? Ain't that good? Somebody else I won't mention but they were nasty to me. They took 25 million in negative ads.","Can you believe it? Twenty five million dollars, one guy, 25 million and then I'm supposed to say he's a nice person right? And there were phony ads. Well I have one going on now, Cruz. He's got an ad, something to do with I want to take away your land and I want to keep it in the federal government and I don't even know what the hell they're talking about.","It's an ad, it's a Cruz ad, it's a Cruz scam. I'll tell you, so the evangelicals didn't vote for him. You know why? Because they don't like liars. They're really smart people. They don't want to vote for a liar. But it is true, I have an ad running right now. It's a cruise ad something to do with, a couple of people telling me this, that I am backing the Federal Government to keep the land that's currently owned by the federal government and we should give that land to everybody and divvy it up for something.","I'm saying to myself, \"Well, it's not a subject I know anything about. It's a hell of an ad.\" But this is a Cruz ad. This guy is sick. There's something wrong with this guy. On Saturday, when we had to vote. I mean, when we had to vote in South Carolina, Saturday. I wake up, I figure there's going to be a nice, easy day.","So I get hit with a call from my management people, who by the way did a fantastic job, Corey, Hope, everybody they're fantastic. And I get hit early in the morning that somebody did a robocall but -- but Cruz denied it. I said, \"Well, that's right. Who would do -- this is the day of the election. You just sort of don't do that stuff you're not supposed to but that, I didn't mind.","But the robocall had to do with the Confederate flag. This was not a good robocall to get it eight o'clock in the morning. Then I had a second robocall at 12 o'clock. And the total lies, the whole thing was -- I just tell you. I won't go into subject matter. A second robocall on Election Day. And it said, and this one had to do with gay marriage.","And this goes to everybody in the area. This goes to everybody. South Carolina, incredible people and I said, \"Man, if I get hit with two robocalls like that how can I possibly win?\" So I figured I was going to, you know, how can you win? The people were so smart and I -- I won in a landslide. Can you believe that?","We won in a landslide. I was gonna tell you two other categories. I won with men, but that's not important to me, I won with women, that's very important. Very important. That. So we're doing really well. So we're sending a letter -- we're sending a letter to Carrier. And in that letter we're going to say that if I should win we're going to come after you for a lot of money every time you send an air conditioner.","We're sending a letter to Ford, I've been talking about Ford now for two years right? Ford is building a two and a half billion dollar plant. I wish him a lot of luck. They're taking a lot of stuff out of Michigan and other places. Now what's good, tell me, from our standpoint, you know we have these really stupid trade.","Every deal we make is stupid, whether it's Sergeant Bergdahl where it's five-four-one. And five or six people got killed looking for. So we get a traitor and they get five killers that they've coveted for years, for nine years. We get one, they get five. Ours is no good, we could have it. Let's send them back drop them right in the middle of the damn thing.","Ball, fly over. Fly over, fly over, drop and maybe give him a parachute. Maybe you don't I don't know. Depends if we have an extra parachute. Probably -- probably we'd give him the parachute if we have an extra order out. But it wouldn't help him. He went out into that world. He didn't find it too comfortable folks, you know.","They slapped him around pretty good. He thought he was going to go out. He'd be treated wonderfully. I think they slapped him around pretty good. He came back. He couldn't get back fast enough. Five, maybe six, probably six people were killed looking for him. And we had a General and a Colonel that went to see his platoon and went to see his group and they all said he deserted.","And we knew he deserted when we made the deal. Now, why would you make a deal for a deserter and give up five people who they most want that are out trying to kill everybody including us. Why would we give up? Why would we give up five killers? Why for one dirty rotten traitor? Because we have incompetent leadership.","We have incompetent leadership. If they didn't know that would be terrible. But knowing it, makes it to me, even worse. Is that a correct statement Mr. Navy right? My man over there is shaking his head. He's going. Yeah, there's a guy. There's a guy. I know my -- I know my people. I know my people. And we're not going to make deals like that anymore.","We're not making an Iran deal where we give them $150 billion and we get nothing. we get nothing. Take of it -- think of it, we go into the Iran deal, it started when? Years ago, how long have they been negotiating? They called up, one of the newspapers, called up, \"Mr. Trump. How long should that deal have taken?\" \"One day.\" I said.","They said what? I said, \"Maybe one week. Has there been years like three years, three and a half years?\" So we should have demanded the prisoners back before we start negotiation. Right? And we would've gotten them. You ratchet up -- you ratchet up and you get up and you'd say, \"Listen we are going to ratchet up those sanctions.","We want our prisoners back.\" You leave. You had to walk. They never walk from that deal. We were ridiculed in that deal. And then even at the end, as bad as the deal was, the worst thing that ever happened to Israel, that I can tell you, that deal is a disaster for Israel. The worst. The deal is no good.","It's going to lead to nuclear proliferation. They're going to have nukes. They don't even have to develop. They can buy them with $150 billion and have a lot of money left over. And where are they spending the hundred and fifty. So they're not buying Boeing, they're not buying Boeing. They just ordered 118 airbus jets made in Europe.","They ordered missiles, I didn't know they could buy missiles, they ordered missiles from Russia. And they're all over Europe spending that money. The United States gets nothing. And then two days before we send most of the money, they attack us and they put our 10 sailors, in a begging position, on their knees with their hands up with a guy with a rough, rough mouth.","A rough guy with a rough mouth, like to smack the hell out of them. And he's barking orders, like he's a big shot, and they have rifles at their heads. And this is our friends. And Obama addresses their leader is the supreme leader, and he says the supreme leader. And Obama refuses to issue the words radical Islamic terrorism.","And when I call for a boycott, we're doing that out of intelligence. We're doing that because we want to keep our country strong and safe. And we have no choice. Believe me. So we have some amazing things going on in this country. We're going to make it so strong. We're going to make it so strong.","One of the things I most look forward to doing is taking our military and just reworking it. Getting the equipment they want not equipment that was gotten for political gain by some guy -- by some guy that has control of a company that's good with the senators, some of whom I'm running against. OK? We are going to make it so strong.","All right, so here's what we do, we are going to, now, talk for two seconds about Obamacare. Because it is a subject that's very close to my heart and it's killing our country. It's going to fail of its own weight by 17. It's going to fail of its own way, it's going down folks, it's going down. It's going to fail like you've never seen.","But the Republicans, unless I'm there, will come and bail it out because they always bail it out. They bail it out with this horrible budget from four weeks ago. Obamacare is going to be repealed and replaced Obamacare -- . We're going to have a strong country again. And Obamacare has to go. We can't afford it, it's no good.","You can end up with great health care for a fraction of the price. And that's going to take place immediately after we go in. OK. Immediately, fast, quick. What? OK. It's not working for you right? Not working. OK. It's -- by the way, it's not -- it doesn't work for anybody. Let me ask you, does it work for anybody?","Nobody. We get it changed -- we get it changed, we get it fixed. It'll be beautiful. It'll be beautiful. No, it doesn't, it doesn't. Wise guys. We are wise guys. You know, sometimes you'd like to sit down with a guy like that. If you talk to somebody like that for a couple of minutes I really think, unless you know there's other motives which they're off or not, but you talk to somebody like that for 15 minutes.","What do we all want. We want security, we want safety, we want a home, we want a great family, we want health care, we want good jobs right? I mean, whether you're a Liberal Democrat, a conservative Repub -- don't we all sort of if you think about it we should want. We want security. We want strong, strong security because our country now is in trouble.","Now look, when it comes and when I first came down I said trade, but I said the border. That border is going to be so strong and the Syrians cannot be allowed to come in folks. We don't know who the hell they are, we don't know who they are. We don't know who they are. There's no paperwork there's no documentation.","Do you ever look at that migration? You say look at all the young men. Where are the women, where the children right? Take a look at what's happening to Germany. It is a disaster. What's happening to Germany, what's happening to Sweden, what's happening to Brussels. You just take a look. It's not going to happen to our country.","We're going to make our country -- we're going to make our country stronger than ever before. If you look at our GDP for the last quarter, we had no growth. We had no growth. We're losing jobs, we have a phony jobs number. They say it's down to 5%. The real number is 25%. And if it wasn't I wouldn't be having crowds like this at every stadium.","The real number, and that 5% number, is a number that was devised by politicians to look good. Believe me, that's just to look good. And the jobs they're talking about and everybody admits it. These are bad jobs, these are crummy jobs, these aren't the jobs they want. And the part time jobs are all over the place.","People working part-time jobs, it never had a part-time job. So we're going to take our jobs back from China and all of these other countries. I have a friend, he's a great contractor and he's a great merchandiser, and he can not get his product into China. No matter what he does, he can't. They send their product -- oh, bye bye.","Good job fellow. Bye bye. Look, he is smiling. He's having a good time. I love the old days you know. You know what I hate? There's a guy totally disruptive, throwing punches. We're not allowed to punch back anymore. I love the old days. You know what they used to do to guys like that when they were in a place like this.","They'd be carried out on a stretcher folks. Yeah, it's true. You know I love our police and I really respect our police and they're not getting enough. They're not but -- Honestly I hate to see that. Here's a guy throwing punches, nasty as hell, screaming and everything else when we're talking. And walking out and we're not allowed, you know, the guards are very gentle with him.","He's walking out like you big high fives, smiling, laughing. Like to punch him in the face I'll tell you. You know it brings up something. Two debates ago they hit Ted Cruz with a question, and this guy's so overrated it's ridiculous, they hit him with a question. You know I always say about Ted Cruz. He can debate but he can't talk.","Does that make sense? But they hit him with a question on waterboarding and they said, \"What do you think of waterboarding? Is it good?\" And you know he got really all messed up. He couldn't answer the question. He was a mess. And because he didn't want to say waterboarding is a good thing. And now waterboarding is nothing pretty but they're chopping off heads right.","They're chopping off heads. They're drowning people in steel cages, leaving them in the ocean for an hour and then lifting them up after many, many people drown. But they're chopping off heads. And then saying to themselves can you believe how weak -- how weak and pathetic the Americans are. So they're asking Ted Cruz, \"What do you think of waterboarding?\" \"Well, ahh, what do I say?","I want -- how to be politically correct. Waterboarding. It's so terrible waterboarding is so even though they're chopping off heads. Waterboarding is a.\" He couldn't answer the question. He was like a mess. Then they said to me, \"What do you think of waterboarding?\" I said, \"I think it's great but I don't think we go far enough.","And the whole place is.\" True. It's true. True right? We don't go far enough. We don't go far enough. And now the press will write tomorrow. Trump is a mean guy. I'm not a mean guy, I'm not a mean guy. I'm just a guy that doesn't want to be pushed around by a bunch of animals. These are animals. So there won't be any more Fords going to Mexico.","There won't be any more different trades going to Mexico. I don't need Nabisco anymore. Frankly, I don't eat Oreos anymore which is a good thing not a bad thing. But when they announced they're moving their plant into Mexico, it's not going to happen. OK. It's not going to happen. So we're going to be very smart.","Now, here's what happened, Carl Icahn, great businessman, he endorsed me. Other great businessmen, they endorsed me. We have some of the most important deals we're making now our trade deals. To me security is the most important thing always. OK. Just so you know. Just so you know. CNN did a poll and in the poll they said, \"Trump for security is the best.\", \"Trump for the military is the best.\", \"Trump for the economy is the best.\" I don't mean by a little bit.","I mean by so much you wouldn't believe it by 40 points, 50 points. I was in the 60% thousand said that's what we had like 12 people. Trump for so many things, Trump for leadership is the best. Trump -- Trump at the border is the best. True. Trump, now this probably had to do with Sheriff Joe and all, but Trump for the borders the best.","Because I'm so good on the border. And believe me, we're going have people come in. They come in legally and they going to go through a process but legally, legally, legally. But we are going to be really strong in the border. We don't have the strongest border anywhere. Nobody's gonna have a border like us believe me. Believe me. And you know, I talk because I thought it was a little bit funny.","You know the pope came out and he sort of said some things and, this was the day of the election. The day the pope and they came to me they said, \"Mr. Trump the pope just made some statements about you.\" I said, \"The pope what do I have to do at the Pope?\" But I said \"Don't tell me this. This is like 10 hours before the election.\" Right?","South Carolina the election, I have a question, the pope is hitting me hard. And he said things about the border and you can't have a wall. And I said \"Wow. But I've seen the Vatican that's the biggest strongest wall I've ever seen.\" Right? I've never seen a wall like it. Fact, I want to use that as my model for the wall we want to build.","But anyway but -- no, the Mexican officials, who are very smart, don't forget they're making a fortune with us. Trade deficit with Mexico $58 billion a year. These politicians come up to me. They used to say, \"You can't really build a wall can you?\" And I say, \"China, 13,000 miles, the great China wall, the wall of China right?\" Thirteen thousand miles long, it was built 2000 years ago.","No, we can't build the wall with Caterpillar tractors all over the place. So that's 13,000, we need 1000. All right. And we're going to make it higher. I want to make it higher than the wall in China so that we can say. Won't be as wide but it'll be higher. OK. That I can tell you. So we go on. And -- and let me just explain something.","We're going to have such great security, such great security, that we're going to be the model for the world. We're going to be a model for the rest of the world. We've gone -- we've gone from being -- we have gone from being a laughing stock. We'll go to the exact opposite. One of the things that you see, and I say all the time, we don't win anymore.","We don't beat ISIS, we're going to knock the hell out of them folks. We don't win with health care. We're going to have great health care. We don't win with education. You know, I was going to say on education right. To have -- to be ranked number 30th, and to spend that kind of money, is so sad -- is so sad.","We're going to balance our budgets relatively quickly. I don't want to do it too quickly but it can go very quickly. Some of the politicians said we think we can balance them over a 25 year period. Do you believe that? Over a 25 year period. There was a man in baseball, did anyone ever hear of Charles O Finley?","Charles O? George Steinbrenner was a great friend of mine, Charles Fiedler used to drive him crazy. He said, \"Donald this guy is so great. He had no money, but he would have the best team. He had Catfish Hunter, he had Reggie Jackson.\" He had the lowest salary in baseball, by far, right? For those -- and he won three World Series in a row.","Then he take the players Reggie Jackson, Cat and he trade them. That's what we want to be. We don't want to spend our money. We want to be the best at everything without having necessarily to spend it. It's like I say, \"To spend the least on a campaign. And to be the best. We want to do that for our country.\" And we're going to do that for our country.","We're going to. I love these people I love. I love these people. So -- so the most important thing we can all do, we got to do. I'm telling you, I'm gonna be on everyone, I'm going to be all over the place tomorrow. The most important thing we can do is, I'm not going to use the word caucus, I'm gonna use the word just vote -- just vote because people say -- I don't want to give you an excuse.","What the hell is caucus? Nobody even knows what it means. We have a great -- we have a great Republican party right here in the state. Where is my Republican Party? Where is -- where are they? Where's my leader? Where's my leader? And they're going to be watching. You know, it is Las Vegas, it's a little tricky.","A little tricky. I could tell you some pretty bad stories about what happened in Iowa but I won't tell you about that. All right. These caucusing. So we're going to -- we're going to go out tomorrow and we're going to have a big victory, hopefully. I mean, frankly, if the people in this room went out and did it, we would win practically with that amount of people.","So -- so we're going to go out tomorrow and we're going to get it started. You look at the cover of Time magazine. The cover of Time magazine from a couple of weeks ago, it talks about the movement. It's a picture of me standing like this with a massive audience, a picture of the back of my head and I had my hair come just perfectly.","It was so good. I don't know if they did a touch up but I liked it. Ad. But it was a picture of me speaking to a massive crowd of people and they said, \"There has never been a thing like this that's ever happened in politics in the history of this country.\" Amazing. So you got to go out and vote.","And here's the story we're going to start winning again. We're going to start feeling good about ourselves again. We're going to get rid of people that are incompetent. People that negotiate an Iran deal and don't know what they're doing. We're going to have the best people in the world negotiating our trade deals.","We're going to break up the trade deals. We're going to make money instead of losing money with every country in the world. We're going to bring our jobs back to this country where they belong. We're going to bring our jobs back. And remember we're going to start winning again. We're going to win on trade.","We're going to win with the military. We're going to win at every single level we're going to win, win, win. And I jokingly say -- I jokingly say. That we're going to win so much. Maybe you're going to say Mr. President we're getting so bored and so tired of winning. Please don't win anymore we're just tired.","Let's go back to the old way and I'll say there's no way we're going to make America great again. And we're going to keep winning, winning, winning. And I love you. We're going to win go out tomorrow and vote. Thank you. I love you. I love you. Thank you. Thank you everybody."],"text":" Wow. This is something. Wow. This is a big beautiful building. Wow. Unbelievable. Unbelievable. Oh boy, you better get out tomorrow. You got to vote tomorrow. You got to vote, vote, vote Build that wall? We're going to build that wall. Don't worry about it. We're going to build that wall. We're going to build the wall. And who's going to pay for that wall? Who? They think we're kidding too don't they folks. We're not kidding. We're not kidding. We're not going to be the dummies anymore folks. We're going to be the smart ones. We're going to be the smart ones. So I want to thank you. Is it great? This is like a record setting crowd I understand. They say the biggest they've ever had. The biggest they've ever had at doing this stuff. Is that incredible? Incredible, ten thousand people in this beautiful arena. I want to thank Michael and his wife. They own the place, it was so nice. They were so nice but they've really done a good job. But I just want to tell you setting records like this so important. But tomorrow you have to go out and vote. We have so -- we have such momentum with what happened in South Carolina last week, what a great group of people. What happened in New Hampshire the week before was so incredible. And we're leading and everybody's talking. I'm watching television tonight and they're all say, \"Oh, Trump is going to win tomorrow. Trump's going to win.\" Believe me, just assume we'll get a tie. OK. Don't ever assume you're going to lose. We never want to even think about that. But if you assume we get a tie you're going to go out and vote. You know or as they would say in the old school caucus but forget the word caucus just go out and vote. OK. So a lot of things have happened since June 16th when I announced I was running. Who knew this was going to happen. I figured maybe we'd be in the middle of the pack by this time. But we were going to edge it out at the end. You know, like a racehorse, we edge it out. We win in the end. But we have a big lead and we don't want to blow it. And you know frankly we've got to go all the way. We're going to make America great again folks and to make America great again. We're going to make it better than ever before. You know the fact is that over the last six months, seven months I've been going around in every crowd. It's like this all the time. The people are amazing. The people are amazing and I've been saying that make America great again. Make it. It's gonna be better than ever before because our people are people in this country are incredible. Now it started on June 16th and I came down I talked about illegal immigration. In fact, we have Sheriff Joe. Where Sheriff Joe? I love Sheriff Joe. I'll tell you what -- there he is right there. When Sheriff Joe endorses Trump, that means is nobody like Trump on immigration. That we know. That we know, thank you Sheriff Joe. Thank you. And so it started with that and it started with Trey. And I made a speech in Trump Tower. I took a deep breath because you know it takes guts to run for president I want to tell you. And I don't do this, you know, I don't do this. Other guys have spent $148 million and I'm self funding by the way, I'm spending my own money. I don't need these people, I don't need their money. Very important, I don't know if I get the credit for that, you know to be honest, when you go into a booth and you vote, I don't know that I get the credit. But I will tell you, these people are all taken care of by their donors, their special interests and their lobbyists. A hundred percent -- a hundred percent. Well, I used to be those people just so you understand. Who knows the game, right? Who knows the game. But I understand what it takes and when somebody gives you 5 million and they represent the pharmaceutical industry and they come to you and you -- they need a favor. You know, you want to be an honest guy but you know it's hard to say like, \"No.\". You don't have to say but believe me they have you a hundred percent. And what's good for the country is not going to be the thing that's done. When they come to see me and they say, you know, \"We need this and we need that.\" I say folks, I have no interest. I got to do what's right for the country. We're going to straighten this thing out. We're going to straighten it out. You know I'll give you an example. Terrible thing happened this week. You saw Carrier right? Carrier Air Conditioning. So my son, Eric, was here with Don. They said, \"You know we ought to write a letter.\" These are activist sons, they're actually great sons. Where are they? Where are they? These are great sons. There they are. And they said, \"You know we ought to write a letter to Carrier.\" And here's what happened. Do people know what went on with carrier last week? It's very sad. And there's nothing we're going to do about it unless we get very smart and tough. You know, I went to the best school and you don't have to go to the best school. You don't have to go through high school to understand it. What they are doing is they announced 14 hundred jobs, they just fired everybody. And they said we're moving to Mexico. And somebody took a cell phone some -- well, a lot of people are moving to Mexico. It's become like the new China. And they took a cell phone -- they took a cell phone. Fourteen hundred people were devastated. Now they say they're going to go to Mexico. So if I'm the president here's what we do. We write them a little note, we congratulate them and then move. We hope it goes well. We hope they don't have too many cost overruns when they build a new beautiful building. And we tell them the following. We tell them that every time you make an air conditioning unit and every time you send that unit into the United States you're going to pay a 35% tax, OK. Thirty five percent. And it's going to be amazing how those numbers are going to change right. Going to be amazing. And I don't care. And they're going to call me. They won't even bother with the lobbyists because the lobbyists won't have give me money. The special interests won't have given me money. Their donors won't have given me money. When I went to the last debate you saw that mess. I didn't have anybody there I had my sons, my wife and a couple of people there. And the whole room was stacked with special interests and donors. And guys got up and spoke so badly. And the audience went crazy. And I looked and I knew half the people in the room, they're all special interest guys. One represented pharmaceuticals. You know I mean, you look -- look, we've got to put our country back together. It's a mess. It's a mess. We've got to do it. So as an example, the drug companies, a doctor comes up to me, very big doctor, he says to me, \"You know Don, we're dying with Obamacare. It's a killer, it's no good, not working. It's not working. He tells me as more accountants than he has nurses. Not too good, right, to hear that. But he said, \"You know that they don't bid out drugs with the largest drug buyer in the world, the United States, and we don't bid them out.\" I said, \"Well, I'm surprised to hear that, but not that surprise, because the drug companies and pharmaceutical companies are all making massive campaign contributions to the people I'm running against and to all the others.\" And I say -- I will, but I won't use -- but I won't use that expression because I'll get in trouble with these people. They'll say, \"Do you know what he just said it was so.\" Right? So I won't say it but we will do that. We will do exactly what you said. So I said, \"What happened.\" I said -- Yeah, that's OK. You can sit down. I said, \"What happened is that they're all being taken care of. If we bid out pharmaceuticals drugs and those things we would save each year $300 billion.\" Three hundred billion dollars as a country. Now you have that with the military going on because the military outfits that make the weapons, even if they're weapons -- What's wrong you have a you have a little protester? Get them the hell out. Get them out. Ah, get them out. Where's the protest? Where is it? I don't even see him. I don't even see him. Look, I love protesters because the only way the cameras turn and show how big the audience is is when there's a protester, otherwise they never turn. I love protesters don't worry it's okay. You know for a long time I didn't know these guys it was like solid. They always -- they're on my face and you know the story, I've said it before. My wife, I go home I say, \"How did I do. Did you see how big the crowd was. I've had 35,000 people, 25,000, 20?\" We have the biggest crowds by far of anybody. Much bigger than Bernie, although I will say Bernie is second -- he is second but much bigger. But I think he's heading down -- he's heading down. Looks like Bernie is heading down. Looks like Hillary's going to get a pass on her email scandal. But we will be bringing it up. We'll be bringing it up. Looks like we're going to be running against Hillary which is good. How did -- how did she get a pass on that deal. How? Right? It won't happen. Will won't happen. It won't happen. So with these cameras so they never show the audience. So I said to my wife, \"Did you see the size of that audience today. We had 25,000 people did you -- \" \"No. They just keep it on your face.\" And then I realized they were instructed never ever show the audience. And the other night, recently, I had 12,000 people. Yeah, go ahead. Go ahead. Go ahead. I love it. You know, the other night we had 12,000 people. Bernie had 3,000. I turn on the television, because I do like watching myself to be totally -- OK. But I turn on the television and they're saying, \"Bernie Sanders had a massive crowd of 3,000 people.\" Bah, bah, bah, you know the tax is everything -- OK. Then they go to Trump and Donald Trump spoke before a crowd today, at 12,000 people here, three. So he had a massive crowd at three, 12, they don't mention. This is really bad. These are the most dishonest people I think I've ever dealt with. It's true. It's true. They're bad people. Bad people. But we learn to live with it. Not all of them, they're not all bad. There's about 80% bad. 10% OK, 5% good and 5% very good. All right, that's not bad. That's not bad. So what I did on June 16th we came out we started talking about trade how we're being ripped off with China, ripped off with Japan, ripped off with Mexico at the border and in trade, ripped off by Vietnam and by India and by every country, every single country. Every single country because they're all represented by these people that we think are representing us. That's why when I say I'm self funding folks it means much more than you think. It means much more. I'm telling you. You know, if it's a tie they should vote for me is what I'm saying. And if it's like somebody like somebody 20% better than me and I don't know why that would be possible. They should vote for me. Anything more than 20 25% go with the other guy. I will say this look, these are the most dishonest people I've ever dealt with. Politicians, now I've dealt with them all my life so I'm not surprised. It's not like I'm shaken up. But this guy, Cruz, lies more than any human being I've ever dealt with. Unbelievable. And he holds up the Bible and he lies and then he holds up the Bible again and he lies. And -- and you know it was sort of cool because at the last debate Rubio, nice guy. Nice guy. No, but he looked across and he said, \"You're a liar.\" And I've never heard a politician call another politician a liar. It was a thing of beauty. I've never heard it. So it then gave me cover but he says so many things. You know in the last election, in South Carolina, the morning of the election -- the morning of the election. Think of it, you think it's all done. And now you're going to wait around. You can have a nice easy day but tomorrow I'm going out to all the caucus sites by the way, just in case you -- OK. I'll beat -- I'll beat a lot of them. I'll be -- and you better be there if you're not there I'm going to be so angry. I don't want to I don't want to turn on the television and say, \"You know, Trump has the biggest crowds, the highest popularity, everybody loves the job he's going to do. But his people were too damn lazy to go out and caucus.\" Don't do it. Don't -- don't make me ever miserable evening. And then after this, you know what happens right, after this? We have the whole FCC, we're gonna do so great. We have Georgia, Tennessee, we have so many -- so many great ones. We have Texas, I think we're going to do very well in Texas. Because you know the evangelicals were supposed to go with Cruz. They were supposed to go with Cruz. But you know what, honestly I won the evangelicals by a lot. You saw that right? Actually, I won everything. I won short people, tall people. True. I won fat people, skinny people. I won highly educated, OK educated and practically not educated at all. I love them all. I won the evangelicals big and I won the military.The military I won big. Big. I won the Vets. The Vets, oh those Vets. I love those Vets that we're going to take care of those Vets. We are going to take care of our Vets right? These are the greatest people I meet so many. The wounded warriors, I love these people. They have more courage, more guts, I hate to say it, than all of us put together. These are the most -- these are the most courageous, most incredible people and they always have a smile on their face when I meet them. And boy, oh boy, oh boy. They've taken some shots and they are amazing people. We've got to take care of those people those people are great. We wouldn't be here if it wasn't for those people. And we're going to take care of them. We're going to straighten out that V.A. mess. We're going to straighten out that corrupt -- How about this 20 -- It's hard to even believe. It's not even like a believable number. Twenty two suicides a day. No, no, think of it from the Vets, 22 suicides. That's unthinkable. It's unthinkable. Look at the signs. Oh that's so incredible. Wow. That's so incredible. I didn't know this. That is -- .That is incredible. Who would think this. Who would think it's possible? That is absolutely incredible. I didn't know you're going to be doing that. That is good. So we're going -- we're going to straighten out the Vets. So Vets, don't worry we're coming, we're coming. We're going to straighten out a lot of things. We're going to straighten out -- we're going to get rid of Common Core. You know we're last. We're getting rid of Common Core. We're going to make education local. You know in the world -- in the world, top 30 in the world, we're number 30. That means we're at the bottom of the list but we're number one in terms of cost per pupil by far. Number two doesn't even exist. Number two, is so far away it doesn't even exist. We're number 30 and yet we're number one in the cost per pupil right? So let's look at my campaign, I spent by far, I spent a lot of money, but I spent by far the least amount of money and I'm by far number one. OK? Ain't that good? Somebody else I won't mention but they were nasty to me. They took 25 million in negative ads. Can you believe it? Twenty five million dollars, one guy, 25 million and then I'm supposed to say he's a nice person right? And there were phony ads. Well I have one going on now, Cruz. He's got an ad, something to do with I want to take away your land and I want to keep it in the federal government and I don't even know what the hell they're talking about. It's an ad, it's a Cruz ad, it's a Cruz scam. I'll tell you, so the evangelicals didn't vote for him. You know why? Because they don't like liars. They're really smart people. They don't want to vote for a liar. But it is true, I have an ad running right now. It's a cruise ad something to do with, a couple of people telling me this, that I am backing the Federal Government to keep the land that's currently owned by the federal government and we should give that land to everybody and divvy it up for something. I'm saying to myself, \"Well, it's not a subject I know anything about. It's a hell of an ad.\" But this is a Cruz ad. This guy is sick. There's something wrong with this guy. On Saturday, when we had to vote. I mean, when we had to vote in South Carolina, Saturday. I wake up, I figure there's going to be a nice, easy day. So I get hit with a call from my management people, who by the way did a fantastic job, Corey, Hope, everybody they're fantastic. And I get hit early in the morning that somebody did a robocall but -- but Cruz denied it. I said, \"Well, that's right. Who would do -- this is the day of the election. You just sort of don't do that stuff you're not supposed to but that, I didn't mind. But the robocall had to do with the Confederate flag. This was not a good robocall to get it eight o'clock in the morning. Then I had a second robocall at 12 o'clock. And the total lies, the whole thing was -- I just tell you. I won't go into subject matter. A second robocall on Election Day. And it said, and this one had to do with gay marriage. And this goes to everybody in the area. This goes to everybody. South Carolina, incredible people and I said, \"Man, if I get hit with two robocalls like that how can I possibly win?\" So I figured I was going to, you know, how can you win? The people were so smart and I -- I won in a landslide. Can you believe that? We won in a landslide. I was gonna tell you two other categories. I won with men, but that's not important to me, I won with women, that's very important. Very important. That. So we're doing really well. So we're sending a letter -- we're sending a letter to Carrier. And in that letter we're going to say that if I should win we're going to come after you for a lot of money every time you send an air conditioner. We're sending a letter to Ford, I've been talking about Ford now for two years right? Ford is building a two and a half billion dollar plant. I wish him a lot of luck. They're taking a lot of stuff out of Michigan and other places. Now what's good, tell me, from our standpoint, you know we have these really stupid trade. Every deal we make is stupid, whether it's Sergeant Bergdahl where it's five-four-one. And five or six people got killed looking for. So we get a traitor and they get five killers that they've coveted for years, for nine years. We get one, they get five. Ours is no good, we could have it. Let's send them back drop them right in the middle of the damn thing. Ball, fly over. Fly over, fly over, drop and maybe give him a parachute. Maybe you don't I don't know. Depends if we have an extra parachute. Probably -- probably we'd give him the parachute if we have an extra order out. But it wouldn't help him. He went out into that world. He didn't find it too comfortable folks, you know. They slapped him around pretty good. He thought he was going to go out. He'd be treated wonderfully. I think they slapped him around pretty good. He came back. He couldn't get back fast enough. Five, maybe six, probably six people were killed looking for him. And we had a General and a Colonel that went to see his platoon and went to see his group and they all said he deserted. And we knew he deserted when we made the deal. Now, why would you make a deal for a deserter and give up five people who they most want that are out trying to kill everybody including us. Why would we give up? Why would we give up five killers? Why for one dirty rotten traitor? Because we have incompetent leadership. We have incompetent leadership. If they didn't know that would be terrible. But knowing it, makes it to me, even worse. Is that a correct statement Mr. Navy right? My man over there is shaking his head. He's going. Yeah, there's a guy. There's a guy. I know my -- I know my people. I know my people. And we're not going to make deals like that anymore. We're not making an Iran deal where we give them $150 billion and we get nothing. we get nothing. Take of it -- think of it, we go into the Iran deal, it started when? Years ago, how long have they been negotiating? They called up, one of the newspapers, called up, \"Mr. Trump. How long should that deal have taken?\" \"One day.\" I said. They said what? I said, \"Maybe one week. Has there been years like three years, three and a half years?\" So we should have demanded the prisoners back before we start negotiation. Right? And we would've gotten them. You ratchet up -- you ratchet up and you get up and you'd say, \"Listen we are going to ratchet up those sanctions. We want our prisoners back.\" You leave. You had to walk. They never walk from that deal. We were ridiculed in that deal. And then even at the end, as bad as the deal was, the worst thing that ever happened to Israel, that I can tell you, that deal is a disaster for Israel. The worst. The deal is no good. It's going to lead to nuclear proliferation. They're going to have nukes. They don't even have to develop. They can buy them with $150 billion and have a lot of money left over. And where are they spending the hundred and fifty. So they're not buying Boeing, they're not buying Boeing. They just ordered 118 airbus jets made in Europe. They ordered missiles, I didn't know they could buy missiles, they ordered missiles from Russia. And they're all over Europe spending that money. The United States gets nothing. And then two days before we send most of the money, they attack us and they put our 10 sailors, in a begging position, on their knees with their hands up with a guy with a rough, rough mouth. A rough guy with a rough mouth, like to smack the hell out of them. And he's barking orders, like he's a big shot, and they have rifles at their heads. And this is our friends. And Obama addresses their leader is the supreme leader, and he says the supreme leader. And Obama refuses to issue the words radical Islamic terrorism. And when I call for a boycott, we're doing that out of intelligence. We're doing that because we want to keep our country strong and safe. And we have no choice. Believe me. So we have some amazing things going on in this country. We're going to make it so strong. We're going to make it so strong. One of the things I most look forward to doing is taking our military and just reworking it. Getting the equipment they want not equipment that was gotten for political gain by some guy -- by some guy that has control of a company that's good with the senators, some of whom I'm running against. OK? We are going to make it so strong. All right, so here's what we do, we are going to, now, talk for two seconds about Obamacare. Because it is a subject that's very close to my heart and it's killing our country. It's going to fail of its own weight by 17. It's going to fail of its own way, it's going down folks, it's going down. It's going to fail like you've never seen. But the Republicans, unless I'm there, will come and bail it out because they always bail it out. They bail it out with this horrible budget from four weeks ago. Obamacare is going to be repealed and replaced Obamacare -- . We're going to have a strong country again. And Obamacare has to go. We can't afford it, it's no good. You can end up with great health care for a fraction of the price. And that's going to take place immediately after we go in. OK. Immediately, fast, quick. What? OK. It's not working for you right? Not working. OK. It's -- by the way, it's not -- it doesn't work for anybody. Let me ask you, does it work for anybody? Nobody. We get it changed -- we get it changed, we get it fixed. It'll be beautiful. It'll be beautiful. No, it doesn't, it doesn't. Wise guys. We are wise guys. You know, sometimes you'd like to sit down with a guy like that. If you talk to somebody like that for a couple of minutes I really think, unless you know there's other motives which they're off or not, but you talk to somebody like that for 15 minutes. What do we all want. We want security, we want safety, we want a home, we want a great family, we want health care, we want good jobs right? I mean, whether you're a Liberal Democrat, a conservative Repub -- don't we all sort of if you think about it we should want. We want security. We want strong, strong security because our country now is in trouble. Now look, when it comes and when I first came down I said trade, but I said the border. That border is going to be so strong and the Syrians cannot be allowed to come in folks. We don't know who the hell they are, we don't know who they are. We don't know who they are. There's no paperwork there's no documentation. Do you ever look at that migration? You say look at all the young men. Where are the women, where the children right? Take a look at what's happening to Germany. It is a disaster. What's happening to Germany, what's happening to Sweden, what's happening to Brussels. You just take a look. It's not going to happen to our country. We're going to make our country -- we're going to make our country stronger than ever before. If you look at our GDP for the last quarter, we had no growth. We had no growth. We're losing jobs, we have a phony jobs number. They say it's down to 5%. The real number is 25%. And if it wasn't I wouldn't be having crowds like this at every stadium. The real number, and that 5% number, is a number that was devised by politicians to look good. Believe me, that's just to look good. And the jobs they're talking about and everybody admits it. These are bad jobs, these are crummy jobs, these aren't the jobs they want. And the part time jobs are all over the place. People working part-time jobs, it never had a part-time job. So we're going to take our jobs back from China and all of these other countries. I have a friend, he's a great contractor and he's a great merchandiser, and he can not get his product into China. No matter what he does, he can't. They send their product -- oh, bye bye. Good job fellow. Bye bye. Look, he is smiling. He's having a good time. I love the old days you know. You know what I hate? There's a guy totally disruptive, throwing punches. We're not allowed to punch back anymore. I love the old days. You know what they used to do to guys like that when they were in a place like this. They'd be carried out on a stretcher folks. Yeah, it's true. You know I love our police and I really respect our police and they're not getting enough. They're not but -- Honestly I hate to see that. Here's a guy throwing punches, nasty as hell, screaming and everything else when we're talking. And walking out and we're not allowed, you know, the guards are very gentle with him. He's walking out like you big high fives, smiling, laughing. Like to punch him in the face I'll tell you. You know it brings up something. Two debates ago they hit Ted Cruz with a question, and this guy's so overrated it's ridiculous, they hit him with a question. You know I always say about Ted Cruz. He can debate but he can't talk. Does that make sense? But they hit him with a question on waterboarding and they said, \"What do you think of waterboarding? Is it good?\" And you know he got really all messed up. He couldn't answer the question. He was a mess. And because he didn't want to say waterboarding is a good thing. And now waterboarding is nothing pretty but they're chopping off heads right. They're chopping off heads. They're drowning people in steel cages, leaving them in the ocean for an hour and then lifting them up after many, many people drown. But they're chopping off heads. And then saying to themselves can you believe how weak -- how weak and pathetic the Americans are. So they're asking Ted Cruz, \"What do you think of waterboarding?\" \"Well, ahh, what do I say? I want -- how to be politically correct. Waterboarding. It's so terrible waterboarding is so even though they're chopping off heads. Waterboarding is a.\" He couldn't answer the question. He was like a mess. Then they said to me, \"What do you think of waterboarding?\" I said, \"I think it's great but I don't think we go far enough. And the whole place is.\" True. It's true. True right? We don't go far enough. We don't go far enough. And now the press will write tomorrow. Trump is a mean guy. I'm not a mean guy, I'm not a mean guy. I'm just a guy that doesn't want to be pushed around by a bunch of animals. These are animals. So there won't be any more Fords going to Mexico. There won't be any more different trades going to Mexico. I don't need Nabisco anymore. Frankly, I don't eat Oreos anymore which is a good thing not a bad thing. But when they announced they're moving their plant into Mexico, it's not going to happen. OK. It's not going to happen. So we're going to be very smart. Now, here's what happened, Carl Icahn, great businessman, he endorsed me. Other great businessmen, they endorsed me. We have some of the most important deals we're making now our trade deals. To me security is the most important thing always. OK. Just so you know. Just so you know. CNN did a poll and in the poll they said, \"Trump for security is the best.\", \"Trump for the military is the best.\", \"Trump for the economy is the best.\" I don't mean by a little bit. I mean by so much you wouldn't believe it by 40 points, 50 points. I was in the 60% thousand said that's what we had like 12 people. Trump for so many things, Trump for leadership is the best. Trump -- Trump at the border is the best. True. Trump, now this probably had to do with Sheriff Joe and all, but Trump for the borders the best. Because I'm so good on the border. And believe me, we're going have people come in. They come in legally and they going to go through a process but legally, legally, legally. But we are going to be really strong in the border. We don't have the strongest border anywhere. Nobody's gonna have a border like us believe me. Believe me. And you know, I talk because I thought it was a little bit funny. You know the pope came out and he sort of said some things and, this was the day of the election. The day the pope and they came to me they said, \"Mr. Trump the pope just made some statements about you.\" I said, \"The pope what do I have to do at the Pope?\" But I said \"Don't tell me this. This is like 10 hours before the election.\" Right? South Carolina the election, I have a question, the pope is hitting me hard. And he said things about the border and you can't have a wall. And I said \"Wow. But I've seen the Vatican that's the biggest strongest wall I've ever seen.\" Right? I've never seen a wall like it. Fact, I want to use that as my model for the wall we want to build. But anyway but -- no, the Mexican officials, who are very smart, don't forget they're making a fortune with us. Trade deficit with Mexico $58 billion a year. These politicians come up to me. They used to say, \"You can't really build a wall can you?\" And I say, \"China, 13,000 miles, the great China wall, the wall of China right?\" Thirteen thousand miles long, it was built 2000 years ago. No, we can't build the wall with Caterpillar tractors all over the place. So that's 13,000, we need 1000. All right. And we're going to make it higher. I want to make it higher than the wall in China so that we can say. Won't be as wide but it'll be higher. OK. That I can tell you. So we go on. And -- and let me just explain something. We're going to have such great security, such great security, that we're going to be the model for the world. We're going to be a model for the rest of the world. We've gone -- we've gone from being -- we have gone from being a laughing stock. We'll go to the exact opposite. One of the things that you see, and I say all the time, we don't win anymore. We don't beat ISIS, we're going to knock the hell out of them folks. We don't win with health care. We're going to have great health care. We don't win with education. You know, I was going to say on education right. To have -- to be ranked number 30th, and to spend that kind of money, is so sad -- is so sad. We're going to balance our budgets relatively quickly. I don't want to do it too quickly but it can go very quickly. Some of the politicians said we think we can balance them over a 25 year period. Do you believe that? Over a 25 year period. There was a man in baseball, did anyone ever hear of Charles O Finley? Charles O? George Steinbrenner was a great friend of mine, Charles Fiedler used to drive him crazy. He said, \"Donald this guy is so great. He had no money, but he would have the best team. He had Catfish Hunter, he had Reggie Jackson.\" He had the lowest salary in baseball, by far, right? For those -- and he won three World Series in a row. Then he take the players Reggie Jackson, Cat and he trade them. That's what we want to be. We don't want to spend our money. We want to be the best at everything without having necessarily to spend it. It's like I say, \"To spend the least on a campaign. And to be the best. We want to do that for our country.\" And we're going to do that for our country. We're going to. I love these people I love. I love these people. So -- so the most important thing we can all do, we got to do. I'm telling you, I'm gonna be on everyone, I'm going to be all over the place tomorrow. The most important thing we can do is, I'm not going to use the word caucus, I'm gonna use the word just vote -- just vote because people say -- I don't want to give you an excuse. What the hell is caucus? Nobody even knows what it means. We have a great -- we have a great Republican party right here in the state. Where is my Republican Party? Where is -- where are they? Where's my leader? Where's my leader? And they're going to be watching. You know, it is Las Vegas, it's a little tricky. A little tricky. I could tell you some pretty bad stories about what happened in Iowa but I won't tell you about that. All right. These caucusing. So we're going to -- we're going to go out tomorrow and we're going to have a big victory, hopefully. I mean, frankly, if the people in this room went out and did it, we would win practically with that amount of people. So -- so we're going to go out tomorrow and we're going to get it started. You look at the cover of Time magazine. The cover of Time magazine from a couple of weeks ago, it talks about the movement. It's a picture of me standing like this with a massive audience, a picture of the back of my head and I had my hair come just perfectly. It was so good. I don't know if they did a touch up but I liked it. Ad. But it was a picture of me speaking to a massive crowd of people and they said, \"There has never been a thing like this that's ever happened in politics in the history of this country.\" Amazing. So you got to go out and vote. And here's the story we're going to start winning again. We're going to start feeling good about ourselves again. We're going to get rid of people that are incompetent. People that negotiate an Iran deal and don't know what they're doing. We're going to have the best people in the world negotiating our trade deals. We're going to break up the trade deals. We're going to make money instead of losing money with every country in the world. We're going to bring our jobs back to this country where they belong. We're going to bring our jobs back. And remember we're going to start winning again. We're going to win on trade. We're going to win with the military. We're going to win at every single level we're going to win, win, win. And I jokingly say -- I jokingly say. That we're going to win so much. Maybe you're going to say Mr. President we're getting so bored and so tired of winning. Please don't win anymore we're just tired. Let's go back to the old way and I'll say there's no way we're going to make America great again. And we're going to keep winning, winning, winning. And I love you. We're going to win go out tomorrow and vote. Thank you. I love you. I love you. Thank you. Thank you everybody."}