{"id":446,"author":"Donald Trump","title":"Speech: Donald Trump in Pawleys Island, SC","date":"2016-02-19","link":"https://factba.se/transcript/donald-trump-speech-pawleys-island-sc-february-19-2016","paragraphs":["Thank you very much. Do you know how many people are outside? Do you know what's going on out there? You know how lucky you are? You're lucky not to have it, but boy are you lucky anyway. Just to be here. Oh, you're the club champion, congratulate -- I'm a club champion. I mean, many times, club champion, would anybody believe that?","You know what it means? You can handle pressure. Don't kid yourself. You know, to be a club champion, it takes a special something, right? You know, no strokes, he's talking about no strokes. Not these guys that say, I'm a club champion, they've got 10 handicap, right? Cuts a -- so what's your handicap?","Eight, that's pretty high, but that's not bad. That's not bad. And you beat people that are lower, I'll bet, right? Very good. Congratulations. So yeah, there's a tremendous crowd of people outside. Unbelievable and it's great to be with you all. We're going to do something. See that hat Make America Great Again.","That's what we're going to do. We're going to Make America Great Again. And I just want to thank you. This is a beautiful part of the world by the way. This is a beautiful club, too. How many people are members here, a lot of you? Yeah, it's beautiful. I like it. Maybe we should buy it. I don't know. Should we buy it? No, I -- the course, the course looks fantastic.","So I thought we'd go and maybe we'll do a few question and answer. We'll do a little bit of talking. You've heard a lot of what I have to say. But you know, it started this -- yeah, sit down. Do you have seats? Yes, thank you. Better, right? It's been an amazing, it's been an amazing time.","We started on June 16th and everybody said, oh, he'll never run. All these pundits, you know, these total morons, like Karl Rove and people that don't, that don't -- they don't even have a clue. And they said, well, he'll never run. And if he runs, he'll just have a good time and he's not going to do it because why would he want to do it. And you know, he built a great business, why would he want to leave that?","I want to do it because we are going to Make America Great Again. We are in such trouble as a country. We owe $19 trillion. We have wars that we can't win. We can't beat ISIS. Can you imagine General MacArthur saying we can't beat ISIS? He'd have ISIS wiped out in about a half a day. So we're going to do something that, you know, the Time Magazine last week, you probably saw -- it's like, it's a movement.","They said it's a movement. It was the cover of Time Magazine and they've been very nice. They put me on the cover all the time. I've had so many -- I never had so many covers on Time. All my life, I think, I was run twice now, I'm on all the time. But we have a movement going. It's a really -- I have to get used to it. No, it's always an honor.","But, but the last story was so good. It's such a great writer and talked about it as a movement and I mean, you see it in here. This room is full. But why are these three seats empty, huh? Who's seats are they? There is -- somebody sit there. I hate to see an empty seat. Somebody sit over there. I'll go ahead, but great Al, one of the great vets of the country.","Somebody sit there, right? I never like to see empty seats. There's never an empty seat for Trump, right? Because it's representing what we're doing, it's representing the movement. But there is, there's a movement going on that's incredible. And no matter where we go, we have 25,000; 35,000 people. More than that, we have 20,000 people in Oklahoma twice, and New Hampshire we had a tremendous victory last week in New Hampshire.","And hopefully, you folks are going to go out and vote on Saturday, and some of you have probably voted already, have you voted? Anybody? A lot of people have voted already. They could vote -- thank you. You voted, yes? Thank you. Otherwise, I'd say get out of this room. But, but things are happening that's amazing.","And I think, we're hopefully -- we're going to do very well tomorrow. We just had the Emmerson poll, Emerson's a great, great poll. And one of the most accurate. I think they were the ones that got it really right last time or the last two times. And the Emerson poll, we just got great numbers with -- for South Carolina, and they really did a great job last time.","So we're honored to have that. We were at 35 or 36, and I think, second was 19 or 18. We had a big, big, big lead, but you know, we just assume we're tied because it's much better to -- Right? As young guys, you have to always assume you're tied. In fact, assume you're down, that's even better, right? We assume we're down and the -- but we have to get out and vote because if we don't get out and vote, there's no movement, there's no anything.","So when it started, it started as trade because it used to drive me absolutely crazy to watch these incompetent, stupid deals where China would consistently outdo us at the trading table, and we used people that are political hacks. We'd ever use our right people. We don't use our great businesspeople. We have the greatest businesspeople in the world, like in the world, and we don't use them.","We use political people, people that get there because they make campaign contributions to some politician, and it would drive me crazy. Then, of course, I was a very big contributor and I know the power of a contributor, and all of these politicians that I'm running against, you know, you look at like, you look at Cruz, you take a look at what he gets from the oil industry and from other industries.","You look at Jeb Bush, the head of his campaign is pharmaceutical, Woody Johnson of Johnson & Johnson. So what it comes down to bidding out drugs -- we're the largest drug purchaser in the world. They're not going to bid out the drugs. We would save $300 billion a year in this country if we bid out drugs.","You know, we don't beat them out. I just found out a friend of mine who's a doctor, called me and said, we don't bid out drugs that -- the biggest in the world. Can you imagine? We pay like almost the same as you'd pay if you walk into a drugstore. We're prohibited from bidding. I don't even know why that is. I mean, I do know why because these Senators are controlling the purse strings.","I mean because they're all paid off by campaign contributions. So I'm self-funding, I get no money from these people. I don't want any of their money. I could have so much money. I turned down so much money. They come in, you know, I've been the front runner. Well, it's one of those things. I've been, I've been the front runner, practically from June 16th, and when you're the front runner, sort of like the Apprentice.","I could have had anything. They wanted to extend the Apprentice for a long time and the head of Comcast, Steve Barker who's a terrific guy, came up to my office before I announced. He said we want to do it. We want to do it. We want to extend and you know, we had a great run, and it's a lot of money. When you have a successful show they pay you anything.","But I couldn't do it because I was doing this and I said Steve, I can't. I'm doing this. And he didn't sort of believe me. He said, oh, you're really not, you're really not. And they announced an extension which was a little confusing to people because they kept saying, I'm not going to do that. So we have Arnold Schwarzenegger doing it. How's Arnold going to do? You think?","Could be good, right? Well, we're going to find out soon enough, right? You got to be very fast. When Omarosa goes after you, boom, boom, you've got to be quick, and you've got to be fast. So we'll find out if he's fast. But so it's -- you know, it's just something that I wanted to do because we can save so much money.","We can make such great trade deals. We have to rebuild our military. Our military's depleted. We have to take care of our vets. Al Baldesarra is back here and Al is a great vet, he loves the vets that is -- he goes all over the country talking to the vets and he knows the feel. It's not that he's with me. He likes what I'm doing the best.","But Al is a very independent guy and he'd go look at all of the different -- you understand though. But now you're with me. But Al would look at everybody out there and he sees who has the best, and who's going to do the best job for the vets. So I really appreciate Al being here. Al has actually, he's the big guy up in New Hampshire, and he wanted to come down here.","You have so many vets down here. They're so badly treated, so incredible. The illegals that come into the country are treated better than our vets, and we're going to change that around. So we're going to have strong borders. We're going to have really strong borders. We're going to have -- we're going to build a wall.","We're going to build that wall. It's going to go up. It's very simple to build. So 1,000 miles, the Great Wall of China is 13,000 miles. I think we can handle a thousand, right? We need a thousand, we have -- it's 2000 miles but we have a lot of natural barriers which are fine. But we're going to build a wall and it's going to be a real wall.","It's going to be a real wall, and people can come into the country, but they're going to come in legally. They have to go through a process and they're going to come in legally. So we're going to do the various things. And you know, this all started when on June 16th I came down. My wife actually said you know darling if you run you're going to win.","It's good that you have a wife who has confidence. But if you don't announce, you're never going to win because nobody's ever going to take polls of you, and you're never going to see -- yeah, but I want to take polls before I run. I don't want to like announce and then, it doesn't work out. She said don't worry about it, you announce you're going to win.","So sort of interesting. So they didn't want a poll and we announced, I announced, and literally from the beginning, once they found out I was willing to do it because it takes courage. It takes guts to run for president. This is not an easy thing in many respects. I'll tell you. And it's -- I don't care about the money.","But you know, to self-fund I never knew if I got the credit because you know, I'm the only one that's self-funding. I'm the only one, I'm putting up my own money and I'm in now for probably $25 million or close, and it's always a lot of money. Now, it's a fraction compared to what these guys are in because they're politicians, they have no idea how to spend money.","Sort of interesting. In New Hampshire, I spent $3 million, Bush spent $44 million. I came in first in a landslide and he was down at the bottom of the pack. Now, who do you want as your president? Anything. Now, when you think about it. If you think, I mean, you know, and everybody, I spend like, I think, less than anybody else.","And we get the best result. And wouldn't it be nice if our country could say that? We spent less than other countries and we had the best result. Education, we're number one for spending per pupil, by a factor that's so much higher, you wouldn't even believe it. By the way, we're getting rid of Common Core.","We're going to go local and you know. But we spent, we spent, so we spent so much -- second doesn't even exist, second place per pupil. So we're number one in spending. You have China, Sweden, Norway, lots of place, Denmark. All these countries, great educational systems. They spend far less than us per pupil, and we're number 30th in a list of 30. We're 30 in education.","So we're the worst and yet we spend the most. That's not what we want. So we're going to get things like that changed around. With military, with drugs, with so many other things, we buy things that they don't even want. The Generals don't want them. We drive -- we buy it because certain contractors have great political connections.","They've got better connections into the guys I'm running against, and we want to buy the equipment that they want. We don't want to buy equipment that they don't want because some firm has political -- have you ever see where they -- I'm sure you've seen it. Where we're buying a plane that we don't want even though the other plane they want and it's cheaper.","Only one reason, these guys get political contributions. There's only one reason and their lobbyists and their special interest on what to do. So we're going to change all that. We're going to get our budget back in whack and you're talking about -- and you know, we're going to make it better. It's not going to be where -- somebody said, well, will it be lean?","I said no, you're going to have a better cut. It's going to run better. With the waste, it's so incredible. For instance, if we bid out drugs, we're not allowed to bid out drugs. If we bid out drugs, we're going to save $300 billion a year. Can't think of it, $300 billion. I mean, who would think you don't bid out drugs.","Now, the reason is you don't bid them out because the drug companies are all funding these people. Not only them but all the Senate and the Congressmen and everything else. So it seems -- so that's why, I mean, we're going to do the right thing. I talk about -- often, I talk about the Ford plant that moved to Mexico.","Now, you saw last week, Carrier air conditioner. Anybody see that? Their Carrier, big thing. They're getting rid of all their jobs. They're letting everybody go and they're moving. Carrier, I'm not buying anymore. I buy a lot of air conditioners. I'm not buying anymore from Carrier. So they're moving to Mexico and the only way you stop them, I hate to say it, I'm a free trader but the only way and some Republicans would say, he is not conservative, you know, he is not a conservative person.","I'm common sense. The only way you stop them, move -- No, it's common sense. There's only one way you can stop them. You know, some guy would say, you can't charge them. Look, free trade is great. I'm for free trade but I'm also for smart trade, and I'm for trade like self-preservation. When these companies move to Mexico and then they make air conditioners.","They put them across our border, no tax, no nothing. We lose the jobs, we lose the factories, we lose the money. What do we get out of it? We get nothing. So they're moving to Mexico. So I would say, there's only one way to stop it and I went to Wharton, and I was a good student and all that's up. But you don't have to, you don't have to go to high school to know this.","You say very simply, enjoy your stay in Mexico. But every time you ship an air conditioner across that line, you're paying a 35% tax, folks. I'm sorry. And they're not going to leave. They're not leaving. They're not going to leave. Ford is $2.5 billion this money, right? That's a big plant. Now, I've been talking about it for a year and a half.","I think it's terrible. So they'll close up places in Michigan and all over. And they're building $2.5 billion. Now, yesterday I read in the papers that they're doubling down. They're going to go much bigger now. Now, they've decided they're going to go and build even bigger. And I say, that's fine. But you know what, they're closing up all those places.","We're losing American jobs. You're going to pay a tax. You're going to send those cars across the border, they have the illegals drive them right across the border. They say go for it. Sure, nobody checks because you know, under Obama it's like Swiss cheese, right? So they hop on a Ford car. They drive it across the border.","They come back, you know, back and forth, no charge. Don't worry about it. Let the dumb Americans pay, the dumb Americans with they're really dumb leadership. Let them pay. And we're not going to be called dumb anymore. We're going to become, we're going to become the smart country. We're going to be the smart country.","And I'm tired of it. I see these things, I see this Iran deal where we give them $150 billion. We get nothing. I, mean this was negotiated by people that are incompetent, and we get nothing. So these things, Sergeant Bergdahl, OK? We get Sergeant Bergdahl, a dirty rotten traitor, right? You see? Six people killed looking for him.","He left. He thought it was going to be a wonderful life. He'll go with, he'll go with ISIS or whoever he was looking to go with. He found that wasn't so good out there, right? They roughed him up a little bit, didn't they? I'd drop him right back in the middle of where the hell we found him. I would. I would.","I would do it. You know when I saw his parents, I saw his father, and I said, well, well what have we here, right? I said what have we here? That didn't look like Duck Dynasty, that was a shade different. I said, whoa, what's going on with the father here. And that was the first clue I had, right? What do I know?","What do I know? But we get Bergdahl and they get five of the best killers that they've been after for nine years that they covered it. And those guys are now back in the battlefield or soon will be, and they're looking to kill everybody including you and us and we get a traitor, OK? Five for one. I call him the five for one president.","This is what we have, we have people -- that's not business but it's business, it's trading. We don't get anything. We get treated horribly and not going to happen anymore. So I don't want any of your money, I just want you to go on Saturday. I want you to go out and vote which is tomorrow by the way. Hard to believe, right?","And in Iowa, we had a great time but we had a guy who cheated. I mean, you know, this guy Cruz, cheated. He really cheated. What he did to Ben Carson was a disgrace, OK? He cheated. Somebody just came up, you actually won Iowa and if the Republican Party had any guts, they would have terminated Cruz from that election because honestly, he cheated like a dog.","You know he holds up the Bible and then he cheats. And what he did with Carson was a disgrace where he said Carson had left the race. He's gone. He's gone. He left the race. Then he calls up Carson 10 minutes after the election ends, and he says, oh, we want to apologize. A lot of good it does, right? And then he does a voter violation certificate.","I have to tell you then -- and then he lies so much, but these politicians are bad. These are bad. These are dishonest people. Bad. I deal with businesspeople, you know, businesspeople like honest people compared to these politicians. These guys are the worst. But I was given some cover, I could talk about it because Rubio during the debate said, you're a liar.","I've never heard a politician call another politician a liar. But Rubio did so, once he did it, I said you're a liar because man does he -- he misrepresents. I'm the biggest guy on Second Amendment and he said, Donald Trump does not believe in the Second Amendment. I said that's exactly the opposite. And if you don't have a big voice, you can't, you know, you can't fight it. And maybe they'll apologize when the election's over.","But I don't want to apologize when it's over. I want to apologize before you get in the booth but tremendous. These politicians are bad news. So I think, we have a good chance of winning and if we win here, I'd think so. If we win here, if we win here, we have a tremendous chance of -- I think Nevada was great.","I've been -- I've got a lot of employees in Nevada, a great state, great place. I mean, it's caucus. So you never know with this caucus stuff. People walk in they're going to vote for Trump, all of a sudden they get into the spin rooms. It's -- the whole thing is ridiculous. I don't know if I like the caucus system too much, but it's what it is. You know, something nice about, you walk in, you vote, you leave, right?","Not you sit around for two hours and talk. But uh it's one of those things, but we have a very, very high approval rating in Nevada. So I think, we're going to do well there, and I think we're going to do fantastic in the SEC. We have the Tennessee thing coming up which is phenomenal. They've been unbelievable.","You know, they lost a big motor plant, too. They lost a big, a big plant. They're going to build a factory, a wonderful, wonderful place, and it ends up going to Mexico at the last minute. They were all set. They thought they had it. Ends up going to Mexico. Mexico is going to be the car capital of the world.","By the way, nothing against Mexico, nothing against China, great respect for China, I've made a lot of money with China. I have the biggest bank in the world as a tenant, 400 million customers this bank has. Think of it, 400 million. That makes Citibank look like a little, this like a little peanut. But they're my tenant in Manhattan and a great bank and I made a lot of money with condos.","I own the Bank of America building in San Francisco, a big chunk of it, and other buildings that I got from China, in dealing with China, tough dealing. Not easy dealing, tough dealing. They're tough and they're smart. But China's unifying and much -- Mexico's great, but their leaders are too smart for our leaders.","They're taking us to the clean -- and Mexico's beating us at the border, killing us at the border, killing us. When the pope came out, you know, he heard the Mexico side of the story. And tonight, he was, you know, and today, he was very nice. You probably heard, he put out a message that you know clean things up. But I will say, the pope was great and he's a very nice man.","But you know, he heard the Mexico side. We have to have a border and we have to stop illegal immigration. We have to stop all of the crime. We have 179,000 people that are criminals, right now. Illegal immigrants who are criminals, convicted criminals all over our country. What kind of a country is that?","It's not going to happen. It's not going to happen. They're out, we're getting them out. We're not putting them in our jails. Why should we -- they send them, and don't kid yourself. You remember what I said. They send them over here because they don't want to put him in the jails. It's expensive to put them in jails.","Millions and millions and millions of dollars for a few people, I mean, it's ridiculous. We're getting them out of here. We're getting them out so fast. Before the wall goes up, we're getting them out of here. Believe me. And our local police who are fantastic. The sheriff is here. Where is the sheriff? Where is the sheriff?","What a great sheriff he is, my man, he just said I love you, Mr. Trump. And you can say that I love you, right Sheriff? He's with me. But I think, I have all of the police. Thank you, Sheriff and I hear, does he do a great job? Great huh, look at these guys. I want your popularity.","I know I'd want it. Good. Thank you, Sheriff. That was a very nice statement, I appreciate. But I'm a big fan of the police, and I think, the police in this country have not been treated properly. You know you'll see, you'll see one event whether it's a mistake or you have a rogue. You know, you have a rogue problem, and it ends up being the biggest story for weeks and weeks and weeks, and they don't see the 99.99% of the great work that these people do. So you know, I have endorsements from everybody, the police.","We have a special relationship. And without the police, we're not here. We don't feel safe here. So important, and they've been treated unbelievably, I think, shabbily. So we're going to get that stopped. But we love our police and without them, it would be a much different country. That I can tell you. So Sheriff, thank you.","Thank all your men behind you. Thank you, men and women. So with that, I think, what we'll do is we'll take some questions. I just want to say that so we started in June. It was trade. It was borders. It was a couple of things and we had the problem. The big problem as you remember, in Paris where 160 people were killed, 130 people were killed, many, many, many in the hospital right now will never be the same.","Just brutally, brutally, I mean, many of them are going to die, actually. But, but really badly hurt. And when we talk about Second Amendment, if we had guns on the other side. There's a country that's the toughest gun laws in the world. Paris is the toughest in the world. Nobody has guns except the bad guys.","The bad guys have guns because they kept guns there. They put a gun in there. That's it. And if we had it in Paris or if we had in California, we had the 14 to two radicalized people, where she radically -- radicalized him. Who knows what happened. But they killed people, they gave them parties for their baby and gave them wedding parties.","They walked in, they killed 14 of them and others also the hospital, horribly hurt. If we had guns on the other side of those lines so that bullets could go the other direction also. You wouldn't have 14 people, you wouldn't have 130 people killed. That I can tell you. Would have been a whole different story.","So we have to protect our Second Amendment, folks. We have to protect it. And you know, people are really fighting it. And we have to protect a lot of our great institutions and a lot of our great things. But I tell the story all the time. I mean, if there were guns on the other side going in the other direction, it would have been a whole different story.","So that's that, but let's take some questions and go ahead, sir. Ah, we love Tom Brady, right? Look at the guy. How good, is Tom Brady the greatest? He's my friend. He's my friend, Tom.","We have to take jobs back from China, from Vietnam, from Mexico, from all of these countries that are just stripping us. From India, India is massive. We have to take jobs back from all of these countries, and we have to take back. We can't let it's -- we're being stripped. China has in my opinion done the greatest theft in the history of the world when they've taken.","They've taken our money, our job, millions and millions of jobs, thousands and thousands of plants and factories closed, and we've rebuilt China. We've got to bring them back. We're going to bring them back. And I'm saying, I want Apple, first of all, Apple ought to give the security for that phone, OK? What I think you ought to do is boycott Apple until such time as they give that security number.","How do you like that? I just thought it. Boycott Apple. Here's the thing. First of all, the phone's not even owned by this young thug that killed all these people. The phone is owned by the government, OK? Not even his phone. We don't even have to go that far. But Tim Cook is looking to do a big number, probably to show how liberal he is. But Apple should give up. They should get the security, you'll find other people.","When these two young people had bombs all over their apartment, on the floor, other people saw those bombs. Well, those people in a certain way are almost as guilty as the ones that did the shooting. We got to get to the bottom of it. And you're not going to get to the bottom of it unless we use common sense.","So I like the idea. Boycott Apple until such time as they give that information. I think that's a great idea. OK. Yes, yes, ma'am.","Well, the things that are the easiest are these executive orders that Obama signed because one good thing is -- the one really good thing is we can sign immediately, you can counter-sign and you knock out the executive orders. I mean, he's got an executive order where people can just pour into the country.","Now, the courts amazingly are stopping that right now, but at least temporarily. Who knows what's going to happen. But people are just literally pouring into the country. And I would get rid of that so fast. We end the court cases. Just get rid of it so fast, and others having to do with the Second Amendment, having to do with rules and regulations.","He's at a point where he can't get anything passed so he just signs executive orders. It wasn't supposed to be that way. So I would get rid of that very fast, OK? Sure.","You're not a senior.","OK.","She didn't look like you're senior.","Well, first of all, you know the other candidates aren't talking about races. They're talking about cutting your Social Security.","I'm the only one that's not cutting. I'm bringing the jobs back. I want to make our country rich again, and we're going to keep our Social Security. And you're not cutting the ages and you're not cutting it down at all. Every other person but me is cutting entitlements, and they're cutting Social Security.","So we're going to save Social Security. It's like I said, the medicine, $300 billion a year. That's one aspect. And it was given to me by a friend of mine who's a doctor. He couldn't understand why. As soon as he told me, I understood why. It's because of the guys that get all the contributions. All right, representing.","You know, as an example, Woody Johnson. Good Guy, Johnson & Johnson. He's in charge of Bush's campaign finance committee. Now, when Bush goes, he's never going to win. Bush has less chance than let's see, do we have any children in the room? But, but assuming he did win. Do you think Bush is going to negotiate the -- I mean, give me a break.","The head of the pharmaceutical industry is the head of his campaign. So that's now the way it works. So we're going to make our country rich again. We're going to find all of these things, there's so many. That's one, that's one that I found in about two seconds. There's so many of them. The military has so many.","We're going to make the military so strong, but we're going to make it better for less money. You know, you can build -- how? I just told you. Who said that? Oh, I just told you, darling. How? It's easy. Number one, and you have to do this, you have to get the equipment that we want. You have to take care of people.","You have to take care of our military because our military, and we don't want to use our military. Honestly, we don't want to use our military. But we're being scoffed at right now, and we never fight to win. You know, when we were all younger, many of you are my age and many of you are younger. But when we were all younger, we didn't lose so much, right?","We don't win anymore. As a country, we don't win and we're going to start winning again. We're going to win so much, you're going to get tired of winning you're going to say, please Mr. President, I have a headache. Please don't, don't win so much. This is getting terrible and I'm going to say no, we have to Make America Great Again.","You're going to say, please. I said, nope, nope, we're going to keep winning. We're going to Make America Great Again. But by that time, I'll be able to take the again off. We're going to just have America be great, OK? So that's it. Go ahead, Al.","I am, too.","Well, we're going to look at that very much. I mean, we can balance the budget. Do you know that a balanced budget -- I was talking to one politician. He wants to balance the budget over the next 25 years. You've heard that too, 25 years. We're going to get the balanced budget and we're going to have a better country.","And we're going to have -- somebody was saying, well, if you balance the budget, what are you going to get rid of? There's so much waste, fraud, and abuse. We're not going to get rid of anything. You're going to have a better country. We'll have better service. Spend less money, we'll have better service.","We'll get it balanced. You watch. OK. Well, you watch. Yes, ma'am. Go ahead.","Yeah, well, the Bernie thing. I'll be honest, I don't like to speak badly about Bernie. I'll be honest because I sort of want him to win so badly. Do -- Does that make sense to you? I'm torn. He's so easy to hit. And nobody hits him and Hillary's afraid to hit him, and she's been brought very far left and Hillary's got bigger problems in my opinion, right?","Do you ever see how nice she is to Obama? Oh, our president is so wonderful. He's so great. He's you -- yeah, you know why she's so nice, right? Believe me. I know why she's so nice. I know why she's so nice. I've never seen her like that. She panders to the president. She doesn't even like him, but she's pandering and everything.","Oh, our president has done such a good job. One of the worst presidents in history. So I hate, I hate to hit Bernie though because I'd much rather go against him. Now, I'd like to go against Hillary. I'm actually torn. I don't like, almost saying bad things against either because I sort of running -- want to run against both.","Is there any way I can run against both, OK? So we'll see but we're going to show you what's going to happen that the whole thing is -- the whole thing is ridiculous. This is not going to happen. Yeah, go ahead.","I'm pro-life. I'm pro-life. This is going to be huge. Aw, that's cute. That's cute. You made that? Yeah, pro-life, honey. Thank you. Cute. Thank you. It's very nice. You live here? Do you -- are you on the job? Very good. You're a little younger than some of the people in this place, right? We're going to have a lot of -- we have a young, we have a tremendous young group of people that like us. I think in the end, more so than Bernie, we just gave a speech 7,000; 8,000 people a little ways away.","And I'll tell you, the people were so young. It was amazing. Thank you very much. It's very nice, pro-life, OK? Let's see. Come on back here. Yes, sir. Go ahead. With a beautiful yellow sweater and a nice pen. Thank you for the pen.","Oh, beautiful, beautiful. I can see. Beautiful.","Do you notice that Obama never called Kate or the parents?","Right? You ever think of that? His Kate was killed by an illegal immigrant, came in five times at least, probably much more than that. Sanctuary city meaning, protection. Basically, it's a protection of criminals, I'll end sanctuary. First of all, defund sanctuary cities very quickly. If you're an illegal immigrant, you go through the same scrutiny.","You know, I have a friend, you know, Jamiel, who you've seen, he's incredible. In fact, we put him in a comm -- he lost his son, his magnificent son. He was going to go to college on a scholarship. He was shot in the face three times going home to his father. Just walking down the sidewalk. Great kid, like an incredible kid.","The father's an incredible guy. He's like a friend of mine now, and what this guy's gone through is like incredible. And I will tell you, you look at what's going on and you look at the kind of things that are going on with sanctuary cities and everything else. And one of the people because I've gotten to know so many people who have had daughters and sons and brothers and wives and everything else killed.","Killed. Viciously, violently killed by illegal immigrants. And it's so sad to talk to them and they tell me that the police go after them and the authorities go after them. When they find their illegal immigrants, it stops. It's like they stop. They can't get involved because it's so hard to do anything against an illegal immigrant.","They're rough and tough and smart. But when it comes to getting -- going after and maybe the sheriff would know even why this is, but they complain that when they hear it's an illegal immigrant they killed somebody or did some really harm to somebody. It's like becomes a whole different subject, and they don't go after him the same way.","Now, we're going to defund sanctuary cities. We're getting rid of sanctuary cities, and Kate was incredible, and horrible what happened. And to many other people, not just Kate. Yes?","Well, I'll tell you in business, we have Carl Icahn endorsed me, who's a great businessman. So for trade, you know, I don't want military people for trade. I want our great businesspeople. We have the greatest businesspeople in the world. We don't use them. I told you before, we use political hacks. And for trade, 100% we're going to use Carl Icahn.","We're going to use all of these great businesspeople, many of whom endorsed me. All of them want to endorse me. In fact, some of them want to endorse me and they want to have a news conference. I said nobody knows who you are. They might be worth $2 billion but nobody knows who you are. But these are the greatest negotiators.","We have the greatest negotiators in the world but we don't use them. When we lose $500 billion a year with China, $500 billion. It's more than that actually, but $500 billion a year with China. That won't happen with Carl Icahn in charge of a trade deal. That won't happen with other people who I won't use their names yet, but we have the greatest people in the world.","They all want to help. They don't want money. They don't want to have like, oh, they're going to get $200,000 a year. They don't want that. They don't want it. Their very rich people in many cases and just about all cases. That's why they negotiate well. But they're like chess masters, they're like Grand Masters.","That's what we need negotiating because we are being taken to the cleaners on trade like you've never seen. Military, we're going to find the best military. In other words, we're going to find the best people in the different categories. Trade's the easiest one to think about and you know, again, when I started, it started to be with trade and then border and the border was very important.","I mentioned during the speech, boy did I take heta, right? But then, they found out I was right. However, the other day one of the candidates, I saw him. We will build a wall. I said, where was this guy for the last 20 years? I said, well, my wife said, darling, did you hear he said he wants to build a wall.","Ay, what a bunch of losers. We will build a wall. And then I heard a second one the other day say the same thing. We'll, we're going to build a wall. The only thing is we're going to build it. Mine's going to be real. They don't know how to build walls. I know how to build real walls and, and that'll look very nice and very good.","But there's a big difference in building talent. The other thing, there's no way they get Mexico to pay for it. I get Mexico to pay for it, OK. Yes, ma'am?","That's true. I have a great campaign manager. Go ahead.","I'll tell you, it's a question I get so much, so much, colleges. And what's happened with college is a shame because these people that run the colleges are going through the roof. They don't care because the kids are like a conduit for money from the Federal government. So a kid goes in gets all the money he wants or her, gets all the money, goes to the colleges.","The colleges have totally lost control of their costs and it's costing so much money and they're spending so much money and the salaries for the top people are astronomical. And they don't care because they're getting the money from the Federal government. Unfortunately, the kids are the ones that are all your conduit, they have to pay for it. Does everyone understand that?","Like it's a really bad system. So the kids borrow more money, more and more money, the costs of colleges is gone up more than practically anything, far more than inflation, far more than any of your businesses because these guys figure what the heck. I mean, we're getting all this money essentially from the government and it's going to stop.","We're going to find out. It's going to stop but we've got to do something to help the kids because some of these kids are choking with that. And here's the problem, they get out of college and they can't get a job because we don't have any jobs. Don't believe the 5% stuff. We don't have 5% it's 25%, and many people are part-time.","You know, they're people that have worked for 30 years as full-time employees, all of a sudden are taught by the same boss, in the same factory that it's part-time. Your job is now part-time. They're never a part-time job in their life. Now, they have to get another second job someplace. We have it bad because of Obamacare.","That's exactly right. Because they have to keep under the threshold for Obamacare. This way, they don't have to pay the penalties and all the problems, right? Obamacare is a disaster. And I said it, I'll say it 15 times, repeal, replace, it's going to happen. But it's because of Obamacare. You're exactly right.","So the job numbers, it's 5%, but when you look for a job and you give up, which most people do. They look for a job, they give up. And then, statistically, you're considered employed, OK? That number was put to make presidents and politicians look good, OK? It's not a real number. We probably have a 25% unemployment number.","And you know what? If we didn't, if we had a really 5% unemployment, even with security, they like me for security, they like me for a lot of things. I doubt I'd be getting 25,000; 35,000 people coming into stadiums to see me, in all fairness, if we had a really 5% unemployment rate. People are very unhappy.","And remember this, the other thing that was reported accurately, there are very bad jobs. There are horrible jobs. These are not jobs where you're doing what you want to do and what you were educated to do. These are horrible jobs. So I just want to tell you that we're going to have to do something for the kids because we have kids choking on debt.","The debt is higher than it's supposed to be because the colleges have gone out of control in their cost. They've gone out of control in their cost, and that's human nature. Even the colleges, they sort of blamed them. But in a way, I say, you know, the Federal government is giving the money. The only thing is they go boom, boom, and then it goes from the student then.","They have lost, they haven't lost control, they purposely, they've raised it through the sky. And you look at what some of these people are making now. It's ridiculous and the kids are paying. So we're going to come up with a solution for the kids because the kids are two things; they're choking, they're choking on debt and they just don't see any way of doing it, and they can't get jobs.","You have kids go to great colleges. They work hard. They graduate high in their class. They're wonderful kids, wonderful students. They come out, they can't get a job. We're going to work on something that's going to be very good, I think, OK? It's such a great question and I hear it more than anything else.","Yes, ma'am. Go ahead.","I got it, Al. My stance on coal is very simple. We right now are destroying an industry. We are destroying an industry and coal was, you know, it did things for us for many, many years. And we send our coal to China and China burns the coal and whatever -- they have no cleaning method. They don't care about it. I felt -- feel very strongly, you know, they have clean coal now.","They have machinery that cleans coal. And my stance on coal is very positive. Unlike Obama, where he's closing all of the mines, all of the miners. I know what's happening and believe me, and you know, they're talking about a lot of these other deals where they're talking, you know, wind. The wind is very tough because those windows are very, very expensive and they kill the birds, and they look very terrible.","Isn't it amazing the way the environmentalists love the windmills and yet, they kill all the birds? In California, if you kill a bald eagle, they put you in jail for five years. And yet, the windmills knock him out like, like flies. It's crazy. It's crazy. And then, the environmentalists say how great they are, how great they are.","The problem with wind, it's very expensive, they're very expensive to do. They really litter the landscape in my opinion. I mean, it's OK putting it in industrial locations and things. But when you see some of these fields, especially when you see like 15 different manufacturers, they're all different shapes colors, sizes, it's terrible, it's terrible.","You go to certain places in California where they have these, these areas, where everybody has their own little niche, and you see all of these different wind farms. You know, the places I'm talking about. I won't even mention. Why should I disparage in different places. I know I have too many friends that have houses there, they're going crazy.","But so -- wind is very tough. Solar, I love the concept of solar just doesn't work yet. It's a 30-year payback. And don't forget, then you have to buy new stuff before 15 years. You know, it doesn't last forever. Same thing with wind, you put up the wind, five years later, it's, it's rusted, it's rotted.","You have to replace it. It's not like it's there forever, but the coal has been there forever. We have an unlimited supply, and we send it to China. We send our coal to China. Do you think China cleans the coal? I don't think so. I don't think so. So I really believe strongly in clean coal. They have great equipment, they have great -- and I'm very bullish.","If I get in, I'm very bullish on the coal industry. Clean coal, OK? Thank you. Yeah. Go ahead.","He's a young Donald Trump. See that?","Very, very strong. Very, very strong, OK? I mean, I don't want to speak against myself, in all fairness. Very strong. You keep owning that property. Go ahead, sir.","Well, the Republicans have a problem -- I love the question. The Republicans have a problem. We have a structural problem. Number one, you have to win those six states. One of the advantages, I have, I have a chance of winning New York. You win New York, it's over because New York is so big. No other Republican has even a chance of winning New York.","So I have a chance to win New York. I'll win Michigan which is not even in the ballgame for one of the Republican people to win. But we also have people that are really bad. Karl Rove is very bad. He's in my opinion, he's close to incompetent. No, he's, he's good at raising money and then he spends the money, loses it. Does the worst ads I've ever seen.","Karl Rove is a bad guy, and he's, you know, he's just a bad guy. George Will is a bad guy. Stephen Hayes is a bad guy. I think Charles Krauthammer is a bad guy and bad guy. Now, I know, I know, I know. You can have them, OK? You can have them. No, I think he's a bad guy. I think we have a lot of people that are bad, really bad people.","And I think, they're petty. I think they're jealous. I think they've got a lot of problems. And we have a lot of people that are very bad for the Republican Party. We need new thinking. We have to have new thinking. Well, you're not going to have a party much longer. Look Romney should've won that last election, he lost by a lot, right?","He shouldn't have lost it. Romney had that election. We had a failed president. We had guys working like Karl Rove with raised millions and millions of dollars. Did some of the worst ads I've ever seen. And Romney lost the election. I mean, he should be president and we should have, you know, be re-electing Romney, again.","But he was -- he ran a horrible campaign, in all fairness. But you had a failed -- you had a failed system. You had a failed party. And I'll tell you if we don't win, you know, it's interesting. I backed Romney. He lost. I back McCain. He lost. This time, I said I'm doing it myself, OK? Enough of it. So I just want to thank -- there's an amazing group of people.","I'd love to play you in golf. I'll take my club champion over. I'd love to play you in golf but I'm not going to play much golf because there's a lot of work to be done. You know, Obama talks about the carbon footprint, right? The carbon footprint. He's always talking about the carbon footprint. And then he flies to Hawaii on a 747 with his family for Christmas.","He's there forever. I mean, he plays more golf than people on the PGA Tour. But he then flies back and then he has a news conference on the carbon footprint. I mean, give me a break. So you know, but if you're president -- we have a lot of work to be done. And playing golf is good. But you have to play with people that you have to make deals with.","You play with Congress, right? You play with Congress. You play with different people that you have -- You play with people from other countries. You play with prime ministers. You don't play with your friends. You play with people where -- because golf is amazing. Golf, you develop relationships on a golf course that you practically can't do anywhere else.","So it's great but you got to play with the people that are going to do good for the country. But I wouldn't be playing much. You know you go to the White House. I want to make do trade deals. I want to make do military deals. I want to buy the best equipment for the military. I want to make sure that we have the right, everything right.","There's so much to do that I wouldn't want to fly around and even all these meetings. You know, fundraisers, he gets on a 747, he spends $2 million or $5 million to fly to a location to raise a million dollars. Think of it. They spent $5 million, $5 million to go and, and go someplace and they raise $1 million.","Oh, we had a great fundraiser last night but it cost $5 million. When you turn on the engines of a 747, let me tell you. We're talking big money. Then you have all of the Secret Service who by the way are incredible people. They're all over the room, right? They're all over the room. They're incredible people.","But when you have all of the Secret Service and all of the tremendous cost of the plane, the 747 which I guess they ordered a new one. But these are the big old engines, and you know, you spend all of these millions and millions of dollars and you close down New York City. I mean, you have to go through it all the time.","He's in for a fundraiser, you go in -- I'd say what's wrong? I don't even ask anymore. I say the president's in town, the entire city is shut, right? You know what I'm talking about. The city is shut down. How do you spend $4 million, $5 million to do a fundraiser to make -- raise $1 million, OK? But that's the way it is. I think I'll try and do my fundraiser -- I hear you're not allowed to do that maybe in the White House.","So we'll do them in a hotel next door. We'll do it -- but one of my hotels, we'll do it. I don't care. I'm building one right next to the White House. I don't care. I don't want to -- I don't want to use it if it's a conflict of interest. I don't -- but seriously, instead of getting into a plane, use some room in Washington.","Maybe you can use the White House and have it. But use some room, which I don't think you can, but use some room -- who? We could. We could. We could use the old post office, but that would be good. But, but, you know, spend millions and millions of dollars, and this is the thinking of our country. So I just want to tell you that tomorrow we're going to Make America Great Again.","Tomorrow is so important that you get out and vote. We have a movement going on. I want you to read Time Magazine from last week. It was such an incredible story. It was so respectful of what we've done and not me, us. I'm like a messenger. But if everything works out well, like it did in New Hampshire, the people of New Hampshire were unbelievable.","I was going to win by 28 and we ended up with 36. And it was just a landslide. It was an incredible show. Every single category men, women, we won every category. And if we could do the same, and we're going to send a mandate. We're going to send a mandate to the world, in a sense, it's to the world. Not just here, it's to the world that we're back.","That we're back and that we're going to take our country back, and that we're going to have an amazing country again. And it's going to be run by really, really top of the line people. And we're going to run it the way we have to run it. And you're going to be so proud. And I hope that in two years, three years, four years, you're going to remember this meeting and, you're going to say that was a great meeting.","And that was the beginning of Making America Great Again. So I want to thank you very much. I hope you can go out and vote tomorrow. I hope, hope, hope. I don't want your money. I want your vote and I love you all. Thank you, everybody. Thank you. Thank you. Thank you very much. Good question. Thank you, everybody."],"text":" Thank you very much. Do you know how many people are outside? Do you know what's going on out there? You know how lucky you are? You're lucky not to have it, but boy are you lucky anyway. Just to be here. Oh, you're the club champion, congratulate -- I'm a club champion. I mean, many times, club champion, would anybody believe that? You know what it means? You can handle pressure. Don't kid yourself. You know, to be a club champion, it takes a special something, right? You know, no strokes, he's talking about no strokes. Not these guys that say, I'm a club champion, they've got 10 handicap, right? Cuts a -- so what's your handicap? I got an eight. Eight, that's pretty high, but that's not bad. That's not bad. And you beat people that are lower, I'll bet, right? Very good. Congratulations. So yeah, there's a tremendous crowd of people outside. Unbelievable and it's great to be with you all. We're going to do something. See that hat Make America Great Again. That's what we're going to do. We're going to Make America Great Again. And I just want to thank you. This is a beautiful part of the world by the way. This is a beautiful club, too. How many people are members here, a lot of you? Yeah, it's beautiful. I like it. Maybe we should buy it. I don't know. Should we buy it? No, I -- the course, the course looks fantastic. So I thought we'd go and maybe we'll do a few question and answer. We'll do a little bit of talking. You've heard a lot of what I have to say. But you know, it started this -- yeah, sit down. Do you have seats? Yes, thank you. Better, right? It's been an amazing, it's been an amazing time. We started on June 16th and everybody said, oh, he'll never run. All these pundits, you know, these total morons, like Karl Rove and people that don't, that don't -- they don't even have a clue. And they said, well, he'll never run. And if he runs, he'll just have a good time and he's not going to do it because why would he want to do it. And you know, he built a great business, why would he want to leave that? I want to do it because we are going to Make America Great Again. We are in such trouble as a country. We owe $19 trillion. We have wars that we can't win. We can't beat ISIS. Can you imagine General MacArthur saying we can't beat ISIS? He'd have ISIS wiped out in about a half a day. So we're going to do something that, you know, the Time Magazine last week, you probably saw -- it's like, it's a movement. They said it's a movement. It was the cover of Time Magazine and they've been very nice. They put me on the cover all the time. I've had so many -- I never had so many covers on Time. All my life, I think, I was run twice now, I'm on all the time. But we have a movement going. It's a really -- I have to get used to it. No, it's always an honor. But, but the last story was so good. It's such a great writer and talked about it as a movement and I mean, you see it in here. This room is full. But why are these three seats empty, huh? Who's seats are they? There is -- somebody sit there. I hate to see an empty seat. Somebody sit over there. I'll go ahead, but great Al, one of the great vets of the country. Somebody sit there, right? I never like to see empty seats. There's never an empty seat for Trump, right? Because it's representing what we're doing, it's representing the movement. But there is, there's a movement going on that's incredible. And no matter where we go, we have 25,000; 35,000 people. More than that, we have 20,000 people in Oklahoma twice, and New Hampshire we had a tremendous victory last week in New Hampshire. And hopefully, you folks are going to go out and vote on Saturday, and some of you have probably voted already, have you voted? Anybody? A lot of people have voted already. They could vote -- thank you. You voted, yes? Thank you. Otherwise, I'd say get out of this room. But, but things are happening that's amazing. And I think, we're hopefully -- we're going to do very well tomorrow. We just had the Emmerson poll, Emerson's a great, great poll. And one of the most accurate. I think they were the ones that got it really right last time or the last two times. And the Emerson poll, we just got great numbers with -- for South Carolina, and they really did a great job last time. So we're honored to have that. We were at 35 or 36, and I think, second was 19 or 18. We had a big, big, big lead, but you know, we just assume we're tied because it's much better to -- Right? As young guys, you have to always assume you're tied. In fact, assume you're down, that's even better, right? We assume we're down and the -- but we have to get out and vote because if we don't get out and vote, there's no movement, there's no anything. So when it started, it started as trade because it used to drive me absolutely crazy to watch these incompetent, stupid deals where China would consistently outdo us at the trading table, and we used people that are political hacks. We'd ever use our right people. We don't use our great businesspeople. We have the greatest businesspeople in the world, like in the world, and we don't use them. We use political people, people that get there because they make campaign contributions to some politician, and it would drive me crazy. Then, of course, I was a very big contributor and I know the power of a contributor, and all of these politicians that I'm running against, you know, you look at like, you look at Cruz, you take a look at what he gets from the oil industry and from other industries. You look at Jeb Bush, the head of his campaign is pharmaceutical, Woody Johnson of Johnson & Johnson. So what it comes down to bidding out drugs -- we're the largest drug purchaser in the world. They're not going to bid out the drugs. We would save $300 billion a year in this country if we bid out drugs. You know, we don't beat them out. I just found out a friend of mine who's a doctor, called me and said, we don't bid out drugs that -- the biggest in the world. Can you imagine? We pay like almost the same as you'd pay if you walk into a drugstore. We're prohibited from bidding. I don't even know why that is. I mean, I do know why because these Senators are controlling the purse strings. I mean because they're all paid off by campaign contributions. So I'm self-funding, I get no money from these people. I don't want any of their money. I could have so much money. I turned down so much money. They come in, you know, I've been the front runner. Well, it's one of those things. I've been, I've been the front runner, practically from June 16th, and when you're the front runner, sort of like the Apprentice. I could have had anything. They wanted to extend the Apprentice for a long time and the head of Comcast, Steve Barker who's a terrific guy, came up to my office before I announced. He said we want to do it. We want to do it. We want to extend and you know, we had a great run, and it's a lot of money. When you have a successful show they pay you anything. But I couldn't do it because I was doing this and I said Steve, I can't. I'm doing this. And he didn't sort of believe me. He said, oh, you're really not, you're really not. And they announced an extension which was a little confusing to people because they kept saying, I'm not going to do that. So we have Arnold Schwarzenegger doing it. How's Arnold going to do? You think? Could be good, right? Well, we're going to find out soon enough, right? You got to be very fast. When Omarosa goes after you, boom, boom, you've got to be quick, and you've got to be fast. So we'll find out if he's fast. But so it's -- you know, it's just something that I wanted to do because we can save so much money. We can make such great trade deals. We have to rebuild our military. Our military's depleted. We have to take care of our vets. Al Baldesarra is back here and Al is a great vet, he loves the vets that is -- he goes all over the country talking to the vets and he knows the feel. It's not that he's with me. He likes what I'm doing the best. But Al is a very independent guy and he'd go look at all of the different -- you understand though. But now you're with me. But Al would look at everybody out there and he sees who has the best, and who's going to do the best job for the vets. So I really appreciate Al being here. Al has actually, he's the big guy up in New Hampshire, and he wanted to come down here. You have so many vets down here. They're so badly treated, so incredible. The illegals that come into the country are treated better than our vets, and we're going to change that around. So we're going to have strong borders. We're going to have really strong borders. We're going to have -- we're going to build a wall. We're going to build that wall. It's going to go up. It's very simple to build. So 1,000 miles, the Great Wall of China is 13,000 miles. I think we can handle a thousand, right? We need a thousand, we have -- it's 2000 miles but we have a lot of natural barriers which are fine. But we're going to build a wall and it's going to be a real wall. It's going to be a real wall, and people can come into the country, but they're going to come in legally. They have to go through a process and they're going to come in legally. So we're going to do the various things. And you know, this all started when on June 16th I came down. My wife actually said you know darling if you run you're going to win. It's good that you have a wife who has confidence. But if you don't announce, you're never going to win because nobody's ever going to take polls of you, and you're never going to see -- yeah, but I want to take polls before I run. I don't want to like announce and then, it doesn't work out. She said don't worry about it, you announce you're going to win. So sort of interesting. So they didn't want a poll and we announced, I announced, and literally from the beginning, once they found out I was willing to do it because it takes courage. It takes guts to run for president. This is not an easy thing in many respects. I'll tell you. And it's -- I don't care about the money. But you know, to self-fund I never knew if I got the credit because you know, I'm the only one that's self-funding. I'm the only one, I'm putting up my own money and I'm in now for probably $25 million or close, and it's always a lot of money. Now, it's a fraction compared to what these guys are in because they're politicians, they have no idea how to spend money. Sort of interesting. In New Hampshire, I spent $3 million, Bush spent $44 million. I came in first in a landslide and he was down at the bottom of the pack. Now, who do you want as your president? Anything. Now, when you think about it. If you think, I mean, you know, and everybody, I spend like, I think, less than anybody else. And we get the best result. And wouldn't it be nice if our country could say that? We spent less than other countries and we had the best result. Education, we're number one for spending per pupil, by a factor that's so much higher, you wouldn't even believe it. By the way, we're getting rid of Common Core. We're going to go local and you know. But we spent, we spent, so we spent so much -- second doesn't even exist, second place per pupil. So we're number one in spending. You have China, Sweden, Norway, lots of place, Denmark. All these countries, great educational systems. They spend far less than us per pupil, and we're number 30th in a list of 30. We're 30 in education. So we're the worst and yet we spend the most. That's not what we want. So we're going to get things like that changed around. With military, with drugs, with so many other things, we buy things that they don't even want. The Generals don't want them. We drive -- we buy it because certain contractors have great political connections. They've got better connections into the guys I'm running against, and we want to buy the equipment that they want. We don't want to buy equipment that they don't want because some firm has political -- have you ever see where they -- I'm sure you've seen it. Where we're buying a plane that we don't want even though the other plane they want and it's cheaper. Only one reason, these guys get political contributions. There's only one reason and their lobbyists and their special interest on what to do. So we're going to change all that. We're going to get our budget back in whack and you're talking about -- and you know, we're going to make it better. It's not going to be where -- somebody said, well, will it be lean? I said no, you're going to have a better cut. It's going to run better. With the waste, it's so incredible. For instance, if we bid out drugs, we're not allowed to bid out drugs. If we bid out drugs, we're going to save $300 billion a year. Can't think of it, $300 billion. I mean, who would think you don't bid out drugs. Now, the reason is you don't bid them out because the drug companies are all funding these people. Not only them but all the Senate and the Congressmen and everything else. So it seems -- so that's why, I mean, we're going to do the right thing. I talk about -- often, I talk about the Ford plant that moved to Mexico. Now, you saw last week, Carrier air conditioner. Anybody see that? Their Carrier, big thing. They're getting rid of all their jobs. They're letting everybody go and they're moving. Carrier, I'm not buying anymore. I buy a lot of air conditioners. I'm not buying anymore from Carrier. So they're moving to Mexico and the only way you stop them, I hate to say it, I'm a free trader but the only way and some Republicans would say, he is not conservative, you know, he is not a conservative person. I'm common sense. The only way you stop them, move -- No, it's common sense. There's only one way you can stop them. You know, some guy would say, you can't charge them. Look, free trade is great. I'm for free trade but I'm also for smart trade, and I'm for trade like self-preservation. When these companies move to Mexico and then they make air conditioners. They put them across our border, no tax, no nothing. We lose the jobs, we lose the factories, we lose the money. What do we get out of it? We get nothing. So they're moving to Mexico. So I would say, there's only one way to stop it and I went to Wharton, and I was a good student and all that's up. But you don't have to, you don't have to go to high school to know this. You say very simply, enjoy your stay in Mexico. But every time you ship an air conditioner across that line, you're paying a 35% tax, folks. I'm sorry. And they're not going to leave. They're not leaving. They're not going to leave. Ford is $2.5 billion this money, right? That's a big plant. Now, I've been talking about it for a year and a half. I think it's terrible. So they'll close up places in Michigan and all over. And they're building $2.5 billion. Now, yesterday I read in the papers that they're doubling down. They're going to go much bigger now. Now, they've decided they're going to go and build even bigger. And I say, that's fine. But you know what, they're closing up all those places. We're losing American jobs. You're going to pay a tax. You're going to send those cars across the border, they have the illegals drive them right across the border. They say go for it. Sure, nobody checks because you know, under Obama it's like Swiss cheese, right? So they hop on a Ford car. They drive it across the border. They come back, you know, back and forth, no charge. Don't worry about it. Let the dumb Americans pay, the dumb Americans with they're really dumb leadership. Let them pay. And we're not going to be called dumb anymore. We're going to become, we're going to become the smart country. We're going to be the smart country. And I'm tired of it. I see these things, I see this Iran deal where we give them $150 billion. We get nothing. I, mean this was negotiated by people that are incompetent, and we get nothing. So these things, Sergeant Bergdahl, OK? We get Sergeant Bergdahl, a dirty rotten traitor, right? You see? Six people killed looking for him. He left. He thought it was going to be a wonderful life. He'll go with, he'll go with ISIS or whoever he was looking to go with. He found that wasn't so good out there, right? They roughed him up a little bit, didn't they? I'd drop him right back in the middle of where the hell we found him. I would. I would. I would do it. You know when I saw his parents, I saw his father, and I said, well, well what have we here, right? I said what have we here? That didn't look like Duck Dynasty, that was a shade different. I said, whoa, what's going on with the father here. And that was the first clue I had, right? What do I know? What do I know? But we get Bergdahl and they get five of the best killers that they've been after for nine years that they covered it. And those guys are now back in the battlefield or soon will be, and they're looking to kill everybody including you and us and we get a traitor, OK? Five for one. I call him the five for one president. This is what we have, we have people -- that's not business but it's business, it's trading. We don't get anything. We get treated horribly and not going to happen anymore. So I don't want any of your money, I just want you to go on Saturday. I want you to go out and vote which is tomorrow by the way. Hard to believe, right? And in Iowa, we had a great time but we had a guy who cheated. I mean, you know, this guy Cruz, cheated. He really cheated. What he did to Ben Carson was a disgrace, OK? He cheated. Somebody just came up, you actually won Iowa and if the Republican Party had any guts, they would have terminated Cruz from that election because honestly, he cheated like a dog. You know he holds up the Bible and then he cheats. And what he did with Carson was a disgrace where he said Carson had left the race. He's gone. He's gone. He left the race. Then he calls up Carson 10 minutes after the election ends, and he says, oh, we want to apologize. A lot of good it does, right? And then he does a voter violation certificate. I have to tell you then -- and then he lies so much, but these politicians are bad. These are bad. These are dishonest people. Bad. I deal with businesspeople, you know, businesspeople like honest people compared to these politicians. These guys are the worst. But I was given some cover, I could talk about it because Rubio during the debate said, you're a liar. I've never heard a politician call another politician a liar. But Rubio did so, once he did it, I said you're a liar because man does he -- he misrepresents. I'm the biggest guy on Second Amendment and he said, Donald Trump does not believe in the Second Amendment. I said that's exactly the opposite. And if you don't have a big voice, you can't, you know, you can't fight it. And maybe they'll apologize when the election's over. But I don't want to apologize when it's over. I want to apologize before you get in the booth but tremendous. These politicians are bad news. So I think, we have a good chance of winning and if we win here, I'd think so. If we win here, if we win here, we have a tremendous chance of -- I think Nevada was great. I've been -- I've got a lot of employees in Nevada, a great state, great place. I mean, it's caucus. So you never know with this caucus stuff. People walk in they're going to vote for Trump, all of a sudden they get into the spin rooms. It's -- the whole thing is ridiculous. I don't know if I like the caucus system too much, but it's what it is. You know, something nice about, you walk in, you vote, you leave, right? Not you sit around for two hours and talk. But uh it's one of those things, but we have a very, very high approval rating in Nevada. So I think, we're going to do well there, and I think we're going to do fantastic in the SEC. We have the Tennessee thing coming up which is phenomenal. They've been unbelievable. You know, they lost a big motor plant, too. They lost a big, a big plant. They're going to build a factory, a wonderful, wonderful place, and it ends up going to Mexico at the last minute. They were all set. They thought they had it. Ends up going to Mexico. Mexico is going to be the car capital of the world. By the way, nothing against Mexico, nothing against China, great respect for China, I've made a lot of money with China. I have the biggest bank in the world as a tenant, 400 million customers this bank has. Think of it, 400 million. That makes Citibank look like a little, this like a little peanut. But they're my tenant in Manhattan and a great bank and I made a lot of money with condos. I own the Bank of America building in San Francisco, a big chunk of it, and other buildings that I got from China, in dealing with China, tough dealing. Not easy dealing, tough dealing. They're tough and they're smart. But China's unifying and much -- Mexico's great, but their leaders are too smart for our leaders. They're taking us to the clean -- and Mexico's beating us at the border, killing us at the border, killing us. When the pope came out, you know, he heard the Mexico side of the story. And tonight, he was, you know, and today, he was very nice. You probably heard, he put out a message that you know clean things up. But I will say, the pope was great and he's a very nice man. But you know, he heard the Mexico side. We have to have a border and we have to stop illegal immigration. We have to stop all of the crime. We have 179,000 people that are criminals, right now. Illegal immigrants who are criminals, convicted criminals all over our country. What kind of a country is that? It's not going to happen. It's not going to happen. They're out, we're getting them out. We're not putting them in our jails. Why should we -- they send them, and don't kid yourself. You remember what I said. They send them over here because they don't want to put him in the jails. It's expensive to put them in jails. Millions and millions and millions of dollars for a few people, I mean, it's ridiculous. We're getting them out of here. We're getting them out so fast. Before the wall goes up, we're getting them out of here. Believe me. And our local police who are fantastic. The sheriff is here. Where is the sheriff? Where is the sheriff? What a great sheriff he is, my man, he just said I love you, Mr. Trump. And you can say that I love you, right Sheriff? He's with me. But I think, I have all of the police. Thank you, Sheriff and I hear, does he do a great job? Great huh, look at these guys. I want your popularity. I know I'd want it. Good. Thank you, Sheriff. That was a very nice statement, I appreciate. But I'm a big fan of the police, and I think, the police in this country have not been treated properly. You know you'll see, you'll see one event whether it's a mistake or you have a rogue. You know, you have a rogue problem, and it ends up being the biggest story for weeks and weeks and weeks, and they don't see the 99.99% of the great work that these people do. So you know, I have endorsements from everybody, the police. We have a special relationship. And without the police, we're not here. We don't feel safe here. So important, and they've been treated unbelievably, I think, shabbily. So we're going to get that stopped. But we love our police and without them, it would be a much different country. That I can tell you. So Sheriff, thank you. Thank all your men behind you. Thank you, men and women. So with that, I think, what we'll do is we'll take some questions. I just want to say that so we started in June. It was trade. It was borders. It was a couple of things and we had the problem. The big problem as you remember, in Paris where 160 people were killed, 130 people were killed, many, many, many in the hospital right now will never be the same. Just brutally, brutally, I mean, many of them are going to die, actually. But, but really badly hurt. And when we talk about Second Amendment, if we had guns on the other side. There's a country that's the toughest gun laws in the world. Paris is the toughest in the world. Nobody has guns except the bad guys. The bad guys have guns because they kept guns there. They put a gun in there. That's it. And if we had it in Paris or if we had in California, we had the 14 to two radicalized people, where she radically -- radicalized him. Who knows what happened. But they killed people, they gave them parties for their baby and gave them wedding parties. They walked in, they killed 14 of them and others also the hospital, horribly hurt. If we had guns on the other side of those lines so that bullets could go the other direction also. You wouldn't have 14 people, you wouldn't have 130 people killed. That I can tell you. Would have been a whole different story. So we have to protect our Second Amendment, folks. We have to protect it. And you know, people are really fighting it. And we have to protect a lot of our great institutions and a lot of our great things. But I tell the story all the time. I mean, if there were guns on the other side going in the other direction, it would have been a whole different story. So that's that, but let's take some questions and go ahead, sir. Ah, we love Tom Brady, right? Look at the guy. How good, is Tom Brady the greatest? He's my friend. He's my friend, Tom. With the large number of, excuse me, baby boomers retiring nowadays. How do you offset that and create more jobs for the young people? We have to take jobs back from China, from Vietnam, from Mexico, from all of these countries that are just stripping us. From India, India is massive. We have to take jobs back from all of these countries, and we have to take back. We can't let it's -- we're being stripped. China has in my opinion done the greatest theft in the history of the world when they've taken. They've taken our money, our job, millions and millions of jobs, thousands and thousands of plants and factories closed, and we've rebuilt China. We've got to bring them back. We're going to bring them back. And I'm saying, I want Apple, first of all, Apple ought to give the security for that phone, OK? What I think you ought to do is boycott Apple until such time as they give that security number. How do you like that? I just thought it. Boycott Apple. Here's the thing. First of all, the phone's not even owned by this young thug that killed all these people. The phone is owned by the government, OK? Not even his phone. We don't even have to go that far. But Tim Cook is looking to do a big number, probably to show how liberal he is. But Apple should give up. They should get the security, you'll find other people. When these two young people had bombs all over their apartment, on the floor, other people saw those bombs. Well, those people in a certain way are almost as guilty as the ones that did the shooting. We got to get to the bottom of it. And you're not going to get to the bottom of it unless we use common sense. So I like the idea. Boycott Apple until such time as they give that information. I think that's a great idea. OK. Yes, yes, ma'am. Hi, Mr. Trump with all the degrading circumstances going on in our nation, what will be the first issue that you will tackle once you's are inaugurated. Well, the things that are the easiest are these executive orders that Obama signed because one good thing is -- the one really good thing is we can sign immediately, you can counter-sign and you knock out the executive orders. I mean, he's got an executive order where people can just pour into the country. Now, the courts amazingly are stopping that right now, but at least temporarily. Who knows what's going to happen. But people are just literally pouring into the country. And I would get rid of that so fast. We end the court cases. Just get rid of it so fast, and others having to do with the Second Amendment, having to do with rules and regulations. He's at a point where he can't get anything passed so he just signs executive orders. It wasn't supposed to be that way. So I would get rid of that very fast, OK? Sure. Thank you. Hi, our seniors. I haven't heard many policies about how our seniors are suffering. We have to live on Social Security which is very small. You're not a senior. My husband is. OK. And I have to take care of him so yeah. She didn't look like you're senior. Well, thank you, anyway. We haven't received any type of raise. What when you're president, do you intend to do about that? Well, first of all, you know the other candidates aren't talking about races. They're talking about cutting your Social Security. Exactly. I'm the only one that's not cutting. I'm bringing the jobs back. I want to make our country rich again, and we're going to keep our Social Security. And you're not cutting the ages and you're not cutting it down at all. Every other person but me is cutting entitlements, and they're cutting Social Security. So we're going to save Social Security. It's like I said, the medicine, $300 billion a year. That's one aspect. And it was given to me by a friend of mine who's a doctor. He couldn't understand why. As soon as he told me, I understood why. It's because of the guys that get all the contributions. All right, representing. You know, as an example, Woody Johnson. Good Guy, Johnson & Johnson. He's in charge of Bush's campaign finance committee. Now, when Bush goes, he's never going to win. Bush has less chance than let's see, do we have any children in the room? But, but assuming he did win. Do you think Bush is going to negotiate the -- I mean, give me a break. The head of the pharmaceutical industry is the head of his campaign. So that's now the way it works. So we're going to make our country rich again. We're going to find all of these things, there's so many. That's one, that's one that I found in about two seconds. There's so many of them. The military has so many. We're going to make the military so strong, but we're going to make it better for less money. You know, you can build -- how? I just told you. Who said that? Oh, I just told you, darling. How? It's easy. Number one, and you have to do this, you have to get the equipment that we want. You have to take care of people. You have to take care of our military because our military, and we don't want to use our military. Honestly, we don't want to use our military. But we're being scoffed at right now, and we never fight to win. You know, when we were all younger, many of you are my age and many of you are younger. But when we were all younger, we didn't lose so much, right? We don't win anymore. As a country, we don't win and we're going to start winning again. We're going to win so much, you're going to get tired of winning you're going to say, please Mr. President, I have a headache. Please don't, don't win so much. This is getting terrible and I'm going to say no, we have to Make America Great Again. You're going to say, please. I said, nope, nope, we're going to keep winning. We're going to Make America Great Again. But by that time, I'll be able to take the again off. We're going to just have America be great, OK? So that's it. Go ahead, Al. I am really angry at our Congressmen and Senators. I am, too. And is there any way when you're president, you can get them to enact term limits and a balanced budget? Well, we're going to look at that very much. I mean, we can balance the budget. Do you know that a balanced budget -- I was talking to one politician. He wants to balance the budget over the next 25 years. You've heard that too, 25 years. We're going to get the balanced budget and we're going to have a better country. And we're going to have -- somebody was saying, well, if you balance the budget, what are you going to get rid of? There's so much waste, fraud, and abuse. We're not going to get rid of anything. You're going to have a better country. We'll have better service. Spend less money, we'll have better service. We'll get it balanced. You watch. OK. Well, you watch. Yes, ma'am. Go ahead. What can be done about the younger people voting for Bernie that had no idea what socialism is? What can be done -- Yeah, well, the Bernie thing. I'll be honest, I don't like to speak badly about Bernie. I'll be honest because I sort of want him to win so badly. Do -- Does that make sense to you? I'm torn. He's so easy to hit. And nobody hits him and Hillary's afraid to hit him, and she's been brought very far left and Hillary's got bigger problems in my opinion, right? Do you ever see how nice she is to Obama? Oh, our president is so wonderful. He's so great. He's you -- yeah, you know why she's so nice, right? Believe me. I know why she's so nice. I know why she's so nice. I've never seen her like that. She panders to the president. She doesn't even like him, but she's pandering and everything. Oh, our president has done such a good job. One of the worst presidents in history. So I hate, I hate to hit Bernie though because I'd much rather go against him. Now, I'd like to go against Hillary. I'm actually torn. I don't like, almost saying bad things against either because I sort of running -- want to run against both. Is there any way I can run against both, OK? So we'll see but we're going to show you what's going to happen that the whole thing is -- the whole thing is ridiculous. This is not going to happen. Yeah, go ahead. Would -- and as far as abortion and what would be your first move? I'm pro-life. I'm pro-life. This is going to be huge. Aw, that's cute. That's cute. You made that? Yeah, pro-life, honey. Thank you. Cute. Thank you. It's very nice. You live here? Do you -- are you on the job? Very good. You're a little younger than some of the people in this place, right? We're going to have a lot of -- we have a young, we have a tremendous young group of people that like us. I think in the end, more so than Bernie, we just gave a speech 7,000; 8,000 people a little ways away. And I'll tell you, the people were so young. It was amazing. Thank you very much. It's very nice, pro-life, OK? Let's see. Come on back here. Yes, sir. Go ahead. With a beautiful yellow sweater and a nice pen. Thank you for the pen. My daughter. Oh, beautiful, beautiful. I can see. Beautiful. Mr. Trump, last year in San Francisco, a beautiful young lady, innocent young lady was killed by an illegal alien in a sanctuary city. What will you do about sanctuary cities and funding for sanctuary cities? Do you notice that Obama never called Kate or the parents? Right. Right? You ever think of that? His Kate was killed by an illegal immigrant, came in five times at least, probably much more than that. Sanctuary city meaning, protection. Basically, it's a protection of criminals, I'll end sanctuary. First of all, defund sanctuary cities very quickly. If you're an illegal immigrant, you go through the same scrutiny. You know, I have a friend, you know, Jamiel, who you've seen, he's incredible. In fact, we put him in a comm -- he lost his son, his magnificent son. He was going to go to college on a scholarship. He was shot in the face three times going home to his father. Just walking down the sidewalk. Great kid, like an incredible kid. The father's an incredible guy. He's like a friend of mine now, and what this guy's gone through is like incredible. And I will tell you, you look at what's going on and you look at the kind of things that are going on with sanctuary cities and everything else. And one of the people because I've gotten to know so many people who have had daughters and sons and brothers and wives and everything else killed. Killed. Viciously, violently killed by illegal immigrants. And it's so sad to talk to them and they tell me that the police go after them and the authorities go after them. When they find their illegal immigrants, it stops. It's like they stop. They can't get involved because it's so hard to do anything against an illegal immigrant. They're rough and tough and smart. But when it comes to getting -- going after and maybe the sheriff would know even why this is, but they complain that when they hear it's an illegal immigrant they killed somebody or did some really harm to somebody. It's like becomes a whole different subject, and they don't go after him the same way. Now, we're going to defund sanctuary cities. We're getting rid of sanctuary cities, and Kate was incredible, and horrible what happened. And to many other people, not just Kate. Yes? Um, you keep telling us how you're going to surround yourself with great leaders. Can you give us a hint of who those might be? Well, I'll tell you in business, we have Carl Icahn endorsed me, who's a great businessman. So for trade, you know, I don't want military people for trade. I want our great businesspeople. We have the greatest businesspeople in the world. We don't use them. I told you before, we use political hacks. And for trade, 100% we're going to use Carl Icahn. We're going to use all of these great businesspeople, many of whom endorsed me. All of them want to endorse me. In fact, some of them want to endorse me and they want to have a news conference. I said nobody knows who you are. They might be worth $2 billion but nobody knows who you are. But these are the greatest negotiators. We have the greatest negotiators in the world but we don't use them. When we lose $500 billion a year with China, $500 billion. It's more than that actually, but $500 billion a year with China. That won't happen with Carl Icahn in charge of a trade deal. That won't happen with other people who I won't use their names yet, but we have the greatest people in the world. They all want to help. They don't want money. They don't want to have like, oh, they're going to get $200,000 a year. They don't want that. They don't want it. Their very rich people in many cases and just about all cases. That's why they negotiate well. But they're like chess masters, they're like Grand Masters. That's what we need negotiating because we are being taken to the cleaners on trade like you've never seen. Military, we're going to find the best military. In other words, we're going to find the best people in the different categories. Trade's the easiest one to think about and you know, again, when I started, it started to be with trade and then border and the border was very important. I mentioned during the speech, boy did I take heta, right? But then, they found out I was right. However, the other day one of the candidates, I saw him. We will build a wall. I said, where was this guy for the last 20 years? I said, well, my wife said, darling, did you hear he said he wants to build a wall. Ay, what a bunch of losers. We will build a wall. And then I heard a second one the other day say the same thing. We'll, we're going to build a wall. The only thing is we're going to build it. Mine's going to be real. They don't know how to build walls. I know how to build real walls and, and that'll look very nice and very good. But there's a big difference in building talent. The other thing, there's no way they get Mexico to pay for it. I get Mexico to pay for it, OK. Yes, ma'am? I'm giving him the mic. Oh, I'll come right over. Mr. Trump, you didn't say your best campaign manager in the country, Corey Lewandowski, you surround yourself with. That's true. I have a great campaign manager. Go ahead. Um, as a single mother of a 10-year old who is aspiring to be a veterinarian. What you mentioned that you were going to do something to help make college more affordable. What is it that you're going to do? I'll tell you, it's a question I get so much, so much, colleges. And what's happened with college is a shame because these people that run the colleges are going through the roof. They don't care because the kids are like a conduit for money from the Federal government. So a kid goes in gets all the money he wants or her, gets all the money, goes to the colleges. The colleges have totally lost control of their costs and it's costing so much money and they're spending so much money and the salaries for the top people are astronomical. And they don't care because they're getting the money from the Federal government. Unfortunately, the kids are the ones that are all your conduit, they have to pay for it. Does everyone understand that? Like it's a really bad system. So the kids borrow more money, more and more money, the costs of colleges is gone up more than practically anything, far more than inflation, far more than any of your businesses because these guys figure what the heck. I mean, we're getting all this money essentially from the government and it's going to stop. We're going to find out. It's going to stop but we've got to do something to help the kids because some of these kids are choking with that. And here's the problem, they get out of college and they can't get a job because we don't have any jobs. Don't believe the 5% stuff. We don't have 5% it's 25%, and many people are part-time. You know, they're people that have worked for 30 years as full-time employees, all of a sudden are taught by the same boss, in the same factory that it's part-time. Your job is now part-time. They're never a part-time job in their life. Now, they have to get another second job someplace. We have it bad because of Obamacare. That's exactly right. Because they have to keep under the threshold for Obamacare. This way, they don't have to pay the penalties and all the problems, right? Obamacare is a disaster. And I said it, I'll say it 15 times, repeal, replace, it's going to happen. But it's because of Obamacare. You're exactly right. So the job numbers, it's 5%, but when you look for a job and you give up, which most people do. They look for a job, they give up. And then, statistically, you're considered employed, OK? That number was put to make presidents and politicians look good, OK? It's not a real number. We probably have a 25% unemployment number. And you know what? If we didn't, if we had a really 5% unemployment, even with security, they like me for security, they like me for a lot of things. I doubt I'd be getting 25,000; 35,000 people coming into stadiums to see me, in all fairness, if we had a really 5% unemployment rate. People are very unhappy. And remember this, the other thing that was reported accurately, there are very bad jobs. There are horrible jobs. These are not jobs where you're doing what you want to do and what you were educated to do. These are horrible jobs. So I just want to tell you that we're going to have to do something for the kids because we have kids choking on debt. The debt is higher than it's supposed to be because the colleges have gone out of control in their cost. They've gone out of control in their cost, and that's human nature. Even the colleges, they sort of blamed them. But in a way, I say, you know, the Federal government is giving the money. The only thing is they go boom, boom, and then it goes from the student then. They have lost, they haven't lost control, they purposely, they've raised it through the sky. And you look at what some of these people are making now. It's ridiculous and the kids are paying. So we're going to come up with a solution for the kids because the kids are two things; they're choking, they're choking on debt and they just don't see any way of doing it, and they can't get jobs. You have kids go to great colleges. They work hard. They graduate high in their class. They're wonderful kids, wonderful students. They come out, they can't get a job. We're going to work on something that's going to be very good, I think, OK? It's such a great question and I hear it more than anything else. Yes, ma'am. Go ahead. Yes, Mr. Trump. What's your stance on coal? I'm sorry. I'd like to ask your stance on coal. I'm from Virginia, but I live here. I've been here 28 years. Thank you. I got it, Al. My stance on coal is very simple. We right now are destroying an industry. We are destroying an industry and coal was, you know, it did things for us for many, many years. And we send our coal to China and China burns the coal and whatever -- they have no cleaning method. They don't care about it. I felt -- feel very strongly, you know, they have clean coal now. They have machinery that cleans coal. And my stance on coal is very positive. Unlike Obama, where he's closing all of the mines, all of the miners. I know what's happening and believe me, and you know, they're talking about a lot of these other deals where they're talking, you know, wind. The wind is very tough because those windows are very, very expensive and they kill the birds, and they look very terrible. Isn't it amazing the way the environmentalists love the windmills and yet, they kill all the birds? In California, if you kill a bald eagle, they put you in jail for five years. And yet, the windmills knock him out like, like flies. It's crazy. It's crazy. And then, the environmentalists say how great they are, how great they are. The problem with wind, it's very expensive, they're very expensive to do. They really litter the landscape in my opinion. I mean, it's OK putting it in industrial locations and things. But when you see some of these fields, especially when you see like 15 different manufacturers, they're all different shapes colors, sizes, it's terrible, it's terrible. You go to certain places in California where they have these, these areas, where everybody has their own little niche, and you see all of these different wind farms. You know, the places I'm talking about. I won't even mention. Why should I disparage in different places. I know I have too many friends that have houses there, they're going crazy. But so -- wind is very tough. Solar, I love the concept of solar just doesn't work yet. It's a 30-year payback. And don't forget, then you have to buy new stuff before 15 years. You know, it doesn't last forever. Same thing with wind, you put up the wind, five years later, it's, it's rusted, it's rotted. You have to replace it. It's not like it's there forever, but the coal has been there forever. We have an unlimited supply, and we send it to China. We send our coal to China. Do you think China cleans the coal? I don't think so. I don't think so. So I really believe strongly in clean coal. They have great equipment, they have great -- and I'm very bullish. If I get in, I'm very bullish on the coal industry. Clean coal, OK? Thank you. Yeah. Go ahead. All good. Mr. Trump, I'm a new property owner and I have concerns. He's a young Donald Trump. See that? What are your stance on a prop -- individual property owners' rights? Very, very strong. Very, very strong, OK? I mean, I don't want to speak against myself, in all fairness. Very strong. You keep owning that property. Go ahead, sir. Thank you. Donald after you went here in South Carolina then in Vegas, then in the SEC. What is your next step strategy to pull in this core old school GOP mentality to get them with the program? Well, the Republicans have a problem -- I love the question. The Republicans have a problem. We have a structural problem. Number one, you have to win those six states. One of the advantages, I have, I have a chance of winning New York. You win New York, it's over because New York is so big. No other Republican has even a chance of winning New York. So I have a chance to win New York. I'll win Michigan which is not even in the ballgame for one of the Republican people to win. But we also have people that are really bad. Karl Rove is very bad. He's in my opinion, he's close to incompetent. No, he's, he's good at raising money and then he spends the money, loses it. Does the worst ads I've ever seen. Karl Rove is a bad guy, and he's, you know, he's just a bad guy. George Will is a bad guy. Stephen Hayes is a bad guy. I think Charles Krauthammer is a bad guy and bad guy. Now, I know, I know, I know. You can have them, OK? You can have them. No, I think he's a bad guy. I think we have a lot of people that are bad, really bad people. And I think, they're petty. I think they're jealous. I think they've got a lot of problems. And we have a lot of people that are very bad for the Republican Party. We need new thinking. We have to have new thinking. Well, you're not going to have a party much longer. Look Romney should've won that last election, he lost by a lot, right? He shouldn't have lost it. Romney had that election. We had a failed president. We had guys working like Karl Rove with raised millions and millions of dollars. Did some of the worst ads I've ever seen. And Romney lost the election. I mean, he should be president and we should have, you know, be re-electing Romney, again. But he was -- he ran a horrible campaign, in all fairness. But you had a failed -- you had a failed system. You had a failed party. And I'll tell you if we don't win, you know, it's interesting. I backed Romney. He lost. I back McCain. He lost. This time, I said I'm doing it myself, OK? Enough of it. So I just want to thank -- there's an amazing group of people. I'd love to play you in golf. I'll take my club champion over. I'd love to play you in golf but I'm not going to play much golf because there's a lot of work to be done. You know, Obama talks about the carbon footprint, right? The carbon footprint. He's always talking about the carbon footprint. And then he flies to Hawaii on a 747 with his family for Christmas. He's there forever. I mean, he plays more golf than people on the PGA Tour. But he then flies back and then he has a news conference on the carbon footprint. I mean, give me a break. So you know, but if you're president -- we have a lot of work to be done. And playing golf is good. But you have to play with people that you have to make deals with. You play with Congress, right? You play with Congress. You play with different people that you have -- You play with people from other countries. You play with prime ministers. You don't play with your friends. You play with people where -- because golf is amazing. Golf, you develop relationships on a golf course that you practically can't do anywhere else. So it's great but you got to play with the people that are going to do good for the country. But I wouldn't be playing much. You know you go to the White House. I want to make do trade deals. I want to make do military deals. I want to buy the best equipment for the military. I want to make sure that we have the right, everything right. There's so much to do that I wouldn't want to fly around and even all these meetings. You know, fundraisers, he gets on a 747, he spends $2 million or $5 million to fly to a location to raise a million dollars. Think of it. They spent $5 million, $5 million to go and, and go someplace and they raise $1 million. Oh, we had a great fundraiser last night but it cost $5 million. When you turn on the engines of a 747, let me tell you. We're talking big money. Then you have all of the Secret Service who by the way are incredible people. They're all over the room, right? They're all over the room. They're incredible people. But when you have all of the Secret Service and all of the tremendous cost of the plane, the 747 which I guess they ordered a new one. But these are the big old engines, and you know, you spend all of these millions and millions of dollars and you close down New York City. I mean, you have to go through it all the time. He's in for a fundraiser, you go in -- I'd say what's wrong? I don't even ask anymore. I say the president's in town, the entire city is shut, right? You know what I'm talking about. The city is shut down. How do you spend $4 million, $5 million to do a fundraiser to make -- raise $1 million, OK? But that's the way it is. I think I'll try and do my fundraiser -- I hear you're not allowed to do that maybe in the White House. So we'll do them in a hotel next door. We'll do it -- but one of my hotels, we'll do it. I don't care. I'm building one right next to the White House. I don't care. I don't want to -- I don't want to use it if it's a conflict of interest. I don't -- but seriously, instead of getting into a plane, use some room in Washington. Maybe you can use the White House and have it. But use some room, which I don't think you can, but use some room -- who? We could. We could. We could use the old post office, but that would be good. But, but, you know, spend millions and millions of dollars, and this is the thinking of our country. So I just want to tell you that tomorrow we're going to Make America Great Again. Tomorrow is so important that you get out and vote. We have a movement going on. I want you to read Time Magazine from last week. It was such an incredible story. It was so respectful of what we've done and not me, us. I'm like a messenger. But if everything works out well, like it did in New Hampshire, the people of New Hampshire were unbelievable. I was going to win by 28 and we ended up with 36. And it was just a landslide. It was an incredible show. Every single category men, women, we won every category. And if we could do the same, and we're going to send a mandate. We're going to send a mandate to the world, in a sense, it's to the world. Not just here, it's to the world that we're back. That we're back and that we're going to take our country back, and that we're going to have an amazing country again. And it's going to be run by really, really top of the line people. And we're going to run it the way we have to run it. And you're going to be so proud. And I hope that in two years, three years, four years, you're going to remember this meeting and, you're going to say that was a great meeting. And that was the beginning of Making America Great Again. So I want to thank you very much. I hope you can go out and vote tomorrow. I hope, hope, hope. I don't want your money. I want your vote and I love you all. Thank you, everybody. Thank you. Thank you. Thank you very much. Good question. Thank you, everybody."}