{"id":447,"author":"Donald Trump","title":"Speech: Donald Trump in Charleston, SC","date":"2016-02-19","link":"https://factba.se/transcript/donald-trump-speech-charleston-sc-february-19-2016","paragraphs":["Unbelievable. So it's crunch time, folks. It's crunch time. You know what that means, right? We got to get out tomorrow. We have to vote. All these thousands and thousands of people you have to get out and vote because we have a movement going. We have something very special, no matter where you look, no matter -- these people behind you, you see them, the press.","Look, look at all of them. It's like the Academy Awards, like the Academy Awards. Hello, press. Hello, press. We love the press. We're hard in the press. I've called them so many different names. Tonight, I'm going to say we love you, OK? So this is my last speech. I've made four of them today. We had thousands, we had, I guess, 8,000 at the first one.","We have been packed every single one. And we have a movement going on that is so special. They're talking about it all over the world. Cover of Time Magazine. You have to get it. Last week, cover of Time Magazine, the greatest story you've ever seen. Just -- it's been incredible, 35,000 people in Alabama, 20,000 people twice in Oklahoma.","We just left New Hampshire, we were packed every single venue. We had numbers that nobody else has ever had, ever had, ever had, and we're going to keep it going. But very important is tomorrow. You know it all doesn't mean anything if we say, oh, let's stay home. Who knows what the numbers are? The polls are very nice but who knows?","We can't take a chance, right? Because we're going to Make America Great Again. But we can't do that. We can't do that if you don't get out there tomorrow. All right. And the more we can do it and the more we can win by, the bigger the mandate, the better it is, and the easier the job we're going to have, all right?","So I want to thank you. I want to thank you. So this all began on June 16th and who knew this was going to happen. I figured maybe I'd be in the pack and you know sort of hey, I've won a lot over my life. I even went to a lot of club championships. That's good, right? But I'm not going to be playing much golf.","Believe me. If I win this I'm not going to be playing much golf. Not going to be playing, believe me. You know, winning club championships is hard it takes something a little special. He understands that. It takes something a little like a little bit different, a little bit special. By the way, a lot of people are pouring in, and you know, I'm going to start half an hour from now or an hour from now.","So we're going to start -- folks here, just come on back here. That's good. There's a nice room. See this room? You know what that ceiling reminds me of? The wall we're going to build, the wall. That's what it reminds me of. So we started a June 16th, I came down the escalator, I said to my wife, Melania, come on, let's go. Let's do it. And it takes guts running for President.","I never did this stuff before. It takes guts. I didn't know this was going to happen. I thought we're going to do well. I thought it was going to be like a horse race. I'd be in the middle of the pack and maybe by the very end, I'd inch it out. I didn't know we're going to be in this position. I didn't know we're going to be in this position.","And the people of New Hampshire were unbelievable. I have to tell you. Last week, we won every single category. We won rich, poor, fat, thin, tall, short. We won women, we won men, we won highly educated. We won smart, smart, smart people that don't have the big education because that's what it is. We won every single category and it was such an honor.","They were incredible people. And you know what their biggest problem was? Every time I went around to New Hampshire I'd talk to people. What's your biggest problem? Now the vets we're going to take care of our vets. We know that we're going to take care of them. Common Core, we're going to end Common Core, 100% we're going to end it. And we're bringing our education locally.","You're going to educate your children like it's supposed to be, the old fashioned way. No bureaucracy. You're going to educate them with love, the love of the parents. You're going to educate them locally. Right? Second Amendment, they talk about the Second Amendment. We are going to protect our Second Amendment.","Believe me. We are going to protect it. If we had guns in Los Angeles or frankly, where they have the toughest gun laws in the world in Paris. If they had guns on the other side with bullets going in the opposite direction, you wouldn't have had 130 people killed and many people right now destroyed, their lives are destroyed.","They're lying in the hospital. Some will die. If we had that -- I'll tell you what. When you look at the 14 people killed, the 14 people killed in California. Is that right? If guns were pointed in the opposite direction you wouldn't have 14. These are two people, they were radicalized. She probably radicalized him.","Nobody knows, who cares? They were radicalized. Radical Islamic terrorism. So they were radicalized. They walk into people that gave them a wedding reception, people that gave them a baby shower, people that they knew, they killed 14, many in the hospital. If there were guns on the other side pointed in the other direction, so the bullets are flying both ways, you wouldn't have had that kind of carnage.","So we're going to protect -- we're going to protect our Second Amendment. But -- we're protecting our Second Amendment. But I -- but I will say this, and by the way, big story. You know I said at the last -- at my last speech. I said Apple, I said Apple Computer. Apple. Boycott Apple. We want the secrets.","They don't want to open up the phones. Give me a break. Why wouldn't they want to do it? Why wouldn't they want to do it? They don't want to -- they don't want to open up the phone. It's owned by the government. The phone is owned by government. What are they doing? Open up the phones. We got to get -- we have to be smart.","We have to look and see what's going on. Let Apple open up the phones so that we find out where these threats are coming from. And I said boycott Apple until they do it. Boycott them. Who cares? We have to be smart. We have to be vigilant. You know there's so many enemies out there. We have to be so smart, so vigilant.","Now, I will say this. So the New Hampshire experience to me was an amazing experience. But what was their big problem? So I go in, there big problem, heroin, drugs. You look at New Hampshire the most beautiful area, the most beautiful place, the greatest people, these people are great. Every place, they're great.","You're great. They're great. No matter where we go. The people of this country are unbelievable people. The potential of the people -- the potential of the people in our country, unbelievable. Now, with New Hampshire, remember this, they said to me, Mr. Trump, it's heroin. The drugs are pouring in. You would never think -- you can't even associate it. We're going to close up that border.","We're going to build a wall. We're going to build a wall. And I owe them. I owe them. No matter when I went. They talk about Common Core. They talk about everything but what they really talk about is the tremendous drug explosion. And it just seems so strange because you look at it, it's so beautiful with the trees, and the beautiful roadways, and everything.","And every meeting I went to, they talked about heroin, heroin, heroin. And it's pouring in from the Southern Border. And I said to them, you know what? I'm going to close up that border. I'm going to close up. I'm going to close up that border and we're going to have a wall. It's going to be a real wall.","It's going to be a great wall. It's going to be a beautiful wall because someday they're going to have after Trump. I have to make sure it's beautiful, right? And I owe it to them. I owe it to them. And then we're going to -- there's so many people addicted. They're addicted to heroin. They're addicted to drugs.","We're going to work on that so that they can get, ideally, unaddicted. We got to get them off it. But we've got to seal it up. We've got to stop it. And I made the promise to them. And that's a promise to the country. That's a promise to the country. Some places don't have it as bad as that. But it's a promise to the country.","So we're going to close up that wall. We're going to close up that border. We're going to let our Border Patrol people -- they are phenomenal people. I was in Laredo, Texas. These are phenomenal people. We're going to work with them. Let them do their job. Who said that? Wonderful. We're going to let them do their job.","They called me, I didn't call them. They said, Mr. Trump, please come, please come. We want to do our job. These are incredible people. They're told to stand back. Let people walk right in front of them. Stand back. Beautiful people. They've got the guns. They've got the weapons. They've got the whole thing.","They can do whatever they have to do. They want to do it. And they're told to stand back, people walk in. People drive through the border. Loaded up with drugs, we get the drugs, they get the cash, they drive back. We're going to run our country properly. We're going to run our country properly. Obamacare is a disaster.","Obamacare is a disaster. Obamacare is going to be repealed and replaced. A big part of the problem we have, the people I'm running against and others, politicians, in other words, they get funds, so much money. Jeb Bush gets $150 million. Gone. It's wasted. You could take it and there's a window in here someplace.","Throw it out that window right there and it's going to do the same amount of good as what that money did. Other than these guys that worked for him, took commissions and made a fortune. This campaign stuff is unbelievable. They took money and spent it so fast because the guys that are spending that money are getting 10%, 15%, and maybe even 20%. So they're spending -- I'm saying why are they doing so many commercials on me? You know why?","Because they get paid commissions to do commercials of me, not even Jeb, poor Jeb does even -- he probably doesn't even know this happens, OK? The guy doesn't have a clue. This guy doesn't have a clue. But they spend the money so fast because the guys that are in charge, the people that buy the ad, the managers, all these guys are making a fortune.","They had one case, it was in the Los Angeles Times where a certain candidate raised $6 million. Very impressive, right? After the commissions and after all of the money went by, out of the $6 million how much was left? $140,000; $140,000, OK? $6 million they raised, $140,000 was left, this is a crooked business, folks.","It's a crooked business. So here's the story. I'm self-funding my campaign, right? All right. Self-funded. I'm putting my own money in and I guess by the end of this month, I'm going to have like $25 million in this thing. I'll tell you what. I spent in New Hampshire $3 million. Jeb Bush spent $47 million.","I ended up in first place with a landslide, Jeb Bush was toward the bottom of the pack. Isn't this the way we're supposed to be running our country? Right? Right? Right? You know? You know, in the school stuff, so out of the top 30 in the world, meaning 30 countries, we're number one in cost per pupil by far, right?","Number one, so high that number two doesn't even exist. You have Norway, Denmark, Sweden, China. These are the best countries in terms of education, right? These are ranked the top four or five great countries, great education. They spend a fraction of what we do. We're number 30 out of 30. So we're number 30 and yet we're number one in money spent by far.","I'm telling you, the difference is between one and two is number two is so far away, you can't even see it. We've got to change. All right? We've got to change. We got to do -- we've got to do like my campaign. I spent the least and I have the best result. We've got to do that. No, no, we've got to do it. We've got to do. We've got to do. So you look at it and it's so much I mean, it's so much -- there's so many things we can do. Here's another thing.","Recently, a doctor comes up to me. Good guy. Smart guy. Although, he's going to leave the profession. He said he has more under Obamacare. He has more nurses, think of it, in terms of nurses, more nurses than he ever had because he got bigger. But now, he's got more accountants that he has nurses. He said this never happened before.","It's so complicated. It's so bad. You know it's going to die of its own volition. It's going to end in 17 unless the Republicans bail them out. They're constantly bailing Obama out. All right? It's got to die. But this guy comes up, good guy, good doctor, highly respected, he said you know Donald, the drug industry, pharmaceuticals, we're the largest purchaser of drugs in the world the United States by far.","We don't bid. I said what are you talking about we don't bid? We don't bid the cost of drugs. We don't bid it out. If we bid it out we would save approximately $300 billion, OK? $300 billion So my friend said why is that? At first, it took me about 20 seconds to say, really?","We don't? But then as soon as I did it I realized why because the politicians that I'm running against and others are getting tremendous campaign contributions from the pharmaceutical industry, the drug industry. And they don't want to have bidding. If we did a favored nation's laws -- just forget about bidding.","Whatever that company pays for certain medicine, the United States pays the lowest price of any company buying during that year period or two year period, you pay the lowest price. Remember favored nations. And I'd say, lowest price less 10 %, right? We're a huge buyer. OK. I'm being nice when I say 10%, we would save $300 billion.","We don't do it because these guys are all getting money. Woody Johnson is the head of Johnson & Johnson is the head of Bush's fundraisers. He's the campaign chairman. No, no, think of it. Ted Cruz, who lives more than any human being I have ever seen. Any -- I have never seen.","I have never seen any human being. I -- look what he did to Ben Carson. Look what he did with this crazy voter violation for him. Ted Cruz, he lies more than any human being. Now, Ted Cruz, take a look at who's giving him the money, the oil industry, Wall Street. He puts down on his form, no loans. He doesn't put down the loans.","He doesn't put down the banks because he's telling all the people that he's Robin Hood. He's going to protect them from Wall Street, big, bad Wall Street. He's going to protect them. He doesn't say that he has a $1 million loan with Goldman Sachs. He doesn't talk about it. He doesn't say that the interest rate on that loan is practically nothing.","You would like to have it, believe me. You would like to have it. These people -- I mean, it's all of them. It's not just Ted Cruz, it's all of them. And the reason our country is messed up, one of the big reasons is the fact that they're all taken care of by every industry. Whether it's the automobile industry, you want to bring Ford back from Mexico, they'll tell you why you can't bring Ford back because they get campaign contributions.","They can't bring Ford back. You're right. He's right. OK. Now look, so I'm self-funding. When I want to bring somebody back, I bring them back. Nobody's going to call me and say you can't do it. Let, let me give you an example. So the other day I'm watching television and I see somebody with the cellphone, the crazy cellphones where you watch.","I'm watching television and I see Carrier. I buy air conditioners from Carrier and many others. I won't buy any more from Carrier by the way. And they're firing everybody from Carrier, 1,400 people. Great jobs. They've been there for many years. They're firing these people. Why? Because they're moving to Mexico.","Oh great, great. How does that help us? How does it help us? They're moving to Mexico. They're going to make air conditioners in Mexico. They're going to sell them on the border. They're going to sell them. Boom, they're going to sell them to the United States. We get nothing. We lose our jobs. We close our factories.","Mexico gets all of the work. We get nothing. Now, you probably heard some of these really not smart people say, Donald Trump is not a true conservative. He is not a conservative. I'm very conserve -- I'm the most conservative person in the world on the border. I'm the most conservative person in the world with respect to getting rid of Common Core.","I'm the most conservative person in the world with getting rid of Obamacare. I'm the most conservative person in the world having to do with our military and rebuilding our military and taking care of our vets But they say, but they say, they take commercials, Donald Trump, I get a kick.","I watch these guys, what stiffs, oh, many of these guys in private industry they wouldn't be able to get a job and they're running the country. But -- he says they're idiots. But, but think of it. So they're saying, he's not a conservative person. Let me just tell you something, I believe in free trade but it's got to be smart trade.","It's got to be trade -- with China, with China this year, we're going to lose, trade deficit, $500 billion. With Japan, we're going to lose a tremendous amount of money. That -- they send, they send their cars here like it's candy, OK? Millions of cars we get. We send them -- we send them nothing. We send them sometimes cattle and they don't accept it because their farmers don't want -- they don't want anything from us. So they send it back.","So we take in from Japan -- That was very good, I like that. That was very, OK. It's enough. But it's enough. OK. Never overstate, do you understand? He was getting ready to do it again. I don't want to hear it. Look, so we send them we -- we send them cattle.","They don't want our cattle so they send it back, goes back and forth back and forth, finally, they accept it. They call it Kobe beef because it's aged. I mean, this stuff is rotted. No, no it's like rotted. So because it's aged, it's decaying, it's disgusting, they call it Kobe beef, and they charge you 10 times more for it. You tell me they're not smart?","That's Japan. Japan is killing us. Komatsu, look at what they're doing to Caterpillar. A friend of mine is an excavator, he buys excavating equipment, right? He goes out and he buys excavating equipment. I said what are you doing? You're not buying Caterpillar. I can't. They have cut the Yen. They have devalued their currency to such an extent -- first time in his life, he's buying excavation equipment from Komatsu.","I said what's the difference? He said they're both good, Caterpillar's better, but this is good enough. I owe it to my family. I owe to my wife. I owe to my employees, my company. I understand what he's saying. They've devalued their currency. Take a look at Caterpillar's stock. Take a look at what's happening to Caterpillar.","It's happening to all of us. Right here you have Boeing. Boeing is being forced to build a massive plant in China, a number of massive plants folks, folks, let me just tell you something unless I'm President, you watch what happens. It won't happen with me because I know the game better than any human being that's ever lived.","Nobody knows it better. Nobody. Unless I'm President, within a few years, they're going to make all their planes in China. They're going to devalue their currency even more. They're the kings of devaluation. Nobody knows currency manipulation better than China, nobody, OK? And all of a sudden, you're going to say you know, our nice new plant, we're not doing any planes, and then they're going to start doing the layoffs, and here we go again.","We've got to get smart on trade. Now, when I came down the escalator at Trump Tower and I became -- I get -- when all in front of these people. I came down that escalator. Let me just tell you something. It started with trade and it started with the border, and then they had that horrible incident in France, in Paris.","And all of a sudden, the border became more important and CNN did polls, and it said they love us, Trump. They love Trump for the military because he's the toughest on the border. Sheriff Joe, you know, Joe Arpaio. Sheriff Joe endorsed me. When Sheriff Joe endorses you, you're the toughest on the border.","To wake -- so Jared -- Sheriff Joe Arpaio endorsed and it was sort of an amazing event if you want to know the truth. By the way great endorsement, Jerry Falwell Jr., unbelievable. Liberty University. Jerry sees every single candidate come through Liberty Univer -- every candidate goes through Liberty University.","He endorsed Donald Trump. I want to tell you that was a great honor. Sarah Palin, she -- everybody wants Sarah's endorsement, a great woman and a great -- I'll tell you what, that is a great person endorsed Donald Trump. So we're going to have the borders and we're going to have our trade. When we started, I talked about borders, I talked about trade.","I'm really good at the trade. I'm really good at the borders. When Paris happened everybody started saying we want Trump. The polls came in 60%, 70%, 72%, this is 72% with 17 people running. Now we're down to six. We got rid of all these people. It's so great. It's so great. But, but we had 60%, 70%, so in terms of the military, in terms of the border, In terms of all of these things, the economy I expect.","But everything was Trump, Trump, Trump, except for personality. I didn't do as well on personality. It's true. It's true. And you know what? Personality is a little lower than the economy. But if you had your choice of having somebody with a wonderful personality but was bad on jobs, bad on the economy, bad on security, bad on the border, bad on the wall, I'll take the guy with the wall.","I'll take the guy with the economy, OK? Believe me. And I'm also a nicer guy than many of these people running, that I can tell you. That I can tell you. I've gotten to know, they actually came up, you know because you know we're going to build the wall. Who's going to pay for the wall? Quickly, who's going to pay?","So what are these guys running against me? Donald, first of all, you can't build a wall, I said, really? Why can't we? He said, well, I don't know. Can you do that? You know 15 years ago they wanted to build the wall and they couldn't do it because the environmental impact statement for the wall, they couldn't get it approved, because there were rodents, snakes, rats, all sorts of stuff in the way, they couldn't get it. They had frogs.","They had snails. They had snails. It's true. Go look. They couldn't get an environmental impact statement approved. Oh, I'm so good at environmental impact statements. I -- now you have South China Sea. You have China building a massive fortress with massive, massive runways for the biggest military planes in the world and they've got those excavators.","They're not Caterpillars, by the way, I have to tell you, and they're digging and they're taken and they're ripping the hell out of that ocean. They're ripping it and ripping and rip and they're building an island in the South China Sea, and that's going to be a military fortress. And they're not supposed to be doing that but they have absolutely no respect for our President.","They have no respect for our country. So they're doing it. And I say, I said to a friend of mine from China because actually, I do a lot of business with China. They're fine to do business with. I make a lot of money with China. It's very good. If you know what you're doing you can make a fortune with China.","They buy my apartments. I have the biggest bank in the world in one of my buildings in Manhattan in China. Biggest bank in the world, 400 million customers, think of it. That's more than the people we have in this, 400 million customers, biggest bank in the world. But I do business with China and so I said to my friend jokingly, jokingly, I said when you started excavation, you're building that tremendous island in the middle of the South China Sea, did you get an environmental impact statement?","He said actually Donald, no. They came up with the idea on Friday at four o'clock and they started excavation on Saturday morning, OK? True. He said that. He said they came up with it. They started excavation about three -- I mean we're dealing in a different world, folks. You know during the debate, the second debate, I loved the last debate.","Some people said he was too rough, me. I mean that's better than some of the others that are too weak. But they said Donald and others but I have to say, Drudge, who's an amazing guy. Drudge does a poll, Time Magazine, I won every single poll to the debate, right? But, but no, some people said it wasn't my best, I was too tough.","But I got like seven people coming at me from every side. Am I supposed to be nice? That's the problem with our country, we're too nice. They say tone. Hillary Clinton said I don't like Donald Trump's tone. I don't like his tone. They're chopping off heads in the Middle East of our people. They're chopping off heads of Christians.","They're chopping off heads of everybody. They're drowning people 30 at a time in cages and she goes, I don't like his tone. So they asked Ted Cruz who's standing right here -- I was always in the center by the way. He's here. The other one's here. I've been in the center of every single debate. Nice, right?","Scroll -- no, not easy. Somebody said that's amazing. Every single debate. You know I heard Ted's a good debater. I said he is a good debater but he can't talk, OK? Bad talker. He's a good debater, bad talker. So he's over here. They asked him about waterboarding. They said Senator Cruz what do you think of waterboarding?","Oh, I don't want to talk about it. You know he didn't -- he didn't want to talk about waterboarding because too controversial. And I'm saying to myself they're chopping off heads, he doesn't want to talk about waterboarding. Then they look at me and they say what do you think about waterboarding? No, I didn't poll it. You know I have more money than all of them put together 25 times.","But I don't need a pollster. You know what? These guys do my polling for me. The networks every, every day they come out with a new poll. What do you think of Donald Trump's hair? What do you think of his this? What do you think of his dad? I mean, I learned more about myself. Why do I have to spend money?","They spend millions of dollars, the networks on polling. Two minutes after it comes out, I get things, this thick things I never even knew about myself. Then they say how much do you pay your pollster? I get for free. They do it for free. They say how much do you pay your pollster, Mr. Trump? I say nothing.","I don't have a pollster. The networks are my pollsters. Every day I get a new poll. I have so much -- I'm so busy I can't read them anyway. But I've learned a lot. These guys pay -- they spend hundreds of thousands of dollars a month. So Ted Cruz couldn't poll it. So I didn't know how to answer the question.","He was mumbling and bumbling and he goes. Well, I -- waterboarding. Well, you know I think it is going to be terrible to say, I'm in favor of waterboarding, meaning he's in favor of waterboarding. So he goes well, I liked to -- you got to see it. You got to see it. Then they say Mr. Trump -- now, I'm thinking to myself, they chop off heads.","Not since medieval times, James Foley, not since medieval times do they chop off heads, chop off heads. Who the hell ever heard of this? We're in now the worst period of maybe ever medieval times. Boom. I read, I loved history when I was in high school and I'd read about medieval times. Boom, boom chop off heads.","When was the last time you heard about chopping off heads? Now, they chop off heads. OK. So now they look at me. Mr. Trump, how do you feel about waterboarding? They think I'm going to say, oh, it's a terrible thing. It's so horrible. It's so mean. It's so terrible. In fact, it's supposed to be -- you know the big question is, is it torture or not?","In other words, it's so borderline. It's like your minimal, minimal, minimal torture. So they said Mr. Trump, I'd like you to answer the question. How do you feel about waterboarding? I said I feel great about it. I really -- I feel good. I said I feel great. And then I said something that got me in a minor bit of trouble because it wasn't politically correct.","I said but I think we should go much, much, much further than waterboarding. I said we have an enemy in the Middle East, ISIS and others that are chopping off people's heads and drowning people in steel cages. They leave under there for 40 minutes and they pull it up, right? Can you imagine these people when they sit around at night eating whatever they're eating and talking and they're talking about the United States that they're actually worried about waterboarding as being a little bit cruel?","And these people chop off heads. They must think we are the dumbest and the weakest and the stupidest people on earth on Earth, on Earth, on Earth. You know I read a story, it's a terrible story but I'll tell you. Should I tell you or should I not? Early in the century, last century, General Pershing.","Did you ever hear -- rough guy, rough guy, and they had a terrorism problem. And there's a whole thing with swine and animals and pigs and you know the story, OK? They don't like that. And they were having a tremendous problem with terrorism, and by the way, this is something you can read in the history books, not a lot of history books because they don't like teaching this and General Pershing was a rough guy and he sits on his horse and he's very astute like a ramrod, right?","And the year was early 1900s and this was a terrible problem. They were having terrorism rooms just like we do. And he caught 50 terrorists who did tremendous damage and killed many people. And he took the 50 terrorists and he took 50 men and he dipped 50 bullets in pig's blood. You heard that, right? He fit -- he took 50 bullets and he dipped them in pig's blood and he had his men load his rifles and he lined up the 50 people and they shot 49 of those people and the 50th person, he said you go back to your people, and you tell them what happened.","And for 25 years there wasn't a problem, OK? 25 years there wasn't a problem. All right? So we better start getting tough and we better start getting vigilant and we better start using our heads or we're not going to have a country, folks. We're not going to have a country. So -- what?","It is, I love this country. That's why I am doing this. I love this country. We want to keep this country. We want to keep this country. We want it back. Look, I'll tell you something. I've been saying something because I've been meeting so many people, millions and millions of people.","One of the reporters said -- a great reporter, television reporter said to me, I've been doing this Mr. Trump for 20 -- and he didn't say this on the record, I wouldn't tell his name but he said, I've been doing this for 25 years, in 25 years, sir, I have never ever, ever seen anything like what's happening with you and with your people.","It's amazing. It's amazing. It's amazing. And a great and a great compliment. And I'm the messenger and we're all together and we're all together. And honestly, when you go to Dallas or when you get to Oklahoma, when you go to New Hampshire, when you go to Iowa, when you go to New York, to any place, the people are unbelievable.","And I've been saying this for the last two or three weeks. When I say Make America Great Again, I'm adding now, and we can Make America Great Again. But I think we can make America greater than ever before, greater than ever before. We have -- we have such incredible potential. No, we have such incredible potential.","And I want to see the day when Apple makes its product on our land not over in China because I'm bringing our jobs back from China, folks. We're going to bring them back. We're going to bring our jobs back from Mexico, folks. We're going to have Ford built here. We're not going to have Ford build in Mexico.","We're going to bring our jobs back. Vietnam is a new one, we're going to bring our jobs back to this country. We're going to be so proud. I'll tell you what I want. We're going to be so proud and we're going to have a military that's going to be so advanced and so wonderful and we're going to buy the right product.","We're going to buy the products that the Generals want not that the politicians want. And you're going to remember this evening and you're going to say in two years or three years or four years or one year but you're going to say that I was there for an evening where Donald Trump, representing all of us, made a speech and I voted for Donald Trump the next day.","And our country, and our country started winning again. We don't win anymore. Our country started winning again. We started winning with our military. We haven't -- we can't beat ISIS, folks. We can't beat ISIS. We won with our military, we'll knock the hell out of them. We won with our veterans. We're going to take care of our veterans.","We won with education. We won with the Second Amendment. We won with the border. And yeah, we're going to have a really strong border. And we're going to have people come into our border. We're going to have people that big beautiful door right through the middle of that wall. But they're going to come in legally.","They're going to come in legally. And you're going to remember this evening and you're going to remember tomorrow because you have to go out and vote. No matter how you feel. I don't care. It doesn't matter if you think you're not going to make it through the day. You've got to go out and vote tomorrow. I don't want your money.","I don't want your money. We want your vote. Gotta do it. And you're going to say to yourselves that was one of the great evenings and one of the great days of your lives because we're going to make you so proud of your country. You're going to be very proud of your President. But you're going to be so proud of your President.","You're going to be so proud of your President but you're going to be so proud of your country because we're going to start winning, winning, winning again. We're going to become the smart country, not the country that makes the Iran deal where we give them $150 billion. We're going to become the smart country and we're going to become a truly, truly great country again.","I love you, folks. We're going to start winning. We're going to win, win, win, and we're going to Make America Great Again. Thank you, everybody. I love you. Thank you. I love you."],"text":" Unbelievable. So it's crunch time, folks. It's crunch time. You know what that means, right? We got to get out tomorrow. We have to vote. All these thousands and thousands of people you have to get out and vote because we have a movement going. We have something very special, no matter where you look, no matter -- these people behind you, you see them, the press. Look, look at all of them. It's like the Academy Awards, like the Academy Awards. Hello, press. Hello, press. We love the press. We're hard in the press. I've called them so many different names. Tonight, I'm going to say we love you, OK? So this is my last speech. I've made four of them today. We had thousands, we had, I guess, 8,000 at the first one. We have been packed every single one. And we have a movement going on that is so special. They're talking about it all over the world. Cover of Time Magazine. You have to get it. Last week, cover of Time Magazine, the greatest story you've ever seen. Just -- it's been incredible, 35,000 people in Alabama, 20,000 people twice in Oklahoma. We just left New Hampshire, we were packed every single venue. We had numbers that nobody else has ever had, ever had, ever had, and we're going to keep it going. But very important is tomorrow. You know it all doesn't mean anything if we say, oh, let's stay home. Who knows what the numbers are? The polls are very nice but who knows? We can't take a chance, right? Because we're going to Make America Great Again. But we can't do that. We can't do that if you don't get out there tomorrow. All right. And the more we can do it and the more we can win by, the bigger the mandate, the better it is, and the easier the job we're going to have, all right? So I want to thank you. I want to thank you. So this all began on June 16th and who knew this was going to happen. I figured maybe I'd be in the pack and you know sort of hey, I've won a lot over my life. I even went to a lot of club championships. That's good, right? But I'm not going to be playing much golf. Believe me. If I win this I'm not going to be playing much golf. Not going to be playing, believe me. You know, winning club championships is hard it takes something a little special. He understands that. It takes something a little like a little bit different, a little bit special. By the way, a lot of people are pouring in, and you know, I'm going to start half an hour from now or an hour from now. So we're going to start -- folks here, just come on back here. That's good. There's a nice room. See this room? You know what that ceiling reminds me of? The wall we're going to build, the wall. That's what it reminds me of. So we started a June 16th, I came down the escalator, I said to my wife, Melania, come on, let's go. Let's do it. And it takes guts running for President. I never did this stuff before. It takes guts. I didn't know this was going to happen. I thought we're going to do well. I thought it was going to be like a horse race. I'd be in the middle of the pack and maybe by the very end, I'd inch it out. I didn't know we're going to be in this position. I didn't know we're going to be in this position. And the people of New Hampshire were unbelievable. I have to tell you. Last week, we won every single category. We won rich, poor, fat, thin, tall, short. We won women, we won men, we won highly educated. We won smart, smart, smart people that don't have the big education because that's what it is. We won every single category and it was such an honor. They were incredible people. And you know what their biggest problem was? Every time I went around to New Hampshire I'd talk to people. What's your biggest problem? Now the vets we're going to take care of our vets. We know that we're going to take care of them. Common Core, we're going to end Common Core, 100% we're going to end it. And we're bringing our education locally. You're going to educate your children like it's supposed to be, the old fashioned way. No bureaucracy. You're going to educate them with love, the love of the parents. You're going to educate them locally. Right? Second Amendment, they talk about the Second Amendment. We are going to protect our Second Amendment. Believe me. We are going to protect it. If we had guns in Los Angeles or frankly, where they have the toughest gun laws in the world in Paris. If they had guns on the other side with bullets going in the opposite direction, you wouldn't have had 130 people killed and many people right now destroyed, their lives are destroyed. They're lying in the hospital. Some will die. If we had that -- I'll tell you what. When you look at the 14 people killed, the 14 people killed in California. Is that right? If guns were pointed in the opposite direction you wouldn't have 14. These are two people, they were radicalized. She probably radicalized him. Nobody knows, who cares? They were radicalized. Radical Islamic terrorism. So they were radicalized. They walk into people that gave them a wedding reception, people that gave them a baby shower, people that they knew, they killed 14, many in the hospital. If there were guns on the other side pointed in the other direction, so the bullets are flying both ways, you wouldn't have had that kind of carnage. So we're going to protect -- we're going to protect our Second Amendment. But -- we're protecting our Second Amendment. But I -- but I will say this, and by the way, big story. You know I said at the last -- at my last speech. I said Apple, I said Apple Computer. Apple. Boycott Apple. We want the secrets. They don't want to open up the phones. Give me a break. Why wouldn't they want to do it? Why wouldn't they want to do it? They don't want to -- they don't want to open up the phone. It's owned by the government. The phone is owned by government. What are they doing? Open up the phones. We got to get -- we have to be smart. We have to look and see what's going on. Let Apple open up the phones so that we find out where these threats are coming from. And I said boycott Apple until they do it. Boycott them. Who cares? We have to be smart. We have to be vigilant. You know there's so many enemies out there. We have to be so smart, so vigilant. Now, I will say this. So the New Hampshire experience to me was an amazing experience. But what was their big problem? So I go in, there big problem, heroin, drugs. You look at New Hampshire the most beautiful area, the most beautiful place, the greatest people, these people are great. Every place, they're great. You're great. They're great. No matter where we go. The people of this country are unbelievable people. The potential of the people -- the potential of the people in our country, unbelievable. Now, with New Hampshire, remember this, they said to me, Mr. Trump, it's heroin. The drugs are pouring in. You would never think -- you can't even associate it. We're going to close up that border. We're going to build a wall. We're going to build a wall. And I owe them. I owe them. No matter when I went. They talk about Common Core. They talk about everything but what they really talk about is the tremendous drug explosion. And it just seems so strange because you look at it, it's so beautiful with the trees, and the beautiful roadways, and everything. And every meeting I went to, they talked about heroin, heroin, heroin. And it's pouring in from the Southern Border. And I said to them, you know what? I'm going to close up that border. I'm going to close up. I'm going to close up that border and we're going to have a wall. It's going to be a real wall. It's going to be a great wall. It's going to be a beautiful wall because someday they're going to have after Trump. I have to make sure it's beautiful, right? And I owe it to them. I owe it to them. And then we're going to -- there's so many people addicted. They're addicted to heroin. They're addicted to drugs. We're going to work on that so that they can get, ideally, unaddicted. We got to get them off it. But we've got to seal it up. We've got to stop it. And I made the promise to them. And that's a promise to the country. That's a promise to the country. Some places don't have it as bad as that. But it's a promise to the country. So we're going to close up that wall. We're going to close up that border. We're going to let our Border Patrol people -- they are phenomenal people. I was in Laredo, Texas. These are phenomenal people. We're going to work with them. Let them do their job. Who said that? Wonderful. We're going to let them do their job. They called me, I didn't call them. They said, Mr. Trump, please come, please come. We want to do our job. These are incredible people. They're told to stand back. Let people walk right in front of them. Stand back. Beautiful people. They've got the guns. They've got the weapons. They've got the whole thing. They can do whatever they have to do. They want to do it. And they're told to stand back, people walk in. People drive through the border. Loaded up with drugs, we get the drugs, they get the cash, they drive back. We're going to run our country properly. We're going to run our country properly. Obamacare is a disaster. Obamacare is a disaster. Obamacare is going to be repealed and replaced. A big part of the problem we have, the people I'm running against and others, politicians, in other words, they get funds, so much money. Jeb Bush gets $150 million. Gone. It's wasted. You could take it and there's a window in here someplace. Throw it out that window right there and it's going to do the same amount of good as what that money did. Other than these guys that worked for him, took commissions and made a fortune. This campaign stuff is unbelievable. They took money and spent it so fast because the guys that are spending that money are getting 10%, 15%, and maybe even 20%. So they're spending -- I'm saying why are they doing so many commercials on me? You know why? Because they get paid commissions to do commercials of me, not even Jeb, poor Jeb does even -- he probably doesn't even know this happens, OK? The guy doesn't have a clue. This guy doesn't have a clue. But they spend the money so fast because the guys that are in charge, the people that buy the ad, the managers, all these guys are making a fortune. They had one case, it was in the Los Angeles Times where a certain candidate raised $6 million. Very impressive, right? After the commissions and after all of the money went by, out of the $6 million how much was left? $140,000; $140,000, OK? $6 million they raised, $140,000 was left, this is a crooked business, folks. It's a crooked business. So here's the story. I'm self-funding my campaign, right? All right. Self-funded. I'm putting my own money in and I guess by the end of this month, I'm going to have like $25 million in this thing. I'll tell you what. I spent in New Hampshire $3 million. Jeb Bush spent $47 million. I ended up in first place with a landslide, Jeb Bush was toward the bottom of the pack. Isn't this the way we're supposed to be running our country? Right? Right? Right? You know? You know, in the school stuff, so out of the top 30 in the world, meaning 30 countries, we're number one in cost per pupil by far, right? Number one, so high that number two doesn't even exist. You have Norway, Denmark, Sweden, China. These are the best countries in terms of education, right? These are ranked the top four or five great countries, great education. They spend a fraction of what we do. We're number 30 out of 30. So we're number 30 and yet we're number one in money spent by far. I'm telling you, the difference is between one and two is number two is so far away, you can't even see it. We've got to change. All right? We've got to change. We got to do -- we've got to do like my campaign. I spent the least and I have the best result. We've got to do that. No, no, we've got to do it. We've got to do. We've got to do. So you look at it and it's so much I mean, it's so much -- there's so many things we can do. Here's another thing. Recently, a doctor comes up to me. Good guy. Smart guy. Although, he's going to leave the profession. He said he has more under Obamacare. He has more nurses, think of it, in terms of nurses, more nurses than he ever had because he got bigger. But now, he's got more accountants that he has nurses. He said this never happened before. It's so complicated. It's so bad. You know it's going to die of its own volition. It's going to end in 17 unless the Republicans bail them out. They're constantly bailing Obama out. All right? It's got to die. But this guy comes up, good guy, good doctor, highly respected, he said you know Donald, the drug industry, pharmaceuticals, we're the largest purchaser of drugs in the world the United States by far. We don't bid. I said what are you talking about we don't bid? We don't bid the cost of drugs. We don't bid it out. If we bid it out we would save approximately $300 billion, OK? $300 billion So my friend said why is that? At first, it took me about 20 seconds to say, really? We don't? But then as soon as I did it I realized why because the politicians that I'm running against and others are getting tremendous campaign contributions from the pharmaceutical industry, the drug industry. And they don't want to have bidding. If we did a favored nation's laws -- just forget about bidding. Whatever that company pays for certain medicine, the United States pays the lowest price of any company buying during that year period or two year period, you pay the lowest price. Remember favored nations. And I'd say, lowest price less 10 %, right? We're a huge buyer. OK. I'm being nice when I say 10%, we would save $300 billion. We don't do it because these guys are all getting money. Woody Johnson is the head of Johnson & Johnson is the head of Bush's fundraisers. He's the campaign chairman. No, no, think of it. Ted Cruz, who lives more than any human being I have ever seen. Any -- I have never seen. I have never seen any human being. I -- look what he did to Ben Carson. Look what he did with this crazy voter violation for him. Ted Cruz, he lies more than any human being. Now, Ted Cruz, take a look at who's giving him the money, the oil industry, Wall Street. He puts down on his form, no loans. He doesn't put down the loans. He doesn't put down the banks because he's telling all the people that he's Robin Hood. He's going to protect them from Wall Street, big, bad Wall Street. He's going to protect them. He doesn't say that he has a $1 million loan with Goldman Sachs. He doesn't talk about it. He doesn't say that the interest rate on that loan is practically nothing. You would like to have it, believe me. You would like to have it. These people -- I mean, it's all of them. It's not just Ted Cruz, it's all of them. And the reason our country is messed up, one of the big reasons is the fact that they're all taken care of by every industry. Whether it's the automobile industry, you want to bring Ford back from Mexico, they'll tell you why you can't bring Ford back because they get campaign contributions. They can't bring Ford back. You're right. He's right. OK. Now look, so I'm self-funding. When I want to bring somebody back, I bring them back. Nobody's going to call me and say you can't do it. Let, let me give you an example. So the other day I'm watching television and I see somebody with the cellphone, the crazy cellphones where you watch. I'm watching television and I see Carrier. I buy air conditioners from Carrier and many others. I won't buy any more from Carrier by the way. And they're firing everybody from Carrier, 1,400 people. Great jobs. They've been there for many years. They're firing these people. Why? Because they're moving to Mexico. Oh great, great. How does that help us? How does it help us? They're moving to Mexico. They're going to make air conditioners in Mexico. They're going to sell them on the border. They're going to sell them. Boom, they're going to sell them to the United States. We get nothing. We lose our jobs. We close our factories. Mexico gets all of the work. We get nothing. Now, you probably heard some of these really not smart people say, Donald Trump is not a true conservative. He is not a conservative. I'm very conserve -- I'm the most conservative person in the world on the border. I'm the most conservative person in the world with respect to getting rid of Common Core. I'm the most conservative person in the world with getting rid of Obamacare. I'm the most conservative person in the world having to do with our military and rebuilding our military and taking care of our vets But they say, but they say, they take commercials, Donald Trump, I get a kick. I watch these guys, what stiffs, oh, many of these guys in private industry they wouldn't be able to get a job and they're running the country. But -- he says they're idiots. But, but think of it. So they're saying, he's not a conservative person. Let me just tell you something, I believe in free trade but it's got to be smart trade. It's got to be trade -- with China, with China this year, we're going to lose, trade deficit, $500 billion. With Japan, we're going to lose a tremendous amount of money. That -- they send, they send their cars here like it's candy, OK? Millions of cars we get. We send them -- we send them nothing. We send them sometimes cattle and they don't accept it because their farmers don't want -- they don't want anything from us. So they send it back. So we take in from Japan -- That was very good, I like that. That was very, OK. It's enough. But it's enough. OK. Never overstate, do you understand? He was getting ready to do it again. I don't want to hear it. Look, so we send them we -- we send them cattle. They don't want our cattle so they send it back, goes back and forth back and forth, finally, they accept it. They call it Kobe beef because it's aged. I mean, this stuff is rotted. No, no it's like rotted. So because it's aged, it's decaying, it's disgusting, they call it Kobe beef, and they charge you 10 times more for it. You tell me they're not smart? That's Japan. Japan is killing us. Komatsu, look at what they're doing to Caterpillar. A friend of mine is an excavator, he buys excavating equipment, right? He goes out and he buys excavating equipment. I said what are you doing? You're not buying Caterpillar. I can't. They have cut the Yen. They have devalued their currency to such an extent -- first time in his life, he's buying excavation equipment from Komatsu. I said what's the difference? He said they're both good, Caterpillar's better, but this is good enough. I owe it to my family. I owe to my wife. I owe to my employees, my company. I understand what he's saying. They've devalued their currency. Take a look at Caterpillar's stock. Take a look at what's happening to Caterpillar. It's happening to all of us. Right here you have Boeing. Boeing is being forced to build a massive plant in China, a number of massive plants folks, folks, let me just tell you something unless I'm President, you watch what happens. It won't happen with me because I know the game better than any human being that's ever lived. Nobody knows it better. Nobody. Unless I'm President, within a few years, they're going to make all their planes in China. They're going to devalue their currency even more. They're the kings of devaluation. Nobody knows currency manipulation better than China, nobody, OK? And all of a sudden, you're going to say you know, our nice new plant, we're not doing any planes, and then they're going to start doing the layoffs, and here we go again. We've got to get smart on trade. Now, when I came down the escalator at Trump Tower and I became -- I get -- when all in front of these people. I came down that escalator. Let me just tell you something. It started with trade and it started with the border, and then they had that horrible incident in France, in Paris. And all of a sudden, the border became more important and CNN did polls, and it said they love us, Trump. They love Trump for the military because he's the toughest on the border. Sheriff Joe, you know, Joe Arpaio. Sheriff Joe endorsed me. When Sheriff Joe endorses you, you're the toughest on the border. To wake -- so Jared -- Sheriff Joe Arpaio endorsed and it was sort of an amazing event if you want to know the truth. By the way great endorsement, Jerry Falwell Jr., unbelievable. Liberty University. Jerry sees every single candidate come through Liberty Univer -- every candidate goes through Liberty University. He endorsed Donald Trump. I want to tell you that was a great honor. Sarah Palin, she -- everybody wants Sarah's endorsement, a great woman and a great -- I'll tell you what, that is a great person endorsed Donald Trump. So we're going to have the borders and we're going to have our trade. When we started, I talked about borders, I talked about trade. I'm really good at the trade. I'm really good at the borders. When Paris happened everybody started saying we want Trump. The polls came in 60%, 70%, 72%, this is 72% with 17 people running. Now we're down to six. We got rid of all these people. It's so great. It's so great. But, but we had 60%, 70%, so in terms of the military, in terms of the border, In terms of all of these things, the economy I expect. But everything was Trump, Trump, Trump, except for personality. I didn't do as well on personality. It's true. It's true. And you know what? Personality is a little lower than the economy. But if you had your choice of having somebody with a wonderful personality but was bad on jobs, bad on the economy, bad on security, bad on the border, bad on the wall, I'll take the guy with the wall. I'll take the guy with the economy, OK? Believe me. And I'm also a nicer guy than many of these people running, that I can tell you. That I can tell you. I've gotten to know, they actually came up, you know because you know we're going to build the wall. Who's going to pay for the wall? Quickly, who's going to pay? So what are these guys running against me? Donald, first of all, you can't build a wall, I said, really? Why can't we? He said, well, I don't know. Can you do that? You know 15 years ago they wanted to build the wall and they couldn't do it because the environmental impact statement for the wall, they couldn't get it approved, because there were rodents, snakes, rats, all sorts of stuff in the way, they couldn't get it. They had frogs. They had snails. They had snails. It's true. Go look. They couldn't get an environmental impact statement approved. Oh, I'm so good at environmental impact statements. I -- now you have South China Sea. You have China building a massive fortress with massive, massive runways for the biggest military planes in the world and they've got those excavators. They're not Caterpillars, by the way, I have to tell you, and they're digging and they're taken and they're ripping the hell out of that ocean. They're ripping it and ripping and rip and they're building an island in the South China Sea, and that's going to be a military fortress. And they're not supposed to be doing that but they have absolutely no respect for our President. They have no respect for our country. So they're doing it. And I say, I said to a friend of mine from China because actually, I do a lot of business with China. They're fine to do business with. I make a lot of money with China. It's very good. If you know what you're doing you can make a fortune with China. They buy my apartments. I have the biggest bank in the world in one of my buildings in Manhattan in China. Biggest bank in the world, 400 million customers, think of it. That's more than the people we have in this, 400 million customers, biggest bank in the world. But I do business with China and so I said to my friend jokingly, jokingly, I said when you started excavation, you're building that tremendous island in the middle of the South China Sea, did you get an environmental impact statement? He said actually Donald, no. They came up with the idea on Friday at four o'clock and they started excavation on Saturday morning, OK? True. He said that. He said they came up with it. They started excavation about three -- I mean we're dealing in a different world, folks. You know during the debate, the second debate, I loved the last debate. Some people said he was too rough, me. I mean that's better than some of the others that are too weak. But they said Donald and others but I have to say, Drudge, who's an amazing guy. Drudge does a poll, Time Magazine, I won every single poll to the debate, right? But, but no, some people said it wasn't my best, I was too tough. But I got like seven people coming at me from every side. Am I supposed to be nice? That's the problem with our country, we're too nice. They say tone. Hillary Clinton said I don't like Donald Trump's tone. I don't like his tone. They're chopping off heads in the Middle East of our people. They're chopping off heads of Christians. They're chopping off heads of everybody. They're drowning people 30 at a time in cages and she goes, I don't like his tone. So they asked Ted Cruz who's standing right here -- I was always in the center by the way. He's here. The other one's here. I've been in the center of every single debate. Nice, right? Scroll -- no, not easy. Somebody said that's amazing. Every single debate. You know I heard Ted's a good debater. I said he is a good debater but he can't talk, OK? Bad talker. He's a good debater, bad talker. So he's over here. They asked him about waterboarding. They said Senator Cruz what do you think of waterboarding? Oh, I don't want to talk about it. You know he didn't -- he didn't want to talk about waterboarding because too controversial. And I'm saying to myself they're chopping off heads, he doesn't want to talk about waterboarding. Then they look at me and they say what do you think about waterboarding? No, I didn't poll it. You know I have more money than all of them put together 25 times. But I don't need a pollster. You know what? These guys do my polling for me. The networks every, every day they come out with a new poll. What do you think of Donald Trump's hair? What do you think of his this? What do you think of his dad? I mean, I learned more about myself. Why do I have to spend money? They spend millions of dollars, the networks on polling. Two minutes after it comes out, I get things, this thick things I never even knew about myself. Then they say how much do you pay your pollster? I get for free. They do it for free. They say how much do you pay your pollster, Mr. Trump? I say nothing. I don't have a pollster. The networks are my pollsters. Every day I get a new poll. I have so much -- I'm so busy I can't read them anyway. But I've learned a lot. These guys pay -- they spend hundreds of thousands of dollars a month. So Ted Cruz couldn't poll it. So I didn't know how to answer the question. He was mumbling and bumbling and he goes. Well, I -- waterboarding. Well, you know I think it is going to be terrible to say, I'm in favor of waterboarding, meaning he's in favor of waterboarding. So he goes well, I liked to -- you got to see it. You got to see it. Then they say Mr. Trump -- now, I'm thinking to myself, they chop off heads. Not since medieval times, James Foley, not since medieval times do they chop off heads, chop off heads. Who the hell ever heard of this? We're in now the worst period of maybe ever medieval times. Boom. I read, I loved history when I was in high school and I'd read about medieval times. Boom, boom chop off heads. When was the last time you heard about chopping off heads? Now, they chop off heads. OK. So now they look at me. Mr. Trump, how do you feel about waterboarding? They think I'm going to say, oh, it's a terrible thing. It's so horrible. It's so mean. It's so terrible. In fact, it's supposed to be -- you know the big question is, is it torture or not? In other words, it's so borderline. It's like your minimal, minimal, minimal torture. So they said Mr. Trump, I'd like you to answer the question. How do you feel about waterboarding? I said I feel great about it. I really -- I feel good. I said I feel great. And then I said something that got me in a minor bit of trouble because it wasn't politically correct. I said but I think we should go much, much, much further than waterboarding. I said we have an enemy in the Middle East, ISIS and others that are chopping off people's heads and drowning people in steel cages. They leave under there for 40 minutes and they pull it up, right? Can you imagine these people when they sit around at night eating whatever they're eating and talking and they're talking about the United States that they're actually worried about waterboarding as being a little bit cruel? And these people chop off heads. They must think we are the dumbest and the weakest and the stupidest people on earth on Earth, on Earth, on Earth. You know I read a story, it's a terrible story but I'll tell you. Should I tell you or should I not? Early in the century, last century, General Pershing. Did you ever hear -- rough guy, rough guy, and they had a terrorism problem. And there's a whole thing with swine and animals and pigs and you know the story, OK? They don't like that. And they were having a tremendous problem with terrorism, and by the way, this is something you can read in the history books, not a lot of history books because they don't like teaching this and General Pershing was a rough guy and he sits on his horse and he's very astute like a ramrod, right? And the year was early 1900s and this was a terrible problem. They were having terrorism rooms just like we do. And he caught 50 terrorists who did tremendous damage and killed many people. And he took the 50 terrorists and he took 50 men and he dipped 50 bullets in pig's blood. You heard that, right? He fit -- he took 50 bullets and he dipped them in pig's blood and he had his men load his rifles and he lined up the 50 people and they shot 49 of those people and the 50th person, he said you go back to your people, and you tell them what happened. And for 25 years there wasn't a problem, OK? 25 years there wasn't a problem. All right? So we better start getting tough and we better start getting vigilant and we better start using our heads or we're not going to have a country, folks. We're not going to have a country. So -- what? It is, I love this country. That's why I am doing this. I love this country. We want to keep this country. We want to keep this country. We want it back. Look, I'll tell you something. I've been saying something because I've been meeting so many people, millions and millions of people. One of the reporters said -- a great reporter, television reporter said to me, I've been doing this Mr. Trump for 20 -- and he didn't say this on the record, I wouldn't tell his name but he said, I've been doing this for 25 years, in 25 years, sir, I have never ever, ever seen anything like what's happening with you and with your people. It's amazing. It's amazing. It's amazing. And a great and a great compliment. And I'm the messenger and we're all together and we're all together. And honestly, when you go to Dallas or when you get to Oklahoma, when you go to New Hampshire, when you go to Iowa, when you go to New York, to any place, the people are unbelievable. And I've been saying this for the last two or three weeks. When I say Make America Great Again, I'm adding now, and we can Make America Great Again. But I think we can make America greater than ever before, greater than ever before. We have -- we have such incredible potential. No, we have such incredible potential. And I want to see the day when Apple makes its product on our land not over in China because I'm bringing our jobs back from China, folks. We're going to bring them back. We're going to bring our jobs back from Mexico, folks. We're going to have Ford built here. We're not going to have Ford build in Mexico. We're going to bring our jobs back. Vietnam is a new one, we're going to bring our jobs back to this country. We're going to be so proud. I'll tell you what I want. We're going to be so proud and we're going to have a military that's going to be so advanced and so wonderful and we're going to buy the right product. We're going to buy the products that the Generals want not that the politicians want. And you're going to remember this evening and you're going to say in two years or three years or four years or one year but you're going to say that I was there for an evening where Donald Trump, representing all of us, made a speech and I voted for Donald Trump the next day. And our country, and our country started winning again. We don't win anymore. Our country started winning again. We started winning with our military. We haven't -- we can't beat ISIS, folks. We can't beat ISIS. We won with our military, we'll knock the hell out of them. We won with our veterans. We're going to take care of our veterans. We won with education. We won with the Second Amendment. We won with the border. And yeah, we're going to have a really strong border. And we're going to have people come into our border. We're going to have people that big beautiful door right through the middle of that wall. But they're going to come in legally. They're going to come in legally. And you're going to remember this evening and you're going to remember tomorrow because you have to go out and vote. No matter how you feel. I don't care. It doesn't matter if you think you're not going to make it through the day. You've got to go out and vote tomorrow. I don't want your money. I don't want your money. We want your vote. Gotta do it. And you're going to say to yourselves that was one of the great evenings and one of the great days of your lives because we're going to make you so proud of your country. You're going to be very proud of your President. But you're going to be so proud of your President. You're going to be so proud of your President but you're going to be so proud of your country because we're going to start winning, winning, winning again. We're going to become the smart country, not the country that makes the Iran deal where we give them $150 billion. We're going to become the smart country and we're going to become a truly, truly great country again. I love you, folks. We're going to start winning. We're going to win, win, win, and we're going to Make America Great Again. Thank you, everybody. I love you. Thank you. I love you."}