{"id":448,"author":"Donald Trump","title":"Speech: Donald Trump in Gaffney, SC","date":"2016-02-18","link":"https://factba.se/transcript/donald-trump-speech-gaffney-sc-february-18-2016","paragraphs":["Oh, it's a lot of people! Thank you darling. It's a lot of people. Thank you. Thank you. Do we love electricity, by the way? All you, electricity people. We love you guys have been so great. How about life without electricity? Not so good right? Not so good. Great. You have been so fantastic. You have seats.","Sit down. Relax, everybody. Come on we'll be here for a while. I have nothing else to do. What the heck. We've been, we've been all over the place. I'll tell you what. South Carolina, unbelievable, unbelievable state. I've been here many times before the whole, you know this whole process. I've been here a lot.","I have a lot of friends that live here. It's one of the most beautiful parts of the world and they're great people. The people are fantastic and it's great honor to be with you. So important you know this is now crunch time, right? We've got to get our country back. See all those red hats with the white -- with the white letters?","We're gonna get our country back. But I just want to -- I want to thank you because it's been incredible. We are going to do so well. We are hopefully going to get out and vote. Every single person in this room unless you're going to vote for somebody else then don't vote. Don't, you don't have to if you're going to vote you know these guys that say, \"It doesn't matter who you vote for.\" It's important to get out and vote.","Trust me if you're going to vote for somebody else, don't vote. OK. Don't vote! So anyway. So we started this journey and it really is, you know, takes a lot of guts to run for president. I'm not a politician. Thank goodness. I'm not a politician and I've had great success. We've built a great, great company.","We filed with the Federal Elections and these folks, look at it. Look how many people we have back. It's like, what is this Academy Award time, fellas? Look at this. There they are. Oh, I know my friend from CBS. He's so talented and he's been treating me pretty fair lately. Thank you. Thank you. He's -- he's been treating me, he's been very nice.","And remember this crowd goes all the way back into the corners of the room. We can't get one more. We're like sardines in here, OK. So on air now CBS has been great. Actually they came out this morning with a poll that was phenomenal, right? CBS, New York Times came out with a great poll nationwide, a nationwide poll which was great because the Wall Street Journal came out with the biggest joke I've ever seen.","They came out with one. I mean basically I was tied. But we don't like ties in this room. Do you agree? We're not big for ties. And it was not a correct poll. I don't know who got those somebody but let's see what happens. But CBS just came out with a great poll and I hear FOX is coming out with a big poll on a little while.","We'll see what that is. But it's been amazing. And I can tell you in South Carolina the polls have been amazing. They've been great. But I don't want to tell you that. I don't want to tell you that. Because if I tell you that maybe you'll say I don't have to vote. You have to get out. It's so important, it's so important.","And you know, the more we win by, the better it all is, the mandate. You know, it's called the mandate. The more you can win by, the better it's going to be and the more important it is. And then we go to Nevada where we're we have a tremendous lead. But it's caucus. You never know what happens with caucus.","You know always problems, always problems. This caucus stuff is a little bit, nobody knows. You can have a 58% lead and then you find out you're not winning because what happens, who knows what happens is a room. People swirl around in these rooms. I'm not sure I like the whole caucus. Such a way, I like to be able to walk into a room, vote and leave.","Right? Don't you think? But the caucus states and Nevada we're doing really great. And then we have the SCC and I think we're going to do fantastic, a couple of states like Georgia just came in. Some numbers are phenomenal. And then we go Florida and Florida is going to be fantastic. What do you think when I'm leading Florida?","Well I have 48 and as sitting senators at eleven and a governor of past governors. What's Bush? It's like, he's not doing too well. He's not, doing too well in Florida right? No, but well you know it's interesting in Florida. The establishment of which I used to be a member, by the way in good standing. You said before I ran, once I ran I was no longer establishment.","They said, \"What's he doing? He's no supposed to be doing this. This isn't supposed to be happening.\" We like people where we can take care of them, where we can give them campaign contributions. Yet I'm self-funding. I'm not taking anybody's money. So it's nice. But, but they all want what's going on with Trump.","What's he doing? He's running. He doesn't need our money. This is bad. We want to take care of these people we want to take care of our senators and our Congress people. We want to take care of them. This is terrible news. What's going on with Trump? He was a great, great guy. He'd contribute lots of money.","I was a real member of the establishment. I gave $350,000 before I went this way. You know I went over the curb when I decided to run and I decide to run because how stupid are our politicians what they're doing. How stupid. We'll talk about it. But like the Iran deal and the trade deals and we lose money with everybody.","We lose money with everybody. So what happened is they went a little crazy because every one of these guys running, gets taken care of by the special interests. Right? They get taken care of by their donors. They get taken care of by the lobbyists. I have a problem I call a lobbyist. You know there's certain lobbyists I like assigned to different senators, right.","And you have a problem, you call up a lobbyist. And they go see the senator and it's amazing. It's amazing. It's horrible. And look, it's a system and it's fine. But it's not going to work that way anymore. We owe $19 trillion folks, and we're going to get it down, and we're going to have budgets, and we're going to do things properly, and we're going to have better health care.","We're going to have health care. We're going to get rid of Obamacare which is a total disaster. Oh, we're getting rid of it. We're getting rid of it and we're going to do a lot of good things. Common Core is going to be out. Common Core is dead. We bring education back and I talk about it all the time. Look we're number 30. From one to 30, we're number 30. In education, we're No.1 in cost.","OK. Think of it. So we spend more money per pupil than any other country in the world. And we're number 30, we're at the bottom of the list, right? So it's obviously something's wrong. And we're bringing local education back and I see it and I've seen it over the years. The parents, they get involved. The family gets involved.","The brothers and sisters, everybody gets involved. Then you have great education, less expensive and great education. So we're getting rid of Common Core. We're going to protect our Second Amendment. It's under siege, under siege. You know I tell the story with these two radicalized, I guess I should say young people, right, young people.","To me bad people. But the two people, they got married and I guess you radicalized him. Nobody knows. But the bad stuff happened and they go in and they shot the 14 people in California. Killed 14 people, many others injured badly. And these are people that gave them like wedding ceremonies and baby parties and all of this and they killed them and bad things are happening.","We have to be vigilant. We have to be smart. We have to be strong. We have to know who to let into our country and who not to let in. We can't be, we can't be the stupid people anymore. We can't be. We cannot be the stupid people. We're led by people that don't know what they're doing, or they know what they're doing and they're just bad.","I don't know what's going on. Look, we have a president that won't use the term Radical Islamic terrorism. He won't use it. You see what happens even in Paris. Take a look at Paris as an example. So Paris they kill 130 people. Paris has the toughest gun laws in the world. OK, the toughest in the world. They say France generally, but Paris has they say, I mean, if you're a good person forget it. If you're a bad guy, no problem.","You can have all the guns you want, right? You just walk in, you have guns. So Paris has the toughest gun laws. They go into these various places. Boom! Boom! Boom! Boom! They kill 130 people. Many people, I don't know if you've seen this, but many, many people are gravely injured in hospitals right now.","Their lives are ruined. Many will die. The number will go up quite a bit above 130. But if we had people I see you know like that guy right there with a red hat. See stand up, stand up. If he had a gun, and he's in Paris. And, the guy with a white hat. That's the white Trump hat. Stand up. Go and stand up. Stand up. And this woman right here, stand up. Yeah, right.","Stand up. If honestly, if we had a few people, if it was -- if it was in California, if it was in Paris. But, if there were people on the other side and the bullets were flying also in the other direction, you wouldn't have had 130 people killed. You wouldn't have 14 people killed in California. And the Second Amendment is under siege.","Believe me. And if I'm president, it's not going to be under siege anymore. It's going to be ended. So just remember that. You know, I tell that story all the time and I've come from New York and New York has pretty strong gun order, although I have the right to carry it, which is a very nice right to have.","But which is really unusual, right, and a very hard right to get, concealed permit. But I will tell you this, I will tell you this. In New York, I have arguments all the time. I say, I used as an example the California case. Wouldn't it have been good if a couple of those people had guns on their waist, guns around their ankle to protect themselves?","And everybody is, is that true? And everybody agrees with me. You don't have the argument. They're really anti-gun, and they agree. And we'll leave, that's it. The next morning I'll call. So have I converted you? No. It's just incredible. The fact is there's not even a contest. OK. So we protect our Second Amendment.","We have to protect it. Now, when it comes to what I've done. On June 16th I said, I'm going to run. Before then I didn't even know. I was with my wife at the end at the top of the escalator. I looked down at Trump Tower in the atrium. We had more press. I tell you, I've never seen so much press in my life.","It looked like the Academy Awards. I said, \"What am I doing?\" I've never seen anything like it. And I went out and I made a speech and I talked about illegal immigration and it was a firestorm. You remember, a firestorm that people coming across the border. And I took a lot of heat. And I say Rush Limbaugh said he took more incoming than any human being I've ever seen.","And I did took a lot of heat. And after two or three weeks people would say you know but Trump has a point. And then you had the killing of Kate in San Francisco which was a horror. And you had the killing of Jamil, in, as you know, in Los Angeles and it was like just horrible in California. You had the killing of the female veteran, 65 year old who was raped, sodomized, and killed by a person that was here many, many times and should have never been allowed in the country.","And many other cases, and many other cases. And people started saying, you know, it's really right. It's a crime wave. What's going on is a crime wave. And by the way, we're going to have strong borders. We're going to have the wall. We're building the wall. We're building the wall, folks. We're building the wall.","And we're going to have people come into our country but they're going to come into our country legally. They're not going to come in like they are now. They walk across a piece of Swiss cheese. They're going to come into our country legally, they're coming in, and it's fine. And they're going to be good people and they're going to come in legally.","You know, I just left New Hampshire. We had a tremendous week in New Hampshire. We had, we blew it out. We got every category. We won with men, with women, with tall, with short, with heavy, with thin. We won every category. We won with older people, younger people, highly educated, not so highly educated, with heavy college degrees, without college degrees, without a high school degree.","We won everything. And I'll tell you, it was an amazing. They're amazing people too. The people of our country are amazing. The people of our country are amazing. I mean more than anything else, I've learned. Somebody said, \"What did you learn most?\" And you know, they think, \"Oh, you're just saying that.\" I'm not saying it. The people of our, our, our country are amazing people.","They're amazing people. We have such unbelievable potential. In fact make America great again. That's great. And about two weeks ago I started saying maybe greater than ever before, because we -- I really mean it. We have to get rid of the regulations. We have to lower your taxes, the taxes are crazy. We have the highest taxes in the world.","Our companies are paying taxes, they're leaving. Pfizer, great big, you know, the pharmaceutical company, big company. It's leaving. It's moving to Ireland because the taxes, and because they can't get their money and corporate inversion, you know, they have corporate inversions. They're leaving the country and some of it believing to get their money.","We have money. Trillions of dollars are outside of the country. The Democrats agree it should be in. The Republicans agree it should be in, and they can't make a deal. They can't make a deal because we have a president that has no leadership ability. It would be so easy. It would be so easy. It would be so easy to make it. I'm telling you I think I could make that deal in 10 minutes.","And yet we spend, you could make that -- who's there to say they have two and a half trillion dollars. I think it's closer to five trillion. The government says it's two and a half trillion. They don't know what the hell they're talking about. I'm telling you, I'm telling you, it's like $5 trillion. They can't get the money into this country.","If they did, they could use it for development. They could build new companies. They could spend it on so many things. We can't get it in. And all the politicians agree. And you could sit them down for it so fast, I could make a deal so fast. But we have people that it's not, that it's not their thing. So the companies now are leaving to get their money.","They have billions of dollars. They have individually billions of dollars. They're leaving to get their money. It's impossible. The bureaucracy is horrible. The tax rate would be insane. You couldn't do it because the tax rate is insane. There's no incentive to do it. But we could do it so easy and we'd have all of this money pouring in. And this is what we're going to do. Carl Icahn endorsed me some of the great business leaders endorsed me. I mean frankly they'll all endorse me if I want it. Nobody knows who the hell they are.","Nobody knows who they are. They call me, \"Don I want to endorse you. Could we have a news conference?\" They said, \"Nobody knows who you are.\" Guy's worth $3 billion. Nobody ever heard of them. But they are great negotiators. We want to use our great negotiators, not our political hacks to deal with China, Japan, Vietnam, India, Mexico which is killing us at the border.","Mexico is killing us at the border and killing us in trade. You saw the other day, Carrier is moving down. They're moving out of. They're moving. 1400 jobs moving out of our country, moving to Mexico. And somebody had a cell phone going with the cell phones taking the shot of the boss, saying, \"We're closing up. We're moving to Mexico.\" Right?","Not going to happen with me. I'm going to say to him to follow. And I hate to say it. I'm a free trader. I hate to say this. We have to have smart trade. I don't even call it free trade anymore. We don't free trade with China. China is going to make, I mean think of this deficit. We are going, put it a different way.","We're going to have a trade deficit with China of $505 billion. What kind of deal is this? What is it? That means you're suck in history. In the history of the world, what China has done to us is the single greatest theft. Think of it. It's the greatest theft in the history. Though, and I love China. I think it's great.","The people are great. I made a lot of money dealing with China. I had the biggest bank in the world as a tenant of mine in a building in Manhattan. The biggest bank in the world by far. It's not even close. Our banks are like little toys compared to this bank. Has 400 million customers, 400 million customers.","Anyway, they're a tenant of mine. They definitely paid their rent on time. Believe me. But they're tenants. But I've sold tens of millions of dollars of condos to the Chinese people. The Bank of America building which I own a big chunk of in San Francisco. I got it through China, 1290, the Americas, one of the biggest buildings in Manhattan.","I got through China. I deal with China. China's fine. But their leaders are too smart for our leaders. They're too smart. So we are losing in trade deficits. We have five more than 500 billion, not million, billion dollars. And this has been going on for years. Not as high as that, but it's been going on for years.","And last quarter we announced GDP. We have not, we have nothing. We have no growth. Our country has no growth. And you hear about that phony jobs number where it's 5%. Five percent? It's not 5%. First of all, we have so many part-time jobs. People in this audience probably, I know people that have worked in a company for 30 years as a full time job, very proud of it. They've been put because of Obamacare, frankly.","They've been put on as part-timers. Now they're part-time jobs and they go get a second job. Probably people in this audience. So that you don't qualify for Obamacare. Because they don't want to get involved with Obamacare because it's too expensive. It's a disaster because the premiums are gone from 25, 35, 45, 55% up. And you look at what's going on. I mean it is, it is so out of control.","Obamacare is going to die in '17 anyway. It's going to die, unless, unless it's going to -- unless the Republicans give it another life ref. It's just crazy. What's going on? But it's so bad. It's worked out to be so bad and I have people. Two people here have Obamacare. Raise your hand. Who does have Obamacare?","You know, I keep hearing about people of Obamacare. I never see anybody who has Obamacare. Does anybody here have Obamacare? Isn't it amazing? I hear Obamacare. You're the only one. Stand up ma'am. Congratulations! We're about 6,000 people. It's amazing. We have 6,000 people and you have one person raising the hand that I hear everybody ask, \"What's going on?\" And I did that before I said, \"Who has Obamacare?\" There were two people.","Let me tell you, it's a disaster and it's falling off its own weight. And you're your pricing is going through the roof. And we can't have it. We are going to have great health care and health insurance. We're going to have great. It's going to be phenomenal. We're going to get rid of the lines. You know we have lines around each state which make it impossible for other companies.","If I want to go from South Carolina and compete in New York, you can't do it as a company. You can't do it. And I have many states, I mean many states have companies and many, many states and it's, it's impossible. The reason is the insurance companies took care of the guys I'm running against and others.","They contribute. So you have artificial lines. So a company would rather have an absolute exclusive to South Carolina or to New York or to any state rather than competing all over the United States. And now you have to compete and it's hard. It's hard to make money. It's hard but that's what they want. So the insurance companies through the politicians are getting what they want.","I told somebody before that friend of mine came up. He's a doctor. He said, you know Mr. Trump, the worst thing that I've seen. I can't believe it. We are the largest drug buyer in the world, the United States. The largest drug buyer though, by far. Prescription drugs and drugs to make people better, not the kind that come out of the southern border.","They don't make people better. They make people, they make people very sick. They make people very sick and we're going to stop it. OK, we're going to stop it. By the way, and you know, maybe even more so, we got to stop it for the people of New Hampshire. You know New Hampshire has a tremendous heroin problem.","You look at New Hampshire, it's like this, it's so beautiful with the trees and the valleys and the roads. It's the most beautiful place. And you go there and I love it because I had such a great experience here that I had that great vote that was even better than the polls. The polls were saying I was going to win and the vote was even better than that and everybody was saying, \"Oh, oh this is great.\" I said you know folks, I'm going to really try and have the biggest problem they have.","And you just don't see it with New Hampshire. It's heroin. And I go and I said, \"What's your biggest problem?\" They have a big problem with the vets. We're going to take care of the vets, by the way. But we're going to take care of our vets. This is a big vet area. This is a big vet area. But I'm going to do it for New Hampshire because New Hampshire was those people are incredible people and they are just stuck with, with this massive amounts of heroin coming in from the southern border.","We're going to stop it. And their kids are addicted, and their kids are addicted, and it's a very tough addiction to get rid of. And we're going to get in there and try and help those kids but we're going to we're going to stop the drugs from coming in now. That includes here and goes everywhere. But for some reason and I've gotten very close to New Hampshire because of that tremendous week that we spent up there and the tremendous end result.","And people are saying we may even have a better result here. Can you believe it? Would that be nice? And, if we do, I'll tell you what. We're going to run the table and we are in fact going to make America great again. We're going to run the table because this is very important. But, I said in New Hampshire.","I said I'm going to really do something about it because it's just so strange. You wouldn't think that they'd be talking about this because you sit down at this idyllic setting. What's your biggest problem? Heroin. You say heroin and you don't understand it. But then after you are there for a lot you see it's a, it's just a basic problem.","So we're going to get those borders taken care of. But think of this, the drug companies with the largest in the world for purchasing. There's no bidding, there no bid. They don't bid. They're restricted from bidding. There's some kind of nonsense where they're essentially restricted from bidding. If we bid with the drug companies, OK, so that.","And by the way why aren't they bidding? Tell me why. Because, and my doctor friend said, \"I don't understand it, Donald.\" As soon as you explain to me I said you've got to be kidding. But then I told him exactly why. I said because the senators and the congressmen get massive amounts of money from the drug companies.","Very simple, that I know. I mean that's so simple. And then I see this guy Jeb Bush who's got zero chance, by the way, zero chance or what. And he's a nasty guy. You know, in his own way, in his own ways, a nasty guy. He's got zero chance. He spent $20 million of ads on me, negative ads. And they're not even correct.","At least get him correct. Although maybe I'm better off if they weren't correct. My polls go up every time he plays the ad. So I don't know, it's not even a. But the guy spent 20 more than that but he spent $20 million of ads for me. So I see his director, his campaign chairman for fundraising as Woody Johnson of Johnson and Johnson, OK. Now, let's say again he's got zero chance so he's not a good example.","But let's say Jeb Bush got in. He's not going to do anything with competitive bidding. Let's say Ted Cruz. He's got people. You got to see what he's got. He's got the whole world lined up for him and he lies. He lies badly. He lies. That guy lies. Guy does not tell the truth. You know he holds up his Bible and then he lies.","Let me tell you. That guy lies. He is a liar and a very interesting with Ted Cruz. And I don't say that easily. And I know the difference between having fun and playing the game and, you know, we're in politics. But I know the difference between that and lying and when Marco Rubio said he lied the other night at the debates.","Said, \"You're lying.\" He's really right. I agree with Rubio that the guy lies. He'll say something. I was hearing things about, \"Donald Trump does not like the second amendment. He'll do away with the Second Amendment.\" I'm the strongest person on the second amendment. Like by far. And I get these reports.","And then that stuff. Well, look what he did to Ben Carson in Iowa. He said Ben Carson has quit the race during the election when they're voting. People are walking and he's telling everybody Ben Carson's quit the race. Go with Cruz. And then they took thousands of votes away, thousands. And then right after that he called Ben Carson to apologize after the votes were counted.","What kind of stuff is this? And Ben Carson in all fairness, I don't think he accepted the apology because he's still angry about it. But how dishonest. Then he does a voter violation thing he could call voter violation. It looks like it comes right out of the Internal Revenue Service, so official. It said, \"Voter violation.\" A person picks it up, not a sophisticated person.","\"Oh wow, voter violation.\" Looks serious. Looks like really the real deal. The paper, everything's perfect. If I got it, I think I'd be concerned. I'd call a lawyer. The lawyer would charge me 3,000 an hour and say, \"You're OK, Mr. Trump.\" But seriously, these people got a scare, a letter, and essentially it said.","It said, did you this, did you that, did you that. And then it gives him grades of F, fail. F fail, f, f, f. And then it said, you can clear it up by going and voting for Ted Cruz. What kind of stuff is this? It's a fraud. I'll tell you what, the head of the Iowa GOP, Jeffrey, if he were really smart, he'd terminate that victory in Iowa.","Ted Cruz, that's what you should do. Because what he did to Ben Carson and what he did with all the voter violation fraud certificates of fraud. What he did is a fraud. They had to terminate but they don't have the guts to terminate. They don't have the guts. The problem with our country is nobody has the guts.","They don't have the guts. But, but we had these, these great things. I mean it was still like a great experience. And then we go to New Hampshire. Now we're here and we're going to do things that haven't been done. We're going to put drugs out to bid folks. And we're going to save $300 billion a year, OK. And when Woody Johnson calls me up, I don't care.","Doesn't matter, he's a nice guy. He actually bought an apartment from me. I think he's a nice guy but that doesn't have any impact. All the smart people live in my buildings, OK. But you know what, I'll get called by lobbyists. I'll say, don't even, I won't even take the call. I don't, you know. Again, I'm so funny.","I don't know. I don't know that I get credit for this, OK. Because I certainly I don't get the credit. But I've had guys in my office that would give me anything I want. I had one guy come in. He said Donald. You know I've been in first place practically since, since June 16th, practically the whole route, right?","I've been in first place almost the entire route. And when you are, the money is just pouring in. I could have the largest PAC. You know these PACs are crooked as hell folks. They're crooked as hell. The PACs are running the campaigns. They run out of money. The PACs take over, they're running the campaigns.","They're crooked as hell. They're totally dishonest. What's going on with PACs is a disgrace, OK. It's a disgrace. They are dishonest. They're dishonest as you get. But I would have had the largest amount of money. The largest PAC if I wanted to put money into that if I wanted to raise money. I would have had, I mean Bush had 148 million and he's a stiff, OK. I would have had, I would have had the greatest amount of money ever in the history of PACs, OK. But it's wrong.","It's not right. And I said to somebody, I said a group, this one I was talking to a great group of people, packed house. And I said, \"Tell me, do I get credit for this? I'm self-funding my campaign. In all fairness, I'm rich. But it cost me a lot of money. Does it matter really?\" And they stood up and they started giving me a standing ovation.","It matters, it matters. I'll tell you why it matters. Because they have, you saw the last debate where they're clapping for Marco Rubio and they're clapping for Bush because that was all their fundraisers and stuff out there. That was all their special interest people out there and I made some good statement.","I was the only one I thought I did great in that debate. You know it's interesting. That was a great debate. I was being hit from 15 different sides. Everybody said I won the debates. Everybody said I won and I really won the one previous to that. That was the one with New York values, right? And we won that one and we did great.","And the Drudge poll which is great, he's an incredible guy, by the way, the Drudge poll. They do a poll. And I had 68%. That's against a lot of people. And Time magazine has a poll. I won that one too. And then I thought I did best in the last one because I was being hit by everybody. They're desperate. They're desperate.","And I was being hit. I never saw anything like it. It was like I'm shooting like this. And I thought I did really well. And although some of the pundits said, \"He was too nasty, he was too tough.\" What am I going to be? Nice? That these people are shooting at me, I'm supposed to be like. Somebody said, \"He was too tough and he was too nasty.\" Well we got to be nasty folks like with ISIS.","They're chopping off people's heads. I want to be nasty. Do you mind? Do you mind? I want to be nasty. Oh, we're going to be so nasty. ISIS is not going to like us anymore. ISIS is going to be not so happy folks. Don't forget, I'm the one that said take the oil, right? For years I've been saying that. For years I've been saying, take the oil.","I'm the one that said don't go into Iraq. And I said that, don't go into Iraq, 2003, 2004, and before that. I wasn't a politician but it was covered in 2003, 2004. Don't go because they said you're going to destabilize the Middle East. I should be given points for vision because we went into Iraq. We spent trillions we spent $2 trillion, thousands of lives lost, wounded warriors who I love, who I love.","They're more brave. They're braver than all of us put together. Wounded warriors who I love all over the place, all over the place. And you know what we have from Iraq? Nothing. Nothing. We don't have a damn thing. We have nothing, OK. This is the kind of thinking. And then we have Obama who instead of getting us out properly or keeping us there.","Once we're there, we probably should have kept the force there, at least a small force. So instead of getting us out properly, our president announces the date that we're leaving, that we're going to be totally out. The enemy pulls back and says, \"I can't believe this is happening.\" In fact they thought it was a ruse.","They thought it was like, \"He must be kidding.\" Can you imagine General George Patton, \"We're leaving, we're leaving.\" Now you might say, \"We're leaving,\" but you wouldn't mean it. He'd say, \"We're leaving\" and they'd get complacent, \"OK we're gone.\" And then he'd have soldiers lined all over the place and he'd come in and say, \"We would whack the hell out of 'em, OK.\" That's a different kind.","Let me tell you. That's a different mentality. That's a different mentality. But you know, General MacArthur, General George Patton. That's a different mentality. I see our generals, they're interviewed by the people sitting back there. They're interviewed by the people sitting back there on shows. Our generals go, they do interviews.","I say what the, do we want our generals doing interviews? And one of them is just leaving recently and they said, \"What do you think?\" \"Oh well, you know, ISIS is very tough, very -- .\" Do I want to hear this, tough? Tough. He's saying ISIS is tough. ISIS, we can knock ISIS out. If we want to do it so fast, so surgically, so strongly, we're going to build that military.","We have to build up, but we've got to knock him out. I didn't want to be there, but you can't allow people to chop heads. And that's why we, it's like medieval times. One day, one day in the previous debate, they asked Ted Cruz a question. \"What do you think of waterboarding?\" And he goes, \"Then he didn't want any part, that's too tough question, waterboarding, waterboarding.\" Think of it. They're chopping off heads.","James Foley, a great young man. That's where it started, James Foley. We couldn't believe it. All of us couldn't believe it, right? We saw it with the, with the orange outfit, this beautiful young guy. I've gotten to know his parents, are incredible people. I contribute to their foundation. These, the parents are incredible people.","And James Foley, that's where it started. And we all said, \"That can't be possible.\" Now it's all the time. They're chopping off heads, so they say to Cruz, \"What do you think of waterboarding? And would you continue waterboarding and is it too severe?\" And he's like given this horrible answer. You know he's, I always say about Cruz?","He's a very good debater but he can't talk. Does that make sense? In other words you have a conversation with them, that guy can't talk. Everything's \"Wah, wah. I will do this and I will do that. Can I have a very honest person.\" And then he lies. You know, I'm telling you he's a good debater, bad talker.","We need some good talkers. But they're asking him about, about waterboarding, and he's really stumbling and mumbling and it was terrible. Then they look at me. They said, \"What do you think? About waterboarding.\" I said, \"Waterboarding is good but it's not tough enough. We should go further.\" Nobody could believe it. No, no. Nobody could believe it. Now, I prefaced that because I didn't know.","I mean I didn't poll it. You know, I have more money than all of these guys put together. But I said, you know what, I don't have a pollster. I say what's right. I say what's right. These politicians, if that question was it, that's why Cruz was to hang with that question. He was petrified. He didn't know if he says yes.","Does that mean he's too tough? If he says no. So he did, you have to see it. He was stumbling and mumbling all over the place and I didn't want, I don't want to poll anything. You know sort of interesting. They do polls and these people pay hundreds of thousands of dollars, millions of dollars to pollsters of, by the way, special interest money.","So it's not so bad for them. But they pay all this money. I pay nothing. But the networks give me polls every day. \"We don't like Donald Trump. He's great on the military. He's great.\" Here's what it is. Great in the military. Trump always No. 1. Great on the border, No. 1. The best for the economy, No. 1. All the time, right?","Am I right? You can say it, always. Great on the economy. Great. Nice person. I'm always last. Can you believe it? And I'm a nice person. Nice person. And I'm actually a nice person. But I'm the person that's going to protect, you know, we're in this together. We're going to protect. We're going to, we're going have something so strong and so powerful.","We're going to protect. But all the time I get it. So they ask me about waterboarding and I say, \"Waterboarding is fine.\" But I prefaced it by saying, \"We have people that are chopping off heads in the Middle East. They're chopping off the heads of Christians. They're chopping off the heads of others. They're killing and abusing women.","There's nobody that I've ever seen, ever.\" You know it's one thing when you have warriors going at each other and they're shooting and fighting and killing. These people are disgusting. I said, \"They are chopping off heads doing the worst things I've ever seen. I think waterboarding is excellent. But you have to go much further than waterboarding.\" And you know what, I got a standing ovation.","The room went crazy. I mean it. We're soft and we're weak and we can't be that. Can you imagine the people at ISIS? They're sitting in wherever they are, right? They're all over the place. By the way, they're growing like they're all over. Now you look at maps, you know, two years ago I look at a map there's like little areas of pink.","Now you look at a map it's like all over the place. But can you imagine these people, these are tough cookies, right? Tough, mean, can you imagine them listening to this conversation about waterboarding which is the least form. Nobody knows if it's torture. You know, they have been able to define waterboarding.","They don't know if it's torture. If it is, might be a little bit too tough. We can't be nice. It's like, you know, these guys that commit murder, right? They commit murder. They kill someone. They, they kill an 80-year-old woman and they rape her, and slug her, and drop her, and just kick the hell out of her, and they go to jail.","We don't want the death penalty it's cruel and unusual punishment you know. OK, so I don't know. Then, then you have and then you have another case when they get the death penalty, want to give them drugs to put him to sleep quietly and this. Look, we're in a fight for our lives. We've got people coming in. We've got ISIS in our country folks just so you understand it. We have -- we have President – look, I hate to even use it. We have President Obama, doesn't understand that radical Islamic terrorism is coming in. They could be coming in through the migration.","When you look at the migration, you have tremendous, you have thousands and thousands of people. And people are saying and I say it all the time. There's disproportionately young strong men. You look, right, you look at what happens with Germany. What she has done to Germany. I have friends from Germany right now.","They're leaving Germany. They're leaving. They were so proud of Germany two years ago. They were talking about Germany's the greatest. They're leaving Germany. Germany is under siege. They're leaving Sweden. You see what happened in Sweden? Take a look at Brussels. I was in Brussels many years ago. It was so beautiful.","It's under siege. They canceled New Year's Eve. It's like an armed camp. Are we crazy? Now, I have a bigger heart than anybody. And we want to build safe zones in Syria. And I want to get the Gulf States who are spending nothing and they have more money than everybody put together. I want to get them to pay for it. They've got to pay.","They've got to pay. But we have to be vigilant. We have to be tough and we cannot let these people from Syria who we have not been able to vet at all. We don't have papers. We don't have documentation. Nobody has any idea where they come from. And that's all we need. This is like the great Trojan horse. That's all we need is these people coming into our country by the thousands and they turn out to be the people that we most don't want, OK? Not going to happen.","And if I win, the people that are in are going out, they're going out. I'm sorry. They're going out. You see what can happen with two young people. She may have radicalized him. Nobody knows. But she came in. They got married and they killed 14 people. This is two people. And these are not fighting people.","These are not like what we're talking about. And the other thing is, we have people that are ISIS. They leave our country. They fight for ISIS and then we, they come back and they allowed to come right back, \"Oh, come on back in. It's wonderful to have you.\" Anybody goes out and is sympathetic or fights for ISIS.","They're never coming back. Ever, ever, ever coming back into this country again. They're never coming back into this country again. So here's the bottom line. We have tremendous potential. We're going to make great trade deals. And when I came down that escalator, I took a deep breath and I told Melanie and my wife.","I said, \"Haaahhh, let's do it.\" Not easy, believe me. Not easy. Then you have all these maniacs back there, the press. They are the worst. They are, by the way. They are -- they are the most dishonest human beings. Most of them, not all of them but most of them. They -- they are the most, for instance, look at this group goes back to each corner at this massive convention center.","They'll show this group of people. Maybe if we're lucky, they'll say, \"Donald Trump spoke today in front of a small crowd.\" They never talk about the crowd. I had one day where I had 12,000 people and Bernie Sanders, I mean give me a break. I call him the 95 percenter. You know what, 95% is 95% tax, OK. Bernie Sanders had three.","Bernie Sanders had three. And he does get the second largest crowds by the way. But look at this crowd. Up to the corner people trying to get out, trying to get into the building. Look they're trying to come from outside, and they're having a hard time. I'm so sorry ma'am. It's so tough. Look they're trying to pour in they can't. But here's what they show.","They won't even show this. They show my face. The only thing that helps me is when I have a protester, right? Because if I have a protest like in that back corner, I didn't think the cameras could move. I thought they were like these really modern cameras, they're fakes. And I'll go home and I tell the story all the time.","I say to my wife, \"Darling, how did the crowd look? Oh didn't look like there was much of a crowd. It sounded like a lot of people.\" But I said, \"What you mean, didn't they show the crowd?\" They never showed the crowd. The only time they show the crowd is when there's a protester because a protest is a bad thing.","So they want to capture the bad. So they have Bernie Sanders with 3,000 people. I was with 12,000 people. They said Bernie Sanders had a fantastic crowd of 3,000 people and then they have me. They said Donald Trump spoke today. And unbelievable. No, it's so unfair. Let me tell you something structurally and with the press.","But structurally, the Republicans have a big disadvantage. Now in the FOX poll, that came out just recently and in the USA Today poll that came out yesterday where I'm really big ahead in the nationwide. They have me head to head against Hillary and Bernie and I beat them both. Isn't that great? We're not doing this for.","I'm not doing this. I'm not doing this to get a nomination because frankly, you know, I had a call from one of the top reporters really in the world, and is very smart on the liberal side. But every once in a while you have to take those calls too, right? And said, \"How does it feel?\" I said, \"How does what feel?\" What you've done has never been done before.","And I've been on the cover like three times in the last, of Time magazine, the last few months. And the one from last week was an unbelievable story because it talks about us. All of us together, it's a movement. And he said, \"How does it feel?\" I said, \"It feels like it doesn't feel anything. I haven't done anything.\" You said, \"Yes, you've done.","What you've done has never been done in politics before. You've changed the whole face of politics. There's never been anything like this.\" Now, he said that. I mean look at this crowd. I have five, six thousand people here. When the other candidates come, they'll have 40. They'll be in one of the little conference rooms, they'll have 51. It's true.","And we have at least 6,000, they said more than 7,000. So, so here's the story. So he said, \"How does it feel? So I said, he said, \"No, no, what you've done, it doesn't matter.\" Now that was in the summer because it was called, The Summer of Trump. I said. \"It doesn't matter.\" He said, \"No. if you don't do anything more, what you've done will always go down.","It'll go down in history.\" I said, \"No it won't. It doesn't mean anything.\" Then he calls up again and now the autumn has gone, right? We're getting into January. He said, \"It's unbelievable. It's hotter now than it's ever been.\" We had 20,000 people at the Mavericks arena. We had 35,000 people in, in Mobile, Alabama.","We have the biggest. We have thousands. The only thing that stops our crowds like this one is the size of the building. We can't get them in. The fire marshals, first person I see is a fire marshal. I go, \"Please let them in.\" And they usually like me and they usually do nice, right? They're great. They're great people.","But the fire marshals have become very important to me because they, you know, stop people from coming in and I hate to send thousands of people home. We sent thousands and thousands. Even tonight, 2,000 people couldn't get into this arena and we sent them and I hate that. But he said, \"So how does it feel?","I said, \"It feels good.\" But it doesn't mean anything. Because unless I win, he said, \"Well, you'll get the nomination. I really believe.\" I said, \"No, no, no, no, I'm not, I mean win, because I will consider it. If we don't win, I'm not just talking nomination. I'm talking we want to make our country better, right?\" We want to make our country better.","And I said if we don't win and if I don't win, I will consider this a major loss. This is not, you know, we've spent a lot of money and I don't care about the money. But I will spend a lot of money and I will spend a lot of time. I mean this is like my fifth one today right. And I said so if we don't win, I will consider it a major loss.","You can write about it in 10 years and say how wonderful it was. But I will consider it a loss because I'm not doing this to look good. I'm doing this because we really do have that incredible potential here. We're going to make this country so incredible again. Again, the word is again. So just to wrap up. We're going to take questions but you don't want.","You know it's been such a nice thing and we won't bother with the questions because I went on a little bit longer than I would normally. Elton John told me, Elton John's a good friend of mine and he said to me, \"You know, when you finish with a great song, get off the stage.\" It's true. Did you ever see you go to a concert, and they just absolutely, they're phenomenal, Elton or somebody?","And they do it so, and that place is going wild. They're standing and they're standing and they're cheering and they're going crazy, right? And they're calling for an encore. And the guy comes out. Does it not go out or here but somebody comes out. Doesn't go quite, right? And the first song is OK. And the second song is OK. And the third songs are done.","And you leave like this, right? So you know, it's been such a good experience being with you. We got a lot. I mean I've said things here that I don't like to say generally speaking but I know I understand this audience. I'm just telling you this. We don't win anymore as a country. We don't win anymore. We lose all the time.","We lose with ISIS. We lose with health care. We lose with Common Core education. We lose with everything. There's nothing we win at. We don't win at all. We don't win at all. We're going to start winning again folks. We're going to be smart. We're going to be the smart people. I'm telling you. We're going to win for our vets.","We're going to take care of our vets. We're going to win for our military. And we're going to win and we're going to knock ISIS out. We're going to win in education. We're going to win in health care. We're going to keep our Second Amendment so strong and so good and we're going to be so proud of it. We're going to start winning again.","We are going to start winning again. And I'll tell you something. The potential here is incredible. I want to be in a position where in two years, three years, four years, you're going to say, \"I was there with our future president and he gave a speech and he said we're going to win. And he more than fulfilled.\" I fulfill things.","I get things done. I fulfill things. And again, I'm not influenced by the money. I don't care about the money. I have more money than all of them. I don't care about the money. I care about this. I care about fairness. I care about making our country so strong. We have just one chance to do it. If we lose this election, if this election goes to a Hillary, who's amazing that she can even be in the election after what she did.","Or a Bernie Sanders, or a Biden, or a Kerry, or who made the Iran deal, who I can't imagine they could use Kerry after making the Iran deal. Who could get elected after making one of the worst deals I've ever seen in history? But if this election goes to somebody else and if we go another four years essentially of Barack Obama, you're never going to bring it back.","You're never going to bring it back. So I just want to tell you, I want to thank you. I love you folks. Go out on Saturday. Go out on Saturday and vote. You've got to go out and vote. You will be so happy, you will be so proud. And we will make America great again. Thank you very much. I love you all. Thank you. Thank you. Thank you everybody. Love you. Thank you."],"text":" Oh, it's a lot of people! Thank you darling. It's a lot of people. Thank you. Thank you. Do we love electricity, by the way? All you, electricity people. We love you guys have been so great. How about life without electricity? Not so good right? Not so good. Great. You have been so fantastic. You have seats. Sit down. Relax, everybody. Come on we'll be here for a while. I have nothing else to do. What the heck. We've been, we've been all over the place. I'll tell you what. South Carolina, unbelievable, unbelievable state. I've been here many times before the whole, you know this whole process. I've been here a lot. I have a lot of friends that live here. It's one of the most beautiful parts of the world and they're great people. The people are fantastic and it's great honor to be with you. So important you know this is now crunch time, right? We've got to get our country back. See all those red hats with the white -- with the white letters? We're gonna get our country back. But I just want to -- I want to thank you because it's been incredible. We are going to do so well. We are hopefully going to get out and vote. Every single person in this room unless you're going to vote for somebody else then don't vote. Don't, you don't have to if you're going to vote you know these guys that say, \"It doesn't matter who you vote for.\" It's important to get out and vote. Trust me if you're going to vote for somebody else, don't vote. OK. Don't vote! So anyway. So we started this journey and it really is, you know, takes a lot of guts to run for president. I'm not a politician. Thank goodness. I'm not a politician and I've had great success. We've built a great, great company. We filed with the Federal Elections and these folks, look at it. Look how many people we have back. It's like, what is this Academy Award time, fellas? Look at this. There they are. Oh, I know my friend from CBS. He's so talented and he's been treating me pretty fair lately. Thank you. Thank you. He's -- he's been treating me, he's been very nice. And remember this crowd goes all the way back into the corners of the room. We can't get one more. We're like sardines in here, OK. So on air now CBS has been great. Actually they came out this morning with a poll that was phenomenal, right? CBS, New York Times came out with a great poll nationwide, a nationwide poll which was great because the Wall Street Journal came out with the biggest joke I've ever seen. They came out with one. I mean basically I was tied. But we don't like ties in this room. Do you agree? We're not big for ties. And it was not a correct poll. I don't know who got those somebody but let's see what happens. But CBS just came out with a great poll and I hear FOX is coming out with a big poll on a little while. We'll see what that is. But it's been amazing. And I can tell you in South Carolina the polls have been amazing. They've been great. But I don't want to tell you that. I don't want to tell you that. Because if I tell you that maybe you'll say I don't have to vote. You have to get out. It's so important, it's so important. And you know, the more we win by, the better it all is, the mandate. You know, it's called the mandate. The more you can win by, the better it's going to be and the more important it is. And then we go to Nevada where we're we have a tremendous lead. But it's caucus. You never know what happens with caucus. You know always problems, always problems. This caucus stuff is a little bit, nobody knows. You can have a 58% lead and then you find out you're not winning because what happens, who knows what happens is a room. People swirl around in these rooms. I'm not sure I like the whole caucus. Such a way, I like to be able to walk into a room, vote and leave. Right? Don't you think? But the caucus states and Nevada we're doing really great. And then we have the SCC and I think we're going to do fantastic, a couple of states like Georgia just came in. Some numbers are phenomenal. And then we go Florida and Florida is going to be fantastic. What do you think when I'm leading Florida? Well I have 48 and as sitting senators at eleven and a governor of past governors. What's Bush? It's like, he's not doing too well. He's not, doing too well in Florida right? No, but well you know it's interesting in Florida. The establishment of which I used to be a member, by the way in good standing. You said before I ran, once I ran I was no longer establishment. They said, \"What's he doing? He's no supposed to be doing this. This isn't supposed to be happening.\" We like people where we can take care of them, where we can give them campaign contributions. Yet I'm self-funding. I'm not taking anybody's money. So it's nice. But, but they all want what's going on with Trump. What's he doing? He's running. He doesn't need our money. This is bad. We want to take care of these people we want to take care of our senators and our Congress people. We want to take care of them. This is terrible news. What's going on with Trump? He was a great, great guy. He'd contribute lots of money. I was a real member of the establishment. I gave $350,000 before I went this way. You know I went over the curb when I decided to run and I decide to run because how stupid are our politicians what they're doing. How stupid. We'll talk about it. But like the Iran deal and the trade deals and we lose money with everybody. We lose money with everybody. So what happened is they went a little crazy because every one of these guys running, gets taken care of by the special interests. Right? They get taken care of by their donors. They get taken care of by the lobbyists. I have a problem I call a lobbyist. You know there's certain lobbyists I like assigned to different senators, right. And you have a problem, you call up a lobbyist. And they go see the senator and it's amazing. It's amazing. It's horrible. And look, it's a system and it's fine. But it's not going to work that way anymore. We owe $19 trillion folks, and we're going to get it down, and we're going to have budgets, and we're going to do things properly, and we're going to have better health care. We're going to have health care. We're going to get rid of Obamacare which is a total disaster. Oh, we're getting rid of it. We're getting rid of it and we're going to do a lot of good things. Common Core is going to be out. Common Core is dead. We bring education back and I talk about it all the time. Look we're number 30. From one to 30, we're number 30. In education, we're No.1 in cost. OK. Think of it. So we spend more money per pupil than any other country in the world. And we're number 30, we're at the bottom of the list, right? So it's obviously something's wrong. And we're bringing local education back and I see it and I've seen it over the years. The parents, they get involved. The family gets involved. The brothers and sisters, everybody gets involved. Then you have great education, less expensive and great education. So we're getting rid of Common Core. We're going to protect our Second Amendment. It's under siege, under siege. You know I tell the story with these two radicalized, I guess I should say young people, right, young people. To me bad people. But the two people, they got married and I guess you radicalized him. Nobody knows. But the bad stuff happened and they go in and they shot the 14 people in California. Killed 14 people, many others injured badly. And these are people that gave them like wedding ceremonies and baby parties and all of this and they killed them and bad things are happening. We have to be vigilant. We have to be smart. We have to be strong. We have to know who to let into our country and who not to let in. We can't be, we can't be the stupid people anymore. We can't be. We cannot be the stupid people. We're led by people that don't know what they're doing, or they know what they're doing and they're just bad. I don't know what's going on. Look, we have a president that won't use the term Radical Islamic terrorism. He won't use it. You see what happens even in Paris. Take a look at Paris as an example. So Paris they kill 130 people. Paris has the toughest gun laws in the world. OK, the toughest in the world. They say France generally, but Paris has they say, I mean, if you're a good person forget it. If you're a bad guy, no problem. You can have all the guns you want, right? You just walk in, you have guns. So Paris has the toughest gun laws. They go into these various places. Boom! Boom! Boom! Boom! They kill 130 people. Many people, I don't know if you've seen this, but many, many people are gravely injured in hospitals right now. Their lives are ruined. Many will die. The number will go up quite a bit above 130. But if we had people I see you know like that guy right there with a red hat. See stand up, stand up. If he had a gun, and he's in Paris. And, the guy with a white hat. That's the white Trump hat. Stand up. Go and stand up. Stand up. And this woman right here, stand up. Yeah, right. Stand up. If honestly, if we had a few people, if it was -- if it was in California, if it was in Paris. But, if there were people on the other side and the bullets were flying also in the other direction, you wouldn't have had 130 people killed. You wouldn't have 14 people killed in California. And the Second Amendment is under siege. Believe me. And if I'm president, it's not going to be under siege anymore. It's going to be ended. So just remember that. You know, I tell that story all the time and I've come from New York and New York has pretty strong gun order, although I have the right to carry it, which is a very nice right to have. But which is really unusual, right, and a very hard right to get, concealed permit. But I will tell you this, I will tell you this. In New York, I have arguments all the time. I say, I used as an example the California case. Wouldn't it have been good if a couple of those people had guns on their waist, guns around their ankle to protect themselves? And everybody is, is that true? And everybody agrees with me. You don't have the argument. They're really anti-gun, and they agree. And we'll leave, that's it. The next morning I'll call. So have I converted you? No. It's just incredible. The fact is there's not even a contest. OK. So we protect our Second Amendment. We have to protect it. Now, when it comes to what I've done. On June 16th I said, I'm going to run. Before then I didn't even know. I was with my wife at the end at the top of the escalator. I looked down at Trump Tower in the atrium. We had more press. I tell you, I've never seen so much press in my life. It looked like the Academy Awards. I said, \"What am I doing?\" I've never seen anything like it. And I went out and I made a speech and I talked about illegal immigration and it was a firestorm. You remember, a firestorm that people coming across the border. And I took a lot of heat. And I say Rush Limbaugh said he took more incoming than any human being I've ever seen. And I did took a lot of heat. And after two or three weeks people would say you know but Trump has a point. And then you had the killing of Kate in San Francisco which was a horror. And you had the killing of Jamil, in, as you know, in Los Angeles and it was like just horrible in California. You had the killing of the female veteran, 65 year old who was raped, sodomized, and killed by a person that was here many, many times and should have never been allowed in the country. And many other cases, and many other cases. And people started saying, you know, it's really right. It's a crime wave. What's going on is a crime wave. And by the way, we're going to have strong borders. We're going to have the wall. We're building the wall. We're building the wall, folks. We're building the wall. And we're going to have people come into our country but they're going to come into our country legally. They're not going to come in like they are now. They walk across a piece of Swiss cheese. They're going to come into our country legally, they're coming in, and it's fine. And they're going to be good people and they're going to come in legally. You know, I just left New Hampshire. We had a tremendous week in New Hampshire. We had, we blew it out. We got every category. We won with men, with women, with tall, with short, with heavy, with thin. We won every category. We won with older people, younger people, highly educated, not so highly educated, with heavy college degrees, without college degrees, without a high school degree. We won everything. And I'll tell you, it was an amazing. They're amazing people too. The people of our country are amazing. The people of our country are amazing. I mean more than anything else, I've learned. Somebody said, \"What did you learn most?\" And you know, they think, \"Oh, you're just saying that.\" I'm not saying it. The people of our, our, our country are amazing people. They're amazing people. We have such unbelievable potential. In fact make America great again. That's great. And about two weeks ago I started saying maybe greater than ever before, because we -- I really mean it. We have to get rid of the regulations. We have to lower your taxes, the taxes are crazy. We have the highest taxes in the world. Our companies are paying taxes, they're leaving. Pfizer, great big, you know, the pharmaceutical company, big company. It's leaving. It's moving to Ireland because the taxes, and because they can't get their money and corporate inversion, you know, they have corporate inversions. They're leaving the country and some of it believing to get their money. We have money. Trillions of dollars are outside of the country. The Democrats agree it should be in. The Republicans agree it should be in, and they can't make a deal. They can't make a deal because we have a president that has no leadership ability. It would be so easy. It would be so easy. It would be so easy to make it. I'm telling you I think I could make that deal in 10 minutes. And yet we spend, you could make that -- who's there to say they have two and a half trillion dollars. I think it's closer to five trillion. The government says it's two and a half trillion. They don't know what the hell they're talking about. I'm telling you, I'm telling you, it's like $5 trillion. They can't get the money into this country. If they did, they could use it for development. They could build new companies. They could spend it on so many things. We can't get it in. And all the politicians agree. And you could sit them down for it so fast, I could make a deal so fast. But we have people that it's not, that it's not their thing. So the companies now are leaving to get their money. They have billions of dollars. They have individually billions of dollars. They're leaving to get their money. It's impossible. The bureaucracy is horrible. The tax rate would be insane. You couldn't do it because the tax rate is insane. There's no incentive to do it. But we could do it so easy and we'd have all of this money pouring in. And this is what we're going to do. Carl Icahn endorsed me some of the great business leaders endorsed me. I mean frankly they'll all endorse me if I want it. Nobody knows who the hell they are. Nobody knows who they are. They call me, \"Don I want to endorse you. Could we have a news conference?\" They said, \"Nobody knows who you are.\" Guy's worth $3 billion. Nobody ever heard of them. But they are great negotiators. We want to use our great negotiators, not our political hacks to deal with China, Japan, Vietnam, India, Mexico which is killing us at the border. Mexico is killing us at the border and killing us in trade. You saw the other day, Carrier is moving down. They're moving out of. They're moving. 1400 jobs moving out of our country, moving to Mexico. And somebody had a cell phone going with the cell phones taking the shot of the boss, saying, \"We're closing up. We're moving to Mexico.\" Right? Not going to happen with me. I'm going to say to him to follow. And I hate to say it. I'm a free trader. I hate to say this. We have to have smart trade. I don't even call it free trade anymore. We don't free trade with China. China is going to make, I mean think of this deficit. We are going, put it a different way. We're going to have a trade deficit with China of $505 billion. What kind of deal is this? What is it? That means you're suck in history. In the history of the world, what China has done to us is the single greatest theft. Think of it. It's the greatest theft in the history. Though, and I love China. I think it's great. The people are great. I made a lot of money dealing with China. I had the biggest bank in the world as a tenant of mine in a building in Manhattan. The biggest bank in the world by far. It's not even close. Our banks are like little toys compared to this bank. Has 400 million customers, 400 million customers. Anyway, they're a tenant of mine. They definitely paid their rent on time. Believe me. But they're tenants. But I've sold tens of millions of dollars of condos to the Chinese people. The Bank of America building which I own a big chunk of in San Francisco. I got it through China, 1290, the Americas, one of the biggest buildings in Manhattan. I got through China. I deal with China. China's fine. But their leaders are too smart for our leaders. They're too smart. So we are losing in trade deficits. We have five more than 500 billion, not million, billion dollars. And this has been going on for years. Not as high as that, but it's been going on for years. And last quarter we announced GDP. We have not, we have nothing. We have no growth. Our country has no growth. And you hear about that phony jobs number where it's 5%. Five percent? It's not 5%. First of all, we have so many part-time jobs. People in this audience probably, I know people that have worked in a company for 30 years as a full time job, very proud of it. They've been put because of Obamacare, frankly. They've been put on as part-timers. Now they're part-time jobs and they go get a second job. Probably people in this audience. So that you don't qualify for Obamacare. Because they don't want to get involved with Obamacare because it's too expensive. It's a disaster because the premiums are gone from 25, 35, 45, 55% up. And you look at what's going on. I mean it is, it is so out of control. Obamacare is going to die in '17 anyway. It's going to die, unless, unless it's going to -- unless the Republicans give it another life ref. It's just crazy. What's going on? But it's so bad. It's worked out to be so bad and I have people. Two people here have Obamacare. Raise your hand. Who does have Obamacare? You know, I keep hearing about people of Obamacare. I never see anybody who has Obamacare. Does anybody here have Obamacare? Isn't it amazing? I hear Obamacare. You're the only one. Stand up ma'am. Congratulations! We're about 6,000 people. It's amazing. We have 6,000 people and you have one person raising the hand that I hear everybody ask, \"What's going on?\" And I did that before I said, \"Who has Obamacare?\" There were two people. Let me tell you, it's a disaster and it's falling off its own weight. And you're your pricing is going through the roof. And we can't have it. We are going to have great health care and health insurance. We're going to have great. It's going to be phenomenal. We're going to get rid of the lines. You know we have lines around each state which make it impossible for other companies. If I want to go from South Carolina and compete in New York, you can't do it as a company. You can't do it. And I have many states, I mean many states have companies and many, many states and it's, it's impossible. The reason is the insurance companies took care of the guys I'm running against and others. They contribute. So you have artificial lines. So a company would rather have an absolute exclusive to South Carolina or to New York or to any state rather than competing all over the United States. And now you have to compete and it's hard. It's hard to make money. It's hard but that's what they want. So the insurance companies through the politicians are getting what they want. I told somebody before that friend of mine came up. He's a doctor. He said, you know Mr. Trump, the worst thing that I've seen. I can't believe it. We are the largest drug buyer in the world, the United States. The largest drug buyer though, by far. Prescription drugs and drugs to make people better, not the kind that come out of the southern border. They don't make people better. They make people, they make people very sick. They make people very sick and we're going to stop it. OK, we're going to stop it. By the way, and you know, maybe even more so, we got to stop it for the people of New Hampshire. You know New Hampshire has a tremendous heroin problem. You look at New Hampshire, it's like this, it's so beautiful with the trees and the valleys and the roads. It's the most beautiful place. And you go there and I love it because I had such a great experience here that I had that great vote that was even better than the polls. The polls were saying I was going to win and the vote was even better than that and everybody was saying, \"Oh, oh this is great.\" I said you know folks, I'm going to really try and have the biggest problem they have. And you just don't see it with New Hampshire. It's heroin. And I go and I said, \"What's your biggest problem?\" They have a big problem with the vets. We're going to take care of the vets, by the way. But we're going to take care of our vets. This is a big vet area. This is a big vet area. But I'm going to do it for New Hampshire because New Hampshire was those people are incredible people and they are just stuck with, with this massive amounts of heroin coming in from the southern border. We're going to stop it. And their kids are addicted, and their kids are addicted, and it's a very tough addiction to get rid of. And we're going to get in there and try and help those kids but we're going to we're going to stop the drugs from coming in now. That includes here and goes everywhere. But for some reason and I've gotten very close to New Hampshire because of that tremendous week that we spent up there and the tremendous end result. And people are saying we may even have a better result here. Can you believe it? Would that be nice? And, if we do, I'll tell you what. We're going to run the table and we are in fact going to make America great again. We're going to run the table because this is very important. But, I said in New Hampshire. I said I'm going to really do something about it because it's just so strange. You wouldn't think that they'd be talking about this because you sit down at this idyllic setting. What's your biggest problem? Heroin. You say heroin and you don't understand it. But then after you are there for a lot you see it's a, it's just a basic problem. So we're going to get those borders taken care of. But think of this, the drug companies with the largest in the world for purchasing. There's no bidding, there no bid. They don't bid. They're restricted from bidding. There's some kind of nonsense where they're essentially restricted from bidding. If we bid with the drug companies, OK, so that. And by the way why aren't they bidding? Tell me why. Because, and my doctor friend said, \"I don't understand it, Donald.\" As soon as you explain to me I said you've got to be kidding. But then I told him exactly why. I said because the senators and the congressmen get massive amounts of money from the drug companies. Very simple, that I know. I mean that's so simple. And then I see this guy Jeb Bush who's got zero chance, by the way, zero chance or what. And he's a nasty guy. You know, in his own way, in his own ways, a nasty guy. He's got zero chance. He spent $20 million of ads on me, negative ads. And they're not even correct. At least get him correct. Although maybe I'm better off if they weren't correct. My polls go up every time he plays the ad. So I don't know, it's not even a. But the guy spent 20 more than that but he spent $20 million of ads for me. So I see his director, his campaign chairman for fundraising as Woody Johnson of Johnson and Johnson, OK. Now, let's say again he's got zero chance so he's not a good example. But let's say Jeb Bush got in. He's not going to do anything with competitive bidding. Let's say Ted Cruz. He's got people. You got to see what he's got. He's got the whole world lined up for him and he lies. He lies badly. He lies. That guy lies. Guy does not tell the truth. You know he holds up his Bible and then he lies. Let me tell you. That guy lies. He is a liar and a very interesting with Ted Cruz. And I don't say that easily. And I know the difference between having fun and playing the game and, you know, we're in politics. But I know the difference between that and lying and when Marco Rubio said he lied the other night at the debates. Said, \"You're lying.\" He's really right. I agree with Rubio that the guy lies. He'll say something. I was hearing things about, \"Donald Trump does not like the second amendment. He'll do away with the Second Amendment.\" I'm the strongest person on the second amendment. Like by far. And I get these reports. And then that stuff. Well, look what he did to Ben Carson in Iowa. He said Ben Carson has quit the race during the election when they're voting. People are walking and he's telling everybody Ben Carson's quit the race. Go with Cruz. And then they took thousands of votes away, thousands. And then right after that he called Ben Carson to apologize after the votes were counted. What kind of stuff is this? And Ben Carson in all fairness, I don't think he accepted the apology because he's still angry about it. But how dishonest. Then he does a voter violation thing he could call voter violation. It looks like it comes right out of the Internal Revenue Service, so official. It said, \"Voter violation.\" A person picks it up, not a sophisticated person. \"Oh wow, voter violation.\" Looks serious. Looks like really the real deal. The paper, everything's perfect. If I got it, I think I'd be concerned. I'd call a lawyer. The lawyer would charge me 3,000 an hour and say, \"You're OK, Mr. Trump.\" But seriously, these people got a scare, a letter, and essentially it said. It said, did you this, did you that, did you that. And then it gives him grades of F, fail. F fail, f, f, f. And then it said, you can clear it up by going and voting for Ted Cruz. What kind of stuff is this? It's a fraud. I'll tell you what, the head of the Iowa GOP, Jeffrey, if he were really smart, he'd terminate that victory in Iowa. Ted Cruz, that's what you should do. Because what he did to Ben Carson and what he did with all the voter violation fraud certificates of fraud. What he did is a fraud. They had to terminate but they don't have the guts to terminate. They don't have the guts. The problem with our country is nobody has the guts. They don't have the guts. But, but we had these, these great things. I mean it was still like a great experience. And then we go to New Hampshire. Now we're here and we're going to do things that haven't been done. We're going to put drugs out to bid folks. And we're going to save $300 billion a year, OK. And when Woody Johnson calls me up, I don't care. Doesn't matter, he's a nice guy. He actually bought an apartment from me. I think he's a nice guy but that doesn't have any impact. All the smart people live in my buildings, OK. But you know what, I'll get called by lobbyists. I'll say, don't even, I won't even take the call. I don't, you know. Again, I'm so funny. I don't know. I don't know that I get credit for this, OK. Because I certainly I don't get the credit. But I've had guys in my office that would give me anything I want. I had one guy come in. He said Donald. You know I've been in first place practically since, since June 16th, practically the whole route, right? I've been in first place almost the entire route. And when you are, the money is just pouring in. I could have the largest PAC. You know these PACs are crooked as hell folks. They're crooked as hell. The PACs are running the campaigns. They run out of money. The PACs take over, they're running the campaigns. They're crooked as hell. They're totally dishonest. What's going on with PACs is a disgrace, OK. It's a disgrace. They are dishonest. They're dishonest as you get. But I would have had the largest amount of money. The largest PAC if I wanted to put money into that if I wanted to raise money. I would have had, I mean Bush had 148 million and he's a stiff, OK. I would have had, I would have had the greatest amount of money ever in the history of PACs, OK. But it's wrong. It's not right. And I said to somebody, I said a group, this one I was talking to a great group of people, packed house. And I said, \"Tell me, do I get credit for this? I'm self-funding my campaign. In all fairness, I'm rich. But it cost me a lot of money. Does it matter really?\" And they stood up and they started giving me a standing ovation. It matters, it matters. I'll tell you why it matters. Because they have, you saw the last debate where they're clapping for Marco Rubio and they're clapping for Bush because that was all their fundraisers and stuff out there. That was all their special interest people out there and I made some good statement. I was the only one I thought I did great in that debate. You know it's interesting. That was a great debate. I was being hit from 15 different sides. Everybody said I won the debates. Everybody said I won and I really won the one previous to that. That was the one with New York values, right? And we won that one and we did great. And the Drudge poll which is great, he's an incredible guy, by the way, the Drudge poll. They do a poll. And I had 68%. That's against a lot of people. And Time magazine has a poll. I won that one too. And then I thought I did best in the last one because I was being hit by everybody. They're desperate. They're desperate. And I was being hit. I never saw anything like it. It was like I'm shooting like this. And I thought I did really well. And although some of the pundits said, \"He was too nasty, he was too tough.\" What am I going to be? Nice? That these people are shooting at me, I'm supposed to be like. Somebody said, \"He was too tough and he was too nasty.\" Well we got to be nasty folks like with ISIS. They're chopping off people's heads. I want to be nasty. Do you mind? Do you mind? I want to be nasty. Oh, we're going to be so nasty. ISIS is not going to like us anymore. ISIS is going to be not so happy folks. Don't forget, I'm the one that said take the oil, right? For years I've been saying that. For years I've been saying, take the oil. I'm the one that said don't go into Iraq. And I said that, don't go into Iraq, 2003, 2004, and before that. I wasn't a politician but it was covered in 2003, 2004. Don't go because they said you're going to destabilize the Middle East. I should be given points for vision because we went into Iraq. We spent trillions we spent $2 trillion, thousands of lives lost, wounded warriors who I love, who I love. They're more brave. They're braver than all of us put together. Wounded warriors who I love all over the place, all over the place. And you know what we have from Iraq? Nothing. Nothing. We don't have a damn thing. We have nothing, OK. This is the kind of thinking. And then we have Obama who instead of getting us out properly or keeping us there. Once we're there, we probably should have kept the force there, at least a small force. So instead of getting us out properly, our president announces the date that we're leaving, that we're going to be totally out. The enemy pulls back and says, \"I can't believe this is happening.\" In fact they thought it was a ruse. They thought it was like, \"He must be kidding.\" Can you imagine General George Patton, \"We're leaving, we're leaving.\" Now you might say, \"We're leaving,\" but you wouldn't mean it. He'd say, \"We're leaving\" and they'd get complacent, \"OK we're gone.\" And then he'd have soldiers lined all over the place and he'd come in and say, \"We would whack the hell out of 'em, OK.\" That's a different kind. Let me tell you. That's a different mentality. That's a different mentality. But you know, General MacArthur, General George Patton. That's a different mentality. I see our generals, they're interviewed by the people sitting back there. They're interviewed by the people sitting back there on shows. Our generals go, they do interviews. I say what the, do we want our generals doing interviews? And one of them is just leaving recently and they said, \"What do you think?\" \"Oh well, you know, ISIS is very tough, very -- .\" Do I want to hear this, tough? Tough. He's saying ISIS is tough. ISIS, we can knock ISIS out. If we want to do it so fast, so surgically, so strongly, we're going to build that military. We have to build up, but we've got to knock him out. I didn't want to be there, but you can't allow people to chop heads. And that's why we, it's like medieval times. One day, one day in the previous debate, they asked Ted Cruz a question. \"What do you think of waterboarding?\" And he goes, \"Then he didn't want any part, that's too tough question, waterboarding, waterboarding.\" Think of it. They're chopping off heads. James Foley, a great young man. That's where it started, James Foley. We couldn't believe it. All of us couldn't believe it, right? We saw it with the, with the orange outfit, this beautiful young guy. I've gotten to know his parents, are incredible people. I contribute to their foundation. These, the parents are incredible people. And James Foley, that's where it started. And we all said, \"That can't be possible.\" Now it's all the time. They're chopping off heads, so they say to Cruz, \"What do you think of waterboarding? And would you continue waterboarding and is it too severe?\" And he's like given this horrible answer. You know he's, I always say about Cruz? He's a very good debater but he can't talk. Does that make sense? In other words you have a conversation with them, that guy can't talk. Everything's \"Wah, wah. I will do this and I will do that. Can I have a very honest person.\" And then he lies. You know, I'm telling you he's a good debater, bad talker. We need some good talkers. But they're asking him about, about waterboarding, and he's really stumbling and mumbling and it was terrible. Then they look at me. They said, \"What do you think? About waterboarding.\" I said, \"Waterboarding is good but it's not tough enough. We should go further.\" Nobody could believe it. No, no. Nobody could believe it. Now, I prefaced that because I didn't know. I mean I didn't poll it. You know, I have more money than all of these guys put together. But I said, you know what, I don't have a pollster. I say what's right. I say what's right. These politicians, if that question was it, that's why Cruz was to hang with that question. He was petrified. He didn't know if he says yes. Does that mean he's too tough? If he says no. So he did, you have to see it. He was stumbling and mumbling all over the place and I didn't want, I don't want to poll anything. You know sort of interesting. They do polls and these people pay hundreds of thousands of dollars, millions of dollars to pollsters of, by the way, special interest money. So it's not so bad for them. But they pay all this money. I pay nothing. But the networks give me polls every day. \"We don't like Donald Trump. He's great on the military. He's great.\" Here's what it is. Great in the military. Trump always No. 1. Great on the border, No. 1. The best for the economy, No. 1. All the time, right? Am I right? You can say it, always. Great on the economy. Great. Nice person. I'm always last. Can you believe it? And I'm a nice person. Nice person. And I'm actually a nice person. But I'm the person that's going to protect, you know, we're in this together. We're going to protect. We're going to, we're going have something so strong and so powerful. We're going to protect. But all the time I get it. So they ask me about waterboarding and I say, \"Waterboarding is fine.\" But I prefaced it by saying, \"We have people that are chopping off heads in the Middle East. They're chopping off the heads of Christians. They're chopping off the heads of others. They're killing and abusing women. There's nobody that I've ever seen, ever.\" You know it's one thing when you have warriors going at each other and they're shooting and fighting and killing. These people are disgusting. I said, \"They are chopping off heads doing the worst things I've ever seen. I think waterboarding is excellent. But you have to go much further than waterboarding.\" And you know what, I got a standing ovation. The room went crazy. I mean it. We're soft and we're weak and we can't be that. Can you imagine the people at ISIS? They're sitting in wherever they are, right? They're all over the place. By the way, they're growing like they're all over. Now you look at maps, you know, two years ago I look at a map there's like little areas of pink. Now you look at a map it's like all over the place. But can you imagine these people, these are tough cookies, right? Tough, mean, can you imagine them listening to this conversation about waterboarding which is the least form. Nobody knows if it's torture. You know, they have been able to define waterboarding. They don't know if it's torture. If it is, might be a little bit too tough. We can't be nice. It's like, you know, these guys that commit murder, right? They commit murder. They kill someone. They, they kill an 80-year-old woman and they rape her, and slug her, and drop her, and just kick the hell out of her, and they go to jail. We don't want the death penalty it's cruel and unusual punishment you know. OK, so I don't know. Then, then you have and then you have another case when they get the death penalty, want to give them drugs to put him to sleep quietly and this. Look, we're in a fight for our lives. We've got people coming in. We've got ISIS in our country folks just so you understand it. We have -- we have President – look, I hate to even use it. We have President Obama, doesn't understand that radical Islamic terrorism is coming in. They could be coming in through the migration. When you look at the migration, you have tremendous, you have thousands and thousands of people. And people are saying and I say it all the time. There's disproportionately young strong men. You look, right, you look at what happens with Germany. What she has done to Germany. I have friends from Germany right now. They're leaving Germany. They're leaving. They were so proud of Germany two years ago. They were talking about Germany's the greatest. They're leaving Germany. Germany is under siege. They're leaving Sweden. You see what happened in Sweden? Take a look at Brussels. I was in Brussels many years ago. It was so beautiful. It's under siege. They canceled New Year's Eve. It's like an armed camp. Are we crazy? Now, I have a bigger heart than anybody. And we want to build safe zones in Syria. And I want to get the Gulf States who are spending nothing and they have more money than everybody put together. I want to get them to pay for it. They've got to pay. They've got to pay. But we have to be vigilant. We have to be tough and we cannot let these people from Syria who we have not been able to vet at all. We don't have papers. We don't have documentation. Nobody has any idea where they come from. And that's all we need. This is like the great Trojan horse. That's all we need is these people coming into our country by the thousands and they turn out to be the people that we most don't want, OK? Not going to happen. And if I win, the people that are in are going out, they're going out. I'm sorry. They're going out. You see what can happen with two young people. She may have radicalized him. Nobody knows. But she came in. They got married and they killed 14 people. This is two people. And these are not fighting people. These are not like what we're talking about. And the other thing is, we have people that are ISIS. They leave our country. They fight for ISIS and then we, they come back and they allowed to come right back, \"Oh, come on back in. It's wonderful to have you.\" Anybody goes out and is sympathetic or fights for ISIS. They're never coming back. Ever, ever, ever coming back into this country again. They're never coming back into this country again. So here's the bottom line. We have tremendous potential. We're going to make great trade deals. And when I came down that escalator, I took a deep breath and I told Melanie and my wife. I said, \"Haaahhh, let's do it.\" Not easy, believe me. Not easy. Then you have all these maniacs back there, the press. They are the worst. They are, by the way. They are -- they are the most dishonest human beings. Most of them, not all of them but most of them. They -- they are the most, for instance, look at this group goes back to each corner at this massive convention center. They'll show this group of people. Maybe if we're lucky, they'll say, \"Donald Trump spoke today in front of a small crowd.\" They never talk about the crowd. I had one day where I had 12,000 people and Bernie Sanders, I mean give me a break. I call him the 95 percenter. You know what, 95% is 95% tax, OK. Bernie Sanders had three. Bernie Sanders had three. And he does get the second largest crowds by the way. But look at this crowd. Up to the corner people trying to get out, trying to get into the building. Look they're trying to come from outside, and they're having a hard time. I'm so sorry ma'am. It's so tough. Look they're trying to pour in they can't. But here's what they show. They won't even show this. They show my face. The only thing that helps me is when I have a protester, right? Because if I have a protest like in that back corner, I didn't think the cameras could move. I thought they were like these really modern cameras, they're fakes. And I'll go home and I tell the story all the time. I say to my wife, \"Darling, how did the crowd look? Oh didn't look like there was much of a crowd. It sounded like a lot of people.\" But I said, \"What you mean, didn't they show the crowd?\" They never showed the crowd. The only time they show the crowd is when there's a protester because a protest is a bad thing. So they want to capture the bad. So they have Bernie Sanders with 3,000 people. I was with 12,000 people. They said Bernie Sanders had a fantastic crowd of 3,000 people and then they have me. They said Donald Trump spoke today. And unbelievable. No, it's so unfair. Let me tell you something structurally and with the press. But structurally, the Republicans have a big disadvantage. Now in the FOX poll, that came out just recently and in the USA Today poll that came out yesterday where I'm really big ahead in the nationwide. They have me head to head against Hillary and Bernie and I beat them both. Isn't that great? We're not doing this for. I'm not doing this. I'm not doing this to get a nomination because frankly, you know, I had a call from one of the top reporters really in the world, and is very smart on the liberal side. But every once in a while you have to take those calls too, right? And said, \"How does it feel?\" I said, \"How does what feel?\" What you've done has never been done before. And I've been on the cover like three times in the last, of Time magazine, the last few months. And the one from last week was an unbelievable story because it talks about us. All of us together, it's a movement. And he said, \"How does it feel?\" I said, \"It feels like it doesn't feel anything. I haven't done anything.\" You said, \"Yes, you've done. What you've done has never been done in politics before. You've changed the whole face of politics. There's never been anything like this.\" Now, he said that. I mean look at this crowd. I have five, six thousand people here. When the other candidates come, they'll have 40. They'll be in one of the little conference rooms, they'll have 51. It's true. And we have at least 6,000, they said more than 7,000. So, so here's the story. So he said, \"How does it feel? So I said, he said, \"No, no, what you've done, it doesn't matter.\" Now that was in the summer because it was called, The Summer of Trump. I said. \"It doesn't matter.\" He said, \"No. if you don't do anything more, what you've done will always go down. It'll go down in history.\" I said, \"No it won't. It doesn't mean anything.\" Then he calls up again and now the autumn has gone, right? We're getting into January. He said, \"It's unbelievable. It's hotter now than it's ever been.\" We had 20,000 people at the Mavericks arena. We had 35,000 people in, in Mobile, Alabama. We have the biggest. We have thousands. The only thing that stops our crowds like this one is the size of the building. We can't get them in. The fire marshals, first person I see is a fire marshal. I go, \"Please let them in.\" And they usually like me and they usually do nice, right? They're great. They're great people. But the fire marshals have become very important to me because they, you know, stop people from coming in and I hate to send thousands of people home. We sent thousands and thousands. Even tonight, 2,000 people couldn't get into this arena and we sent them and I hate that. But he said, \"So how does it feel? I said, \"It feels good.\" But it doesn't mean anything. Because unless I win, he said, \"Well, you'll get the nomination. I really believe.\" I said, \"No, no, no, no, I'm not, I mean win, because I will consider it. If we don't win, I'm not just talking nomination. I'm talking we want to make our country better, right?\" We want to make our country better. And I said if we don't win and if I don't win, I will consider this a major loss. This is not, you know, we've spent a lot of money and I don't care about the money. But I will spend a lot of money and I will spend a lot of time. I mean this is like my fifth one today right. And I said so if we don't win, I will consider it a major loss. You can write about it in 10 years and say how wonderful it was. But I will consider it a loss because I'm not doing this to look good. I'm doing this because we really do have that incredible potential here. We're going to make this country so incredible again. Again, the word is again. So just to wrap up. We're going to take questions but you don't want. You know it's been such a nice thing and we won't bother with the questions because I went on a little bit longer than I would normally. Elton John told me, Elton John's a good friend of mine and he said to me, \"You know, when you finish with a great song, get off the stage.\" It's true. Did you ever see you go to a concert, and they just absolutely, they're phenomenal, Elton or somebody? And they do it so, and that place is going wild. They're standing and they're standing and they're cheering and they're going crazy, right? And they're calling for an encore. And the guy comes out. Does it not go out or here but somebody comes out. Doesn't go quite, right? And the first song is OK. And the second song is OK. And the third songs are done. And you leave like this, right? So you know, it's been such a good experience being with you. We got a lot. I mean I've said things here that I don't like to say generally speaking but I know I understand this audience. I'm just telling you this. We don't win anymore as a country. We don't win anymore. We lose all the time. We lose with ISIS. We lose with health care. We lose with Common Core education. We lose with everything. There's nothing we win at. We don't win at all. We don't win at all. We're going to start winning again folks. We're going to be smart. We're going to be the smart people. I'm telling you. We're going to win for our vets. We're going to take care of our vets. We're going to win for our military. And we're going to win and we're going to knock ISIS out. We're going to win in education. We're going to win in health care. We're going to keep our Second Amendment so strong and so good and we're going to be so proud of it. We're going to start winning again. We are going to start winning again. And I'll tell you something. The potential here is incredible. I want to be in a position where in two years, three years, four years, you're going to say, \"I was there with our future president and he gave a speech and he said we're going to win. And he more than fulfilled.\" I fulfill things. I get things done. I fulfill things. And again, I'm not influenced by the money. I don't care about the money. I have more money than all of them. I don't care about the money. I care about this. I care about fairness. I care about making our country so strong. We have just one chance to do it. If we lose this election, if this election goes to a Hillary, who's amazing that she can even be in the election after what she did. Or a Bernie Sanders, or a Biden, or a Kerry, or who made the Iran deal, who I can't imagine they could use Kerry after making the Iran deal. Who could get elected after making one of the worst deals I've ever seen in history? But if this election goes to somebody else and if we go another four years essentially of Barack Obama, you're never going to bring it back. You're never going to bring it back. So I just want to tell you, I want to thank you. I love you folks. Go out on Saturday. Go out on Saturday and vote. You've got to go out and vote. You will be so happy, you will be so proud. And we will make America great again. Thank you very much. I love you all. Thank you. Thank you. Thank you everybody. Love you. Thank you."}