{"id":449,"author":"Donald Trump","title":"Speech: Donald Trump in Kiawah, SC","date":"2016-02-18","link":"https://factba.se/transcript/donald-trump-speech-kiawah-sc-february-18-2016","paragraphs":["Everybody. Wow. What a great group. What a great group. My golfers. My golfers. Sit down, everybody. What a nice group. Who's the best golfer in the room? Anybody you know? Who's -- who is club champion here? Club champ. Who's the club champ. I want to fight them. I want to beat that son. Well, I just want to thank you.","Great place. I have Doonbeg, you know, in Ireland and it's a sister to Kiowa, built by the same people. They did a beautiful beautiful job and I bought it a number of years ago. And during the downturn in Ireland, I've made a good investment and it's an incredible place. So Doonbeg, do you know about Doonbeg?","I guess, most of you do, right? And we spent a lot of money on making it just perfecting it and now it's doing great. But I don't care about that stuff anymore. It's like small potatoes, right? I let my kids run and have fun with it and let my executives have a good time, but I don't care about it. I care about making America great again.","That's what I care about. And we can do it. You know, I go all over the world and I see different things and different countries and I meet different people. And honestly, there's nothing like what we have. You come back and there's nothing like what we have. And we go to Dallas and we had 21,000 people.","In Oklahoma, we had 20,000 people twice and we have the biggest crowds, no matter where we go. We -- we're in Tampa a couple of weeks ago and just a couple of days notice, we filled up the stadium. It was packed. And no matter where it is, it's been amazing. And I have to tell you, South Carolina is some great place.","I love it. I've been here so much. I love it. I love it. And you know, we have a big, big deal coming up on Saturday. So we have to go out there. And New Hampshire treated me so incredibly well and so did Iowa, actually. I mean, we did really well there, but we did just incredible in New Hampshire. We won every category: Rich, poor, fat, thin, everyone.","Tall, short. We won every category. We won highly educated and not so well educated and we were we were just rocking. And I guess, we got 36% and that was with a lot of people. So it's a big -- we win by 20 points. So it was a great, great week that I spent there and I've spent a lot of time here now and I'll be staying here until Sunday morning.","And hopefully, we'll be celebrating together on Saturday evening. I mean, the big thing is so, so, so important, get out and vote. You know, I'm self-funding my campaign. You people are all rich. You're probably saying, why is he doing that? Why? But I'm himself funding my campaign, putting up my own money and it's expensive.","I mean, it's expensive. I'm proud of the fact that I have -- I'm spending less money than these other characters. You know, their politicians, all they know how to do is spend. I mean, Jeb Bush -- in New Hampshire, Jeb Bush spent $48 million. I spent three. He was like at the bottom of the pack and I was number one by a landslide.","Isn't that what you want for your country, right? Is that what you want? I mean, these guys are spending money. The money they have for the commercials. I see commercial after commercial. And, you know, I put some -- look, I put some commercials and you know why? Because I felt guilty. I really felt guilty because the press -- look at all these guys back there.","The press is saying, well, maybe he's not spending for commercials. Why isn't he spending? And you know, you're leading and you're leading. A great poll just came out about an hour ago, CBS New York Times came out. National poll was great. We had a total ridiculous poll come out yesterday. Did you see that?","Wall Street Journal. Let me tell you. I'll tell you something. That poll was so different than every other poll. And some of the people, the broadcasters looked at it and said, this doesn't make sense. This is no good. About a month ago, I had a pretty good poll. I'd never get treated well in the Wall Street Journal in any capacity, OK? But I had a pretty good poll.","Thank you. Yeah, that's right. They're weak on immigration. I agree with you. They're weak on a lot of things. They're weak on financial. But the Wall Street Journal did a poll last month and I was leading by quite a bit, not as good as other polls because it's never good. But I was leading. I couldn't find it in the paper, right?","I couldn't find it. And literally, I looked all over. I couldn't find it. They had all sorts of other things. Do you love the country? Do you this? Do that? The only thing they didn't do is the main result, but I was in there someplace. I just couldn't find. It was buried someplace in the back of the paper.","Today, they have like an outlier poll. Everybody said -- a certain broadcaster from NBC, who did the poll with them, said I can't go with this poll. This is ridiculous. And they interviewed very few people and very conservative and lots of different criteria. All of which was like -- and today, it's on the front page of The Wall Street Journal.","What a load of crap. OK. Isn't it? It's disgusting. And I'll tell you, in all fairness to CBS and The New York Times, they knew it was -- In my opinion, I have to say that. In my opinion, it's a phony poll because USA Today came out, it was phenomenal. 35, 36, 37, I mean really doing great and all of them.","But in my opinion, that Wall Street Journal poll was a phony poll. I'll tell you that much right now. So we'll see. The New York Times came out just about an hour ago and it was a phenomenal poll, along with CBS and so we're really happy. That's nationwide. In South Carolina, we're doing great. I mean, every, every poll shows that we're doing well.","So it's been -- But I don't want you to think too much about that because you know. Assume we're tied, OK? Even -- Why don't we even assume we're losing by just a little bit because you have to get out. And you know, I say to people I'm self-funding, I'm putting up my own money, but the only thing I want is your vote.","I don't want any of your money. You don't have to give me $0.10. I just want your vote. So if you can remember that, that would be really cool. You know, when this all started, when this all started, this journey. Can you imagine any of you people doing this? It's not easy running for president. It's not necessarily fun.","You got a hit. You get hammered from every corner. You know, you learn things about yourself that you never even thought about. But I will tell you, it's been an amazing experience for me. It's been a really amazing experience. It's been a very interesting experience. It started on June 16th and I said to my wife, we got to do it. I was watching the Iran deal, where we're giving around $150 billion, where we get nothing, where it's gonna lead to nuclear proliferation and everyone is worried about them building the bomb.","Well, they don't have to build it. They can buy it with the money that we gave them. Did you see the money? Did you see the money, where it's being spent? They didn't buy to Boeing. They didn't go to Boeing over here. They bought Airbus, 118 Airbus planes. They're spending their money all over Europe. They're buying missiles from Russia.","The money that we gave them. They're spending it all over the place. They're spending it with everybody but with us. We have the hostages. We've essentially paid $150 billion for the four hostages. And all we had to do is four years ago, three years ago, we all say listen, folks. Before we start, very simple, you give us our hostages back.","And they'll say no and you leave the room. And now you ratchet up the sanctions. You double them up. Within -- I'm telling you, within two seconds, you'll get a phone call saying you've got your hostages. And it would have happened. But we had a negotiator, John Kerry, who is incompetent negotiator. He's a nice guy.","He's an incompetent negotiator. Never left the table once. Never left the table when we were being ridiculed all over the world. When we were being ridiculed in Iran when they're dancing in the streets, saying that we have stupid people representing us. Saying that we're all stupid because of the deal. They can't believe it. The people over there -- I don't know if it was a setup or not.","But everyone, they're dancing all over the place. This is before the deal is done. Who would make a deal after you see that, right? They're burning the American flag. Obama is calling the head, the supreme leader. We have spoken today to the supreme leader. I'm not calling him supreme leader, folks. I can't guarantee you that.","Not the supreme leader. He's not my supreme leader. And so, I mean, you know, what -- just -- it was so discouraging when you look at what's happening with trade. The trade is so disastrous. I mean, what's going on with every country. No matter which country you talk about, every single country. What's going on? Mexico is the new China.","I mean, I just had a word, as an example, the Pope. The Pope was in Mexico. Do you know that? Does anyone even know, right? He said negative things about me because the Mexican government convinced him that Trump is not a good guy because I want to have a strong border. I want to stop illegal immigration.","I want to stop people from being killed like Kate in San Francisco, like Jameel in Los Angeles. Like the Incredible woman veteran, 65 years old, who's raped, sodomized and killed by an illegal immigrant, OK? So the Mexican government fed the Pope a tremendous amount of stuff about Trump is not a good person.","And the Pope just made a statement. Can you imagine? I just got a call. As I'm walking up here, they said Mr. Trump the Pope made a statement about you. I said, the Pope? What did the Pope say? I like the Pope. I mean was it good or bad? Because if it's good, I like the Pope. If it's bad, I don't like the Pope.","No, it's true. Well, you know look, look, Mexico I'm wise to Mexico. And I like Mexico. I have no problem. I have thousands and thousands of people over the years have worked for me from Mexico. Hispanics worked for me. In Nevada, I'm leading with Hispanics. I'm leading the polls. I'm gonna bring jobs back to the country.","They like me. I have thousands of people that have worked for me, Hispanics, over the years. And I have great relationships with Hispanics and I've been telling people I'm gonna win and people are saying, you must be kidding. Like, for instance, right here. It came out two minutes ago, veterans, right here, in your incredible state, right?","The veterans have just -- I've gone up eight points because what I've said. You know what they said two days ago -- what I said about Iraq, about the World Trade Center. I mean, I only tell the truth. Somebody said, did you poll it? One of the politicians, did you poll it? I say, I don't I say. I say what's right.","I say what's on my mind. And if it doesn't work, it's fine. I mean, you know, that's OK. But it's not a question of working. I have to be honest. But in South Carolina, they just did a poll. I went up 8% with the vets. Now, it's supposed to be, boom. The vets get. In fact, we have one of the great vets here, ever, right here, Al. Al, they're liking me. What happened?","What happened? I went up. I was supposed to go down. I love the vets. I do more for the vets than any of these politicians don't do anything for the vets. They talk. So what happened? I went up in the poll. Right? That's very nice. Wow. See, who knew that was gonna happen? You know, they say Trump will say things and we think he's gonna go down and he goes up. And they say -- you know, why?","Because people like honesty and when you think about it. But that was great. So I guess, this is a little bit for the press. So I just wrote this out very quickly about the Pope. Do you want to hear it? Should I read it to you? OK? He actually said that maybe I'm not a good Christian or something. It's unbelievable, which is really not a nice thing to say.","So as a response from Donald Trump. It says if and when the Vatican is attacked by ISIS -- you know, ISIS their primary trophy. Very few people know this. I read this about two months ago. Nobody even believed it. Their primary thing -- you've seen what they've done all over the Middle East. Their primary goal is to get to the Vatican.","That would be their ultimate trophy. They want to do what they did to all of these magnificent artifacts and all of the beautiful museums that they've totally destroyed all over the Middle East, right? And I didn't know this. I read this like four or five months ago. I made mention of it two months ago and everyone said, what are you talking about?","They thought like I'm kidding. It's true. And now, there are stories about it. Not big stories but there are stories about it. And I was checked by one of the reporters. I said, they don't want to talk about it. And he called up and apologize. The big thing they want to get to the Vatican. So if and when, the Vatican is attacked by ISIS, which as everyone knows is ISIS's ultimate trophy, I can promise you that the Pope would have only wished and prayed that Donald Trump would have been president because It's true.","It's true. Because this would not have happened. ISIS would have been eradicated unlike what is happening now with our all talk, no action politicians. That's what's happening now. We had a General MacArthur. If we had a general George Patton, I mean they'd begun before they even got time to go over and check it out, OK? It's a ridiculous situation.","The Mexican government and its leadership has made many disparaging remarks about me. See the Pope was in Mexico. The leadership, oh Donald Trump is a bad guy. He wants to build a wall. He wants to keep illegal immigration. It's terrible. They don't say it that way. They say he wants people to stop having this and that.","Look, I'm wise to them. I respect Mexico. I respect their leadership. Their leadership is much smarter, much sharper than our leadership and that's the problem. That's the problem. You know, we have a trade deficit with Mexico. Listen to this one, $58 billion. So when I say we're gonna build a wall and Mexico is gonna pay for it. These politicians all come up and they say, you can't get Mexico to pay.","Yes, I can. They have no idea what I'm even talking about. You people do because you have some business people here. Some good business people. Some of them I know. But Mexico is gonna pay because the wall is $12 billion, $10 billion to $12 billion dollars. That's a super job, OK? That's if you do a Trump wall, OK? Really nice job.","Nice high wall. There's a high, nice -- this is not a wall that they're gonna drive their trucks off. Now, when we have a deficit of $58 billion, $10 billion to $12 billion is peanuts, OK? It's peanuts. That's nothing. So the politicians say, how could you possibly say that? You know that -- Now, they're all starting to say, you know, he's really right.","We're losing a lot of money with Mexico and that's not including the drug money that's pouring across, which is much more, OK? Believe me. We get the drugs, they get the cash. So they met with the Pope. And they obviously got to the Pope and they tell him what a bad guy Donald Trump is. He doesn't know me. And you know, etc.","So look, the Mexican government and its leadership has made many disparaging remarks about me to the Pope because they want to continue to rip off the United States both on trade and at the border. It's what they're doing. They're ripping us off. And they understand that I am totally wise to them. And if I'm president, we'll stop it immediately, OK? Immediately.","The pope only heard one side of the story and he didn't see the crime, the drug trafficking and the negative economic impact. Their current policy -- I mean, you see what's going on, right? The current policies have on the United States. So he didn't see the crime, the drug trafficking, the economic impact is horrendous, all right?","People can come into our country folks, but they have to come in legally. They have to come in through a process. We're like an open gate. People just walk across. They walk into our country. We don't know who they are. We don't know where they've come from. And by the way, speaking of that, the migration.","The people from Syria. We don't know are they ISIS? Are they not? They're not coming into this country, OK? They can't. He doesn't see how Mexican leadership and he doesn't understand it. He doesn't see how Mexican leadership is outsmarting our president, and Obama and our leadership has no clue as to the negotiation or anything else.","In other words, we are being so badly out negotiated by Mexico. Mexico knows that if I win, those days are gone. We're not gonna have a $58 billion trade deficit. It's not gonna happen. We're not gonna lose Carrier air conditioner, who just moved to Mexico. You saw that. We're not gonna have Nabisco move their big plants to Mexico.","Not gonna happen. Not gonna happen. We're not gonna have Ford building so big $2.5 billion plant. And now, I've been talking about that for a year and a half, now they're doubling down. I read the other day in the paper. They're doubling down. Ford is going in much bigger into Mexico. They took a plant from Tennessee that was going to go to Tennessee and they went -- the plant went to Mexico instead.","When are we gonna get smart, folks? When are we gonna get smart? Got to happen. We can't let this stuff go on because we're losing our jobs. We're losing everything. The Pope isn't being told that. The Pope is being told that Donald Trump is not a nice person, OK? Donald Trump is a very nice person and I'm a very -- I am a very nice person.","And I'm a very good Christian because the Pope said something to the effect that maybe Donald Trump isn't Christian, OK? And he's questioning my faith. I was very surprised to see it, but I am a Christian and I'm proud of it. OK. For a religious leader to question a person's faith is disgraceful. I'm proud to be a Christian and as president, I will not allow Christianity to be consistently attacked and weakened, unlike what is happening now with our current president.","OK? Believe me. No leader -- very important. This has just been given out to the press two seconds ago. No leader especially a religious leader should have the right to question another man's religion or faith, especially when they feed all sorts of false information into them. They're using the Pope as a pawn and they should be ashamed of themselves.","That's the Mexican government. They should be ashamed of themselves for doing so, especially when so many lives are involved. And when illegal immigration is so rampant and so dangerous and so bad for the United States, OK? Period. That's it. Period. So I mean, I come to this beautiful place and I'm looking.","I'm looking at everything so beautiful. The people are beautiful. Everything is nice and I get hit. The Pope just made a statement. Oh good. Did he say good things? No, I don't think you're gonna like it so much. So this is the beginning as I'm walking in, OK? So you are the first to hear it, OK? This is a breaking story, right?","Breaking news. So we have to do something about illegal immigration because our country is being decimated. And speaking of Mexico and again, I have nothing against Mexico. I like Mexico. I have nothing against the leaders of Mexico. I think they're very sharp, very smart, very cunning. They are far too smart for Obama.","They're far too smart for our leadership. When you look at Carrie you're going there, what do we get out of it? OK, Carrier. So I saw the other, I guess somebody was using the cellphone camera. I saw the other day the whole speech made by the executive. We are moving to Mexico. Your jobs are gone. Baa baa baa, right?","And it was very sad. People are very devastated. You could see they were devastated. They've been working in Carrier for many years. They do a good job. I used to buy Carrier air conditioners. I won't buy them anymore. Hopefully, I won't buy because I'll be president. I won't care about a break. But I buy a lot of air conditioners.","I buy a lot of a lot of product. Unfortunately, almost everything you buy now is made -- you buy televisions, you go to South Korea. You buy -- Do we make anything anymore here? We don't make anything. Yeah, we make good golf resorts for you to live in. So what happens is Carrier is leaving. Now, what I would do is different.","You know, I'm a free trader. I believe in free trade. All these, you know, conservative issues. He's not a conservative because he doesn't believe -- I believe in smart trade, folks. They've taken everything we have. China has created the greatest theft -- it's the single greatest theft in the history of the world what they've done to the United States.","They've taken millions of jobs. They've taken our money. They've taken our base. They've taken our manufacturing. They've done so much. Even Boeing, remember this. And I'm saying this to South Carolina. You won't have to worry about it if I'm president. Believe me, it's not gonna happen. They're building massive plants.","In order to get an airline order, they're building massive plants in China. When China devalues their currency in three years from now or four years from now and when they announce they're not gonna make planes in South Carolina anymore because it's much cheaper to make them in China. Remember what Donald Trump said.","You don't have to remember if I win. You just remember if I don't win for some reason. OK? Remember, we better win. Well, we better win. I hope. I hope so. Because it's so easy. So Carrier, so Carrier moves, that's it. They're gonna move. Probably get incentives from our government. You know, there was a time when we're given incentives.","You know, I mean, can you believe it? Probably got tax credits for moving out of the country because we are so far behind. So Carrier leaves and they go to Mexico. So here's what I do and I probably, you know, I want to be presidential. So I'm not supposed to make the call myself, right? But I might make it myself anyway.","You know, Carl Icahn. You know Carl Icahn. Carl Icahn endorsed me and a lot of the big business people endorsed me. And you know, Carl said, look, he's the one guy that knows. I mean, I know -- I understand corporate inversions and all. And I understand what's going on. Trillions of dollars is offshore. It's all over the place, outside of the country.","We can't get it back. The companies can't get it back. Some companies are leaving for taxes because we have the highest taxes in the world. But other companies are leaving to get their money. They can't get it back in. They've got money offshore. They've got money in Europe, all over the place. They can't get their money.","So I have all of these endorsements. So here's what to do with Carrier, OK? Whether it's me or somebody because I will use our greatest business leaders. Some of whom may be in this room, by the way. I will use -- we have the best business people in the world, but we don't use them to negotiate our trade deals.","I will be using our best, best sharpest killer business people to negotiate with the killers from these other countries. And again, I don't -- I think it's great that Mexico is doing this. If you can get away with it, you've got to get away with it. How smart are they. They see the Pope and they tell the Pope bad things about me because I'm against, you know, I'm very, very strong for illegal immigration.","Very -- we got to stop it, right. So they tell the Pope, Trump is bad and the Pope says something negative about me. Now, it's probably gonna be all over the world. Who the hell cares? OK. I don't care. I don't care. I don't care because we have to stop illegal immigration. We have to stop the massive crime.","By the way, we have right now 100, this was as of last week reported. 179,000 illegal immigrants in our country, who are criminals, OK? These are criminal illegal immigrants. We take care of them. We watch them. They commit crimes -- you know, the cost of this and devastation to the families? Kate in San Francisco?","Jameel? I mean one of the greatest young men shot in the face. Kate shot in the back in San Francisco by somebody that should have never been here. We are, we are so incompetently run. Then you have sanctuary cities where people can be there and it doesn't matter. I mean, practically they can be whatever they want to be and they get away with it. We have sanctuary cities.","Nobody even heard the term. I don't think anybody here did. Would you know about sanctuary cities? We have sanctuary cities. We had five or seven in Florida, while Bush was governor. Sanctuary cities. He never told us that. We have, we have a tremendous problem. We have to clean up. We have to be proud of our country again, folks.","We have to go back to the basics. We have to be proud of our country again. So we're losing our businesses. So I would essentially whether it's me or one of my people. I have some tough people. We -- You have to use the right people. But call up Carrier. Say, folks, we don't want you to leave.","Oh, but we're leaving. We're leaving. Why are you leaving? Because we're getting some good deal or they're getting good financing from somebody in the Mexican government or something. OK, smart. Mexico should try and get them. But we should try and keep them. So I say, here's the deal. And I'm a free trader, remember that.","I don't want to have have lots of you know restrictions at the border in terms of trade, et cetera, et cetera. But you got to have fair trade. You have to have smart trade. So I'd say, very simply. I'll say, you know what, congratulations on leaving. Congratulations on devastating those 1,400 families that have been left behind that have done a great job, by the way.","Good product, done a great job for years. Congratulations. But here's the story. You go to Mexico, every air conditioner that you sell that goes into the United says, we're gonna charge you a 35% tax, OK? Let's see if your numbers sell well. And I'd say, let's see if your numbers still work because I'll bet you they don't. And they'll call me and they'll say, oh Mr. President -- but here's the difference.","I'm self-funding my own campaign. I'm not getting paid by their lobbyists, by their special interests, by their donors, by their stockholders. I'm what -- I'm doing right for the people. I mean, I speak before thousands and thousands. I'm doing what's right for the people. I don't care. I don't need the money.","I don't need any money. So I'm doing what's right for this country, OK? And the politicians can't do that. They can't do that. We have people heading up campaigns that are the heads of the drug industry, as an example. Woody Johnson, Johnson and Johnson. He's heading up Bush's fund raising campaign. Did a good, raised $150 million for a guy that's going nowhere.","I mean, you know, when you think of it, right? No, he raised a $150 million for a guy that you might as well take it and throw it into the ocean or let the kids collect it. It's got more value. But Woody Johnson, Johnson and Johnson. Now, here's a thing that I didn't even know. And a friend of mine found out.","The Mar-a-Lago Club, you've heard of the Mar-a-Lago Club. He's a member. He comes up to me, a big doctor. He says, Donald, it's so brutal. Obamacare is such a disaster. I have now more accountants working for me than I have nurses. It's so complicated. It's dragged me. He hates, OK. But he said, do you know Donald that the -- and he's a smart cookie.","He said, you know that the federal government doesn't negotiate drug purchases. I mean, drugs to make you better, drugs. They don't negotiate. They're prohibited from negotiating that the United States government pays sort of like if you walk in, if Mr. Schwarz walks into a drugstore to buy drugs to get better that we pay the same price practically as her.","I said, that's not possible. Not -- he said, it is. And then immediately, you know, being the person that I am. I said, oh it is, of course, because the politicians are all taken care of by the drug companies and therefore, they don't have negotiation, right? That's what it is. There are billions, tens of billions, hundreds of billions of dollars left out there due to policies.","You know, a lot of times when you see -- you think the politicians are stupid and you think the deals are bad. They're not bad. They're good for them. They're taking care of the lobbyists and the special interests, OK? Because they can't be that bad. You look at some of these deals, even the Iran deal. I'll bet you there's something involved.","I mean, it's hard to believe. But look at these companies in Europe that are making a fortune. Airbus, I'll guarantee you they have probably lobbyists. They probably knew that some of this money was gonna buy 118 Airbus planes, 118 planes, not one Boeing. And Boeing is better. I like it better, too. I have one.","But Boeing is better. But think of it, 118. They probably knew. They probably had lobbyists for for Airbus and they probably had lobbyists for Russia. You know, Russia is selling their missiles. They probably had -- everybody has lobbyists. So when you see some of these deals, they are so absolutely bad.","They are bad. But the reason they are bad isn't stupidity. It's in a way dishonesty, OK? It sort of called legal dishonesty. But in a way, it's dishonesty. And when they go up and they say to one of the people running like, Ted Cruz. He's got people -- you are gonna see some of the people that are giving him money.","Forget it, folks. Forget it. You've got problems. He's taken money from people you won't believe. Check out his list of people. But when they go up to Cruz and they go up to these different people that are running, every single one of them, on both sides. By the way, but on my side, I'm the only one. I'm -- on both sides.","I'm the only one self-funding period. And I feel sort of foolish. You know, my whole life has been about money, money. I want money. I want money. I want money. It's greed. I want money. And now, these guys are coming up. They want to give me millions. I have a guy come up to me the other day. Donald, I'll give you whatever you want, millions.","Where? How do I -- I said, I can't take it. You know, it's hard for me to say that because my whole life -- it's hard. I feel a little bit like, am I OK? Am I going crazy here? And I say, I don't want it. No. And every time the guy sees me -- he's a very rich guy. He's a -- he doesn't even understand. I said, no. That's OK. Don't worry about it. You know, you don't have to do anything.","Don't worry. It's OK. And every time he sees me, like once a month I see him at a club at the Mar-a-Lago Club. He's a very, very rich guy. And he says, Donald, I don't understand. You never got back to me. I said, I don't really want your money. Don't worry about it. Don't worry about it. And he can't understand it. They can't understand it. But I would have the greatest fund in history if I ever said, I'm gonna do it. But I will tell you this.","I will tell you this. I think it resonates with the voters. I -- for a while I was saying, I don't think I get any credit. I mean, I'm gonna spend a tremendous amount of money. I've already spent a lot. Even though I spent less than these people, I've spent a lot, you know, because I'm somebody like you.","We watch it. We spend it wisely. We're careful, et cetera, et cetera. But we spent it wisely and I'd spent as much as I need. But we don't want to spend it if we don't need it. I mean, I'm looking at some of the money spent it's incredible. But when they put up their money to the head of the drug companies and to all of these different and the drug companies come in and they've got -- and I tell you something.","I know these people. At the last debate, I walked into the room. I looked at said, oh man. They're all the lobbyists. All the -- I know a lot of them. Those are all the special interests. I did a really good job at that debate. Everybody -- Drudge said I was number one. Time Magazine said I was number one.","Every time I said something there was like yeah. But every time I said something that was like dead silence in the room. And I had one friend, who's a friend of mine, but he's supporting another candidate because he wants to -- he knows he can get something. He can't get anything from me. He said, you're the last person I'll ever support.","He actually told me that. But he's a lobbyist and he's supporting it. And he starts booing me and he's laughing and booing and waving to me. And I'm sort of like waving to him because I understand. I mean, I get it. I had another guy come in. Don, I want to give you a lot of money for your campaign. You know, it's funny I've been number one from just about the beginning from June 16th. Every -- since they really thought I was doing -- Other than the Wall Street Journal today, which we'll have to call them up and find out what was going on there, you know, that phony deal.","But I'd been number one like right from the beginning. I don't like -- I don't like dishonesty, OK? I don't like dishonesty and I think it's dishonest but who knows. But I've been number one just about from the beginning. And when you're number one in this business, in this crazy business of politics, the money is just -- it's unbelievable.","It just pours in. It's just like crazy. I never saw anything like it. It's better than being on The Apprentice. It's the most -- No, it's the most -- when you have -- when you are number one in the polls, people come that you never even heard of. Donald, I'd like you to speak to the head of these massive companies that you know -- they'd like to come in and that they can have lunch.","OK. So I don't even have lunch because I don't want to turn them down. I don't even want to be tempted. You understand that, right? But when you have this kind of stuff come in and they -- I said this to one man. He comes into my office. I want to give you $10 million for your campaign. I said, that's a lot of money but I can't take it because I'm self-funding my campaign.","He goes like, wow. He didn't even -- he thought I maybe didn't hear much. So then he goes again. And I said, no. I don't want it. He said, why? I said because I'm self-funding my campaign. It's a really big part of my campaign. I think, it means something. Although, I must tell you I'm not sure it means as much as it is actually costing.","I don't know. I don't think people are going into the voters who will say I'm voting for Trump. Let's say, it's Trump and this guy, I'm gonna go with Trump because he's self-funding. I don't know that has a big of impact, but I hope it does. Because believe me, believe me, this isn't about me. This is this is an important thing.","It's an important. So anyway, the guy goes and I say I don't want it. And he's sort of a friend of mine and he's leaving the office. I say, just out of curiosity, so what are you gonna do? He said, I'm gonna support somebody else. I said, why? Why? You could support me, but I just don't want your money. I can't take any money.","I don't want your money. He goes, no, no. I have to support somebody else. He said, I love the game. They're gamblers. They're gamblers. They want to put up money. He'd rather give somebody $10 million or $5 million or $2 million than give somebody nothing, OK? It's crazy. They're like horse players. These are the people.","I know them. I mean, I know them me. Don't forget before June 16th, I was a very big contributor. I was, I was like a member of the establishment. The day I ran, boy, did I become anti-establishment fast, OK? And the politicians are going crazy and the head of the RNC and all these people are going crazy because you know, they're not gonna have.","I'm gonna do what's right for the country. I'm not gonna do what's right for the politicians. I'm not gonna do what's right for the special interests. And honestly, I've never talked about this subject so long. But I mean this is a group that really gets it. I mean, you understand it. And probably, some of the people in this room won't be very happy with what I'm saying because they want to have they're -- certainly, you probably have a couple of lobbyists in this room.","I know most of them. Let me see. But one of the things -- one of the things and I started by telling you about pharmaceuticals and the drug companies. Now, when you think about it, OK? When you think about it, you can take that one group and bid it out. And even if you don't per se bid it, if you went with a favorite nations clause because in a way bidding is a little bit, you know, I almost don't trust anybody to bid.","You know, all of a sudden, they move into a beautiful house in the Hamptons or in Palm Beach and you say, gee, I thought they were civil servants and now they're moving to Palm Beach. What happened? But you do a favorite nation's clause. Say with the drug companies, we get the lowest price that you've negotiated over the last 12-month period immediately to the United States of America less 10% because we're a big, big, big buyer.","So we would get the lowest price. I like that better than having a negotiation. In other words, now everybody else negotiates. Whatever the lowest price that they've made for a certain product, we get the lowest price. And then I'd take a discount beyond that. And you know what, we'd save hundreds of billions of dollars.","Defense industry, same thing. Much more so though, I would say. For 25 years, ever since I'm sort of like where I'm really interested in this stuff, I've been watching as they're ordering equipment and they're ordering things that they don't want. You know, you've been seeing the story the airplane that they didn't like as much as the other one that they're getting equipment that they don't need that they don't want.","Well, the reason is because those companies that make the equipment are politically astute. They have taken care of these people that I'm with. They have taken care of lots of other people that I'm not with. And they order equipment that they don't want. I'm gonna make our military so strong, so powerful.","You have no idea what we're gonna do because we have the technology but -- But we're gonna do it for a lot less than anybody thought possible. And we're gonna get the equipment that the generals want and the soldiers want and all of the people want that are running the equipment. We're not gonna get equipment that you know -- and I've seen in it. The airplane, oh well, we didn't really want this airplane.","We wanted the other one but we are -- you know, the politicians are making the decisions. OK? We're gonna get the best stuff. We're gonna be so strong. Nobody is gonna play games with us, folks. Nobody. We're gonna get the best stuff. There'll be nothing like it what we can do, and we're gonna save a fortune.","We're gonna save a fortune. So with the military that happens I tell you about the pharmaceutical stuff. We're going out to bid, OK? Save hundreds of billions of dollars. With the military, you're talking about much bigger numbers than that but we'll have a much better. Somebody would say, will it be better or not?","I remember the United Nations, right? So I testified in front of a great group of senators actually, who were terrific. In fact, your senator from Oklahoma who just said horrible things. He said Ted Cruz is the most dishonorable, dishonest person I've ever met. What he said is -- he cannot stand them. But they asked me to testify in Congress about the World Trade Center, about the World Trade Center but also mostly about the United Nations.","Because they were doing a renovation of the United Nations and they said, we would like to understand this. You built a building across the street that's 92 stories tall. We are renovating the United Nations and we're gonna spend $1 billion. I said, no, you're not. You're gonna spend $4 billion because by the time they kill you with the overruns, you will spend $4 billion.","No, no, no, it's $1 billion. OK. How much did you spend? So there was a story in The New York Times that said I built the building for $322 million, 92 stories condo. Trump World Tower, a beautiful building right opposite the United Nations. That was 322 -- about $320 million, right? Now, they're gonna renovate the United Nations, which is a much -- you know, which is not a big deal.","And they gonna to spend $1 billion. So an ambassador from, I think, it was Sweden called up. Mr. Trump, can I meet you? Why? I'm on a committee. We don't understand how can you spend $322 million to build this incredible building, brand new, beautiful. And yet, we're spending $1 billion to just fix up the United Nations.","I said because of two reasons: Corruption and incompetence. It's very simple. No, it's true. So this man, I think, it was the ambassador to Sweden. It was a while ago, five years six years. This man is a terrific guy. He said, I'd like to go public and I'd like to -- could you meet the head of the United Nations?","I met the head of the United, Kofi Annan at that time. I met him and he had no interest in my -- All he wanted was a press. In fact, I'm sitting there in a chair and there's a big curtain sort of like this. And I didn't know what was going on. And all of a sudden, the curtain opens and there was so much press.","Then they're taking pictures. That's all he wanted. He didn't care about the cost of this thing. So what happened is they brought in the man that's in charge of it. So I said, are you using a boiler system? Are you using New York steam? What are you using for heat? He said, I have no idea. He had no idea.","He didn't know boilers. He didn't know anything. This guy knew nothing. He was in charge of construction. So they're worth $1 billion. I said, this is not gonna cost a billion. This is gonna cost $4 billion or $5 billion, which turned out to be exactly true. It costs a fortune, OK? So I offered to do the job for $500 million.","I said, I will do the job. Site unseen. They say, well, what's the difference? I said, here's the difference. The difference is you'll have a much better job for 500 million. Then you'll have for in my -- I actually predicted it will cost $4 billion if they do it themselves because when you have people out there that you don't even know about, you won't ever read about.","They're really, really rich. Just so you understand real. They could move to very easily. Believe me. You got some rich people out there. But I said here's what's going to happen. You're going to have a tremendous cost overrun, that happened. You have people that don't know what they're doing, but they probably do know what they're doing very well.","And -- but they said to me, what's the difference? The difference is I'll have marble floor. They'll have . I'll have better elevators. They won't. With me, you don't have to move out. They're gonna have to move out. Under their scenario, everybody had to leave the United Nations. Rent office space.","Big trouble. Hard to get in Manhattan and then come back. I was gonna do it everybody in place, right? Everything was better. And I never heard from them. I never heard from them. And then the next time I heard was a few years later when the thing was totally out of control and it's cost a fortune and all that.","Well, the same thing is true with our country. Our country we will spend less money, but we'll have better roads, better airports. You know, our infrastructure is a disaster. We spent in Iraq, which was a horrible decision to go into Iraq, OK? You know that. I mean, I hope you know that. And I should get points for vision because I said right at the beginning.","Don't go into Iraq. You're gonna destabilize the Middle East. We spent $2 trillion in Iraq and now, it's much more than that. But $2 trillion that was it as of two years ago. Thousands of lives, wounded warriors, who I love, love all over the place, OK? We have nothing. We have nothing. We have to start rebuilding our country.","We've got to knock the hell out of ISIS and knock them out and knock them out like you've never seen anybody get knocked out. But we have to get back to rebuilding our country. Our country is a mess. Our roads, our bridges. You know, 40% of our bridges are in danger. I mean, you know what danger means? Danger means like you go over and you've seen collapses of bridges.","We have tremendous infrastructure problems. And by the way, wouldn't it be great to have a great builder in charge of like a country that has to spend billions and billions and trillions on infrastructure? Because I am. I mean, I'm I building the old post office on Pennsylvania Avenue and we're way ahead of schedule and under budget.","We're two years ahead of schedule. I actually said to my daughter, let's not say two years because it doesn't even sound believable. But we're actually two years under schedule, ahead of schedule and under budget and it's right on Pennsylvania Avenue. I like it because this way, if I don't make the White House, I'll still be living on Pennsylvania Avenue 100%. But we're under budget, ahead of schedule, it's gonna open up to September of this year.","It was supposed to open September in two years from now and it's gonna be one of the great hotels of the world. Maximum job. Unbelievable. It's gonna be one of the great hotels of the world. That's what we need. That's the thinking we need in this country. That's the thinking we need in this country. So I tell the people and they say, well, what would be the difference like with the military?","I say here's the story. We'll spend less money. We have much better equipment. We'll have much happier people. Everybody's gonna love it. We're gonna be stronger, better just like the story with the United Nations. What's the difference? $4 billion versus $500 million. Well, the 500 billion the United Nations will have marble floors, instead of frankly party, but they'll have marble floors.","They'll have -- everything will be the best. Same thing with us. We can do that. I mean, we can do that. We have the wrong systems in place. We have tremendous corruption. We have tremendous, tremendous corruption. You look at what's going on the Veterans Administration. It's one of the most corrupt enterprises that I've ever seen, OK? We can straighten it out.","We're gonna make -- That's why Al is one of the most respected vets in the country. And he was up in New Hampshire and we got tremendous support up in New Hampshire for the vets. I mean, beyond -- anybody even came close but they have confidence in me. We've got to take care of the vets. Our vets are being decimated.","Our vets are being treated worse than illegal immigrants, in many cases. It's true. It's true. They get things, they get things that our vets, that vets can't even think about getting. I mean, the whole thing is crazy. I mean, think of yourselves. They go to doctors offices. They have four day and five day waits before they can even see a doctor, in some cases, four.","Can you imagine you, you go into a doctor's office or they'll say you have a five-day wait. That doctor is in trouble. Is that a correct statement? I mean, you know, as an example, so we've got to take care of our vets. We've got to take care of our military. We're gonna make trade. We're gonna bring back our jobs.","We're bringing them back and we're gonna have our greatest people, but we're bringing them back. We have the greatest negotiators. We're bringing our jobs back from China, many of them. I want to see Apple computers made in the United States. What good does it do when they're made in China? What good does it do? And we have to get them to stop devaluing their currency.","And remember this, we have the cards because we have this pot of gold. There's not such gold anymore. By the way, you know, we owe China $1.7 trillion. We owe Japan $1.5 trillion. How about Japan? They make cars. Biggest boats I've ever seen. They come pouring off these massive boats from Japan. Just pouring.","We give them practically nothing. You talk about trade? They do these cars. You've never seen ships like this. So big. I was in Los Angeles recently, and the cars are pouring off the ships from Japan. So they sell us millions of cars. We sell them like nothing. We give them nothing by comparison. Where's the fairness there, folks?","We need to bring smartness back to our country. We need to bring negotiation back to our country. We need to bring honesty back to our country. We need to get deals that are great. We have to bring our manufacturing back. Recently, a friend of mine ordered Komatsu tractors from Japan. He's always order a big excavator, big company.","He always orders Caterpillar. But he said, I couldn't do it. He felt badly. I could see. I said, what's your problem? He said, I feel guilty because I ordered Komatsu tractors. They're from Japan. He said, Donald, they've so devalued the yen that I owed it to myself and my family, my wife. I owed it to my employees to buy.","I bought it for much cheaper. What's the difference in the equipment? He said Caterpillar is better, but not that much. I mean, I can't -- I had no choice, he said. So he bought Komatsu equipment. Well, that's what's happening to us. We're being outsmarted by very smart people and we don't have the people -- it's like the New England Patriots playing some high school football team.","We don't have -- we don't have the people in place. We don't have the right people that are doing -- this this is like a great surgeon. This is like you need somebody that's incredible. This is not easy stuff. These people have it naturally. When I take Carl Icahn. I said, Carl take a look at the Chinese trade deal.","I got the greatest guy. You understand that. I mean -- and he doesn't want money. He didn't want it. He loved to do it. I mean, he'd love to do it. So we're going to make a lot of changes if we get in. We're gonna make our country rich again. A woman came up to me. She said, Mr. Trump, that doesn't really sound nice.","I said, look, $19 trillion, we just made that horrible omnibus budget. You saw that deal. It took like two hours. I never saw a deal go so fast. Obama got everything he wanted. You know, Obama's a lousy negotiator except when it comes to negotiating with the Republicans. Is that right? He's a terrible negotiator.","But with the Republicans, he gets whatever he wants. You look at it. He got -- in that deal, he got so much. He got money to bring in the migrants from Syria, who can't take because we don't know who they are, where they are, where they come from. We'll do a safe zone and we'll have the Gulf States pay for it. Not us. We don't want to pay.","But we'll have the Gulf states -- they're not putting up any money. They have so much money. Saudi Arabia makes a billion dollars a day when the oil price was high. Now, they make half, OK? Not so bad. But -- and I think of Saudi Arabia. We protect Saudi Arabia. They were making a billion dollars a day. They have more money than anybody and we lose money.","I mean, we rent military areas. We pay them rent. And without us, they would have been gone years ago. I mean, who's thinking about this? Japan. We protect Japan. OK. But here's the problem. So we protect Japan, who owes a fortune, by the way, we protect Japan. If we're attacked, Japan doesn't have to do anything.","If Japan is attacked, we have to be in World War 3., OK? I mean, who's doing this stuff? So we protect Germany. Germany is a behemoth, an economic behemoth. It's being destroyed by what Merkel has done there. What she has done to Germany -- I have friends from Germany. They're leaving Germany. They are leaving Germany.","These are people who were so proud a year ago being in -- being German people. They were so proud they used to brag. I said, are you still proud? Not so proud. They're leaving Germany. They're moving to other countries. What she's done. I don't know what happened to her. I thought she was a terrific leader, and I don't know maybe she got carried away with herself.","I don't know. Like, tremendous crime. You look at Sweden the other night. Did you see what happened in Sweden the other night? Sweden. Sweden doesn't have crime. They are going around -- it's a disaster. You look at Brussels. I was in Brussels 20 years ago. Brussels, beautiful Brussels. It's like an armed camp.","They had to cancel New Year's Eve because of the horrible, horrible threats of massive crime. We have to get smart, folks and we can't be so politically correct. Oh, that's not a nice thing to say. That's not nice. And actually a lot of people and maybe it happened to a certain extent in New Hampshire. They thought I'd get 27%, 28%. I ended up getting 36%, 37%. And I think what happened and a lot of people said, you know, the poller goes up to Trump.","Well, would you vote for Trump? No. No. No. But then they get to the booth, I want Trump. I want Trump. It's true. We might poll higher. So I love this place. I have so many friends that live here and I have such great relationships here. And I've been here a couple of times, where I was you know at the place I actually played and it's fantastic.","But we have a country that has such potential. We have a country that is so great. We can make it truly. And right now, it's got a tremendous headache. And I'll tell you if Hillary Clinton gets in or this guy, Bernie, wants to tax you 95%, if he gets in. Everything is for free except for the people that have to pay tax.","And you know what happens to those people? They leave. It's like the companies. The companies are leaving now because the taxes are too high. My tax plan brings the corporate taxes way down. It has to because the companies are leaving. When you lose Pfizer -- how good a company is Pfizer? They're moving.","It's gone. They're in Ireland. They're moving to Ireland. They're moving because the taxes are too high and they couldn't get their money back in. They moved to get their money. But I'm just saying this. We have tremendous potential as a country. Tremendous. I love this country. I love South Carolina. I love it. I love the people.","The people are incredible people. Saturday is so important to get out and vote. We're gonna turn it around. And believe me it's we. It's not me. I'm like a messenger. This is why. They wrote -- last week, the cover of Time Magazine wrote the most incredible story. I don't normally say incredible story. There's one word I hate it, right?","But but this is the most incredible -- they talk about this is a movement that's going on with all of us, with us. Not the Bernie thing. We get far bigger crowds than Bernie. We get everything bigger than Bernie. And Bernie, I think is gonna fizzle because eventually although it's gonna be interesting what happens to Hillary with the emails because she should be. What she did is a disgrace, OK? What she did is a disgrace.","One thing I liked in the poll that came out in USA Today today said I'm leading by a lot. It was a great poll, a national poll and it said I beat Hillary and I beat Bernie very easily and head to head. So that's always a nice thing. But I do in a lot of polls. But the theme is: Make America Great Again. And I tell you, we can make it greater than ever before.","Let me just tell you. If I get elected, we're gonna start winning again. We're gonna win on trade. We're gonna win at the border. We're not gonna have the Mexican officials going over and seeing the Pope and saying, you know, Donald Trump is a bad person. He's a bad person. He wants to stop people from walking freely across the border.","And the Pope doesn't know this. I mean, the Pope is told this. I mean, I don't even blame the Mexican officials for trying to get away with it. But I don't think they're gonna get away with it, OK? Because we're wise to him. We can't lose $58 billion a year in deficits. So I just say this. We're gonna start winning again and we're gonna make America great again.","And I appreciate it very much that you're here. I love you, people, special people. Thank you very much. Thank you. Thank you. Thank you very much."],"text":" Everybody. Wow. What a great group. What a great group. My golfers. My golfers. Sit down, everybody. What a nice group. Who's the best golfer in the room? Anybody you know? Who's -- who is club champion here? Club champ. Who's the club champ. I want to fight them. I want to beat that son. Well, I just want to thank you. Great place. I have Doonbeg, you know, in Ireland and it's a sister to Kiowa, built by the same people. They did a beautiful beautiful job and I bought it a number of years ago. And during the downturn in Ireland, I've made a good investment and it's an incredible place. So Doonbeg, do you know about Doonbeg? I guess, most of you do, right? And we spent a lot of money on making it just perfecting it and now it's doing great. But I don't care about that stuff anymore. It's like small potatoes, right? I let my kids run and have fun with it and let my executives have a good time, but I don't care about it. I care about making America great again. That's what I care about. And we can do it. You know, I go all over the world and I see different things and different countries and I meet different people. And honestly, there's nothing like what we have. You come back and there's nothing like what we have. And we go to Dallas and we had 21,000 people. In Oklahoma, we had 20,000 people twice and we have the biggest crowds, no matter where we go. We -- we're in Tampa a couple of weeks ago and just a couple of days notice, we filled up the stadium. It was packed. And no matter where it is, it's been amazing. And I have to tell you, South Carolina is some great place. I love it. I've been here so much. I love it. I love it. And you know, we have a big, big deal coming up on Saturday. So we have to go out there. And New Hampshire treated me so incredibly well and so did Iowa, actually. I mean, we did really well there, but we did just incredible in New Hampshire. We won every category: Rich, poor, fat, thin, everyone. Tall, short. We won every category. We won highly educated and not so well educated and we were we were just rocking. And I guess, we got 36% and that was with a lot of people. So it's a big -- we win by 20 points. So it was a great, great week that I spent there and I've spent a lot of time here now and I'll be staying here until Sunday morning. And hopefully, we'll be celebrating together on Saturday evening. I mean, the big thing is so, so, so important, get out and vote. You know, I'm self-funding my campaign. You people are all rich. You're probably saying, why is he doing that? Why? But I'm himself funding my campaign, putting up my own money and it's expensive. I mean, it's expensive. I'm proud of the fact that I have -- I'm spending less money than these other characters. You know, their politicians, all they know how to do is spend. I mean, Jeb Bush -- in New Hampshire, Jeb Bush spent $48 million. I spent three. He was like at the bottom of the pack and I was number one by a landslide. Isn't that what you want for your country, right? Is that what you want? I mean, these guys are spending money. The money they have for the commercials. I see commercial after commercial. And, you know, I put some -- look, I put some commercials and you know why? Because I felt guilty. I really felt guilty because the press -- look at all these guys back there. The press is saying, well, maybe he's not spending for commercials. Why isn't he spending? And you know, you're leading and you're leading. A great poll just came out about an hour ago, CBS New York Times came out. National poll was great. We had a total ridiculous poll come out yesterday. Did you see that? Wall Street Journal. Let me tell you. I'll tell you something. That poll was so different than every other poll. And some of the people, the broadcasters looked at it and said, this doesn't make sense. This is no good. About a month ago, I had a pretty good poll. I'd never get treated well in the Wall Street Journal in any capacity, OK? But I had a pretty good poll. Thank you. Yeah, that's right. They're weak on immigration. I agree with you. They're weak on a lot of things. They're weak on financial. But the Wall Street Journal did a poll last month and I was leading by quite a bit, not as good as other polls because it's never good. But I was leading. I couldn't find it in the paper, right? I couldn't find it. And literally, I looked all over. I couldn't find it. They had all sorts of other things. Do you love the country? Do you this? Do that? The only thing they didn't do is the main result, but I was in there someplace. I just couldn't find. It was buried someplace in the back of the paper. Today, they have like an outlier poll. Everybody said -- a certain broadcaster from NBC, who did the poll with them, said I can't go with this poll. This is ridiculous. And they interviewed very few people and very conservative and lots of different criteria. All of which was like -- and today, it's on the front page of The Wall Street Journal. What a load of crap. OK. Isn't it? It's disgusting. And I'll tell you, in all fairness to CBS and The New York Times, they knew it was -- In my opinion, I have to say that. In my opinion, it's a phony poll because USA Today came out, it was phenomenal. 35, 36, 37, I mean really doing great and all of them. But in my opinion, that Wall Street Journal poll was a phony poll. I'll tell you that much right now. So we'll see. The New York Times came out just about an hour ago and it was a phenomenal poll, along with CBS and so we're really happy. That's nationwide. In South Carolina, we're doing great. I mean, every, every poll shows that we're doing well. So it's been -- But I don't want you to think too much about that because you know. Assume we're tied, OK? Even -- Why don't we even assume we're losing by just a little bit because you have to get out. And you know, I say to people I'm self-funding, I'm putting up my own money, but the only thing I want is your vote. I don't want any of your money. You don't have to give me $0.10. I just want your vote. So if you can remember that, that would be really cool. You know, when this all started, when this all started, this journey. Can you imagine any of you people doing this? It's not easy running for president. It's not necessarily fun. You got a hit. You get hammered from every corner. You know, you learn things about yourself that you never even thought about. But I will tell you, it's been an amazing experience for me. It's been a really amazing experience. It's been a very interesting experience. It started on June 16th and I said to my wife, we got to do it. I was watching the Iran deal, where we're giving around $150 billion, where we get nothing, where it's gonna lead to nuclear proliferation and everyone is worried about them building the bomb. Well, they don't have to build it. They can buy it with the money that we gave them. Did you see the money? Did you see the money, where it's being spent? They didn't buy to Boeing. They didn't go to Boeing over here. They bought Airbus, 118 Airbus planes. They're spending their money all over Europe. They're buying missiles from Russia. The money that we gave them. They're spending it all over the place. They're spending it with everybody but with us. We have the hostages. We've essentially paid $150 billion for the four hostages. And all we had to do is four years ago, three years ago, we all say listen, folks. Before we start, very simple, you give us our hostages back. And they'll say no and you leave the room. And now you ratchet up the sanctions. You double them up. Within -- I'm telling you, within two seconds, you'll get a phone call saying you've got your hostages. And it would have happened. But we had a negotiator, John Kerry, who is incompetent negotiator. He's a nice guy. He's an incompetent negotiator. Never left the table once. Never left the table when we were being ridiculed all over the world. When we were being ridiculed in Iran when they're dancing in the streets, saying that we have stupid people representing us. Saying that we're all stupid because of the deal. They can't believe it. The people over there -- I don't know if it was a setup or not. But everyone, they're dancing all over the place. This is before the deal is done. Who would make a deal after you see that, right? They're burning the American flag. Obama is calling the head, the supreme leader. We have spoken today to the supreme leader. I'm not calling him supreme leader, folks. I can't guarantee you that. Not the supreme leader. He's not my supreme leader. And so, I mean, you know, what -- just -- it was so discouraging when you look at what's happening with trade. The trade is so disastrous. I mean, what's going on with every country. No matter which country you talk about, every single country. What's going on? Mexico is the new China. I mean, I just had a word, as an example, the Pope. The Pope was in Mexico. Do you know that? Does anyone even know, right? He said negative things about me because the Mexican government convinced him that Trump is not a good guy because I want to have a strong border. I want to stop illegal immigration. I want to stop people from being killed like Kate in San Francisco, like Jameel in Los Angeles. Like the Incredible woman veteran, 65 years old, who's raped, sodomized and killed by an illegal immigrant, OK? So the Mexican government fed the Pope a tremendous amount of stuff about Trump is not a good person. And the Pope just made a statement. Can you imagine? I just got a call. As I'm walking up here, they said Mr. Trump the Pope made a statement about you. I said, the Pope? What did the Pope say? I like the Pope. I mean was it good or bad? Because if it's good, I like the Pope. If it's bad, I don't like the Pope. No, it's true. Well, you know look, look, Mexico I'm wise to Mexico. And I like Mexico. I have no problem. I have thousands and thousands of people over the years have worked for me from Mexico. Hispanics worked for me. In Nevada, I'm leading with Hispanics. I'm leading the polls. I'm gonna bring jobs back to the country. They like me. I have thousands of people that have worked for me, Hispanics, over the years. And I have great relationships with Hispanics and I've been telling people I'm gonna win and people are saying, you must be kidding. Like, for instance, right here. It came out two minutes ago, veterans, right here, in your incredible state, right? The veterans have just -- I've gone up eight points because what I've said. You know what they said two days ago -- what I said about Iraq, about the World Trade Center. I mean, I only tell the truth. Somebody said, did you poll it? One of the politicians, did you poll it? I say, I don't I say. I say what's right. I say what's on my mind. And if it doesn't work, it's fine. I mean, you know, that's OK. But it's not a question of working. I have to be honest. But in South Carolina, they just did a poll. I went up 8% with the vets. Now, it's supposed to be, boom. The vets get. In fact, we have one of the great vets here, ever, right here, Al. Al, they're liking me. What happened? What happened? I went up. I was supposed to go down. I love the vets. I do more for the vets than any of these politicians don't do anything for the vets. They talk. So what happened? I went up in the poll. Right? That's very nice. Wow. See, who knew that was gonna happen? You know, they say Trump will say things and we think he's gonna go down and he goes up. And they say -- you know, why? Because people like honesty and when you think about it. But that was great. So I guess, this is a little bit for the press. So I just wrote this out very quickly about the Pope. Do you want to hear it? Should I read it to you? OK? He actually said that maybe I'm not a good Christian or something. It's unbelievable, which is really not a nice thing to say. So as a response from Donald Trump. It says if and when the Vatican is attacked by ISIS -- you know, ISIS their primary trophy. Very few people know this. I read this about two months ago. Nobody even believed it. Their primary thing -- you've seen what they've done all over the Middle East. Their primary goal is to get to the Vatican. That would be their ultimate trophy. They want to do what they did to all of these magnificent artifacts and all of the beautiful museums that they've totally destroyed all over the Middle East, right? And I didn't know this. I read this like four or five months ago. I made mention of it two months ago and everyone said, what are you talking about? They thought like I'm kidding. It's true. And now, there are stories about it. Not big stories but there are stories about it. And I was checked by one of the reporters. I said, they don't want to talk about it. And he called up and apologize. The big thing they want to get to the Vatican. So if and when, the Vatican is attacked by ISIS, which as everyone knows is ISIS's ultimate trophy, I can promise you that the Pope would have only wished and prayed that Donald Trump would have been president because It's true. It's true. Because this would not have happened. ISIS would have been eradicated unlike what is happening now with our all talk, no action politicians. That's what's happening now. We had a General MacArthur. If we had a general George Patton, I mean they'd begun before they even got time to go over and check it out, OK? It's a ridiculous situation. The Mexican government and its leadership has made many disparaging remarks about me. See the Pope was in Mexico. The leadership, oh Donald Trump is a bad guy. He wants to build a wall. He wants to keep illegal immigration. It's terrible. They don't say it that way. They say he wants people to stop having this and that. Look, I'm wise to them. I respect Mexico. I respect their leadership. Their leadership is much smarter, much sharper than our leadership and that's the problem. That's the problem. You know, we have a trade deficit with Mexico. Listen to this one, $58 billion. So when I say we're gonna build a wall and Mexico is gonna pay for it. These politicians all come up and they say, you can't get Mexico to pay. Yes, I can. They have no idea what I'm even talking about. You people do because you have some business people here. Some good business people. Some of them I know. But Mexico is gonna pay because the wall is $12 billion, $10 billion to $12 billion dollars. That's a super job, OK? That's if you do a Trump wall, OK? Really nice job. Nice high wall. There's a high, nice -- this is not a wall that they're gonna drive their trucks off. Now, when we have a deficit of $58 billion, $10 billion to $12 billion is peanuts, OK? It's peanuts. That's nothing. So the politicians say, how could you possibly say that? You know that -- Now, they're all starting to say, you know, he's really right. We're losing a lot of money with Mexico and that's not including the drug money that's pouring across, which is much more, OK? Believe me. We get the drugs, they get the cash. So they met with the Pope. And they obviously got to the Pope and they tell him what a bad guy Donald Trump is. He doesn't know me. And you know, etc. So look, the Mexican government and its leadership has made many disparaging remarks about me to the Pope because they want to continue to rip off the United States both on trade and at the border. It's what they're doing. They're ripping us off. And they understand that I am totally wise to them. And if I'm president, we'll stop it immediately, OK? Immediately. The pope only heard one side of the story and he didn't see the crime, the drug trafficking and the negative economic impact. Their current policy -- I mean, you see what's going on, right? The current policies have on the United States. So he didn't see the crime, the drug trafficking, the economic impact is horrendous, all right? People can come into our country folks, but they have to come in legally. They have to come in through a process. We're like an open gate. People just walk across. They walk into our country. We don't know who they are. We don't know where they've come from. And by the way, speaking of that, the migration. The people from Syria. We don't know are they ISIS? Are they not? They're not coming into this country, OK? They can't. He doesn't see how Mexican leadership and he doesn't understand it. He doesn't see how Mexican leadership is outsmarting our president, and Obama and our leadership has no clue as to the negotiation or anything else. In other words, we are being so badly out negotiated by Mexico. Mexico knows that if I win, those days are gone. We're not gonna have a $58 billion trade deficit. It's not gonna happen. We're not gonna lose Carrier air conditioner, who just moved to Mexico. You saw that. We're not gonna have Nabisco move their big plants to Mexico. Not gonna happen. Not gonna happen. We're not gonna have Ford building so big $2.5 billion plant. And now, I've been talking about that for a year and a half, now they're doubling down. I read the other day in the paper. They're doubling down. Ford is going in much bigger into Mexico. They took a plant from Tennessee that was going to go to Tennessee and they went -- the plant went to Mexico instead. When are we gonna get smart, folks? When are we gonna get smart? Got to happen. We can't let this stuff go on because we're losing our jobs. We're losing everything. The Pope isn't being told that. The Pope is being told that Donald Trump is not a nice person, OK? Donald Trump is a very nice person and I'm a very -- I am a very nice person. And I'm a very good Christian because the Pope said something to the effect that maybe Donald Trump isn't Christian, OK? And he's questioning my faith. I was very surprised to see it, but I am a Christian and I'm proud of it. OK. For a religious leader to question a person's faith is disgraceful. I'm proud to be a Christian and as president, I will not allow Christianity to be consistently attacked and weakened, unlike what is happening now with our current president. OK? Believe me. No leader -- very important. This has just been given out to the press two seconds ago. No leader especially a religious leader should have the right to question another man's religion or faith, especially when they feed all sorts of false information into them. They're using the Pope as a pawn and they should be ashamed of themselves. That's the Mexican government. They should be ashamed of themselves for doing so, especially when so many lives are involved. And when illegal immigration is so rampant and so dangerous and so bad for the United States, OK? Period. That's it. Period. So I mean, I come to this beautiful place and I'm looking. I'm looking at everything so beautiful. The people are beautiful. Everything is nice and I get hit. The Pope just made a statement. Oh good. Did he say good things? No, I don't think you're gonna like it so much. So this is the beginning as I'm walking in, OK? So you are the first to hear it, OK? This is a breaking story, right? Breaking news. So we have to do something about illegal immigration because our country is being decimated. And speaking of Mexico and again, I have nothing against Mexico. I like Mexico. I have nothing against the leaders of Mexico. I think they're very sharp, very smart, very cunning. They are far too smart for Obama. They're far too smart for our leadership. When you look at Carrie you're going there, what do we get out of it? OK, Carrier. So I saw the other, I guess somebody was using the cellphone camera. I saw the other day the whole speech made by the executive. We are moving to Mexico. Your jobs are gone. Baa baa baa, right? And it was very sad. People are very devastated. You could see they were devastated. They've been working in Carrier for many years. They do a good job. I used to buy Carrier air conditioners. I won't buy them anymore. Hopefully, I won't buy because I'll be president. I won't care about a break. But I buy a lot of air conditioners. I buy a lot of a lot of product. Unfortunately, almost everything you buy now is made -- you buy televisions, you go to South Korea. You buy -- Do we make anything anymore here? We don't make anything. Yeah, we make good golf resorts for you to live in. So what happens is Carrier is leaving. Now, what I would do is different. You know, I'm a free trader. I believe in free trade. All these, you know, conservative issues. He's not a conservative because he doesn't believe -- I believe in smart trade, folks. They've taken everything we have. China has created the greatest theft -- it's the single greatest theft in the history of the world what they've done to the United States. They've taken millions of jobs. They've taken our money. They've taken our base. They've taken our manufacturing. They've done so much. Even Boeing, remember this. And I'm saying this to South Carolina. You won't have to worry about it if I'm president. Believe me, it's not gonna happen. They're building massive plants. In order to get an airline order, they're building massive plants in China. When China devalues their currency in three years from now or four years from now and when they announce they're not gonna make planes in South Carolina anymore because it's much cheaper to make them in China. Remember what Donald Trump said. You don't have to remember if I win. You just remember if I don't win for some reason. OK? Remember, we better win. Well, we better win. I hope. I hope so. Because it's so easy. So Carrier, so Carrier moves, that's it. They're gonna move. Probably get incentives from our government. You know, there was a time when we're given incentives. You know, I mean, can you believe it? Probably got tax credits for moving out of the country because we are so far behind. So Carrier leaves and they go to Mexico. So here's what I do and I probably, you know, I want to be presidential. So I'm not supposed to make the call myself, right? But I might make it myself anyway. You know, Carl Icahn. You know Carl Icahn. Carl Icahn endorsed me and a lot of the big business people endorsed me. And you know, Carl said, look, he's the one guy that knows. I mean, I know -- I understand corporate inversions and all. And I understand what's going on. Trillions of dollars is offshore. It's all over the place, outside of the country. We can't get it back. The companies can't get it back. Some companies are leaving for taxes because we have the highest taxes in the world. But other companies are leaving to get their money. They can't get it back in. They've got money offshore. They've got money in Europe, all over the place. They can't get their money. So I have all of these endorsements. So here's what to do with Carrier, OK? Whether it's me or somebody because I will use our greatest business leaders. Some of whom may be in this room, by the way. I will use -- we have the best business people in the world, but we don't use them to negotiate our trade deals. I will be using our best, best sharpest killer business people to negotiate with the killers from these other countries. And again, I don't -- I think it's great that Mexico is doing this. If you can get away with it, you've got to get away with it. How smart are they. They see the Pope and they tell the Pope bad things about me because I'm against, you know, I'm very, very strong for illegal immigration. Very -- we got to stop it, right. So they tell the Pope, Trump is bad and the Pope says something negative about me. Now, it's probably gonna be all over the world. Who the hell cares? OK. I don't care. I don't care. I don't care because we have to stop illegal immigration. We have to stop the massive crime. By the way, we have right now 100, this was as of last week reported. 179,000 illegal immigrants in our country, who are criminals, OK? These are criminal illegal immigrants. We take care of them. We watch them. They commit crimes -- you know, the cost of this and devastation to the families? Kate in San Francisco? Jameel? I mean one of the greatest young men shot in the face. Kate shot in the back in San Francisco by somebody that should have never been here. We are, we are so incompetently run. Then you have sanctuary cities where people can be there and it doesn't matter. I mean, practically they can be whatever they want to be and they get away with it. We have sanctuary cities. Nobody even heard the term. I don't think anybody here did. Would you know about sanctuary cities? We have sanctuary cities. We had five or seven in Florida, while Bush was governor. Sanctuary cities. He never told us that. We have, we have a tremendous problem. We have to clean up. We have to be proud of our country again, folks. We have to go back to the basics. We have to be proud of our country again. So we're losing our businesses. So I would essentially whether it's me or one of my people. I have some tough people. We -- You have to use the right people. But call up Carrier. Say, folks, we don't want you to leave. Oh, but we're leaving. We're leaving. Why are you leaving? Because we're getting some good deal or they're getting good financing from somebody in the Mexican government or something. OK, smart. Mexico should try and get them. But we should try and keep them. So I say, here's the deal. And I'm a free trader, remember that. I don't want to have have lots of you know restrictions at the border in terms of trade, et cetera, et cetera. But you got to have fair trade. You have to have smart trade. So I'd say, very simply. I'll say, you know what, congratulations on leaving. Congratulations on devastating those 1,400 families that have been left behind that have done a great job, by the way. Good product, done a great job for years. Congratulations. But here's the story. You go to Mexico, every air conditioner that you sell that goes into the United says, we're gonna charge you a 35% tax, OK? Let's see if your numbers sell well. And I'd say, let's see if your numbers still work because I'll bet you they don't. And they'll call me and they'll say, oh Mr. President -- but here's the difference. I'm self-funding my own campaign. I'm not getting paid by their lobbyists, by their special interests, by their donors, by their stockholders. I'm what -- I'm doing right for the people. I mean, I speak before thousands and thousands. I'm doing what's right for the people. I don't care. I don't need the money. I don't need any money. So I'm doing what's right for this country, OK? And the politicians can't do that. They can't do that. We have people heading up campaigns that are the heads of the drug industry, as an example. Woody Johnson, Johnson and Johnson. He's heading up Bush's fund raising campaign. Did a good, raised $150 million for a guy that's going nowhere. I mean, you know, when you think of it, right? No, he raised a $150 million for a guy that you might as well take it and throw it into the ocean or let the kids collect it. It's got more value. But Woody Johnson, Johnson and Johnson. Now, here's a thing that I didn't even know. And a friend of mine found out. The Mar-a-Lago Club, you've heard of the Mar-a-Lago Club. He's a member. He comes up to me, a big doctor. He says, Donald, it's so brutal. Obamacare is such a disaster. I have now more accountants working for me than I have nurses. It's so complicated. It's dragged me. He hates, OK. But he said, do you know Donald that the -- and he's a smart cookie. He said, you know that the federal government doesn't negotiate drug purchases. I mean, drugs to make you better, drugs. They don't negotiate. They're prohibited from negotiating that the United States government pays sort of like if you walk in, if Mr. Schwarz walks into a drugstore to buy drugs to get better that we pay the same price practically as her. I said, that's not possible. Not -- he said, it is. And then immediately, you know, being the person that I am. I said, oh it is, of course, because the politicians are all taken care of by the drug companies and therefore, they don't have negotiation, right? That's what it is. There are billions, tens of billions, hundreds of billions of dollars left out there due to policies. You know, a lot of times when you see -- you think the politicians are stupid and you think the deals are bad. They're not bad. They're good for them. They're taking care of the lobbyists and the special interests, OK? Because they can't be that bad. You look at some of these deals, even the Iran deal. I'll bet you there's something involved. I mean, it's hard to believe. But look at these companies in Europe that are making a fortune. Airbus, I'll guarantee you they have probably lobbyists. They probably knew that some of this money was gonna buy 118 Airbus planes, 118 planes, not one Boeing. And Boeing is better. I like it better, too. I have one. But Boeing is better. But think of it, 118. They probably knew. They probably had lobbyists for for Airbus and they probably had lobbyists for Russia. You know, Russia is selling their missiles. They probably had -- everybody has lobbyists. So when you see some of these deals, they are so absolutely bad. They are bad. But the reason they are bad isn't stupidity. It's in a way dishonesty, OK? It sort of called legal dishonesty. But in a way, it's dishonesty. And when they go up and they say to one of the people running like, Ted Cruz. He's got people -- you are gonna see some of the people that are giving him money. Forget it, folks. Forget it. You've got problems. He's taken money from people you won't believe. Check out his list of people. But when they go up to Cruz and they go up to these different people that are running, every single one of them, on both sides. By the way, but on my side, I'm the only one. I'm -- on both sides. I'm the only one self-funding period. And I feel sort of foolish. You know, my whole life has been about money, money. I want money. I want money. I want money. It's greed. I want money. And now, these guys are coming up. They want to give me millions. I have a guy come up to me the other day. Donald, I'll give you whatever you want, millions. Where? How do I -- I said, I can't take it. You know, it's hard for me to say that because my whole life -- it's hard. I feel a little bit like, am I OK? Am I going crazy here? And I say, I don't want it. No. And every time the guy sees me -- he's a very rich guy. He's a -- he doesn't even understand. I said, no. That's OK. Don't worry about it. You know, you don't have to do anything. Don't worry. It's OK. And every time he sees me, like once a month I see him at a club at the Mar-a-Lago Club. He's a very, very rich guy. And he says, Donald, I don't understand. You never got back to me. I said, I don't really want your money. Don't worry about it. Don't worry about it. And he can't understand it. They can't understand it. But I would have the greatest fund in history if I ever said, I'm gonna do it. But I will tell you this. I will tell you this. I think it resonates with the voters. I -- for a while I was saying, I don't think I get any credit. I mean, I'm gonna spend a tremendous amount of money. I've already spent a lot. Even though I spent less than these people, I've spent a lot, you know, because I'm somebody like you. We watch it. We spend it wisely. We're careful, et cetera, et cetera. But we spent it wisely and I'd spent as much as I need. But we don't want to spend it if we don't need it. I mean, I'm looking at some of the money spent it's incredible. But when they put up their money to the head of the drug companies and to all of these different and the drug companies come in and they've got -- and I tell you something. I know these people. At the last debate, I walked into the room. I looked at said, oh man. They're all the lobbyists. All the -- I know a lot of them. Those are all the special interests. I did a really good job at that debate. Everybody -- Drudge said I was number one. Time Magazine said I was number one. Every time I said something there was like yeah. But every time I said something that was like dead silence in the room. And I had one friend, who's a friend of mine, but he's supporting another candidate because he wants to -- he knows he can get something. He can't get anything from me. He said, you're the last person I'll ever support. He actually told me that. But he's a lobbyist and he's supporting it. And he starts booing me and he's laughing and booing and waving to me. And I'm sort of like waving to him because I understand. I mean, I get it. I had another guy come in. Don, I want to give you a lot of money for your campaign. You know, it's funny I've been number one from just about the beginning from June 16th. Every -- since they really thought I was doing -- Other than the Wall Street Journal today, which we'll have to call them up and find out what was going on there, you know, that phony deal. But I'd been number one like right from the beginning. I don't like -- I don't like dishonesty, OK? I don't like dishonesty and I think it's dishonest but who knows. But I've been number one just about from the beginning. And when you're number one in this business, in this crazy business of politics, the money is just -- it's unbelievable. It just pours in. It's just like crazy. I never saw anything like it. It's better than being on The Apprentice. It's the most -- No, it's the most -- when you have -- when you are number one in the polls, people come that you never even heard of. Donald, I'd like you to speak to the head of these massive companies that you know -- they'd like to come in and that they can have lunch. OK. So I don't even have lunch because I don't want to turn them down. I don't even want to be tempted. You understand that, right? But when you have this kind of stuff come in and they -- I said this to one man. He comes into my office. I want to give you $10 million for your campaign. I said, that's a lot of money but I can't take it because I'm self-funding my campaign. He goes like, wow. He didn't even -- he thought I maybe didn't hear much. So then he goes again. And I said, no. I don't want it. He said, why? I said because I'm self-funding my campaign. It's a really big part of my campaign. I think, it means something. Although, I must tell you I'm not sure it means as much as it is actually costing. I don't know. I don't think people are going into the voters who will say I'm voting for Trump. Let's say, it's Trump and this guy, I'm gonna go with Trump because he's self-funding. I don't know that has a big of impact, but I hope it does. Because believe me, believe me, this isn't about me. This is this is an important thing. It's an important. So anyway, the guy goes and I say I don't want it. And he's sort of a friend of mine and he's leaving the office. I say, just out of curiosity, so what are you gonna do? He said, I'm gonna support somebody else. I said, why? Why? You could support me, but I just don't want your money. I can't take any money. I don't want your money. He goes, no, no. I have to support somebody else. He said, I love the game. They're gamblers. They're gamblers. They want to put up money. He'd rather give somebody $10 million or $5 million or $2 million than give somebody nothing, OK? It's crazy. They're like horse players. These are the people. I know them. I mean, I know them me. Don't forget before June 16th, I was a very big contributor. I was, I was like a member of the establishment. The day I ran, boy, did I become anti-establishment fast, OK? And the politicians are going crazy and the head of the RNC and all these people are going crazy because you know, they're not gonna have. I'm gonna do what's right for the country. I'm not gonna do what's right for the politicians. I'm not gonna do what's right for the special interests. And honestly, I've never talked about this subject so long. But I mean this is a group that really gets it. I mean, you understand it. And probably, some of the people in this room won't be very happy with what I'm saying because they want to have they're -- certainly, you probably have a couple of lobbyists in this room. I know most of them. Let me see. But one of the things -- one of the things and I started by telling you about pharmaceuticals and the drug companies. Now, when you think about it, OK? When you think about it, you can take that one group and bid it out. And even if you don't per se bid it, if you went with a favorite nations clause because in a way bidding is a little bit, you know, I almost don't trust anybody to bid. You know, all of a sudden, they move into a beautiful house in the Hamptons or in Palm Beach and you say, gee, I thought they were civil servants and now they're moving to Palm Beach. What happened? But you do a favorite nation's clause. Say with the drug companies, we get the lowest price that you've negotiated over the last 12-month period immediately to the United States of America less 10% because we're a big, big, big buyer. So we would get the lowest price. I like that better than having a negotiation. In other words, now everybody else negotiates. Whatever the lowest price that they've made for a certain product, we get the lowest price. And then I'd take a discount beyond that. And you know what, we'd save hundreds of billions of dollars. Defense industry, same thing. Much more so though, I would say. For 25 years, ever since I'm sort of like where I'm really interested in this stuff, I've been watching as they're ordering equipment and they're ordering things that they don't want. You know, you've been seeing the story the airplane that they didn't like as much as the other one that they're getting equipment that they don't need that they don't want. Well, the reason is because those companies that make the equipment are politically astute. They have taken care of these people that I'm with. They have taken care of lots of other people that I'm not with. And they order equipment that they don't want. I'm gonna make our military so strong, so powerful. You have no idea what we're gonna do because we have the technology but -- But we're gonna do it for a lot less than anybody thought possible. And we're gonna get the equipment that the generals want and the soldiers want and all of the people want that are running the equipment. We're not gonna get equipment that you know -- and I've seen in it. The airplane, oh well, we didn't really want this airplane. We wanted the other one but we are -- you know, the politicians are making the decisions. OK? We're gonna get the best stuff. We're gonna be so strong. Nobody is gonna play games with us, folks. Nobody. We're gonna get the best stuff. There'll be nothing like it what we can do, and we're gonna save a fortune. We're gonna save a fortune. So with the military that happens I tell you about the pharmaceutical stuff. We're going out to bid, OK? Save hundreds of billions of dollars. With the military, you're talking about much bigger numbers than that but we'll have a much better. Somebody would say, will it be better or not? I remember the United Nations, right? So I testified in front of a great group of senators actually, who were terrific. In fact, your senator from Oklahoma who just said horrible things. He said Ted Cruz is the most dishonorable, dishonest person I've ever met. What he said is -- he cannot stand them. But they asked me to testify in Congress about the World Trade Center, about the World Trade Center but also mostly about the United Nations. Because they were doing a renovation of the United Nations and they said, we would like to understand this. You built a building across the street that's 92 stories tall. We are renovating the United Nations and we're gonna spend $1 billion. I said, no, you're not. You're gonna spend $4 billion because by the time they kill you with the overruns, you will spend $4 billion. No, no, no, it's $1 billion. OK. How much did you spend? So there was a story in The New York Times that said I built the building for $322 million, 92 stories condo. Trump World Tower, a beautiful building right opposite the United Nations. That was 322 -- about $320 million, right? Now, they're gonna renovate the United Nations, which is a much -- you know, which is not a big deal. And they gonna to spend $1 billion. So an ambassador from, I think, it was Sweden called up. Mr. Trump, can I meet you? Why? I'm on a committee. We don't understand how can you spend $322 million to build this incredible building, brand new, beautiful. And yet, we're spending $1 billion to just fix up the United Nations. I said because of two reasons: Corruption and incompetence. It's very simple. No, it's true. So this man, I think, it was the ambassador to Sweden. It was a while ago, five years six years. This man is a terrific guy. He said, I'd like to go public and I'd like to -- could you meet the head of the United Nations? I met the head of the United, Kofi Annan at that time. I met him and he had no interest in my -- All he wanted was a press. In fact, I'm sitting there in a chair and there's a big curtain sort of like this. And I didn't know what was going on. And all of a sudden, the curtain opens and there was so much press. Then they're taking pictures. That's all he wanted. He didn't care about the cost of this thing. So what happened is they brought in the man that's in charge of it. So I said, are you using a boiler system? Are you using New York steam? What are you using for heat? He said, I have no idea. He had no idea. He didn't know boilers. He didn't know anything. This guy knew nothing. He was in charge of construction. So they're worth $1 billion. I said, this is not gonna cost a billion. This is gonna cost $4 billion or $5 billion, which turned out to be exactly true. It costs a fortune, OK? So I offered to do the job for $500 million. I said, I will do the job. Site unseen. They say, well, what's the difference? I said, here's the difference. The difference is you'll have a much better job for 500 million. Then you'll have for in my -- I actually predicted it will cost $4 billion if they do it themselves because when you have people out there that you don't even know about, you won't ever read about. They're really, really rich. Just so you understand real. They could move to very easily. Believe me. You got some rich people out there. But I said here's what's going to happen. You're going to have a tremendous cost overrun, that happened. You have people that don't know what they're doing, but they probably do know what they're doing very well. And -- but they said to me, what's the difference? The difference is I'll have marble floor. They'll have . I'll have better elevators. They won't. With me, you don't have to move out. They're gonna have to move out. Under their scenario, everybody had to leave the United Nations. Rent office space. Big trouble. Hard to get in Manhattan and then come back. I was gonna do it everybody in place, right? Everything was better. And I never heard from them. I never heard from them. And then the next time I heard was a few years later when the thing was totally out of control and it's cost a fortune and all that. Well, the same thing is true with our country. Our country we will spend less money, but we'll have better roads, better airports. You know, our infrastructure is a disaster. We spent in Iraq, which was a horrible decision to go into Iraq, OK? You know that. I mean, I hope you know that. And I should get points for vision because I said right at the beginning. Don't go into Iraq. You're gonna destabilize the Middle East. We spent $2 trillion in Iraq and now, it's much more than that. But $2 trillion that was it as of two years ago. Thousands of lives, wounded warriors, who I love, love all over the place, OK? We have nothing. We have nothing. We have to start rebuilding our country. We've got to knock the hell out of ISIS and knock them out and knock them out like you've never seen anybody get knocked out. But we have to get back to rebuilding our country. Our country is a mess. Our roads, our bridges. You know, 40% of our bridges are in danger. I mean, you know what danger means? Danger means like you go over and you've seen collapses of bridges. We have tremendous infrastructure problems. And by the way, wouldn't it be great to have a great builder in charge of like a country that has to spend billions and billions and trillions on infrastructure? Because I am. I mean, I'm I building the old post office on Pennsylvania Avenue and we're way ahead of schedule and under budget. We're two years ahead of schedule. I actually said to my daughter, let's not say two years because it doesn't even sound believable. But we're actually two years under schedule, ahead of schedule and under budget and it's right on Pennsylvania Avenue. I like it because this way, if I don't make the White House, I'll still be living on Pennsylvania Avenue 100%. But we're under budget, ahead of schedule, it's gonna open up to September of this year. It was supposed to open September in two years from now and it's gonna be one of the great hotels of the world. Maximum job. Unbelievable. It's gonna be one of the great hotels of the world. That's what we need. That's the thinking we need in this country. That's the thinking we need in this country. So I tell the people and they say, well, what would be the difference like with the military? I say here's the story. We'll spend less money. We have much better equipment. We'll have much happier people. Everybody's gonna love it. We're gonna be stronger, better just like the story with the United Nations. What's the difference? $4 billion versus $500 million. Well, the 500 billion the United Nations will have marble floors, instead of frankly party, but they'll have marble floors. They'll have -- everything will be the best. Same thing with us. We can do that. I mean, we can do that. We have the wrong systems in place. We have tremendous corruption. We have tremendous, tremendous corruption. You look at what's going on the Veterans Administration. It's one of the most corrupt enterprises that I've ever seen, OK? We can straighten it out. We're gonna make -- That's why Al is one of the most respected vets in the country. And he was up in New Hampshire and we got tremendous support up in New Hampshire for the vets. I mean, beyond -- anybody even came close but they have confidence in me. We've got to take care of the vets. Our vets are being decimated. Our vets are being treated worse than illegal immigrants, in many cases. It's true. It's true. They get things, they get things that our vets, that vets can't even think about getting. I mean, the whole thing is crazy. I mean, think of yourselves. They go to doctors offices. They have four day and five day waits before they can even see a doctor, in some cases, four. Can you imagine you, you go into a doctor's office or they'll say you have a five-day wait. That doctor is in trouble. Is that a correct statement? I mean, you know, as an example, so we've got to take care of our vets. We've got to take care of our military. We're gonna make trade. We're gonna bring back our jobs. We're bringing them back and we're gonna have our greatest people, but we're bringing them back. We have the greatest negotiators. We're bringing our jobs back from China, many of them. I want to see Apple computers made in the United States. What good does it do when they're made in China? What good does it do? And we have to get them to stop devaluing their currency. And remember this, we have the cards because we have this pot of gold. There's not such gold anymore. By the way, you know, we owe China $1.7 trillion. We owe Japan $1.5 trillion. How about Japan? They make cars. Biggest boats I've ever seen. They come pouring off these massive boats from Japan. Just pouring. We give them practically nothing. You talk about trade? They do these cars. You've never seen ships like this. So big. I was in Los Angeles recently, and the cars are pouring off the ships from Japan. So they sell us millions of cars. We sell them like nothing. We give them nothing by comparison. Where's the fairness there, folks? We need to bring smartness back to our country. We need to bring negotiation back to our country. We need to bring honesty back to our country. We need to get deals that are great. We have to bring our manufacturing back. Recently, a friend of mine ordered Komatsu tractors from Japan. He's always order a big excavator, big company. He always orders Caterpillar. But he said, I couldn't do it. He felt badly. I could see. I said, what's your problem? He said, I feel guilty because I ordered Komatsu tractors. They're from Japan. He said, Donald, they've so devalued the yen that I owed it to myself and my family, my wife. I owed it to my employees to buy. I bought it for much cheaper. What's the difference in the equipment? He said Caterpillar is better, but not that much. I mean, I can't -- I had no choice, he said. So he bought Komatsu equipment. Well, that's what's happening to us. We're being outsmarted by very smart people and we don't have the people -- it's like the New England Patriots playing some high school football team. We don't have -- we don't have the people in place. We don't have the right people that are doing -- this this is like a great surgeon. This is like you need somebody that's incredible. This is not easy stuff. These people have it naturally. When I take Carl Icahn. I said, Carl take a look at the Chinese trade deal. I got the greatest guy. You understand that. I mean -- and he doesn't want money. He didn't want it. He loved to do it. I mean, he'd love to do it. So we're going to make a lot of changes if we get in. We're gonna make our country rich again. A woman came up to me. She said, Mr. Trump, that doesn't really sound nice. I said, look, $19 trillion, we just made that horrible omnibus budget. You saw that deal. It took like two hours. I never saw a deal go so fast. Obama got everything he wanted. You know, Obama's a lousy negotiator except when it comes to negotiating with the Republicans. Is that right? He's a terrible negotiator. But with the Republicans, he gets whatever he wants. You look at it. He got -- in that deal, he got so much. He got money to bring in the migrants from Syria, who can't take because we don't know who they are, where they are, where they come from. We'll do a safe zone and we'll have the Gulf States pay for it. Not us. We don't want to pay. But we'll have the Gulf states -- they're not putting up any money. They have so much money. Saudi Arabia makes a billion dollars a day when the oil price was high. Now, they make half, OK? Not so bad. But -- and I think of Saudi Arabia. We protect Saudi Arabia. They were making a billion dollars a day. They have more money than anybody and we lose money. I mean, we rent military areas. We pay them rent. And without us, they would have been gone years ago. I mean, who's thinking about this? Japan. We protect Japan. OK. But here's the problem. So we protect Japan, who owes a fortune, by the way, we protect Japan. If we're attacked, Japan doesn't have to do anything. If Japan is attacked, we have to be in World War 3., OK? I mean, who's doing this stuff? So we protect Germany. Germany is a behemoth, an economic behemoth. It's being destroyed by what Merkel has done there. What she has done to Germany -- I have friends from Germany. They're leaving Germany. They are leaving Germany. These are people who were so proud a year ago being in -- being German people. They were so proud they used to brag. I said, are you still proud? Not so proud. They're leaving Germany. They're moving to other countries. What she's done. I don't know what happened to her. I thought she was a terrific leader, and I don't know maybe she got carried away with herself. I don't know. Like, tremendous crime. You look at Sweden the other night. Did you see what happened in Sweden the other night? Sweden. Sweden doesn't have crime. They are going around -- it's a disaster. You look at Brussels. I was in Brussels 20 years ago. Brussels, beautiful Brussels. It's like an armed camp. They had to cancel New Year's Eve because of the horrible, horrible threats of massive crime. We have to get smart, folks and we can't be so politically correct. Oh, that's not a nice thing to say. That's not nice. And actually a lot of people and maybe it happened to a certain extent in New Hampshire. They thought I'd get 27%, 28%. I ended up getting 36%, 37%. And I think what happened and a lot of people said, you know, the poller goes up to Trump. Well, would you vote for Trump? No. No. No. But then they get to the booth, I want Trump. I want Trump. It's true. We might poll higher. So I love this place. I have so many friends that live here and I have such great relationships here. And I've been here a couple of times, where I was you know at the place I actually played and it's fantastic. But we have a country that has such potential. We have a country that is so great. We can make it truly. And right now, it's got a tremendous headache. And I'll tell you if Hillary Clinton gets in or this guy, Bernie, wants to tax you 95%, if he gets in. Everything is for free except for the people that have to pay tax. And you know what happens to those people? They leave. It's like the companies. The companies are leaving now because the taxes are too high. My tax plan brings the corporate taxes way down. It has to because the companies are leaving. When you lose Pfizer -- how good a company is Pfizer? They're moving. It's gone. They're in Ireland. They're moving to Ireland. They're moving because the taxes are too high and they couldn't get their money back in. They moved to get their money. But I'm just saying this. We have tremendous potential as a country. Tremendous. I love this country. I love South Carolina. I love it. I love the people. The people are incredible people. Saturday is so important to get out and vote. We're gonna turn it around. And believe me it's we. It's not me. I'm like a messenger. This is why. They wrote -- last week, the cover of Time Magazine wrote the most incredible story. I don't normally say incredible story. There's one word I hate it, right? But but this is the most incredible -- they talk about this is a movement that's going on with all of us, with us. Not the Bernie thing. We get far bigger crowds than Bernie. We get everything bigger than Bernie. And Bernie, I think is gonna fizzle because eventually although it's gonna be interesting what happens to Hillary with the emails because she should be. What she did is a disgrace, OK? What she did is a disgrace. One thing I liked in the poll that came out in USA Today today said I'm leading by a lot. It was a great poll, a national poll and it said I beat Hillary and I beat Bernie very easily and head to head. So that's always a nice thing. But I do in a lot of polls. But the theme is: Make America Great Again. And I tell you, we can make it greater than ever before. Let me just tell you. If I get elected, we're gonna start winning again. We're gonna win on trade. We're gonna win at the border. We're not gonna have the Mexican officials going over and seeing the Pope and saying, you know, Donald Trump is a bad person. He's a bad person. He wants to stop people from walking freely across the border. And the Pope doesn't know this. I mean, the Pope is told this. I mean, I don't even blame the Mexican officials for trying to get away with it. But I don't think they're gonna get away with it, OK? Because we're wise to him. We can't lose $58 billion a year in deficits. So I just say this. We're gonna start winning again and we're gonna make America great again. And I appreciate it very much that you're here. I love you, people, special people. Thank you very much. Thank you. Thank you. Thank you very much."}