{"id":450,"author":"Donald Trump","title":"Speech: Donald Trump in Bluffton, SC","date":"2016-02-17","link":"https://factba.se/transcript/donald-trump-speech-bluffton-sc-february-17-2016","paragraphs":["Hi, Bill. You know, I said I was going to come back. Remember last time we had thousands of people, so we had people outside. So we said, we'll come back, but we can only invite 500 people. So that's what we did. We invited 500 people. Now people are going crazy, why weren't they invited? But we invited the 500 people that we didn't get to last time. So I hope you enjoy it. OK?","Well, it's been an amazing experience. I've had a lot of fun. You probably saw the new polls that came out today. They've been fantastic. And one just came out in Nevada where I'm at a number that's beyond belief actually. Maybe I don't even have to go there and campaign. I don't know. But it's been an amazing experience.","Winning New Hampshire was great. We did really well in Iowa. Should have won, but frankly, to be honest with you, somebody stole a lot of Ben Carson's votes and got himself a little extra cushion. We should have won that. But there's a lot of dishonesty in politics, I will tell you. Tremendous dishonesty.","These people are, some of them that we're running against, in particular, Senator Cruz. He'll say anything. He'll say, for instance, I'm very strong on the Second Amendment. He'll say, Donald Trump doesn't like the Second Amendment, wants to get away with that, do away with that. I say, where does he come up with this stuff?","In every speech I make, I talk about Second Amendment, I talk about different things. Obamacare, you know, I'm going to get rid of Obamacare. We're going to come up with a great, great plan. But Cruz will say, it's the most incredible thing, but Cruz will say Donald Trump loves Obamacare. I love Obamacare.","Every single speech since it came out, I said we're going to get rid of it. So they really, I mean, they lie. And the reason I can say that nicely is that Rubio called him a liar also. So once another guy called him a liar, it's easier for me to call him a liar. But really, Cruz does lie. I've never seen anything quite like it.","Well, number one, we're going to knock the hell out of ISIS. We're going to get rid of ISIS. We have to. And just so you understand, I didn't want, and it was very important to me, I didn't want to go into Iraq. And a long time ago, 2003, 2004, but even before that, I was totally against war because you're going to destabilize the Middle East.","And I went into it very big league, you're going to destabilize the Middle East. But they went in. Then Obama got us out the wrong way. But we have to get rid of ISIS. I mean, you know, maybe don't go into Iraq originally. We should have never ever gone in. But we did. So we made a mistake, the country made a big mistake and started all of this horrible thing that you see taking place, including ISIS.","But now you have ISIS and they're chopping off people's heads, they're chopping off Christians' heads, they're chopping off anybody's head and we got to knock them out. We're going to knock them out so strong. We're not going to play games. We're going to make our military strong and powerful again. And believe me, it's the cheapest thing we can do, because nobody is going to mess around with us. We have no choice.","It's the cheapest thing we can do. Our military has been decimated. It's been absolutely decimated. And it's, you know, it's not in good shape, believe me. And in fact, General Odierno, when he left, he said, in terms of preparedness, it's the least prepared it's been in a long time. We are going to make our military absolutely strong and powerful again.","We don't want to use it, but we have to have it. It's actually like a preventative. It's the cheapest thing we can do. So that's totally important. And we've got to take care of our vets. We're going to take care of our vets. Our vets are being treated terribly. We're going to take care of our vets.","We're going to build a wall, folks, and none of these politicians are going to build a wall because they don't know where to begin. They come to me, they say, you're not really going to build a wall, are you? I say, of course I'm gonna build a wall. The reason is, and it's simple, first of all, I know how to build.","What I know how to do best is to build. Wouldn't it be nice to have a president that knew how to build, because we have to rebuild our country? And knew how to negotiate. You know, I'm building a hotel that actually I got from the government. Can you imagine? The Obama administration. I got it from the old post office on Pennsylvania Avenue, between the White House and the Capitol building and right smack into my best location, right on Pennsylvania Avenue.","And it's under budget by a lot, and it's two years ahead of schedule. And somebody in government said, we've never heard of that before. It's under budget, ahead of schedule. It's two years ahead of schedule. So we're going to open it in September, and it was supposed to open in a couple of years in September.","But that's nice because we know how to do that. Having somebody that has that ability, I've always had the ability, under budget, ahead of schedule; having that ability when we have to rebuild our infrastructure because our country is crumbling, our airports, our roadways, our highways, our bridges, our tunnels, hospitals.","I mean, everything we have it comes in, when you look at the way they build, it comes in double, triple, quadruple. Let me tell you, people are making a lot of money off our country. They're not going to make so much money anymore. And here's the other thing. I'm self-funding my campaign. So I'm not controlled by the special interest, the pharmaceutical companies and all of the different interests, whether it's to the electrical companies, the utilities.","They have hundreds of them. They control the politicians because they contribute. I don't take the money, so I'm self-funding. I don't know if I get any credit for that to be honest with you, I'm not sure. But I'm self-funding, costing a lot of money. Costs a lot of money. But you know, the nice thing is they can't come to me and say, well, we gave you money, you know, Ford or General Motors or somebody.","We gave you a lot of money, we need this, we need that. I'm going to do what's right for you folks, OK?","OK.","Oh, I get treated so badly. I mean, I was watching Fox this morning. They treat me so badly. Fox treats me like worse than anybody. But I get treated very badly by the media. I don't even know, I don't really understand why. They have pundits on that or just one after another, negative, negative, negative.","It started where actually nobody, you know, they all thought I wasn't going to run and they said, nah, he'll never run, he'll never run. You run, and then they look bad. And then they don't stop. And some have become much better, but I think Fox in particular treats me so badly, it's incredible. But it doesn't matter, I guess.","Look, we're leading in the polls by a lot. We won New Hampshire in a landslide. It was a landslide victory. We won every single group. We won highly educated, not educated. We won women, we won men, we won young, we won old, we won virtually every group, I think. Every group. And it was an amazing victory and something really special.","But I'm finding out all I could do is tell the truth. You know, I tell the truth about Iraq. I say, the war was a disaster. We spent $2 trillion, lost thousands of lives, thousands of lives. We have wounded warriors all over the place. I love the wounded. I mean, these guys have more courage than all of us put together.","I have to tell you, all of us. And you know, I say we should have never been there. And you know, if Bush is insulted, I don't care if he's insulted. What difference? It was a horrible mistake. We should have never been there. Somebody says, oh, that's not good to criticize. I said, criticize? It's one of the worst decisions in the history of our country to go in. We've totally destabilized the Middle East, which I predicted.","I should get credit for vision because I predicted that was going to happen. Because when you knocked out the one power, the other power just took it over. Now Iran has taken over Iraq, just as sure as you're sitting there. We don't even have anything to do with Iraq anymore, we're gone. But think of it, we spent $2 trillion.","Could have rebuilt our country. We could have done so much with that money. And instead, we're worse in the Middle East than we were 15 years ago. I mean, right now, it's a disaster. Saddam Hussein was a bad guy, right? Bad guy. But you know what he was good at? Killing terrorists. We didn't have, he was killing terrorists.","Now, Iraq is Harvard for terrorists. If you want to be a terrorist, you go to Iraq. It's Harvard. And what did we do? You know, we spent all this money, lost all these lives, have all these wounded warriors. What do we get? And Iran is taking over. Not only do they get the $150 billion in this stupid deal that we made, one of the dumbest deals I've ever seen, ever, but now they're taking over Iraq that we handed them.","They've been fighting for years to try and take each other over. Well, we decapitate the one country. They're now taking over, and people don't realize Iraq has the second largest oil reserves in the world. So we took it, and we just hand it to them on a silver platter. How could we have been so stupid?","Very sad. I mean, honestly, to me it's a sad subject to talk about.","Who is the Bernie guy? Who is he?","Oh I guess he got thrown out, I guess. I don't know. I don't see him. No, look. You know, this is something. And the main thing is you have to go and vote and all that. But if you don't vote for me, don't go and vote. I'd like to, it's a nice thing to say. You have to go vote. You have these politicians.","Doesn't matter who you're voting for, but you must go out and vote. I don't feel that way. But just go and vote if you're going to vote for me. But it is so important. On Saturday, you have to. And it is true. We had such an unbelievable turnout. This was so, so great. And did I promise you I'd come back and take care of the people?","People forget that. And we have so many people that wanted to come. We said, you can't come. This was for the group of people where they got stuck outside and there were a lot more than this. But they invited 500, exactly 500 people. And I just felt I had an obligation to do it. I was thinking about canceling this morning because I had something else, and I said, there's no way I have the courage to do that, right?","Would I have been in trouble? Would I have been in trouble? And I know the tremendous support I have here, and I really appreciate it. And you know Del Webb. I knew Del Webb many years ago, and he was an amazing guy. He did a great job, I think. Are you all happy with Del Webb? I think so, right? Del Webb was a great developer actually.","A great developer. And one of the few really great developers. So congratulations.","Well look, we have to have strong borders. We have to strengthen our economy. We have to get rid of our debt. We have to balance our budget. All of the things that I talk about all the time. We have to have that strong military because we can't have any chances. We're being looked at by so many different people.","And weaponry today is unbelievably powerful. So we have to be extremely careful. We have to be really, really diligent. I've called for bans on people coming into the country because we don't know what the hell's going on. I mean, there's bad stuff happening. There is bad, bad, bad stuff happening up here.","When you have people flying planes into the World Trade Center, when you have people shooting people that gave them parties for their wedding, these two radicalized horrible people that, I mean, they were given parties by the people they killed for their children or their child and a wedding party. And they walk in and they shoot 14 people and kill them.","You look at what happened in Paris where you have the strongest gun laws in the world practically. I mean, you can't have a gun unless you're a bad guy. You can't have a gun. They walk in, they kill everybody. By the way, Second Amendment. If some of the people on the other side that were being shot at had guns, it would have been a whole different story in Paris.","Would have been a much different story. So you know, it's very simple. It's called Make America Great Again. We want to make America great again. That's my whole thing, make America great again. We're run by people that don't know what they're doing. We're run by incompetent people and/or something. I mean, there's something wrong with them because some of the deals, how did they make the Iran deal?","Who would make a deal so stupid as that? Who would make a deal like that? Well, we're giving them $150 billion, we get nothing, and we get our hostages back as part of the deal. We paid $150 billion for some hostages that frankly should have come out years ago? And if you had the right negotiators, they would have?","You would have gone in there and you would have said, we want our hostage back. They would have said no. And you'd triple up the sanctions and you leave the room. And 24 hours later, you got your hostages back. It's that simple. And you don't give them the $150 billion, you tell them we don't have it. We owe $19 trillion, we don't have it. Sorry, folks.","Seriously! I mean, we have people, they didn't read the art of the deal, I can tell you that. We have people that are just, they don't have a clue. We take Bergdahl, Sergeant Bergdahl. You know, he's a traitor. So we get Bergdahl, six people died looking for Sergeant Bergdahl. Right? We get Bergdahl, they get five of the greatest killers that they wanted and coveted for nine years.","We get one, they get five. He's a traitor, they're the best they have and they're now out on the fields or will soon be killing people again. I don't get it. I don't get it. I say, where do these people come from? Where do they come from? And we knew that he was a traitor when we made the deal, because they had a general and a colonel go and interview Bill, all the people that knew him, you know, from his platoon.","And we knew he was a traitor. So why would we make a deal? Let them keep him. I would have said keep him. You can have him. I'd give him back. I'd actually give him back. I'd fly over, drop him right on top. You know, just being... That's the way I feel.","No, but you know? Think of it. Why would we do that? Now who would make a deal like that? Where is the thinking? Who would make a deal? And that relates even to business, because it's the same mindset like the Iran deal. The trade deals that we have with China, we lose $500 billion a year. We lose $500 billion a year.","Now this is a rich community so that doesn't mean anything, that kind of money. But you know, I mean, think of it. Think of how the country would be if we didn't. And I have the best business people in the world. I know them. We have political hacks negotiating our deals, right? Political hacks. I have the best business people in the world.","They're going to negotiate our deals from now on. We're going to make a fortune. We're going to do great. We're not going to lose like that. We lose with Japan, we lose with Mexico. You saw Carrier now is moving to Mexico. Nabisco is moving to Mexico, one of its big plants. Ford is doubling up, going to move more to Mexico.","They're going to spend billions and billions of dollars in Mexico? Why aren't they spending it here? I know how to get it so they're not moving to Mexico anymore. Believe me. It's going to end. Mexico is the new China. Be careful.","All right, I love the question because every single other candidate is gonna cut the hell out of your Social Security. Remember the wheelchair being pushed over the cliff when you had Ryan chosen as your vice president? That was the end of that campaign by the way when they chose Ryan. And I like him, he's a nice person, but that was the end of the campaign.","I said, you got to be kidding. Because he represented cutting entitlements, etc., etc. The only one that's not going to cut is me. We're going to make our country rich. We're going to bring our jobs back. We're going to cut a lot of costs out of our budgets, stuff that's waste and disgusting waste. We're going to take care of our veterans and all of that, but there's tremendous fat.","You know, we can take care of people. We can run a better country with less money. And actually, it would be better. It's like when I build a building, I build a better building for less money than the guy across the street. He spends more money, and my building is better and it looks better. And it's got a better architect and it's got better design.","You know, we can do it better. There's so much fat. So we're going to take the, you know, fraud, the waste and the abuse out of Social Security. For instance, they have, as I read, thousands of people that are over 106 years old. Now, you know, hopefully we can all make it up to that age, but we know there's not going to be thousands of them, OK? That means there's fraud.","Somebody is collecting thousands. That's just one little example of what's going on. We're going to save Social Security. We're not going to cut the age. We're going to give you the full benefits. You've been paying into it all your life, and every other candidate that's up here wants to cut your Social Security.","They're going to cut it. They're going to cut it. And I'm not going to cut it. I'm going to bring money in, and we're going to save it, OK? Believe me. That's a big thing. Nobody else is going to be able to do it.","Uh-oh.","I'm pro-life, yeah. I'm pro-life. Who in here is pro-life? Who in here is pro-life? Yeah. OK. Good. No, I'm pro-life.","It's simple. I mean, Cruz said, he's not pro-life. I said, I'm not? I'm pro-life. You can't lie about people like that. It's just incredible. And again, I've been in business and I've dealt with some pretty rough much tougher than Cruz. But I've never dealt with anybody that lied so much. And then he says he's religious.","No wonder I'm winning the evangelicals by like two to one. I'm winning the evangelicals. I won them in New Hampshire as you saw, and I'm winning them here by a tremendous amount. But you look at, you just can't do it. In the end, it catches you. What he did to Carson was disgraceful, with, you know, he's out of the race, he's out of the race.","He quit, he's out of the race. Then after the race was over, he called, he apologized. He got thousands of votes. But he called up, he apologized. Like two minutes after the polls closed, you know, oh, let me call him. Oh, Ben, we're sorry we did that. We made a mistake. OK. I don't think Ben accepted the apology.","I wouldn't have accepted the apology. But he lies. He just really lies, and we can't let that happen. The one advantage I have is when he says something about me, like for instance I'm pro-life and he'll say I'm pro-choice. And I got a call from whoever, I hear you're pro-choice. I said, who told you that?","Cruz. Cruz? It's unbelievable. No, I'm pro-life. And I said to myself, how can a guy be so dishonest? How can he do it? And just this morning I heard a couple of other candidates saying the same thing, and yet he'll talk about religion and he'll talk about all of the things that he talks about, but you know, the advantage I have is that I have a big mic.","I can speak. But we have to speak before Saturday. Because after Saturday, in this community, it doesn't matter. But at least I'm able to get my word out, Bill, pretty quickly. Other people can't get the word out. And again, what happened? I'm telling you, what happened to Ben Carson was a disgrace.","Well, I have no relationship with him other than he called me a genius. He said, Donald Trump is a genius and he's going to be the leader of the party, and he's going to be the leader of the world or something. He said some good stuff about me and these characters that I'm running against. We want you to disavow that statement.","I said, what, he called me a genius? I'm going to disavow it? Are you crazy? Can you believe it? How stupid are they? We want you to disavow the statement. I'm not going to disavow. And besides that, wouldn't it be good if we actually got along with countries? Wouldn't it be actually a positive thing, right?","Do we have to always fight? I think I'd have a good relationship with Putin. Who knows? I mean, who knows? But I think we'd have a good relationship. But I can tell you, it's a horrible relationship with Obama. It's ridiculous. And he takes advantage of Obama. Nobody's going to take advantage of me, folks.","They're not going to take advantage of me. Believe me. But you know, I mean, if we get along with Russia, that would be, it's sort of nice, wouldn't it? Let Russia drop. For instance, this guy Lindsey Graham. You have a guy, he's one of the dumbest human beings I've ever seen. He may be. He runs against me, OK? He runs against me for president.","He starts off at six percent, and he hits me. And I start, although I did give out his phone number, I mean, that's but anyway, he starts hitting me, saying vicious things, and now he starts going down. He goes to five percent, four percent. He ends up at zero, zero. Here's a guy running for the presidency.","He's at zero. He leaves in disgrace, in my opinion. I think he's disgraced. He comes here, he thinks this is gonna be good. He had like two points here, and I had 42, right? I was at 42. He's a sitting United States senator from South Carolina. He's at two percent. I saw him on television this morning, and I think he lost it. He's saying, Donald Trump, he couldn't even talk.","He was shaking. The hatred. They say, what do you think of Donald Trump? Oh, oh. He went crazy! The guy is a nut job. I mean, what? And honestly, honestly, honestly, I don't want his endorsement. I don't want anything to do with him. And he's thinking, he says, I know so much. He does about the military?","I could push him over with a little thimble. Boom! This guy knows, let me tell you, this guy knows nothing. He's the kind of thinking that we've had. That's why we're in there for 15 years. Remember what I said. We're in there for 15 years, right? Middle East. We're spending trillions and trillions, probably 4 trillion or 5 trillion, 2 trillion in Iraq, but that was as of two years ago, right?","You and I talked about it last time. We're in there for probably 4 trillion or 5 trillion, maybe more than that. We could have rebuilt our country, we could have. Because of guys like Lindsey Graham. So I listen to his military, he wants to fight Assad and he wants to fight ISIS at the same time. But they're fighting each other.","So they're fighting each other, we're fighting them. Think of it, think of it. I got to take out ISIS. I don't care. We're backing people, rebels. You know they call them the rebels, the freedom rebels. They have all these glamorous names, right? Look at what happened to Libya. Look at what happened to Iraq with, you know, look at what's going on. We've got the . We give them billions of dollars of equipment.","Billions. If they win, they're worse than the guy that they took over from, right? That's what happens. Look at Libya. What a disaster with Gadhafi. We got rid of Gadhafi. What do we have in Libya? It's a total, it is such a disaster. Look at Saddam Hussein. We just talked about it. What a disaster. But we have a guy who doesn't have a clue about the military, but he thinks that he does.","With his thinking, remember this. We have been in there for 15 years, and we are far worse off now than we were 15 years ago. Fifteen years ago, we didn't have people coming around, I mean, the whole thing. And in all fairness, we went after Iraq, they did not knock down the World Trade Center, OK? It wasn't the Iraqis that knocked down the World Trade Center.","We went after Iraq. We decimated the country. Iran is taking over. OK. But it wasn't the Iraqis. You will find out who really knocked down the World Trade Center because they have papers in there that are very secret. You may find it's the Saudis, OK? But you will find out. But it wasn't Iraq. So you say, but when I look at a guy like Lindsey Graham, then I hear his theory on the war, you'll be in there forever.","You'll be in there, and you'll end up starting World War III with a guy like that too. We don't want World War III over Syria. OK? We don't want world, do we agree with that? We don't want a world war. But I watched him on Fox today. I have never seen a guy that, I don't think I've ever seen a guy so totally out of control.","They mentioned my name. He went literally crazy this morning. So he got out of the race, Bill. He was at, is this correct? He was at zero. Zero. And he still didn't want to get out of the race. You know, I often say, these guys that are zero, why do they say, wouldn't you sort of, I think I'd crawl in a corner and I'd hide.","I would just sort of put out a release. I've left the race. I wouldn't even give a news conference, I'd be too embarrassed. But anyway, I think he's a disgrace. I think Lindsey Graham is a disgrace. And I think you have one of the worst representatives of any representative in the United States, and I don't think he should run.","I don't think this state, remember, I was at 42 and he was at two when he was running in this state, I'm talking about. He was at zero nation. I mean, the guy was at zero nationwide. I don't think he could run for dogcatcher in this state and win again. I really don't. Other than that, I think he's won.","Terrible. He's a terrible. I got to tell you, he's a terrible representative for the state.","How do you like him, Bill? I think Bill feels the same way, but he's not going to say.","Well, they'd be professional people. I mean, they'd be good people. We have a lot of people in different positions that have no right to be there. I mean, they know nothing. I put people in that have great ability. We're going to put, in terms of our trading areas as an example, we're going to put, you know, great business people there.","Great people. They don't want to get paid. Then put wealthy people there. They became wealthy for a reason, right? You know, we're going to put the best negotiators there. But the cabinet, we're going to have all the best people. We're going to find out who they are, and it's not going to be a politically correct choice either.","We're going to have people that are going to be proper. And if somebody's politically correct and somebody else is gonna be outstanding, we're picking the outstanding one every single time. We have politically correct people all over the place. Our country is so politically correct that we're going to hell.","And we're not going to do that.","Absolutely. You know, this question was in the previous debate, OK? And they asked it of Ted Cruz. What do you think of waterboarding and what would you do and how bad? And he was like really weak on it. He was, well, he didn't want to get involved because he thought waterboarding was bad. So of course it's bad, but it's not like, it's not chopping off heads, folks, OK? That I could tell you.","So they asked him, and he really gave a very incomplete answer. It was a terrible answer. He was stumbling and mumbling, and he's going like, well, I don't know about . OK. Then they asked the question to me. Well, what would you do? I said, approve it immediately. But I'd make it also much worse.","They said, what do you mean? I said, I'd do it much worse. I said, they're chopping off our heads in the Middle East. They want to kill us. They want to kill us. They want to kill our country. They want to knock out our cities. And don't tell me it doesn't work. Torture works, OK, folks? Torture, you know, I have these guys, torture doesn't work.","Believe me, it works, OK? And waterboarding is your minor form. Some people say it's not actually torture. Let's assume it is. But they asked me the question, what do you think of waterboarding? Absolutely fine. But we should go much stronger than waterboarding. That's the way I feel. They're chopping off heads.","Believe me, we should go much stronger because our country is in trouble, we're in danger, we have people that want to do really bad things. Remember the power of weaponry. This isn't a hundred years ago where we fight hand-to-hand combat. This is weapons that are so destructive, so destructive that the world could end.","You have to be very strong, we have to be very vigilant, that we have to be very tough. Waterboarding is fine, but it's not nearly tough enough, OK?","Well, the education system is a mess in this country. We have the top 30 countries, we're number 30 on the list. We spend more on education per pupil than anybody else and second place doesn't even exist. We're so high, we're so far above. And Common Core is a disaster. It's education through Washington, through bureaucrats.","And I'm terminating Common Core and we're bringing it to local levels, and we're going to have real education. So in education, in the list, you have Sweden, Denmark, Norway, China, top four or five. And then you have the United States at number 30. And in between, you have third-world countries. Countries that you've never even heard of are better than us. And yet when it's, so we're number 30 and we're number, in terms of spending, we're number one.","So think of it. We spend the most money, and we're at the bottom of the list or however you want to define the list. It's pretty sad, isn't it? And we have education from Washington. We terminate Common Core. We're bringing education to the local level, and people do a great job of it. I mean, who's going to do a better job than you and your children at educating, let's say, your grandchildren?","You want your children, your daughter, your son, they're going to be on the school board, etc. You got to bring it to the local level. They do it with love, they don't do it with, you know, these bureaucrats in Washington, I'm not saying they're all bad. But many of them are and they want checks. They want big checks.","They get paid a lot of money. Look at the money we spend at Department of Education. So we're going to end Common Core, bring it to the local level. Very important.","I would win. I would. No seriously, I will. No, I've won many club championships. Actually, I've been. Who is the best golfer in the room? So do you have a club champion in here? Is there a club champion, huh? Is there anybody who's, let's say, a five handicap or less? Who's a five? Woah, stand up. That's very good.","They'll say, he's got a five. That's very good. What's your handicap? Well, that's very good. Wow. Good golfer. Good course too, right? Good course here? I hear good. If I win, I'll come back and play. If I don't win, you'll never see me. Now I love golf. Golf is a great thing. You know, when the president plays golf, it's OK. But he should play with people that he wants.","You understand? People that he wants to make deals with, congress people and people from other countries. Not just his friends, you know. So he talks about the carbon footprint. And as you know, the carbon footprint, I mean. Does anybody, who believes in the carbon footprint? Does anybody believe in it here?","I don't know. So he talks about the carbon footprint, environmental, all the stuff. And then he flies on a massive Boeing 747 to Hawaii with the old engines, you know, because it's a very old plane. Old engine, spewing. Plays golf for like two or three weeks, a lot of. You know he plays more golf than the people on the PGA Tour, right?","And then he flies back. And then he has a news conference on the environment. The carbon footprint. Listen, I just want, Bill, I want to thank you, but I want to thank the folks. Really, it was very important for me to come back and take care of the people that we couldn't see the last time. And I really appreciate it. I'd love your support.","I don't want your money at all. We're doing all of that myself, but I do want you to get out on Saturday and vote. And you know, the theme is, see the hat, the beautiful red hat? Make America great again. And we're going to make America great again. We're going to make it. We actually have a chance. And I say this over the last couple of weeks I've been saying it, I've met so many incredible people in this country.","I think we have a chance to actually make it greater than ever before. But we can't have Hillary, we can't have Bernie, we can't have these people that are going to destroy it. You'll end up paying 90 percent, 95 percent tax. Would anybody here mind paying 95 percent tax? I don't think so. I think that's not going to happen.","I think it's not going to happen. But I really want to thank you for being here, and we'll see you soon. Get out and vote. Thank you."],"text":" Hi, Bill. You know, I said I was going to come back. Remember last time we had thousands of people, so we had people outside. So we said, we'll come back, but we can only invite 500 people. So that's what we did. We invited 500 people. Now people are going crazy, why weren't they invited? But we invited the 500 people that we didn't get to last time. So I hope you enjoy it. OK? Mr. Trump, we'll get right into it. You've been on the trail for eight months. You've never been elected to a public office before. Tell me about the experience running for president in your view and the election process. Well, it's been an amazing experience. I've had a lot of fun. You probably saw the new polls that came out today. They've been fantastic. And one just came out in Nevada where I'm at a number that's beyond belief actually. Maybe I don't even have to go there and campaign. I don't know. But it's been an amazing experience. Winning New Hampshire was great. We did really well in Iowa. Should have won, but frankly, to be honest with you, somebody stole a lot of Ben Carson's votes and got himself a little extra cushion. We should have won that. But there's a lot of dishonesty in politics, I will tell you. Tremendous dishonesty. These people are, some of them that we're running against, in particular, Senator Cruz. He'll say anything. He'll say, for instance, I'm very strong on the Second Amendment. He'll say, Donald Trump doesn't like the Second Amendment, wants to get away with that, do away with that. I say, where does he come up with this stuff? In every speech I make, I talk about Second Amendment, I talk about different things. Obamacare, you know, I'm going to get rid of Obamacare. We're going to come up with a great, great plan. But Cruz will say, it's the most incredible thing, but Cruz will say Donald Trump loves Obamacare. I love Obamacare. Every single speech since it came out, I said we're going to get rid of it. So they really, I mean, they lie. And the reason I can say that nicely is that Rubio called him a liar also. So once another guy called him a liar, it's easier for me to call him a liar. But really, Cruz does lie. I've never seen anything quite like it. OK. This is from our Sun City Veterans Club. You said you will rebuild the military. That sounds a lot like Ronald Reagan's belief, a strong military is a strong offense, is a strong defense as well. Two questions. How will you rebuild the military, and what would you do about ISIS? Well, number one, we're going to knock the hell out of ISIS. We're going to get rid of ISIS. We have to. And just so you understand, I didn't want, and it was very important to me, I didn't want to go into Iraq. And a long time ago, 2003, 2004, but even before that, I was totally against war because you're going to destabilize the Middle East. And I went into it very big league, you're going to destabilize the Middle East. But they went in. Then Obama got us out the wrong way. But we have to get rid of ISIS. I mean, you know, maybe don't go into Iraq originally. We should have never ever gone in. But we did. So we made a mistake, the country made a big mistake and started all of this horrible thing that you see taking place, including ISIS. But now you have ISIS and they're chopping off people's heads, they're chopping off Christians' heads, they're chopping off anybody's head and we got to knock them out. We're going to knock them out so strong. We're not going to play games. We're going to make our military strong and powerful again. And believe me, it's the cheapest thing we can do, because nobody is going to mess around with us. We have no choice. It's the cheapest thing we can do. Our military has been decimated. It's been absolutely decimated. And it's, you know, it's not in good shape, believe me. And in fact, General Odierno, when he left, he said, in terms of preparedness, it's the least prepared it's been in a long time. We are going to make our military absolutely strong and powerful again. We don't want to use it, but we have to have it. It's actually like a preventative. It's the cheapest thing we can do. So that's totally important. And we've got to take care of our vets. We're going to take care of our vets. Our vets are being treated terribly. We're going to take care of our vets. Thank you, Mr. Trump. Mr. Trump, I'm a developer. I know it can be done. But will you explain your plans to build a wall on the Mexican border and stopping illegal immigration? It's a big question from a lot of these folks here. We're going to build a wall, folks, and none of these politicians are going to build a wall because they don't know where to begin. They come to me, they say, you're not really going to build a wall, are you? I say, of course I'm gonna build a wall. The reason is, and it's simple, first of all, I know how to build. What I know how to do best is to build. Wouldn't it be nice to have a president that knew how to build, because we have to rebuild our country? And knew how to negotiate. You know, I'm building a hotel that actually I got from the government. Can you imagine? The Obama administration. I got it from the old post office on Pennsylvania Avenue, between the White House and the Capitol building and right smack into my best location, right on Pennsylvania Avenue. And it's under budget by a lot, and it's two years ahead of schedule. And somebody in government said, we've never heard of that before. It's under budget, ahead of schedule. It's two years ahead of schedule. So we're going to open it in September, and it was supposed to open in a couple of years in September. But that's nice because we know how to do that. Having somebody that has that ability, I've always had the ability, under budget, ahead of schedule; having that ability when we have to rebuild our infrastructure because our country is crumbling, our airports, our roadways, our highways, our bridges, our tunnels, hospitals. I mean, everything we have it comes in, when you look at the way they build, it comes in double, triple, quadruple. Let me tell you, people are making a lot of money off our country. They're not going to make so much money anymore. And here's the other thing. I'm self-funding my campaign. So I'm not controlled by the special interest, the pharmaceutical companies and all of the different interests, whether it's to the electrical companies, the utilities. They have hundreds of them. They control the politicians because they contribute. I don't take the money, so I'm self-funding. I don't know if I get any credit for that to be honest with you, I'm not sure. But I'm self-funding, costing a lot of money. Costs a lot of money. But you know, the nice thing is they can't come to me and say, well, we gave you money, you know, Ford or General Motors or somebody. We gave you a lot of money, we need this, we need that. I'm going to do what's right for you folks, OK? And just full disclosure, my wife sent you a check for 25 bucks. OK. OK. Look, one of the questions that I think everybody in here wants to know is why is the media in general afraid of a Trump presidency? Oh, I get treated so badly. I mean, I was watching Fox this morning. They treat me so badly. Fox treats me like worse than anybody. But I get treated very badly by the media. I don't even know, I don't really understand why. They have pundits on that or just one after another, negative, negative, negative. It started where actually nobody, you know, they all thought I wasn't going to run and they said, nah, he'll never run, he'll never run. You run, and then they look bad. And then they don't stop. And some have become much better, but I think Fox in particular treats me so badly, it's incredible. But it doesn't matter, I guess. Look, we're leading in the polls by a lot. We won New Hampshire in a landslide. It was a landslide victory. We won every single group. We won highly educated, not educated. We won women, we won men, we won young, we won old, we won virtually every group, I think. Every group. And it was an amazing victory and something really special. But I'm finding out all I could do is tell the truth. You know, I tell the truth about Iraq. I say, the war was a disaster. We spent $2 trillion, lost thousands of lives, thousands of lives. We have wounded warriors all over the place. I love the wounded. I mean, these guys have more courage than all of us put together. I have to tell you, all of us. And you know, I say we should have never been there. And you know, if Bush is insulted, I don't care if he's insulted. What difference? It was a horrible mistake. We should have never been there. Somebody says, oh, that's not good to criticize. I said, criticize? It's one of the worst decisions in the history of our country to go in. We've totally destabilized the Middle East, which I predicted. I should get credit for vision because I predicted that was going to happen. Because when you knocked out the one power, the other power just took it over. Now Iran has taken over Iraq, just as sure as you're sitting there. We don't even have anything to do with Iraq anymore, we're gone. But think of it, we spent $2 trillion. Could have rebuilt our country. We could have done so much with that money. And instead, we're worse in the Middle East than we were 15 years ago. I mean, right now, it's a disaster. Saddam Hussein was a bad guy, right? Bad guy. But you know what he was good at? Killing terrorists. We didn't have, he was killing terrorists. Now, Iraq is Harvard for terrorists. If you want to be a terrorist, you go to Iraq. It's Harvard. And what did we do? You know, we spent all this money, lost all these lives, have all these wounded warriors. What do we get? And Iran is taking over. Not only do they get the $150 billion in this stupid deal that we made, one of the dumbest deals I've ever seen, ever, but now they're taking over Iraq that we handed them. They've been fighting for years to try and take each other over. Well, we decapitate the one country. They're now taking over, and people don't realize Iraq has the second largest oil reserves in the world. So we took it, and we just hand it to them on a silver platter. How could we have been so stupid? Very good. Very sad. I mean, honestly, to me it's a sad subject to talk about. All right. On the way in, in the back, I saw a gentleman with a Bernie t-shirt on. And I said, what are you doing here at a Trump rally? And he said, well, the tickets were free. So what is your answer to Hillary and Bernie when they're grabbing so many of the young people with freebies? What's your -- Who is the Bernie guy? Who is he? I think the rest of these folks ran him out. Oh I guess he got thrown out, I guess. I don't know. I don't see him. No, look. You know, this is something. And the main thing is you have to go and vote and all that. But if you don't vote for me, don't go and vote. I'd like to, it's a nice thing to say. You have to go vote. You have these politicians. Doesn't matter who you're voting for, but you must go out and vote. I don't feel that way. But just go and vote if you're going to vote for me. But it is so important. On Saturday, you have to. And it is true. We had such an unbelievable turnout. This was so, so great. And did I promise you I'd come back and take care of the people? People forget that. And we have so many people that wanted to come. We said, you can't come. This was for the group of people where they got stuck outside and there were a lot more than this. But they invited 500, exactly 500 people. And I just felt I had an obligation to do it. I was thinking about canceling this morning because I had something else, and I said, there's no way I have the courage to do that, right? Would I have been in trouble? Would I have been in trouble? And I know the tremendous support I have here, and I really appreciate it. And you know Del Webb. I knew Del Webb many years ago, and he was an amazing guy. He did a great job, I think. Are you all happy with Del Webb? I think so, right? Del Webb was a great developer actually. A great developer. And one of the few really great developers. So congratulations. Mr. Trump, there's not a person in this room that doesn't fear for the future of their children and their grandchildren. How are we gonna make America great for the grandchildren? Well look, we have to have strong borders. We have to strengthen our economy. We have to get rid of our debt. We have to balance our budget. All of the things that I talk about all the time. We have to have that strong military because we can't have any chances. We're being looked at by so many different people. And weaponry today is unbelievably powerful. So we have to be extremely careful. We have to be really, really diligent. I've called for bans on people coming into the country because we don't know what the hell's going on. I mean, there's bad stuff happening. There is bad, bad, bad stuff happening up here. When you have people flying planes into the World Trade Center, when you have people shooting people that gave them parties for their wedding, these two radicalized horrible people that, I mean, they were given parties by the people they killed for their children or their child and a wedding party. And they walk in and they shoot 14 people and kill them. You look at what happened in Paris where you have the strongest gun laws in the world practically. I mean, you can't have a gun unless you're a bad guy. You can't have a gun. They walk in, they kill everybody. By the way, Second Amendment. If some of the people on the other side that were being shot at had guns, it would have been a whole different story in Paris. Would have been a much different story. So you know, it's very simple. It's called Make America Great Again. We want to make America great again. That's my whole thing, make America great again. We're run by people that don't know what they're doing. We're run by incompetent people and/or something. I mean, there's something wrong with them because some of the deals, how did they make the Iran deal? Who would make a deal so stupid as that? Who would make a deal like that? Well, we're giving them $150 billion, we get nothing, and we get our hostages back as part of the deal. We paid $150 billion for some hostages that frankly should have come out years ago? And if you had the right negotiators, they would have? You would have gone in there and you would have said, we want our hostage back. They would have said no. And you'd triple up the sanctions and you leave the room. And 24 hours later, you got your hostages back. It's that simple. And you don't give them the $150 billion, you tell them we don't have it. We owe $19 trillion, we don't have it. Sorry, folks. Seriously! I mean, we have people, they didn't read the art of the deal, I can tell you that. We have people that are just, they don't have a clue. We take Bergdahl, Sergeant Bergdahl. You know, he's a traitor. So we get Bergdahl, six people died looking for Sergeant Bergdahl. Right? We get Bergdahl, they get five of the greatest killers that they wanted and coveted for nine years. We get one, they get five. He's a traitor, they're the best they have and they're now out on the fields or will soon be killing people again. I don't get it. I don't get it. I say, where do these people come from? Where do they come from? And we knew that he was a traitor when we made the deal, because they had a general and a colonel go and interview Bill, all the people that knew him, you know, from his platoon. And we knew he was a traitor. So why would we make a deal? Let them keep him. I would have said keep him. You can have him. I'd give him back. I'd actually give him back. I'd fly over, drop him right on top. You know, just being... That's the way I feel. That's the way he feels. No, but you know? Think of it. Why would we do that? Now who would make a deal like that? Where is the thinking? Who would make a deal? And that relates even to business, because it's the same mindset like the Iran deal. The trade deals that we have with China, we lose $500 billion a year. We lose $500 billion a year. Now this is a rich community so that doesn't mean anything, that kind of money. But you know, I mean, think of it. Think of how the country would be if we didn't. And I have the best business people in the world. I know them. We have political hacks negotiating our deals, right? Political hacks. I have the best business people in the world. They're going to negotiate our deals from now on. We're going to make a fortune. We're going to do great. We're not going to lose like that. We lose with Japan, we lose with Mexico. You saw Carrier now is moving to Mexico. Nabisco is moving to Mexico, one of its big plants. Ford is doubling up, going to move more to Mexico. They're going to spend billions and billions of dollars in Mexico? Why aren't they spending it here? I know how to get it so they're not moving to Mexico anymore. Believe me. It's going to end. Mexico is the new China. Be careful. Mr. Trump, you are without a doubt looking at part of the greatest, America's greatest generation out here. There's no question about it. They have worked hard to enjoy the American dream. One component of that dream is the Social Security system. What will the Social Security system, how would it be sound under a Trump presidency? And what would you do to make it solvent again? All right, I love the question because every single other candidate is gonna cut the hell out of your Social Security. Remember the wheelchair being pushed over the cliff when you had Ryan chosen as your vice president? That was the end of that campaign by the way when they chose Ryan. And I like him, he's a nice person, but that was the end of the campaign. I said, you got to be kidding. Because he represented cutting entitlements, etc., etc. The only one that's not going to cut is me. We're going to make our country rich. We're going to bring our jobs back. We're going to cut a lot of costs out of our budgets, stuff that's waste and disgusting waste. We're going to take care of our veterans and all of that, but there's tremendous fat. You know, we can take care of people. We can run a better country with less money. And actually, it would be better. It's like when I build a building, I build a better building for less money than the guy across the street. He spends more money, and my building is better and it looks better. And it's got a better architect and it's got better design. You know, we can do it better. There's so much fat. So we're going to take the, you know, fraud, the waste and the abuse out of Social Security. For instance, they have, as I read, thousands of people that are over 106 years old. Now, you know, hopefully we can all make it up to that age, but we know there's not going to be thousands of them, OK? That means there's fraud. Somebody is collecting thousands. That's just one little example of what's going on. We're going to save Social Security. We're not going to cut the age. We're going to give you the full benefits. You've been paying into it all your life, and every other candidate that's up here wants to cut your Social Security. They're going to cut it. They're going to cut it. And I'm not going to cut it. I'm going to bring money in, and we're going to save it, OK? Believe me. That's a big thing. Nobody else is going to be able to do it. OK. When I agreed to do this and asked to do this, actually I told my friend that asked me, Jim Merell, I said, there'd be no softball questions here. So this question goes, this question goes -- Uh-oh. This question goes, from a friend of mine, Bill McCarthy and his son, who's a Catholic priest, once and for all, are you pro-life or pro-choice? I'm pro-life, yeah. I'm pro-life. Who in here is pro-life? Who in here is pro-life? Yeah. OK. Good. No, I'm pro-life. OK, that's quick enough. It's simple. I mean, Cruz said, he's not pro-life. I said, I'm not? I'm pro-life. You can't lie about people like that. It's just incredible. And again, I've been in business and I've dealt with some pretty rough much tougher than Cruz. But I've never dealt with anybody that lied so much. And then he says he's religious. No wonder I'm winning the evangelicals by like two to one. I'm winning the evangelicals. I won them in New Hampshire as you saw, and I'm winning them here by a tremendous amount. But you look at, you just can't do it. In the end, it catches you. What he did to Carson was disgraceful, with, you know, he's out of the race, he's out of the race. He quit, he's out of the race. Then after the race was over, he called, he apologized. He got thousands of votes. But he called up, he apologized. Like two minutes after the polls closed, you know, oh, let me call him. Oh, Ben, we're sorry we did that. We made a mistake. OK. I don't think Ben accepted the apology. I wouldn't have accepted the apology. But he lies. He just really lies, and we can't let that happen. The one advantage I have is when he says something about me, like for instance I'm pro-life and he'll say I'm pro-choice. And I got a call from whoever, I hear you're pro-choice. I said, who told you that? Cruz. Cruz? It's unbelievable. No, I'm pro-life. And I said to myself, how can a guy be so dishonest? How can he do it? And just this morning I heard a couple of other candidates saying the same thing, and yet he'll talk about religion and he'll talk about all of the things that he talks about, but you know, the advantage I have is that I have a big mic. I can speak. But we have to speak before Saturday. Because after Saturday, in this community, it doesn't matter. But at least I'm able to get my word out, Bill, pretty quickly. Other people can't get the word out. And again, what happened? I'm telling you, what happened to Ben Carson was a disgrace. OK, thank you. Would you let our good folks here know about your current relationship with Mr. Putin and what we'd see in a Trump presidency? Well, I have no relationship with him other than he called me a genius. He said, Donald Trump is a genius and he's going to be the leader of the party, and he's going to be the leader of the world or something. He said some good stuff about me and these characters that I'm running against. We want you to disavow that statement. I said, what, he called me a genius? I'm going to disavow it? Are you crazy? Can you believe it? How stupid are they? We want you to disavow the statement. I'm not going to disavow. And besides that, wouldn't it be good if we actually got along with countries? Wouldn't it be actually a positive thing, right? Do we have to always fight? I think I'd have a good relationship with Putin. Who knows? I mean, who knows? But I think we'd have a good relationship. But I can tell you, it's a horrible relationship with Obama. It's ridiculous. And he takes advantage of Obama. Nobody's going to take advantage of me, folks. They're not going to take advantage of me. Believe me. But you know, I mean, if we get along with Russia, that would be, it's sort of nice, wouldn't it? Let Russia drop. For instance, this guy Lindsey Graham. You have a guy, he's one of the dumbest human beings I've ever seen. He may be. He runs against me, OK? He runs against me for president. He starts off at six percent, and he hits me. And I start, although I did give out his phone number, I mean, that's but anyway, he starts hitting me, saying vicious things, and now he starts going down. He goes to five percent, four percent. He ends up at zero, zero. Here's a guy running for the presidency. He's at zero. He leaves in disgrace, in my opinion. I think he's disgraced. He comes here, he thinks this is gonna be good. He had like two points here, and I had 42, right? I was at 42. He's a sitting United States senator from South Carolina. He's at two percent. I saw him on television this morning, and I think he lost it. He's saying, Donald Trump, he couldn't even talk. He was shaking. The hatred. They say, what do you think of Donald Trump? Oh, oh. He went crazy! The guy is a nut job. I mean, what? And honestly, honestly, honestly, I don't want his endorsement. I don't want anything to do with him. And he's thinking, he says, I know so much. He does about the military? I could push him over with a little thimble. Boom! This guy knows, let me tell you, this guy knows nothing. He's the kind of thinking that we've had. That's why we're in there for 15 years. Remember what I said. We're in there for 15 years, right? Middle East. We're spending trillions and trillions, probably 4 trillion or 5 trillion, 2 trillion in Iraq, but that was as of two years ago, right? You and I talked about it last time. We're in there for probably 4 trillion or 5 trillion, maybe more than that. We could have rebuilt our country, we could have. Because of guys like Lindsey Graham. So I listen to his military, he wants to fight Assad and he wants to fight ISIS at the same time. But they're fighting each other. So they're fighting each other, we're fighting them. Think of it, think of it. I got to take out ISIS. I don't care. We're backing people, rebels. You know they call them the rebels, the freedom rebels. They have all these glamorous names, right? Look at what happened to Libya. Look at what happened to Iraq with, you know, look at what's going on. We've got the . We give them billions of dollars of equipment. Billions. If they win, they're worse than the guy that they took over from, right? That's what happens. Look at Libya. What a disaster with Gadhafi. We got rid of Gadhafi. What do we have in Libya? It's a total, it is such a disaster. Look at Saddam Hussein. We just talked about it. What a disaster. But we have a guy who doesn't have a clue about the military, but he thinks that he does. With his thinking, remember this. We have been in there for 15 years, and we are far worse off now than we were 15 years ago. Fifteen years ago, we didn't have people coming around, I mean, the whole thing. And in all fairness, we went after Iraq, they did not knock down the World Trade Center, OK? It wasn't the Iraqis that knocked down the World Trade Center. We went after Iraq. We decimated the country. Iran is taking over. OK. But it wasn't the Iraqis. You will find out who really knocked down the World Trade Center because they have papers in there that are very secret. You may find it's the Saudis, OK? But you will find out. But it wasn't Iraq. So you say, but when I look at a guy like Lindsey Graham, then I hear his theory on the war, you'll be in there forever. You'll be in there, and you'll end up starting World War III with a guy like that too. We don't want World War III over Syria. OK? We don't want world, do we agree with that? We don't want a world war. But I watched him on Fox today. I have never seen a guy that, I don't think I've ever seen a guy so totally out of control. They mentioned my name. He went literally crazy this morning. So he got out of the race, Bill. He was at, is this correct? He was at zero. Zero. And he still didn't want to get out of the race. You know, I often say, these guys that are zero, why do they say, wouldn't you sort of, I think I'd crawl in a corner and I'd hide. I would just sort of put out a release. I've left the race. I wouldn't even give a news conference, I'd be too embarrassed. But anyway, I think he's a disgrace. I think Lindsey Graham is a disgrace. And I think you have one of the worst representatives of any representative in the United States, and I don't think he should run. I don't think this state, remember, I was at 42 and he was at two when he was running in this state, I'm talking about. He was at zero nation. I mean, the guy was at zero nationwide. I don't think he could run for dogcatcher in this state and win again. I really don't. Other than that, I think he's won. And you helped him with his Verizon bill, right? Verizon bill. Terrible. He's a terrible. I got to tell you, he's a terrible representative for the state. Mr. Trump, besides -- How do you like him, Bill? I think Bill feels the same way, but he's not going to say. Besides your obvious choice for ambassador to the Bahamas, what would your cabinet look like in terms of personnel and cabinet positions? Well, they'd be professional people. I mean, they'd be good people. We have a lot of people in different positions that have no right to be there. I mean, they know nothing. I put people in that have great ability. We're going to put, in terms of our trading areas as an example, we're going to put, you know, great business people there. Great people. They don't want to get paid. Then put wealthy people there. They became wealthy for a reason, right? You know, we're going to put the best negotiators there. But the cabinet, we're going to have all the best people. We're going to find out who they are, and it's not going to be a politically correct choice either. We're going to have people that are going to be proper. And if somebody's politically correct and somebody else is gonna be outstanding, we're picking the outstanding one every single time. We have politically correct people all over the place. Our country is so politically correct that we're going to hell. And we're not going to do that. OK. And on that whole vein of politically correct, would you allow U.S. interrogators to waterboard terrorist prisoners in order to extract information? Absolutely. You know, this question was in the previous debate, OK? And they asked it of Ted Cruz. What do you think of waterboarding and what would you do and how bad? And he was like really weak on it. He was, well, he didn't want to get involved because he thought waterboarding was bad. So of course it's bad, but it's not like, it's not chopping off heads, folks, OK? That I could tell you. So they asked him, and he really gave a very incomplete answer. It was a terrible answer. He was stumbling and mumbling, and he's going like, well, I don't know about . OK. Then they asked the question to me. Well, what would you do? I said, approve it immediately. But I'd make it also much worse. They said, what do you mean? I said, I'd do it much worse. I said, they're chopping off our heads in the Middle East. They want to kill us. They want to kill us. They want to kill our country. They want to knock out our cities. And don't tell me it doesn't work. Torture works, OK, folks? Torture, you know, I have these guys, torture doesn't work. Believe me, it works, OK? And waterboarding is your minor form. Some people say it's not actually torture. Let's assume it is. But they asked me the question, what do you think of waterboarding? Absolutely fine. But we should go much stronger than waterboarding. That's the way I feel. They're chopping off heads. Believe me, we should go much stronger because our country is in trouble, we're in danger, we have people that want to do really bad things. Remember the power of weaponry. This isn't a hundred years ago where we fight hand-to-hand combat. This is weapons that are so destructive, so destructive that the world could end. You have to be very strong, we have to be very vigilant, that we have to be very tough. Waterboarding is fine, but it's not nearly tough enough, OK? OK, and in the whole vein of torture, give us your view on Common Core and the education system. Well, the education system is a mess in this country. We have the top 30 countries, we're number 30 on the list. We spend more on education per pupil than anybody else and second place doesn't even exist. We're so high, we're so far above. And Common Core is a disaster. It's education through Washington, through bureaucrats. And I'm terminating Common Core and we're bringing it to local levels, and we're going to have real education. So in education, in the list, you have Sweden, Denmark, Norway, China, top four or five. And then you have the United States at number 30. And in between, you have third-world countries. Countries that you've never even heard of are better than us. And yet when it's, so we're number 30 and we're number, in terms of spending, we're number one. So think of it. We spend the most money, and we're at the bottom of the list or however you want to define the list. It's pretty sad, isn't it? And we have education from Washington. We terminate Common Core. We're bringing education to the local level, and people do a great job of it. I mean, who's going to do a better job than you and your children at educating, let's say, your grandchildren? You want your children, your daughter, your son, they're going to be on the school board, etc. You got to bring it to the local level. They do it with love, they don't do it with, you know, these bureaucrats in Washington, I'm not saying they're all bad. But many of them are and they want checks. They want big checks. They get paid a lot of money. Look at the money we spend at Department of Education. So we're going to end Common Core, bring it to the local level. Very important. Very good. And I think I'm allowed one light question here, so this is a two-part. Mr. Trump, I ask for honesty here. What's your real handicap in golf? And, and, the second part of that question is, seeing that President Obama plays six times a week, if you played 18 holes against him, who would win? I would win. I would. No seriously, I will. No, I've won many club championships. Actually, I've been. Who is the best golfer in the room? So do you have a club champion in here? Is there a club champion, huh? Is there anybody who's, let's say, a five handicap or less? Who's a five? Woah, stand up. That's very good. They'll say, he's got a five. That's very good. What's your handicap? Well, that's very good. Wow. Good golfer. Good course too, right? Good course here? I hear good. If I win, I'll come back and play. If I don't win, you'll never see me. Now I love golf. Golf is a great thing. You know, when the president plays golf, it's OK. But he should play with people that he wants. You understand? People that he wants to make deals with, congress people and people from other countries. Not just his friends, you know. So he talks about the carbon footprint. And as you know, the carbon footprint, I mean. Does anybody, who believes in the carbon footprint? Does anybody believe in it here? I don't know. So he talks about the carbon footprint, environmental, all the stuff. And then he flies on a massive Boeing 747 to Hawaii with the old engines, you know, because it's a very old plane. Old engine, spewing. Plays golf for like two or three weeks, a lot of. You know he plays more golf than the people on the PGA Tour, right? And then he flies back. And then he has a news conference on the environment. The carbon footprint. Listen, I just want, Bill, I want to thank you, but I want to thank the folks. Really, it was very important for me to come back and take care of the people that we couldn't see the last time. And I really appreciate it. I'd love your support. I don't want your money at all. We're doing all of that myself, but I do want you to get out on Saturday and vote. And you know, the theme is, see the hat, the beautiful red hat? Make America great again. And we're going to make America great again. We're going to make it. We actually have a chance. And I say this over the last couple of weeks I've been saying it, I've met so many incredible people in this country. I think we have a chance to actually make it greater than ever before. But we can't have Hillary, we can't have Bernie, we can't have these people that are going to destroy it. You'll end up paying 90 percent, 95 percent tax. Would anybody here mind paying 95 percent tax? I don't think so. I think that's not going to happen. I think it's not going to happen. But I really want to thank you for being here, and we'll see you soon. Get out and vote. Thank you."}