{"id":451,"author":"Donald Trump","title":"Speech: Donald Trump in Walterboro, SC","date":"2016-02-17","link":"https://factba.se/transcript/donald-trump-speech-walterboro-sc-february-17-2016","paragraphs":["Thank you. Thank you, everybody. Wow. So nice. This is called real country. Look at this. Look at these people over here. Wow. So you know, to have the endorsement of these two very rich, very powerful, but really wonderful gentlemen, these are really wonderful gentlemen. Get back up here. Come here, come here.","What -- What gentlemen. And they got some money don't they huh? They got some money. I'm looking at that equipment. They got some -- That's good.","So it's so important. They're getting out to vote is just so important because our country has been taken away from us. It's going so fast. And you know you talk about Second Amendment because I was asking with Randy and a lot of people I was talking to some of the people before. What would you like me to focus on and they said, \"Just Second Amendment.","Second Amendment.\" Now second amendment means a lot of other things too. We got to talk about trade a little bit to talk about other things.","But the Second Amendment is under siege. You know that, you know that very well. We lost a great Supreme Court justice and nobody thought this was going to be part of the equation and all of a sudden if somebody gets in that's the wrong person they'll take that Second Amendment away so fast, your head will spin.","You see Bloomberg is somebody that wants to knock out the Second Amendment.","Hillary is a disaster on the Second Amendment. No, they want to -- They want to take it away. So it's just not going to happen. It's not going to happen. You have to get out and vote. So important. But when we lost our wonderful justice, who is a great man and a great Second Amendment person, I just heard coming up, you know, the senators we've been very disappointed.","I'm a Republican. Many of you are Republicans but we're not being protected whether it's a budget.","You saw the budget that was approved a month ago. It's approved by the Republicans. They gave it away. They gave Obama everything. So Obama wants to put in a Supreme Court judge and the judge that he wants is going to be a very negative person to guns because that's the way it is. OK. Believe me that'll be the way it is. And basically, they don't have the right to do that.","But I keep saying, \"Well are the Republicans going to fail? Are they going to crack? What's going to happen?\" And coming up today I'm hearing Well there could be a way of Obama pushing it so here we go. Right. Here we go. Same thing here with Obamacare. It's going to be defeated. It's going to be repeal we're going to repeal and replace Obamacare.","Believe me.","But I mean, look at what's gone on with your premiums 35, 45, 55% up, your deductible is so high. We -- I mean you've got to see that truck right there, you're going to get hit by that truck in order to ever use it. So I come up and I'm hearing that Obama now who said, by the way, yesterday, \"Donald Trump will not be the president.","He will not be.\" That was a compliment. Look, he's been -- he's been perhaps the worst president in the history of the United States. It's a compliment. But he was all over the place yesterday. Said, \"Donald Trump will not be.\" I think we have maybe a little surprise in store and we start right here in South Carolina.","You know, New Hampshire was so amazing. We had a big big victory in New Hampshire. Amazing people. And then we come down here and I said you know I think we have an even bigger lead over here. And the people have been incredible no matter where we go to speak even this I know that four years ago you had about 200 people here for the same kind of a thing for your front-runner and he's a good front-runner and a good guy.","And he did well but you had 400 people 200 people you have thousands of people here.","And we just appreciate it and I won't forget it. Believe me, I'm not going to forget it. I'm not going to forget it. So I hear that they're talking about trying to get a liberal judge and a judge that does not like the Second Amendment. A judge that and this is one of many. This is one of many but a judge it doesn't want to do a number on the guns and you know how important it is. We're just not going to let it happen.","OK. It's not going to happen.","And if we get elected, we know that. But we have nine months, 10 months to go. We have to have the Republicans hold fast because I'm just hearing these little cracks saying, \"Well maybe if you appoint somebody, maybe we can get along. Maybe.\" It's not the way it's supposed to be. Now, it's possible that they'll have their wish because if they win they're going to be having their choice.","But if they don't win, we're going to start really taken back because we have three or four or five, maybe, Supreme Court judges. This was not supposed to be one in question. This was a very sad circumstance that happened with.","I mean, really, to me it was a very sad circumstance. But now what's -- we're going to see what happens. I will only tell you this, we are doing well. We have a really good chance to win. If we can win in South Carolina we're going to go -- I mean, we could very well run the table and I don't know if you saw -- I guess a lot of you have seen, actually, next week in Nevada.","It's going to be phenomenal. The relationship there and to the people -- Bush is -- That's right. Bush is 1% in Nevada. This guy, why does he just give up. Just go home. Go home. Go home to mom. Got to go home to mommy.","Yeah. Bush is only at 1% in Nevada. A couple of them are you know a 10, 11, 12 and I am at like 40 something, 48. So. So I think we're going to do well. Then we have the SCC. We're gonna have the SCC, which is gonna be, I think amazing. But it really now we're starting. New Hampshire could not have been better, they gave us a tremendous send off they really started us on a way, and we did well in Iowa, I mean, some votes were stolen from Ben Carson, which by the way was a disgrace.","What -- what Cruz -- what this guy Cruz did with Ben Carson was an absolute disgrace. What he did was that he stole, it was theft, and then they come out with a voter violation form, which is a fraud as far as I'm concerned, and what he did with that whole thing was a disgrace. So we're not going to let that stuff happen anymore.","I mean we're not going to let it. We will not let it happen. We're all watching, you're all watching.","Keep your eyes wide open. These politicians, there's this guy he raises the Bible and yet he tells fibs he tells lies and then he does this stuff to Carson and he does other things, very bad. So politicians are bad people. Boy, they are bad. Would you believe it?","So we're not going to let it happen and we're going to get in there and I just want it -- So Saturday, go out and vote because this is going to be the place that's going to really make it. And honestly, I've been watching all the pundits. Now the bad news is they're always wrong. They all said I'm not running and I ran.","Well how is he going to do and he's just doing it for fun I'm not doing this for fun. Believe me. I love this location but I know I could be someplace else, OK. I could be someplace else right now. I could be very happy but I'm doing it because you know the expression and I see all the hats in the audience, Make America Great Again.","We are going to make America so great. We are going to -- we are going to win again. You know we don't win very much. You're very tough, smart people, you like to win, right? This guy over here like to win. And we don't win anymore. We used to win, we don't win anymore. Well we're going to start winning again.","We're going to start winning again. So Second Amendment protected.","Common Core, we're going to end Common Core. We're bringing we're bringing your education locally. It's going to be fabulous. I don't know if you know and you've heard me say we have the absolute worst -- We spend No. 1 in the world on education, right. No. 1, per pupil in the world, there is no second place because we're so high so much higher, you have China, you have Norway, you have Denmark, you have Sweden, you have these countries are the best in terms of education and they're on the list, the best.","No. 30th, in the top 30, we're No. 38, OK. We're No. 1 in cost.","That's a little bit like what I'm doing. I'm least spent money. You know I'm funding my own campaign, right. So -- So I don't have a lot of the people coming to me. You know, the drug companies and all that. Because if you would see the kind of waste fraud and corruption in the United States, a lot of it isn't really waste fraud and corruption.","It's the fact that people that are running against me and people in the Senate people in Congress, they have tremendous power because they have people giving them unbelievable campaign contributions and their special interests and they do what those people want.","And that's one of the reasons our budgets are out of whack. The military is out of whack. The military orders equipment they don't even want and the stuff they don't want they don't get because the company that makes that equipment is like, you know, it's not politically adept and companies that really are, they make the equipment we don't want.","It's going to all change because I'm not getting money from any of these people. I don't give a damn, I mean, we're going to do the right thing.","You know we're going to do the right thing. We're going to do absolutely the right thing I tell you a little story. So the drug companies, we are the largest purchaser of drugs in the world the United States. We put more -- which makes a lot of sense, I guess. But we purchase more drugs to make you better, drugs to make you better.","Not the kind of drugs that come over the southern border, which we're going to end, OK.","We're going to stop -- We're to build the wall. Yup. Folks, by the way, we're going to build the wall, and who's going to pay for the wall? That's right. You better believe it.","We have a trade deficit with Mexico of $58 billion and these characters come up these politicians that I'm running against. You don't really think Mexico's going to pay for the wall. I said, \"Absolutely 100%.\" They said, \"How are you going to get Mexico to pay.\" And I don't want to go into it because they won't understand it. I mean, it stamps no concept of business.","They have no -- you know the 150 billion we gave to Iran. These people have no concept. We have a $58 billion trade deficit with Mexico, OK. There was going to cost $12 billion, maybe less. If I build it will be taller better and less, OK.","So you think of this. So you think of this. So they say, \"How are you going to possibly do it.\" They make so much money, plus we give them subsidy. They make so much money from the United States it's going to be one of these things and I don't know if you heard one of the presidents or ex-president of Mexico held a news conference.","He said,\" We will never ever, ever pay for the war.\" And the press called me. They said they said they will never pay for the wall. I said, \"Who was it?\" \"Calderon.\" He's a very nice good guy. He said, \"Tell him the following. The wall just got 10 feet higher.\" I mean it. Got 10 feet higher. They're going to pay for it. And I get along great with Mexico.","The problem is, I mean, they buy apartments, I have hundreds and hundreds and even thousands of workers are Hispanics I'm doing great with. We have such an amazing relationship with Hispanics and they're great people.","The problem is the leaders of Mexico are too smart for our leaders. They're too smart. They're too cunning. You look at what's going on it's unbelievable the border is a disaster it's a sieve, it's like people flow over. Not gonna happen anymore, folks. People can come into our country but they're going to come in legally.","They're going to come into a process. They're going to come in. They're going to come in legally.","So with trade we're going to solve the trade problem. I don't know if you saw a Carrier air conditioner announced two days ago, they're moving to Mexico. Nabisco. They're moving their big plan from Chicago to Mexico. Ford. They're moving this massive complex, you're building two-and-a-half billion dollar plant and now they just announced they're building it bigger.","I've been talking about this for two years.","Yesterday the Wall Street Journal announced they're building it bigger. In other words they're doubling down. You know why nobody does anything about it. I'm gonna do something about it. So I watched somebody show what would you do about Carrier because that was a sad case. Somebody used their cell phone and they would tell him, \"You know you're out of work, you're out of jobs, you forget it, it's over.\"","We're moving to Mexico and the people are crying, grown men that have been there for a long time, really incredible people, and they're crying and they're devastated and they lost their job, they'd never had another job and now this plant is this whole thing's moving to Mexico. And they said, \"What would you do.\" I said, \"Tell you what I'm going to do.\" because you know they talk about free trade I'm a free trader but I say, \"Oh, if I put a tax on these characters these, you know, idiots.\" These, I mean, they're like stupid they say, \"Donald Trump is not a true conservative because he tax.\" We've got to make -- you know it's got to be fair.",", folks. It's got to be fair. I'm a conservative person. Hey, I'm the most conservative on the border. I'm the most conservative with the military. Nobody's tougher than me. I'm the most concerned. We're going to -- we are going to make our military so big so strong, so powerful. Nobody's ever going to mess with us, folks.","We won't have to use it.","I'm the most conservative on taking care of the vets. Our vets are treated horribly. We're going to take care of -- I'm the most conservative on Common Core. We're ending Common Core. I told you that and we're moving it locally and nobody is more conservative. We call toughness but nobody is more conservative on the Second Amendment.","So all of these things but with -- with Carrier, so they have in and they're coming across and they're going to build a plant and probably get some subsidies from Mexico. Probably -- we probably even give them subsidies.","They probably have the United States giving subsidies to move out of the country. That's how stupid it is and that's how stupid we're run. So what happens is they said, \"What would you do?\" It's very easy. We call them we say let's have a meeting. Here's the story, folks. You moving to Mexico, congratulations.","But if you don't say the United States you can have a problem. But here's what you do it. You want to move to Mexico, build your factory, it's gonna be wonderful. Hire your people they're not from the United States. All those people are now looking for jobs and those are good jobs. You know we're hiring a lot of part timers now.","We're hiring and the numbers are totally phony.","The 5% totally phony numbers. So I say, \"Here's what we're going to do. Very simple. You build your plant in Mexico enjoy yourselves and you're going to sell their conditions and just have them cross the border and sell them to the United States. No you're going to pay a 35% tax on every air condition.\" It's true.","The only thing you can do. And you know what? It's the only thing you can do. There's nothing else because otherwise how are you going to get him to stop. And then you have the devaluations with China the all time -- they're like grand chess masters or grand -- I mean these people are the greatest, the greatest in history.","They're Grant masters of -- of that, devaluation. They devaluate -- they devalue their currency.","Japan's doing very well too. They're killing Caterpillar. You know they're rotting Komatsu tractors now because they're -- they've devalued. You take a look at what's happened to the yen and it's very hard. A friend of mine is a big excavator, you all know excavators, I love excavators. This guy's a very big when he buys Caterpillar tractors all the time and excavators.","He just put in a big order for Komatsu. Not that he wanted to. He said, \"Donald they made it impossible for me not to buy. They've devalued the yen to such an extent, Japan, that it made it -- I mean I owe it to my family, to my company, to myself, I have no choice.\" And he was like depressed. He want to buy Caterpillar.","I said, \"What's the difference?\" He said, \"They're both good, Caterpillar is better but I couldn't help but do this.\" Well China is doing that times a hundred times a thousand.","And what they're doing is the devaluation of their currency makes it impossible for people to compete. We can't allow that stuff to happen. Look when we send stuff over to China it doesn't get in. If it does get in you have to pay a big tax when they stuff it. You know it's not supposed to be that way. You know it's supposed to be free trade.","It's supposed to be, they come,w e go, back and forth.","They devalue their currency and on top of it they make it impossible. I have a friend who's a great manufacturer. He said it's virtually impossible to get his goods and he makes better stuff than they do. He can't get his goods into China. When he does get them in, has a tax to pay. I have a friend who actually bought an airplane and he can't get it into China because the tax is so massive, he's going to sell it now at a big loss, OK.","Well, and think about Boeing. By the way, think about Boeing. Boeing is building plant over here. Boeing just had a big order from China. But China is making them build a massive airline facility, right? Massive. Like bigger than anything you've seen. OK. You feel good about Boeing right now? Tell me in five years unless I'm president, you'll be fine., don't worry about it. But tell me in five years you're going to feel good about Boeing because I'll tell you what's happening.","They are going to build that plant. They're building it. They're building it. It's going to be finished soon but they're going to build that plant. They're going to devalue the hell out of their currency and all of a sudden you'll be really a big front page story all over the place that Boeing's going to leave, right, South Carolina.","They're gonna make all their planes in China because that's what they do. That's what they do. And our leaders aren't smart enough to stop it. OK. I have Carl Icahn endorse me. Great businessman, very rich guy, very, very successful.","I -- If I told Carl, \"Carl do me a favor, I want you to watch over China trade.\" We're going to be in great shape. We have, right now, people that have no concept of what they are doing. They have no concept of what they're doing. They're political hacks. I mean that's what they are. They're political hacks and these are the people that are negotiating with these people from China and again China likewise, I get along great with China.","Largest bank in the world, my tenant. They buy condos for tens of millions of dollars. I have the Bank of America building in California I own a big chunk of that I got that through China, through a very complex set of transactions but through China I mean, I think China is terrific. I'm not angry at China.","I'm angry at our leaders for not being able to compete with China. I'm not angry.","So we're going to get things changed around. We're going to use our best people. We're going to make it, we're gonna be so smart and we're going to start winning again. We're going to have strong borders. We're going to have strong military. We're going to take care of our vets. We're going to have such great trade deals.","We're going to win again. We're going to win again.","We're going to win so much. And you know, and by the way, we have to get rid of ISIS and we have to get rid of them. Yes. I was against the war in Iraq from the beginning. I was against the war in Iraq. We shouldn't have done it. We did it. Then Obama got out the wrong way. We shouldn't have done Iraq. We did it. It destabilized the Middle East.","Exactly, if you go back you could see 2003, 2004, I said is going to totally destabilize the Middle East because you had Iran and Iraq and there were the same militarily.","They fight, fight, fight, bomb, then they'd rest. Then they fight, fight, fight for years and years and years. They were the same. We decapitated Iraq and now Iran is taking over. Not only did they get the $150 billion, maybe the worst transaction I've ever seen negotiated. No, no. Done by the famous Obama administration, the worst -- the worst the dumbest, one of the dumbest deals I've ever seen.","And we get nothing, we get nothing.","We should have gotten those hostages before we started even negotiating, not now. We should have gotten them years ago. But if you look at what's going on and now on top of that we gave them Iraq because Iran is now taking over Iraq. It's just taking it over. We -- So here's what we did. We spent $2 trillion, thousands of lives lost, wounded warriors who we all love all over the place and the best people, the most incredible, tougher than all of us these people.","I mean, what they've gone through. So the wounded warriors all over the place, you know, we have nothing. We have nothing.","We have absolutely nothing. So here's what we're going to do. We're going to change things around. We're going to be smart and we have to. We'll do what we have to do in terms of ISIS and all but we have to start rebuilding our country. We have $4 trillion in the various places, $4 trillion. Not going to happen anymore.","We're going to have a strong military but we have to rebuild our roads, our bridges, our tunnels, our schools, our hospitals.","I mean our country is like a Third World country. You go over to Qatar and you go over to some of these places in the middle east, you go to China, you see the airports, you see the bridges. They have bridges that are so incredible, you've never seen anything like it. They have railroad trains that go 350 miles an hour, and we have things that go chug, chug, chug like from 100 years ago.","We've become like a Third World nation because we're fighting everybody else's battles.","And remember this we are like the policemen of the world. But we don't get paid anything. We protect Germany. We protect Japan. Do you know that in Japan, if we get attacked we have a treaty with Japan. If we get attacked they don't have to do anything. If they get attacked we have World War 3. We have to protect them.","OK. I mean, who makes these deals? We protect, as an example, South Korea, you have a maniac right next to him , right, but we protect South Korea.","So every time we order televisions they come from South Korea. They make a fortune. We protect South Korea. Let me tell you something. Why aren't they paying? They pay peanuts for what we do. Every time this guy, you know, raises his head, we see our ships start to sail our soldiers get ready. We have 28,000 soldiers at the border.","So we take care of the world, we don't get it.","Saudi Arabia, before the oil went down. They were making $1 dollars a day, 1 billion a day and we rent space so that we can help them. We rent military bases, we pay rent and yet without us they wouldn't last for two weeks, they'd be gone. So we'll change all that stuff, folks. I mean, we want to be good.","We want to be fair we want have heart and we're not going to let these Syrian folks in. We don't know who they are. We don't know where they come from.","They're not coming into this country. They're not coming in. You know, you have a lot of them, I don't know if you know it. You have a lot of moving to South Carolina. I don't know. Have you heard this? And you want to tell your governor don't let him move to South Carolina you don't want him in South Carolina.","And I know they'll say, \"Well we have nothing to do. We're -- we're state government we're -- \"","Let me say something. If a governor from a state didn't want to have him, I don't care what it says. You don't have to have them. But we don't know where they come from. We want to help them with safe zones. We want to get the Gulf states to pay.","I don't want to pay. We owe $19 trillion. We owe enough. We can lead it. But let the Gulf States they have so much money they don't know what to do with it. Let them build safe zones. Look at what's happening in Germany, it's a mess. Look at Sweden. Look at Brussels. In Brussels you go there 20 years ago, 15 years ago was incredible.","So when I call for moratoriums and I call for this -- first day I get hit with tremendous heat, right. Then everybody says you know he's right. Same thing on June 16th I announced got to stop illegal immigration. The heat I took was unbelievable. Three or four weeks later they're all saying, \"You know Trump is right.\"","Then you had Kate killed in San Francisco, beautiful Kate by an illegal immigrant. You had Jamil in Los Angeles killed, incredible guy, I mean, young man, wonderful father, he's a friend of mine, a great guy. You had the veteran 65-year-old woman, a veteran, raped, sodomized, and killed in Los Angeles by an illegal immigrant.","Got to stop it, folks. We got to stop it. We've got to be smart.","We're going to be a country again. We're gonna be a country again. So I just want to thank this endorsement meant so much to me from these two guys and -- and from the whole community. I just want to say get out and vote. We're going to do something that you're going to be so happy with we're going to win so much and we're going to make America great again.","That's what we want to do. Make America Great Again. So Saturday get out and vote. Thank you. We love you all. Thank you very much.","Thank you. Thank you very much, folks. Thank you. Thank you very much."],"text":" Thank you. Thank you, everybody. Wow. So nice. This is called real country. Look at this. Look at these people over here. Wow. So you know, to have the endorsement of these two very rich, very powerful, but really wonderful gentlemen, these are really wonderful gentlemen. Get back up here. Come here, come here. What -- What gentlemen. And they got some money don't they huh? They got some money. I'm looking at that equipment. They got some -- That's good. So it's so important. They're getting out to vote is just so important because our country has been taken away from us. It's going so fast. And you know you talk about Second Amendment because I was asking with Randy and a lot of people I was talking to some of the people before. What would you like me to focus on and they said, \"Just Second Amendment. Second Amendment.\" Now second amendment means a lot of other things too. We got to talk about trade a little bit to talk about other things. But the Second Amendment is under siege. You know that, you know that very well. We lost a great Supreme Court justice and nobody thought this was going to be part of the equation and all of a sudden if somebody gets in that's the wrong person they'll take that Second Amendment away so fast, your head will spin. You see Bloomberg is somebody that wants to knock out the Second Amendment. Hillary is a disaster on the Second Amendment. No, they want to -- They want to take it away. So it's just not going to happen. It's not going to happen. You have to get out and vote. So important. But when we lost our wonderful justice, who is a great man and a great Second Amendment person, I just heard coming up, you know, the senators we've been very disappointed. I'm a Republican. Many of you are Republicans but we're not being protected whether it's a budget. You saw the budget that was approved a month ago. It's approved by the Republicans. They gave it away. They gave Obama everything. So Obama wants to put in a Supreme Court judge and the judge that he wants is going to be a very negative person to guns because that's the way it is. OK. Believe me that'll be the way it is. And basically, they don't have the right to do that. But I keep saying, \"Well are the Republicans going to fail? Are they going to crack? What's going to happen?\" And coming up today I'm hearing Well there could be a way of Obama pushing it so here we go. Right. Here we go. Same thing here with Obamacare. It's going to be defeated. It's going to be repeal we're going to repeal and replace Obamacare. Believe me. But I mean, look at what's gone on with your premiums 35, 45, 55% up, your deductible is so high. We -- I mean you've got to see that truck right there, you're going to get hit by that truck in order to ever use it. So I come up and I'm hearing that Obama now who said, by the way, yesterday, \"Donald Trump will not be the president. He will not be.\" That was a compliment. Look, he's been -- he's been perhaps the worst president in the history of the United States. It's a compliment. But he was all over the place yesterday. Said, \"Donald Trump will not be.\" I think we have maybe a little surprise in store and we start right here in South Carolina. You know, New Hampshire was so amazing. We had a big big victory in New Hampshire. Amazing people. And then we come down here and I said you know I think we have an even bigger lead over here. And the people have been incredible no matter where we go to speak even this I know that four years ago you had about 200 people here for the same kind of a thing for your front-runner and he's a good front-runner and a good guy. And he did well but you had 400 people 200 people you have thousands of people here. And we just appreciate it and I won't forget it. Believe me, I'm not going to forget it. I'm not going to forget it. So I hear that they're talking about trying to get a liberal judge and a judge that does not like the Second Amendment. A judge that and this is one of many. This is one of many but a judge it doesn't want to do a number on the guns and you know how important it is. We're just not going to let it happen. OK. It's not going to happen. And if we get elected, we know that. But we have nine months, 10 months to go. We have to have the Republicans hold fast because I'm just hearing these little cracks saying, \"Well maybe if you appoint somebody, maybe we can get along. Maybe.\" It's not the way it's supposed to be. Now, it's possible that they'll have their wish because if they win they're going to be having their choice. But if they don't win, we're going to start really taken back because we have three or four or five, maybe, Supreme Court judges. This was not supposed to be one in question. This was a very sad circumstance that happened with. I mean, really, to me it was a very sad circumstance. But now what's -- we're going to see what happens. I will only tell you this, we are doing well. We have a really good chance to win. If we can win in South Carolina we're going to go -- I mean, we could very well run the table and I don't know if you saw -- I guess a lot of you have seen, actually, next week in Nevada. It's going to be phenomenal. The relationship there and to the people -- Bush is -- That's right. Bush is 1% in Nevada. This guy, why does he just give up. Just go home. Go home. Go home to mom. Got to go home to mommy. Yeah. Bush is only at 1% in Nevada. A couple of them are you know a 10, 11, 12 and I am at like 40 something, 48. So. So I think we're going to do well. Then we have the SCC. We're gonna have the SCC, which is gonna be, I think amazing. But it really now we're starting. New Hampshire could not have been better, they gave us a tremendous send off they really started us on a way, and we did well in Iowa, I mean, some votes were stolen from Ben Carson, which by the way was a disgrace. What -- what Cruz -- what this guy Cruz did with Ben Carson was an absolute disgrace. What he did was that he stole, it was theft, and then they come out with a voter violation form, which is a fraud as far as I'm concerned, and what he did with that whole thing was a disgrace. So we're not going to let that stuff happen anymore. I mean we're not going to let it. We will not let it happen. We're all watching, you're all watching. Keep your eyes wide open. These politicians, there's this guy he raises the Bible and yet he tells fibs he tells lies and then he does this stuff to Carson and he does other things, very bad. So politicians are bad people. Boy, they are bad. Would you believe it? So we're not going to let it happen and we're going to get in there and I just want it -- So Saturday, go out and vote because this is going to be the place that's going to really make it. And honestly, I've been watching all the pundits. Now the bad news is they're always wrong. They all said I'm not running and I ran. Well how is he going to do and he's just doing it for fun I'm not doing this for fun. Believe me. I love this location but I know I could be someplace else, OK. I could be someplace else right now. I could be very happy but I'm doing it because you know the expression and I see all the hats in the audience, Make America Great Again. We are going to make America so great. We are going to -- we are going to win again. You know we don't win very much. You're very tough, smart people, you like to win, right? This guy over here like to win. And we don't win anymore. We used to win, we don't win anymore. Well we're going to start winning again. We're going to start winning again. So Second Amendment protected. Common Core, we're going to end Common Core. We're bringing we're bringing your education locally. It's going to be fabulous. I don't know if you know and you've heard me say we have the absolute worst -- We spend No. 1 in the world on education, right. No. 1, per pupil in the world, there is no second place because we're so high so much higher, you have China, you have Norway, you have Denmark, you have Sweden, you have these countries are the best in terms of education and they're on the list, the best. No. 30th, in the top 30, we're No. 38, OK. We're No. 1 in cost. That's a little bit like what I'm doing. I'm least spent money. You know I'm funding my own campaign, right. So -- So I don't have a lot of the people coming to me. You know, the drug companies and all that. Because if you would see the kind of waste fraud and corruption in the United States, a lot of it isn't really waste fraud and corruption. It's the fact that people that are running against me and people in the Senate people in Congress, they have tremendous power because they have people giving them unbelievable campaign contributions and their special interests and they do what those people want. And that's one of the reasons our budgets are out of whack. The military is out of whack. The military orders equipment they don't even want and the stuff they don't want they don't get because the company that makes that equipment is like, you know, it's not politically adept and companies that really are, they make the equipment we don't want. It's going to all change because I'm not getting money from any of these people. I don't give a damn, I mean, we're going to do the right thing. You know we're going to do the right thing. We're going to do absolutely the right thing I tell you a little story. So the drug companies, we are the largest purchaser of drugs in the world the United States. We put more -- which makes a lot of sense, I guess. But we purchase more drugs to make you better, drugs to make you better. Not the kind of drugs that come over the southern border, which we're going to end, OK. We're going to stop -- We're to build the wall. Yup. Folks, by the way, we're going to build the wall, and who's going to pay for the wall? That's right. You better believe it. We have a trade deficit with Mexico of $58 billion and these characters come up these politicians that I'm running against. You don't really think Mexico's going to pay for the wall. I said, \"Absolutely 100%.\" They said, \"How are you going to get Mexico to pay.\" And I don't want to go into it because they won't understand it. I mean, it stamps no concept of business. They have no -- you know the 150 billion we gave to Iran. These people have no concept. We have a $58 billion trade deficit with Mexico, OK. There was going to cost $12 billion, maybe less. If I build it will be taller better and less, OK. So you think of this. So you think of this. So they say, \"How are you going to possibly do it.\" They make so much money, plus we give them subsidy. They make so much money from the United States it's going to be one of these things and I don't know if you heard one of the presidents or ex-president of Mexico held a news conference. He said,\" We will never ever, ever pay for the war.\" And the press called me. They said they said they will never pay for the wall. I said, \"Who was it?\" \"Calderon.\" He's a very nice good guy. He said, \"Tell him the following. The wall just got 10 feet higher.\" I mean it. Got 10 feet higher. They're going to pay for it. And I get along great with Mexico. The problem is, I mean, they buy apartments, I have hundreds and hundreds and even thousands of workers are Hispanics I'm doing great with. We have such an amazing relationship with Hispanics and they're great people. The problem is the leaders of Mexico are too smart for our leaders. They're too smart. They're too cunning. You look at what's going on it's unbelievable the border is a disaster it's a sieve, it's like people flow over. Not gonna happen anymore, folks. People can come into our country but they're going to come in legally. They're going to come into a process. They're going to come in. They're going to come in legally. So with trade we're going to solve the trade problem. I don't know if you saw a Carrier air conditioner announced two days ago, they're moving to Mexico. Nabisco. They're moving their big plan from Chicago to Mexico. Ford. They're moving this massive complex, you're building two-and-a-half billion dollar plant and now they just announced they're building it bigger. I've been talking about this for two years. Yesterday the Wall Street Journal announced they're building it bigger. In other words they're doubling down. You know why nobody does anything about it. I'm gonna do something about it. So I watched somebody show what would you do about Carrier because that was a sad case. Somebody used their cell phone and they would tell him, \"You know you're out of work, you're out of jobs, you forget it, it's over.\" We're moving to Mexico and the people are crying, grown men that have been there for a long time, really incredible people, and they're crying and they're devastated and they lost their job, they'd never had another job and now this plant is this whole thing's moving to Mexico. And they said, \"What would you do.\" I said, \"Tell you what I'm going to do.\" because you know they talk about free trade I'm a free trader but I say, \"Oh, if I put a tax on these characters these, you know, idiots.\" These, I mean, they're like stupid they say, \"Donald Trump is not a true conservative because he tax.\" We've got to make -- you know it's got to be fair. , folks. It's got to be fair. I'm a conservative person. Hey, I'm the most conservative on the border. I'm the most conservative with the military. Nobody's tougher than me. I'm the most concerned. We're going to -- we are going to make our military so big so strong, so powerful. Nobody's ever going to mess with us, folks. We won't have to use it. I'm the most conservative on taking care of the vets. Our vets are treated horribly. We're going to take care of -- I'm the most conservative on Common Core. We're ending Common Core. I told you that and we're moving it locally and nobody is more conservative. We call toughness but nobody is more conservative on the Second Amendment. So all of these things but with -- with Carrier, so they have in and they're coming across and they're going to build a plant and probably get some subsidies from Mexico. Probably -- we probably even give them subsidies. They probably have the United States giving subsidies to move out of the country. That's how stupid it is and that's how stupid we're run. So what happens is they said, \"What would you do?\" It's very easy. We call them we say let's have a meeting. Here's the story, folks. You moving to Mexico, congratulations. But if you don't say the United States you can have a problem. But here's what you do it. You want to move to Mexico, build your factory, it's gonna be wonderful. Hire your people they're not from the United States. All those people are now looking for jobs and those are good jobs. You know we're hiring a lot of part timers now. We're hiring and the numbers are totally phony. The 5% totally phony numbers. So I say, \"Here's what we're going to do. Very simple. You build your plant in Mexico enjoy yourselves and you're going to sell their conditions and just have them cross the border and sell them to the United States. No you're going to pay a 35% tax on every air condition.\" It's true. The only thing you can do. And you know what? It's the only thing you can do. There's nothing else because otherwise how are you going to get him to stop. And then you have the devaluations with China the all time -- they're like grand chess masters or grand -- I mean these people are the greatest, the greatest in history. They're Grant masters of -- of that, devaluation. They devaluate -- they devalue their currency. Japan's doing very well too. They're killing Caterpillar. You know they're rotting Komatsu tractors now because they're -- they've devalued. You take a look at what's happened to the yen and it's very hard. A friend of mine is a big excavator, you all know excavators, I love excavators. This guy's a very big when he buys Caterpillar tractors all the time and excavators. He just put in a big order for Komatsu. Not that he wanted to. He said, \"Donald they made it impossible for me not to buy. They've devalued the yen to such an extent, Japan, that it made it -- I mean I owe it to my family, to my company, to myself, I have no choice.\" And he was like depressed. He want to buy Caterpillar. I said, \"What's the difference?\" He said, \"They're both good, Caterpillar is better but I couldn't help but do this.\" Well China is doing that times a hundred times a thousand. And what they're doing is the devaluation of their currency makes it impossible for people to compete. We can't allow that stuff to happen. Look when we send stuff over to China it doesn't get in. If it does get in you have to pay a big tax when they stuff it. You know it's not supposed to be that way. You know it's supposed to be free trade. It's supposed to be, they come,w e go, back and forth. They devalue their currency and on top of it they make it impossible. I have a friend who's a great manufacturer. He said it's virtually impossible to get his goods and he makes better stuff than they do. He can't get his goods into China. When he does get them in, has a tax to pay. I have a friend who actually bought an airplane and he can't get it into China because the tax is so massive, he's going to sell it now at a big loss, OK. Well, and think about Boeing. By the way, think about Boeing. Boeing is building plant over here. Boeing just had a big order from China. But China is making them build a massive airline facility, right? Massive. Like bigger than anything you've seen. OK. You feel good about Boeing right now? Tell me in five years unless I'm president, you'll be fine., don't worry about it. But tell me in five years you're going to feel good about Boeing because I'll tell you what's happening. They are going to build that plant. They're building it. They're building it. It's going to be finished soon but they're going to build that plant. They're going to devalue the hell out of their currency and all of a sudden you'll be really a big front page story all over the place that Boeing's going to leave, right, South Carolina. They're gonna make all their planes in China because that's what they do. That's what they do. And our leaders aren't smart enough to stop it. OK. I have Carl Icahn endorse me. Great businessman, very rich guy, very, very successful. I -- If I told Carl, \"Carl do me a favor, I want you to watch over China trade.\" We're going to be in great shape. We have, right now, people that have no concept of what they are doing. They have no concept of what they're doing. They're political hacks. I mean that's what they are. They're political hacks and these are the people that are negotiating with these people from China and again China likewise, I get along great with China. Largest bank in the world, my tenant. They buy condos for tens of millions of dollars. I have the Bank of America building in California I own a big chunk of that I got that through China, through a very complex set of transactions but through China I mean, I think China is terrific. I'm not angry at China. I'm angry at our leaders for not being able to compete with China. I'm not angry. So we're going to get things changed around. We're going to use our best people. We're going to make it, we're gonna be so smart and we're going to start winning again. We're going to have strong borders. We're going to have strong military. We're going to take care of our vets. We're going to have such great trade deals. We're going to win again. We're going to win again. We're going to win so much. And you know, and by the way, we have to get rid of ISIS and we have to get rid of them. Yes. I was against the war in Iraq from the beginning. I was against the war in Iraq. We shouldn't have done it. We did it. Then Obama got out the wrong way. We shouldn't have done Iraq. We did it. It destabilized the Middle East. Exactly, if you go back you could see 2003, 2004, I said is going to totally destabilize the Middle East because you had Iran and Iraq and there were the same militarily. They fight, fight, fight, bomb, then they'd rest. Then they fight, fight, fight for years and years and years. They were the same. We decapitated Iraq and now Iran is taking over. Not only did they get the $150 billion, maybe the worst transaction I've ever seen negotiated. No, no. Done by the famous Obama administration, the worst -- the worst the dumbest, one of the dumbest deals I've ever seen. And we get nothing, we get nothing. We should have gotten those hostages before we started even negotiating, not now. We should have gotten them years ago. But if you look at what's going on and now on top of that we gave them Iraq because Iran is now taking over Iraq. It's just taking it over. We -- So here's what we did. We spent $2 trillion, thousands of lives lost, wounded warriors who we all love all over the place and the best people, the most incredible, tougher than all of us these people. I mean, what they've gone through. So the wounded warriors all over the place, you know, we have nothing. We have nothing. We have absolutely nothing. So here's what we're going to do. We're going to change things around. We're going to be smart and we have to. We'll do what we have to do in terms of ISIS and all but we have to start rebuilding our country. We have $4 trillion in the various places, $4 trillion. Not going to happen anymore. We're going to have a strong military but we have to rebuild our roads, our bridges, our tunnels, our schools, our hospitals. I mean our country is like a Third World country. You go over to Qatar and you go over to some of these places in the middle east, you go to China, you see the airports, you see the bridges. They have bridges that are so incredible, you've never seen anything like it. They have railroad trains that go 350 miles an hour, and we have things that go chug, chug, chug like from 100 years ago. We've become like a Third World nation because we're fighting everybody else's battles. And remember this we are like the policemen of the world. But we don't get paid anything. We protect Germany. We protect Japan. Do you know that in Japan, if we get attacked we have a treaty with Japan. If we get attacked they don't have to do anything. If they get attacked we have World War 3. We have to protect them. OK. I mean, who makes these deals? We protect, as an example, South Korea, you have a maniac right next to him , right, but we protect South Korea. So every time we order televisions they come from South Korea. They make a fortune. We protect South Korea. Let me tell you something. Why aren't they paying? They pay peanuts for what we do. Every time this guy, you know, raises his head, we see our ships start to sail our soldiers get ready. We have 28,000 soldiers at the border. So we take care of the world, we don't get it. Saudi Arabia, before the oil went down. They were making $1 dollars a day, 1 billion a day and we rent space so that we can help them. We rent military bases, we pay rent and yet without us they wouldn't last for two weeks, they'd be gone. So we'll change all that stuff, folks. I mean, we want to be good. We want to be fair we want have heart and we're not going to let these Syrian folks in. We don't know who they are. We don't know where they come from. They're not coming into this country. They're not coming in. You know, you have a lot of them, I don't know if you know it. You have a lot of moving to South Carolina. I don't know. Have you heard this? And you want to tell your governor don't let him move to South Carolina you don't want him in South Carolina. And I know they'll say, \"Well we have nothing to do. We're -- we're state government we're -- \" Let me say something. If a governor from a state didn't want to have him, I don't care what it says. You don't have to have them. But we don't know where they come from. We want to help them with safe zones. We want to get the Gulf states to pay. I don't want to pay. We owe $19 trillion. We owe enough. We can lead it. But let the Gulf States they have so much money they don't know what to do with it. Let them build safe zones. Look at what's happening in Germany, it's a mess. Look at Sweden. Look at Brussels. In Brussels you go there 20 years ago, 15 years ago was incredible. So when I call for moratoriums and I call for this -- first day I get hit with tremendous heat, right. Then everybody says you know he's right. Same thing on June 16th I announced got to stop illegal immigration. The heat I took was unbelievable. Three or four weeks later they're all saying, \"You know Trump is right.\" Then you had Kate killed in San Francisco, beautiful Kate by an illegal immigrant. You had Jamil in Los Angeles killed, incredible guy, I mean, young man, wonderful father, he's a friend of mine, a great guy. You had the veteran 65-year-old woman, a veteran, raped, sodomized, and killed in Los Angeles by an illegal immigrant. Got to stop it, folks. We got to stop it. We've got to be smart. We're going to be a country again. We're gonna be a country again. So I just want to thank this endorsement meant so much to me from these two guys and -- and from the whole community. I just want to say get out and vote. We're going to do something that you're going to be so happy with we're going to win so much and we're going to make America great again. That's what we want to do. Make America Great Again. So Saturday get out and vote. Thank you. We love you all. Thank you very much. Thank you. Thank you very much, folks. Thank you. Thank you very much."}