{"id":452,"author":"Donald Trump","title":"Speech: Donald Trump in North Augusta, SC","date":"2016-02-16","link":"https://factba.se/transcript/donald-trump-speech-north-augusta-sc-february-16-2016","paragraphs":["How nice is that? What a nice woman. She just -- just a great family. I had never told this before. I figured I could do it a lot cheaper than paying off the mortgage. I found out the name of the bank. That was a mean banker, I want tell you. That was a mean. Then I called up. We're gonna take you through hell.","We're gonna this, we're gonna that. I couldn't get the guy to cut, so I bought the mortgage. I said, the hell with it. I never told that story before. I thought it was gonna cost me a lot less money but it was all right. These two great woman passed away, but passed away very happy and it was just nice. I haven't been involved in that in a long time.","But I love to do things. I do a lot of that and I don't talk about it. I don't like to talk about it, but it's good to do things like that for people. It's nice. It's nice. Makes you feel good. So I just want to thank everybody. This is such -- look at the crowd. Look at the people prying like it's pouring in. But it's just been an amazing experience.","Being in South Carolina is -- you know, I have so many friends. I've been here many times. I do like Myrtle Beach, by the way. Great place. Great place. And even though Augusta is a little bit on the other side of things. It's not a bad place. We have to say, right? And you have a big, big event coming up there very soon.","We always do. And I know you get a lot of -- a lot of the -- a lot of the profits go right in your own pocket. So that's a good thing, but it's one of my favorite events of all events, of all sporting events. Truly one of my favorite events. So it's an honor to be with you, folks. And you know, we have such a big decision to make and it's just so important.","Saturday is going to be a really important day. As you know, we won New Hampshire big. That was a big one. And just had an amazing time up there. We were expecting to get 28%, 29%. We ended up getting 36% in the polls and it was, it was amazing. We won every single category. We won rich. We won poor. We won middle and we won heavy and thin.","We won every -- I mean we won women. We won men. We won highly educated and we won the people with high school and people with less than high school. And we won every category and it was an amazing, it was an amazing period of time. And they're great people and we have great people. It's just incredible.","And I knew New Hampshire pretty well and I know South Carolina pretty well. I mean beyond the political stuff because I have so many friends that live here. It's one of the beautiful places of the world. And really very important politically because I think if we can win on Saturday -- you got to vote on Saturday.","Oh please. Please. Get out and vote. You know, I kid. I kid but perhaps, I'm not kidding. I started out by saying, you know, the story, right? If you're sick. If the doctor tells you you're not gonna make it. You don't have a chance. But you can't get up and your wife tells you, she doesn't like you anymore.","She fell in love with another man. It doesn't matter. You got to get out of bed and you got to vote, right you've got to vote. It's true. Now, you have to get out and you have to vote because it's so important. And you know, you've gonna have a lot to do with -- it's called make America great again. These politicians are not gonna do it. The politicians are not gonna be able to do it. I know them.","I know them. They get taken care of by the lobbyists. You saw that with the debate. I walk on stage. I've got like this huge poll number. I walk on stage. Everyone is very quiet. Although my kids and my wife, they were going crazy but you can't really do -- it's sort of wild. That was a wild time. And I love the debate, and we got very good reviews on the debate.","But the room was stacked with special interests and lobbyists and all these guys that pay the candidates money. And every time certain of the candidate, in this case, it was Bush and Rubio, every time they said something -- I agree. Well, it's not gonna happen. It's not gonna happen with them.","But every time they said something, they got like applause. Bush made a statement. It was like this jumbled up statement with all sorts of -- I mean, it was ridiculous and everyone said, yay, yay, yay. And I was the one -- I gave two very highly conservative judges really. And people go, you know, it's fine.","But I mean that's to a certain extent the RNC fault. But they let the tickets get away and they shouldn't have that. I mean, we shouldn't have a thing like that. Now, you have to call them out. So I called them out. I said, you know, that's the lobbyist and the special interest in the audience. You want to see that audience.","That was the richest audience I think I've ever seen. The heads of the drug companies. The heads of the electric companies. The heads of every, every special interest you can imagine was in that room that night. And I'll tell you what. I'm honored to represent you people. I'm self-funding. I'm putting up my own money.","I'm honored. I'm honored. You know, it's time. Don't forget I was on the other side of the equation before June 16th. On June 16th, I came down the escalator, famous ride. I always say you've never seen so much press. You look back and you saw that press and I said, man, that's like the Academy Awards. The day June 16th in Manhattan at Trump Tower.","And I said to -- we have to do it. You know, I'm watching the Iran deal where we've given all this money away, right? $150 billion for nothing. $150 billion -- think of it. We're giving away $150 billion and we get nothing. We get nothing. And now, if you look, Iran is taking over Iraq on top of everything else.","They're taking over Iraq. We should have never been there. Now, I should get something for vision because when I did it, when I said it, people disagreed with me. But I said -- and I'm the most militaristic person in this room, believe me. Our military is gonna be so big, so strong, so powerful. Nobody is gonna mess with us. Nobody.","But we've been over there folks for 15 years and we're beyond zero, if you think. We are in worse shape now than we were 15 years ago, right? If our politicians went to the beach and did nothing, we'd be in better shape. Saddam Hussein. Saddam Hussein, no good guy and all of them, no good. But they kill terrorists.","Saddam Hussein killed terrorists. That's what he did. Now, Iraq is a haven for terrorists. If you want to go to Harvard of terrorism, you go to Iraq, OK? And you know so it's a shame. And after all of these years -- now with that being said, we're there and we have ISIS. And we got to do something about ISIS because these are people chopping off heads of Christians.","They're chopping off heads of anybody frankly, and we're gonna knock the hell out them. We're gonna knock the hell out of them. We have to. We have to. We shouldn't have been there. And Obama shouldn't have gotten us out the way we got out, OK? You don't tell people the date that we're leaving. Can you imagine General Patton or General Douglas MacArthur -- George Patton.","I mean this guy was so tough. So he couldn't be a general today because he was too nasty and he wasn't politically correct. And he would say things that people said, well, that's not very nice. And yet his men and women -- but in those cases, it was men. In all fairness, it was men. They didn't have too many women in those days in terms of the infantry.","But his people, his soldiers they died for him. They would die for him. But they loved him. But a guy like that today may be not politically correct. I don't know but I want that kind of a guy. That's what we need. That's what we need. I watch some of these guys being interviewed. They're retiring. They always go on the talk shows.","I don't want my generals on talk shows. You know, they'll say things and we have to be like, you know, a little bit secretive, a little bit something. And they'll tell us about the military. One of them said -- General Odierno, a good guy, but he's retiring. He's on one of the talk shows a few months ago and he's talking about how weak our military is. I don't want a guy -- even if it is, I know it's weak.","It's depleted. It's depleted. But he said, it's the weakest it's been. It's the weakest it's been since its inception. No, I don't know. Does he mean from the beginning of the -- it was an unbelievable statement. He said it's the least prepared, preparedness. I -- honestly, even if it's true, I don't want people to think that.","Does that make sense? You know? We wanted just sort of say we're great, great, great. And then at the end, we're gonna be great but they got to give me like a year or two to get there. We've got to be strong. But I don't want people saying it's weak. I don't want it. They have no right to say that even if it's true.","I mean, it's true you don't have to talk. You have to say they're wrong, but you don't have to talk. And these generals they talk. One of them was on one of the shows, a very big general and he was talking about ISIS. He just telling, oh, it's very tough. Well, how can we defeat them quickly? Oh, I don't know.","I mean, if I'm ISIS and I watch this guy. I'm saying, man, this is like great. This is great. We're not like the same country anymore. We don't win anymore. We're gonna start winning so much. I am so sick and tired of losing. I mean, I see it so much. I see it so much. And I don't want to use the military.","Now, remember this. I'm the one that was -- the one person that didn't want to go in. We are going to be respected again. We're not respected. Our leaders are not respected. Our leaders are not respected. Obama is not respected. Hillary Clinton is a joke. If she gets in, she's like a joke. You know, I turned on last night.","I'm sure you saw it. I'm watching television and I see her barking like a dog, right? No, she's barking like a dog. And everyone said, oh, wasn't that wonderful? Wasn't that wonderful? Isn't that cute? Isn't that great? If I ever did that, I would be ridiculed all over the place. I won't do it. I'm not gonna imitate her.","But she's barking like a dog and they're saying wonderful. Trump does it. Believe me. You'd read about it. What's wrong with Trump? So there'll be no barking. But we're gonna be respected again. We have to be respected again. And every single country in the world has taken advantage of us, every country that we do business with.","Our trade is a disaster. We're gonna lose $500 billion with China this year on trade deficits. Think of it. Think of it. We can't do it. You're right. We can't do it. We can't do it. We can't continue. Japan with their cars. They send them in like they're candy. Like their candy. I go to Los Angeles. I see some of the boats, the biggest ships I've ever seen.","The cars are pouring off like at 40 miles an hour. Just wow. Wow. Boom. Next boat. I mean, what are we doing? What are we doing? Do you know we defend Japan. We defend Germany. Well, a lot of people don't know. Does anybody know that we defend Germany? Do people know that? Most people don't even know it. We defend Germany.","It's a behemoth, meaning an economic behemoth. Of course, if Angela Merkel keeps allowing the migrants then it's not gonna be a behemoth. It's gonna end up in a civil war. What she's doing is insane, by the way. It's insane. What she's doing to Germany -- I have a friend German, very proud of being German, and he said he's moving out of the country, OK? Can you believe this?","I don't know what happened with her. You know, I build -- what you do, you build a safe zone in Syria. You have the Gulf states, who are putting up no money. You have the Gulf states put up the money because we're not putting up the money. We owe $19 trillion. I'm not a politician. You know, I like just be careful with the money.","We're not putting up the money. They are -- they have tremendous amounts of money. You know Saudi Arabia before the oil crash was making a billion dollars a day. Hard to believe. I mean money like nobody has ever seen before. Funds like nobody has ever seen before. They were making a billion dollars. And we defend them, they pay us peanuts.","We have military bases. We have to pay rent. We pay rent and we defend them. And I have great friends in the Saudis. They are great. Wonderful. Everything's fine. But why? I even say, why aren't you paying us for this? So we defend them. When somebody comes around and watch, watch Iran. So they're taking over Yemen.","They don't want Yemen. But what's on the other side of that long, long border? Saudi Arabia. They want to go into Saudi Arabia. They want the oil. I know what's gonna happen. Not if I'm the head. That's not gonna happen but that's OK. But I know what's gonna happen. But they've got to pay for us and we can't do this stuff anymore.","We protect Germany. Germany -- who doesn't have a BMW? They have BMW. They have Mercendez. But you look at, you look at what's going on in the car business and you see what's happening. You see our business is moving over to Mexico. You see other people are moving into Mexico. Mexico is gonna become the next China on a smaller level.","But you take a look at Germany and you say, why are we defending them? Now, it's wonderful to defend them but they've got to pay something. Now, you look at our budget. You know a lot of people say that all we have this big military budget. Well, we do. We have a massive -- much bigger than anybody else's, but much of it is to protect other countries.","So we defend Japan. So here's the deal with Japan if we're attacked -- we're attacked, for some reason, oh boy, would they be crazy. If I'm president, would somebody be crazy to attack us? Oh those poor people. Oh, anybody and we don't need Japan to help us. Believe me. We wouldn't need Japan to help us. Now, if Obama is president and we get attacked.","I feel sorry for you, OK? But so with Japan, if we get attacked, Japan doesn't have to do anything, right? If Japan gets attacked, we have to go and defend them totally, probably World War Three, OK? Japan gets into a war with China. We have to defend Japan, OK? But we get in a war with somebody, they don't have to do anything.","Not exactly the kind of deal that I'm used to, right? We're gonna change things around. We're gonna change things around. I'll give you another example, South Korea. So we have a border. We have 28,000 troops. I wouldn't want to be a troop on that border with this maniac on the other side. 28,000 troops on the border, right?","He's got nuclear and all of this. You ever notice the Iran deal is horrible and they don't have nuclear. They will soon based on that. They'll just buy it. They don't have to do anything. They can buy it. They have so much money now. But we're gonna do something about that. But remember this. So we have a border, and you have this maniac in North Korea and we defend.","And you know what we get? Every time I bought a thousands of television sets and air conditioners and all this stuff, it comes out of South Korea. They're an economic monster. They make a fortune, right? They make all the stuff. We used to make the televisions. Remember, Sylvania? RCA? We used to make this stuff.","We don't make it anymore. We don't make anything anymore. We're gonna start making things now. We're gonna start making. We don't make anything anymore. It's been taken away. But we defend South Korea. So every time he raises his head. He says, we're gonna this, we're gonna that. He starts throwing a rocket up in the air.","Half of the time, it doesn't get off the ground. But when it does, everyone gets crazy. And I say to myself, we send our ships. We start sending ships, everything else. It cost you a million bucks just to start one of those aircraft carriers up. Like, boom, $1 million, right? We get nothing. What do we get?","We get nothing. We will -- He says -- what? I didn't hear it. That's good. See, I'm not allowed to say that. Because if I say that, it becomes a front page story. So I refuse to say. But we are -- and think of it. We spend money to defend the world and we owe $19 trillion. And then we have our Republicans, who are more upset within the Democrats because the Democrats we know where they're coming from.","The Republicans approve a budget four weeks ago that gave Obama every single thing he wanted. Right? That's it. Who is that boo-er over there? That's a good -- Boy, you got a good voice. It sounds like Pavarotti. And I always say Obama is a lousy negotiator, but he's a great negotiator against the Republicans.","And we're Republicans, so we're gonna change all that around. Look, trade. Trade. We are losing a fortune. We're gonna have the best people. Carl Icahn, one of the great businessmen of the world. We have the best people. We have the best business people in the world. We have the best negotiator. We don't use them.","We use political hacks to make deals with China. China from the time -- they're three years old. If they see somebody is a genius, boom. Boom. Boom. It's like the pyramid thing where they just go up, up, up. And by the time they get to the top, we're negotiating with the toughest, smartest people you've ever seen.","And we have guys that don't even know what they're doing. Diplomats, we have Carolyn Kennedy in Japan. Caroline Kennedy, she's not trained for this. Caroline Kennedy. So -- and I always say she's a nice person. Who cares? You know why she's nice? Because my daughter likes her, Ivanka. So my daughter likes her.","But she's not negotiating for me that I can tell you. She's negotiating with the Japanese for cars. She didn't even want the job. She goes into the White House on 60 Minutes. You have to see it. She goes, yes, I'd love a job. Because they said, how did you get this job? They did a profile of her. She said, well, I went to the White House and I said I'd like a job.","What would you like to do? Oh anything. They said, would you like to be the ambassador to Japan? She goes, really? Yeah, I'd like that. You got it. Good luck. Can you believe it? Now we have a new -- that's how we pick our negotiators. And the ambassador to Japan has a lot to do. And then the rest of 60 Minutes, we're showing them wining and dining her.","By the time they finish with her, they'll have it -- they're gonna have an even better agreement than they have already. The thing that people don't know is we have all the cards because we are the pot of gold and they're draining us. We're not gonna have the cards much longer. We are the pot of gold. We have rebuilt China.","What China has done to us in terms of taking our jobs, taking our base, taking our money, our manufacturing. China has done one of the greatest bank thefts in the history of the world. It's like a bank theft. It's like a theft. One of the greatest, one of the greatest thefts in world history has been what China has done to this country.","Now, I love China. I love the Chinese people. I sell them condominiums. The biggest bank in the world is from China and -- that's a tenant of mine in Manhattan. I mean, it's fine. I don't object to China. I object to our leaders being stupid people. OK? They're stupid people. It's like Mexico is -- what's happening with Mexico is incredible because so many businesses I don't know if you saw what Carrier air con -- I bought by a lot of air con.","I'm gonna start buying Trane. I'm gonna buy Trane from now. Carrier air conditioners ended up closing up. They're closing up and they're moving to Mexico of 1,400 to 1,700 jobs. So you know by carrying them. But here is what we have to do. You ready, folks? 1,400 jobs, that's right. That's right. He's got a good voice too.","Let's see. Let's have a contest. Good voice. 1,400 jobs, 1,400 and here's what you have to do. OK. I'm a free trader. I want free trade. I love free trade. I love it coming and everything. But if you look at China, they sell to us no tax. We sell to them, you can't get into the place, OK? You can't get in. Boeing -- Remember this.","We're talking about South Carolina who -- which I love. You have a big Boeing plant and it's doing good and everything is nice. Be careful because China, in order to get an order of planes, China is making Boeing build this massive plant in China. And all of a sudden, you'll come up -- It won't happen if I'm president, by the way.","All of a sudden, you come up say, you know, Boeing wants to move all of their production to China and they're gonna be closing up and this is the way it works folks and you're sitting there saying, oh that couldn't happen. It can happen really easily because they devalue their currency. They are the greatest money manipulators ever.","They monetary manipulate and they are -- what they're doing is genius. They are world-class chess players with devaluation, and our country doesn't even know what to do. And the TPP, which is a horrible trade deal, that Obama is pushing along with some conservative Republicans, OK? And the reason it's horrible, the reason it's horrible is because they don't even talk about devaluations.","They don't even talk about monetary manipulation. And that's where they beat us. That's how they beat us more than any other place. We make better products than they do. They beat us with monetary manipulation. And I'll tell you one of the great achievements for me is gonna be when Apple starts, in particular, because they make everything.","I mean, you look at what they're doing. You go to China, you see some of these factories that are two miles long. When Apple starts building their things in this country, that's gonna be a big, big sign. A big, big sign. But you better watch out because Boeing, you know, you feel good about Boeing. All of a sudden, you're gonna find out that Boeing is gonna close up over here.","They're gonna build more over there. They're gonna make their big planes in China and it's bye bye to South Carolina. And that's not gonna be good. It's not gonna happen with me. It's gonna happen with any of these other politicians because two things. Number one, they're totally controlled by the people that give him the money.","Number two, they have no understanding about business. They don't know anything about corporate inversion. They don't know what's going on. You know we have corporations that are leaving the United States and nobody even talks about it. It's to me, one of the biggest problems we have outside of nuclear, outside of ISIS, outside of -- because to me that's always gonna be number one.","Boom. Boom. That's always got to be number one. It's got to always be number one, all right? But -- and I think that's one of the reasons I'm doing so well because everybody agrees I'll be, by far, the best on the border. Nobody. In fact, you know I got endorsed by Sarah Palin and I got it endorsed by Sheriff Joe Arpaio.","Now you know. He's a wild man. One thing you know about Sheriff Joe. If he endorses you, you are the strongest in the border. Do we agree with that? No, we're gonna create, we're gonna create real borders and we're going to build the wall, right? We're gonna build a wall and it will be a real wall. It be higher than that ceiling.","There's gonna be a wall. There's gonna be a wall that when you get up there, you're not coming down very easy. I tell you. Did you ever see that? I talked about it all the time. The ramp where they build a ramp over the little wall they have. Now, they have a little wall. They build a ramp. They have a truck, an SUV go loaded up with drugs: over, down, under.","They sell the drugs in the United States. So we get the drugs. They get the cash and it just keeps going on and on. Now, this is gonna be the real deal, folks. We're gonna have a real strong border. And people can come in, but they can't come in legally. They have to go through a legal process. They've got to come in legally.","They have to come in legally or we don't have a country or we don't have a country. So we're gonna do a lot of things and we're gonna do a lot of things to make us great again. I mean, great again. We're like a mess. We don't know what we're doing. Think of it. Bad on healthcare, bad on Common Core. How about your kids are being educated from Washington by bureaucrats who don't even give a damn.","They don't even give a damn. Your kids are being educated by bureaucrats. Now, some are good and some are -- you know, I'm sure maybe. But they're more interested in how much do they get. Common Core is over. We're gonna end Common Core. Education -- I'll give -- I'll give you an example. Education, we're ranked number 30th in the world.","We're number one in the world in cost per student by so -- we're so far ahead of number two that number two doesn't even exist. So you have Sweden, Norway, Denmark, China. These are like the top four. These are -- you know, they do a great job, all right? You have the United States at number 30, but number one per pupil in cost.","Common Core is out, all right? Common Core is out. We're gonna bring education local. And I've seen it, I've seen parents they're so in love. Even when their sons and daughters graduate from school, they stay because they love. You know, they're in love with the whole process being that their kids are gone, but it almost made it more romantic for them.","They do such an amazing job so that's it. Second Amendment is going to be so -- we are saving it. It is under -- Just so you know, the Second Amendment is under siege. The Second Amendment is under siege by so many different people. And you know, you look at the Democrats, I'll tell you what. You look at Hillary Clinton.","I don't know. Again, is she gonna get it? But if she gets it, it's like let's not have -- she doesn't want to have a second amendment in my opinion if you look. Michael Bloomberg may run. He's worse than she is. I hope, by the way, I hope Michael runs because -- yes. Oh good. OK. He's on my side. I thought he was a protester.","That's OK. Thank you. OK, well. OK. OK. Thank you, sir. Thank you. So I'll tell you what. So Second Amendment, it's under siege, totally under siege and we're gonna save the Second Amendment. And I'll tell you what, people want to destroy it. They're taking pieces out. Obama just did the Executive Order, chunk after chunk after chunk.","We're gonna save the Second Amendment. Now, if we had people in California where have the two radicalized young couple they talked about. Young couple. They got married. People -- they would -- they're terrorists. Radical Islamic terrorism. Whether you like it or not, a huge problem for the world, not just for us. And nobody wants to talk about it. I'm the only one that's willing to talk about it. And you know what, now everyone else is talking about it, too.","And did I take heat? Did I take heat? I took a lot of heat. But you know what? We have to do something and I said, we have to have a temporary moratorium. We have to find out what's going on here. You know we have people flying planes into the World Trade Center. We have people shooting for no reason. Look, we have to find out what's going on and we will.","We've gotta find out. But if you're not willing to talk about the subject, if you're not willing, like our president, to even refer to it or use the name, you're never ever gonna solve the problem. And it's a massive problem. It's a massive problem. So when I came on June 16th. I walked. I came down the escalator with Melania my wife, and it was incredible.","And during the -- except, you know, during the speech when I went and said I'm running for president, which takes courage. Let me tell you. It takes courage, especially if you're not a politician. You know, these politicians they run. That's all they do. They run. They run. They take money. They run more.","They lose. How about some of these guys? They lose. They have zero, zero and they keep running. I say, why are you running? Why don't you just stop? They keep running. There's got to be some game that we all know about but they run. So now we're down to six or seven people and it's getting good and we love it. You know what, we had 17. We originally had 17 people.","And slowly I love it, one after another after another, they're gone. And I talked about illegal immigration. And did I -- you talk about heat. That was heat times 10. Rush Limbaugh said, I've never seen any human being received so much incoming, meaning from those people. It was unbelievable. But, but after two or three weeks of like going into a cocoon, steel cocoon, people started saying, you know, Trump is right.","And then you had horrible things happen. You have Kate in San Francisco. Beautiful Kate shot in the back by an illegal immigrant. You had numbers come out that were horrible. What it's doing to the economy. You had other things happen. You had Jamiel, a young man, 17 years old, shot in the face by an illegal immigrant.","This is a guy that should have never been allowed in the country. Shot on for sport. This unbelievable guy, who I'm friendly with his father. His father is like this great guy. His father is, you know, his life can never be the same folks. You know, they say time. He told me the other day. No, time makes it worse, not better.","It will never get better. He's a young incredible kid, who is going to go to -- a good football player who is gonna go maybe to Stanford on a scholarship, and the whole thing is just so sad. Shot in the face. You had the veteran, the female, the marine, the veteran in Los Angeles was raped, sodomized and killed.","65-year-old woman raped, sodomized and killed by the illegal immigrant and so much more. And people start saying, you know, Trump is right. He's really right. We've got a problem and it's not. And remember, I say it and I'll say it all the time. We want people to come in legally but we've got to vet these people.","Look, we've got to vet these people. I mean, we have people where we draw from lotteries, lottery. Why? Who the hell wants lotteries? I don't want lotteries. We want great people coming into this country. We have to have great, great people coming into this country. It has to be like an honor, and it has to be an honor for them.","You don't want to come in because they just happen to be there. So we're gonna stop. We're gonna stop and we're gonna get smart. And we're gonna have people come in, but we're gonna have people come in through a process that's going to be a fair and equitable process. And the bad ones, we have some people in this country.","We have as of last week it was reported 179,000 illegal immigrants, who are criminals. OK? Think of it. Think of it. We have -- think of that what that means. This was as of last week. 179,000 -- Thank you. Who is that person that stood? That was so great. Who is the person that did that? Put up your hand.","Put up your hand. I want to -- come on. Bring that person up here. I love them. Come on up here. Come here. Come here. So amazing. Isn't that terrible? See, that's what we're all fighting for that. Isn't that terrible? And you know what, the press will put that -- look, see the cameras now are moving because that's the only way they ever see the crowd.","Isn't that -- isn't that terrible? To me -- Now, they won't say that. If I say, oh hell. They say, oh Trump used a horrible word. That person does that with their hands and fingers and they won't report that. It's disgusting. It's disgusting. It is so disgusting. And I'll tell you what, the press should be -- they should be ashamed of themselves.","I want to see -- No, they should be ashamed of themselves. It's disgraceful. Who is the person though? Raise your hand. Who is the person that took action over there? Come here. I love these guys. I love these guys. I love these people. Come here. Come here. Come here. Get over here. Look at this guy. Come here.","Come on up. Bring him up here. That's all right. Bring him up. I want him come in. Bring him up too.","Thank you. He's a great public speaker this guy.","Great. I mean that's so cool. But -- Think of it. I see this, guy nasty language, really horrible language, which won't be reported by these guys. Really horrible, horrible language, for what? You know, when you think of it, we're all after the same thing, right? Whether you're Democrat, whether you're liberal, Republican, conservative, whatever you are.","We want safety. We want a good military. We want our vets taken care of. We want borders. We want education. We want homes. We want to be able to eat and live and have a nice life. I mean, you think I could talk to somebody like that in 10 minutes but a lot of them don't want to listen to it. You know a lot of them have bad thoughts beyond -- I'm telling you, there's something going on. But you hear the filthy mouth and I don't know, all of a sudden, I see fist starting to fly.","Saw like about four of them. And a rough cookie. This was not an easy guy. I looked at him. I said, that's a rough cookie. The other guy. And then he puts his fingers in the air, you know. He wouldn't do it in front of those guys. Let me tell you. But I love it. I love people with courage. I mean, courage.","Sometimes you'll go and we'll go and stuff like that will go on a whole entire time. But I just respect those two guys a lot. So I want to thank you, fellows. Amazing. Really amazing. Really amazing. It's what we need. I really -- we need It. So you look at what's happening with our country where we're being beaten so badly and trade is so important.","Our military is, to me, look, it all goes this way. When I came down, it was about trade, it was about the borders and I did very well. And I've been sort of number one I think almost from the beginning, right? They all said, he'll never run. His life is too good. Why would he do that? Sometimes I ask myself that question actually.","But -- and then they said, well, OK. He just announced he's running. Then they said, he'll never sign Form A., right? Remember, I signed. That's where you sign your life away. Then they said, he'll never put his financials because maybe he's not as successful as everyone thinks. Turned out I'm much more successful.","I built an unbelievable company, very low debt. I filed almost a hundred pages of financial documents like this incredible company and the press was down there. They've gone over every inch of it. They've misrepresented as much as they could but they can't basically. It's an unbelievable company. That's the kind of thinking we need.","We have $19 trillion. We need somebody that knows how to deal. We need somebody that could get Carl Icahn. We need somebody that can get the great -- we have the greatest business people in the world. We're gonna use them. We need somebody that can do it. We can turn this thing around so fast.","We're gonna turn around and you're gonna be so proud of it. You're gonna be so proud of it. And then you see people like the two guys that just came up here. I mean, you know, to me, it's such an honor and we have so many people. We have so many great people in this country but they're not allowed. You take a look at small business.","I have a friend. He's a small businessman. There's no way can ever make it because of regulations. He's got regulations over regulations over regulations that are put in there. He's a farmer. He can't -- if a puddle develops in the middle of his area, they consider a lake for environmental purposes. He can't -- he has to walk around -- the whole thing is crazy.","He's showing me things. We're gonna get rid of regulations. We're gonna go back to being a real country. We make deals with China, environmental deals. You know, we have a president that talks about the ozone and he talks about all of the different things, right? All of the different -- and then he flies to Hawaii to play golf in a 747 with a four monster engine.","Think of it. And they're old engines too. They spew plenty and he flies back a few weeks later. It's a long round of golf. He plays more golf than people on the PGA Tour. It's true. So you know, one thing I say about that. You know, if you become president and you go to the White House, why would you want to leave the White House?","I mean, first of all, you got to work. You know, when he signs his executive orders that's because you couldn't even get the Democrats together. Couldn't get anyone together. You know, Ronald Reagan got together with Tip O'Neill and they got things done, right? The way it's supposed to be, you know. And there can be compromise.","You can't be just like, you know, this guy Ted Cruz. He stands in the tent. Did you see the senator from Oklahoma just came out with a statement. One of the most incredible statements. Here's a guy. He came out with such an unbelievably strong statement that Ted Cruz is the most dishonest person in the -- You know, I mean like the most incredible statement.","He's a Republican. That just came out. And what I'm telling you is true. I've never seen a human being lie so much. He lies about everything. He'll take your record like I talk to you about Obamacare. He'll say Trump loves Obamacare. Loves Obama. How do you fight that? Guy says he loves Obamacare. I hate Obamacare.","It's gonna be terminated. I just told you that. I tell -- No, no, but I tell it everyone. I am the strongest, I am the strongest of the Second Amendment. He said, Donald Trump wants to destroy the Second Amendment. I'm the strongest. I'm in the NRA. My sons are in the NRA. I'm gonna be -- first day in office, I'm terminating Obama's new executive order.","You know, another one. Having to do with the Second. So he's a liar. So at least I have, you know, the presence to be able to call out. You know, if -- and I hate to say it about a person. But actually during the debate, Rubio called him a liar. So I felt a lot better. Don't forget. Here's a guy -- Dr. Ben Carson is a good guy.","Here's a guy that during the election, during the caucus in Iowa. He went out and he told everybody -- what did he say? He said Carson is out. He's out. Vote for us. Carson's quit. He just left. He's not in the election anymore. Caucus for him, OK? And so he got thousands of votes because of that. Thousands and thousands of votes.","How dishonest is that? He did a -- It's called voter violation form. It says that if you don't vote for him -- essentially, if you don't vote for him, you've got a problem. It looks like it came from the IRS. It looks like a government document. I tell you one thing I learned. These politicians are dishonest people.","Wow. They are really, really dishonest people. They are really, really dishonest people. So I think he's gonna go down. I think a guy -- a guy can't be -- I'm a Christian. But you know -- Protestant. But you know, Ted holds up the Bible and then he lies about so many things and I mean these are lies.","These aren't like, oh maybe he is. What he did to Carson was a total lie. He said he didn't know about it but then he apologized. How about this. He apologized like an hour after the election. Oh wonderful. Wonderful. The election is over. And he said the guy was -- so we have to be smart. So important. We're gonna make America great again.","We're gonna make maybe America greater than ever before but -- and I don't want your money. I want your vote. I don't want your money. I don't want any money. I don't need your money. I don't need your money. And I want to take care of our vets. You have a big vet area here. We're gonna take care of them to a level, to a level.","These are our greatest people. We wouldn't be here if it weren't for the vets. And speaking of the vets, do I love our police? Do I love our police? Our police are not being treated with the proper respect. Believe me. Believe me. So we love our police and we have to cherish and protect our police too. And every once in a while, someone is gonna make a mistake or somebody is gonna be a bad apple.","Unfortunately, they play that on the news forever. And they don't play you know 100% practically good things that are done by the police. But we have so much support from the police. And you know, again, without the police, we're not standing here like this and things aren't the same. Believe me. So we have to pay a lot of homage to the police.","So the election is coming up, and you're gonna have a big part. New Hampshire was unbelievable. New Hampshire gave me a number that was greater than the polls. We were at like 30. And you know, this is 30 against many people. So 30% against many people. I get a kick when they talk about if the establishment ever got together and they put their numbers together, they'd be the same as Trump and maybe they could defeat him.","I said, wait a minute. If these guys quit, in other words, if they put all their numbers into one, right? I say, folks, these people -- I mean, these are the basic, like they're smart people. The press, I'm telling you, 20% are good. 25% they're OK. Some of them are the worst you've ever seen and the most dishonest.","I think Karl Rove is one of the most dishonest human beings. I'll tell you. One of the most dishonest human beings. First of all, he's a total bushy. He's a total bushy. Here's a guy that spends millions and millions on campaign and loses almost all of them. But I think some of the guys, George Will, Karl Rove.","There are some guys that -- Krauthammer is a disaster. Krauthammer is a disaster. This guy -- I mean, when I won New Hampshire like a landslide. Krauthammer said, well, it was all right. He didn't do that great. I mean, this guy is a disaster. But think of those three. There are some others I won't even mentioned their names.","Just a couple that are even worse than them, but they're really dishonest people. But let me tell you something. They say if this one got out and that one got out and if they all banded together and won, they could maybe defeat Trump. Then I said, wait a minute folks. If they've got 5%, 4%, 3%, 2% and they get out.","I'm gonna get some of those votes. And the guy goes, ooh. I never thought of that. Right?. It's like, it's like they get out. They're gonna vote for me. Some of them would vote mostly for me. They said they add them up 100% here, 100%, 100%. Here's a story. I'm gonna do a great job for you. I'm working for you.","I'm working for you. I'm working for you. Again, I'm not taking any of their money. They came in -- a man came into my office. He offered me millions of dollars, a lobbyist type. And he offered me millions of dollars. Don -- you know, when you're number one, I've been number one almost since I announced, OK? Because I did a great job.","I built a great company. I employ thousands of people. I've employed tens of thousands of people over the years and like places like Mexico. I have so many Hispanics working for me. I think I'm gonna win the Hispanics. I think I'm gonna win places like Michigan that aren't even in play for the Republicans, you know?","The Republicans it's very hard to win because structurally you're at a big disadvantage. You have a lot of disadvantages. I'm gonna bring states into play and win them easily that aren't even in play. Polls are coming out saying I beat Hillary so many -- I mean, I beat Hillary and I haven't even started on her yet.","I haven't even started. I mean, this guy Cruz comes out. Well, I don't think he's gonna win. This guy is so strident and so nasty he's gonna lose every single state then. Then Bush, poor Bush. He comes out. He goes, well, I don't think that Donald Trump can beat Hillary Clinton but I can. I say, well, why aren't you beating me? Why aren't you beating me? You know, I mean the guy gets up and they just say things.","He said the other day it was sort of incredible. So the numbers just came out in New Hampshire. So I got a tremendous -- I had a tremendous result. Won every single group, every single group. So I was at 36%. I think he was, what, a 3% or 4%. He spent, listen to this, $44 million in the state of New Hampshire.","I spent $3 million and much of that money I get back because it's four airplanes that I own. So I have to pay myself back, OK? No, can you believe it? So Bush spent $44 million or $45 million in New Hampshire, right? I spent $3 million and I won in a landslide against everybody. So I have 36, he has like four or five, six whatever.","You know, something that was so low. I didn't even get that. I didn't want to go that far down in the charts. And by the way, the only reason I mentioned him is because he spent $22 million on negative ads on me. Even now, I come here. I see this negative ad something. ISIS melting. He said all sorts of things.","They're wrong. They're just wrong. But it's -- you know the one I'm talking. It's a very dark ad. ISIS melting. It's all wrong stuff. I mean, it's all wrong stuff. So anyway. So here's what we have to do. Saturday is so important. We're gonna beat Hillary. We're gonna beat Hillary. We're gonna beat Hillary just like I'm beating all these guys.","You have some big polls coming out. Actually, a great poll came out today. A very good PPP, Public Policy Poll, came out today has us very high. 36 -- 35, 36. Everyone else is way down. But just assume that we're even. Assume that we're behind because you've got to go and vote. You got to go and vote. Assume that we're behind.","Some big polls are coming out today and tomorrow, but don't even look at them. Just assume that they're terrible. Because if they're terrible, you're gonna go vote more so. I give you my word. Look, we are going to do such a great job. You're gonna be so proud of this country. You're gonna be so proud of your president.","You're gonna be proud of your president because I don't need this. I don't need this. Like you, folks. I mean, you don't have to be here and I don't need it. I don't need. But it's just that I love the country. It's been so good to me. And you know, honestly, it's been so good and it's got so much potential.","If I didn't think it had the potential it had, if I didn't think it could be saved, I'd feel terribly but I wouldn't be doing it. I wouldn't do it because I'd say, well, wait a minute, maybe we can do something so spectacular. We have to let this country really go. We have to get rid of these rules, regulations, stuff that was put in for other reasons.","Stuff that was put in for the wrong reasons. Our banks aren't loaning anybody money. We have Dodd-Frank. It makes it impossible for a head of a bank to loan any money. The regulators are running the banks. We've got to unleash, and we've got to take back our deals. We've got to take back our people. We've got to bring back our jobs to this country.","We're gonna bring them back to this country. So I only say this. I love you people. We want to win. We're gonna win so big. And I just want you on Saturday, such a big day. You got to go out. You got to vote. And I guarantee you that this is the beginning. You're gonna remember this day and you're gonna say to yourselves, I remember that day two years ago, four years ago, 10 years ago, it's gonna get older and older.","And you're gonna say this was one of the great days of my life because this was the beginning of making America great again. I love you. I love you."],"text":" How nice is that? What a nice woman. She just -- just a great family. I had never told this before. I figured I could do it a lot cheaper than paying off the mortgage. I found out the name of the bank. That was a mean banker, I want tell you. That was a mean. Then I called up. We're gonna take you through hell. We're gonna this, we're gonna that. I couldn't get the guy to cut, so I bought the mortgage. I said, the hell with it. I never told that story before. I thought it was gonna cost me a lot less money but it was all right. These two great woman passed away, but passed away very happy and it was just nice. I haven't been involved in that in a long time. But I love to do things. I do a lot of that and I don't talk about it. I don't like to talk about it, but it's good to do things like that for people. It's nice. It's nice. Makes you feel good. So I just want to thank everybody. This is such -- look at the crowd. Look at the people prying like it's pouring in. But it's just been an amazing experience. Being in South Carolina is -- you know, I have so many friends. I've been here many times. I do like Myrtle Beach, by the way. Great place. Great place. And even though Augusta is a little bit on the other side of things. It's not a bad place. We have to say, right? And you have a big, big event coming up there very soon. We always do. And I know you get a lot of -- a lot of the -- a lot of the profits go right in your own pocket. So that's a good thing, but it's one of my favorite events of all events, of all sporting events. Truly one of my favorite events. So it's an honor to be with you, folks. And you know, we have such a big decision to make and it's just so important. Saturday is going to be a really important day. As you know, we won New Hampshire big. That was a big one. And just had an amazing time up there. We were expecting to get 28%, 29%. We ended up getting 36% in the polls and it was, it was amazing. We won every single category. We won rich. We won poor. We won middle and we won heavy and thin. We won every -- I mean we won women. We won men. We won highly educated and we won the people with high school and people with less than high school. And we won every category and it was an amazing, it was an amazing period of time. And they're great people and we have great people. It's just incredible. And I knew New Hampshire pretty well and I know South Carolina pretty well. I mean beyond the political stuff because I have so many friends that live here. It's one of the beautiful places of the world. And really very important politically because I think if we can win on Saturday -- you got to vote on Saturday. Oh please. Please. Get out and vote. You know, I kid. I kid but perhaps, I'm not kidding. I started out by saying, you know, the story, right? If you're sick. If the doctor tells you you're not gonna make it. You don't have a chance. But you can't get up and your wife tells you, she doesn't like you anymore. She fell in love with another man. It doesn't matter. You got to get out of bed and you got to vote, right you've got to vote. It's true. Now, you have to get out and you have to vote because it's so important. And you know, you've gonna have a lot to do with -- it's called make America great again. These politicians are not gonna do it. The politicians are not gonna be able to do it. I know them. I know them. They get taken care of by the lobbyists. You saw that with the debate. I walk on stage. I've got like this huge poll number. I walk on stage. Everyone is very quiet. Although my kids and my wife, they were going crazy but you can't really do -- it's sort of wild. That was a wild time. And I love the debate, and we got very good reviews on the debate. But the room was stacked with special interests and lobbyists and all these guys that pay the candidates money. And every time certain of the candidate, in this case, it was Bush and Rubio, every time they said something -- I agree. Well, it's not gonna happen. It's not gonna happen with them. But every time they said something, they got like applause. Bush made a statement. It was like this jumbled up statement with all sorts of -- I mean, it was ridiculous and everyone said, yay, yay, yay. And I was the one -- I gave two very highly conservative judges really. And people go, you know, it's fine. But I mean that's to a certain extent the RNC fault. But they let the tickets get away and they shouldn't have that. I mean, we shouldn't have a thing like that. Now, you have to call them out. So I called them out. I said, you know, that's the lobbyist and the special interest in the audience. You want to see that audience. That was the richest audience I think I've ever seen. The heads of the drug companies. The heads of the electric companies. The heads of every, every special interest you can imagine was in that room that night. And I'll tell you what. I'm honored to represent you people. I'm self-funding. I'm putting up my own money. I'm honored. I'm honored. You know, it's time. Don't forget I was on the other side of the equation before June 16th. On June 16th, I came down the escalator, famous ride. I always say you've never seen so much press. You look back and you saw that press and I said, man, that's like the Academy Awards. The day June 16th in Manhattan at Trump Tower. And I said to -- we have to do it. You know, I'm watching the Iran deal where we've given all this money away, right? $150 billion for nothing. $150 billion -- think of it. We're giving away $150 billion and we get nothing. We get nothing. And now, if you look, Iran is taking over Iraq on top of everything else. They're taking over Iraq. We should have never been there. Now, I should get something for vision because when I did it, when I said it, people disagreed with me. But I said -- and I'm the most militaristic person in this room, believe me. Our military is gonna be so big, so strong, so powerful. Nobody is gonna mess with us. Nobody. But we've been over there folks for 15 years and we're beyond zero, if you think. We are in worse shape now than we were 15 years ago, right? If our politicians went to the beach and did nothing, we'd be in better shape. Saddam Hussein. Saddam Hussein, no good guy and all of them, no good. But they kill terrorists. Saddam Hussein killed terrorists. That's what he did. Now, Iraq is a haven for terrorists. If you want to go to Harvard of terrorism, you go to Iraq, OK? And you know so it's a shame. And after all of these years -- now with that being said, we're there and we have ISIS. And we got to do something about ISIS because these are people chopping off heads of Christians. They're chopping off heads of anybody frankly, and we're gonna knock the hell out them. We're gonna knock the hell out of them. We have to. We have to. We shouldn't have been there. And Obama shouldn't have gotten us out the way we got out, OK? You don't tell people the date that we're leaving. Can you imagine General Patton or General Douglas MacArthur -- George Patton. I mean this guy was so tough. So he couldn't be a general today because he was too nasty and he wasn't politically correct. And he would say things that people said, well, that's not very nice. And yet his men and women -- but in those cases, it was men. In all fairness, it was men. They didn't have too many women in those days in terms of the infantry. But his people, his soldiers they died for him. They would die for him. But they loved him. But a guy like that today may be not politically correct. I don't know but I want that kind of a guy. That's what we need. That's what we need. I watch some of these guys being interviewed. They're retiring. They always go on the talk shows. I don't want my generals on talk shows. You know, they'll say things and we have to be like, you know, a little bit secretive, a little bit something. And they'll tell us about the military. One of them said -- General Odierno, a good guy, but he's retiring. He's on one of the talk shows a few months ago and he's talking about how weak our military is. I don't want a guy -- even if it is, I know it's weak. It's depleted. It's depleted. But he said, it's the weakest it's been. It's the weakest it's been since its inception. No, I don't know. Does he mean from the beginning of the -- it was an unbelievable statement. He said it's the least prepared, preparedness. I -- honestly, even if it's true, I don't want people to think that. Does that make sense? You know? We wanted just sort of say we're great, great, great. And then at the end, we're gonna be great but they got to give me like a year or two to get there. We've got to be strong. But I don't want people saying it's weak. I don't want it. They have no right to say that even if it's true. I mean, it's true you don't have to talk. You have to say they're wrong, but you don't have to talk. And these generals they talk. One of them was on one of the shows, a very big general and he was talking about ISIS. He just telling, oh, it's very tough. Well, how can we defeat them quickly? Oh, I don't know. I mean, if I'm ISIS and I watch this guy. I'm saying, man, this is like great. This is great. We're not like the same country anymore. We don't win anymore. We're gonna start winning so much. I am so sick and tired of losing. I mean, I see it so much. I see it so much. And I don't want to use the military. Now, remember this. I'm the one that was -- the one person that didn't want to go in. We are going to be respected again. We're not respected. Our leaders are not respected. Our leaders are not respected. Obama is not respected. Hillary Clinton is a joke. If she gets in, she's like a joke. You know, I turned on last night. I'm sure you saw it. I'm watching television and I see her barking like a dog, right? No, she's barking like a dog. And everyone said, oh, wasn't that wonderful? Wasn't that wonderful? Isn't that cute? Isn't that great? If I ever did that, I would be ridiculed all over the place. I won't do it. I'm not gonna imitate her. But she's barking like a dog and they're saying wonderful. Trump does it. Believe me. You'd read about it. What's wrong with Trump? So there'll be no barking. But we're gonna be respected again. We have to be respected again. And every single country in the world has taken advantage of us, every country that we do business with. Our trade is a disaster. We're gonna lose $500 billion with China this year on trade deficits. Think of it. Think of it. We can't do it. You're right. We can't do it. We can't do it. We can't continue. Japan with their cars. They send them in like they're candy. Like their candy. I go to Los Angeles. I see some of the boats, the biggest ships I've ever seen. The cars are pouring off like at 40 miles an hour. Just wow. Wow. Boom. Next boat. I mean, what are we doing? What are we doing? Do you know we defend Japan. We defend Germany. Well, a lot of people don't know. Does anybody know that we defend Germany? Do people know that? Most people don't even know it. We defend Germany. It's a behemoth, meaning an economic behemoth. Of course, if Angela Merkel keeps allowing the migrants then it's not gonna be a behemoth. It's gonna end up in a civil war. What she's doing is insane, by the way. It's insane. What she's doing to Germany -- I have a friend German, very proud of being German, and he said he's moving out of the country, OK? Can you believe this? I don't know what happened with her. You know, I build -- what you do, you build a safe zone in Syria. You have the Gulf states, who are putting up no money. You have the Gulf states put up the money because we're not putting up the money. We owe $19 trillion. I'm not a politician. You know, I like just be careful with the money. We're not putting up the money. They are -- they have tremendous amounts of money. You know Saudi Arabia before the oil crash was making a billion dollars a day. Hard to believe. I mean money like nobody has ever seen before. Funds like nobody has ever seen before. They were making a billion dollars. And we defend them, they pay us peanuts. We have military bases. We have to pay rent. We pay rent and we defend them. And I have great friends in the Saudis. They are great. Wonderful. Everything's fine. But why? I even say, why aren't you paying us for this? So we defend them. When somebody comes around and watch, watch Iran. So they're taking over Yemen. They don't want Yemen. But what's on the other side of that long, long border? Saudi Arabia. They want to go into Saudi Arabia. They want the oil. I know what's gonna happen. Not if I'm the head. That's not gonna happen but that's OK. But I know what's gonna happen. But they've got to pay for us and we can't do this stuff anymore. We protect Germany. Germany -- who doesn't have a BMW? They have BMW. They have Mercendez. But you look at, you look at what's going on in the car business and you see what's happening. You see our business is moving over to Mexico. You see other people are moving into Mexico. Mexico is gonna become the next China on a smaller level. But you take a look at Germany and you say, why are we defending them? Now, it's wonderful to defend them but they've got to pay something. Now, you look at our budget. You know a lot of people say that all we have this big military budget. Well, we do. We have a massive -- much bigger than anybody else's, but much of it is to protect other countries. So we defend Japan. So here's the deal with Japan if we're attacked -- we're attacked, for some reason, oh boy, would they be crazy. If I'm president, would somebody be crazy to attack us? Oh those poor people. Oh, anybody and we don't need Japan to help us. Believe me. We wouldn't need Japan to help us. Now, if Obama is president and we get attacked. I feel sorry for you, OK? But so with Japan, if we get attacked, Japan doesn't have to do anything, right? If Japan gets attacked, we have to go and defend them totally, probably World War Three, OK? Japan gets into a war with China. We have to defend Japan, OK? But we get in a war with somebody, they don't have to do anything. Not exactly the kind of deal that I'm used to, right? We're gonna change things around. We're gonna change things around. I'll give you another example, South Korea. So we have a border. We have 28,000 troops. I wouldn't want to be a troop on that border with this maniac on the other side. 28,000 troops on the border, right? He's got nuclear and all of this. You ever notice the Iran deal is horrible and they don't have nuclear. They will soon based on that. They'll just buy it. They don't have to do anything. They can buy it. They have so much money now. But we're gonna do something about that. But remember this. So we have a border, and you have this maniac in North Korea and we defend. And you know what we get? Every time I bought a thousands of television sets and air conditioners and all this stuff, it comes out of South Korea. They're an economic monster. They make a fortune, right? They make all the stuff. We used to make the televisions. Remember, Sylvania? RCA? We used to make this stuff. We don't make it anymore. We don't make anything anymore. We're gonna start making things now. We're gonna start making. We don't make anything anymore. It's been taken away. But we defend South Korea. So every time he raises his head. He says, we're gonna this, we're gonna that. He starts throwing a rocket up in the air. Half of the time, it doesn't get off the ground. But when it does, everyone gets crazy. And I say to myself, we send our ships. We start sending ships, everything else. It cost you a million bucks just to start one of those aircraft carriers up. Like, boom, $1 million, right? We get nothing. What do we get? We get nothing. We will -- He says -- what? I didn't hear it. That's good. See, I'm not allowed to say that. Because if I say that, it becomes a front page story. So I refuse to say. But we are -- and think of it. We spend money to defend the world and we owe $19 trillion. And then we have our Republicans, who are more upset within the Democrats because the Democrats we know where they're coming from. The Republicans approve a budget four weeks ago that gave Obama every single thing he wanted. Right? That's it. Who is that boo-er over there? That's a good -- Boy, you got a good voice. It sounds like Pavarotti. And I always say Obama is a lousy negotiator, but he's a great negotiator against the Republicans. And we're Republicans, so we're gonna change all that around. Look, trade. Trade. We are losing a fortune. We're gonna have the best people. Carl Icahn, one of the great businessmen of the world. We have the best people. We have the best business people in the world. We have the best negotiator. We don't use them. We use political hacks to make deals with China. China from the time -- they're three years old. If they see somebody is a genius, boom. Boom. Boom. It's like the pyramid thing where they just go up, up, up. And by the time they get to the top, we're negotiating with the toughest, smartest people you've ever seen. And we have guys that don't even know what they're doing. Diplomats, we have Carolyn Kennedy in Japan. Caroline Kennedy, she's not trained for this. Caroline Kennedy. So -- and I always say she's a nice person. Who cares? You know why she's nice? Because my daughter likes her, Ivanka. So my daughter likes her. But she's not negotiating for me that I can tell you. She's negotiating with the Japanese for cars. She didn't even want the job. She goes into the White House on 60 Minutes. You have to see it. She goes, yes, I'd love a job. Because they said, how did you get this job? They did a profile of her. She said, well, I went to the White House and I said I'd like a job. What would you like to do? Oh anything. They said, would you like to be the ambassador to Japan? She goes, really? Yeah, I'd like that. You got it. Good luck. Can you believe it? Now we have a new -- that's how we pick our negotiators. And the ambassador to Japan has a lot to do. And then the rest of 60 Minutes, we're showing them wining and dining her. By the time they finish with her, they'll have it -- they're gonna have an even better agreement than they have already. The thing that people don't know is we have all the cards because we are the pot of gold and they're draining us. We're not gonna have the cards much longer. We are the pot of gold. We have rebuilt China. What China has done to us in terms of taking our jobs, taking our base, taking our money, our manufacturing. China has done one of the greatest bank thefts in the history of the world. It's like a bank theft. It's like a theft. One of the greatest, one of the greatest thefts in world history has been what China has done to this country. Now, I love China. I love the Chinese people. I sell them condominiums. The biggest bank in the world is from China and -- that's a tenant of mine in Manhattan. I mean, it's fine. I don't object to China. I object to our leaders being stupid people. OK? They're stupid people. It's like Mexico is -- what's happening with Mexico is incredible because so many businesses I don't know if you saw what Carrier air con -- I bought by a lot of air con. I'm gonna start buying Trane. I'm gonna buy Trane from now. Carrier air conditioners ended up closing up. They're closing up and they're moving to Mexico of 1,400 to 1,700 jobs. So you know by carrying them. But here is what we have to do. You ready, folks? 1,400 jobs, that's right. That's right. He's got a good voice too. Let's see. Let's have a contest. Good voice. 1,400 jobs, 1,400 and here's what you have to do. OK. I'm a free trader. I want free trade. I love free trade. I love it coming and everything. But if you look at China, they sell to us no tax. We sell to them, you can't get into the place, OK? You can't get in. Boeing -- Remember this. We're talking about South Carolina who -- which I love. You have a big Boeing plant and it's doing good and everything is nice. Be careful because China, in order to get an order of planes, China is making Boeing build this massive plant in China. And all of a sudden, you'll come up -- It won't happen if I'm president, by the way. All of a sudden, you come up say, you know, Boeing wants to move all of their production to China and they're gonna be closing up and this is the way it works folks and you're sitting there saying, oh that couldn't happen. It can happen really easily because they devalue their currency. They are the greatest money manipulators ever. They monetary manipulate and they are -- what they're doing is genius. They are world-class chess players with devaluation, and our country doesn't even know what to do. And the TPP, which is a horrible trade deal, that Obama is pushing along with some conservative Republicans, OK? And the reason it's horrible, the reason it's horrible is because they don't even talk about devaluations. They don't even talk about monetary manipulation. And that's where they beat us. That's how they beat us more than any other place. We make better products than they do. They beat us with monetary manipulation. And I'll tell you one of the great achievements for me is gonna be when Apple starts, in particular, because they make everything. I mean, you look at what they're doing. You go to China, you see some of these factories that are two miles long. When Apple starts building their things in this country, that's gonna be a big, big sign. A big, big sign. But you better watch out because Boeing, you know, you feel good about Boeing. All of a sudden, you're gonna find out that Boeing is gonna close up over here. They're gonna build more over there. They're gonna make their big planes in China and it's bye bye to South Carolina. And that's not gonna be good. It's not gonna happen with me. It's gonna happen with any of these other politicians because two things. Number one, they're totally controlled by the people that give him the money. Number two, they have no understanding about business. They don't know anything about corporate inversion. They don't know what's going on. You know we have corporations that are leaving the United States and nobody even talks about it. It's to me, one of the biggest problems we have outside of nuclear, outside of ISIS, outside of -- because to me that's always gonna be number one. Boom. Boom. That's always got to be number one. It's got to always be number one, all right? But -- and I think that's one of the reasons I'm doing so well because everybody agrees I'll be, by far, the best on the border. Nobody. In fact, you know I got endorsed by Sarah Palin and I got it endorsed by Sheriff Joe Arpaio. Now you know. He's a wild man. One thing you know about Sheriff Joe. If he endorses you, you are the strongest in the border. Do we agree with that? No, we're gonna create, we're gonna create real borders and we're going to build the wall, right? We're gonna build a wall and it will be a real wall. It be higher than that ceiling. There's gonna be a wall. There's gonna be a wall that when you get up there, you're not coming down very easy. I tell you. Did you ever see that? I talked about it all the time. The ramp where they build a ramp over the little wall they have. Now, they have a little wall. They build a ramp. They have a truck, an SUV go loaded up with drugs: over, down, under. They sell the drugs in the United States. So we get the drugs. They get the cash and it just keeps going on and on. Now, this is gonna be the real deal, folks. We're gonna have a real strong border. And people can come in, but they can't come in legally. They have to go through a legal process. They've got to come in legally. They have to come in legally or we don't have a country or we don't have a country. So we're gonna do a lot of things and we're gonna do a lot of things to make us great again. I mean, great again. We're like a mess. We don't know what we're doing. Think of it. Bad on healthcare, bad on Common Core. How about your kids are being educated from Washington by bureaucrats who don't even give a damn. They don't even give a damn. Your kids are being educated by bureaucrats. Now, some are good and some are -- you know, I'm sure maybe. But they're more interested in how much do they get. Common Core is over. We're gonna end Common Core. Education -- I'll give -- I'll give you an example. Education, we're ranked number 30th in the world. We're number one in the world in cost per student by so -- we're so far ahead of number two that number two doesn't even exist. So you have Sweden, Norway, Denmark, China. These are like the top four. These are -- you know, they do a great job, all right? You have the United States at number 30, but number one per pupil in cost. Common Core is out, all right? Common Core is out. We're gonna bring education local. And I've seen it, I've seen parents they're so in love. Even when their sons and daughters graduate from school, they stay because they love. You know, they're in love with the whole process being that their kids are gone, but it almost made it more romantic for them. They do such an amazing job so that's it. Second Amendment is going to be so -- we are saving it. It is under -- Just so you know, the Second Amendment is under siege. The Second Amendment is under siege by so many different people. And you know, you look at the Democrats, I'll tell you what. You look at Hillary Clinton. I don't know. Again, is she gonna get it? But if she gets it, it's like let's not have -- she doesn't want to have a second amendment in my opinion if you look. Michael Bloomberg may run. He's worse than she is. I hope, by the way, I hope Michael runs because -- yes. Oh good. OK. He's on my side. I thought he was a protester. That's OK. Thank you. OK, well. OK. OK. Thank you, sir. Thank you. So I'll tell you what. So Second Amendment, it's under siege, totally under siege and we're gonna save the Second Amendment. And I'll tell you what, people want to destroy it. They're taking pieces out. Obama just did the Executive Order, chunk after chunk after chunk. We're gonna save the Second Amendment. Now, if we had people in California where have the two radicalized young couple they talked about. Young couple. They got married. People -- they would -- they're terrorists. Radical Islamic terrorism. Whether you like it or not, a huge problem for the world, not just for us. And nobody wants to talk about it. I'm the only one that's willing to talk about it. And you know what, now everyone else is talking about it, too. And did I take heat? Did I take heat? I took a lot of heat. But you know what? We have to do something and I said, we have to have a temporary moratorium. We have to find out what's going on here. You know we have people flying planes into the World Trade Center. We have people shooting for no reason. Look, we have to find out what's going on and we will. We've gotta find out. But if you're not willing to talk about the subject, if you're not willing, like our president, to even refer to it or use the name, you're never ever gonna solve the problem. And it's a massive problem. It's a massive problem. So when I came on June 16th. I walked. I came down the escalator with Melania my wife, and it was incredible. And during the -- except, you know, during the speech when I went and said I'm running for president, which takes courage. Let me tell you. It takes courage, especially if you're not a politician. You know, these politicians they run. That's all they do. They run. They run. They take money. They run more. They lose. How about some of these guys? They lose. They have zero, zero and they keep running. I say, why are you running? Why don't you just stop? They keep running. There's got to be some game that we all know about but they run. So now we're down to six or seven people and it's getting good and we love it. You know what, we had 17. We originally had 17 people. And slowly I love it, one after another after another, they're gone. And I talked about illegal immigration. And did I -- you talk about heat. That was heat times 10. Rush Limbaugh said, I've never seen any human being received so much incoming, meaning from those people. It was unbelievable. But, but after two or three weeks of like going into a cocoon, steel cocoon, people started saying, you know, Trump is right. And then you had horrible things happen. You have Kate in San Francisco. Beautiful Kate shot in the back by an illegal immigrant. You had numbers come out that were horrible. What it's doing to the economy. You had other things happen. You had Jamiel, a young man, 17 years old, shot in the face by an illegal immigrant. This is a guy that should have never been allowed in the country. Shot on for sport. This unbelievable guy, who I'm friendly with his father. His father is like this great guy. His father is, you know, his life can never be the same folks. You know, they say time. He told me the other day. No, time makes it worse, not better. It will never get better. He's a young incredible kid, who is going to go to -- a good football player who is gonna go maybe to Stanford on a scholarship, and the whole thing is just so sad. Shot in the face. You had the veteran, the female, the marine, the veteran in Los Angeles was raped, sodomized and killed. 65-year-old woman raped, sodomized and killed by the illegal immigrant and so much more. And people start saying, you know, Trump is right. He's really right. We've got a problem and it's not. And remember, I say it and I'll say it all the time. We want people to come in legally but we've got to vet these people. Look, we've got to vet these people. I mean, we have people where we draw from lotteries, lottery. Why? Who the hell wants lotteries? I don't want lotteries. We want great people coming into this country. We have to have great, great people coming into this country. It has to be like an honor, and it has to be an honor for them. You don't want to come in because they just happen to be there. So we're gonna stop. We're gonna stop and we're gonna get smart. And we're gonna have people come in, but we're gonna have people come in through a process that's going to be a fair and equitable process. And the bad ones, we have some people in this country. We have as of last week it was reported 179,000 illegal immigrants, who are criminals. OK? Think of it. Think of it. We have -- think of that what that means. This was as of last week. 179,000 -- Thank you. Who is that person that stood? That was so great. Who is the person that did that? Put up your hand. Put up your hand. I want to -- come on. Bring that person up here. I love them. Come on up here. Come here. Come here. So amazing. Isn't that terrible? See, that's what we're all fighting for that. Isn't that terrible? And you know what, the press will put that -- look, see the cameras now are moving because that's the only way they ever see the crowd. Isn't that -- isn't that terrible? To me -- Now, they won't say that. If I say, oh hell. They say, oh Trump used a horrible word. That person does that with their hands and fingers and they won't report that. It's disgusting. It's disgusting. It is so disgusting. And I'll tell you what, the press should be -- they should be ashamed of themselves. I want to see -- No, they should be ashamed of themselves. It's disgraceful. Who is the person though? Raise your hand. Who is the person that took action over there? Come here. I love these guys. I love these guys. I love these people. Come here. Come here. Come here. Get over here. Look at this guy. Come here. Come on up. Bring him up here. That's all right. Bring him up. I want him come in. Bring him up too. Do not let them intimidate you. You back this man right here to the hill. They will say anything. They would do anything to keep him power, OK? We don't need who we've got in there now. I've talked to Republicans and Democrats, he's right. We need to get some fresh bunch up there. Fresh blood. Some fresh thinking, OK? My man, Donald Trump, I'll tell you what. I locked it all. When you first got into this, I kind of was So I don't know. Donald Trump, you're the best we got by far. Thank you. He's a great public speaker this guy. Oh, I got two tours in Iraq. I'm a Richmond County deputy. If it wasn't, if it wasn't for Mr. Trump right here, I don't think any of us would have the voice that we had. This is the only man that's gonna really bring America back. He understand what it means for me and my people our here. We've been to war. Please everything you talk about Mr. Trump, I can promise you right now. My department, the departments around me, we need you. Great. I mean that's so cool. But -- Think of it. I see this, guy nasty language, really horrible language, which won't be reported by these guys. Really horrible, horrible language, for what? You know, when you think of it, we're all after the same thing, right? Whether you're Democrat, whether you're liberal, Republican, conservative, whatever you are. We want safety. We want a good military. We want our vets taken care of. We want borders. We want education. We want homes. We want to be able to eat and live and have a nice life. I mean, you think I could talk to somebody like that in 10 minutes but a lot of them don't want to listen to it. You know a lot of them have bad thoughts beyond -- I'm telling you, there's something going on. But you hear the filthy mouth and I don't know, all of a sudden, I see fist starting to fly. Saw like about four of them. And a rough cookie. This was not an easy guy. I looked at him. I said, that's a rough cookie. The other guy. And then he puts his fingers in the air, you know. He wouldn't do it in front of those guys. Let me tell you. But I love it. I love people with courage. I mean, courage. Sometimes you'll go and we'll go and stuff like that will go on a whole entire time. But I just respect those two guys a lot. So I want to thank you, fellows. Amazing. Really amazing. Really amazing. It's what we need. I really -- we need It. So you look at what's happening with our country where we're being beaten so badly and trade is so important. Our military is, to me, look, it all goes this way. When I came down, it was about trade, it was about the borders and I did very well. And I've been sort of number one I think almost from the beginning, right? They all said, he'll never run. His life is too good. Why would he do that? Sometimes I ask myself that question actually. But -- and then they said, well, OK. He just announced he's running. Then they said, he'll never sign Form A., right? Remember, I signed. That's where you sign your life away. Then they said, he'll never put his financials because maybe he's not as successful as everyone thinks. Turned out I'm much more successful. I built an unbelievable company, very low debt. I filed almost a hundred pages of financial documents like this incredible company and the press was down there. They've gone over every inch of it. They've misrepresented as much as they could but they can't basically. It's an unbelievable company. That's the kind of thinking we need. We have $19 trillion. We need somebody that knows how to deal. We need somebody that could get Carl Icahn. We need somebody that can get the great -- we have the greatest business people in the world. We're gonna use them. We need somebody that can do it. We can turn this thing around so fast. We're gonna turn around and you're gonna be so proud of it. You're gonna be so proud of it. And then you see people like the two guys that just came up here. I mean, you know, to me, it's such an honor and we have so many people. We have so many great people in this country but they're not allowed. You take a look at small business. I have a friend. He's a small businessman. There's no way can ever make it because of regulations. He's got regulations over regulations over regulations that are put in there. He's a farmer. He can't -- if a puddle develops in the middle of his area, they consider a lake for environmental purposes. He can't -- he has to walk around -- the whole thing is crazy. He's showing me things. We're gonna get rid of regulations. We're gonna go back to being a real country. We make deals with China, environmental deals. You know, we have a president that talks about the ozone and he talks about all of the different things, right? All of the different -- and then he flies to Hawaii to play golf in a 747 with a four monster engine. Think of it. And they're old engines too. They spew plenty and he flies back a few weeks later. It's a long round of golf. He plays more golf than people on the PGA Tour. It's true. So you know, one thing I say about that. You know, if you become president and you go to the White House, why would you want to leave the White House? I mean, first of all, you got to work. You know, when he signs his executive orders that's because you couldn't even get the Democrats together. Couldn't get anyone together. You know, Ronald Reagan got together with Tip O'Neill and they got things done, right? The way it's supposed to be, you know. And there can be compromise. You can't be just like, you know, this guy Ted Cruz. He stands in the tent. Did you see the senator from Oklahoma just came out with a statement. One of the most incredible statements. Here's a guy. He came out with such an unbelievably strong statement that Ted Cruz is the most dishonest person in the -- You know, I mean like the most incredible statement. He's a Republican. That just came out. And what I'm telling you is true. I've never seen a human being lie so much. He lies about everything. He'll take your record like I talk to you about Obamacare. He'll say Trump loves Obamacare. Loves Obama. How do you fight that? Guy says he loves Obamacare. I hate Obamacare. It's gonna be terminated. I just told you that. I tell -- No, no, but I tell it everyone. I am the strongest, I am the strongest of the Second Amendment. He said, Donald Trump wants to destroy the Second Amendment. I'm the strongest. I'm in the NRA. My sons are in the NRA. I'm gonna be -- first day in office, I'm terminating Obama's new executive order. You know, another one. Having to do with the Second. So he's a liar. So at least I have, you know, the presence to be able to call out. You know, if -- and I hate to say it about a person. But actually during the debate, Rubio called him a liar. So I felt a lot better. Don't forget. Here's a guy -- Dr. Ben Carson is a good guy. Here's a guy that during the election, during the caucus in Iowa. He went out and he told everybody -- what did he say? He said Carson is out. He's out. Vote for us. Carson's quit. He just left. He's not in the election anymore. Caucus for him, OK? And so he got thousands of votes because of that. Thousands and thousands of votes. How dishonest is that? He did a -- It's called voter violation form. It says that if you don't vote for him -- essentially, if you don't vote for him, you've got a problem. It looks like it came from the IRS. It looks like a government document. I tell you one thing I learned. These politicians are dishonest people. Wow. They are really, really dishonest people. They are really, really dishonest people. So I think he's gonna go down. I think a guy -- a guy can't be -- I'm a Christian. But you know -- Protestant. But you know, Ted holds up the Bible and then he lies about so many things and I mean these are lies. These aren't like, oh maybe he is. What he did to Carson was a total lie. He said he didn't know about it but then he apologized. How about this. He apologized like an hour after the election. Oh wonderful. Wonderful. The election is over. And he said the guy was -- so we have to be smart. So important. We're gonna make America great again. We're gonna make maybe America greater than ever before but -- and I don't want your money. I want your vote. I don't want your money. I don't want any money. I don't need your money. I don't need your money. And I want to take care of our vets. You have a big vet area here. We're gonna take care of them to a level, to a level. These are our greatest people. We wouldn't be here if it weren't for the vets. And speaking of the vets, do I love our police? Do I love our police? Our police are not being treated with the proper respect. Believe me. Believe me. So we love our police and we have to cherish and protect our police too. And every once in a while, someone is gonna make a mistake or somebody is gonna be a bad apple. Unfortunately, they play that on the news forever. And they don't play you know 100% practically good things that are done by the police. But we have so much support from the police. And you know, again, without the police, we're not standing here like this and things aren't the same. Believe me. So we have to pay a lot of homage to the police. So the election is coming up, and you're gonna have a big part. New Hampshire was unbelievable. New Hampshire gave me a number that was greater than the polls. We were at like 30. And you know, this is 30 against many people. So 30% against many people. I get a kick when they talk about if the establishment ever got together and they put their numbers together, they'd be the same as Trump and maybe they could defeat him. I said, wait a minute. If these guys quit, in other words, if they put all their numbers into one, right? I say, folks, these people -- I mean, these are the basic, like they're smart people. The press, I'm telling you, 20% are good. 25% they're OK. Some of them are the worst you've ever seen and the most dishonest. I think Karl Rove is one of the most dishonest human beings. I'll tell you. One of the most dishonest human beings. First of all, he's a total bushy. He's a total bushy. Here's a guy that spends millions and millions on campaign and loses almost all of them. But I think some of the guys, George Will, Karl Rove. There are some guys that -- Krauthammer is a disaster. Krauthammer is a disaster. This guy -- I mean, when I won New Hampshire like a landslide. Krauthammer said, well, it was all right. He didn't do that great. I mean, this guy is a disaster. But think of those three. There are some others I won't even mentioned their names. Just a couple that are even worse than them, but they're really dishonest people. But let me tell you something. They say if this one got out and that one got out and if they all banded together and won, they could maybe defeat Trump. Then I said, wait a minute folks. If they've got 5%, 4%, 3%, 2% and they get out. I'm gonna get some of those votes. And the guy goes, ooh. I never thought of that. Right?. It's like, it's like they get out. They're gonna vote for me. Some of them would vote mostly for me. They said they add them up 100% here, 100%, 100%. Here's a story. I'm gonna do a great job for you. I'm working for you. I'm working for you. I'm working for you. Again, I'm not taking any of their money. They came in -- a man came into my office. He offered me millions of dollars, a lobbyist type. And he offered me millions of dollars. Don -- you know, when you're number one, I've been number one almost since I announced, OK? Because I did a great job. I built a great company. I employ thousands of people. I've employed tens of thousands of people over the years and like places like Mexico. I have so many Hispanics working for me. I think I'm gonna win the Hispanics. I think I'm gonna win places like Michigan that aren't even in play for the Republicans, you know? The Republicans it's very hard to win because structurally you're at a big disadvantage. You have a lot of disadvantages. I'm gonna bring states into play and win them easily that aren't even in play. Polls are coming out saying I beat Hillary so many -- I mean, I beat Hillary and I haven't even started on her yet. I haven't even started. I mean, this guy Cruz comes out. Well, I don't think he's gonna win. This guy is so strident and so nasty he's gonna lose every single state then. Then Bush, poor Bush. He comes out. He goes, well, I don't think that Donald Trump can beat Hillary Clinton but I can. I say, well, why aren't you beating me? Why aren't you beating me? You know, I mean the guy gets up and they just say things. He said the other day it was sort of incredible. So the numbers just came out in New Hampshire. So I got a tremendous -- I had a tremendous result. Won every single group, every single group. So I was at 36%. I think he was, what, a 3% or 4%. He spent, listen to this, $44 million in the state of New Hampshire. I spent $3 million and much of that money I get back because it's four airplanes that I own. So I have to pay myself back, OK? No, can you believe it? So Bush spent $44 million or $45 million in New Hampshire, right? I spent $3 million and I won in a landslide against everybody. So I have 36, he has like four or five, six whatever. You know, something that was so low. I didn't even get that. I didn't want to go that far down in the charts. And by the way, the only reason I mentioned him is because he spent $22 million on negative ads on me. Even now, I come here. I see this negative ad something. ISIS melting. He said all sorts of things. They're wrong. They're just wrong. But it's -- you know the one I'm talking. It's a very dark ad. ISIS melting. It's all wrong stuff. I mean, it's all wrong stuff. So anyway. So here's what we have to do. Saturday is so important. We're gonna beat Hillary. We're gonna beat Hillary. We're gonna beat Hillary just like I'm beating all these guys. You have some big polls coming out. Actually, a great poll came out today. A very good PPP, Public Policy Poll, came out today has us very high. 36 -- 35, 36. Everyone else is way down. But just assume that we're even. Assume that we're behind because you've got to go and vote. You got to go and vote. Assume that we're behind. Some big polls are coming out today and tomorrow, but don't even look at them. Just assume that they're terrible. Because if they're terrible, you're gonna go vote more so. I give you my word. Look, we are going to do such a great job. You're gonna be so proud of this country. You're gonna be so proud of your president. You're gonna be proud of your president because I don't need this. I don't need this. Like you, folks. I mean, you don't have to be here and I don't need it. I don't need. But it's just that I love the country. It's been so good to me. And you know, honestly, it's been so good and it's got so much potential. If I didn't think it had the potential it had, if I didn't think it could be saved, I'd feel terribly but I wouldn't be doing it. I wouldn't do it because I'd say, well, wait a minute, maybe we can do something so spectacular. We have to let this country really go. We have to get rid of these rules, regulations, stuff that was put in for other reasons. Stuff that was put in for the wrong reasons. Our banks aren't loaning anybody money. We have Dodd-Frank. It makes it impossible for a head of a bank to loan any money. The regulators are running the banks. We've got to unleash, and we've got to take back our deals. We've got to take back our people. We've got to bring back our jobs to this country. We're gonna bring them back to this country. So I only say this. I love you people. We want to win. We're gonna win so big. And I just want you on Saturday, such a big day. You got to go out. You got to vote. And I guarantee you that this is the beginning. You're gonna remember this day and you're gonna say to yourselves, I remember that day two years ago, four years ago, 10 years ago, it's gonna get older and older. And you're gonna say this was one of the great days of my life because this was the beginning of making America great again. I love you. I love you."}