{"id":453,"author":"Donald Trump","title":"Speech: Donald Trump in Greenville, SC","date":"2016-02-15","link":"https://factba.se/transcript/donald-trump-speech-greenville-sc-february-15-2016","paragraphs":["There's no way I'm leaving South Carolina. And I was going to leave for tonight. Come back. I said, I'm staying. So I'm saying here for five days. We've got a win on Saturday. We've got to win. Make America great again. We're gonna make America great again. We're gonna win. You know, it's been an amazing period.","We've been all over the state today. I love you too, darling. Look at her. Oh, I love you. I love you, all. I love you, all. So many things are happening for our country and it's -- this is a movement. Time magazine last week did the most beautiful story cover and they talked about it. It's a movement. They've never seen -- they say there's not been anything like this.","I don't know ever, but they actually say ever. We went to Tampa the other day, Tampa, Florida on like two days notice. 15,000 people. They had to turn away 5,000. And by the way, for all of the people in this room, I can't believe it. This is a huge room. But downstairs, they're filling up another one and they're sadly sending people away.","We don't like that, right? No? OK. Why don't we all get up. Go. Let's have night now. No. And we have one of the great veterans, Al. Is that Al? Stand up. Wow. One of the great, great -- you are great. I love this guy. He loves the veterans and I love the veterans, and we're gonna take care of our veterans.","I'll tell you that. We're gonna take care. They're not -- they are not properly taken care of. So we're gonna take care, right? We have several -- look at this. I knew you guys would say that. I could spot a veteran a long ways off, but we are -- we're gonna take great care. We're gonna take care of our military.","We're gonna take care of our military because our military is being whittled away, whittled away. We're gonna make our military so big, so strong, so powerful. Nobody is gonna mess with us anymore. Nobody. Nobody. Nobody. So Nikki Haley, a very nice woman. She made a speech the other day. You saw that and she was talking about anger.","And she said there's a lot of anger and I guess, she was implying all of us, you know, really referring to us. And by the end of the day, she was actually saying that Donald Trump is a friend of mine. He's been a supporter of mine and everything else. You know, the tone at the beginning was, as I said, by the time that she was just barraged with people.","She said, I think we better change our path here. And by the end of the day -- and it was fine. It was great. But she said, yeah, there is anger. But I said, there is anger. And I was asked during -- not this debate, but the previous debate, I was asked -- by the way, didn't you love this last debate? I sort of liked it. They came at me from every angle possible.","No, no. They came at me from every angle. You know, it's sort of interesting. They were hitting me with things like and such untruths. You know, I never realized. I've always known politicians are dishonest, but I've never known the level of dishonesty. And I deal in the industry, it's a lot of different but mostly real estate and like in Manhattan and different places.","But I've never seen people as dishonest as politicians. They will say anything like -- OK. So a lot of you people understand and you get me and you've seen the speeches and you've seen a lot of it. And you know that I protect the Second Amendment more than anybody, by far, right? More than anybody. And this guy, Ted Cruz, gets up and says, Donald Trump does not respect the Second Amendment.","I mean, more than anybody, I'm with the Second Amendment. So -- no, no, it's lies. And then they do commercials. And you know, he did it to Ben Carson and him in particular. In all fairness, Jeb Bush represents but these are minor misrepresentations and he's not going anywhere anyway. So what -- who the hell cares, right?","No, it doesn't matter. Well Jeb was talking about eminent domain. Donald Trump used eminent domain privately. And then I see there's a big story -- I had to bring this out. Look, proof. Jeb Bush under eminent domain took a disabled veteran's property. He's talking about me. No, no. It's me. Honestly, these guys, these guys are the worst.","Eminent domain. Without eminent domain, by the way, you don't have highways, roads, airports, hospitals. You don't have bridges. You don't have anything. So they say, Donald Trump does not like eminent domain. I don't like eminent domain, but you need a road, you need a highway, you need -- you know, it's funny they all want they all want the Keystone pipeline, right?","But without eminent domain, without -- think of it. Without eminent domain, you can't have the Keystone pipeline and we're gonna get the Keystone pipeline approved. But, but -- it's jobs. It's jobs. But remember this. When it gets approved, the politicians could may be approve it, but I'm gonna approve it. But I'm gonna make a deal where we get a big chunk of it for the people of the country.","Why should we just approve it. They're going through our country. It's different -- it's a different way of thinking. It's a different way of thinking. Let me give you an example. I saw this -- first time a few weeks, I've been talking about it, the drug companies. The drug companies are the largest -- we are the largest purchaser of drugs in the world, right, in the world, by far.","We purchase numbers that nobody would even believe. And yet, we don't really negotiate the price of drugs because we're prohibited from doing so. If we did, we would save perhaps $300 billion a year. That gets to be serious money. $100 billion here, $100 billion there. All of a sudden, you have a lot of money.","But we'd save perhaps $300 billion, could even be $350 billion a year. Now, why? A friend of mine, who's a doctor, comes up and says, Donald, I don't understand it. You go to the drugstore. The United States pays the same as Mr. Schwartz, who walks into the drugstore to buy drugs. It doesn't make sense, right?","I said, of course, it does. These guys that I'm running against and others, politicians, meaning, they get campaign contributions from the drug companies, OK? They get campaign contributions from the drug companies. So all of a sudden, you have a non-competitive business. I get no contributions. What I'm doing is funding my own campaign.","So I don't get it. Except for the little tiny ones that people send in for $20 and $100 and $200. And you know, it's hard to send it back. How do you send it back? And it doesn't amount to much, believe me. But how do you send it back? You can't send it back. You'd hurt the people. You actually -- number one, of course, it would cost you more to send it back than it's worth.","And number two, you hurt their feelings. But I'm not accepting. So I'm not taking money from the drug companies, from the oil companies and lumber and everything else. The numbers that you can save -- I'm self-funding. The numbers that you save are so astronomical. The problem is these candidates they're all taken care of with campaign contributions and they can't do it. So, as an example, Jeb Bush.","Woody Johnson. You ever hear of Johnson and Johnson, right? Big drug company. Big pharmaceutical company. Big company. He's in charge of fundraising for Jeb Bush. So he raises a lot of money. Jeb Bush raised $148 million. He's wasted almost all of it. Think of it. Most of it -- the only reason I even bring somebody in a press conference and say, why do you mention Jeb Bush?","He's not competitive. Although his brother came today, they're having a thing. They're trying to make competitive, but I don't think it's gonna happen personally. I don't think. I don't think so. Who the hell knows? Maybe. Who knows, right? But they say, why do you mention? Because he did $20 million of negative ads on me. You know, when you do that -- and for some reason, my numbers keep going up. So they can't be very good ads.","They can't be. They can't. So when you look at what's going on and let's say now, I want to save the $300 billion. But I'm Jeb Bush and you say, we're gonna save this money. Then Woody Johnson is gonna call him. Jeb, you can't do that, Jeb. Can't do that. I worked hard for you. Lobbyists are gonna call them or the lobbyists are gonna call Ted Cruz, who's, you know, a dishonest guy.","He's a liar. I mean, he's real lier. They're gonna call him. They're gonna go Ted, you can't do that. You've got another race coming up in two years. There's no way you can do that. These guys supported you or they're gonna call Marco. Marco Rubio, who stood with me. He was with me when he had the meltdown and I'm telling you it wasn't a pretty sight.","No, he was standing right there. No, he was -- he was soaking wet. I'm telling you. He was wet. Boy, I say, what the hell is going on over here. I thought he just came out of a swimming pool. He was so soaking. Look, I said, wow. I said, are you OK? Now, when we get in with Putin, we need people that don't sweat.","Let me tell you. No, it's true. Got to have people that don't sweat. Can you imagine Putin sitting there and waiting for the meeting and this guy walks in and he's like a wreck. No. You got to have Trump walk into that meeting, folks. We'll do very nicely. We're gonna do very nicely. It's funny these guys.","So Putin said nice things about me. I don't know Putin, but he said nice things about me. He said Trump is a genius. And Trump is gonna win and Trump is leading the party. All right. He said nice things. Look, you know, I always like a compliment. We all like compliments. Not gonna influence. Believe me. I'm gonna do what's right.","But he said these things. So the other people said we want you to disavow what Putin said. First of all, I say this. Guy calls you a genius, you're not gonna disavow. Do we agree? Only a stupid person would disavow. Not a genius. No genius would disavow being called a genius. But more importantly, if you look at it. Wouldn't it be nice if we actually got along with Russia and other countries?","Wouldn't that be nice? I heard them saying this morning on television. How dare they want to -- Donald Trump wants to work with Russia to get rid of ISIS. Yeah. Sort of, right? You know the cost of missiles that are a million dollars a pop. It would be nice to work with somebody else. Let them drop some of their missiles.","We'll get rid of ISIS. But they were talking about working with Russia like we have -- we have to do it ourselves. Why do we have to do everything ourselves? We're like the policemen of the world. You know, our military takes care -- I've seen so many things. There are so many different ways to save with a business person, and I'm really good at this stuff I tell you.","Remember when I put my papers in. They all said, wow. That company is unbelievable. It's an unbelievable company I built. And now, I want to put that thinking and I'm not doing that braggingly. I have very little debt. I have some of the best assets, some of the best real estate assets in the world. They're great.","Great cash flow. Everything good, right. But I'm not saying it bragging. I'm saying it because that's the kind of thinking we need right now. We have $19 trillion in debt. We have $19 trillion. It's so sad. You know, you look at what's happened. You look at what's going on, $19 trillion. And then your politicians, not mine.","But they are mine too unfortunately. But a month ago, they make this omnibus budget. Did you see this thing? Obama got every single thing he wanted. He got where the migrants can come into our country. He got funding. He got funding for the illegal immigrants. Let me tell you about the migrants.","You know what, we all have, we all have a heart and I have as big a heart as anybody. We have to take care of people. But you can't let people into this country who don't know -- we don't know where the hell they are, where they come from, where did they originate from. You can't let it happen. You can't let it happen.","I mean, we have people. And you look at those lines. You look at the migration. You take a look at the Migration. And you say that's strange. So many men, strong, young men. Not many women. Not many children. I'm saying, what's going on over here? Maybe it's a Trojan horse. I doubt it. But you know, a lot of people are gonna come in. They're gonna be bad people, in many cases.","And you see what two people -- look at these two radicalized people that got married. That shot the 14 people and killed them that gave them anniversary parties and children's parties and they went in to kill them. So there's something going on. And when I -- actually, I did it in South Carolina. I told people in South Carolina, we have to have a temporary ban on Muslims coming into this country.","I'm sorry. I'm sorry. And it will be temporary, hopefully. But if we don't find out -- look, it's radical Islamic terrorism, OK? There's a lot of hatred. We have a president, we have a president who won't even use the term when it's obvious that that's what it was. Won't even use the term. We have to solve the problem.","You can't solve the problem if you're unwilling to even say what the problem is. We're gonna solve the problem, but we have to be tough. We have to be vigilant. We have to watch. You know, when these two young horrible people that got married. They talk about the couple. The one -- the couple. Give me a break, right?","When these two people that got married, they killed the 14 people. Well, in their house, an apartment, they had bombs laying all over the floor. Other people saw that. Why weren't they reported? People knew what was going on. Why weren't they reported? To me, those people are just as guilty almost as the people that did the shooting.","Why weren't they reported? And the reason is possibly that they liked what was going on. We can't have it. Look, we've got to have a country. We've got to have a country. We've got to have -- we're gonna have a great country. We're gonna get rid of some of the stuff. We're trying to be so politically correct that we can't function anymore.","We can't function. Take a look at Germany. Take a look at Germany. Everybody expected I was gonna get Time Magazine of the year because look at this, look at this people but everybody expected it. And by the way, we have the same crowd downstairs. Can you believe after I'm finished, I have to do this again?","Do you think this is fun? Do you think this is fun? And then they said to wait 3,000 people. So we're gonna have like close to 10,000 people. Amazing right? Well, well, we did give you three days notice, right? Can you imagine? It's such an -- No. It's an honor. It's an honor. And you know why it's an honor?","Because no matter where we go in the country, these are amazing people, whether it's Dallas, Mobile, Alabama, we had 35,000 people. We started with a hotel then we went to a football stadium because the hotel, you know, no hotel is gonna had -- and we ended up with 35,000 people. We go to Oklahoma, we had 20,000 people twice.","No matter where we go and New Hampshire was unbelievable. They have smaller venues, but we had the night, the night -- literally before, we had a blizzard. We had a blizzard. We had the Verizon Arena. We had 5,000 people in the Verizon Arena during a blizzard the night before. A great victory for all of us. It was a great victory.","New Hampshire was so amazing. It was a victory for all of us. It's not a victory. I'm like the messenger. I'm a good messenger, I think, but I'm like the messenger. But people are tired of what's going on in our country. We're tired of the Iran deal, where Iran gets $150 billion. We get nothing.","They laugh at us. They take our sailors and they put them in a begging position, with their hands up and they put guns to their heads. And frankly, they'd still be there except for the fact that they got $150 billion two days later. They're not stupid people. They're great negotiators, the Persians. We have the worst negotiators.","We get nothing. We have 24-day inspection periods. Think of it. You don't go there for 24 days, but the clock starts ticking. It could be six months before you could go and inspect. Then they have self-inspection of some areas. Can you imagine that? You know, Obama calls the leader, the supreme leader, right?","I promise you will never hear a supreme leader from me. He will never be called, he will never be called this. No, not gonna be called. No. It's such an embarrassment. It's such an embarrassment. We make these deals. And the saddest part -- I said this to somebody the other day. What do you regret? I said the biggest regret is that we've already given them this hundreds of billions of dollars because frankly, the rest of the deal -- I could take deals and make them good no matter how bad the contract is. I find ways.","But you know what? The money is gone. The money is gone. And here's what they're doing. They're going to Italy. They're buying tremendous amounts of stuff from Italy. They're buying 118 airplanes from Airbus, not from Boeing. We want Boeing, right? Oh, you want Boeing. No, no. But they're not buying it from you.","And be careful Boeing, I'll tell you about Boeing. But they're buying missiles, they're buying all the stuff. They're not spending the money with us. Now here's what's gonna happen with Boeing because I love Boeing and I know you went through hell to get Boeing. But China now is insisting that in order to get the big order that Boeing build a massive plant in China, OK? Now think of it. You know, what I'm talking about, right?","Does everybody know this? So they're taking all of their intellectual property as part of the deal just to buy an airplane, a lot of them. But China is gonna build massive plants now and the, you know, Boeing is gonna spend the money. But they're taking intellectual property. They're taking everything. And you know what?","You have your plant but unless a guy like Trump is in charge, that plant will be in jeopardy very quickly. You better be careful. Just remember it because China current -- the currency manipulation that China does is like a great chess master. It's brilliant. What they do is incredible. And they always wait till we have a problem because it's a problem -- like we have a problem, so they reduce, you know, they take currency manipulation.","What they do is incredible. And you can't compete as a business. And we have all the cards because they take our business out of here so quick like we're babies. Just like candy for a baby. So Boeing, I just tell you in terms of what you have and what you've built, be careful because they want to take those planes and they want to make them in China.","And that's not good. That's not good. But believe me if I win, it's never gonna happen because -- never gonna. Never gonna happen. I don't even know that I'd let Boeing make the kind of deal they made where they're building this massive plane factory. I don't even know. In other words, in order to build to get the order, we want you to build this massive factory.","So then you say, well, what good does it do for us? You saw just the other day where Carrier, air conditioner maker. I buy many many Carrier air conditioners. I think I'm gonna start buying other air conditioners now. I think I'll go with Trane. I'll go with somebody else. But Carrier just closed up a big plant.","They had a big one. They're moving their air conditioning business to Mexico. And somebody was taking it through her cellphones. You know, it's amazing these cellphones because you can take it. As they're all being laid off by somebody saying, we're moving to Mexico. I'm sorry, your jobs are gone. Just like that.","People have worked there for years. Their jobs are gone. So Carrier is going to Mexico. Now, I'm good at this stuff. Some of you are good at this stuff. How does it help us? We lost Carrier. Carrier is gonna Mexico. They're gonna make air conditioners. They're gonna sell them back to us. We get nothing. So what I would do is I would say to Carrier.","Listen, I don't like what you did. And you can sell all the air conditioners you want to us and you could make them in Mexico, but you're going to pay a 35% tax every time you sell an air con. It's the only way we come out, honestly It's the only way we come out. You know, I know all the different ways.","It's all corporate inversions and all stuff that the politicians that I'm dealing with, this Ted Cruz. The guy has never employed a person in his whole life, OK? Never employed a person in his life. And these guys -- they're not gonna tell you that I've employed tens of thousands of people. By the way, I get along so great with the Hispanics.","In Nevada, they just did a poll. I'm leading with the Hispanics, right? I get along great. Great. But these guys, they never employed anybody so they don't know about corporate inversion. We're losing our businesses to -- you know, it used to be that a business would leave New York and come to South Carolina or come to Florida.","No more. Now, they leave here and they go to Europe and they go to Asia. Pfizer is moving to Ireland. They made a good tax deal. There's $2.5 trillion over in different parts of the world, outside of the United States. It's probably five. The government says $2.5 trillion. Usually, you can double it because they're embarrassed.","Everybody agrees that the money should come back into the United States. That's a lot. Companies cannot get their money back in. The Democrats agree. The Republicans agree. They need leadership. They don't have any leadership. They can't make a deal. So here's -- everybody agrees. Who doesn't want the money coming back in? They can't get the money back.","So what's happening is companies are leaving the United States to get their money. They're also leaving to get lower taxes, OK? So my tax plan, as you saw, cutting it big for the middle class. Big, big, big because the middle class has been forgotten in this country. Believe me. It's been forgotten. And I love the middle class.","Actually, the people I don't get along with are the rich people. I don't like the rich people as much if you want to know the truth. I actually -- actually, there's a lot of truth to that. But we're gonna take care of the middle class and we're gonna take care of our companies because our companies were the highest paid -- look, in any respect, in every respect, from a tax standpoint, we have the highest taxes anywhere in the world.","OK. So then you wonder why we don't have business. And one of the reasons we don't have business because we pay so much. We need the tax. But what the tax is doing is it's driving people out and they're coming out. So we're gonna do things like the following. We take care of South Korea. Every time I go to television sets -- and by the way, air conditioners.","Well, now it can also go to Mexico, right? But air conditioners -- all the stuff made in South Korea: Samsung, LG. I buy thousands and thousands of television sets a year for different projects, right? I won't be doing that too much anymore I hope. I hope I don't have to buy it anymore because, you know, I hope I can focus on the United States not on buying television sets.","Does that make sense? Really. That would be so boring ordering 4,000 television sets for a big project someplace. I'd say, uh, this is -- I want to focus on the united -- I hope I don't have to buy any more of this stuff. Thank you, darling. I agree. I agree. But they make -- they are a behemoth.","And yet, we have 28,000 soldiers. Great, young, beautiful people on the border between North and South Korea. This madman. And he's got nuclear. And I tell China, you better fix that because otherwise, we're not gonna be so nice to you on trade. Because again, China needs us more than we need China. Just please remember that.","Obama never figured that out. Because why? Because they're sucking our money out. We have rebuilt China. We've rebuilt -- you go to China, they have bridges like the George Washington Bridge all over the place. That's like, that's like a little bridge. They're building roadways. They're building airports.","They're building things. You go to places like Qatar. You go to places all over the Middle East, it's the most incredible thing. Then we come home, we land at LaGuardia Airport, with potholes all over the place. It's like we're a third world country. It's true. You see airports in different parts of the world because I travel to these places that are beyond belief.","I was in Qatar, which they say Qatar. I've always said Qatar. So I'd rather say it the way I say it. But I was in Qatar and they were showing me the airport. I said this is the most beautiful airport. They had spas while people are waiting for their planes. Spas. They had a gym. They have the most beautiful waiting rooms, reception rooms.","I said this is the most beautiful airport I've ever seen. And he goes, no, no, no. No, this is not the airport. This is just temporary. The real airport is over there. And I look and there's 40 cranes building the most incredible airport. The one that I said is the most beautiful is a ripped down. And we have LaGuardia and we have Newark and we have LAX and Kennedy and they're all falling down and falling apart.","It's so sad. Those days are over, OK? Those days are over. They're over. So when you hear how much we spend on military, it's really a misnomer because we don't get -- just like I told you about the drug companies, where we're gonna bid it and we're gonna save billions and billions and billions of dollars, right?","That's all goes to the budget, folks. It all goes. You know, when you see the kind of deficits, the kind of losses we have. It all goes to the budgets. With the military, it's even worse because a lot of times and you've all read. I've been reading it since I'm a kid. They buy equipment that they don't even want because the company that makes that equipment is politically connected much more so than the company that has equipment that they do want.","We're gonna get the equipment that we want because see, again, I'm not taken care of by these people. We can buy the right equipment and sometimes -- do you ever see where they order a fighter, a jet fighter and it's not the one they want, but it's the one that they're getting and it's being rammed down their throat by the politicians.","Those days are over. We have -- you know, we have the F35. We have the 35 fighter where China has copied it. Did you see that the other day? They have a picture of the 35 F35, it's a new fighter. We come up with it. We develop it. It's very complicated stuff. We develop it. China has knocked it off. You look at that and this.","We do the work and now they have to come up with a new concept. I tell you what, folks. It's like -- it's just so hard to believe. But you got to take a look at it. Look at it, the planes are almost identical. So we do all the work. We do all the development. They copy it. They steal it off our websites.","They probably get it off Hillary's emails, right? Right? Wouldn't you agree? I think so. I think so. No, I think so. And by the way, we'll beat Hillary. We have some great polls that just came out. We'll beat Hillary. These other guys. Assuming she's allowed to run, assuming. I mean, I'd write I'd rather run against a communist in this country because I know we haven't gone that far.","I'd rather run against Bernie to be honest with you, you know. No, I did say communist, by the way, you understand that now. So I would rather run against a socialist/communist in this country, but I don't think that's gonna happen. I think it's gonna be Hillary because she's being protected by the Democrats.","She she will probably get through. Now General Petraeus suffered. And remember I think I helped him. I said leave him alone. Did you see -- on top of everything else, they want to reduce his rank. And for the last four or five weeks, I said leave him alone. We have to beat ISIS. Leave this guy alone. He's suffered enough.","Leave him alone. You know what, they announced a couple of weeks ago. They're gonna leave me alone. I hope I had something to do with it. I don't know. They had to focus their energy on ISIS. They had to focus their energy on winning trade deals. And you know, I say it all the time. We don't win anymore.","We don't win anymore. We don't win with trade. And I'm telling you, I know the big Boeing stuff here. But be careful because in five years, all of a sudden, you're gonna see it's gonna go to China and it's gonna go to other places. Just be careful. You won't have to be careful if I'm President. I'll be careful for you.","It would be so easy. You won't have to be careful. Not gonna have to be careful So our military is gonna start winning again but we're hopefully not gonna have to use it very much. We shouldn't have gone into Iraq. That was a big mistake because it destabilized the whole Middle East. And some people say, oh, don't say that.","Look, we made -- we made a tremendous mistake. We went into Iraq. Shouldn't have happened. Everything you see right now is an offshoot of that decision. That was a very bad decision. Then Obama got out the wrong way. He came out. I mean, here's a guy he announces the date that we're leaving. So the enemy pulls back.","And I'm saying can you imagine General Douglas MacArthur or General George Patton, these are tough killers. Can you imagine they must have been going nuts. They're spinning in their grave. Obama announces a date. We are leaving on such and such a date. So the enemy pulls back. What do we have to fight for they're leaving.","We leave 18 months later and they go. And look at the mess and look at what they've got. I'll tell you. Iran, the deals they've made, not only the 150, I mean $150 billion. I used to say what a great deal. It was one of the best deals I've ever seen. It's actually one of the most incompetently negotiated deals.","For instance, our prisoners. I say this because it's like 101. It's like the Art of the Deal 101, OK? But anybody read the Art of the Deal in this room? Yes. Lot of people. Kerry didn't read it and Obama didn't read. But what you do is you go in right at the beginning, three years -- this deal took forever.","It seems like it's been going on forever. But let's say they have our prisons. Three years ago, you go in. And you say, fellas, got to release our president, sorry. Gotta do it. Bad for you. Bad for us. We need them. You don't. Your people don't care. Get away. It will send a good signal. They will say no. We'll say, bye bye.","We're going. Well, no deal. Now, you leave. You double up the sanctions. They were choking. They were choking. You double up the sanctions. Within 24 to 48 hours, they'll call. We got our prisoners, right? Now, here comes the tricky part. Now we have our prisoners. They're gone. This is four years ago, not the other day when we released them and we got -- you know, we gave -- basically what did we do? We gave them $150 billion for four prisoners, OK? $150 billion for four prisoners.","And it sets a terrible precedent, by the way. It sets a terrible precedent because what you're doing is you're negotiating with people, terrorists. It's not good. So we paid this money. Look, now we go in. And we say, OK. They're on the show or they say, fellas, we got a problem. You know somebody like to actually from the press love this story because my father was a great guy.","He taught me a lot. I learned a lot from my father. And he said, son, you're too direct. You're too tough you too tough. Take it easy. Easy. You got to take the lumps out, son. Take the lumps out, right? We've got to take the lumps out. And he said, you're too just -- so in the old days, I would have said, we're not giving you $150 billion.","You're never getting it. They would have been insulted and would have been problem. You know, we wouldn't get -- so we still would have won, but it would have been nasty. So when we take the lumps. I say fellas, I got to tell you I've got a problem. We're a debtor nation. We owe $19 trillion. We just have these politicians -- by the way, the Republicans approved it. You know, we know where the Democrats are coming from.","The Republicans keep approving this stuff. We just made a terrible deal. We're going -- oh, this is gonna cost us another -- budgets, it's another $2 trillion, right? So we're gonna owe $21 trillion. We don't have the money. There's nothing we can do. The $150 billion we want to give it to you so badly. We don't have it. We're poor.","We're bust. We have -- they'll go crazy. At the end of a couple of days, they'll be fine, OK? We just saved $150 billion. It's true. That's way. See, that's my father. He would say, take the lumps out. I would have done it the other way. But you have to learn from people. He was great. So we take the lumps out.","So now, they'll go nuts. We go back two, three days later, we got it. We just saved $150 billion. Believe me, I wouldn't give them $0.10. They wouldn't have gotten anything. So when somebody said, what's the biggest disappointment? So my biggest disappointment is that if I win, I go in and we don't have that $150 billion.","And for the sake of a little negotiation and walking out of a room a couple of times, we could had it. It's so sad. It's so sad. I used as an example Sergeant Bergdahl. We get Bergdahl, a traitor. No, no. Think of it. We get this dirty rotten traitor that six people were killed. Six young, wonderful people military were killed looking for him.","So we get Bergdahl, right? One guy and they knew that he was -- they knew that he was a traitor because they had a general and a colonel going and negotiating with the people that he was closest to. So they knew. So we get Bergdahl. They get five of the people that they most coveted that they've wanted for nine years and they got him.","These are great killers. They are all back in the battlefield or soon will be. So we get Bergdahl and they get the five people -- but this is the way we negotiate. This is the way we negotiate. So we have a problem with the country. We got so many problems, but we have a problem and the problem is that every single thing that we touch turns out bad.","We don't win. We never win. We lose all the time. We lose at every level. We lose with the military. We lose at every level. A story I love to tell is Nabisco. They're leaving Chicago. They're going into Mexico and get a lot of people going into Mexico. Buy stock in Mexico. Believe me. They're doing very well.","They're going into Mexico. But Ford is opening up a $2.5 billion plant. You know, what $2.5 billion if for a one-story plant is? That's a big plant. They're building this massive plant, and I've been talking about this for two years. But now, the other day in the Wall Street Journal I read a story. Ford is going even bigger in Mexico.","You know, why? Because nobody talks to them. I don't mean talk. I mean nobody -- it's sort of like scolds them a little bit. Like can't do that, can't do that. Because the other day in the Wall Street Journal, there's another story. They're moving an even bigger into Mexico, right? And bigger. Because nobody talks to them.","Nobody said it's bad what you're doing. So Ford goes in and they're building a $2.5 billion plant. So instead of building in Michigan or wherever they're building and then closing plants. When you build this plant, you're closing some place. They're building this massive factory and they're gonna sell cars and trucks and parts and they're gonna sell them right into the United States, OK? Now, people are smart.","You don't have to even be a good business person to know that's no good for us. I mean, what do we get? We get close factories or we lose the jobs. Same thing as Carrier, same exact thing. And in Mexico, they get this massive plant that's gonna employ thousands and thousands of people and they're gonna sell the cars all over the place, but they're gonna sell them to the United States.","And now on top of it, it was such an easy deal that they're doubling up and they're gonna make it even bigger. I mean, literally. Hard to believe. This was announced two days ago that they're going in even with bigger and they want to keep the publicity down because they don't want it to stop. But they want to keep the publicity down.","So when these other candidates, let's say, Hillary. Hillary. Hillary. Can you imagine her as president with the turmoil? No. No. No. And by the way, the last person she wants to run against is me. Remember three weeks ago, Donald Trump is sexist. Oh, did she suffer after that. I brought her husband into the equation, right?","Oh, did they suffer? That was a long weekend for them. The last person -- I know it for a fact. Hey, I know Hillary very well. I supported Hillary. I supported -- you know, as a world-class business person, as a business person, you got to support everybody. You got to get along with everybody. I know these people very well.","She suffered. And her people told me the one person she doesn't want to run against is us. We're gonna have so much fun. I hope it's going t be Hillary. No, no. I hope it's gonna be. And then Chuck Todd, he's a nice guy. He's the anchor for NBC Meet the Press. He said, I have it on personal knowledge that Hillary Clinton wants to run against Donald Trump.","I said -- I call him. I said Chuck, you don't understand. When they announced that they want to run against that person. That's the person they don't want to run against. You understand? You know, a little chess, Chuck, not checkers. It's chess. When they announce they want to run against somebody that means that's the one they don't want to run against.","Please remember that. But they don't remember that stuff, but that's OK. It doesn't matter. It's irrelevant. But they don't want to run against us because we're gonna win so big. So when they go to Hillary Clinton and they say, Ford is opening up a plant. Now, they're gonna double it. Now, they're gonna bring more.","Now, they're gonna empty out the whole United States. By the time they figure, they're gonna build this massive thing. She knows it's no good. But all these people that I'm talking about they're at debate the other night. They're all loaded up all over the room. You heard it. I walk out. I have my kids in there and my wife and they're clapping like crazy.","But you know, a few people isn't so good. They love me, but they're clapping. But you had 1,800 or 1,900 people. They're special interest, lobbyist, many of whom I know. And frankly, there's couple of them are friends of mine and they're laughing as they're booing me. They're booing. Donald Trump, boo. Boo.","Boo. And they're laughing and waving at me and I'm waving at them and I'm saying it's a game. But these are supporters of Marco Rubio, for the most part. I mean Jeb Bush answered one question. He couldn't even speak. He's stumbling all over the place. And he gets a big ovation, right? I answered about the judges and I gave a great answer.","And I said, you've got to keep it going. And Mitch McConnell, you can't take the judge. I even gave two names of two great conservative judges: One from Alabama, one from Wisconsin, highly respected. And I got a nice, you know, little like this. Jeb Bush gave some answer and it was like incoherent. Oh, that was great.","That was great. You know why? They're the people that gave him the money to run. And if he wins, they're gonna have total control. Same thing with Marco. I mean, in that case, it was really those two that -- and which by the way, the Republican National Committee did a horrible job of ticket distribution, that I could tell you.","Establishment. They did a horrible job, a horrible job of ticket distribution. And the problem is because I'm self-funding, I don't have any donors in the room. There is nobody giving me money. And some of these guys -- you know, it's very funny. One guy came in and he went to give me a lot of money and they gamble.","I mean, I know these guys so well. Half of them I know. And some, I like. Some, I don't know. Some are good guys. Some are horrible guys. But I know them sort of almost all. And I'm looking at the room I say, wow, that's all the fat cats. That's all the bosses out there. That's the bosses of the politicians.","That's when you want to negotiate with Ford and then Ford is gonna send six of those guys up to see you as president. And if you took money from them, you're not gonna make a deal. Whereas, I'm gonna make a deal with Ford. I'm gonna say get back into the United States or we're gonna charge you a lot of tax.","I'm not gonna let this stuff happen. Not gonna let it happen because I don't care. Our country is being blood sucked. I'm telling you, our country what's happening is we're losing our industry. We're losing it and we're losing it because people want to be conservative. No, let me tell you. I'm more conservative than anybody but I'm commonsense conservative.","People -- you -- I believe in free trade, but we got to get something out of it. We can't have free trade where we lose $500 billion here, where we lose $100 billion with another country and $50 billion with another one. We can't do that. Because it's just like the borders. Without borders, we don't have a country.","Well, without money coming in the other direction, we don't have a company. We don't have a country. So we're gonna build a wall. Somebody just said we will build the wall. Believe me. We'll build a wall. It's gonna be a real wall. No, I'm telling you. These politicians -- don't forget we started off with 17. There were so many, it was like -- oh, it's terrible.","I mean some of these people like I don't want to mention names like Pataki, who is there. No, I don't want. Well, I like Lindsey Graham. I actually like him, but he had zero. OK? Good. Now that I hear the tone in the room, I actually didn't like him too. No, the guy came to me -- remember, he came and gave me his cellphone.","He said, could you give a contribution? Could you set me up with some people? Could you give me a contribution? That was years ago. So when I went up and I saw he was competing with me and you know, I said -- Remember, I said, let's see if this old cell number works. I don't know why I had his number. It was like 4 years old.","So they called it and his phone exploded. Do you remember? We went out public. His phone exploded. It went like boom. It crashes. Anyway. But, but -- and I don't know. Do you like Lindsey Graham or not? Tell me. No. I actually think he's a nice guy. Is he gonna be re-elected or not?","Tell me. No? All right. Well, maybe if I supported him he'd be re-elected, right? Well, I disagree. I disagree with his warrior mentality. You know, because if you listen to his mentality we'll be in the Middle East for another 15 years, OK? You get a knockout one at a time. You can't fight Assad and you can't fight Syria and they're fighting ISIS and we're gonna fight ISIS too.","So we're fighting ISIS who is fighting Syria and we're fighting Syria who is fighting ISIS. And we don't know what the hell is going on. And we've got -- we're backing people that we have no idea who they are and they're fighting Assad. And then if they win, they'll end up being worst Assad and we'll spend another trillion dollars on them.","Nice and easy, folks. And I'm the most militaristic person in this room except for Al. Al is well. But I'm the most militaristic person in this room, but you got to know what you're doing. Think of it. They all say, fight Assad. Fight Assad. Assad is a bad guy. They're all bad guys. Not too many good guys over there, right?","They're all bad guys. I mean, why did we get by knocking out Gaddafi, right? Nothing. Why did we get by knocking out Saddam Hussein? Saddam Hussein is bad guy. But Saddam Hussein would keep Iran under control because the armies were the same. The military, strength and power was about the same. He'd keep them under control.","And frankly, you know, in all fairness, there were no weapons of mass destruction. But what did we get out of it? Saddam Hussein killed terrorists. He would kill. There were no terrorists. He would kill them immediately. He didn't do it politically correct. He found the terrorists. They were gone within five seconds, OK? With us, we find a terrorists, it's gonna be 25 years under trial.","And by the way, by the way, for South Carolina, we are not moving any people from Gitmo to South Carolina. That I can tell you. None. None. We're keeping Gitmo open. It's cheaper to Keep it open and we're gonna load it with bad dudes. If they make it there. And -- OK, let me talk just for a second and then I'll get the hell out of here.","You go home. You can go watch Bush tonight, right? I don't think too many people are gonna watch. Let let me just say, so let me just. So I'm running against different people. It's so important that we win. It's so important that we start turning this country around. I'm running against politicians.","Now, you look at what's going on just the one question. I was on the debate. Ted Cruz was on my left. And they asked him about waterboarding and he was incapable of it. Take a look at the way he answered the question. I think he's a very unstable person to start off with. He couldn't answer the question.","He's going, well -- he was afraid to say waterboarding is OK, right? You remember, right? Two weeks ago, three weeks ago. Not the last debate. I think the one before -- anyway. Because the last debate everybody was shouting at me. There wasn't time to talk about waterboarding. But they were shouting at me for a reason.","If they weren't shouting at me, I'd be very sad because that would mean we're not doing too well. When they're all going after you -- and we've had a lot tougher competition than those people believe. But when they're all going after you, that's a good thing because that means you're doing well. But they asked Ted Cruz, they asked Ted Cruz, who by the way, is very very weak on illegal immigration.","So is Rubio, very weak on illegal immigration. And Bush is so weak that he calls it an act of love, right? That immigration -- here's Bush, immigration is an act of love. They come full of. I said, excuse me? Excuse me? You look at the crime. You look at the problems. You look at what's happening even to the economy.","You know, they were talking about the dreamers, the dreamers, people coming over from other countries. I said, I want the children of this country, of our country to be dreamers too, you know? Not always the dreamers from outside. I was asked that question today. First time, in a long time, I was asked that question today about the dreamers coming in and the dream.","And I said, first time I've been -- I've heard that question in three months. I said, you know what -- dreamers is everything's fine. But I want the children of the people from this country to also be dreamers. I want our children to dream. I want our children to dream. So remember this. They're chopping off heads in the Middle East.","That hasn't happened, I guess, since medieval times. You know, I love history. I'm sort of a semi student of history when I have the chance. But it's like since medieval times, chop off heads it's like chopping off heads. Whoever heard of this before? They're chopping them off. James Foley, a great young guy, that was sort of the beginning.","But they chop off heads and then they send, they send the videos all over the place. So that's happening. We're not gonna let this go. So they ask Ted Cruz, sitting right here. What do you think of waterboarding? OK? Waterboarding. We're talking chopping off heads. Waterboarding. And he said, well, I don't know.","Well, I don't know. He couldn't couldn't answer the question, right? He couldn't answer. You saw it. And then they went to me and they said, what do you think? I said I don't think waterboarding is tough enough. I think we need much tougher. And as far as, I'm concerned that's OK. It's OK. Well, they said, what do you mean?","I said, let me tell you. I said they're chopping off the heads of Christians and lots of other people in the Middle East. Waterboarding is fine and other things that are a lot tougher are fine, and that's OK with me. And you know what? I got a standing ovation. I didn't know it was a good thing or bad. I didn't poll it. I can tell you.","You know, these guys, if you ask them a question, they pay hundreds of thousands of dollars to pollsters. And when you ask a guy like Cruz, a question like that. They like to poll it. So they go out to the people and they say, what do you think of waterboarding? They do all sort. With me, I said this. I had no idea.","I don't care. I speak the truth. I speak the truth. I just speak the truth. So we're gonna get our country back. We're gonna have a strong country again. We're gonna be respected again. We're not gonna be a laughing stock like we have been, and we have been believe me. All over the world, they don't respect us anymore.","They don't respect us anymore. These politicians don't know. Thank you, darling. I love you too. Ohh, I do love you. We're gonna be a respected nation again. We're gonna be a respected nation. So you know, I began by saying, I came down that escalator with Melania and I never saw so many cameras. It look like the Academy Awards.","I mean, literally like the Academy Awards. And I said, we have to do it. When I made my speech, I talked about illegal immigration you. Wouldn't even be talking about it if I didn't make that speech. You wouldn't even be talking about it. And then everybody came and then I talked about the borders and we have to have borders and we have to have the wall.","All of this. And then beautiful Kate in San Francisco was shot in the back by an animal, who came over here five times. Shot her in the back in San Francisco. And with all of the things that we had, think of it, and it just started. But what's gonna happen is this. We're getting rid of sanctuary cities. Getting rid of it. We're getting rid of it. It's almost like -- you know, these sanctuary cities -- in San Francisco, I think, if I -- I own a big building there.","I own a big chunk of the Bank of America building in San Francisco. Who would think of it as sanctuary cities? In Florida, they have like six or seven sanctuary cities. It's almost like a place where criminals can stay and be left alone. It's crazy. Who would think of these ideas? So what we're gonna do is we are gonna use great judgment.","We're gonna start off with a word that's very special, heart, because we all have heart. We're gonna have great health care. And for the people, the few people, the little, the small, we can't let people die in the streets. Do we agree? We're gonna have great health care, but we can't let some people that can't afford anything die in the streets.","And everybody understands that. And Republicans understand that. But we're gonna have great health care. We're gonna have great military. We're gonna be respected so much. We're gonna win so much folks. We're gonna win. Sometimes I joke. I say we gonna win, win, win. You're gonna come to me. Beg me. Mr. President, we can't stand it. We don't want to win anymore.","We don't want to win. And I'm gonna say, yes. We want to be great. We have to keep winning I will not do anything else. We're gonna keep -- But the truth is we're gonna knock out ISIS. We got to knock them out. That's a cancer. We're gonna knock out ISIS. We're gonna knock him out strong. We're gonna get rid of ISIS.","We are going to have a country that you are gonna -- you love now. But you're get to love and respect so much more than you do now. And hopefully and I say this hopefully, you're gonna have a president that does such a great job that you are going to be so proud that you were here tonight. You're gonna be so proud that on Saturday, you're gonna get out and vote.","You have to get out and vote, folks. You have to get out and vote. Unlike these other people, unlike these other people, I don't want your money. I only want your vote. So you have to get out. Saturday is such a big day. Keep it going. We're gonna use common sense. We're gonna use heart. We're gonna use business skills.","We're gonna use our best people. We're gonna use people that are so much more talented than there are anywhere in the world. We don't use them. We're gonna use them and we're gonna make America great again, greater than ever before. OK? Thank you. I love you. Thank you. Thank you, everybody. I love you."],"text":" There's no way I'm leaving South Carolina. And I was going to leave for tonight. Come back. I said, I'm staying. So I'm saying here for five days. We've got a win on Saturday. We've got to win. Make America great again. We're gonna make America great again. We're gonna win. You know, it's been an amazing period. We've been all over the state today. I love you too, darling. Look at her. Oh, I love you. I love you, all. I love you, all. So many things are happening for our country and it's -- this is a movement. Time magazine last week did the most beautiful story cover and they talked about it. It's a movement. They've never seen -- they say there's not been anything like this. I don't know ever, but they actually say ever. We went to Tampa the other day, Tampa, Florida on like two days notice. 15,000 people. They had to turn away 5,000. And by the way, for all of the people in this room, I can't believe it. This is a huge room. But downstairs, they're filling up another one and they're sadly sending people away. We don't like that, right? No? OK. Why don't we all get up. Go. Let's have night now. No. And we have one of the great veterans, Al. Is that Al? Stand up. Wow. One of the great, great -- you are great. I love this guy. He loves the veterans and I love the veterans, and we're gonna take care of our veterans. I'll tell you that. We're gonna take care. They're not -- they are not properly taken care of. So we're gonna take care, right? We have several -- look at this. I knew you guys would say that. I could spot a veteran a long ways off, but we are -- we're gonna take great care. We're gonna take care of our military. We're gonna take care of our military because our military is being whittled away, whittled away. We're gonna make our military so big, so strong, so powerful. Nobody is gonna mess with us anymore. Nobody. Nobody. Nobody. So Nikki Haley, a very nice woman. She made a speech the other day. You saw that and she was talking about anger. And she said there's a lot of anger and I guess, she was implying all of us, you know, really referring to us. And by the end of the day, she was actually saying that Donald Trump is a friend of mine. He's been a supporter of mine and everything else. You know, the tone at the beginning was, as I said, by the time that she was just barraged with people. She said, I think we better change our path here. And by the end of the day -- and it was fine. It was great. But she said, yeah, there is anger. But I said, there is anger. And I was asked during -- not this debate, but the previous debate, I was asked -- by the way, didn't you love this last debate? I sort of liked it. They came at me from every angle possible. No, no. They came at me from every angle. You know, it's sort of interesting. They were hitting me with things like and such untruths. You know, I never realized. I've always known politicians are dishonest, but I've never known the level of dishonesty. And I deal in the industry, it's a lot of different but mostly real estate and like in Manhattan and different places. But I've never seen people as dishonest as politicians. They will say anything like -- OK. So a lot of you people understand and you get me and you've seen the speeches and you've seen a lot of it. And you know that I protect the Second Amendment more than anybody, by far, right? More than anybody. And this guy, Ted Cruz, gets up and says, Donald Trump does not respect the Second Amendment. I mean, more than anybody, I'm with the Second Amendment. So -- no, no, it's lies. And then they do commercials. And you know, he did it to Ben Carson and him in particular. In all fairness, Jeb Bush represents but these are minor misrepresentations and he's not going anywhere anyway. So what -- who the hell cares, right? No, it doesn't matter. Well Jeb was talking about eminent domain. Donald Trump used eminent domain privately. And then I see there's a big story -- I had to bring this out. Look, proof. Jeb Bush under eminent domain took a disabled veteran's property. He's talking about me. No, no. It's me. Honestly, these guys, these guys are the worst. Eminent domain. Without eminent domain, by the way, you don't have highways, roads, airports, hospitals. You don't have bridges. You don't have anything. So they say, Donald Trump does not like eminent domain. I don't like eminent domain, but you need a road, you need a highway, you need -- you know, it's funny they all want they all want the Keystone pipeline, right? But without eminent domain, without -- think of it. Without eminent domain, you can't have the Keystone pipeline and we're gonna get the Keystone pipeline approved. But, but -- it's jobs. It's jobs. But remember this. When it gets approved, the politicians could may be approve it, but I'm gonna approve it. But I'm gonna make a deal where we get a big chunk of it for the people of the country. Why should we just approve it. They're going through our country. It's different -- it's a different way of thinking. It's a different way of thinking. Let me give you an example. I saw this -- first time a few weeks, I've been talking about it, the drug companies. The drug companies are the largest -- we are the largest purchaser of drugs in the world, right, in the world, by far. We purchase numbers that nobody would even believe. And yet, we don't really negotiate the price of drugs because we're prohibited from doing so. If we did, we would save perhaps $300 billion a year. That gets to be serious money. $100 billion here, $100 billion there. All of a sudden, you have a lot of money. But we'd save perhaps $300 billion, could even be $350 billion a year. Now, why? A friend of mine, who's a doctor, comes up and says, Donald, I don't understand it. You go to the drugstore. The United States pays the same as Mr. Schwartz, who walks into the drugstore to buy drugs. It doesn't make sense, right? I said, of course, it does. These guys that I'm running against and others, politicians, meaning, they get campaign contributions from the drug companies, OK? They get campaign contributions from the drug companies. So all of a sudden, you have a non-competitive business. I get no contributions. What I'm doing is funding my own campaign. So I don't get it. Except for the little tiny ones that people send in for $20 and $100 and $200. And you know, it's hard to send it back. How do you send it back? And it doesn't amount to much, believe me. But how do you send it back? You can't send it back. You'd hurt the people. You actually -- number one, of course, it would cost you more to send it back than it's worth. And number two, you hurt their feelings. But I'm not accepting. So I'm not taking money from the drug companies, from the oil companies and lumber and everything else. The numbers that you can save -- I'm self-funding. The numbers that you save are so astronomical. The problem is these candidates they're all taken care of with campaign contributions and they can't do it. So, as an example, Jeb Bush. Woody Johnson. You ever hear of Johnson and Johnson, right? Big drug company. Big pharmaceutical company. Big company. He's in charge of fundraising for Jeb Bush. So he raises a lot of money. Jeb Bush raised $148 million. He's wasted almost all of it. Think of it. Most of it -- the only reason I even bring somebody in a press conference and say, why do you mention Jeb Bush? He's not competitive. Although his brother came today, they're having a thing. They're trying to make competitive, but I don't think it's gonna happen personally. I don't think. I don't think so. Who the hell knows? Maybe. Who knows, right? But they say, why do you mention? Because he did $20 million of negative ads on me. You know, when you do that -- and for some reason, my numbers keep going up. So they can't be very good ads. They can't be. They can't. So when you look at what's going on and let's say now, I want to save the $300 billion. But I'm Jeb Bush and you say, we're gonna save this money. Then Woody Johnson is gonna call him. Jeb, you can't do that, Jeb. Can't do that. I worked hard for you. Lobbyists are gonna call them or the lobbyists are gonna call Ted Cruz, who's, you know, a dishonest guy. He's a liar. I mean, he's real lier. They're gonna call him. They're gonna go Ted, you can't do that. You've got another race coming up in two years. There's no way you can do that. These guys supported you or they're gonna call Marco. Marco Rubio, who stood with me. He was with me when he had the meltdown and I'm telling you it wasn't a pretty sight. No, he was standing right there. No, he was -- he was soaking wet. I'm telling you. He was wet. Boy, I say, what the hell is going on over here. I thought he just came out of a swimming pool. He was so soaking. Look, I said, wow. I said, are you OK? Now, when we get in with Putin, we need people that don't sweat. Let me tell you. No, it's true. Got to have people that don't sweat. Can you imagine Putin sitting there and waiting for the meeting and this guy walks in and he's like a wreck. No. You got to have Trump walk into that meeting, folks. We'll do very nicely. We're gonna do very nicely. It's funny these guys. So Putin said nice things about me. I don't know Putin, but he said nice things about me. He said Trump is a genius. And Trump is gonna win and Trump is leading the party. All right. He said nice things. Look, you know, I always like a compliment. We all like compliments. Not gonna influence. Believe me. I'm gonna do what's right. But he said these things. So the other people said we want you to disavow what Putin said. First of all, I say this. Guy calls you a genius, you're not gonna disavow. Do we agree? Only a stupid person would disavow. Not a genius. No genius would disavow being called a genius. But more importantly, if you look at it. Wouldn't it be nice if we actually got along with Russia and other countries? Wouldn't that be nice? I heard them saying this morning on television. How dare they want to -- Donald Trump wants to work with Russia to get rid of ISIS. Yeah. Sort of, right? You know the cost of missiles that are a million dollars a pop. It would be nice to work with somebody else. Let them drop some of their missiles. We'll get rid of ISIS. But they were talking about working with Russia like we have -- we have to do it ourselves. Why do we have to do everything ourselves? We're like the policemen of the world. You know, our military takes care -- I've seen so many things. There are so many different ways to save with a business person, and I'm really good at this stuff I tell you. Remember when I put my papers in. They all said, wow. That company is unbelievable. It's an unbelievable company I built. And now, I want to put that thinking and I'm not doing that braggingly. I have very little debt. I have some of the best assets, some of the best real estate assets in the world. They're great. Great cash flow. Everything good, right. But I'm not saying it bragging. I'm saying it because that's the kind of thinking we need right now. We have $19 trillion in debt. We have $19 trillion. It's so sad. You know, you look at what's happened. You look at what's going on, $19 trillion. And then your politicians, not mine. But they are mine too unfortunately. But a month ago, they make this omnibus budget. Did you see this thing? Obama got every single thing he wanted. He got where the migrants can come into our country. He got funding. He got funding for the illegal immigrants. Let me tell you about the migrants. You know what, we all have, we all have a heart and I have as big a heart as anybody. We have to take care of people. But you can't let people into this country who don't know -- we don't know where the hell they are, where they come from, where did they originate from. You can't let it happen. You can't let it happen. I mean, we have people. And you look at those lines. You look at the migration. You take a look at the Migration. And you say that's strange. So many men, strong, young men. Not many women. Not many children. I'm saying, what's going on over here? Maybe it's a Trojan horse. I doubt it. But you know, a lot of people are gonna come in. They're gonna be bad people, in many cases. And you see what two people -- look at these two radicalized people that got married. That shot the 14 people and killed them that gave them anniversary parties and children's parties and they went in to kill them. So there's something going on. And when I -- actually, I did it in South Carolina. I told people in South Carolina, we have to have a temporary ban on Muslims coming into this country. I'm sorry. I'm sorry. And it will be temporary, hopefully. But if we don't find out -- look, it's radical Islamic terrorism, OK? There's a lot of hatred. We have a president, we have a president who won't even use the term when it's obvious that that's what it was. Won't even use the term. We have to solve the problem. You can't solve the problem if you're unwilling to even say what the problem is. We're gonna solve the problem, but we have to be tough. We have to be vigilant. We have to watch. You know, when these two young horrible people that got married. They talk about the couple. The one -- the couple. Give me a break, right? When these two people that got married, they killed the 14 people. Well, in their house, an apartment, they had bombs laying all over the floor. Other people saw that. Why weren't they reported? People knew what was going on. Why weren't they reported? To me, those people are just as guilty almost as the people that did the shooting. Why weren't they reported? And the reason is possibly that they liked what was going on. We can't have it. Look, we've got to have a country. We've got to have a country. We've got to have -- we're gonna have a great country. We're gonna get rid of some of the stuff. We're trying to be so politically correct that we can't function anymore. We can't function. Take a look at Germany. Take a look at Germany. Everybody expected I was gonna get Time Magazine of the year because look at this, look at this people but everybody expected it. And by the way, we have the same crowd downstairs. Can you believe after I'm finished, I have to do this again? Do you think this is fun? Do you think this is fun? And then they said to wait 3,000 people. So we're gonna have like close to 10,000 people. Amazing right? Well, well, we did give you three days notice, right? Can you imagine? It's such an -- No. It's an honor. It's an honor. And you know why it's an honor? Because no matter where we go in the country, these are amazing people, whether it's Dallas, Mobile, Alabama, we had 35,000 people. We started with a hotel then we went to a football stadium because the hotel, you know, no hotel is gonna had -- and we ended up with 35,000 people. We go to Oklahoma, we had 20,000 people twice. No matter where we go and New Hampshire was unbelievable. They have smaller venues, but we had the night, the night -- literally before, we had a blizzard. We had a blizzard. We had the Verizon Arena. We had 5,000 people in the Verizon Arena during a blizzard the night before. A great victory for all of us. It was a great victory. New Hampshire was so amazing. It was a victory for all of us. It's not a victory. I'm like the messenger. I'm a good messenger, I think, but I'm like the messenger. But people are tired of what's going on in our country. We're tired of the Iran deal, where Iran gets $150 billion. We get nothing. They laugh at us. They take our sailors and they put them in a begging position, with their hands up and they put guns to their heads. And frankly, they'd still be there except for the fact that they got $150 billion two days later. They're not stupid people. They're great negotiators, the Persians. We have the worst negotiators. We get nothing. We have 24-day inspection periods. Think of it. You don't go there for 24 days, but the clock starts ticking. It could be six months before you could go and inspect. Then they have self-inspection of some areas. Can you imagine that? You know, Obama calls the leader, the supreme leader, right? I promise you will never hear a supreme leader from me. He will never be called, he will never be called this. No, not gonna be called. No. It's such an embarrassment. It's such an embarrassment. We make these deals. And the saddest part -- I said this to somebody the other day. What do you regret? I said the biggest regret is that we've already given them this hundreds of billions of dollars because frankly, the rest of the deal -- I could take deals and make them good no matter how bad the contract is. I find ways. But you know what? The money is gone. The money is gone. And here's what they're doing. They're going to Italy. They're buying tremendous amounts of stuff from Italy. They're buying 118 airplanes from Airbus, not from Boeing. We want Boeing, right? Oh, you want Boeing. No, no. But they're not buying it from you. And be careful Boeing, I'll tell you about Boeing. But they're buying missiles, they're buying all the stuff. They're not spending the money with us. Now here's what's gonna happen with Boeing because I love Boeing and I know you went through hell to get Boeing. But China now is insisting that in order to get the big order that Boeing build a massive plant in China, OK? Now think of it. You know, what I'm talking about, right? Does everybody know this? So they're taking all of their intellectual property as part of the deal just to buy an airplane, a lot of them. But China is gonna build massive plants now and the, you know, Boeing is gonna spend the money. But they're taking intellectual property. They're taking everything. And you know what? You have your plant but unless a guy like Trump is in charge, that plant will be in jeopardy very quickly. You better be careful. Just remember it because China current -- the currency manipulation that China does is like a great chess master. It's brilliant. What they do is incredible. And they always wait till we have a problem because it's a problem -- like we have a problem, so they reduce, you know, they take currency manipulation. What they do is incredible. And you can't compete as a business. And we have all the cards because they take our business out of here so quick like we're babies. Just like candy for a baby. So Boeing, I just tell you in terms of what you have and what you've built, be careful because they want to take those planes and they want to make them in China. And that's not good. That's not good. But believe me if I win, it's never gonna happen because -- never gonna. Never gonna happen. I don't even know that I'd let Boeing make the kind of deal they made where they're building this massive plane factory. I don't even know. In other words, in order to build to get the order, we want you to build this massive factory. So then you say, well, what good does it do for us? You saw just the other day where Carrier, air conditioner maker. I buy many many Carrier air conditioners. I think I'm gonna start buying other air conditioners now. I think I'll go with Trane. I'll go with somebody else. But Carrier just closed up a big plant. They had a big one. They're moving their air conditioning business to Mexico. And somebody was taking it through her cellphones. You know, it's amazing these cellphones because you can take it. As they're all being laid off by somebody saying, we're moving to Mexico. I'm sorry, your jobs are gone. Just like that. People have worked there for years. Their jobs are gone. So Carrier is going to Mexico. Now, I'm good at this stuff. Some of you are good at this stuff. How does it help us? We lost Carrier. Carrier is gonna Mexico. They're gonna make air conditioners. They're gonna sell them back to us. We get nothing. So what I would do is I would say to Carrier. Listen, I don't like what you did. And you can sell all the air conditioners you want to us and you could make them in Mexico, but you're going to pay a 35% tax every time you sell an air con. It's the only way we come out, honestly It's the only way we come out. You know, I know all the different ways. It's all corporate inversions and all stuff that the politicians that I'm dealing with, this Ted Cruz. The guy has never employed a person in his whole life, OK? Never employed a person in his life. And these guys -- they're not gonna tell you that I've employed tens of thousands of people. By the way, I get along so great with the Hispanics. In Nevada, they just did a poll. I'm leading with the Hispanics, right? I get along great. Great. But these guys, they never employed anybody so they don't know about corporate inversion. We're losing our businesses to -- you know, it used to be that a business would leave New York and come to South Carolina or come to Florida. No more. Now, they leave here and they go to Europe and they go to Asia. Pfizer is moving to Ireland. They made a good tax deal. There's $2.5 trillion over in different parts of the world, outside of the United States. It's probably five. The government says $2.5 trillion. Usually, you can double it because they're embarrassed. Everybody agrees that the money should come back into the United States. That's a lot. Companies cannot get their money back in. The Democrats agree. The Republicans agree. They need leadership. They don't have any leadership. They can't make a deal. So here's -- everybody agrees. Who doesn't want the money coming back in? They can't get the money back. So what's happening is companies are leaving the United States to get their money. They're also leaving to get lower taxes, OK? So my tax plan, as you saw, cutting it big for the middle class. Big, big, big because the middle class has been forgotten in this country. Believe me. It's been forgotten. And I love the middle class. Actually, the people I don't get along with are the rich people. I don't like the rich people as much if you want to know the truth. I actually -- actually, there's a lot of truth to that. But we're gonna take care of the middle class and we're gonna take care of our companies because our companies were the highest paid -- look, in any respect, in every respect, from a tax standpoint, we have the highest taxes anywhere in the world. OK. So then you wonder why we don't have business. And one of the reasons we don't have business because we pay so much. We need the tax. But what the tax is doing is it's driving people out and they're coming out. So we're gonna do things like the following. We take care of South Korea. Every time I go to television sets -- and by the way, air conditioners. Well, now it can also go to Mexico, right? But air conditioners -- all the stuff made in South Korea: Samsung, LG. I buy thousands and thousands of television sets a year for different projects, right? I won't be doing that too much anymore I hope. I hope I don't have to buy it anymore because, you know, I hope I can focus on the United States not on buying television sets. Does that make sense? Really. That would be so boring ordering 4,000 television sets for a big project someplace. I'd say, uh, this is -- I want to focus on the united -- I hope I don't have to buy any more of this stuff. Thank you, darling. I agree. I agree. But they make -- they are a behemoth. And yet, we have 28,000 soldiers. Great, young, beautiful people on the border between North and South Korea. This madman. And he's got nuclear. And I tell China, you better fix that because otherwise, we're not gonna be so nice to you on trade. Because again, China needs us more than we need China. Just please remember that. Obama never figured that out. Because why? Because they're sucking our money out. We have rebuilt China. We've rebuilt -- you go to China, they have bridges like the George Washington Bridge all over the place. That's like, that's like a little bridge. They're building roadways. They're building airports. They're building things. You go to places like Qatar. You go to places all over the Middle East, it's the most incredible thing. Then we come home, we land at LaGuardia Airport, with potholes all over the place. It's like we're a third world country. It's true. You see airports in different parts of the world because I travel to these places that are beyond belief. I was in Qatar, which they say Qatar. I've always said Qatar. So I'd rather say it the way I say it. But I was in Qatar and they were showing me the airport. I said this is the most beautiful airport. They had spas while people are waiting for their planes. Spas. They had a gym. They have the most beautiful waiting rooms, reception rooms. I said this is the most beautiful airport I've ever seen. And he goes, no, no, no. No, this is not the airport. This is just temporary. The real airport is over there. And I look and there's 40 cranes building the most incredible airport. The one that I said is the most beautiful is a ripped down. And we have LaGuardia and we have Newark and we have LAX and Kennedy and they're all falling down and falling apart. It's so sad. Those days are over, OK? Those days are over. They're over. So when you hear how much we spend on military, it's really a misnomer because we don't get -- just like I told you about the drug companies, where we're gonna bid it and we're gonna save billions and billions and billions of dollars, right? That's all goes to the budget, folks. It all goes. You know, when you see the kind of deficits, the kind of losses we have. It all goes to the budgets. With the military, it's even worse because a lot of times and you've all read. I've been reading it since I'm a kid. They buy equipment that they don't even want because the company that makes that equipment is politically connected much more so than the company that has equipment that they do want. We're gonna get the equipment that we want because see, again, I'm not taken care of by these people. We can buy the right equipment and sometimes -- do you ever see where they order a fighter, a jet fighter and it's not the one they want, but it's the one that they're getting and it's being rammed down their throat by the politicians. Those days are over. We have -- you know, we have the F35. We have the 35 fighter where China has copied it. Did you see that the other day? They have a picture of the 35 F35, it's a new fighter. We come up with it. We develop it. It's very complicated stuff. We develop it. China has knocked it off. You look at that and this. We do the work and now they have to come up with a new concept. I tell you what, folks. It's like -- it's just so hard to believe. But you got to take a look at it. Look at it, the planes are almost identical. So we do all the work. We do all the development. They copy it. They steal it off our websites. They probably get it off Hillary's emails, right? Right? Wouldn't you agree? I think so. I think so. No, I think so. And by the way, we'll beat Hillary. We have some great polls that just came out. We'll beat Hillary. These other guys. Assuming she's allowed to run, assuming. I mean, I'd write I'd rather run against a communist in this country because I know we haven't gone that far. I'd rather run against Bernie to be honest with you, you know. No, I did say communist, by the way, you understand that now. So I would rather run against a socialist/communist in this country, but I don't think that's gonna happen. I think it's gonna be Hillary because she's being protected by the Democrats. She she will probably get through. Now General Petraeus suffered. And remember I think I helped him. I said leave him alone. Did you see -- on top of everything else, they want to reduce his rank. And for the last four or five weeks, I said leave him alone. We have to beat ISIS. Leave this guy alone. He's suffered enough. Leave him alone. You know what, they announced a couple of weeks ago. They're gonna leave me alone. I hope I had something to do with it. I don't know. They had to focus their energy on ISIS. They had to focus their energy on winning trade deals. And you know, I say it all the time. We don't win anymore. We don't win anymore. We don't win with trade. And I'm telling you, I know the big Boeing stuff here. But be careful because in five years, all of a sudden, you're gonna see it's gonna go to China and it's gonna go to other places. Just be careful. You won't have to be careful if I'm President. I'll be careful for you. It would be so easy. You won't have to be careful. Not gonna have to be careful So our military is gonna start winning again but we're hopefully not gonna have to use it very much. We shouldn't have gone into Iraq. That was a big mistake because it destabilized the whole Middle East. And some people say, oh, don't say that. Look, we made -- we made a tremendous mistake. We went into Iraq. Shouldn't have happened. Everything you see right now is an offshoot of that decision. That was a very bad decision. Then Obama got out the wrong way. He came out. I mean, here's a guy he announces the date that we're leaving. So the enemy pulls back. And I'm saying can you imagine General Douglas MacArthur or General George Patton, these are tough killers. Can you imagine they must have been going nuts. They're spinning in their grave. Obama announces a date. We are leaving on such and such a date. So the enemy pulls back. What do we have to fight for they're leaving. We leave 18 months later and they go. And look at the mess and look at what they've got. I'll tell you. Iran, the deals they've made, not only the 150, I mean $150 billion. I used to say what a great deal. It was one of the best deals I've ever seen. It's actually one of the most incompetently negotiated deals. For instance, our prisoners. I say this because it's like 101. It's like the Art of the Deal 101, OK? But anybody read the Art of the Deal in this room? Yes. Lot of people. Kerry didn't read it and Obama didn't read. But what you do is you go in right at the beginning, three years -- this deal took forever. It seems like it's been going on forever. But let's say they have our prisons. Three years ago, you go in. And you say, fellas, got to release our president, sorry. Gotta do it. Bad for you. Bad for us. We need them. You don't. Your people don't care. Get away. It will send a good signal. They will say no. We'll say, bye bye. We're going. Well, no deal. Now, you leave. You double up the sanctions. They were choking. They were choking. You double up the sanctions. Within 24 to 48 hours, they'll call. We got our prisoners, right? Now, here comes the tricky part. Now we have our prisoners. They're gone. This is four years ago, not the other day when we released them and we got -- you know, we gave -- basically what did we do? We gave them $150 billion for four prisoners, OK? $150 billion for four prisoners. And it sets a terrible precedent, by the way. It sets a terrible precedent because what you're doing is you're negotiating with people, terrorists. It's not good. So we paid this money. Look, now we go in. And we say, OK. They're on the show or they say, fellas, we got a problem. You know somebody like to actually from the press love this story because my father was a great guy. He taught me a lot. I learned a lot from my father. And he said, son, you're too direct. You're too tough you too tough. Take it easy. Easy. You got to take the lumps out, son. Take the lumps out, right? We've got to take the lumps out. And he said, you're too just -- so in the old days, I would have said, we're not giving you $150 billion. You're never getting it. They would have been insulted and would have been problem. You know, we wouldn't get -- so we still would have won, but it would have been nasty. So when we take the lumps. I say fellas, I got to tell you I've got a problem. We're a debtor nation. We owe $19 trillion. We just have these politicians -- by the way, the Republicans approved it. You know, we know where the Democrats are coming from. The Republicans keep approving this stuff. We just made a terrible deal. We're going -- oh, this is gonna cost us another -- budgets, it's another $2 trillion, right? So we're gonna owe $21 trillion. We don't have the money. There's nothing we can do. The $150 billion we want to give it to you so badly. We don't have it. We're poor. We're bust. We have -- they'll go crazy. At the end of a couple of days, they'll be fine, OK? We just saved $150 billion. It's true. That's way. See, that's my father. He would say, take the lumps out. I would have done it the other way. But you have to learn from people. He was great. So we take the lumps out. So now, they'll go nuts. We go back two, three days later, we got it. We just saved $150 billion. Believe me, I wouldn't give them $0.10. They wouldn't have gotten anything. So when somebody said, what's the biggest disappointment? So my biggest disappointment is that if I win, I go in and we don't have that $150 billion. And for the sake of a little negotiation and walking out of a room a couple of times, we could had it. It's so sad. It's so sad. I used as an example Sergeant Bergdahl. We get Bergdahl, a traitor. No, no. Think of it. We get this dirty rotten traitor that six people were killed. Six young, wonderful people military were killed looking for him. So we get Bergdahl, right? One guy and they knew that he was -- they knew that he was a traitor because they had a general and a colonel going and negotiating with the people that he was closest to. So they knew. So we get Bergdahl. They get five of the people that they most coveted that they've wanted for nine years and they got him. These are great killers. They are all back in the battlefield or soon will be. So we get Bergdahl and they get the five people -- but this is the way we negotiate. This is the way we negotiate. So we have a problem with the country. We got so many problems, but we have a problem and the problem is that every single thing that we touch turns out bad. We don't win. We never win. We lose all the time. We lose at every level. We lose with the military. We lose at every level. A story I love to tell is Nabisco. They're leaving Chicago. They're going into Mexico and get a lot of people going into Mexico. Buy stock in Mexico. Believe me. They're doing very well. They're going into Mexico. But Ford is opening up a $2.5 billion plant. You know, what $2.5 billion if for a one-story plant is? That's a big plant. They're building this massive plant, and I've been talking about this for two years. But now, the other day in the Wall Street Journal I read a story. Ford is going even bigger in Mexico. You know, why? Because nobody talks to them. I don't mean talk. I mean nobody -- it's sort of like scolds them a little bit. Like can't do that, can't do that. Because the other day in the Wall Street Journal, there's another story. They're moving an even bigger into Mexico, right? And bigger. Because nobody talks to them. Nobody said it's bad what you're doing. So Ford goes in and they're building a $2.5 billion plant. So instead of building in Michigan or wherever they're building and then closing plants. When you build this plant, you're closing some place. They're building this massive factory and they're gonna sell cars and trucks and parts and they're gonna sell them right into the United States, OK? Now, people are smart. You don't have to even be a good business person to know that's no good for us. I mean, what do we get? We get close factories or we lose the jobs. Same thing as Carrier, same exact thing. And in Mexico, they get this massive plant that's gonna employ thousands and thousands of people and they're gonna sell the cars all over the place, but they're gonna sell them to the United States. And now on top of it, it was such an easy deal that they're doubling up and they're gonna make it even bigger. I mean, literally. Hard to believe. This was announced two days ago that they're going in even with bigger and they want to keep the publicity down because they don't want it to stop. But they want to keep the publicity down. So when these other candidates, let's say, Hillary. Hillary. Hillary. Can you imagine her as president with the turmoil? No. No. No. And by the way, the last person she wants to run against is me. Remember three weeks ago, Donald Trump is sexist. Oh, did she suffer after that. I brought her husband into the equation, right? Oh, did they suffer? That was a long weekend for them. The last person -- I know it for a fact. Hey, I know Hillary very well. I supported Hillary. I supported -- you know, as a world-class business person, as a business person, you got to support everybody. You got to get along with everybody. I know these people very well. She suffered. And her people told me the one person she doesn't want to run against is us. We're gonna have so much fun. I hope it's going t be Hillary. No, no. I hope it's gonna be. And then Chuck Todd, he's a nice guy. He's the anchor for NBC Meet the Press. He said, I have it on personal knowledge that Hillary Clinton wants to run against Donald Trump. I said -- I call him. I said Chuck, you don't understand. When they announced that they want to run against that person. That's the person they don't want to run against. You understand? You know, a little chess, Chuck, not checkers. It's chess. When they announce they want to run against somebody that means that's the one they don't want to run against. Please remember that. But they don't remember that stuff, but that's OK. It doesn't matter. It's irrelevant. But they don't want to run against us because we're gonna win so big. So when they go to Hillary Clinton and they say, Ford is opening up a plant. Now, they're gonna double it. Now, they're gonna bring more. Now, they're gonna empty out the whole United States. By the time they figure, they're gonna build this massive thing. She knows it's no good. But all these people that I'm talking about they're at debate the other night. They're all loaded up all over the room. You heard it. I walk out. I have my kids in there and my wife and they're clapping like crazy. But you know, a few people isn't so good. They love me, but they're clapping. But you had 1,800 or 1,900 people. They're special interest, lobbyist, many of whom I know. And frankly, there's couple of them are friends of mine and they're laughing as they're booing me. They're booing. Donald Trump, boo. Boo. Boo. And they're laughing and waving at me and I'm waving at them and I'm saying it's a game. But these are supporters of Marco Rubio, for the most part. I mean Jeb Bush answered one question. He couldn't even speak. He's stumbling all over the place. And he gets a big ovation, right? I answered about the judges and I gave a great answer. And I said, you've got to keep it going. And Mitch McConnell, you can't take the judge. I even gave two names of two great conservative judges: One from Alabama, one from Wisconsin, highly respected. And I got a nice, you know, little like this. Jeb Bush gave some answer and it was like incoherent. Oh, that was great. That was great. You know why? They're the people that gave him the money to run. And if he wins, they're gonna have total control. Same thing with Marco. I mean, in that case, it was really those two that -- and which by the way, the Republican National Committee did a horrible job of ticket distribution, that I could tell you. Establishment. They did a horrible job, a horrible job of ticket distribution. And the problem is because I'm self-funding, I don't have any donors in the room. There is nobody giving me money. And some of these guys -- you know, it's very funny. One guy came in and he went to give me a lot of money and they gamble. I mean, I know these guys so well. Half of them I know. And some, I like. Some, I don't know. Some are good guys. Some are horrible guys. But I know them sort of almost all. And I'm looking at the room I say, wow, that's all the fat cats. That's all the bosses out there. That's the bosses of the politicians. That's when you want to negotiate with Ford and then Ford is gonna send six of those guys up to see you as president. And if you took money from them, you're not gonna make a deal. Whereas, I'm gonna make a deal with Ford. I'm gonna say get back into the United States or we're gonna charge you a lot of tax. I'm not gonna let this stuff happen. Not gonna let it happen because I don't care. Our country is being blood sucked. I'm telling you, our country what's happening is we're losing our industry. We're losing it and we're losing it because people want to be conservative. No, let me tell you. I'm more conservative than anybody but I'm commonsense conservative. People -- you -- I believe in free trade, but we got to get something out of it. We can't have free trade where we lose $500 billion here, where we lose $100 billion with another country and $50 billion with another one. We can't do that. Because it's just like the borders. Without borders, we don't have a country. Well, without money coming in the other direction, we don't have a company. We don't have a country. So we're gonna build a wall. Somebody just said we will build the wall. Believe me. We'll build a wall. It's gonna be a real wall. No, I'm telling you. These politicians -- don't forget we started off with 17. There were so many, it was like -- oh, it's terrible. I mean some of these people like I don't want to mention names like Pataki, who is there. No, I don't want. Well, I like Lindsey Graham. I actually like him, but he had zero. OK? Good. Now that I hear the tone in the room, I actually didn't like him too. No, the guy came to me -- remember, he came and gave me his cellphone. He said, could you give a contribution? Could you set me up with some people? Could you give me a contribution? That was years ago. So when I went up and I saw he was competing with me and you know, I said -- Remember, I said, let's see if this old cell number works. I don't know why I had his number. It was like 4 years old. So they called it and his phone exploded. Do you remember? We went out public. His phone exploded. It went like boom. It crashes. Anyway. But, but -- and I don't know. Do you like Lindsey Graham or not? Tell me. No. I actually think he's a nice guy. Is he gonna be re-elected or not? Tell me. No? All right. Well, maybe if I supported him he'd be re-elected, right? Well, I disagree. I disagree with his warrior mentality. You know, because if you listen to his mentality we'll be in the Middle East for another 15 years, OK? You get a knockout one at a time. You can't fight Assad and you can't fight Syria and they're fighting ISIS and we're gonna fight ISIS too. So we're fighting ISIS who is fighting Syria and we're fighting Syria who is fighting ISIS. And we don't know what the hell is going on. And we've got -- we're backing people that we have no idea who they are and they're fighting Assad. And then if they win, they'll end up being worst Assad and we'll spend another trillion dollars on them. Nice and easy, folks. And I'm the most militaristic person in this room except for Al. Al is well. But I'm the most militaristic person in this room, but you got to know what you're doing. Think of it. They all say, fight Assad. Fight Assad. Assad is a bad guy. They're all bad guys. Not too many good guys over there, right? They're all bad guys. I mean, why did we get by knocking out Gaddafi, right? Nothing. Why did we get by knocking out Saddam Hussein? Saddam Hussein is bad guy. But Saddam Hussein would keep Iran under control because the armies were the same. The military, strength and power was about the same. He'd keep them under control. And frankly, you know, in all fairness, there were no weapons of mass destruction. But what did we get out of it? Saddam Hussein killed terrorists. He would kill. There were no terrorists. He would kill them immediately. He didn't do it politically correct. He found the terrorists. They were gone within five seconds, OK? With us, we find a terrorists, it's gonna be 25 years under trial. And by the way, by the way, for South Carolina, we are not moving any people from Gitmo to South Carolina. That I can tell you. None. None. We're keeping Gitmo open. It's cheaper to Keep it open and we're gonna load it with bad dudes. If they make it there. And -- OK, let me talk just for a second and then I'll get the hell out of here. You go home. You can go watch Bush tonight, right? I don't think too many people are gonna watch. Let let me just say, so let me just. So I'm running against different people. It's so important that we win. It's so important that we start turning this country around. I'm running against politicians. Now, you look at what's going on just the one question. I was on the debate. Ted Cruz was on my left. And they asked him about waterboarding and he was incapable of it. Take a look at the way he answered the question. I think he's a very unstable person to start off with. He couldn't answer the question. He's going, well -- he was afraid to say waterboarding is OK, right? You remember, right? Two weeks ago, three weeks ago. Not the last debate. I think the one before -- anyway. Because the last debate everybody was shouting at me. There wasn't time to talk about waterboarding. But they were shouting at me for a reason. If they weren't shouting at me, I'd be very sad because that would mean we're not doing too well. When they're all going after you -- and we've had a lot tougher competition than those people believe. But when they're all going after you, that's a good thing because that means you're doing well. But they asked Ted Cruz, they asked Ted Cruz, who by the way, is very very weak on illegal immigration. So is Rubio, very weak on illegal immigration. And Bush is so weak that he calls it an act of love, right? That immigration -- here's Bush, immigration is an act of love. They come full of. I said, excuse me? Excuse me? You look at the crime. You look at the problems. You look at what's happening even to the economy. You know, they were talking about the dreamers, the dreamers, people coming over from other countries. I said, I want the children of this country, of our country to be dreamers too, you know? Not always the dreamers from outside. I was asked that question today. First time, in a long time, I was asked that question today about the dreamers coming in and the dream. And I said, first time I've been -- I've heard that question in three months. I said, you know what -- dreamers is everything's fine. But I want the children of the people from this country to also be dreamers. I want our children to dream. I want our children to dream. So remember this. They're chopping off heads in the Middle East. That hasn't happened, I guess, since medieval times. You know, I love history. I'm sort of a semi student of history when I have the chance. But it's like since medieval times, chop off heads it's like chopping off heads. Whoever heard of this before? They're chopping them off. James Foley, a great young guy, that was sort of the beginning. But they chop off heads and then they send, they send the videos all over the place. So that's happening. We're not gonna let this go. So they ask Ted Cruz, sitting right here. What do you think of waterboarding? OK? Waterboarding. We're talking chopping off heads. Waterboarding. And he said, well, I don't know. Well, I don't know. He couldn't couldn't answer the question, right? He couldn't answer. You saw it. And then they went to me and they said, what do you think? I said I don't think waterboarding is tough enough. I think we need much tougher. And as far as, I'm concerned that's OK. It's OK. Well, they said, what do you mean? I said, let me tell you. I said they're chopping off the heads of Christians and lots of other people in the Middle East. Waterboarding is fine and other things that are a lot tougher are fine, and that's OK with me. And you know what? I got a standing ovation. I didn't know it was a good thing or bad. I didn't poll it. I can tell you. You know, these guys, if you ask them a question, they pay hundreds of thousands of dollars to pollsters. And when you ask a guy like Cruz, a question like that. They like to poll it. So they go out to the people and they say, what do you think of waterboarding? They do all sort. With me, I said this. I had no idea. I don't care. I speak the truth. I speak the truth. I just speak the truth. So we're gonna get our country back. We're gonna have a strong country again. We're gonna be respected again. We're not gonna be a laughing stock like we have been, and we have been believe me. All over the world, they don't respect us anymore. They don't respect us anymore. These politicians don't know. Thank you, darling. I love you too. Ohh, I do love you. We're gonna be a respected nation again. We're gonna be a respected nation. So you know, I began by saying, I came down that escalator with Melania and I never saw so many cameras. It look like the Academy Awards. I mean, literally like the Academy Awards. And I said, we have to do it. When I made my speech, I talked about illegal immigration you. Wouldn't even be talking about it if I didn't make that speech. You wouldn't even be talking about it. And then everybody came and then I talked about the borders and we have to have borders and we have to have the wall. All of this. And then beautiful Kate in San Francisco was shot in the back by an animal, who came over here five times. Shot her in the back in San Francisco. And with all of the things that we had, think of it, and it just started. But what's gonna happen is this. We're getting rid of sanctuary cities. Getting rid of it. We're getting rid of it. It's almost like -- you know, these sanctuary cities -- in San Francisco, I think, if I -- I own a big building there. I own a big chunk of the Bank of America building in San Francisco. Who would think of it as sanctuary cities? In Florida, they have like six or seven sanctuary cities. It's almost like a place where criminals can stay and be left alone. It's crazy. Who would think of these ideas? So what we're gonna do is we are gonna use great judgment. We're gonna start off with a word that's very special, heart, because we all have heart. We're gonna have great health care. And for the people, the few people, the little, the small, we can't let people die in the streets. Do we agree? We're gonna have great health care, but we can't let some people that can't afford anything die in the streets. And everybody understands that. And Republicans understand that. But we're gonna have great health care. We're gonna have great military. We're gonna be respected so much. We're gonna win so much folks. We're gonna win. Sometimes I joke. I say we gonna win, win, win. You're gonna come to me. Beg me. Mr. President, we can't stand it. We don't want to win anymore. We don't want to win. And I'm gonna say, yes. We want to be great. We have to keep winning I will not do anything else. We're gonna keep -- But the truth is we're gonna knock out ISIS. We got to knock them out. That's a cancer. We're gonna knock out ISIS. We're gonna knock him out strong. We're gonna get rid of ISIS. We are going to have a country that you are gonna -- you love now. But you're get to love and respect so much more than you do now. And hopefully and I say this hopefully, you're gonna have a president that does such a great job that you are going to be so proud that you were here tonight. You're gonna be so proud that on Saturday, you're gonna get out and vote. You have to get out and vote, folks. You have to get out and vote. Unlike these other people, unlike these other people, I don't want your money. I only want your vote. So you have to get out. Saturday is such a big day. Keep it going. We're gonna use common sense. We're gonna use heart. We're gonna use business skills. We're gonna use our best people. We're gonna use people that are so much more talented than there are anywhere in the world. We don't use them. We're gonna use them and we're gonna make America great again, greater than ever before. OK? Thank you. I love you. Thank you. Thank you, everybody. I love you."}