{"id":454,"author":"Donald Trump","title":"Speech: Donald Trump in Tampa, FL","date":"2016-02-12","link":"https://factba.se/transcript/donald-trump-speech-tampa-fl-february-12-2016","paragraphs":["What an amazing event. Every night. You know last night we were in Baton Rouge. We broke a record held for many years by Elton John. My friend, Elton John. We had 12,000 and 4,000 or 5,000 outside. Tonight, we have my guests much more than that, and we have thousands of people outside. So something's happening.","Unbelievable. There goes the record right there, folks. So unbelievable. I just want to thank everybody. You know what has become? This is a movement. This isn't just a normal situation. There's a movement. And I wish the press would show the stadium but they don't do that. But the people -- no, they don't do it. They never ever do it. You know you go home, even last night, we set a record and one of the reporters actually called and apologized because they refused to write the real number, and they actually called and apolo -- I won't say who because actually the person is not a bad person.","Look at the people. I mean you, do you believe this? So we're doing well. We just left, as you know, New Hampshire. Those people are amazing people also and they were saying do you think Trump can do it? Do you think he can do it? You know we won every single category in New Hampshire, every. We won young.","We won old. We -- young. I mean, think of it. Women, Men, we won everything. We won everything. One of the commentators said really it's not fair. They've never seen anything like this. And I sort of knew it was going to happen but you never really know until you get in there, right? You never really know.","And they will say Trump gets the biggest crowds by far. Do you think that translates, right? They said but that might not translate into the voting booth. Now today, people started lining up seven hours ago and I assume it was these people, these people. See, what they don't know is they may be the best.","I can't say seats. They may be the best stands because everyone's standing. We couldn't get -- but wait what they don't know, they may be the best location but these people are all going to be famous. They're going to be famous too. You're all on television so smile and have a good time. So, I mean personally, if it was up to me, now, you waited what?","seven, eight hours. If it was up to me. If it was up to me. I think I might rather be there. I want to be famous right there. You know what? We all have good seats. This place is amazing. Thank you. So that's the way it is. That's the way it is. It started on June 16th, I announced I was going to run.","All of these people said, oh, he's not going to run. He's not going to run. Why would he do that? He just wants to have fun. He's not going to run. He'll never do it. And then I signed Form A. That's where you sign your life away. So I announced I was going to run. I signed Form A and then they said, well, I mean, he signed Form A. They can't believe it. Then they said, well, he'll never put in his financials because maybe he's not as successful as he's supposed to be. And it turned out that the financials are much more successful than anybody ever thought.","In fact, if I didn't run I would have put my financials at anywhere because you know nobody knows, it's private. Some of the great jobs anywhere, including Doral in Miami, you know, Doral. And Turnberry and many buildings all over the place. The Bank of America and so many buildings and I put it in and I just, you know honestly, when I talk about it, it's a little embarrassing but it's so good, almost 100 pages long, ahead of schedule.","Even these politicians they have like one page and they're 45 days late. I put it and I said to the accountants. I said to the accountants, you've got to do it on time, I always say, on time and under budget, right, like the state. On-time, under budget. And we put it in and they went back. Look at the number of this.","Look at the media back there. Is this crazy? This is crazy. Is this crazy? And they went down there to the Federal Elections and they went down and it was like, like feeding because they wanted to say, oh, maybe he's not great. Maybe it's not good. Maybe it's terrible.","And they saw the best numbers and they saw the best places, very little debt, tremendous cash flow, great company, and I'm not bragging. I'm saying that's the kind of thinking our country needs. We owe $19 trillion. Whatever the hell is up there is what we need because we are in serious, serious trouble.","And you know, I say it a lot our country doesn't win anymore. And I have another way of saying, I have another way, I said something, we don't win anymore, right? We don't win anymore. We lose all the time. But it doesn't sound as good. Our country doesn't win anymore. We don't win. We don't win with the military.","ISIS. Look, ISIS and do we love the military? We love the military. We love the military. And the military is being treated badly and I'll tell you who is really being treated badly our vets, and we're going to change that. You know a stick -- a statistic came out today that's almost -- it's hard to believe.","I said you mean a year, you mean a year. They said, no, it's a day. I said that's not possible. You mean a year, 22 veterans, because care is so bad, 22 veterans commit suicide in one day. Can you believe that? Who would think that's possible? I said you mean a week. You mean a month.","You mean a year, 22 a day. They can't get treated. They can't get service. They wait for four, five, six days in a waiting room. Can you imagine you go to a doctor and my doctor's two minutes late I go crazy, right? I'm screaming now. Can you imagine you wait in a waiting room for four or five, six days and at the end of that you don't even get service?","A lot of times they're leaving. They're going on vacation. We're going to take care of our vets, our great people. We're going to take care of our vets. And you know recently, a very nice woman, Nikki Haley. She came out and she made the statement, she followed Obama, and she started talking about anger and she was referring to me because this is like such a big movement.","Last week, the cover of Time Magazine, an incredible story written by somebody who is a real writer, a really talented person in the media. You don't say that often. These -- this person, and you know, it's amazing I never spoke to them. I should do better and maybe I should never speak to these people, it was the best story.","And it talked about this is a modern-day phenomenon and it really is. No matter where we go this is packed, thousands and thousands of people outside. We have screens set up for them outside. We have thousands of people outside. You'd rather be here, right? Right? She was saying that there's anger, there's anger, and when she said it there was anger in her voice, and she was barraged.","She was barraged by thousands of people and they were angry because she was making it sound like anger is a bad thing, and anger isn't a bad thing. We're angry because we're run incompetently by incompetent people. We're run incompetently. And you know what? I know the people in this room and whether you go to Mobile.","We had in Mobile, Alabama, 35,000 people. We have crowds scheduled that are beyond belief. In New Hampshire, we were setting every record. No matter where we go we set every record. This is a record tonight. You can see it. Look. Look. Every single corner of the room. Now there's one empty chair and I've seen it. If there's one empty chair the press will put it on that chair.","It's true. No, it's true. And look at the size of this place. This is a big place and the one reason I love protesters, and I tell you, look, there's Donald Trump right over there. Look at this guy. Look. Look. There's another one. They're all over the place. Look at this guy. Look at that guy.","One of the reasons I love protesters. The only way we get the cameras to turn off my face because people have no idea how big the crowds are. They have no idea. They don't realize that we have these 15,000 and 20,000-seat stadiums that are packed right to the corners. All you have to do is look at the corners.","They don't say that you have 5,000 people outside trying to get in. Thank you, darling. I feel the same way. Thank you. And it's incredible. You know a friend of mine, he's a very, very powerful guy, very smart guy, great businessman and we're going to use people like this to negotiate by the way with Mexico and China and Japan.","We have people that are political hacks. And he said to me, how do you do that? He watched the other night on television. We had a place it was amazing the crowd and he watched. He said Donald, and this is a man who's one of the most successful people, he said how do you do it? How do you get up and speak in front of that many people?","I said that's nothing. Look at all the cameras back there, 230 reporters, 230 press. He said how do you do it? I said you know what? There is such -- and this is, I swear this is true. There is such love in the room, it's easy. Does that make sense? It's easy. It's love. No matter where we go and I'm the messenger.","You know I'm like a messenger. I don't consider it me. I think our message is right. A lot of people said nobody else has the message that we have. And basically, it's we're going to win again. We're not going to take this off. I mean, we're going to win again. We're going to start winning with our military.","We're going to win with healthcare. We're going to terminate Obamacare. We're going to terminate it. We're going to replace it. We're going to get rid of Common Core which is a total disaster. We're going to educate our children locally, locally with love. You're going to educate our children locally, not out of Washington with the bureaucrats.","We're going to protect our Second Amendment. We're going to protect it. I mean, you look at what happened. Look at what happened between Paris where they have the toughest gun laws in the world. Oh, they're so smart. They've got these tough, tough gun laws. You can't have a gun in Paris. You can't have a gun in France.","The only people that have the guns are the bad guys, right? They have the guns, right? So they go in different places and they kill 130 people. By the way, many more to follow. So many people, so gravely wounded, and they go in and the bullets are all going in one direction. And if a few people, and they -- I say it, sometimes I look in the audience that guy right there.","That guy right there. That guy right there and I've picked one beautiful woman right here. But if we had some guns strapped right onto the waist. Believe me. If we had a gun strapped onto the ankle and we had some bullets going in the opposite way, I'd pick her too. It would have been a whole different story, folks.","How about a military base a year ago? We had five soldiers, great soldiers, gun-free zone, right? Gun-free zone. One of the soldiers was a world-class marksman, nobody better with guns and weapons, and this man won all the awards. The other four, great soldiers. This wacko walks in shoots them all, kills them.","They never had a chance. Their guns are 400 yards away locked up. Gun-free zone. You know when you say gun-free zone that's like candy for a baby. The sickos, they go into those areas, that's candy for a baby. We get rid of our gun-free zones. Believe me. Believe me. So, we're going to have strong borders.","You know one of the reasons I won in New Hampshire is they have a huge problem in New Hampshire. Build the wall. All right. Build that wall. Build that wall. Build that wall. Build that wall. you know, do we have fun considering the subject matter stinks?","We're talking about all these problems but here's why we're having fun because it's actually a message of great optimism. You know Make America Great Again, that's optimism. Some people said, oh, such negativity. It's just the opposite. We're going to fix things up. We're going to make this country better than it's ever been before.","We have to start but this is a message of optimism, a lot of optimism. I don't see any negativity to it. I mean, it's got problems. We have big problems and $19 trillion going to $21 trillion in debt. People don't even know what $21 trillion is, they don't even know. Smart people, people that do business, they figure, let's see how many hundred million are in a trillion?","They don't even know. That's how much money it is. Now, I was on another subject and these guys started holding up the wall. I'll tell you what. The politicians that I'm dealing with, oh, and do you see the negative ads now? Well, phony ads. Those ads are paid for by the lobbyists that are all supporting them.","I'm self-funding. I'm doing my own money. Those ads, they have them on eminent domain. They have them on all sorts of stuff, eminent domain. If you don't have eminent domain, you don't have roads, you don't have highways, you don't have it. And by the way, you should be so lucky to get hit with eminent domain because you make a fortune.","They pay you to take the property. You make -- you make a fortune. But they have ads on eminent domain. They have all this stuff. They have ads on -- I'll give you an example. I'll give an example. All of the -- oh, Jeb? Oh He's asleep. He's asleep at the wheel, folks. No, seriously.","Can you imagine Jeb negotiating with China? Here's a guy -- here's a guy. Now, I'm in number one place by a lot. I've spent the least. That's something nice, OK? I mean, I feel guilty about it. So I'm going to spend a lot now but I feel guilty. But I've spent by far the least so I've spent the least and I'm in number one place.","Jeb has spent like $140 million, I spent like almost nothing. This guy spent $140 million and he's down at the bottom of the pack. Is this what we want? And you know, in his own way, he's a vicious guy. You know he's got that little vicious streak because he's a gutless guy. He's got a vicious streak. He's taking ads.","He's taking ads, $20 million with the negative ads on Trump. What the hell did I do to him? $20 million worth of negative ads. And I say, and you know the funny thing, if he didn't, I wouldn't have hit him. Let him go and enjoy himself. But he spends $140 million and other guys too. They spend a fortune.","They're spending money you wouldn't believe it. It comes out of PACs. And who puts up the money? Special interests. Special interests. Who else? Lobbyists. So, so let me tell you. Let me tell you a story. Then we'll get back to your wall, OK? So a friend of mine comes to me the other day, and he says very strongly, a doctor, a very important doctor.","And he says, you know, Don, it's the most incredible thing, the United States is the largest purchaser of drugs in the world, right? It means you buy cheap. If you do that you buy cheap. These are drugs -- these are drugs that make you better. They're the largest in the world. And you know what happens, Donald, it's incredible.","We have a situation where they don't really negotiate. They're not allowed to negotiate. He doesn't understand why. I know why immediately because all these guys are getting money from the drug industry. We're not allowed to negotiate. If we negotiated -- if we negotiated the price of drugs -- and what you do is simple do a favored-nations list, whoever pot -- right?","Simple. Whoever pays the lowest cost throughout the world for these drugs we get that. And I'd say a 10% discount, right? We would save $300 billion a year. Think of it, one simple thing. But we can't negotiate with the drug companies because all these guys that I'm running against and others and others won't allow that to happen.","Because the big drug companies have a lobby. Now we have the same thing in the military. We order equipment that we don't want. We have equipment that we do want and the military guys know what I'm talking about but that company that makes that equipment doesn't have a strong lobby or doesn't have a strong lobbyist.","It doesn't have the right people. So they have the right equipment but they don't use it. So oftentimes -- how oftentimes do you hear where they're ordering stuff that nobody wants? Where they're ordering stuff -- where they're ordering stuff nobody wants it, right? And I hear it all the time. The reason is and I'll bet you they're paying much more money than they're supposed to be paying because these guys they're not as stupid as you think.","It's all done for a reason. It's called campaign contributions and it is bad. It is bad. So nobody gave me campaign contributions. I have turned down so much money. If I ever took contributions. I guess Jeb raised $148 million. Can you imagine that? Without that by the way, I mean, he's not going anywhere.","He's not going to go anywhere but without that, no, no, without that, he would have failed months ago. It's the only thing -- it's the only thing he's got. Without that he would have failed. And then you have others. You have Cruz. You have Cruz. Find out where he gets his money. No, find out -- especially the Evangelicals who I love.","You know I'm leading with the Evangelicals in the United States. I'm leading. I won in New Hampshire. I won with the Evangelicals. We won. So find out. You know yesterday, I just heard, you know, we always talk about China and the President gets up China, our trading partner, our wonderful partner, they take advantage.","They copied the F35 plane the fighter, right? You know about that. Did you hear about that? Can't tell the difference. You look at it, they copied our planes. And they did more than copy our planes, I guarantee you they have everything that they need right down the most complicated mathematical solutions.","All done 100% stolen off our web and they, and they -- that's right. Hillary gave it. The guy says Hillary gave it. Maybe it was stolen from her e-mails. It was -- that's what happened. You know it's interesting with Hillary and e-mails. One thing I -- I mean, we all send our stuff.","I'm not a big believer in e-mails because I figure once you try it, it's no good. It's no good. But every time I do e-mails I get sued. You know produce your e-mails. I go to court and they say produce your e-mails. I say I don't have any. The judges don't even believe it. After you win the case they say, you know, now I know that you're really smart.","One of the smartest guys on Wall Street, I won't use his name, made a fortune with the Internet. I say What do you do with e-mails? I don't accept e-mails. I don't do e-mails. So what? Because every time I do I get sued. Here's a guy that practically invented it, made a fortune off e-mails, and the Internet, and he won't send it. But what I don't understand is Hillary.","When you see 19,000 and then 10,000 and 2,000, how could you do that many? What is she doing? Bow, bow, bow, how many -- no, think of it, right? Number one, you say this. Number one, you say this. Why? Why? Was it so but -- why? You use the government server, why do you have to do this? You put it in the bathroom of a house someplace that nobody even knows.","What is going on? What is going on? Why? And then you look at the volume. I mean, who can possibly do that many? I mean that's like 24 hours a day. Who could do that many? We've released a batch of 22,000 e-mails, like 22 -- that's like one little batch. So, I don't know if Hillary is going to get a chance to win.","By the way, I'm beating her in the polls. A very flawed candidate. I don't know that she runs. I'd love to run against her. I'd also love to run against the communist. I never thought. I never thought we'd see the day in our country when a communist because that's really, if you think about it, when a communist is the leading Democrat.","We're going to have a communist against an entrepreneur. I like the entrepreneur. I love running because when the real numbers come out, you know, she's very so far left in order to try and save it. She's gone. She's really -- she's really left and it's sad. The whole thing is sad. I watched them. I say you mean we have this great country.","We have this -- you what? So I watch -- I watch this great country and if that's the best we can do that's pretty sad when you think of it, right? It's pretty sad. So we love Florida. I love Florida. I told you the drugs. I got to tell a story that I haven't told in a long time and I've never really told it to an audience.","So I bought Doral and it's, you know, hundreds of acres right in the middle of Miami, right near the airport. We had the big Doral Tournament there, the Cadillac Championship and it's great. Well, Mar-a-Lago you get a lot -- and by the way, I've spent a lot of money in Florida. Nobody else has I guarantee.","Nobody else has. I believe. I have places all over Miami. We've done a lot of jobs with and with related and a lot of places. And Mar-a-Lago you know about it. Well, I spend a lot of money here. I love this state. I love this state. But I've created tremendous numbers of jobs down here. So, Doral, so I'll tell you, seriously.","I buy Doral few years ago, market was bad that's when you like to buy, right? Buy when the market's bad. So I go in and we sign a contract, everybody wanted it, everybody wanted it. We go in and I sign it because this is the way the country should run. I'm telling the story, not for my help. I'm saying because this is the way the country should be run.","So I go in and it was very competitive. Everybody wanted it. But I was the first one and they had to sell it because it had a lot of problems and I bought it and I signed a contract. You have to have a contract. I signed a contract for $170 million, $170 million which is very cheap. But it had to be redone, you know, in the meantime, you've seen what we did.","I spent a lot of money, made it incredible. It's the best resort in the country, OK. So -- and a lot of people are working there. A lot of good Florida people. A lot of Hispanics are working there. The Hispanics love me. And by the way, by the way, by the way, today, I just settled with Univision. Isn't that nice?","Nice. A very nice settlement. They're happy. I'm happy. It's great. But a lot of Hispanics work for me. I've employed thousands and thousands of Hispanics even now. But I have over the years, thousands and thousands of Hispanics, and they're great. They're great. And we have a lot but -- so with Doral, I signed a contract for $170 million, right?","Now I go in, Jorge Ramos, Well, no, we're going to do an interview with Jorge Ramos. Now, I'll do an interview with whoever. I'll do an interview, ready? So, I signed a contract and then I say, hey, now this is, remember, this is what we have to do with China, Japan, Vietnam, which is the new one that's killing us, Mexico, where everyone's moving into Mexico.","I just heard Carrier air conditioner's moving in now. Nabisco's moving in. United Technologies moving in. Fords moving -- everybody. Hey, by the way, folks, stupid -- quiet. How stupid -- you know this guy's a -- you know he's my friend but he's really a pain. He keeps talking. Quiet. Quiet.","Quiet. Quiet. He's not a protester but man is he noisy. So they're all moving into Mexico. So I buy Doral, $170 million, we haven't closed yet, and I said to my daughter, Ivanka, has anybody heard of Ivanka? She's great. And I go through it and it's in really bad shape. You know I was going to make it brand new but it's really in bad shape.","So I go back and I meet all these guys from the Wharton School, from Harvard, you know, they're all guys, Wall Street guys because Wall Street had it. And I said and they're wonderful guys but I said, fellas, look. I'm not going to pay $170 million. I'm not doing it. It's too much money. The place is in terrible condition.","If I didn't promise that I wouldn't use bad language I would have used much stronger language. It would have been more interesting but they won't like it. The place is in lousy condition. I don't like it. I'm not paying. So you've defrauded me. They said no way.","I said I'll give you $100 million. They said no way. I said I'll give you $100 million. They said no way. And I said I'll give you $100 million. They said no way. And I said to Ivanka, watch. This is fun. You see to me it's fun. It's a game. For John Kerry, it's work, it's labor. It's a -- OK? Look at the deal he made with Iran, is that the saddest?","But for me it's fun. I did this just for fun whether I paid more or less. It didn't really matter. It was a good price. We got it at the right time. So I said Ivanka, watch. So we go in, we meet these geniuses, I say, you've got to cut the price. It's not what you told us. It was -- I did an inspection.","It's in terrible, terrible shape. You've got to. No way. They said no way. We'll make somebody else's -- I said you don't understand. I already signed a contract. It'll take years to break it. They said no way and they needed the money. No way we're going to do it. Within about three minutes I said how much would you take?","How much would you agree to? I said I'll give you $110 million. They said we can't do that, we can't. Anyway, after about four minutes we agreed to take $20 million off. I paid one hundred -- I got for four minutes work I saved $20 million. Is that good? And honestly, it's not the story. That's the way we should be doing it with our country, right?","You know? I have and I'm telling you I have the greatest business -- Carl Icahn endorsed me, great businessman. I have the greatest businesspeople in the world and we have them here and they all want to negotiate. They want to -- they don't want any money, right? Now we have guys that get their job because they contribute money to these politicians who are crooked is hell.","Many, many of them, believe me, are crooked. Many of them are incompetent but one thing their genius is getting re-elected. That's all they care about. I mean, not everybody but for the most part. They want to get -- they want to get reelected. So, I tell that story. Then what I did I got it for the $150 million, then I fix it. Beautiful.","It's open. It's doing great, OK? That's Doral. But you want to do that. That's what you want to do. Now, you take the Iran deal, $150 billion we give them, we get nothing. No, no, we get nothing. We get zero. We paid $150 billion and we got our four hostages back. We wouldn't have gotten them back.","We basically paid a ransom. And that's a really bad precedent that we set. Believe me. We paid a ransom. We get nothing. And the way they abused this, during that deal, first of all, it took forever. It took forever to get the deal done. What was it three, four years? We should have had the hostages released before we started negotiating, right?","And then they capture 10 wonderful sailors. They capture our sailors, they put guns to their heads, they drop them down to their knees, put your hands up, and you heard the guy with that voice, that was a rough cookie, you want to turn around and smack him. You want to -- that -- then you saw what happened.","You saw what happened. And if they weren't getting the money, two days later, those sailors would be there forever, unless of course, I'm elected President. They would have been out before I ever took office. Believe me. So I would have said differently with the Iran deal. And I'm using this because this is where the oil deal is, this is where the oil deal is. I would have said, fellas, you got to do this.","We're not going to do it. You've got to release our people. You don't need them. We don't -- I mean for us, for our people, getting those hostages back is very important. You've got to -- they're going to say no. Then you leave. You double up the sanctions. Within a couple of days, they'll call back. They'll give you the -- you got your hostages.","Then I want to say just quickly, fellas, we can't pay you $150 billion. Once those hostages landed, about two seconds later, fellas, how you doing, everything good? Listen, the $150 billion, sorry, we don't have the money. We owe $19 trillion. We're don't have it. We don't have it. We don't have it. We don't have the money.","They'll go crazy. A couple of days later they'll say let's go. We just saved $150 billion, and by the way, this isn't like maybe, this is 100%. This is 100%, but we have people that don't know what they're doing like John Kerry, our Secretary of State. We have people that don't know what they're doing. He's not equipped to negotiate.","The Persians are great negotiators, OK? Always have been great negotiators. You look at what they did to us. He never once walked. We gave every single point. We have a 24-day inspection period. They have periods where they self inspect. Can you imagine a nuclear deal and we don't know what's there? We call up with a complaint and they say we'll call you back tomorrow.","We will inspect the area. They call you back tomorrow, self-inspection, and they say, Mr. President, everything's fine. Now, you know, Obama calls the head the Supreme Leader. We won't use the term Supreme Leader, OK? He says we've just spoken to the Supreme Leader. He's not my Supreme Leader. I'll tell you that much right now.","So many deals like that. Sergeant Bergdahl, he's a traitor. Now, think of it. He's a dirty rotten traitor. He left. We lost five or six, probably six. We lost five or six people. Young, beautiful people. Young, beautiful people. I watched their parents, young, beautiful people, five or six.","They went out looking for him. They were killed. We lost these incredible people. We knew he was a traitor because a General and a Colonel was there interviewing the people that he was involved with. They all said he left so we knew it. We make a deal where we get Bergdahl a traitor and they get five of the biggest killers they had that they've coveted for nine years.","And they got back and now they're back on the battlefield or soon will be. They want to kill you. They want to kill everybody else in front. So we get Bergdahl, they get five killers, and you know what? We're not negotiating that way anymore, folks. Not going to happen. Not going to happen. So the wall, the wall.","Everyone loves it. Everyone. No, I love the wall. It's so easy. China, China, two thousand years ago built the Great Wall, The Great Wall of China. It's 13,000 miles long, it's massive, they didn't have Caterpillar tractor, by the way, 13,000 miles long. It's a massive wall. It does work. You know, the walls work, ask Israel.","The walls work. Believe me. How about Europe? Some of the countries in Europe that weren't suckers to what happened with the migration like Merkel of Germany, what she did to Germany. And they want to build walls around their own countries now because what's going on in Europe, nobody knows where these people are from.","And we all have a big heart, I have a big heart. You build safe zones in Syria to allow millions of people to pour into Europe. Because their leaders are as stupid as our leaders. And you have to see the crime in Germany now. The crime in Sweden, you saw what happened in Sweden, where the people are beginning to revolt.","Sweden, Sweden doesn't have problems. The people are going crazy. Oh, is that a protester? Get them out of here. Get out of here. Get them out. You know it's amazing. It's amazing. You have that stuff. What do we really want? I mean, whether you're Liberal and Democrat, no matter, what do we really want?","We want safety, right? We want healthcare. We want a good place to live. We want to make a good living. We want jobs. I mean, you think if you could talk to a couple of people like that for 10 minutes they'd be on our side but I don't know. Who knows? Maybe there's other problems that they have. You know there's a lot of people -- I don't understand it. You see that and it's amazing.","You'll have a room like this. We have 16,000 people and you have so little protest. You know the amazing part to me though, you'll have, that was what one person or two people? So the press in the background, the press tomorrow headlines, Protesters at the Trump meeting. Protesters.","So when I started on June 16th I said illegal immigration and I made it a very big thing. And nobody thought ever -- oh, did I take, hey, how tough was it, right? The abuse I took from the media was unbelievable but that was OK. I'm used to it. So the abuse, nobody ever has seen anything like it, and then what happened is people found out I was right.","It's unbelievable crime coming through our border. They're hurting us economically but unbelievable crime. By the way, we want people to come into our country but they have to come into our country legally, legally, legally. They have to come in legally. So, the President of Mexico yesterday, or the ex-President, whatever or whoever, who cares?","He said we will not even consider paying for the wall. You have to understand because, OK, are you ready? Who's going to pay for the wall? Who? 100%, 100%. So, I get a call from one of the reporters yesterday and they said the President of Mexico said they will not under any circumstances pay for the wall.","They said to me what is your comment? I said the wall just got 10 feet higher. It's true. It's true. We, not me, are so tired of being pushed around by these other countries like we're a bunch of dummies, not going to happen anymore, OK? Not going to happen. Not going to happen. We have -- we have a situation where we lose so much money on trade and we lose so much money.","You look at the trade deficit that we have with Mexico. So these characters that were on the stage, it started off with 17, now you're down to whatever, seven, eight, what difference does it make? They're going down fast, right? They're going down fast. And who won the last debate, please? Who won? Actually, you know in the online polls, Drudge is an amazing guy, by the way, Drudge.","They do with these online polls, right? Time Magazine, Slate, I don't know all this. They do these online polls. Who won the debate? I've won every debate according to the polls. Now, I don't know. Maybe, maybe not but I think I've done well. You know I've never done this stuff before. I'm a job producer.","I'll be the greatest job-producing President that God ever created. That I can tell you. That I can tell you. And we're going to take our jobs back from China. I want to take them back from everywhere. We are -- you know what? There's so many countries out, right now, right now, they have so many countries.","We don't make good deals with any of them. We lose with everyone. This new trade deal, Trans-Pacific Partnership, partnership, is so bad. and what don't they cover in the deal to any great extent? They don't cover monetary manipulation. They don't cover devaluation. That's the way that we're getting killed because they're devaluing their currencies.","They're killing it. They're making it impossible for our companies to compete and it's not going to happen. We're going to change it. We're going to have the greatest businesspeople in the world negotiating deals for us, not for me. So and we have degraded and I told you. Right now, we have political hacks.","These Chinese, they train from the time they're three years old to be killers and they get and they take the best and the best and the best. It's like a triangle. It's like sports you end up with the top. That's who we negotiate with. And we have some people that don't even understand the rudiments, the basics of business.","This year, we're going to lose $505 billion with China. What the hell is that all about? And when we deal with China and you send something over there we pay tax. When they send stuff to us, no tax, no problem. And believe me I have friends that are manufacturers that are great. They can't get their goods into China.","But for China, no problem. So we're going to lose $500 billion, we've been losing it for years. We can't do it any longer, folks. It's going to be a time where we're not going to be the stupid people anymore. It's not going to happen anymore. Not going to happen anymore. We have -- we have so many things.","These people come up to me they say, Donald, you don't really mean we're going to build a wall, do you? And I say, I say, absolutely, we're going to build a wall, 100%. They go, well, you don't really mean that that was like when I first started in June, I stand right for the We're going to build a wall.","It's going to be a real wall. See that ceiling up there? I mean, there's a wall that if you get up there, you're not coming down very easily. Right now, we have a wall. Do you wee they got a little wall and they have -- they build ramps. I don't know why they just don't knock over the wall. They've built ramps over the wall.","Up there, there's probably a severe penalty for knocking it so they just go -- they built. No, we don't give severe penalties, right? No. There can't be a severe penalty. You know we have great border patrol. I was in Laredo, Texas and I was asked, I was the guest of the Border Patrol. They called me and they said we would love to see you.","Great people and they want to protect our border and they can do it. But they're told to stand back, let people come through. It is so horrible. Then Obama signs the Executive Order, let everyone come in. We've lost control. If we don't have a border we don't have a country, folks. We don't have a country.","So these guys that I'm with, nice guys, some of them are nice some of them aren't but I don't care. And they say to me what do you mean build a wall? How are you going to build a wall? Do you know how simple? You know 15 years ago they wanted to build a wall. They couldn't build it because they couldn't get the environmental impact statement approved.","Can you believe? They have toads, they have snakes, they have all sorts of things, they couldn't get an environment -- Can you believe this? Well, I've been saying bomb the oil, right? Over -- I've been saying bomb the oil, right? For four years I've been saying bomb the oil, and now finally, it took Paris and who is the first one to bomb the oil, the French?","Can you believe that one, the French? The French bombed the oil. But I've been saying for years, bomb the oil, right? And what happens? They don't do it. And one of the reasons they don't want to do it because Obama feels that if you bomb the oil they're going to be things, carcinogens going up into the air.","So Obama doesn't want to bomb the oil because he thinks it's bad for the environment. This is true. Can you believe this? Why do you think General George Patton or General Douglas MacArthur, our great modern-day Generals, what do you think they would have said? Bomb the oil, they would have bombed a hell of a lot more than the oil.","I'll tell you right now. And you have to get points for vision. I'm the only one in the day that can say this. I said don't go into Iraq. I'm the most militaristic person in this room except for that guy right there. He probably beats me. He looks like, serious -- I'm the most militaristic person in this room.","Believe me. We're going to build our military so big so strong. We are going to be -- nobody's going to play with us. Nobody's going to mess with us. We're going to have the best equipped Army. But you have to know, I don't want to use it. I think by making it stronger we're never going to have to use it. I actually think it's the safest thing we can do and it's the cheapest thing we can do. But -- right?","I think it's the cheapest thing we can do. So when we have a situation like that we have to be prepared to go. Our military is not prepared. When General Odierno left, he was on one of the shows, our Generals are on all these shows. I never saw it -- did you ever see so many people on shows, our Generals, but he said we're the least prepared than we've ever been.","I think he said ever. You can check it but he said at least for like many years. But I actually think he's at -- our preparedness and this is what we need with all these maniacs coming in. When we want to take people from the migration line, we have no idea who they are, we have absolutely no idea. They have no paperwork.","There is absolutely no way we can ever tell. And I'll tell you, folks, we're not taking them, and if we do take them from somebody else, we're sending them back because we have no choice. We have no choice. We have no choice. So we are going to put ourselves in such an unbelievable position. We're going to start making money and we have to. A woman -- and I tell the story all the time, it was a few weeks ago.","A woman came up, she said Mr. Trump, I don't like it when you say we're going to make our country rich again. I said I know because it's not like politically correct. Everything you have to say nowadays is politically correct. It's disgusting. Politically Correct. She said I don't like it when you talk about rich.","Well, we have to save Social Security without cutting it like everyone wants to do. Cutting, cutting, cutting. We're going to save Medicare because it actually works. We'll get rid of the waste, fraud, and abuse. We're going to do things like they used to be done but we're going to do them even better. I'll tell you one thing, I'll tell you one thing.","I've gotten to know the people of this country and somebody asked me today, one of the big stations, they asked me today what's your biggest surprise? And my biggest surprise and my biggest joy is that the people of our country are phenomenal. They're incredible people. They're really smart, really dedicated, and they really love the country.","And they want to see it be great again. They want to see it be great again. So the guys come up to me in the wall, the people we're negotiating with. The guys that are getting all of this money from from -- and they say, how do you build a wall? Well, now the other day, I'm on television and one of our opponents is on television, and my wife comes up to me and she said, I don't believe it. The guy that I'm running against says we're going to build a wall.","And then yesterday, somebody also said another one, we're going to build a wall. Where the hell were they? Number one, they don't know how to build the wall. If it's going to be a wall it's going to cost them ten times more. You know the old post office, it's under budget, ahead of schedule. That's the way you have to build.","They don't know what to build. They don't know what to do. It'll never get built but then they come up to me that -- the new one is, Donald, you know Mexico's never going to pay for it. I say 100%, I say not 98%, not 99%, I said they're going to pay 100%. They're going to pay 100%. Well, how could you get them to pay?","I said because the cost of the wall is peanuts. I haven't even figured out the cost. The cost of the wall is peanuts, absolute peanuts compared to the kind of money that Mexico is making off the United States, and that's not including all of the drugs that are flowing right through their border. That's not included.","So these guys will never ever ask. Now, if you talk about that Mexico has lobbyists believe it or not. Everybody has a lobbyist. Every person that deals with the United States they have lobbyists and special interests. So when they come to me, they say look, lay off Mexico a little bit, you know, come on. They can't do that to me because nobody gave me money and I wouldn't do it. And I'm working for one group of people and that's this group of people.","That's all, one group of people. I'll give you an example. I told you about drugs before. Jeb Bush is a total stiff. By the way, a total stiff, Jeb Bush. Listen to this, listen to this. The head of his finance committee is a friend of mine, his name is Woody Johnson.","He's from Johnson & Johnson, Woody Johnson, Johnson & Johnson has a hard time with the Jets. Woody Johnson is a good guy. He's the head of his finance group so then when you wonder why is it that the politicians don't put out drugs to competitive bidding, and then you see Woody Johnson, works for this guy.","When he was Governor we have -- what kind of cities do we have in Florida? What kind of cities, right? We have sanctuary cities in Florida while he was Governor, right? After he left Florida, went to hell. I was here in Florida it went to hell. And this is what we have. But anyway, so when you have Woody Johnson, now you have other Woody Johnsons, meaning other people in other industries taking care of all these people.","So when they go up and then they say to him, well, you can't do that. These people took good care -- Johnson & Johnson put up millions of dollars, the drug industry. You can't do that. They're going to say, oh, you're right. They were very nice to me. They're right, OK, $300 billion a year down. When they come up to Trump, and they say, you can't do that.","I say I sure as hell can. I sure as hell can. There is so much money that's being wasted. Some people think it's 25 years, 25 years to balance the budget. I said what are you talking about? What are you talking about? We'll do it fast. Now here's the thing, we'll do it fast but we'll have a better country.","You'll have better service not worse. You'll have better service. It will be a better country. It'll be beautiful and we're going to -- we're going to do it, folks. Now listen, here's what's important, here's what's important. So you have the big vote coming up very soon, right? Very soon, we have it very soon, you got to do one thing.","I don't want any of your money. I don't need your money. What we need, and it's not me, otherwise, we're just wasting our time. Look, the cover of Time Magazine, many times over the last few weeks, I mean, months. I mean, can you believe it? The last time I walked into my desk last week and there's a picture of me on the cover of Time Magazine and I said, oh, I think it's a postcard or something.","I didn't even know I was on the cover. There it is. There it is. Turn that around. That was such a great -- and you know what? I don't talk about the other story. That story was written by somebody that gets it. That story -- you read that story from last week. That story and I didn't say that. I don't promote Time Magazine.","I couldn't care less. That story they get it. That story was something special. Now, we've all wasted a lot of time. We've all wasted a lot of energy. In my case, I've wasted a lot of money if this doesn't happen. I don't care about the money but the energy is incredible. No, I think we have a really good chance.","You know, when we won New Hampshire. When we won New Hampshire there were questions like, you know, I talked about the Muslim. We have a tremendous problem. And I said we have to study it. We have to see. There has to be a better -- nobody's going to say that. We have problems, folks. We have problems.","We've got to find out radical Islamic terrorism. We have a President, won't even use the term. You can't solve a problem if you're afraid of it. You can't solve a problem if you're not going to even mention the name. So we're going to solve the problems. We're going to make our country so strong. We're going to win again and again.","We're going to win so much. But here's what you have to do. You have to go out and vote or we're wasting our time. The movement ends and that's the end of it. So, I want to just tell you and I leave you with this. I love you, people and I've been all over. And what I said to my friend is true. I love you, people.","Get out and vote. We're going to Make America Great Again. We're going to win all the time. We're going to bring our country back. And we're all going to be proud once again to be citizens of this incredible nation. Thank you."],"text":" What an amazing event. Every night. You know last night we were in Baton Rouge. We broke a record held for many years by Elton John. My friend, Elton John. We had 12,000 and 4,000 or 5,000 outside. Tonight, we have my guests much more than that, and we have thousands of people outside. So something's happening. Unbelievable. There goes the record right there, folks. So unbelievable. I just want to thank everybody. You know what has become? This is a movement. This isn't just a normal situation. There's a movement. And I wish the press would show the stadium but they don't do that. But the people -- no, they don't do it. They never ever do it. You know you go home, even last night, we set a record and one of the reporters actually called and apologized because they refused to write the real number, and they actually called and apolo -- I won't say who because actually the person is not a bad person. Look at the people. I mean you, do you believe this? So we're doing well. We just left, as you know, New Hampshire. Those people are amazing people also and they were saying do you think Trump can do it? Do you think he can do it? You know we won every single category in New Hampshire, every. We won young. We won old. We -- young. I mean, think of it. Women, Men, we won everything. We won everything. One of the commentators said really it's not fair. They've never seen anything like this. And I sort of knew it was going to happen but you never really know until you get in there, right? You never really know. And they will say Trump gets the biggest crowds by far. Do you think that translates, right? They said but that might not translate into the voting booth. Now today, people started lining up seven hours ago and I assume it was these people, these people. See, what they don't know is they may be the best. I can't say seats. They may be the best stands because everyone's standing. We couldn't get -- but wait what they don't know, they may be the best location but these people are all going to be famous. They're going to be famous too. You're all on television so smile and have a good time. So, I mean personally, if it was up to me, now, you waited what? seven, eight hours. If it was up to me. If it was up to me. I think I might rather be there. I want to be famous right there. You know what? We all have good seats. This place is amazing. Thank you. So that's the way it is. That's the way it is. It started on June 16th, I announced I was going to run. All of these people said, oh, he's not going to run. He's not going to run. Why would he do that? He just wants to have fun. He's not going to run. He'll never do it. And then I signed Form A. That's where you sign your life away. So I announced I was going to run. I signed Form A and then they said, well, I mean, he signed Form A. They can't believe it. Then they said, well, he'll never put in his financials because maybe he's not as successful as he's supposed to be. And it turned out that the financials are much more successful than anybody ever thought. In fact, if I didn't run I would have put my financials at anywhere because you know nobody knows, it's private. Some of the great jobs anywhere, including Doral in Miami, you know, Doral. And Turnberry and many buildings all over the place. The Bank of America and so many buildings and I put it in and I just, you know honestly, when I talk about it, it's a little embarrassing but it's so good, almost 100 pages long, ahead of schedule. Even these politicians they have like one page and they're 45 days late. I put it and I said to the accountants. I said to the accountants, you've got to do it on time, I always say, on time and under budget, right, like the state. On-time, under budget. And we put it in and they went back. Look at the number of this. Look at the media back there. Is this crazy? This is crazy. Is this crazy? And they went down there to the Federal Elections and they went down and it was like, like feeding because they wanted to say, oh, maybe he's not great. Maybe it's not good. Maybe it's terrible. And they saw the best numbers and they saw the best places, very little debt, tremendous cash flow, great company, and I'm not bragging. I'm saying that's the kind of thinking our country needs. We owe $19 trillion. Whatever the hell is up there is what we need because we are in serious, serious trouble. And you know, I say it a lot our country doesn't win anymore. And I have another way of saying, I have another way, I said something, we don't win anymore, right? We don't win anymore. We lose all the time. But it doesn't sound as good. Our country doesn't win anymore. We don't win. We don't win with the military. ISIS. Look, ISIS and do we love the military? We love the military. We love the military. And the military is being treated badly and I'll tell you who is really being treated badly our vets, and we're going to change that. You know a stick -- a statistic came out today that's almost -- it's hard to believe. I said you mean a year, you mean a year. They said, no, it's a day. I said that's not possible. You mean a year, 22 veterans, because care is so bad, 22 veterans commit suicide in one day. Can you believe that? Who would think that's possible? I said you mean a week. You mean a month. You mean a year, 22 a day. They can't get treated. They can't get service. They wait for four, five, six days in a waiting room. Can you imagine you go to a doctor and my doctor's two minutes late I go crazy, right? I'm screaming now. Can you imagine you wait in a waiting room for four or five, six days and at the end of that you don't even get service? A lot of times they're leaving. They're going on vacation. We're going to take care of our vets, our great people. We're going to take care of our vets. And you know recently, a very nice woman, Nikki Haley. She came out and she made the statement, she followed Obama, and she started talking about anger and she was referring to me because this is like such a big movement. Last week, the cover of Time Magazine, an incredible story written by somebody who is a real writer, a really talented person in the media. You don't say that often. These -- this person, and you know, it's amazing I never spoke to them. I should do better and maybe I should never speak to these people, it was the best story. And it talked about this is a modern-day phenomenon and it really is. No matter where we go this is packed, thousands and thousands of people outside. We have screens set up for them outside. We have thousands of people outside. You'd rather be here, right? Right? She was saying that there's anger, there's anger, and when she said it there was anger in her voice, and she was barraged. She was barraged by thousands of people and they were angry because she was making it sound like anger is a bad thing, and anger isn't a bad thing. We're angry because we're run incompetently by incompetent people. We're run incompetently. And you know what? I know the people in this room and whether you go to Mobile. We had in Mobile, Alabama, 35,000 people. We have crowds scheduled that are beyond belief. In New Hampshire, we were setting every record. No matter where we go we set every record. This is a record tonight. You can see it. Look. Look. Every single corner of the room. Now there's one empty chair and I've seen it. If there's one empty chair the press will put it on that chair. It's true. No, it's true. And look at the size of this place. This is a big place and the one reason I love protesters, and I tell you, look, there's Donald Trump right over there. Look at this guy. Look. Look. There's another one. They're all over the place. Look at this guy. Look at that guy. One of the reasons I love protesters. The only way we get the cameras to turn off my face because people have no idea how big the crowds are. They have no idea. They don't realize that we have these 15,000 and 20,000-seat stadiums that are packed right to the corners. All you have to do is look at the corners. They don't say that you have 5,000 people outside trying to get in. Thank you, darling. I feel the same way. Thank you. And it's incredible. You know a friend of mine, he's a very, very powerful guy, very smart guy, great businessman and we're going to use people like this to negotiate by the way with Mexico and China and Japan. We have people that are political hacks. And he said to me, how do you do that? He watched the other night on television. We had a place it was amazing the crowd and he watched. He said Donald, and this is a man who's one of the most successful people, he said how do you do it? How do you get up and speak in front of that many people? I said that's nothing. Look at all the cameras back there, 230 reporters, 230 press. He said how do you do it? I said you know what? There is such -- and this is, I swear this is true. There is such love in the room, it's easy. Does that make sense? It's easy. It's love. No matter where we go and I'm the messenger. You know I'm like a messenger. I don't consider it me. I think our message is right. A lot of people said nobody else has the message that we have. And basically, it's we're going to win again. We're not going to take this off. I mean, we're going to win again. We're going to start winning with our military. We're going to win with healthcare. We're going to terminate Obamacare. We're going to terminate it. We're going to replace it. We're going to get rid of Common Core which is a total disaster. We're going to educate our children locally, locally with love. You're going to educate our children locally, not out of Washington with the bureaucrats. We're going to protect our Second Amendment. We're going to protect it. I mean, you look at what happened. Look at what happened between Paris where they have the toughest gun laws in the world. Oh, they're so smart. They've got these tough, tough gun laws. You can't have a gun in Paris. You can't have a gun in France. The only people that have the guns are the bad guys, right? They have the guns, right? So they go in different places and they kill 130 people. By the way, many more to follow. So many people, so gravely wounded, and they go in and the bullets are all going in one direction. And if a few people, and they -- I say it, sometimes I look in the audience that guy right there. That guy right there. That guy right there and I've picked one beautiful woman right here. But if we had some guns strapped right onto the waist. Believe me. If we had a gun strapped onto the ankle and we had some bullets going in the opposite way, I'd pick her too. It would have been a whole different story, folks. How about a military base a year ago? We had five soldiers, great soldiers, gun-free zone, right? Gun-free zone. One of the soldiers was a world-class marksman, nobody better with guns and weapons, and this man won all the awards. The other four, great soldiers. This wacko walks in shoots them all, kills them. They never had a chance. Their guns are 400 yards away locked up. Gun-free zone. You know when you say gun-free zone that's like candy for a baby. The sickos, they go into those areas, that's candy for a baby. We get rid of our gun-free zones. Believe me. Believe me. So, we're going to have strong borders. You know one of the reasons I won in New Hampshire is they have a huge problem in New Hampshire. Build the wall. All right. Build that wall. Build that wall. Build that wall. Build that wall. you know, do we have fun considering the subject matter stinks? We're talking about all these problems but here's why we're having fun because it's actually a message of great optimism. You know Make America Great Again, that's optimism. Some people said, oh, such negativity. It's just the opposite. We're going to fix things up. We're going to make this country better than it's ever been before. We have to start but this is a message of optimism, a lot of optimism. I don't see any negativity to it. I mean, it's got problems. We have big problems and $19 trillion going to $21 trillion in debt. People don't even know what $21 trillion is, they don't even know. Smart people, people that do business, they figure, let's see how many hundred million are in a trillion? They don't even know. That's how much money it is. Now, I was on another subject and these guys started holding up the wall. I'll tell you what. The politicians that I'm dealing with, oh, and do you see the negative ads now? Well, phony ads. Those ads are paid for by the lobbyists that are all supporting them. I'm self-funding. I'm doing my own money. Those ads, they have them on eminent domain. They have them on all sorts of stuff, eminent domain. If you don't have eminent domain, you don't have roads, you don't have highways, you don't have it. And by the way, you should be so lucky to get hit with eminent domain because you make a fortune. They pay you to take the property. You make -- you make a fortune. But they have ads on eminent domain. They have all this stuff. They have ads on -- I'll give you an example. I'll give an example. All of the -- oh, Jeb? Oh He's asleep. He's asleep at the wheel, folks. No, seriously. Can you imagine Jeb negotiating with China? Here's a guy -- here's a guy. Now, I'm in number one place by a lot. I've spent the least. That's something nice, OK? I mean, I feel guilty about it. So I'm going to spend a lot now but I feel guilty. But I've spent by far the least so I've spent the least and I'm in number one place. Jeb has spent like $140 million, I spent like almost nothing. This guy spent $140 million and he's down at the bottom of the pack. Is this what we want? And you know, in his own way, he's a vicious guy. You know he's got that little vicious streak because he's a gutless guy. He's got a vicious streak. He's taking ads. He's taking ads, $20 million with the negative ads on Trump. What the hell did I do to him? $20 million worth of negative ads. And I say, and you know the funny thing, if he didn't, I wouldn't have hit him. Let him go and enjoy himself. But he spends $140 million and other guys too. They spend a fortune. They're spending money you wouldn't believe it. It comes out of PACs. And who puts up the money? Special interests. Special interests. Who else? Lobbyists. So, so let me tell you. Let me tell you a story. Then we'll get back to your wall, OK? So a friend of mine comes to me the other day, and he says very strongly, a doctor, a very important doctor. And he says, you know, Don, it's the most incredible thing, the United States is the largest purchaser of drugs in the world, right? It means you buy cheap. If you do that you buy cheap. These are drugs -- these are drugs that make you better. They're the largest in the world. And you know what happens, Donald, it's incredible. We have a situation where they don't really negotiate. They're not allowed to negotiate. He doesn't understand why. I know why immediately because all these guys are getting money from the drug industry. We're not allowed to negotiate. If we negotiated -- if we negotiated the price of drugs -- and what you do is simple do a favored-nations list, whoever pot -- right? Simple. Whoever pays the lowest cost throughout the world for these drugs we get that. And I'd say a 10% discount, right? We would save $300 billion a year. Think of it, one simple thing. But we can't negotiate with the drug companies because all these guys that I'm running against and others and others won't allow that to happen. Because the big drug companies have a lobby. Now we have the same thing in the military. We order equipment that we don't want. We have equipment that we do want and the military guys know what I'm talking about but that company that makes that equipment doesn't have a strong lobby or doesn't have a strong lobbyist. It doesn't have the right people. So they have the right equipment but they don't use it. So oftentimes -- how oftentimes do you hear where they're ordering stuff that nobody wants? Where they're ordering stuff -- where they're ordering stuff nobody wants it, right? And I hear it all the time. The reason is and I'll bet you they're paying much more money than they're supposed to be paying because these guys they're not as stupid as you think. It's all done for a reason. It's called campaign contributions and it is bad. It is bad. So nobody gave me campaign contributions. I have turned down so much money. If I ever took contributions. I guess Jeb raised $148 million. Can you imagine that? Without that by the way, I mean, he's not going anywhere. He's not going to go anywhere but without that, no, no, without that, he would have failed months ago. It's the only thing -- it's the only thing he's got. Without that he would have failed. And then you have others. You have Cruz. You have Cruz. Find out where he gets his money. No, find out -- especially the Evangelicals who I love. You know I'm leading with the Evangelicals in the United States. I'm leading. I won in New Hampshire. I won with the Evangelicals. We won. So find out. You know yesterday, I just heard, you know, we always talk about China and the President gets up China, our trading partner, our wonderful partner, they take advantage. They copied the F35 plane the fighter, right? You know about that. Did you hear about that? Can't tell the difference. You look at it, they copied our planes. And they did more than copy our planes, I guarantee you they have everything that they need right down the most complicated mathematical solutions. All done 100% stolen off our web and they, and they -- that's right. Hillary gave it. The guy says Hillary gave it. Maybe it was stolen from her e-mails. It was -- that's what happened. You know it's interesting with Hillary and e-mails. One thing I -- I mean, we all send our stuff. I'm not a big believer in e-mails because I figure once you try it, it's no good. It's no good. But every time I do e-mails I get sued. You know produce your e-mails. I go to court and they say produce your e-mails. I say I don't have any. The judges don't even believe it. After you win the case they say, you know, now I know that you're really smart. One of the smartest guys on Wall Street, I won't use his name, made a fortune with the Internet. I say What do you do with e-mails? I don't accept e-mails. I don't do e-mails. So what? Because every time I do I get sued. Here's a guy that practically invented it, made a fortune off e-mails, and the Internet, and he won't send it. But what I don't understand is Hillary. When you see 19,000 and then 10,000 and 2,000, how could you do that many? What is she doing? Bow, bow, bow, how many -- no, think of it, right? Number one, you say this. Number one, you say this. Why? Why? Was it so but -- why? You use the government server, why do you have to do this? You put it in the bathroom of a house someplace that nobody even knows. What is going on? What is going on? Why? And then you look at the volume. I mean, who can possibly do that many? I mean that's like 24 hours a day. Who could do that many? We've released a batch of 22,000 e-mails, like 22 -- that's like one little batch. So, I don't know if Hillary is going to get a chance to win. By the way, I'm beating her in the polls. A very flawed candidate. I don't know that she runs. I'd love to run against her. I'd also love to run against the communist. I never thought. I never thought we'd see the day in our country when a communist because that's really, if you think about it, when a communist is the leading Democrat. We're going to have a communist against an entrepreneur. I like the entrepreneur. I love running because when the real numbers come out, you know, she's very so far left in order to try and save it. She's gone. She's really -- she's really left and it's sad. The whole thing is sad. I watched them. I say you mean we have this great country. We have this -- you what? So I watch -- I watch this great country and if that's the best we can do that's pretty sad when you think of it, right? It's pretty sad. So we love Florida. I love Florida. I told you the drugs. I got to tell a story that I haven't told in a long time and I've never really told it to an audience. So I bought Doral and it's, you know, hundreds of acres right in the middle of Miami, right near the airport. We had the big Doral Tournament there, the Cadillac Championship and it's great. Well, Mar-a-Lago you get a lot -- and by the way, I've spent a lot of money in Florida. Nobody else has I guarantee. Nobody else has. I believe. I have places all over Miami. We've done a lot of jobs with and with related and a lot of places. And Mar-a-Lago you know about it. Well, I spend a lot of money here. I love this state. I love this state. But I've created tremendous numbers of jobs down here. So, Doral, so I'll tell you, seriously. I buy Doral few years ago, market was bad that's when you like to buy, right? Buy when the market's bad. So I go in and we sign a contract, everybody wanted it, everybody wanted it. We go in and I sign it because this is the way the country should run. I'm telling the story, not for my help. I'm saying because this is the way the country should be run. So I go in and it was very competitive. Everybody wanted it. But I was the first one and they had to sell it because it had a lot of problems and I bought it and I signed a contract. You have to have a contract. I signed a contract for $170 million, $170 million which is very cheap. But it had to be redone, you know, in the meantime, you've seen what we did. I spent a lot of money, made it incredible. It's the best resort in the country, OK. So -- and a lot of people are working there. A lot of good Florida people. A lot of Hispanics are working there. The Hispanics love me. And by the way, by the way, by the way, today, I just settled with Univision. Isn't that nice? Nice. A very nice settlement. They're happy. I'm happy. It's great. But a lot of Hispanics work for me. I've employed thousands and thousands of Hispanics even now. But I have over the years, thousands and thousands of Hispanics, and they're great. They're great. And we have a lot but -- so with Doral, I signed a contract for $170 million, right? Now I go in, Jorge Ramos, Well, no, we're going to do an interview with Jorge Ramos. Now, I'll do an interview with whoever. I'll do an interview, ready? So, I signed a contract and then I say, hey, now this is, remember, this is what we have to do with China, Japan, Vietnam, which is the new one that's killing us, Mexico, where everyone's moving into Mexico. I just heard Carrier air conditioner's moving in now. Nabisco's moving in. United Technologies moving in. Fords moving -- everybody. Hey, by the way, folks, stupid -- quiet. How stupid -- you know this guy's a -- you know he's my friend but he's really a pain. He keeps talking. Quiet. Quiet. Quiet. Quiet. He's not a protester but man is he noisy. So they're all moving into Mexico. So I buy Doral, $170 million, we haven't closed yet, and I said to my daughter, Ivanka, has anybody heard of Ivanka? She's great. And I go through it and it's in really bad shape. You know I was going to make it brand new but it's really in bad shape. So I go back and I meet all these guys from the Wharton School, from Harvard, you know, they're all guys, Wall Street guys because Wall Street had it. And I said and they're wonderful guys but I said, fellas, look. I'm not going to pay $170 million. I'm not doing it. It's too much money. The place is in terrible condition. If I didn't promise that I wouldn't use bad language I would have used much stronger language. It would have been more interesting but they won't like it. The place is in lousy condition. I don't like it. I'm not paying. So you've defrauded me. They said no way. I said I'll give you $100 million. They said no way. I said I'll give you $100 million. They said no way. And I said I'll give you $100 million. They said no way. And I said to Ivanka, watch. This is fun. You see to me it's fun. It's a game. For John Kerry, it's work, it's labor. It's a -- OK? Look at the deal he made with Iran, is that the saddest? But for me it's fun. I did this just for fun whether I paid more or less. It didn't really matter. It was a good price. We got it at the right time. So I said Ivanka, watch. So we go in, we meet these geniuses, I say, you've got to cut the price. It's not what you told us. It was -- I did an inspection. It's in terrible, terrible shape. You've got to. No way. They said no way. We'll make somebody else's -- I said you don't understand. I already signed a contract. It'll take years to break it. They said no way and they needed the money. No way we're going to do it. Within about three minutes I said how much would you take? How much would you agree to? I said I'll give you $110 million. They said we can't do that, we can't. Anyway, after about four minutes we agreed to take $20 million off. I paid one hundred -- I got for four minutes work I saved $20 million. Is that good? And honestly, it's not the story. That's the way we should be doing it with our country, right? You know? I have and I'm telling you I have the greatest business -- Carl Icahn endorsed me, great businessman. I have the greatest businesspeople in the world and we have them here and they all want to negotiate. They want to -- they don't want any money, right? Now we have guys that get their job because they contribute money to these politicians who are crooked is hell. Many, many of them, believe me, are crooked. Many of them are incompetent but one thing their genius is getting re-elected. That's all they care about. I mean, not everybody but for the most part. They want to get -- they want to get reelected. So, I tell that story. Then what I did I got it for the $150 million, then I fix it. Beautiful. It's open. It's doing great, OK? That's Doral. But you want to do that. That's what you want to do. Now, you take the Iran deal, $150 billion we give them, we get nothing. No, no, we get nothing. We get zero. We paid $150 billion and we got our four hostages back. We wouldn't have gotten them back. We basically paid a ransom. And that's a really bad precedent that we set. Believe me. We paid a ransom. We get nothing. And the way they abused this, during that deal, first of all, it took forever. It took forever to get the deal done. What was it three, four years? We should have had the hostages released before we started negotiating, right? And then they capture 10 wonderful sailors. They capture our sailors, they put guns to their heads, they drop them down to their knees, put your hands up, and you heard the guy with that voice, that was a rough cookie, you want to turn around and smack him. You want to -- that -- then you saw what happened. You saw what happened. And if they weren't getting the money, two days later, those sailors would be there forever, unless of course, I'm elected President. They would have been out before I ever took office. Believe me. So I would have said differently with the Iran deal. And I'm using this because this is where the oil deal is, this is where the oil deal is. I would have said, fellas, you got to do this. We're not going to do it. You've got to release our people. You don't need them. We don't -- I mean for us, for our people, getting those hostages back is very important. You've got to -- they're going to say no. Then you leave. You double up the sanctions. Within a couple of days, they'll call back. They'll give you the -- you got your hostages. Then I want to say just quickly, fellas, we can't pay you $150 billion. Once those hostages landed, about two seconds later, fellas, how you doing, everything good? Listen, the $150 billion, sorry, we don't have the money. We owe $19 trillion. We're don't have it. We don't have it. We don't have it. We don't have the money. They'll go crazy. A couple of days later they'll say let's go. We just saved $150 billion, and by the way, this isn't like maybe, this is 100%. This is 100%, but we have people that don't know what they're doing like John Kerry, our Secretary of State. We have people that don't know what they're doing. He's not equipped to negotiate. The Persians are great negotiators, OK? Always have been great negotiators. You look at what they did to us. He never once walked. We gave every single point. We have a 24-day inspection period. They have periods where they self inspect. Can you imagine a nuclear deal and we don't know what's there? We call up with a complaint and they say we'll call you back tomorrow. We will inspect the area. They call you back tomorrow, self-inspection, and they say, Mr. President, everything's fine. Now, you know, Obama calls the head the Supreme Leader. We won't use the term Supreme Leader, OK? He says we've just spoken to the Supreme Leader. He's not my Supreme Leader. I'll tell you that much right now. So many deals like that. Sergeant Bergdahl, he's a traitor. Now, think of it. He's a dirty rotten traitor. He left. We lost five or six, probably six. We lost five or six people. Young, beautiful people. Young, beautiful people. I watched their parents, young, beautiful people, five or six. They went out looking for him. They were killed. We lost these incredible people. We knew he was a traitor because a General and a Colonel was there interviewing the people that he was involved with. They all said he left so we knew it. We make a deal where we get Bergdahl a traitor and they get five of the biggest killers they had that they've coveted for nine years. And they got back and now they're back on the battlefield or soon will be. They want to kill you. They want to kill everybody else in front. So we get Bergdahl, they get five killers, and you know what? We're not negotiating that way anymore, folks. Not going to happen. Not going to happen. So the wall, the wall. Everyone loves it. Everyone. No, I love the wall. It's so easy. China, China, two thousand years ago built the Great Wall, The Great Wall of China. It's 13,000 miles long, it's massive, they didn't have Caterpillar tractor, by the way, 13,000 miles long. It's a massive wall. It does work. You know, the walls work, ask Israel. The walls work. Believe me. How about Europe? Some of the countries in Europe that weren't suckers to what happened with the migration like Merkel of Germany, what she did to Germany. And they want to build walls around their own countries now because what's going on in Europe, nobody knows where these people are from. And we all have a big heart, I have a big heart. You build safe zones in Syria to allow millions of people to pour into Europe. Because their leaders are as stupid as our leaders. And you have to see the crime in Germany now. The crime in Sweden, you saw what happened in Sweden, where the people are beginning to revolt. Sweden, Sweden doesn't have problems. The people are going crazy. Oh, is that a protester? Get them out of here. Get out of here. Get them out. You know it's amazing. It's amazing. You have that stuff. What do we really want? I mean, whether you're Liberal and Democrat, no matter, what do we really want? We want safety, right? We want healthcare. We want a good place to live. We want to make a good living. We want jobs. I mean, you think if you could talk to a couple of people like that for 10 minutes they'd be on our side but I don't know. Who knows? Maybe there's other problems that they have. You know there's a lot of people -- I don't understand it. You see that and it's amazing. You'll have a room like this. We have 16,000 people and you have so little protest. You know the amazing part to me though, you'll have, that was what one person or two people? So the press in the background, the press tomorrow headlines, Protesters at the Trump meeting. Protesters. So when I started on June 16th I said illegal immigration and I made it a very big thing. And nobody thought ever -- oh, did I take, hey, how tough was it, right? The abuse I took from the media was unbelievable but that was OK. I'm used to it. So the abuse, nobody ever has seen anything like it, and then what happened is people found out I was right. It's unbelievable crime coming through our border. They're hurting us economically but unbelievable crime. By the way, we want people to come into our country but they have to come into our country legally, legally, legally. They have to come in legally. So, the President of Mexico yesterday, or the ex-President, whatever or whoever, who cares? He said we will not even consider paying for the wall. You have to understand because, OK, are you ready? Who's going to pay for the wall? Who? 100%, 100%. So, I get a call from one of the reporters yesterday and they said the President of Mexico said they will not under any circumstances pay for the wall. They said to me what is your comment? I said the wall just got 10 feet higher. It's true. It's true. We, not me, are so tired of being pushed around by these other countries like we're a bunch of dummies, not going to happen anymore, OK? Not going to happen. Not going to happen. We have -- we have a situation where we lose so much money on trade and we lose so much money. You look at the trade deficit that we have with Mexico. So these characters that were on the stage, it started off with 17, now you're down to whatever, seven, eight, what difference does it make? They're going down fast, right? They're going down fast. And who won the last debate, please? Who won? Actually, you know in the online polls, Drudge is an amazing guy, by the way, Drudge. They do with these online polls, right? Time Magazine, Slate, I don't know all this. They do these online polls. Who won the debate? I've won every debate according to the polls. Now, I don't know. Maybe, maybe not but I think I've done well. You know I've never done this stuff before. I'm a job producer. I'll be the greatest job-producing President that God ever created. That I can tell you. That I can tell you. And we're going to take our jobs back from China. I want to take them back from everywhere. We are -- you know what? There's so many countries out, right now, right now, they have so many countries. We don't make good deals with any of them. We lose with everyone. This new trade deal, Trans-Pacific Partnership, partnership, is so bad. and what don't they cover in the deal to any great extent? They don't cover monetary manipulation. They don't cover devaluation. That's the way that we're getting killed because they're devaluing their currencies. They're killing it. They're making it impossible for our companies to compete and it's not going to happen. We're going to change it. We're going to have the greatest businesspeople in the world negotiating deals for us, not for me. So and we have degraded and I told you. Right now, we have political hacks. These Chinese, they train from the time they're three years old to be killers and they get and they take the best and the best and the best. It's like a triangle. It's like sports you end up with the top. That's who we negotiate with. And we have some people that don't even understand the rudiments, the basics of business. This year, we're going to lose $505 billion with China. What the hell is that all about? And when we deal with China and you send something over there we pay tax. When they send stuff to us, no tax, no problem. And believe me I have friends that are manufacturers that are great. They can't get their goods into China. But for China, no problem. So we're going to lose $500 billion, we've been losing it for years. We can't do it any longer, folks. It's going to be a time where we're not going to be the stupid people anymore. It's not going to happen anymore. Not going to happen anymore. We have -- we have so many things. These people come up to me they say, Donald, you don't really mean we're going to build a wall, do you? And I say, I say, absolutely, we're going to build a wall, 100%. They go, well, you don't really mean that that was like when I first started in June, I stand right for the We're going to build a wall. It's going to be a real wall. See that ceiling up there? I mean, there's a wall that if you get up there, you're not coming down very easily. Right now, we have a wall. Do you wee they got a little wall and they have -- they build ramps. I don't know why they just don't knock over the wall. They've built ramps over the wall. Up there, there's probably a severe penalty for knocking it so they just go -- they built. No, we don't give severe penalties, right? No. There can't be a severe penalty. You know we have great border patrol. I was in Laredo, Texas and I was asked, I was the guest of the Border Patrol. They called me and they said we would love to see you. Great people and they want to protect our border and they can do it. But they're told to stand back, let people come through. It is so horrible. Then Obama signs the Executive Order, let everyone come in. We've lost control. If we don't have a border we don't have a country, folks. We don't have a country. So these guys that I'm with, nice guys, some of them are nice some of them aren't but I don't care. And they say to me what do you mean build a wall? How are you going to build a wall? Do you know how simple? You know 15 years ago they wanted to build a wall. They couldn't build it because they couldn't get the environmental impact statement approved. Can you believe? They have toads, they have snakes, they have all sorts of things, they couldn't get an environment -- Can you believe this? Well, I've been saying bomb the oil, right? Over -- I've been saying bomb the oil, right? For four years I've been saying bomb the oil, and now finally, it took Paris and who is the first one to bomb the oil, the French? Can you believe that one, the French? The French bombed the oil. But I've been saying for years, bomb the oil, right? And what happens? They don't do it. And one of the reasons they don't want to do it because Obama feels that if you bomb the oil they're going to be things, carcinogens going up into the air. So Obama doesn't want to bomb the oil because he thinks it's bad for the environment. This is true. Can you believe this? Why do you think General George Patton or General Douglas MacArthur, our great modern-day Generals, what do you think they would have said? Bomb the oil, they would have bombed a hell of a lot more than the oil. I'll tell you right now. And you have to get points for vision. I'm the only one in the day that can say this. I said don't go into Iraq. I'm the most militaristic person in this room except for that guy right there. He probably beats me. He looks like, serious -- I'm the most militaristic person in this room. Believe me. We're going to build our military so big so strong. We are going to be -- nobody's going to play with us. Nobody's going to mess with us. We're going to have the best equipped Army. But you have to know, I don't want to use it. I think by making it stronger we're never going to have to use it. I actually think it's the safest thing we can do and it's the cheapest thing we can do. But -- right? I think it's the cheapest thing we can do. So when we have a situation like that we have to be prepared to go. Our military is not prepared. When General Odierno left, he was on one of the shows, our Generals are on all these shows. I never saw it -- did you ever see so many people on shows, our Generals, but he said we're the least prepared than we've ever been. I think he said ever. You can check it but he said at least for like many years. But I actually think he's at -- our preparedness and this is what we need with all these maniacs coming in. When we want to take people from the migration line, we have no idea who they are, we have absolutely no idea. They have no paperwork. There is absolutely no way we can ever tell. And I'll tell you, folks, we're not taking them, and if we do take them from somebody else, we're sending them back because we have no choice. We have no choice. We have no choice. So we are going to put ourselves in such an unbelievable position. We're going to start making money and we have to. A woman -- and I tell the story all the time, it was a few weeks ago. A woman came up, she said Mr. Trump, I don't like it when you say we're going to make our country rich again. I said I know because it's not like politically correct. Everything you have to say nowadays is politically correct. It's disgusting. Politically Correct. She said I don't like it when you talk about rich. Well, we have to save Social Security without cutting it like everyone wants to do. Cutting, cutting, cutting. We're going to save Medicare because it actually works. We'll get rid of the waste, fraud, and abuse. We're going to do things like they used to be done but we're going to do them even better. I'll tell you one thing, I'll tell you one thing. I've gotten to know the people of this country and somebody asked me today, one of the big stations, they asked me today what's your biggest surprise? And my biggest surprise and my biggest joy is that the people of our country are phenomenal. They're incredible people. They're really smart, really dedicated, and they really love the country. And they want to see it be great again. They want to see it be great again. So the guys come up to me in the wall, the people we're negotiating with. The guys that are getting all of this money from from -- and they say, how do you build a wall? Well, now the other day, I'm on television and one of our opponents is on television, and my wife comes up to me and she said, I don't believe it. The guy that I'm running against says we're going to build a wall. And then yesterday, somebody also said another one, we're going to build a wall. Where the hell were they? Number one, they don't know how to build the wall. If it's going to be a wall it's going to cost them ten times more. You know the old post office, it's under budget, ahead of schedule. That's the way you have to build. They don't know what to build. They don't know what to do. It'll never get built but then they come up to me that -- the new one is, Donald, you know Mexico's never going to pay for it. I say 100%, I say not 98%, not 99%, I said they're going to pay 100%. They're going to pay 100%. Well, how could you get them to pay? I said because the cost of the wall is peanuts. I haven't even figured out the cost. The cost of the wall is peanuts, absolute peanuts compared to the kind of money that Mexico is making off the United States, and that's not including all of the drugs that are flowing right through their border. That's not included. So these guys will never ever ask. Now, if you talk about that Mexico has lobbyists believe it or not. Everybody has a lobbyist. Every person that deals with the United States they have lobbyists and special interests. So when they come to me, they say look, lay off Mexico a little bit, you know, come on. They can't do that to me because nobody gave me money and I wouldn't do it. And I'm working for one group of people and that's this group of people. That's all, one group of people. I'll give you an example. I told you about drugs before. Jeb Bush is a total stiff. By the way, a total stiff, Jeb Bush. Listen to this, listen to this. The head of his finance committee is a friend of mine, his name is Woody Johnson. He's from Johnson & Johnson, Woody Johnson, Johnson & Johnson has a hard time with the Jets. Woody Johnson is a good guy. He's the head of his finance group so then when you wonder why is it that the politicians don't put out drugs to competitive bidding, and then you see Woody Johnson, works for this guy. When he was Governor we have -- what kind of cities do we have in Florida? What kind of cities, right? We have sanctuary cities in Florida while he was Governor, right? After he left Florida, went to hell. I was here in Florida it went to hell. And this is what we have. But anyway, so when you have Woody Johnson, now you have other Woody Johnsons, meaning other people in other industries taking care of all these people. So when they go up and then they say to him, well, you can't do that. These people took good care -- Johnson & Johnson put up millions of dollars, the drug industry. You can't do that. They're going to say, oh, you're right. They were very nice to me. They're right, OK, $300 billion a year down. When they come up to Trump, and they say, you can't do that. I say I sure as hell can. I sure as hell can. There is so much money that's being wasted. Some people think it's 25 years, 25 years to balance the budget. I said what are you talking about? What are you talking about? We'll do it fast. Now here's the thing, we'll do it fast but we'll have a better country. You'll have better service not worse. You'll have better service. It will be a better country. It'll be beautiful and we're going to -- we're going to do it, folks. Now listen, here's what's important, here's what's important. So you have the big vote coming up very soon, right? Very soon, we have it very soon, you got to do one thing. I don't want any of your money. I don't need your money. What we need, and it's not me, otherwise, we're just wasting our time. Look, the cover of Time Magazine, many times over the last few weeks, I mean, months. I mean, can you believe it? The last time I walked into my desk last week and there's a picture of me on the cover of Time Magazine and I said, oh, I think it's a postcard or something. I didn't even know I was on the cover. There it is. There it is. Turn that around. That was such a great -- and you know what? I don't talk about the other story. That story was written by somebody that gets it. That story -- you read that story from last week. That story and I didn't say that. I don't promote Time Magazine. I couldn't care less. That story they get it. That story was something special. Now, we've all wasted a lot of time. We've all wasted a lot of energy. In my case, I've wasted a lot of money if this doesn't happen. I don't care about the money but the energy is incredible. No, I think we have a really good chance. You know, when we won New Hampshire. When we won New Hampshire there were questions like, you know, I talked about the Muslim. We have a tremendous problem. And I said we have to study it. We have to see. There has to be a better -- nobody's going to say that. We have problems, folks. We have problems. We've got to find out radical Islamic terrorism. We have a President, won't even use the term. You can't solve a problem if you're afraid of it. You can't solve a problem if you're not going to even mention the name. So we're going to solve the problems. We're going to make our country so strong. We're going to win again and again. We're going to win so much. But here's what you have to do. You have to go out and vote or we're wasting our time. The movement ends and that's the end of it. So, I want to just tell you and I leave you with this. I love you, people and I've been all over. And what I said to my friend is true. I love you, people. Get out and vote. We're going to Make America Great Again. We're going to win all the time. We're going to bring our country back. And we're all going to be proud once again to be citizens of this incredible nation. Thank you."}