{"id":456,"author":"Donald Trump","title":"Speech: Donald Trump Holds a Town Hall Campaign Event in Londonderry, NH","date":"2016-02-08","link":"https://factba.se/transcript/donald-trump-speech-londonderry-nh-february-8-2016","paragraphs":["Some weather, huh? Hi, Al. How are you doing? You're on television. I saw Al on television today. It was great. So thank you, all for being here. This is really amazing. I mean, we're coming to the end of a beautiful, beautiful journey. I hear we're going to do well but the snow is out there. I don't know what effect will the snow have.","Will it have an effect? It can't have an effect. We can handle snow but it's going to be I think something special. Tomorrow's a very big day and it's going to be a very big day for the nation. And it's going to be a vote that I think people, if I believe everything I'm reading, we're going to do very well and we're going to see.","What do you think? We're going to do well. Make America Great Again. See that hat? To my guy, huh. And it's going to be very exciting. I want to thank Al. I saw him all over television today. There's nobody that loves the vets more than Al, right? And we're going to take care of the vets. We're going to take care of the vets and Al goes to the speeches of many of the candidates, all of the candidates essentially, and he's settled with Trump because I know the issues and I really know the issues.","And it seems like with the vets we almost have unanimous support because we know what to do. And we know what to -- they've been so poorly treated. They've been so badly treated. So, Al, you're going to make sure I keep that perfectly, right? We're going to have a lot of fun. We're going to take care a lot of people.","They're our greatest people and we're not taking care of -- you know we have illegal immigrants that are taken care of better than our vets. So it's going to be something. So we're going to stop in terms of trade. We're going to stop the craziness that's going on. We're going to stop so much in terms of purchasing.","You know when our country purchases drugs with the largest drug purchaser in the world. I'm talking about prescription drugs, all kinds of drugs, drugs to make you better. We barely even negotiate with the drug companies. The reason we don't negotiate is because the people that I'm running against are all getting money from the drug companies.","I'm the only one, I get no money from anybody. I feel a little bit like am I foolish. In fact, I wonder I'm self-funding my campaign. I wonder, I'm the only one on either side. And I thought well, I thank you but I often wonder, does it make a difference because do people really know it? And I think some people do but a lot of people don't. You know they don't even know the difference.","You know when Woody Johnson, as an example, of Johnson & Johnson, is self-funding a guy like Jeb Bush, now, Jeb is not going anywhere. This guy is not a guy that can go anywhere. Total stiff. But now, here's a guy spent. Think of it. Spend $110 million and he's just going nowhere. But, but Woody Johnson's the head of his campaign to raise money and Woody Johnson's Johnson & Johnson.","Then you wonder why we don't negotiate with the drug companies, OK? We're going to Joe -- who? He can't win a football game. That's well, he's a nice guy. Woody's actually a friend of mine. He's a nice guy. But you know when you look at that and you see what's happening, hundreds of billions of dollars and saving if we make a favorite nation's laws.","If we do anything. If we negotiate that's one out of many. You have defense contractors the same thing. You have so many. So there's so much fat in this budget. There's so much fat in the way we purchase. It's going to be a thing of beauty. We're going to do much better than even I've been saying. I'm telling you much better than even I've been saying.","So you know, one of the things with New Hampshire that amazes me because you come through this idyllic setting, this beautiful, with the trees, and the beautiful roads, winding up to the hill, like, where we are right now in this little area, and I say, wow, is this beautiful. And yet every time I'm with the folks on New Hampshire and I've been here long before the political stuff because I have a lot of friends, some in this room.","I've been here long before the political stuff. So I know New Hampshire very well and I love it. I love the people. They really are amazing people. But I always hear -- thank you, honey. Who said that? Who said that? Thank you. I know she's voting. Thank you, darling. But I've always heard and it amazes me, heroin and the drug problem, and I don't see it with New Hampshire.","You know, you don't see it but the people of New Hampshire it's like the first question I always get is what are you going to do about the drug problem? So who's better than me on the border? The drugs are pouring in across the Southern border for the most part heroin and all sorts of drugs. And I'm talking countrywide.","It's countrywide but they're pouring, pouring, pouring through. And I'm going to build the wall and you know that and I'm going to have Mexico pay for the wall and the reason they're going to pay -- thank you. The reason and these other guys don't even understand. You know six months ago they said what do you mean you're going to build a wall?","You can't build a wall. Well, the Great Wall of China is 13,000 miles. By the way, that's a serious wall too. It's 13,000 miles. This wall's 2,000 of which we need 1,000 because we have a lot of natural barriers, which are frankly, great but we need about a thousand, 1,000 miles. So China can do 13,000 two thousand years ago and we can't do 1,000 today with brand new Caterpillar tractors.","We don't use Komatsu. We'll use, ideally we're using Caterpillar. So we're going to build -- we're going to have a great border. We're going to have a real border and people can come into the country but they have to come in legally. They have to go through the process. They have to come in legally and that border is very important.","Immigration is so important. When you look at ISIS, I don't know if you've heard, just before I got here, there was a big attack in Europe where they have many ISIS people in different countries. Attacking in Germany, I just started two seconds ago, I was actually on a show and they interrupted me for this attack, and I said, wow, that's bad.","And you know, you got to interrupt for the attack. It's an attack but it's pretty bad. And it's ISIS, supposedly, it's ISIS. It just happened two minutes ago in CNN. It's ISIS and it's a lot of people in Europe. What are we doing? We don't -- we can't do this anymore. They want to let these people come in. We have no idea where they're from.","You know the migration. I have a bigger heart than anybody but we have to be smart. We have no idea where they come from. It could be the great Trojan horse. Look at what's going on in Germany. Look at what's went on in Sweden last week. Sweden, where there's going to be a revolution. Whoever heard of this in Sweden.","It never happened before and they're having tremendous crime, tremendous problems. You know what we have enough problems, folks. We can be nice. We'll get a safe zone. I will get the Gulf states to pay for it. I don't want to pay for it. We're tired of paying. We owe $19 trillion like a business. If we had a business you'd say the same thing.","I don't want to pay for it, right? We just made a deal with Iran. We gave them $150 billion, OK? I would have said we don't have the money. Sorry. Sorry, we can't do it. We don't have the money. So we're not going to do it anymore. We're not going to do it anymore. We're not going to be the stupid people anymore.","We're not going to have the stupid leaders anymore. We're going to have people. We have the greatest businesspeople in the world right here. We're going to have our great business leaders, Carl Icahn, who's one of the greats. He just endorsed me and other people are endorsing me. They all want to endorse me but we're going to have these great business leaders negotiate our deals with China and with Japan.","Japan sends cars in here like it's candy, right? Cars, cars by the millions. Japan. We give them practically nothing. We've got to have balance. We've got to have fair trade. I'm a free trader, by the way, 100% but we've got to have fair trade and smart trade. We can't lose. Last year was $505 billion with China, one country, OK? Trade imbalance.","I mean, we're losing a fortune. We can't do it. At some point, we can't do it and we don't have the right people negotiating. We have people, and as I said, they're political hacks. We have hacks negotiating. So we're going to have great borders. We're going to have strong borders. We're going to be careful with who we let into the country.","We can't allow people that are going to cause trouble. We have enough problems without more trouble. So I came in, when I announced on June 16th, I went downstairs in Trump Towers, it's like the Academy Awards with these guys, with the press. It was like the Academy Awards and I started talking about illegal immigration and everyone went crazy.","And two weeks later, everybody started saying, you know, maybe Trump has a point. And then four weeks later, right? And then, and then, four weeks later they're saying bah, bah, bah. Then they started coming to me and they started saying, well, we're just as tough as him. They're not. In fact, you know Joe, Sheriff Joe from Arizona, he endorsed me last week.","Sarah Palin endorsed me. Sheriff Joe endorsed me. When Sheriff Joe endorses you have the toughest on immigration. But what is funny and I laughed because even during the debate somebody said -- but over the last week or so I've been hearing and we're going to build a wall. I said, well, and my wife said it to me last week.","She heard -- I won't mention the name of the person because nice guy, but he was talking about we will build a wall at the border. And my wife kept darling, did he just say going to build a wall? First time we've heard that. So look these are politicians, OK? I heard just Jeb Bush is a total lightweight.","I heard Jeb Bush say before, yes, Marco Rubio is a very, very good friend of mine. I said he's not a friend of yours. He's not a friend. He hates him. Why does he have to say he's a friend of mine. He just said it on Wolf Blitzer. I was listening. Marco is a friend of mine. He's a dear friend. This is political stuff, folks.","We got to get out of it. We got to get out of it. Not friends, you know, not friends. And they lie and they lie so much. It's just incredible. We have to get away from these politicians and we have to bring sanity to this country. And the nice part about me is that because I'm not being taken care of by the oil companies and by the drug companies and by all of the other companies and by countries, by countries because you have, not only companies, you have companies and countries that have lobbyists and that debate the other night which I -- which everybody did say I won but I won't say that.","You know when the Time Magazine, Time Magazine did a poll. Now I have zero influence over Time Magazine. So they did a poll, 70% almost 70% said I won the debate, and I think next was 6% or 7%. So was pretty good. But no, I love doing it but I listened to the whole thing and then I said I had to point out to the audience, the crowd was all donors.","In fact, I needed some tickets. So we called the RNC and they said, oh, I'm sorry we don't have any. They were all bought up by the donors. Now they actually mean the donors, special interests and lobbyists, don't want to say that, right? The donors special and I said what do you mean? That's not fair to me, I'm the only one that doesn't have any donors.","That means the room were stacked. So I had a thousand people in the room, most of whom, were donors to these other guys. And people would say something that was like, you know, nothing. And you'd hear clapping. That's because they're desperate to have these people elected. So it's sort of funny but I had it pointed out.","Who else would point it out? I said this room is stacked with donors. No, I wanted to do it because if I won the debate and I think I did. I mean, I know the points like anybody else but I won the debate. But you know, when somebody else has things that are really bad and they get applause, they're only getting applause because these people have total control over your local politician and over your federal politician, over your national politicians.","And I will tell you, we're going to change it around. We're going to change it around. So you know, we have -- we have a big day coming up tomorrow. It's really important. So I don't want your money. You know a lot of these guys come in they ask for money. Can you believe it? If you could give -- I don't want any money.","I don't need money. I built a great company like one of the great companies. I have some of the greatest assets in the world. Great, very little debt, great care. I don't need that and the only reason I even mentioned that is because that's the kind of thinking we need in the country. Enough with these stupid people.","That's the kind of thinking we need in the country. I wouldn't mention that. You know it takes guts to run for President and it does. I told you the story when I was coming down the escalator. Just took a deep breath, I said to my wife let's go. But I took a deep, deep breath because it does. It's something.","I've never done this before and I'm enjoying it. I'm enjoying it. But we have to bring sanity. I'm not doing it because of that because I can think of other things as much as I love your people. I could be on a beach someplace. It's not so bad, right? We could be someplace else. The fact is I love the end result of what's going to be. We're going to have a phenomenal, strong, powerful, rich country again.","One woman came up to me, a wonderful woman, she said, you know Mr. Trump, I'm supporting you and I really like you but I don't like one thing. You say you're going to make our country rich. I say, honey, you know I can't help it. If we don't make it rich I see that tat. If we don't make it rich we can't make it great.","We need money. We need money. We're no different than a person when it's no different than a company. We have to be rich and we can't be rich. We're being drained by all of these devaluations and these other countries that are run by smarter people than our people. I mean to put it mildly they're smarter people.","And also they don't have the same influence. You know we're influenced by all of the money. When you see these PACs when you see a guy like Jeb, a guy who's a very average guy or less than an average guy having all of this money where they give him $128 million to waste and then he takes ads against me. I think he's spent $25 million on negative ads on me and my poll numbers went up. No, it's incredible.","Then you see him on television. He wants to raise taxes. He doesn't like the Second Amendment. He did all the things that I say exactly the opposite. I'm doing the biggest tax cut. In fact, I just talked to Larry Kudlow, the great economist and he was saying Trump has the best tax plan. I'm doing the biggest tax cut but then I have a politician, this guy and he's on television saying that I want to raise taxes and I want to -- I don't like the Second Amendment.","I'm the strongest and you have heard me talk. I'm the strongest person on the Second Amendment that exists of these candidates, not even close. So when you hear a guy talking about he wants to do harm to the Second Amendment, I just hope people don't believe these things. These are lying people. These are lying bad people.","So we are going to do something that's going to be spectacular and you're going to be there. And this is a very special group of people. And that's why I wanted to do a do-over. And believe it or not I couldn't get the plane in, so you know, I took a little heat for that for the snow and now it snows again.","I said there's no way I'm going to I said, I said I don't care if I have to come through the Yukon, there's, there's no way. And I thought with that, I think what we'll do is we'll take a few questions. So, go ahead. Anybody have any questions? Yeah, go ahead. Go ahead. Oh, you have a question?","Yeah, go ahead. OK. Whoa. Oh, very. Oh, I know that very powerful.","Thank you. Thank you.","Right.","We're going to bring our jobs back. You know I passed some of the factories and I passed some of the old factories. Some empty and some, you know, with senior citizen housing, and different housing. And the housing is all great and all the senior citizens but eventually, we have to -- we need jobs, OK? Not just a place to stay.","We need jobs. You know they used to be booming and now they're empty or they were converted into, in many cases, senior citizen housing. We need right now in this country, we need jobs. That's what we need. And the jobs have gone. They've gone to Mexico and I mean, in this area what -- what's happened to you with Mexico, with people that don't know what they're doing with trade agreements.","I mean it's incredible. I'm going to bring the jobs back and they'll come back here but they're going to come back all over the country. You look at, I mean, it's important. We love the country. I want the automobile industry to come. Let them come back into Michigan. Now Ford's building a $2.5 billion plant in Mexico.","I talk about it all the time. It's ridiculous. And then, they'll sell cars and then they'll sell it to this country for no tax, no nothing. What do we get out of it? How does it help us when Ford is building this plant, $2.5 billion. Think of it. It's a one-story building, $2.5 billion. Do you know how big this thing is? Now they're going to make thousands and millions of cars and trucks and parts.","How does it help us? It's in Mexico. How does it help us? That they're going to make these cars and sell many of them into the United States along with trucks and parts. Where is it good for us? Now you know that they close factories in the United States in order to do this. So I went to the Wharton School of Finance, you went to your own schools, whether you went to school or not.","You don't have to -- I mean, it's no good, OK? It's no good. So I told people and I tell it all the time. I would say, folks, if you're going to go there we're charging you tax. You want to -- you want to leave us, build a plant, make cars and sell them back, you're going to have to pay big tax. You know what you do that they're not going to go there.","They're going to stay right here, OK, 100% they're going to stay right here. And so we're going to do things and just Mr. Mayor, first of all, congratulations, I hear you do a great job. So congratulations, really. But unfortunately, 99% of the country has got problems. You know when you hear about the 5% unemployment rate, it's sad that they can even get away with it because the real rate could be 25%. Some people think it's 42% but you have tens of millions of people that have given up looking for a job.","And honestly, I go to Dallas, I go to all these places, I have 20,000 people filling an arena tonight. You're all invited, by the way, over to the Verizon. You know that, right? I hope -- who's going tonight? Are you all going? I hope you're going to go. Yeah, because we're going to have an amazing, we're going to have an amazing event there tonight.","And again, the snow but I think we'll still have it. It will still be a great event. It's going to be amazing. But much more important don't go tonight if it's going to hold back your vote tomorrow. Tomorrow's more important. But you know, we have to do something. We have to do something fast. Most of the country is in turmoil.","And when I get these massive people 35,000 people recently in Mobile, Alabama and they show up, 35,000 people. When I get all of these people, this may -- that's because we don't have jobs and the stock, stock market today is down by the way, almost 350 points. Is anybody getting killed in the stock market with your money?","Yeah, and this guy. Well, it'll come back, kid. Let me get in. You have a conflict of interest. I'll get it up. I mean, look we have to get it up but the stock market is absolutely being killed. What is it? Oh, 384, wow. That's a big hit. But that's, you know, we've had -- the stock market is the worst in its history for the first month, worst in its history for the first period.","So let's see what happens. That was our only vestige of hope by the way because the stock market was good but everything else was bad and I kept saying Don't worry. The stock market will follow and that's what happened. OK. How are you?","Who are they? Oh, oh, I don't know who he is. Never heard of him. Who is it? Well, I would certainly return it if you think it's appropriate. I would -- I know nothing about him. I have? OK, then I would return it. Don't be so angry. I don't even know who he is. Who the hell is he? I don't know.","And you know it's interesting because it's interesting. You know my sons are hunters and they love hunting and they know all about your moose up here. They told me about -- they were actually telling me that. Is that mostly disease are you saying or is that from hunting? Wow.","Wow, that's unbelievable. And it's down 50 -- 50?","Wow, that's amazing. I'll look at that. That's incredible. Yeah, go ahead.","Well, I'm a big -- I do support the death penalty. I'd have to be a little bit careful with that. If somebody kills somebody I support the death penalty. And I support the death penalty for policemen that get killed when they go on -- I mean, we had a case in New York where they go into the car. They put the gun to an officer's head they pull the trigger.","Death penalty all the way. I've always supported the death penalty. I've always supported the death penalty. I don't even understand people that don't. I mean, you have cases that are so egregious where a guy will come up to an 85-year old woman, punch her in the face, shoot her in the head, rape her, kill her, and then they put him in jail for 25 years.","How you can even think of that? And I have friends that are good people and they say no, no, it's cruel and unusual punishment. What is that? It's like the other day during the debate. They talked about the, you know, the whole thing with waterboarding. And they said to actually, Ted Cruz, good guy. They were talking to him about it and you could see he was hedging.","He didn't want to get involved too much you know. Well, I don't know. You know you could see it. I mean, I understand because maybe they feel it's politically incorrect to talk about waterboarding. No, waterboarding is sort of the least form of torture. If it's torture or some people think it's not actually torture but it's sort of a minimal form.","But they talk to him and he was really very tentative to put it mildly. Then they said, well, what do you think? I said I'm totally in favor of waterboarding but I'm also in favor of far worse than waterboarding because people are chopping off the heads of our people. They're chopping off the heads. They're chopping off the heads.","And I don't know maybe I lose votes if I say that. I don't care. You got to be yourself. I think one of the reasons I'm doing so well. For -- I don't have pollsters. You know these guys they can't speak. When Bush was asked a question when he first started about is the war in Iraq good? So what do we do? I was opposed to it, and by the way, I am a very militaristic person.","Our military is going to be so big, so strong, so powerful, nobody is going to mess with us. Believe me. But you got to know and I don't want to use it. But you got to know and they asked them what was the war in Iraq good or bad? Well, I don't know. I don't -- Remember that five days, six days, he gave one answer or another, he went back and forth.","This is a guy who is pathetic. And then finally, the pollsters told him what to say and he said it was bad. Of course, it was bad. We spent $2 trillion. We got nothing. Thousands of lives, wounded warriors who I love all over the place, we get nothing. And now Iran has taken over Iraq. You know that's the only deal they made that's better than $150 billion.","I always say the $150 billion was one of the greatest deals I've ever -- the greatest deal is we gave them Iraq and Iraq has the second-largest oil reserves in the world. So Iran is doing that. Now they're taking over Yemen, not because they want Yemen, they don't want Yemen. They want Saudi Arabia. They'll go and take over Saudi Arabia and then Saudi Arabia, we defend them for practically nothing.","We have bases where we pay rent. We pay rent in Saudi Arabia. Now, I like the Saudis, the Saudis are fine. I do business with them. Great. Why are we paying rent in Saudi Arabia? They were making $1 billion a day before the oil went down. So now they're making half, OK? We pay rent for military bases. We protect them.","Why are we paying rent? They should pay a lot of money if we're going to protect them. I think it's great. South Korea we protect. We have 28,000 soldiers in South Korea. I order thousands and thousands of televisions and all sorts of things, air conditioners. I order thousands and thousands of them. They all come through South Korea.","They make a fortune. They are a Behemoth. So when North Korea acts up with this maniac, they act up. We start the ships. We this, we that, we're going to protect. What do we get? We get nothing. Get peanuts. A fraction of the real cost, a fraction. And they're good the South -- I have buildings in South Korea.","But you know what. We got to, we got to be taken care of. We're not a nation that has to do this. We protect Germany. Nobody even knows that. We protect, as an example, Japan. We have a treaty with Japan. If Japan gets attacked we have to go to their defense, start World War 3, right? If we get attacked, Japan doesn't have to do anything.","Now, these are the deals that we have. So we get attacked, we get attacked. Japan's, it's too bad you got attacked. Bye-bye. Have fun. Enjoy yourself. They get attacked, we have to go to war. And I say, who makes these deals? Politicians, crooked politicians, in many cases, not stupid politicians. They have people from Japan that take care of them through the lobbyists, through special interests for other reasons in a lot of industry.","So you know those days are gone. If I get in you will be so proud of our country and we're using our smartest people. We're not going to use the dummies. We're going to use the smartest people. We're going to use the great geniuses, many of whom, build great fortunes and would love to do it. They don't want money.","They don't want any money. Is your leg OK? You look like a rough guy even with a bad leg, right? Looks like a tough cookie this guy. I wouldn't mess around with him even with that, right? Anyway. But we -- So we have to get smart and we have to get tough and we have to be vigilant. You know, when I talked about the Muslims, everybody, same thing when I talked about illegal immigration and Mexico, oh, the heat.","Then I talked about the Muslims. We've got a problem. Everybody wanted to say -- we have a President that won't talk about radical Islamic terrorism. He won't talk about it. He won't mention it. I mean, when it's 100%, like in Paris, 100% in California, the 14 people that were killed, 100%. We have a President won't even talk about it. If you can't talk about it, you can't even use the name, you're never going to solve the problem.","So what I said we have to have a moratorium. We have to have a ban until we find out what's going on. And it's temporary and all but it's got to be a ban because there's a lot of hatred out there. I took a tremendous amount of heat and now everyone's sort of saying Trump is right, he's right. Look at what's going on in the world.","Look at Germany, look at Sweden, look at these places. Look at what's happening in the world. So I will tell you, we have to do what's right. And in my case, I do something that's a little different. If it's votes I don't go to a pollster. I didn't go to a pollster and say could you tell me how it would be if I told the truth about what's going on with radical Islamic terrorism.","I didn't say to a pollster that these people, these very, in many cases, not smart people, they pay so much money. They can't function without a pollster. They can't function. Everything's polled. That's our politicians. I don't have -- I have much more money than them but I don't have a pollster. I don't want a pollster.","I say the truth. Most of the people in here understand what the truth is and they get it. And many times, it's probably bad for me but I don't care because if it means I lose because I say the truth I'd rather lose. Does that make sense? Yes, go ahead.","Did you like what I had to say?","Beautiful.","And with prescription so what happened? Did he have the prescription?","Right. I can see that. No, but I can see that. The love of your son is incredible and I can see that and you should want to. I'd be in the same position.","Well, you do that. You let us know and we will and you know, the guys you could call the Mayor or somebody and what I would do that -- no, because I can see the passion. I see the passion and you're right and it's things that could have been avoided. And they start on the heroin because it's so cheap. There's so much of it. You know people from here they say how cheap it is and that's the problem.","It's so cheap and it's so readily available that everybody starts it and that's where it starts. And frankly, a lot of times that's where it's end because you know because it's got such power. When I say politician, you know, I always say I hate calling myself a politician because I know the politicians too well.","And I do. I hate -- I usually don't even say the word politician because I hate calling myself a politician. I guess, probably by definition, over the last six or seven months that's what I am. But I still refuse to say I'm a politician. Go ahead.","It's unbelievable. What do you think those people -- of the 6,000 almost every single one of them will be back selling drugs, OK? These people have babies that think differently and a lot of them don't even think differently. They just don't care. Frankly, I don't even think they care. It's almost like they don't like the country.","But out of those 6,000, every single one of them will be back selling drugs. It'll be very rare for one that doesn't. It's a tough situation. I'm sorry about your son. And we will and Mary, you'll remember that. You'll bring a group if we win. You're going to come to the White House. You're going to bring a group.","Because I can learn much more from Steve than I can learn from these consultants who get paid millions of dollars you know. I can learn, honestly, so much more from Steve than I can from these consultants that get paid millions and millions of dollars by the governments and all of the different groups that hire them.","He knows more and he's one hand than they know. Now as far as the wall is concerned, Mexico, in all fairness, Mexico could stop this stuff. They're tough as hell. They could stop it. They could stop people from coming across the border. They have no respect for our country. They have no respect. They could stop it one day before the wall.","The wall is going up, folks. I don't care. The wall is going up. No, no, but Mexico, the Mexican government could stop that. They could stop it in two minutes. You know in Mexico, a friend of mine was in Mexico, they were on a vacation or something, and he's overstayed for like two days, and he gets a knock on the door from the police.","Why are you here? You're not supposed to be here. Questioning him. He's a business guy. He didn't know what was going on. But by the way that's the right thing. Why are you here? You're not here, you're supposed to have left the country. Can you imagine us doing that in our country? They just walk right through or anchor babies.","Try having an anchor baby in Mexico, OK? Just try and they'll laugh at you. They wouldn't even know what you're talking about. So anyway, go ahead, ma'am.","Well, part of the problem you have is regulation, right? The regulations are so brutal on small businesses and we're going to be getting rid of so many of those regulations. We're going to go back. We may go back 20 years but they have put regulations on us and all it does is bureaucracy. It's like Common Core.","I'm totally opposed to Common Core. You have to see the Department of Education. As you know, guys, guys, like guys, like Jeb Bush are totally in favor of Common Core. They want your kids educated from Washington and they're weak on immigration. Remember they come as an act of love. That was Jeb Bush. They come as an act of love.","Give me a break. They come as an act of love and you can't have that. But with the small businesses and businesses generally, including large businesses, the regulations are so onerous you can't survive. Go ahead.","The fees that's right.","And they've been through the whole thing.","Nothing like education being locally based. I've seen it. I've watched it. I'm a big believer in education. I've had a great education that helped me a lot. And I will tell you, education is so important. Common Core is a disaster. It's good for the people in Washington but it's a disaster. We're going to have education.","And just to put it -- so in the world we're number 30, 30 in the world in education. We're number one in cost per pupil but we're number 30 in the world, not going to happen anymore folks. We're going to go, Common Core is going to be out of here. Yeah, go ahead.","I agree.","Don, give me some stuff. OK. Give it to him. He'll give it to you. OK. Thank you. Thank you. Very interesting. Yes, go ahead.","Oh, it's, it's, yeah. It's going up so fast. Go ahead.","Yeah, to put it mildly.","It's going to go up another $2 trillion very soon because of the new budget. Go ahead.","It happened because we have incompetent politicians. It happened because we have crooked politicians. It happened because we have politicians that are getting massive campaign contributions and they are protecting companies and countries. And with me, none of that's going to happen. It's going to be -- don't worry.","We're going to get it done. We're going to get it. It's called competition. It's called -- I'll guarantee you. I told you the story about the drug companies. In the military, you have the same thing. In education, you have the same thing. You have the same thing everywhere. No competition. It's going to go down tremendously.","It's going to go down. OK. Go ahead. Yes.","Plan to stop. You have no idea how many people ask that question. You know in one way you hate to talk about it because you just want to surprise. I always say unpredictable. When Obama announced that we're leaving Iraq on a certain date the enemy said who would tell us that? And they pulled back. You know they don't want to die as much as people say they don't care.","They do care and they pulled back and right after that date they went in and did whatever they want to do and you know it's gone. It's frankly, it's all controlled by Iran now. Soon it will be totally controlled including all of the oil. But there's a certain thing, you know, remember the 50 soldiers that we're sending over about three months ago.","We are sending 50 soldiers over to Iraq and Syria. We're sending 50 soldiers. Big news conference. Why are we telling people this right, doll? Why are we telling people this? Why do we just -- why do we send them? So now these 50 young, beautiful people have targets on their back. Everyone's looking for them.","If he wouldn't say that they wouldn't know but he wants the publicity, he wants to show -- and actually, it's not even a good thing to say because 50 sounds so small. It's almost like what do you do with 50 people? But why do you say this? So you know when they say what are you going to do with ISIS? I have absolute plans.","I told you about the oil. I want to knock the hell out of the oil and take it away from everything else. But I hate to talk about it. I just want to do it. I want to do it. I want to do it. And I have some very definite ideas. We have to do the banking circuits. You know they have banking circuits that are very sophisticated where money is pouring in but you don't like to talk.","I have a real chance of winning. You've got to get out and vote tomorrow. But if I win I'm not going to be talking. I'm not going to be saying you know, I always say, I use the ex -- you know, General George Patton and General MacArthur, these were great sort of semi-modern day Generals. These were tough cookies.","They didn't talk. They didn't talk. Can you imagine General George Patton being asked sitting on a television show talking about what he's going to do? He'd smack the hell -- he likes smacking, he liked smacking people in the face. He'd smack the anchor in the face for asking him the question. Now, but it's a different kind of a world.","And I don't want to be talking too much about things like that. All I can say, darling, is trust me. We will win. We will win so fast, OK? And we'll hit them very, very hard. Yes, sir. Go ahead.","I'm absolutely OK with term limits. I don't think -- to me, it's not the most important thing. I'll be honest with you. Because, you know, in theory, a term limit are the voters, right? If somebody doesn't do their job you vote them out. So I've always viewed that as a term limit. But I'm absolutely OK with term limits.","They are protective of themselves. Well, they don't have to take Obamacare. Do you ever notice? I mean, little things like that. You tell me how good is Obamacare? We're going to repeal it and replace it. How good is Obamacare when they don't have to take it, OK? They don't have to take it. We have to take it. They don't have to take it. That tells you everything right there.","It's disgusting. I'm OK with getting rid of the term, OK? OK, maybe one more and we'll and we'll go out. Let's see a real good one. Who's got a good, interesting question? He's a gruff-looking guy. That guy. Go ahead, darling. Go ahead. Go ahead. Hi.","A young flight attendant.","Right.","And were you on that flight previously?","I understand.","And angry is OK you know because being angry is OK. We're going to get there. We're going to make you happy again. But being angry is OK. Go ahead.","I don't blame you, frankly.","No, I understand. Yeah.","The world is a different place. And we've allowed it. We have allowed it to become a different place. It's not that it should be different. We've allowed it through weakness, through weakness to be a different place. And you know, it's an interesting word that she uses because she talks about anger. And I liked that you talked about that word because I'm going to discuss it. Go ahead.","Are you finished?","I understand. Thank you, darling. Thank you very much. I understand what you're going through. So recently, before the previous debate, you know, the one I missed I'm very happy with because I raised $6 million, Al knows, for the vets. So I'm very happy with that. I don't know good or bad for me but I raised $6 million for the vets but recently, I was asked about are we angry?","Because you know we have a whole movement going on and we're on the cover of Time Magazine. I say, we, we, all of us. Were on the cover of Time Magazine and last week there was an amazing story but it's in a movement. And recently, in as you know, Governor Nikki Haley made a speech and she talked about the anger like it was a bad thing.","By the end of the day, she was talking about it like it was you know, OK. Because she was being hit from so many -- because people are angry. We're angry at the stupidity of our government. The fact that we allow things like ISIS to happen, shouldn't happen. The weakness of our leaders, the total weakness.","So during the debate, they asked me, the previous debate, they asked me about anger. And I said and it was as per what she was saying. And they thought I was going to say, well, no, I'm not angry. I'm really not angry. I thought to myself, you know, I have to think pretty quickly on these things. But I thought to myself, I said, yeah, I am angry and a lot of people are angry.","We're not angry people. I'm not an angry person but we're angry at the level of incompetence and a level of stupidity that we see in our government. And until we correct it, we're going to continue to be angry. And I'm damn angry and so are the people that show up by the thousands to these events. So there's nothing wrong with being angry and we'll get that straightened out.","And you know, it's very interesting and that afternoon, Nikki Haley said, no, Donald Trump's my friend and he's a contributor. No, it's a whole different change but the truth is and I'm not knocking her I'm not saying anything bad. I'm just saying, certainly, the tone changed. We are angry and we're not angry people.","But when we see the kind of stupidity that we see, when we see Sergeant Bergdahl, we get Bergdahl, a traitor who six people got killed looking for him and they get five killers that are back in the battlefields or soon will be. That's not what we want when we give Iran $150 billion we get nothing. And then they go and here are our 10 sailors.","And frankly, if the money had been passed they'd still have them and then they take the money, they don't buy from us. As a whole, yeah, we're angry. We're angry. Hopefully, we're not going to be angry for long because we're not angry. We're not angry people but when we see the stupidity and the incompetence we are angry and there's nothing wrong about being angry.","I hope you're angry enough to go out and vote tomorrow, folks, OK? Thank you. Thank you, everybody. Thank you. Thank you, Don. Thank you, everybody. Oh, good. Oh, good. Great, Al. Why didn't you make the presentation? Oh, good. How are you? Hi, Stuart. Nice to see you, Stuart. Great.","Thank you. Great. Congratulations. That's good. Good, I'll sign that right now.","Congratulations. Thank you, everybody. I appreciate it very much. Thank you.","I'll sign that right now."],"text":" Some weather, huh? Hi, Al. How are you doing? You're on television. I saw Al on television today. It was great. So thank you, all for being here. This is really amazing. I mean, we're coming to the end of a beautiful, beautiful journey. I hear we're going to do well but the snow is out there. I don't know what effect will the snow have. Will it have an effect? It can't have an effect. We can handle snow but it's going to be I think something special. Tomorrow's a very big day and it's going to be a very big day for the nation. And it's going to be a vote that I think people, if I believe everything I'm reading, we're going to do very well and we're going to see. What do you think? We're going to do well. Make America Great Again. See that hat? To my guy, huh. And it's going to be very exciting. I want to thank Al. I saw him all over television today. There's nobody that loves the vets more than Al, right? And we're going to take care of the vets. We're going to take care of the vets and Al goes to the speeches of many of the candidates, all of the candidates essentially, and he's settled with Trump because I know the issues and I really know the issues. And it seems like with the vets we almost have unanimous support because we know what to do. And we know what to -- they've been so poorly treated. They've been so badly treated. So, Al, you're going to make sure I keep that perfectly, right? We're going to have a lot of fun. We're going to take care a lot of people. They're our greatest people and we're not taking care of -- you know we have illegal immigrants that are taken care of better than our vets. So it's going to be something. So we're going to stop in terms of trade. We're going to stop the craziness that's going on. We're going to stop so much in terms of purchasing. You know when our country purchases drugs with the largest drug purchaser in the world. I'm talking about prescription drugs, all kinds of drugs, drugs to make you better. We barely even negotiate with the drug companies. The reason we don't negotiate is because the people that I'm running against are all getting money from the drug companies. I'm the only one, I get no money from anybody. I feel a little bit like am I foolish. In fact, I wonder I'm self-funding my campaign. I wonder, I'm the only one on either side. And I thought well, I thank you but I often wonder, does it make a difference because do people really know it? And I think some people do but a lot of people don't. You know they don't even know the difference. You know when Woody Johnson, as an example, of Johnson & Johnson, is self-funding a guy like Jeb Bush, now, Jeb is not going anywhere. This guy is not a guy that can go anywhere. Total stiff. But now, here's a guy spent. Think of it. Spend $110 million and he's just going nowhere. But, but Woody Johnson's the head of his campaign to raise money and Woody Johnson's Johnson & Johnson. Then you wonder why we don't negotiate with the drug companies, OK? We're going to Joe -- who? He can't win a football game. That's well, he's a nice guy. Woody's actually a friend of mine. He's a nice guy. But you know when you look at that and you see what's happening, hundreds of billions of dollars and saving if we make a favorite nation's laws. If we do anything. If we negotiate that's one out of many. You have defense contractors the same thing. You have so many. So there's so much fat in this budget. There's so much fat in the way we purchase. It's going to be a thing of beauty. We're going to do much better than even I've been saying. I'm telling you much better than even I've been saying. So you know, one of the things with New Hampshire that amazes me because you come through this idyllic setting, this beautiful, with the trees, and the beautiful roads, winding up to the hill, like, where we are right now in this little area, and I say, wow, is this beautiful. And yet every time I'm with the folks on New Hampshire and I've been here long before the political stuff because I have a lot of friends, some in this room. I've been here long before the political stuff. So I know New Hampshire very well and I love it. I love the people. They really are amazing people. But I always hear -- thank you, honey. Who said that? Who said that? Thank you. I know she's voting. Thank you, darling. But I've always heard and it amazes me, heroin and the drug problem, and I don't see it with New Hampshire. You know, you don't see it but the people of New Hampshire it's like the first question I always get is what are you going to do about the drug problem? So who's better than me on the border? The drugs are pouring in across the Southern border for the most part heroin and all sorts of drugs. And I'm talking countrywide. It's countrywide but they're pouring, pouring, pouring through. And I'm going to build the wall and you know that and I'm going to have Mexico pay for the wall and the reason they're going to pay -- thank you. The reason and these other guys don't even understand. You know six months ago they said what do you mean you're going to build a wall? You can't build a wall. Well, the Great Wall of China is 13,000 miles. By the way, that's a serious wall too. It's 13,000 miles. This wall's 2,000 of which we need 1,000 because we have a lot of natural barriers, which are frankly, great but we need about a thousand, 1,000 miles. So China can do 13,000 two thousand years ago and we can't do 1,000 today with brand new Caterpillar tractors. We don't use Komatsu. We'll use, ideally we're using Caterpillar. So we're going to build -- we're going to have a great border. We're going to have a real border and people can come into the country but they have to come in legally. They have to go through the process. They have to come in legally and that border is very important. Immigration is so important. When you look at ISIS, I don't know if you've heard, just before I got here, there was a big attack in Europe where they have many ISIS people in different countries. Attacking in Germany, I just started two seconds ago, I was actually on a show and they interrupted me for this attack, and I said, wow, that's bad. And you know, you got to interrupt for the attack. It's an attack but it's pretty bad. And it's ISIS, supposedly, it's ISIS. It just happened two minutes ago in CNN. It's ISIS and it's a lot of people in Europe. What are we doing? We don't -- we can't do this anymore. They want to let these people come in. We have no idea where they're from. You know the migration. I have a bigger heart than anybody but we have to be smart. We have no idea where they come from. It could be the great Trojan horse. Look at what's going on in Germany. Look at what's went on in Sweden last week. Sweden, where there's going to be a revolution. Whoever heard of this in Sweden. It never happened before and they're having tremendous crime, tremendous problems. You know what we have enough problems, folks. We can be nice. We'll get a safe zone. I will get the Gulf states to pay for it. I don't want to pay for it. We're tired of paying. We owe $19 trillion like a business. If we had a business you'd say the same thing. I don't want to pay for it, right? We just made a deal with Iran. We gave them $150 billion, OK? I would have said we don't have the money. Sorry. Sorry, we can't do it. We don't have the money. So we're not going to do it anymore. We're not going to do it anymore. We're not going to be the stupid people anymore. We're not going to have the stupid leaders anymore. We're going to have people. We have the greatest businesspeople in the world right here. We're going to have our great business leaders, Carl Icahn, who's one of the greats. He just endorsed me and other people are endorsing me. They all want to endorse me but we're going to have these great business leaders negotiate our deals with China and with Japan. Japan sends cars in here like it's candy, right? Cars, cars by the millions. Japan. We give them practically nothing. We've got to have balance. We've got to have fair trade. I'm a free trader, by the way, 100% but we've got to have fair trade and smart trade. We can't lose. Last year was $505 billion with China, one country, OK? Trade imbalance. I mean, we're losing a fortune. We can't do it. At some point, we can't do it and we don't have the right people negotiating. We have people, and as I said, they're political hacks. We have hacks negotiating. So we're going to have great borders. We're going to have strong borders. We're going to be careful with who we let into the country. We can't allow people that are going to cause trouble. We have enough problems without more trouble. So I came in, when I announced on June 16th, I went downstairs in Trump Towers, it's like the Academy Awards with these guys, with the press. It was like the Academy Awards and I started talking about illegal immigration and everyone went crazy. And two weeks later, everybody started saying, you know, maybe Trump has a point. And then four weeks later, right? And then, and then, four weeks later they're saying bah, bah, bah. Then they started coming to me and they started saying, well, we're just as tough as him. They're not. In fact, you know Joe, Sheriff Joe from Arizona, he endorsed me last week. Sarah Palin endorsed me. Sheriff Joe endorsed me. When Sheriff Joe endorses you have the toughest on immigration. But what is funny and I laughed because even during the debate somebody said -- but over the last week or so I've been hearing and we're going to build a wall. I said, well, and my wife said it to me last week. She heard -- I won't mention the name of the person because nice guy, but he was talking about we will build a wall at the border. And my wife kept darling, did he just say going to build a wall? First time we've heard that. So look these are politicians, OK? I heard just Jeb Bush is a total lightweight. I heard Jeb Bush say before, yes, Marco Rubio is a very, very good friend of mine. I said he's not a friend of yours. He's not a friend. He hates him. Why does he have to say he's a friend of mine. He just said it on Wolf Blitzer. I was listening. Marco is a friend of mine. He's a dear friend. This is political stuff, folks. We got to get out of it. We got to get out of it. Not friends, you know, not friends. And they lie and they lie so much. It's just incredible. We have to get away from these politicians and we have to bring sanity to this country. And the nice part about me is that because I'm not being taken care of by the oil companies and by the drug companies and by all of the other companies and by countries, by countries because you have, not only companies, you have companies and countries that have lobbyists and that debate the other night which I -- which everybody did say I won but I won't say that. You know when the Time Magazine, Time Magazine did a poll. Now I have zero influence over Time Magazine. So they did a poll, 70% almost 70% said I won the debate, and I think next was 6% or 7%. So was pretty good. But no, I love doing it but I listened to the whole thing and then I said I had to point out to the audience, the crowd was all donors. In fact, I needed some tickets. So we called the RNC and they said, oh, I'm sorry we don't have any. They were all bought up by the donors. Now they actually mean the donors, special interests and lobbyists, don't want to say that, right? The donors special and I said what do you mean? That's not fair to me, I'm the only one that doesn't have any donors. That means the room were stacked. So I had a thousand people in the room, most of whom, were donors to these other guys. And people would say something that was like, you know, nothing. And you'd hear clapping. That's because they're desperate to have these people elected. So it's sort of funny but I had it pointed out. Who else would point it out? I said this room is stacked with donors. No, I wanted to do it because if I won the debate and I think I did. I mean, I know the points like anybody else but I won the debate. But you know, when somebody else has things that are really bad and they get applause, they're only getting applause because these people have total control over your local politician and over your federal politician, over your national politicians. And I will tell you, we're going to change it around. We're going to change it around. So you know, we have -- we have a big day coming up tomorrow. It's really important. So I don't want your money. You know a lot of these guys come in they ask for money. Can you believe it? If you could give -- I don't want any money. I don't need money. I built a great company like one of the great companies. I have some of the greatest assets in the world. Great, very little debt, great care. I don't need that and the only reason I even mentioned that is because that's the kind of thinking we need in the country. Enough with these stupid people. That's the kind of thinking we need in the country. I wouldn't mention that. You know it takes guts to run for President and it does. I told you the story when I was coming down the escalator. Just took a deep breath, I said to my wife let's go. But I took a deep, deep breath because it does. It's something. I've never done this before and I'm enjoying it. I'm enjoying it. But we have to bring sanity. I'm not doing it because of that because I can think of other things as much as I love your people. I could be on a beach someplace. It's not so bad, right? We could be someplace else. The fact is I love the end result of what's going to be. We're going to have a phenomenal, strong, powerful, rich country again. One woman came up to me, a wonderful woman, she said, you know Mr. Trump, I'm supporting you and I really like you but I don't like one thing. You say you're going to make our country rich. I say, honey, you know I can't help it. If we don't make it rich I see that tat. If we don't make it rich we can't make it great. We need money. We need money. We're no different than a person when it's no different than a company. We have to be rich and we can't be rich. We're being drained by all of these devaluations and these other countries that are run by smarter people than our people. I mean to put it mildly they're smarter people. And also they don't have the same influence. You know we're influenced by all of the money. When you see these PACs when you see a guy like Jeb, a guy who's a very average guy or less than an average guy having all of this money where they give him $128 million to waste and then he takes ads against me. I think he's spent $25 million on negative ads on me and my poll numbers went up. No, it's incredible. Then you see him on television. He wants to raise taxes. He doesn't like the Second Amendment. He did all the things that I say exactly the opposite. I'm doing the biggest tax cut. In fact, I just talked to Larry Kudlow, the great economist and he was saying Trump has the best tax plan. I'm doing the biggest tax cut but then I have a politician, this guy and he's on television saying that I want to raise taxes and I want to -- I don't like the Second Amendment. I'm the strongest and you have heard me talk. I'm the strongest person on the Second Amendment that exists of these candidates, not even close. So when you hear a guy talking about he wants to do harm to the Second Amendment, I just hope people don't believe these things. These are lying people. These are lying bad people. So we are going to do something that's going to be spectacular and you're going to be there. And this is a very special group of people. And that's why I wanted to do a do-over. And believe it or not I couldn't get the plane in, so you know, I took a little heat for that for the snow and now it snows again. I said there's no way I'm going to I said, I said I don't care if I have to come through the Yukon, there's, there's no way. And I thought with that, I think what we'll do is we'll take a few questions. So, go ahead. Anybody have any questions? Yeah, go ahead. Go ahead. Oh, you have a question? Yeah, go ahead. OK. Whoa. Oh, very. Oh, I know that very powerful. First, Mr. Trump, thank you for visiting the great town of Londonderry. It's great to have you here. Thank you. Thank you. We've got a lot of economic development going on in this town. Right. Probably more than any other town in New Hampshire right now. But what will you do as a country to make us more economically competitive in the future? We're going to bring our jobs back. You know I passed some of the factories and I passed some of the old factories. Some empty and some, you know, with senior citizen housing, and different housing. And the housing is all great and all the senior citizens but eventually, we have to -- we need jobs, OK? Not just a place to stay. We need jobs. You know they used to be booming and now they're empty or they were converted into, in many cases, senior citizen housing. We need right now in this country, we need jobs. That's what we need. And the jobs have gone. They've gone to Mexico and I mean, in this area what -- what's happened to you with Mexico, with people that don't know what they're doing with trade agreements. I mean it's incredible. I'm going to bring the jobs back and they'll come back here but they're going to come back all over the country. You look at, I mean, it's important. We love the country. I want the automobile industry to come. Let them come back into Michigan. Now Ford's building a $2.5 billion plant in Mexico. I talk about it all the time. It's ridiculous. And then, they'll sell cars and then they'll sell it to this country for no tax, no nothing. What do we get out of it? How does it help us when Ford is building this plant, $2.5 billion. Think of it. It's a one-story building, $2.5 billion. Do you know how big this thing is? Now they're going to make thousands and millions of cars and trucks and parts. How does it help us? It's in Mexico. How does it help us? That they're going to make these cars and sell many of them into the United States along with trucks and parts. Where is it good for us? Now you know that they close factories in the United States in order to do this. So I went to the Wharton School of Finance, you went to your own schools, whether you went to school or not. You don't have to -- I mean, it's no good, OK? It's no good. So I told people and I tell it all the time. I would say, folks, if you're going to go there we're charging you tax. You want to -- you want to leave us, build a plant, make cars and sell them back, you're going to have to pay big tax. You know what you do that they're not going to go there. They're going to stay right here, OK, 100% they're going to stay right here. And so we're going to do things and just Mr. Mayor, first of all, congratulations, I hear you do a great job. So congratulations, really. But unfortunately, 99% of the country has got problems. You know when you hear about the 5% unemployment rate, it's sad that they can even get away with it because the real rate could be 25%. Some people think it's 42% but you have tens of millions of people that have given up looking for a job. And honestly, I go to Dallas, I go to all these places, I have 20,000 people filling an arena tonight. You're all invited, by the way, over to the Verizon. You know that, right? I hope -- who's going tonight? Are you all going? I hope you're going to go. Yeah, because we're going to have an amazing, we're going to have an amazing event there tonight. And again, the snow but I think we'll still have it. It will still be a great event. It's going to be amazing. But much more important don't go tonight if it's going to hold back your vote tomorrow. Tomorrow's more important. But you know, we have to do something. We have to do something fast. Most of the country is in turmoil. And when I get these massive people 35,000 people recently in Mobile, Alabama and they show up, 35,000 people. When I get all of these people, this may -- that's because we don't have jobs and the stock, stock market today is down by the way, almost 350 points. Is anybody getting killed in the stock market with your money? Yeah, and this guy. Well, it'll come back, kid. Let me get in. You have a conflict of interest. I'll get it up. I mean, look we have to get it up but the stock market is absolutely being killed. What is it? Oh, 384, wow. That's a big hit. But that's, you know, we've had -- the stock market is the worst in its history for the first month, worst in its history for the first period. So let's see what happens. That was our only vestige of hope by the way because the stock market was good but everything else was bad and I kept saying Don't worry. The stock market will follow and that's what happened. OK. How are you? Hi, yes or no? Will you return the contribution that you received from White Nationalist, William Daniel Johnson? Who are they? Oh, oh, I don't know who he is. Never heard of him. Who is it? Well, I would certainly return it if you think it's appropriate. I would -- I know nothing about him. I have? OK, then I would return it. Don't be so angry. I don't even know who he is. Who the hell is he? I don't know. Thank you, Mr. Trump. You know I was sitting here reminding myself that 53 years ago, I actually went to with seventh grade Valentine's dance in this very room. I went to school across the street from here and we had no gym. So this was our gym. Well, you know, some you people say I might have changed a bit in 53 years, I tell you what has been changing in New Hampshire is that what is growing shorter and our moose numbers are down about 50%. And as our winters have shrunk and the disease for the moose are up, we need -- you know, you're not a shy guy. You've been kind of shy to talk about climate change. We need someone who will address climate change and help make our moose great again. And you know it's interesting because it's interesting. You know my sons are hunters and they love hunting and they know all about your moose up here. They told me about -- they were actually telling me that. Is that mostly disease are you saying or is that from hunting? Wow. You know the moose -- Wow, that's unbelievable. And it's down 50 -- 50? No, 75% of moose died last winter. Wow, that's amazing. I'll look at that. That's incredible. Yeah, go ahead. Do support the death penalty for convicted drug dealers convicted of causing a death due to the -- Well, I'm a big -- I do support the death penalty. I'd have to be a little bit careful with that. If somebody kills somebody I support the death penalty. And I support the death penalty for policemen that get killed when they go on -- I mean, we had a case in New York where they go into the car. They put the gun to an officer's head they pull the trigger. Death penalty all the way. I've always supported the death penalty. I've always supported the death penalty. I don't even understand people that don't. I mean, you have cases that are so egregious where a guy will come up to an 85-year old woman, punch her in the face, shoot her in the head, rape her, kill her, and then they put him in jail for 25 years. How you can even think of that? And I have friends that are good people and they say no, no, it's cruel and unusual punishment. What is that? It's like the other day during the debate. They talked about the, you know, the whole thing with waterboarding. And they said to actually, Ted Cruz, good guy. They were talking to him about it and you could see he was hedging. He didn't want to get involved too much you know. Well, I don't know. You know you could see it. I mean, I understand because maybe they feel it's politically incorrect to talk about waterboarding. No, waterboarding is sort of the least form of torture. If it's torture or some people think it's not actually torture but it's sort of a minimal form. But they talk to him and he was really very tentative to put it mildly. Then they said, well, what do you think? I said I'm totally in favor of waterboarding but I'm also in favor of far worse than waterboarding because people are chopping off the heads of our people. They're chopping off the heads. They're chopping off the heads. And I don't know maybe I lose votes if I say that. I don't care. You got to be yourself. I think one of the reasons I'm doing so well. For -- I don't have pollsters. You know these guys they can't speak. When Bush was asked a question when he first started about is the war in Iraq good? So what do we do? I was opposed to it, and by the way, I am a very militaristic person. Our military is going to be so big, so strong, so powerful, nobody is going to mess with us. Believe me. But you got to know and I don't want to use it. But you got to know and they asked them what was the war in Iraq good or bad? Well, I don't know. I don't -- Remember that five days, six days, he gave one answer or another, he went back and forth. This is a guy who is pathetic. And then finally, the pollsters told him what to say and he said it was bad. Of course, it was bad. We spent $2 trillion. We got nothing. Thousands of lives, wounded warriors who I love all over the place, we get nothing. And now Iran has taken over Iraq. You know that's the only deal they made that's better than $150 billion. I always say the $150 billion was one of the greatest deals I've ever -- the greatest deal is we gave them Iraq and Iraq has the second-largest oil reserves in the world. So Iran is doing that. Now they're taking over Yemen, not because they want Yemen, they don't want Yemen. They want Saudi Arabia. They'll go and take over Saudi Arabia and then Saudi Arabia, we defend them for practically nothing. We have bases where we pay rent. We pay rent in Saudi Arabia. Now, I like the Saudis, the Saudis are fine. I do business with them. Great. Why are we paying rent in Saudi Arabia? They were making $1 billion a day before the oil went down. So now they're making half, OK? We pay rent for military bases. We protect them. Why are we paying rent? They should pay a lot of money if we're going to protect them. I think it's great. South Korea we protect. We have 28,000 soldiers in South Korea. I order thousands and thousands of televisions and all sorts of things, air conditioners. I order thousands and thousands of them. They all come through South Korea. They make a fortune. They are a Behemoth. So when North Korea acts up with this maniac, they act up. We start the ships. We this, we that, we're going to protect. What do we get? We get nothing. Get peanuts. A fraction of the real cost, a fraction. And they're good the South -- I have buildings in South Korea. But you know what. We got to, we got to be taken care of. We're not a nation that has to do this. We protect Germany. Nobody even knows that. We protect, as an example, Japan. We have a treaty with Japan. If Japan gets attacked we have to go to their defense, start World War 3, right? If we get attacked, Japan doesn't have to do anything. Now, these are the deals that we have. So we get attacked, we get attacked. Japan's, it's too bad you got attacked. Bye-bye. Have fun. Enjoy yourself. They get attacked, we have to go to war. And I say, who makes these deals? Politicians, crooked politicians, in many cases, not stupid politicians. They have people from Japan that take care of them through the lobbyists, through special interests for other reasons in a lot of industry. So you know those days are gone. If I get in you will be so proud of our country and we're using our smartest people. We're not going to use the dummies. We're going to use the smartest people. We're going to use the great geniuses, many of whom, build great fortunes and would love to do it. They don't want money. They don't want any money. Is your leg OK? You look like a rough guy even with a bad leg, right? Looks like a tough cookie this guy. I wouldn't mess around with him even with that, right? Anyway. But we -- So we have to get smart and we have to get tough and we have to be vigilant. You know, when I talked about the Muslims, everybody, same thing when I talked about illegal immigration and Mexico, oh, the heat. Then I talked about the Muslims. We've got a problem. Everybody wanted to say -- we have a President that won't talk about radical Islamic terrorism. He won't talk about it. He won't mention it. I mean, when it's 100%, like in Paris, 100% in California, the 14 people that were killed, 100%. We have a President won't even talk about it. If you can't talk about it, you can't even use the name, you're never going to solve the problem. So what I said we have to have a moratorium. We have to have a ban until we find out what's going on. And it's temporary and all but it's got to be a ban because there's a lot of hatred out there. I took a tremendous amount of heat and now everyone's sort of saying Trump is right, he's right. Look at what's going on in the world. Look at Germany, look at Sweden, look at these places. Look at what's happening in the world. So I will tell you, we have to do what's right. And in my case, I do something that's a little different. If it's votes I don't go to a pollster. I didn't go to a pollster and say could you tell me how it would be if I told the truth about what's going on with radical Islamic terrorism. I didn't say to a pollster that these people, these very, in many cases, not smart people, they pay so much money. They can't function without a pollster. They can't function. Everything's polled. That's our politicians. I don't have -- I have much more money than them but I don't have a pollster. I don't want a pollster. I say the truth. Most of the people in here understand what the truth is and they get it. And many times, it's probably bad for me but I don't care because if it means I lose because I say the truth I'd rather lose. Does that make sense? Yes, go ahead. I came to see the slide from Frank Conway. 15 years ago, I've lost my 19-year old son to a prescription drug overdose and I've been fighting this fight for a long time talking to a lot of the so-called politicians. I heard you speak yesterday up in Plymouth. It took me two hours to drive down, by the way, been traveling. The situation -- Did you like what I had to say? I did because you said one thing that was wrong though. You're not a politician. You're a public servant, a public servant. We need just -- we need a leader that's going to really tackle this problem. I think the last time that this country took the drug issue seriously was when Ronald Reagan and George H.W. Bush were in office. We had Nancy Reagan just say no, I mean, a lot of people thought that was trivial but it really wasn't. I mean, this is my boy. Beautiful. This is my boy who passed away. And with prescription so what happened? Did he have the prescription? He was a so-called weekend warrior, as I call him, you know, a lot of kids start off with marijuana and think it's no big deal. In today's drug culture, all the drugs have come together. When we look at heroin -- you know, obviously, heroin came all about because of the prescription drug problem. It created a vacuum. You know we had a methamphetamine problem. When pseudoephedrine was locked down we had a meth problem. The Mexicans jumped on that too. So obviously, the majority of the heroin coming across the border is coming from Mexico and South America. We need a President and a leader that really will take this on. We -- I'd love to have your wife -- there's many, many family groups like mine. They're out there and I think tapping into that effort and tapping into an energy can make a difference in our country. I mean, I could go on and on but -- Right. I can see that. No, but I can see that. The love of your son is incredible and I can see that and you should want to. I'd be in the same position. And I would love for your wife and Ivanka to be part of the parent group when you get to the White House I will reach out. Well, you do that. You let us know and we will and you know, the guys you could call the Mayor or somebody and what I would do that -- no, because I can see the passion. I see the passion and you're right and it's things that could have been avoided. And they start on the heroin because it's so cheap. There's so much of it. You know people from here they say how cheap it is and that's the problem. It's so cheap and it's so readily available that everybody starts it and that's where it starts. And frankly, a lot of times that's where it's end because you know because it's got such power. When I say politician, you know, I always say I hate calling myself a politician because I know the politicians too well. And I do. I hate -- I usually don't even say the word politician because I hate calling myself a politician. I guess, probably by definition, over the last six or seven months that's what I am. But I still refuse to say I'm a politician. Go ahead. And I guess, while I was thinking, I tell you my mind is going a million miles an hour here. But there was something I wanted to say and I went blank. I'm sorry, folks. But the border is important and I understand where -- you know, what we need to do. And there's a lot of parents out there that want to get those parent groups back, started again, and, oh, I know what I wanted to talk about, the 6,000 drug dealers who were let out of jail. Hopefully, we won't have a repeat of that. It's unbelievable. What do you think those people -- of the 6,000 almost every single one of them will be back selling drugs, OK? These people have babies that think differently and a lot of them don't even think differently. They just don't care. Frankly, I don't even think they care. It's almost like they don't like the country. But out of those 6,000, every single one of them will be back selling drugs. It'll be very rare for one that doesn't. It's a tough situation. I'm sorry about your son. And we will and Mary, you'll remember that. You'll bring a group if we win. You're going to come to the White House. You're going to bring a group. Steve, you know, I'll have someone make sure. Because I can learn much more from Steve than I can learn from these consultants who get paid millions of dollars you know. I can learn, honestly, so much more from Steve than I can from these consultants that get paid millions and millions of dollars by the governments and all of the different groups that hire them. He knows more and he's one hand than they know. Now as far as the wall is concerned, Mexico, in all fairness, Mexico could stop this stuff. They're tough as hell. They could stop it. They could stop people from coming across the border. They have no respect for our country. They have no respect. They could stop it one day before the wall. The wall is going up, folks. I don't care. The wall is going up. No, no, but Mexico, the Mexican government could stop that. They could stop it in two minutes. You know in Mexico, a friend of mine was in Mexico, they were on a vacation or something, and he's overstayed for like two days, and he gets a knock on the door from the police. Why are you here? You're not supposed to be here. Questioning him. He's a business guy. He didn't know what was going on. But by the way that's the right thing. Why are you here? You're not here, you're supposed to have left the country. Can you imagine us doing that in our country? They just walk right through or anchor babies. Try having an anchor baby in Mexico, OK? Just try and they'll laugh at you. They wouldn't even know what you're talking about. So anyway, go ahead, ma'am. I want to -- I would like to thank you very much for running President. We really need a better President than we have now. Me and my husband are small business owners. We've been in business for 43 years. I would like to know if -- what you're going to do for the people that have been here struggling to stay in business and trying to provide for the people in this area. And we're at the point where we don't know long we're going to make -- Well, part of the problem you have is regulation, right? The regulations are so brutal on small businesses and we're going to be getting rid of so many of those regulations. We're going to go back. We may go back 20 years but they have put regulations on us and all it does is bureaucracy. It's like Common Core. I'm totally opposed to Common Core. You have to see the Department of Education. As you know, guys, guys, like guys, like Jeb Bush are totally in favor of Common Core. They want your kids educated from Washington and they're weak on immigration. Remember they come as an act of love. That was Jeb Bush. They come as an act of love. Give me a break. They come as an act of love and you can't have that. But with the small businesses and businesses generally, including large businesses, the regulations are so onerous you can't survive. Go ahead. The fees that the government impose on us -- The fees that's right. But the other thing, the Common Core is a very important one for me because we hire people that can't even subtract and add and do percentages and I have to do it myself. And they've been through the whole thing. Their -- Nothing like education being locally based. I've seen it. I've watched it. I'm a big believer in education. I've had a great education that helped me a lot. And I will tell you, education is so important. Common Core is a disaster. It's good for the people in Washington but it's a disaster. We're going to have education. And just to put it -- so in the world we're number 30, 30 in the world in education. We're number one in cost per pupil but we're number 30 in the world, not going to happen anymore folks. We're going to go, Common Core is going to be out of here. Yeah, go ahead. I'm Ruby Wyles and I drove 500 miles to meet you, Mr. Trump to ask for your help in education. I remember when our country was great again and I believe it can be great again. I agree. I grew up as a poor middle-class, lower-middle-class family. I'm the first person in my family to go to college. I went to Penn, graduated Cum Laude. I'm another alumn. And so I went back to rural Pennsylvania and I started a non-profit based focused on literacy and education. For four years, I've been giving free books away. We've given 75,000 worth of free books to kids in rural -- Northwestern Pennsylvania, our county. But I realized we need a different kind of school and I came here to ask for your help in raising funds to open what I call the first Equal Opportunity School. I'll -- Don, give me some stuff. OK. Give it to him. He'll give it to you. OK. Thank you. Thank you. Very interesting. Yes, go ahead. OK, so from my I understand that from 1791 to 2008 the national debt was $10 trillion and now it's -- Oh, it's, it's, yeah. It's going up so fast. Go ahead. It went up a lot. Yeah, to put it mildly. In the last few years so what do you -- It's going to go up another $2 trillion very soon because of the new budget. Go ahead. So how did this happen and what do we do? It happened because we have incompetent politicians. It happened because we have crooked politicians. It happened because we have politicians that are getting massive campaign contributions and they are protecting companies and countries. And with me, none of that's going to happen. It's going to be -- don't worry. We're going to get it done. We're going to get it. It's called competition. It's called -- I'll guarantee you. I told you the story about the drug companies. In the military, you have the same thing. In education, you have the same thing. You have the same thing everywhere. No competition. It's going to go down tremendously. It's going to go down. OK. Go ahead. Yes. What is your exact plan to stop ISIS? Plan to stop. You have no idea how many people ask that question. You know in one way you hate to talk about it because you just want to surprise. I always say unpredictable. When Obama announced that we're leaving Iraq on a certain date the enemy said who would tell us that? And they pulled back. You know they don't want to die as much as people say they don't care. They do care and they pulled back and right after that date they went in and did whatever they want to do and you know it's gone. It's frankly, it's all controlled by Iran now. Soon it will be totally controlled including all of the oil. But there's a certain thing, you know, remember the 50 soldiers that we're sending over about three months ago. We are sending 50 soldiers over to Iraq and Syria. We're sending 50 soldiers. Big news conference. Why are we telling people this right, doll? Why are we telling people this? Why do we just -- why do we send them? So now these 50 young, beautiful people have targets on their back. Everyone's looking for them. If he wouldn't say that they wouldn't know but he wants the publicity, he wants to show -- and actually, it's not even a good thing to say because 50 sounds so small. It's almost like what do you do with 50 people? But why do you say this? So you know when they say what are you going to do with ISIS? I have absolute plans. I told you about the oil. I want to knock the hell out of the oil and take it away from everything else. But I hate to talk about it. I just want to do it. I want to do it. I want to do it. And I have some very definite ideas. We have to do the banking circuits. You know they have banking circuits that are very sophisticated where money is pouring in but you don't like to talk. I have a real chance of winning. You've got to get out and vote tomorrow. But if I win I'm not going to be talking. I'm not going to be saying you know, I always say, I use the ex -- you know, General George Patton and General MacArthur, these were great sort of semi-modern day Generals. These were tough cookies. They didn't talk. They didn't talk. Can you imagine General George Patton being asked sitting on a television show talking about what he's going to do? He'd smack the hell -- he likes smacking, he liked smacking people in the face. He'd smack the anchor in the face for asking him the question. Now, but it's a different kind of a world. And I don't want to be talking too much about things like that. All I can say, darling, is trust me. We will win. We will win so fast, OK? And we'll hit them very, very hard. Yes, sir. Go ahead. Right here. Yeah. Like this. I was just curious as to what your thoughts may have been on term limits for the Congressmen and their lifelong payment. Because I don't know of any job in the world that when you stop doing it, you continue getting paid for the rest of your life. I'm absolutely OK with term limits. I don't think -- to me, it's not the most important thing. I'll be honest with you. Because, you know, in theory, a term limit are the voters, right? If somebody doesn't do their job you vote them out. So I've always viewed that as a term limit. But I'm absolutely OK with term limits. They are protective of themselves. Well, they don't have to take Obamacare. Do you ever notice? I mean, little things like that. You tell me how good is Obamacare? We're going to repeal it and replace it. How good is Obamacare when they don't have to take it, OK? They don't have to take it. We have to take it. They don't have to take it. That tells you everything right there. It's disgusting. I'm OK with getting rid of the term, OK? OK, maybe one more and we'll and we'll go out. Let's see a real good one. Who's got a good, interesting question? He's a gruff-looking guy. That guy. Go ahead, darling. Go ahead. Go ahead. Hi. I'm an old flight attendant with United Airlines. A young flight attendant. Very old and I flew Flight 175 September 10th and in watching the news, the first tower was hit and then, I saw my airplane with my friends on Flight 175. Right. And they were young and good kids, good kids. Two of them just -- Amy and her boyfriend Ted had just gotten engaged the week before on the layover -- And were you on that flight previously? I'm 24 hours and they were my friends. Good, good, good kids. Young like 20 years old. I could have been there their mom but a lot of survivor's guilt. And when I got back on the airplane to work a trip, I was so -- I was so angry. I wasn't afraid at all. I was -- I was almost looking for these guys. I understand. I don't know what I would have done but I was looking for -- but I was so angry and I was so sad. And the two together, it was tough to function and I had to -- And angry is OK you know because being angry is OK. We're going to get there. We're going to make you happy again. But being angry is OK. Go ahead. But the two together, it -- I had to walk away from the job and I love my job. I mean, I know the world has changed. I don't blame you, frankly. Well, it's -- Yeah this was in the 70s when I started. It's just so different. No, I understand. Yeah. And September 12th -- The world is a different place. And we've allowed it. We have allowed it to become a different place. It's not that it should be different. We've allowed it through weakness, through weakness to be a different place. And you know, it's an interesting word that she uses because she talks about anger. And I liked that you talked about that word because I'm going to discuss it. Go ahead. Are you finished? I was just going to say, I had to walk away from my job and a lot of like PTSD. Why them? They're so young. Why not me? But this little girl asked about ISIS but I asked Governor Christie and Governor Bush what they would do to protect my family, my friends, all of the people in this room, you know, our country how to protect us. I mean, I expect North Korea to go knocking on the door at the White House and saying, you know, you gave Iran $150 billion what are you going to give me? What -- I understand. Thank you, darling. Thank you very much. I understand what you're going through. So recently, before the previous debate, you know, the one I missed I'm very happy with because I raised $6 million, Al knows, for the vets. So I'm very happy with that. I don't know good or bad for me but I raised $6 million for the vets but recently, I was asked about are we angry? Because you know we have a whole movement going on and we're on the cover of Time Magazine. I say, we, we, all of us. Were on the cover of Time Magazine and last week there was an amazing story but it's in a movement. And recently, in as you know, Governor Nikki Haley made a speech and she talked about the anger like it was a bad thing. By the end of the day, she was talking about it like it was you know, OK. Because she was being hit from so many -- because people are angry. We're angry at the stupidity of our government. The fact that we allow things like ISIS to happen, shouldn't happen. The weakness of our leaders, the total weakness. So during the debate, they asked me, the previous debate, they asked me about anger. And I said and it was as per what she was saying. And they thought I was going to say, well, no, I'm not angry. I'm really not angry. I thought to myself, you know, I have to think pretty quickly on these things. But I thought to myself, I said, yeah, I am angry and a lot of people are angry. We're not angry people. I'm not an angry person but we're angry at the level of incompetence and a level of stupidity that we see in our government. And until we correct it, we're going to continue to be angry. And I'm damn angry and so are the people that show up by the thousands to these events. So there's nothing wrong with being angry and we'll get that straightened out. And you know, it's very interesting and that afternoon, Nikki Haley said, no, Donald Trump's my friend and he's a contributor. No, it's a whole different change but the truth is and I'm not knocking her I'm not saying anything bad. I'm just saying, certainly, the tone changed. We are angry and we're not angry people. But when we see the kind of stupidity that we see, when we see Sergeant Bergdahl, we get Bergdahl, a traitor who six people got killed looking for him and they get five killers that are back in the battlefields or soon will be. That's not what we want when we give Iran $150 billion we get nothing. And then they go and here are our 10 sailors. And frankly, if the money had been passed they'd still have them and then they take the money, they don't buy from us. As a whole, yeah, we're angry. We're angry. Hopefully, we're not going to be angry for long because we're not angry. We're not angry people but when we see the stupidity and the incompetence we are angry and there's nothing wrong about being angry. I hope you're angry enough to go out and vote tomorrow, folks, OK? Thank you. Thank you, everybody. Thank you. Thank you, Don. Thank you, everybody. Oh, good. Oh, good. Great, Al. Why didn't you make the presentation? Oh, good. How are you? Hi, Stuart. Nice to see you, Stuart. Great. OK. On behalf of the Donald Trump Foundation here. We are very honored that instead of going doing the political thing he once again, since the 80s, the 70s, on the history I read of Mr. Trump, he's been taking care of veterans since then and he's still taking care of veterans. And they donated $100,000 to our homeless veterans shelter in Manchester. Thank you. Great. Congratulations. That's good. Good, I'll sign that right now. This will make a big difference to help our veterans. Congratulations. Thank you, everybody. I appreciate it very much. Thank you. Well, they want to get a picture for the folks. There are a lot of our members from the post for the American Legion here. Your sons coming through. We're going to get him all liquored up. I'll sign that right now."}