{"id":457,"author":"Donald Trump","title":"Speech: Donald Trump Delivers a Campaign Speech in Holderness, NH","date":"2016-02-07","link":"https://factba.se/transcript/donald-trump-speech-holderness-nh-february-7-2016","paragraphs":["I want to thank you. You know, there's like seven accidents outside. I have never seen anything like it. It cannot be like this tomorrow. But I think it's going to be fine. It stops tonight at two o'clock, we think. So nobody's going to have any excuses. This is an incredible time. We have a blizzard or at least a very bad storm.","And to have this many people I want to thank everybody. You know, thank you. So this is now crunch time. We've got a movement going that's been incredible. Everybody's talking about cover of Time Magazine last week, they have a picture of me from behind. I was extremely careful with my hair. To have a massive crowd out in front and they talk about a movement and that's what it is. It's a movement, folks.","It's a movement. And this is a movement where we say Make America Great Again. We're going to Make America Great Again. We're going to Make America greater than ever before. It's going to be something really, really special. What we're doing hasn't been done before. They're all talking about it. You come from all over and whether I go to Dallas, we had 21,000 people in Dallas and the Mavericks arena, packed.","No matter where we go, Mobile, Alabama 35,000 people. The other night, the other night in South Carolina, we had 12,000 people, three days notice, 12,000 people. It's been incredible. No matter where we go and you look at tonight in a blizzard, we have I guess a lot of people. I don't know how but there's a lot of people.","This is a lot of people. And I won't mention names but I said, how many people are at the other candidate? OK, the can -- oh no, look at this guy back there. Look at that guy. Believe it or not, this is uh -- do I look like that? Please tell me I don't. You know, we've got all these Trump impersonators.","Please don't let -- get up here let me see. believe me, I've never seen this guy before. I've never seen him. Come on up here. Oh no, tell me this isn't trump. Look at this guy. Melania, will you have married this guy? I don't know. Look at that. That's, that's great. Congratulations, man. I hope you're making a lot of money.","OK. Good luck. So we have something very, very special going on. We're going to have a country that's smart. We're going to have a country that's tough. That makes the proper decision. That makes the right deals. Our trade deals are so bad. I have the greatest deal makers in the world, the richest men, the richest women, people that are truly successful.","The best business people in the world. We have them in this country. We don't use them. We use political hacks. These are political hacks to negotiate with China, with Japan, with Russia, with Mexico. Mexico. Mexico is taking business away from us, folks, like, you wouldn't believe.","What are we going to do with Mexico? We're going to build a wall. We're going to build a wall and this is going to be a real wall. This is going to be a war that's going to stop the heroin and the drugs from coming to New Hampshire. Believe me. This is going to stop it. And my favorite part, I'll only do it once because I don't do it all the time, you know what's coming.","But I want to do it just one time because this is sort of our final love fest, all right? Now, tomorrow will be an even better one but this is the one because tomorrow you have to get out and you have to vote no matter what. I say it all the time. If you're sick if you're really like you can't move. You're close to death, your doctor tells you it's not working.","Your wife is disgusted with you. She said I'm leaving. No matter what. She says, darling I love you but I've fallen in love with another man. I don't give a damn. You got to get out to vote, right? Right? You got to get out to vote. Oh, my wife doesn't like it when I say that. She says, you shouldn't say that but that's OK. Speaking of my wife, Melanie, come up, come on up. She is so great, so understanding.","I took the escalator ride down. Do we remember the famous -- it's the most famous escalator in the world right now. I will say. And I said to Melania, you know what? It takes guts to run for President. Believe me. I've never done this before. I've never done it before but it does take guts and I said, you know, we're at the top of the escalator and look at back there, look at the press, turn around and look at these people.","Look at that. Six -- they start booing. They start, they start booing. Oh, by the way, look at that Mika and Joe, Mika and Joe, look at them. We've got them all. We've got them all. But look at the press. By any standard, they have I think, 600 requests. Look at that. That's like, darling, the Academy Awards.","The fact is there is something special. So I'm standing on top of the escalator. I looked downstairs. You can take that and double it and I said, we have no choice. We have to do it. And it does take courage. And I took a deep breath. Like this and I said let's go. And she has been so unbelievable. She has been so understanding.","I've been campaigning -- through true. Unbelievable. Unbelievable because I never thought I'd say this, you know, I'm a business guy. I create jobs et cetera, right? We do great deals. I've been working and campaigning since June 16th just about. We've been number one in the polls every single week. And I've been campaigning and I've been away and it's been very tough.","But I will tell you, I've loved doing it. I've met the most unbelievable people. I call Melania all the time, I say it's incredible. I say we had the most incredible crowd in Dallas. We had the most incredible crowd in Oklahoma. She said really? I couldn't tell. I said what do you mean you couldn't tell?","It was broadcast live all over the United States and beyond but the cameras never leave my face. I said, well, what's going on? And then I figured out why nobody wants to see that we have the biggest crowds. The biggest crowds for a Republican candidate tonight is 212 people and look what we have. Is that quite, look what we have and that's on top of the fact, you know, we have four of our incredible wonderful executives that have been working with Corey and the whole group.","And they're now lying on the side of the road. They're an accident. Everybody's got accidents. It's -- and I want to make sure they're OK. I think they're OK. I Hope -- are they OK? They are. If they're not, nothing I can do at this point, right? So I just want to thank everybody. Melania do you want to say hello?","Thank you.","Oh, she's going to be a great first lady. I want to just tell you one thing. One thing I will tell you. She's beautiful but she's more beautiful even on the inside. She's a great person and boy is she smart. She is smart. And speaking of smart has anybody ever heard of Ivanka? Huh? People love Ivanka. Come on Ivanka.","Get up here, Ivanka and there's Jared. Stand up, Jared. Say hello to the crowd. Come on, Jared. Jared is a very, very successful real estate man in New York. I'm proud of Jared. So Ivanka, famous Ivanka from The Apprentice. They were begging us. NBC wanted to renew for a long time and they wanted Ivanka, they wanted Don and Eric.","I said I can't do it. I really can't do it. Steve Burke came up, was a great guy from Comcast, the boss. Came up to my office he said, Donald, we want to renew. I said Steve, I think I'm running for President. This was about two months before the famous escalator trip. I said I think I'm running for President.","He said, Donald, I don't think you are. Come on let's renew. And then they went out at the upfronts and they announced that we're running and then that we're going to do The Apprentice, which caused me a lot of problems because I told these guys I'm running and nobody believed it after they announced. But one of the things that they really like, they just love, well, I tell you what they really like, they like the ratings, OK? That's what they really like.","But we renewed The Apprentice. I told them I'm not doing it. And I'll tell you what. I don't care what happens, no matter what. This has been the most amazing experience, the most amazing experience of my life. And you people have made it that way. You people have made it that way. And I told Ivanka and I told the kids that we're not going to do The Apprentice anymore.","We're going to do this. We're going to run. Ivanka is about two weeks or maybe less from having a baby and in Iowa I said, you know, I think she's going to have a baby maybe in Iowa. And I know that I would have won Iowa. I probably did win it anyway, if you add the Carson votes. No, no. If you add the Carson votes, I think, I probably want to but we don't care.","We only care about New Hampshire right now. But I just want to tell you, if she has the baby tonight in New Hampshire that guarantees victory tomorrow. Please, Ivanka have the baby tonight. Say something.","And Erica, Don, just stand up, kids. I tell you, they have been all over the place. We have Vanessa who is married to Don and Lara who is married to Eric. And I just want to thank -- they have been on television today. They've been on television literally more than me. So I just want to I want to thank them.","They've been incredible. Thank you very much. We also have some friends of ours and we have the Chief, the Chief, where's Nick? Where's our -- oh. Oh, they're getting rid of some protesters look. Are the police the greatest? Are the police the greatest? Oh, look at that protesters. I told you I like protesters because that's the only way the cameras show how big the crowd is. I like -- sometimes we even staged protesters.","Thank you, fellows. I appreciate -- enjoy your stay. Where's Nick Willard? Nick, Chief of Police. Get over here. Nick, get over here, Nick. This guy is so incredible right here. The police department has been so incredible. So, Nick I want to thank you. We went over the other day. We met people who are in seriously good condition.","Nobody going to mess with your Police Department, is that right? So Nick, thank you and thank the department. I appreciate it. So a couple of weeks ago, a certain politician, nice politician, Nikki Haley, said in a speech, a rebuttal speech that referring to me, although my name wasn't mentioned, and then ultimately, it was confirmed that I'm angry.","That I'm very angry and that the people that are with me are very angry, and the people that are with me are really with me. Those aren't the people that are 20% that they can flip. In fact, one of the things that's come out in all of the studies is that the people that are with Donald Trump, they're seriously with us. Like, they're not going anywhere.","They're not going anywhere. Whereas other guys, I think, including the two categories where 92%, nobody is changing. Whereas other guys are at 18%, in other words, they'll change if the wind changes. My people stick with us. And it was made and the statement was made that we're angry people. We're on the cover of Time.","We're on the cover of all these magazines and they said we're not angry people. We don't want to be angry but I said right now I will agree. Me personally, and a lot of the people that are with me, we are angry because we're angry at incompetence. We're angry at the Iran deal where we give away $150 billion and get nothing.","We're angry at our trade deals where China is making so much money that we've rebuilt their country, and in the meantime, our country and the infrastructure of our country is going to hell. We're angry when we make a Sergeant Bergdahl deal who's a dirty rotten traitor, where six people were killed looking for him and trying to bring him back, kill six young, great people killed.","Looking for Sergeant Bergdahl. And we make a swap knowing that he was a traitor. They had a Colonel and a General talking to these people and talking to the people that worked with him. They knew he was a traitor. They knew it and we make a deal. Sergeant Bergdahl, we get and they get five of the worst killers that they've coveted.","They've coveted for the last nine years, OK? We're tired of deals like this. We're tired of Obamacare which we will repeal and replace. Healthcare's going up 25%, 35%, 45%, 50%, in the last year and a half. It's going to die in '17 anyway. It has to unless the Republicans work out another deal like the budget deal.","The deal they worked out three weeks ago is a disgrace. So Obamacare, we're repealing, we're replacing but we're angry. And I said, yeah, I'm angry. Now, when they asked, it was under debate, the previous debate because I skipped the last one before the one the other night and I raised $6 million for the veterans, right?","And somebody said, do you regret skipping the debate? And I said, no, not at all, I don't. They said what do you mean you might have won Iowa? I said I did win Iowa but I said I don't regret it because we raised so much money for the vets and we wouldn't have really been able to do that at another time. That was just a point in time.","There was a point in time. But you have to be treated properly by the networks. Last night, I understand for the last debate, I heard, somebody read to me, that they had the highest rating for a debate, a Republican primary debate in 21 years, and they think it's much longer than that. They had a great rating.","What would they have had if I wasn't in the debate? What do you think? I don't know. Watching, watching Bush and watching this one and that one. I think they wouldn't have done so well. Who knows? I hope they do. I want everybody to do well. And we have some good people. We have some really good people but they had this phenomenal rating.","Abc just announced it. Next time, they're going to get the opening a little bit better. You know what I'm talking about. And by the way, in all fairness to Ben Carson, you could not hear a thing. Because people were wondering, why is Ben standing there? Well, we were all certain that you couldn't hear a thing.","So it was nobody's fault. There was actually a production mishap and it makes for more exciting, right? Isn't it more exciting, right? So we are people that are not going to be angry for long because if I get elected President, all of the things that you can't stand looking at, that you can't believe is happening to our country, all of these horrible deals that you see being made, many of them being made because everybody on the stage with me, and on the other side, they're taken care of by special interests.","They have their lobbyists, their special interests. They're getting tremendous amounts of money. You won't be angry, and well, you'll be happy. You're going to be very happy. You're going to be very, very happy. I'm telling you and it won't take a long time. It won't take a long time. You know recently, I just asked for tickets.","I wanted tickets for the debate. I said you got to give me tickets. Star power and I figured I had a lot of power. Got to get -- we get 20 tickets. Everybody gets like 20 tickets. So we call the RNC Corey, call the RNC. We want tickets. Well, we can't. Who's got them? All of the donors have it. The donors, the donors, you know, the donors mean?","I said that's no good. I don't have any donors because I'm self-funding. I don't have donors. So the donors don't mean donors. The donors that's a nice word donor but it's not donors. It's special interests, lobbyists, all these people that have total control over the candidates, they had all the tickets.","Now, I must tell you. Time Magazine did a poll and the poll who won the debate? And I won the debate 70% of the vote. Number two had 6% of the vote. So I had 70%, believe me. I have no power over Time Magazine but I had 70% of the vote. But number two had 6% of the vote and then it went down from there. So we do -- I say we can't get any tickets.","And then I announced during the debate because I'd hear these people make these really lame statements and you'd hear the place erupt in applause. I'm saying what the hell was going on over here? But I understood. I understood. And I announced on television the reason the audience is clapping for certain people up here is because they're donors and special interests and lobbyists and they have total control over the people.","And they don't like me because I'm like -- and I know many of them. Actually, they do like me. I'm even friends but if they asked me to do something and if I'm President, I'm saying bye-bye, I'm working for these people out here. So a thing came up the other day and a friend of mine calls me. He's a doctor, great doctor.","And he said, you know, Donald that the United States which is the largest purchaser of drugs in the world, massive, massive amounts for Medicare, which we're going to save, for Social Security, for everything, but mostly Medicare. So we're going to save Social Security too, by the way. We're going to seriously.","I mean, you've been paying in for years and now they want to start chopping away. They want to chop away at Social Security, by the way, like they want to chop away at the Second Amendment which is not going to happen, OK? Like honestly, like they're doing with religion like they're chopping away at Christianity.","And believe me, they are doing that. And this may or may not be a somewhat religious audience but I will tell you one thing, very soon we're going to start saying Merry Christmas again when it's Christmas in the store, very soon. So my friend calls me up, a great doctor. He says, you know Donald, you're running and you're doing great, and I'm so proud of you.","I love to hear and I say, say it again. And he said, but you know, with the medical and with the drugs, the United States, the largest purchaser. They don't negotiate price. It's almost as if you want to go and you want to buy drugs. There's drugs to make you feel better, right? Drugs to make you feel better.","You want to buy drugs. You have to get drugs. You go to the drugstore, you buy it off the counter. The United States is paying like a price like that. I said you have to be kidding. He said I don't know why. I said I do, I do. Because the drug companies have an unbelievable lobby and these guys that run for office, that are on my left and right and plenty of others, they're all taken care of by the drug companies, and they're never going to put out competitive bidding.","So I said to myself, wow, let me just sum numbers. If we competitively bid drugs in the United States, we could save as much as $300 billion a year. Think of that. Now think of it. Think of it. Think of it. That's one element and the reason, I mean, you take a look. He's a friend of mine. And we don't have that much television.","There are just about 600 people back there. So I won't insult him and he happens to be a very good guy, Woody Johnson, right? Woody Johnson of Johnson & Johnson. He's Jeb Bush's campaign finance manager. He's running Bush's campaign. Now, you tell me you, tell me seriously. Well, well, listen to this about Bush.","Number one, he's in favor of Common Core. Number two, he's weak on -- no, Bush he likes Common Core. He's the only one that I know that likes it but that's OK. We're going to bring education back locally, no more Common Core. No more Common Core. He's also weak on immigration and that's not good.","Remember, they come as an act of love. Remember that whole deal. Education's very interesting because we're number 30 in the world. You have Norway, Sweden, Denmark, China, and plenty of others. Then you have third-world countries and number 30 is the United States. So we're 30 in the world in education and we're number one per pupil and cost by far.","Number two isn't even close. So that's the way it is. Not going to happen that way anymore, folks. Not going to happen that way. Now with savings, so the drug companies, they have tremendous power. If they're talking about $300 billion, I mean, that's a lot of money, $300 billion and then you wonder why.","Because a lot of people say, how could people be so stupid as to not bid things. They know it's wrong but they're politicians, all talk, no action. They're good at one thing getting re-elected. You have some good politicians but you have mostly people that think about how do I get re-elected, OK? How do I get re-elected?","So I'm the only one, I'm self-funding. So when these guys see me who -- I know many of the guys. I'm looking to the room. I'm standing at the debate. I'm watching Marco sweating like a dog on my right. I'm watching Ted Cruz say, no, I would never say that about Donald but he said something bad and they asked him would you say it again?","He said, no, and I liked that he didn't do that because we would have ended up in a big fight. But it was nice that he didn't, honestly. So I have him here. I have Marco. Honestly, Marco is having a hard time and he's a nice guy. He's a nice guy. I mean, again and again, and again, after three times, you know, I have a very good memory.","And after three times, I said, wait a minute, he said that about three minutes ago. Then I said wait, wait, wait you said that two minutes ago, the same exact thing. So after the fifth time, I said what was going on over here? But we need really smart, really tough, really fair people with great heart that want to take care of your healthcare, want to take care of people that can't afford healthcare.","You know, it's very interesting. We're going to bring down the price of healthcare. We're going to bring it down, big league. Big, big league because President Obama lied 28 times. He said you keep your doctor, he said you keep your plan, 28 times. I kept saying why doesn't somebody get sued for fraud when you do that 28 times.","And even Democrats went because of what he said and they wish they weren't in that position. So he lied. But you know what a lot of people give me heat because they say we got to take it as a group, there's a small group, relatively of people on the bottom that are not going to be able to be taken care of. And I say, we have to as Republicans, we have to take care -- does anybody not want to take care of them?","I said we're not going to have people dying on the streets. We're going to get him into a hospital take care of them. We're going to get -- because we're not going to have people dying in streets. And I say that, and I said, and all the time I get applause, and then they say, oh, he wants to do this. He wants to do that.","That's not the public. Let me tell you, the Republican way is people can't take care of themselves, we have to help them. We're not going to let them die. And I say it all the time. We're not going to let them die on the sidewalk. We're not going to let them die on the street and it's not even a lot of money.","We have hospitals doing no business. We got to get them fixed up. But we're going to save tremendously on healthcare. It's going to be private. We're going to take the lions out of play. We're going to have so many different options. It's going to be so much better. Going to be less expensive. You look at your deductibles not only are your rates going up, but you look at deductibles, right now unless you get hit by a tractor, you'll never ever be able to use your healthcare.","And look at Washington, they don't even want the Obamacare. They don't have to have that. I wonder why? They don't have to have it. So we're going to take care of it, folks. And we're going to have so many great things. And by the way, we're going to competitive bidding. And I'll tell you what we're going to save so much money and those drug companies are going to hate me so much.","Oh, I could -- I know them. I was going to say so I'm at the debate and I'm looking at the audience and it was supposed to be children's, you know, college kids and young kids and it wasn't. Because these rich guys bought all the tickets from the college students. I don't actually totally believe that. I actually think that the RNC gave them the tickets to be totally honest.","I think they actually got the tickets, not through buy. But a lot of them did buy tickets. So I look outside, I say, wow, that's a lot of people out there. I know half these people. I know the lobbyists. I know most of the special interests and I'm looking at that audience and I'm saying this is bad stuff.","But I had the most beautiful applause from Don and Eric and Melania in the front row. That's about it even though I won. But I -- but I understood. So you have to understand what's going on. A lot of times you think that the politicians are doing horrible, horrible deals and they are horrible. But you think that they're really, really not smart people.","They are actually smart people but they're working for themselves. They're doing what their lobbyist who puts up millions and millions and millions of dollars every time they run. I'm just talking about the honest stuff. This is all honest stuff. This other stuff that goes on that, you know, you have to prove, right?","I mean, you look at some of Hillary's speeches where she gets a fortune and she's, you know, give me a break. Take a look at that. Nobody, right? No, no, nobody looks at that. Bill makes a speech, gets a tremendous amount of money, far more there, and then all of a sudden, miracles happen, right?","Miracles happen. And I imagine somebody is looking at that. And by the way, a recent poll just came out that I am beating Hillary so badly in the general election. So you'll do. So just like we do because people say how are you going to straighten out the budget? It's a mess. Just like we do with what I just told you about, medication, and buying medicines, and all of this.","Same thing happens with the military. We're going to build our military so strong but we're buying equipment and we're buying things that our Generals don't even want. We're buying things that they don't want. We're buying planes they don't want instead of another one because that company has better lobbyists and they're stronger.","We're going to get them the equipment they want. We're going to save a lot of money. And we're going to build ourselves so strong, nobody, I'm telling you. Nobody is going to play with us. We don't want to use it. Nobody is going to play with us. We have -- we have situations right now where we have the migration and we're accepting people in and we're accepting them in by the thousands.","And you look at New Hampshire, you look at this area with the problems you have, the problems you have with the drugs, we're allowing people to come into this country that we have absolutely no idea who they are, where they come from, are they ISIS? Maybe, maybe not. Somebody said at least 90% of them aren't. Oh, really?","If we had 10%, look at what those two people did two months ago. Radicalized people. They killed 14 people. Two people, young people, they killed 14 and plenty of people right now lying in the hospital, gravely wounded. Look at Paris 130 people killed. Now, the strongest gun laws anywhere in the world is France and Paris.","People don't have guns except for the bad guys. So they walk in, they start shooting. They say you get over here, boom. You get over here. They kill 130 people. There's a tremendous number of people right now in the hospitals. If guns were on the other side of that equation where the bullets could fly in a different direction.","You wouldn't have had that kind of carnage. You wouldn't have had it. You wouldn't have had it. So we are going to protect our Second Amendment 100%. Nobody's going to play with us. Nobody. So this all started when I came down and I made the statement to the press and I talked about illegal immigration. Oh, did I get it. Did I get -- well, that was like tough for two, three weeks, it was brutal.","Then, all of a sudden, people started saying, you know, maybe he's got a point, maybe he's got a point. Then four or five weeks later people are starting to say, you know, they're coming out really strong. They're saying I think Trump's right. There is a lot of illegal immigration that is causing this, a lot of economic harm, but it's causing us a lot of trouble from a criminal standpoint.","Right now as we speak it was released last week. We have 179,000 illegal criminal immigrants, illegal criminal. These are people that have been convicted of crimes, some very big crimes. That means we have 179,000 people here that have committed crimes that shouldn't -- big crimes that shouldn't be in the country.","That's bigger, 179,000 people is bigger than any city by a lot in New Hampshire. That's a massive amount of people. That's a massive amount. So we're going to do something that's going to be whether you like -- Dwight Eisenhower. No matter what you do. Dwight Eisenhower, I like Ike. Everybody said nice guy.","We either have a country, folks or we don't remember this. We either have a country or we don't. So we're going to have to take people. We're going to get rid of those 179,000 and I don't want to put them in our jails. I don't want to put him in our jails. Our jails are costing us a fortune. We're bringing them back where they came from and we're going to be respected by those countries which were not respected at all by those countries.","We're bringing them back where they came from and let that country put them in prison for the next 25 years because we're not doing it. And they're never ever coming back to our country again. They're gone. Never. Now -- but all of a sudden, we started seeing people are focused on it. I will say this, if I didn't bring up the subject of illegal immigration at my opening when I announced I was running for President, you would not have anybody even talking about it. The other night in this stage I won't mention who somebody said, yes, and I'm very strong on illegal immigration.","We will build a wall. He said it very loudly. We believe he's afraid that somebody says it with and I go, what's this all of a sudden? Now all of a sudden, I know I have two out of the group. They said, the other night, another one's on television, he said, yes, we have to have strong borders. We will build a wall.","And my wife came up to me, Melania. she said, darling, did you hear that? That's the first time I've ever heard that said by anybody else but you. We have to build a wall. Walls work. Just ask Israel. Walls work. They work. I don't mean the little walls. I don't mean the little walls. I mean those walls.","You know, I mean, serious walls. I mean, Trump walls. We're going to -- no, they work. They work and they work if they're right. You know in Time Magazine and a couple of magazines, I read I've been on the cover of Time Magazine so much lately. When I was on last week I didn't even know they were putting me on the cover.","Can you imagine? That's when you're really hitting it big when you're on the cover of Time Magazine, you don't even know you're going to be on the cover. That's good. But they had like this ramp. They had a wall like this and then a ramp built over the wall and then another ramp and they have trucks going over the ramp.","And they're loaded up with drugs. They have trucks going right over there. I didn't even know why they didn't just rip down the wall. It's a little -- it would have been cheaper, right? But they have a ramp it goes up. It goes down. They sell their drugs in the United States. A lot of them come over to here to head to New Hampshire and they get back on. They go back.","They build ramps over the walls. And I'll tell you something. I met the Border Patrol people. They're phenomenal. The reason I met them is they called me and they said we'd love to meet you. And I went to Laredo, Texas and it was incredible. These people are incredible. They can do the job. They are told to stand back.","They're told don't touch anybody. They're told let people come in. They don't want that. These are incredible men and women and they're standing there. People are walking right in front of beautiful equipment, everything looks good. Everything except for one thing they're told, don't do anything. And when they do something, they say give them a fine, let them go. They can go wherever they want that's the end.","Then you'll never see them again. We either have a country or we don't. We're going to be so strong and just let me ask you one question about the wall. Who the hell is going to pay for the wall? What? So you know the head of Mexico today said there's no way we're paying for the wall.","Please inform Mr. Trump. I said, I said the wall's just going to just get bigger when he has that attitude. No, no, so we're going to build the wall. They're going to pay for the wall. The politicians come up to me. They always come up to me when I say something. They used to come up and say, Donald, there's no way honestly, that you're going to be able to build a wall is there?","I said, of course, it's like easy. I build massive buildings. It's much tougher. They said you can't really do that. Can you -- I said absolutely. Now just so you understand, 15 years ago they want to build a wall. You know why they didn't build it? They couldn't get an environmental impact statement approved.","It's true. They couldn't because there were snakes, toads, rodents, all sorts of crap right in the way. They couldn't. Can you believe it? We can't build a wall and you have China in the South China Sea ripping the hell out of the ocean and building military bases in the middle of the South China Sea. And we can't -- do you think, by the way, that China got an environmental impact statement?","I don't think. Do you know what they said? They said we're going to build it. They started work the following morning. That's what happens. We are so left behind and we worry about the carbon footprint. And I say, you know, I see Obama saying the single greatest problem this country has is global warming, OK? I tell you what.","I just got out so we had a blizzard outside. There's no warming. This is brutal. Somebody from New Hampshire said this is one of the worst winters you know. But he's talking about global warming. Then he gets on a very old 747 with the old engines that spew a lot of stuff. And he takes his wife and his two really beautiful daughters and he goes in the 747 to Hawaii to play golf.","And then he comes back and then he has a speech on the carbon footprint. So, folks, we're going to have a whole different thinking. I've been saying for a long period of time, take the oil. Remember? Remember this about me. I was against because I've had Hillary say, I don't like Donald Trump's tone. And I've heard Jeb say it too.","I don't like Donald Trump's tone. You know, he's a low-energy guy. So he doesn't like my tone. But, but honestly, he said -- and she said -- and they said it the same day. And I thought to myself I can tone it down. I'm a smart guy. I'll tone it down. Then I said wait a minute. I turn on television. They're chopping people's heads off in the Middle East.","If you're a Christian, the head comes off. If you're not Christian, the head comes off. We haven't seen stuff like this since medieval times. All right, medieval times and people are worried about my tone. You heard the other night at debate. They asked Ted Cruz a serious question. Well, what do you think of waterboarding?","Is it OK? And honestly, I thought he'd say absolutely and he didn't. He said, well, it's you know, he's concerned about the answer because some people. She just said a terrible thing. You know what she said? Shout it out because I don't want to -- OK. You're not allowed to say and I never expect to hear that from you again.","She said, I never expect to hear that from you again. She said he's a pussy. That's terrible. Terrible. That's terrible. Now what kind of people do I have here? OK, why do I -- so do you remember when not so long ago, not so far from here. I had a group of people. We're doing question and answer and somebody came up with a pretty tough statement about Obama and the press got very angry because I didn't defend the President.","Remember I took a lot of heat and I didn't reprimand the person that said it. So I want to just tell you right now. Ma'am, you're reprimanded, OK? Can she stay? Can she stay? You're reprimanded. So for the press, this is a serious reprimand. Just so the press knows. So we have lined up to make some of the great trade deals and to take our documents that are so bad.","We have lined up the finest business people in the world. They're all lined up. By the way, they call me, I don't even call them. These are great, great people. Some are nice. Some are horrible human beings. Some are people that you don't want to have dinner with but they're great at what they do. I know the greatest negotiators in the world.","We need them. That's how we got into the hall with these deals and I'm telling you about. And believe me other, other facets of our economy is the same thing. It's the same exact thing. We're going to save so much money. I was hearing the other day, they were talking about the budget, and a political person said, it's his idea and it's his goal to have the budget balanced within 25 years.","I said 25 years? And he was -- and he thought he was doing a good job. These are politicians, folks. They're never going to do it. And we're going to do it great. We're going to have a better country. We're going to have better services. We're going to have better roads and airports and hospitals. And we're going to pay less for them.","We're going to pay less. You know, I'm building a big building right now on Pennsylvania Avenue that I got from the federal government, Obama. Can you believe it? How good is that? Ivanka worked on, I mean, Ivanka, what a job she did. I -- we had the old post office in Washington D.C., right? We are now -- we just announced.","We're going to make it a world-class, one of the great hotels of the world. It's an incredible building. And we just announced we're two years ahead of schedule. We're going to have it open in September of this year, two years ahead of schedule. And we're under budget, ahead of schedule. Wouldn't it be nice if our country on its projects instead of having a 2,000% cost overrun?","Boy, can you imagine how much those people make when you see these buildings and things was going to cost $200 million and it ends up costing $1.5 billion. Do you know how much money these people are making? So we're two years ahead of schedule. It's on Pennsylvania Avenue and I don't give a damn if I don't make the White House.","We're moving into that building. I'm going to be on Pennsylvania Avenue one way or the other. So I want to finish up because you've got a bad evening out there and you have to drive. You have to do me a favor. I don't really care if you get hurt or not but I want you to last until tomorrow, OK? So don't get hurt.","If you're going to get hurt and if you're going to drive like a maniac do it tomorrow after you vote. And I promise, I will come and visit you in the hospital, I promise. No, guys, I'm only kidding. I want you to be -- I want you to be careful. But look it's so important that we take care of our vets. Our vets are being treated so badly.","And I have Al Baldesarra who is with me all the time, who's the greatest guy there is, who loves the vets, who loves us, and who knows what we're doing. But we're going to take care of our vets. We're going to take care of our military. We're going to build up our military. It's going to be a thing of beauty.","By the way, I have to tell you. It's the absolute cheapest thing we can do because nobody is going to play with us. It's the cheapest thing we can do. But we're going to take care of our healthcare. We're going to take care of every facet of our country and we're going to start winning again. Folks, we're going to start winning again because we don't win anymore.","We don't win on trade. We don't win on anything. We can't beat ISIS with our military. Can you imagine General George Patton? We can't beat ISIS. He would beat them by the time he walked down to the front row. We don't beat ISIS. We're going to start winning again. We're going to win on every single level of this country.","We're going to win every single time we do something. We're going to win. We're not going to make stupid deals anymore. We're going to be led by smart people and we're going to have our smartest people representing us. Now, I leave you with this. I leave you with us. It's so important. It's so important.","Tomorrow is going to be the beginning. I hear we have a lead. It doesn't matter to me. It doesn't matter to me. Who the hell knows what the lead is? You have some snow it looks like it's going to stop. It's so important. We have something so special going on. You have to go out. You have to vote. We have to celebrate tomorrow evening.","We have to have a great victory. It's so important because we are going to Make America Great Again. We are going to Make America greater, greater, greater than it's ever been before. And I love you all. I love you all. You're special. We will see you tomorrow. Let's have a big, big victory tomorrow. We love you.","Thank you. Thank you."],"text":" I want to thank you. You know, there's like seven accidents outside. I have never seen anything like it. It cannot be like this tomorrow. But I think it's going to be fine. It stops tonight at two o'clock, we think. So nobody's going to have any excuses. This is an incredible time. We have a blizzard or at least a very bad storm. And to have this many people I want to thank everybody. You know, thank you. So this is now crunch time. We've got a movement going that's been incredible. Everybody's talking about cover of Time Magazine last week, they have a picture of me from behind. I was extremely careful with my hair. To have a massive crowd out in front and they talk about a movement and that's what it is. It's a movement, folks. It's a movement. And this is a movement where we say Make America Great Again. We're going to Make America Great Again. We're going to Make America greater than ever before. It's going to be something really, really special. What we're doing hasn't been done before. They're all talking about it. You come from all over and whether I go to Dallas, we had 21,000 people in Dallas and the Mavericks arena, packed. No matter where we go, Mobile, Alabama 35,000 people. The other night, the other night in South Carolina, we had 12,000 people, three days notice, 12,000 people. It's been incredible. No matter where we go and you look at tonight in a blizzard, we have I guess a lot of people. I don't know how but there's a lot of people. This is a lot of people. And I won't mention names but I said, how many people are at the other candidate? OK, the can -- oh no, look at this guy back there. Look at that guy. Believe it or not, this is uh -- do I look like that? Please tell me I don't. You know, we've got all these Trump impersonators. Please don't let -- get up here let me see. believe me, I've never seen this guy before. I've never seen him. Come on up here. Oh no, tell me this isn't trump. Look at this guy. Melania, will you have married this guy? I don't know. Look at that. That's, that's great. Congratulations, man. I hope you're making a lot of money. OK. Good luck. So we have something very, very special going on. We're going to have a country that's smart. We're going to have a country that's tough. That makes the proper decision. That makes the right deals. Our trade deals are so bad. I have the greatest deal makers in the world, the richest men, the richest women, people that are truly successful. The best business people in the world. We have them in this country. We don't use them. We use political hacks. These are political hacks to negotiate with China, with Japan, with Russia, with Mexico. Mexico. Mexico is taking business away from us, folks, like, you wouldn't believe. What are we going to do with Mexico? We're going to build a wall. We're going to build a wall and this is going to be a real wall. This is going to be a war that's going to stop the heroin and the drugs from coming to New Hampshire. Believe me. This is going to stop it. And my favorite part, I'll only do it once because I don't do it all the time, you know what's coming. But I want to do it just one time because this is sort of our final love fest, all right? Now, tomorrow will be an even better one but this is the one because tomorrow you have to get out and you have to vote no matter what. I say it all the time. If you're sick if you're really like you can't move. You're close to death, your doctor tells you it's not working. Your wife is disgusted with you. She said I'm leaving. No matter what. She says, darling I love you but I've fallen in love with another man. I don't give a damn. You got to get out to vote, right? Right? You got to get out to vote. Oh, my wife doesn't like it when I say that. She says, you shouldn't say that but that's OK. Speaking of my wife, Melanie, come up, come on up. She is so great, so understanding. I took the escalator ride down. Do we remember the famous -- it's the most famous escalator in the world right now. I will say. And I said to Melania, you know what? It takes guts to run for President. Believe me. I've never done this before. I've never done it before but it does take guts and I said, you know, we're at the top of the escalator and look at back there, look at the press, turn around and look at these people. Look at that. Six -- they start booing. They start, they start booing. Oh, by the way, look at that Mika and Joe, Mika and Joe, look at them. We've got them all. We've got them all. But look at the press. By any standard, they have I think, 600 requests. Look at that. That's like, darling, the Academy Awards. The fact is there is something special. So I'm standing on top of the escalator. I looked downstairs. You can take that and double it and I said, we have no choice. We have to do it. And it does take courage. And I took a deep breath. Like this and I said let's go. And she has been so unbelievable. She has been so understanding. I've been campaigning -- through true. Unbelievable. Unbelievable because I never thought I'd say this, you know, I'm a business guy. I create jobs et cetera, right? We do great deals. I've been working and campaigning since June 16th just about. We've been number one in the polls every single week. And I've been campaigning and I've been away and it's been very tough. But I will tell you, I've loved doing it. I've met the most unbelievable people. I call Melania all the time, I say it's incredible. I say we had the most incredible crowd in Dallas. We had the most incredible crowd in Oklahoma. She said really? I couldn't tell. I said what do you mean you couldn't tell? It was broadcast live all over the United States and beyond but the cameras never leave my face. I said, well, what's going on? And then I figured out why nobody wants to see that we have the biggest crowds. The biggest crowds for a Republican candidate tonight is 212 people and look what we have. Is that quite, look what we have and that's on top of the fact, you know, we have four of our incredible wonderful executives that have been working with Corey and the whole group. And they're now lying on the side of the road. They're an accident. Everybody's got accidents. It's -- and I want to make sure they're OK. I think they're OK. I Hope -- are they OK? They are. If they're not, nothing I can do at this point, right? So I just want to thank everybody. Melania do you want to say hello? Thank you. We love you, New Hampshire. We, together. We will Make America Great Again. Oh, she's going to be a great first lady. I want to just tell you one thing. One thing I will tell you. She's beautiful but she's more beautiful even on the inside. She's a great person and boy is she smart. She is smart. And speaking of smart has anybody ever heard of Ivanka? Huh? People love Ivanka. Come on Ivanka. Get up here, Ivanka and there's Jared. Stand up, Jared. Say hello to the crowd. Come on, Jared. Jared is a very, very successful real estate man in New York. I'm proud of Jared. So Ivanka, famous Ivanka from The Apprentice. They were begging us. NBC wanted to renew for a long time and they wanted Ivanka, they wanted Don and Eric. I said I can't do it. I really can't do it. Steve Burke came up, was a great guy from Comcast, the boss. Came up to my office he said, Donald, we want to renew. I said Steve, I think I'm running for President. This was about two months before the famous escalator trip. I said I think I'm running for President. He said, Donald, I don't think you are. Come on let's renew. And then they went out at the upfronts and they announced that we're running and then that we're going to do The Apprentice, which caused me a lot of problems because I told these guys I'm running and nobody believed it after they announced. But one of the things that they really like, they just love, well, I tell you what they really like, they like the ratings, OK? That's what they really like. But we renewed The Apprentice. I told them I'm not doing it. And I'll tell you what. I don't care what happens, no matter what. This has been the most amazing experience, the most amazing experience of my life. And you people have made it that way. You people have made it that way. And I told Ivanka and I told the kids that we're not going to do The Apprentice anymore. We're going to do this. We're going to run. Ivanka is about two weeks or maybe less from having a baby and in Iowa I said, you know, I think she's going to have a baby maybe in Iowa. And I know that I would have won Iowa. I probably did win it anyway, if you add the Carson votes. No, no. If you add the Carson votes, I think, I probably want to but we don't care. We only care about New Hampshire right now. But I just want to tell you, if she has the baby tonight in New Hampshire that guarantees victory tomorrow. Please, Ivanka have the baby tonight. Say something. I should be so lucky. New Hampshire thank you so much. It has been amazing spending the last couple of hours here, and obviously, over the previous weeks. I've been here quite a bit. But my father has called me so many times and said, just the energy, the enthusiasm, the spirit of the crowds here are amazing. And it really encourage us and keeps the momentum going. So thank you so much for being here. I have watched -- I have been watching my father work his whole entire life. He's worked incredibly hard to build an unbelievable business to provide jobs for tens of thousands of people that we employ at the Trump Organization and to inspire each and every one of those people. So to now see him working this hard for all of you and that's what he wants to do. He wants to Make America Great Again. And I have no doubt that he will just do exactly that. So I've never known him to do anything other than rise to the occasion and I'm sure that will happen here. So come out and vote tomorrow and enable that outcome. Thank you all so much for being here. Thank you. And Erica, Don, just stand up, kids. I tell you, they have been all over the place. We have Vanessa who is married to Don and Lara who is married to Eric. And I just want to thank -- they have been on television today. They've been on television literally more than me. So I just want to I want to thank them. They've been incredible. Thank you very much. We also have some friends of ours and we have the Chief, the Chief, where's Nick? Where's our -- oh. Oh, they're getting rid of some protesters look. Are the police the greatest? Are the police the greatest? Oh, look at that protesters. I told you I like protesters because that's the only way the cameras show how big the crowd is. I like -- sometimes we even staged protesters. Thank you, fellows. I appreciate -- enjoy your stay. Where's Nick Willard? Nick, Chief of Police. Get over here. Nick, get over here, Nick. This guy is so incredible right here. The police department has been so incredible. So, Nick I want to thank you. We went over the other day. We met people who are in seriously good condition. Nobody going to mess with your Police Department, is that right? So Nick, thank you and thank the department. I appreciate it. So a couple of weeks ago, a certain politician, nice politician, Nikki Haley, said in a speech, a rebuttal speech that referring to me, although my name wasn't mentioned, and then ultimately, it was confirmed that I'm angry. That I'm very angry and that the people that are with me are very angry, and the people that are with me are really with me. Those aren't the people that are 20% that they can flip. In fact, one of the things that's come out in all of the studies is that the people that are with Donald Trump, they're seriously with us. Like, they're not going anywhere. They're not going anywhere. Whereas other guys, I think, including the two categories where 92%, nobody is changing. Whereas other guys are at 18%, in other words, they'll change if the wind changes. My people stick with us. And it was made and the statement was made that we're angry people. We're on the cover of Time. We're on the cover of all these magazines and they said we're not angry people. We don't want to be angry but I said right now I will agree. Me personally, and a lot of the people that are with me, we are angry because we're angry at incompetence. We're angry at the Iran deal where we give away $150 billion and get nothing. We're angry at our trade deals where China is making so much money that we've rebuilt their country, and in the meantime, our country and the infrastructure of our country is going to hell. We're angry when we make a Sergeant Bergdahl deal who's a dirty rotten traitor, where six people were killed looking for him and trying to bring him back, kill six young, great people killed. Looking for Sergeant Bergdahl. And we make a swap knowing that he was a traitor. They had a Colonel and a General talking to these people and talking to the people that worked with him. They knew he was a traitor. They knew it and we make a deal. Sergeant Bergdahl, we get and they get five of the worst killers that they've coveted. They've coveted for the last nine years, OK? We're tired of deals like this. We're tired of Obamacare which we will repeal and replace. Healthcare's going up 25%, 35%, 45%, 50%, in the last year and a half. It's going to die in '17 anyway. It has to unless the Republicans work out another deal like the budget deal. The deal they worked out three weeks ago is a disgrace. So Obamacare, we're repealing, we're replacing but we're angry. And I said, yeah, I'm angry. Now, when they asked, it was under debate, the previous debate because I skipped the last one before the one the other night and I raised $6 million for the veterans, right? And somebody said, do you regret skipping the debate? And I said, no, not at all, I don't. They said what do you mean you might have won Iowa? I said I did win Iowa but I said I don't regret it because we raised so much money for the vets and we wouldn't have really been able to do that at another time. That was just a point in time. There was a point in time. But you have to be treated properly by the networks. Last night, I understand for the last debate, I heard, somebody read to me, that they had the highest rating for a debate, a Republican primary debate in 21 years, and they think it's much longer than that. They had a great rating. What would they have had if I wasn't in the debate? What do you think? I don't know. Watching, watching Bush and watching this one and that one. I think they wouldn't have done so well. Who knows? I hope they do. I want everybody to do well. And we have some good people. We have some really good people but they had this phenomenal rating. Abc just announced it. Next time, they're going to get the opening a little bit better. You know what I'm talking about. And by the way, in all fairness to Ben Carson, you could not hear a thing. Because people were wondering, why is Ben standing there? Well, we were all certain that you couldn't hear a thing. So it was nobody's fault. There was actually a production mishap and it makes for more exciting, right? Isn't it more exciting, right? So we are people that are not going to be angry for long because if I get elected President, all of the things that you can't stand looking at, that you can't believe is happening to our country, all of these horrible deals that you see being made, many of them being made because everybody on the stage with me, and on the other side, they're taken care of by special interests. They have their lobbyists, their special interests. They're getting tremendous amounts of money. You won't be angry, and well, you'll be happy. You're going to be very happy. You're going to be very, very happy. I'm telling you and it won't take a long time. It won't take a long time. You know recently, I just asked for tickets. I wanted tickets for the debate. I said you got to give me tickets. Star power and I figured I had a lot of power. Got to get -- we get 20 tickets. Everybody gets like 20 tickets. So we call the RNC Corey, call the RNC. We want tickets. Well, we can't. Who's got them? All of the donors have it. The donors, the donors, you know, the donors mean? I said that's no good. I don't have any donors because I'm self-funding. I don't have donors. So the donors don't mean donors. The donors that's a nice word donor but it's not donors. It's special interests, lobbyists, all these people that have total control over the candidates, they had all the tickets. Now, I must tell you. Time Magazine did a poll and the poll who won the debate? And I won the debate 70% of the vote. Number two had 6% of the vote. So I had 70%, believe me. I have no power over Time Magazine but I had 70% of the vote. But number two had 6% of the vote and then it went down from there. So we do -- I say we can't get any tickets. And then I announced during the debate because I'd hear these people make these really lame statements and you'd hear the place erupt in applause. I'm saying what the hell was going on over here? But I understood. I understood. And I announced on television the reason the audience is clapping for certain people up here is because they're donors and special interests and lobbyists and they have total control over the people. And they don't like me because I'm like -- and I know many of them. Actually, they do like me. I'm even friends but if they asked me to do something and if I'm President, I'm saying bye-bye, I'm working for these people out here. So a thing came up the other day and a friend of mine calls me. He's a doctor, great doctor. And he said, you know, Donald that the United States which is the largest purchaser of drugs in the world, massive, massive amounts for Medicare, which we're going to save, for Social Security, for everything, but mostly Medicare. So we're going to save Social Security too, by the way. We're going to seriously. I mean, you've been paying in for years and now they want to start chopping away. They want to chop away at Social Security, by the way, like they want to chop away at the Second Amendment which is not going to happen, OK? Like honestly, like they're doing with religion like they're chopping away at Christianity. And believe me, they are doing that. And this may or may not be a somewhat religious audience but I will tell you one thing, very soon we're going to start saying Merry Christmas again when it's Christmas in the store, very soon. So my friend calls me up, a great doctor. He says, you know Donald, you're running and you're doing great, and I'm so proud of you. I love to hear and I say, say it again. And he said, but you know, with the medical and with the drugs, the United States, the largest purchaser. They don't negotiate price. It's almost as if you want to go and you want to buy drugs. There's drugs to make you feel better, right? Drugs to make you feel better. You want to buy drugs. You have to get drugs. You go to the drugstore, you buy it off the counter. The United States is paying like a price like that. I said you have to be kidding. He said I don't know why. I said I do, I do. Because the drug companies have an unbelievable lobby and these guys that run for office, that are on my left and right and plenty of others, they're all taken care of by the drug companies, and they're never going to put out competitive bidding. So I said to myself, wow, let me just sum numbers. If we competitively bid drugs in the United States, we could save as much as $300 billion a year. Think of that. Now think of it. Think of it. Think of it. That's one element and the reason, I mean, you take a look. He's a friend of mine. And we don't have that much television. There are just about 600 people back there. So I won't insult him and he happens to be a very good guy, Woody Johnson, right? Woody Johnson of Johnson & Johnson. He's Jeb Bush's campaign finance manager. He's running Bush's campaign. Now, you tell me you, tell me seriously. Well, well, listen to this about Bush. Number one, he's in favor of Common Core. Number two, he's weak on -- no, Bush he likes Common Core. He's the only one that I know that likes it but that's OK. We're going to bring education back locally, no more Common Core. No more Common Core. He's also weak on immigration and that's not good. Remember, they come as an act of love. Remember that whole deal. Education's very interesting because we're number 30 in the world. You have Norway, Sweden, Denmark, China, and plenty of others. Then you have third-world countries and number 30 is the United States. So we're 30 in the world in education and we're number one per pupil and cost by far. Number two isn't even close. So that's the way it is. Not going to happen that way anymore, folks. Not going to happen that way. Now with savings, so the drug companies, they have tremendous power. If they're talking about $300 billion, I mean, that's a lot of money, $300 billion and then you wonder why. Because a lot of people say, how could people be so stupid as to not bid things. They know it's wrong but they're politicians, all talk, no action. They're good at one thing getting re-elected. You have some good politicians but you have mostly people that think about how do I get re-elected, OK? How do I get re-elected? So I'm the only one, I'm self-funding. So when these guys see me who -- I know many of the guys. I'm looking to the room. I'm standing at the debate. I'm watching Marco sweating like a dog on my right. I'm watching Ted Cruz say, no, I would never say that about Donald but he said something bad and they asked him would you say it again? He said, no, and I liked that he didn't do that because we would have ended up in a big fight. But it was nice that he didn't, honestly. So I have him here. I have Marco. Honestly, Marco is having a hard time and he's a nice guy. He's a nice guy. I mean, again and again, and again, after three times, you know, I have a very good memory. And after three times, I said, wait a minute, he said that about three minutes ago. Then I said wait, wait, wait you said that two minutes ago, the same exact thing. So after the fifth time, I said what was going on over here? But we need really smart, really tough, really fair people with great heart that want to take care of your healthcare, want to take care of people that can't afford healthcare. You know, it's very interesting. We're going to bring down the price of healthcare. We're going to bring it down, big league. Big, big league because President Obama lied 28 times. He said you keep your doctor, he said you keep your plan, 28 times. I kept saying why doesn't somebody get sued for fraud when you do that 28 times. And even Democrats went because of what he said and they wish they weren't in that position. So he lied. But you know what a lot of people give me heat because they say we got to take it as a group, there's a small group, relatively of people on the bottom that are not going to be able to be taken care of. And I say, we have to as Republicans, we have to take care -- does anybody not want to take care of them? I said we're not going to have people dying on the streets. We're going to get him into a hospital take care of them. We're going to get -- because we're not going to have people dying in streets. And I say that, and I said, and all the time I get applause, and then they say, oh, he wants to do this. He wants to do that. That's not the public. Let me tell you, the Republican way is people can't take care of themselves, we have to help them. We're not going to let them die. And I say it all the time. We're not going to let them die on the sidewalk. We're not going to let them die on the street and it's not even a lot of money. We have hospitals doing no business. We got to get them fixed up. But we're going to save tremendously on healthcare. It's going to be private. We're going to take the lions out of play. We're going to have so many different options. It's going to be so much better. Going to be less expensive. You look at your deductibles not only are your rates going up, but you look at deductibles, right now unless you get hit by a tractor, you'll never ever be able to use your healthcare. And look at Washington, they don't even want the Obamacare. They don't have to have that. I wonder why? They don't have to have it. So we're going to take care of it, folks. And we're going to have so many great things. And by the way, we're going to competitive bidding. And I'll tell you what we're going to save so much money and those drug companies are going to hate me so much. Oh, I could -- I know them. I was going to say so I'm at the debate and I'm looking at the audience and it was supposed to be children's, you know, college kids and young kids and it wasn't. Because these rich guys bought all the tickets from the college students. I don't actually totally believe that. I actually think that the RNC gave them the tickets to be totally honest. I think they actually got the tickets, not through buy. But a lot of them did buy tickets. So I look outside, I say, wow, that's a lot of people out there. I know half these people. I know the lobbyists. I know most of the special interests and I'm looking at that audience and I'm saying this is bad stuff. But I had the most beautiful applause from Don and Eric and Melania in the front row. That's about it even though I won. But I -- but I understood. So you have to understand what's going on. A lot of times you think that the politicians are doing horrible, horrible deals and they are horrible. But you think that they're really, really not smart people. They are actually smart people but they're working for themselves. They're doing what their lobbyist who puts up millions and millions and millions of dollars every time they run. I'm just talking about the honest stuff. This is all honest stuff. This other stuff that goes on that, you know, you have to prove, right? I mean, you look at some of Hillary's speeches where she gets a fortune and she's, you know, give me a break. Take a look at that. Nobody, right? No, no, nobody looks at that. Bill makes a speech, gets a tremendous amount of money, far more there, and then all of a sudden, miracles happen, right? Miracles happen. And I imagine somebody is looking at that. And by the way, a recent poll just came out that I am beating Hillary so badly in the general election. So you'll do. So just like we do because people say how are you going to straighten out the budget? It's a mess. Just like we do with what I just told you about, medication, and buying medicines, and all of this. Same thing happens with the military. We're going to build our military so strong but we're buying equipment and we're buying things that our Generals don't even want. We're buying things that they don't want. We're buying planes they don't want instead of another one because that company has better lobbyists and they're stronger. We're going to get them the equipment they want. We're going to save a lot of money. And we're going to build ourselves so strong, nobody, I'm telling you. Nobody is going to play with us. We don't want to use it. Nobody is going to play with us. We have -- we have situations right now where we have the migration and we're accepting people in and we're accepting them in by the thousands. And you look at New Hampshire, you look at this area with the problems you have, the problems you have with the drugs, we're allowing people to come into this country that we have absolutely no idea who they are, where they come from, are they ISIS? Maybe, maybe not. Somebody said at least 90% of them aren't. Oh, really? If we had 10%, look at what those two people did two months ago. Radicalized people. They killed 14 people. Two people, young people, they killed 14 and plenty of people right now lying in the hospital, gravely wounded. Look at Paris 130 people killed. Now, the strongest gun laws anywhere in the world is France and Paris. People don't have guns except for the bad guys. So they walk in, they start shooting. They say you get over here, boom. You get over here. They kill 130 people. There's a tremendous number of people right now in the hospitals. If guns were on the other side of that equation where the bullets could fly in a different direction. You wouldn't have had that kind of carnage. You wouldn't have had it. You wouldn't have had it. So we are going to protect our Second Amendment 100%. Nobody's going to play with us. Nobody. So this all started when I came down and I made the statement to the press and I talked about illegal immigration. Oh, did I get it. Did I get -- well, that was like tough for two, three weeks, it was brutal. Then, all of a sudden, people started saying, you know, maybe he's got a point, maybe he's got a point. Then four or five weeks later people are starting to say, you know, they're coming out really strong. They're saying I think Trump's right. There is a lot of illegal immigration that is causing this, a lot of economic harm, but it's causing us a lot of trouble from a criminal standpoint. Right now as we speak it was released last week. We have 179,000 illegal criminal immigrants, illegal criminal. These are people that have been convicted of crimes, some very big crimes. That means we have 179,000 people here that have committed crimes that shouldn't -- big crimes that shouldn't be in the country. That's bigger, 179,000 people is bigger than any city by a lot in New Hampshire. That's a massive amount of people. That's a massive amount. So we're going to do something that's going to be whether you like -- Dwight Eisenhower. No matter what you do. Dwight Eisenhower, I like Ike. Everybody said nice guy. We either have a country, folks or we don't remember this. We either have a country or we don't. So we're going to have to take people. We're going to get rid of those 179,000 and I don't want to put them in our jails. I don't want to put him in our jails. Our jails are costing us a fortune. We're bringing them back where they came from and we're going to be respected by those countries which were not respected at all by those countries. We're bringing them back where they came from and let that country put them in prison for the next 25 years because we're not doing it. And they're never ever coming back to our country again. They're gone. Never. Now -- but all of a sudden, we started seeing people are focused on it. I will say this, if I didn't bring up the subject of illegal immigration at my opening when I announced I was running for President, you would not have anybody even talking about it. The other night in this stage I won't mention who somebody said, yes, and I'm very strong on illegal immigration. We will build a wall. He said it very loudly. We believe he's afraid that somebody says it with and I go, what's this all of a sudden? Now all of a sudden, I know I have two out of the group. They said, the other night, another one's on television, he said, yes, we have to have strong borders. We will build a wall. And my wife came up to me, Melania. she said, darling, did you hear that? That's the first time I've ever heard that said by anybody else but you. We have to build a wall. Walls work. Just ask Israel. Walls work. They work. I don't mean the little walls. I don't mean the little walls. I mean those walls. You know, I mean, serious walls. I mean, Trump walls. We're going to -- no, they work. They work and they work if they're right. You know in Time Magazine and a couple of magazines, I read I've been on the cover of Time Magazine so much lately. When I was on last week I didn't even know they were putting me on the cover. Can you imagine? That's when you're really hitting it big when you're on the cover of Time Magazine, you don't even know you're going to be on the cover. That's good. But they had like this ramp. They had a wall like this and then a ramp built over the wall and then another ramp and they have trucks going over the ramp. And they're loaded up with drugs. They have trucks going right over there. I didn't even know why they didn't just rip down the wall. It's a little -- it would have been cheaper, right? But they have a ramp it goes up. It goes down. They sell their drugs in the United States. A lot of them come over to here to head to New Hampshire and they get back on. They go back. They build ramps over the walls. And I'll tell you something. I met the Border Patrol people. They're phenomenal. The reason I met them is they called me and they said we'd love to meet you. And I went to Laredo, Texas and it was incredible. These people are incredible. They can do the job. They are told to stand back. They're told don't touch anybody. They're told let people come in. They don't want that. These are incredible men and women and they're standing there. People are walking right in front of beautiful equipment, everything looks good. Everything except for one thing they're told, don't do anything. And when they do something, they say give them a fine, let them go. They can go wherever they want that's the end. Then you'll never see them again. We either have a country or we don't. We're going to be so strong and just let me ask you one question about the wall. Who the hell is going to pay for the wall? What? So you know the head of Mexico today said there's no way we're paying for the wall. Please inform Mr. Trump. I said, I said the wall's just going to just get bigger when he has that attitude. No, no, so we're going to build the wall. They're going to pay for the wall. The politicians come up to me. They always come up to me when I say something. They used to come up and say, Donald, there's no way honestly, that you're going to be able to build a wall is there? I said, of course, it's like easy. I build massive buildings. It's much tougher. They said you can't really do that. Can you -- I said absolutely. Now just so you understand, 15 years ago they want to build a wall. You know why they didn't build it? They couldn't get an environmental impact statement approved. It's true. They couldn't because there were snakes, toads, rodents, all sorts of crap right in the way. They couldn't. Can you believe it? We can't build a wall and you have China in the South China Sea ripping the hell out of the ocean and building military bases in the middle of the South China Sea. And we can't -- do you think, by the way, that China got an environmental impact statement? I don't think. Do you know what they said? They said we're going to build it. They started work the following morning. That's what happens. We are so left behind and we worry about the carbon footprint. And I say, you know, I see Obama saying the single greatest problem this country has is global warming, OK? I tell you what. I just got out so we had a blizzard outside. There's no warming. This is brutal. Somebody from New Hampshire said this is one of the worst winters you know. But he's talking about global warming. Then he gets on a very old 747 with the old engines that spew a lot of stuff. And he takes his wife and his two really beautiful daughters and he goes in the 747 to Hawaii to play golf. And then he comes back and then he has a speech on the carbon footprint. So, folks, we're going to have a whole different thinking. I've been saying for a long period of time, take the oil. Remember? Remember this about me. I was against because I've had Hillary say, I don't like Donald Trump's tone. And I've heard Jeb say it too. I don't like Donald Trump's tone. You know, he's a low-energy guy. So he doesn't like my tone. But, but honestly, he said -- and she said -- and they said it the same day. And I thought to myself I can tone it down. I'm a smart guy. I'll tone it down. Then I said wait a minute. I turn on television. They're chopping people's heads off in the Middle East. If you're a Christian, the head comes off. If you're not Christian, the head comes off. We haven't seen stuff like this since medieval times. All right, medieval times and people are worried about my tone. You heard the other night at debate. They asked Ted Cruz a serious question. Well, what do you think of waterboarding? Is it OK? And honestly, I thought he'd say absolutely and he didn't. He said, well, it's you know, he's concerned about the answer because some people. She just said a terrible thing. You know what she said? Shout it out because I don't want to -- OK. You're not allowed to say and I never expect to hear that from you again. She said, I never expect to hear that from you again. She said he's a pussy. That's terrible. Terrible. That's terrible. Now what kind of people do I have here? OK, why do I -- so do you remember when not so long ago, not so far from here. I had a group of people. We're doing question and answer and somebody came up with a pretty tough statement about Obama and the press got very angry because I didn't defend the President. Remember I took a lot of heat and I didn't reprimand the person that said it. So I want to just tell you right now. Ma'am, you're reprimanded, OK? Can she stay? Can she stay? You're reprimanded. So for the press, this is a serious reprimand. Just so the press knows. So we have lined up to make some of the great trade deals and to take our documents that are so bad. We have lined up the finest business people in the world. They're all lined up. By the way, they call me, I don't even call them. These are great, great people. Some are nice. Some are horrible human beings. Some are people that you don't want to have dinner with but they're great at what they do. I know the greatest negotiators in the world. We need them. That's how we got into the hall with these deals and I'm telling you about. And believe me other, other facets of our economy is the same thing. It's the same exact thing. We're going to save so much money. I was hearing the other day, they were talking about the budget, and a political person said, it's his idea and it's his goal to have the budget balanced within 25 years. I said 25 years? And he was -- and he thought he was doing a good job. These are politicians, folks. They're never going to do it. And we're going to do it great. We're going to have a better country. We're going to have better services. We're going to have better roads and airports and hospitals. And we're going to pay less for them. We're going to pay less. You know, I'm building a big building right now on Pennsylvania Avenue that I got from the federal government, Obama. Can you believe it? How good is that? Ivanka worked on, I mean, Ivanka, what a job she did. I -- we had the old post office in Washington D.C., right? We are now -- we just announced. We're going to make it a world-class, one of the great hotels of the world. It's an incredible building. And we just announced we're two years ahead of schedule. We're going to have it open in September of this year, two years ahead of schedule. And we're under budget, ahead of schedule. Wouldn't it be nice if our country on its projects instead of having a 2,000% cost overrun? Boy, can you imagine how much those people make when you see these buildings and things was going to cost $200 million and it ends up costing $1.5 billion. Do you know how much money these people are making? So we're two years ahead of schedule. It's on Pennsylvania Avenue and I don't give a damn if I don't make the White House. We're moving into that building. I'm going to be on Pennsylvania Avenue one way or the other. So I want to finish up because you've got a bad evening out there and you have to drive. You have to do me a favor. I don't really care if you get hurt or not but I want you to last until tomorrow, OK? So don't get hurt. If you're going to get hurt and if you're going to drive like a maniac do it tomorrow after you vote. And I promise, I will come and visit you in the hospital, I promise. No, guys, I'm only kidding. I want you to be -- I want you to be careful. But look it's so important that we take care of our vets. Our vets are being treated so badly. And I have Al Baldesarra who is with me all the time, who's the greatest guy there is, who loves the vets, who loves us, and who knows what we're doing. But we're going to take care of our vets. We're going to take care of our military. We're going to build up our military. It's going to be a thing of beauty. By the way, I have to tell you. It's the absolute cheapest thing we can do because nobody is going to play with us. It's the cheapest thing we can do. But we're going to take care of our healthcare. We're going to take care of every facet of our country and we're going to start winning again. Folks, we're going to start winning again because we don't win anymore. We don't win on trade. We don't win on anything. We can't beat ISIS with our military. Can you imagine General George Patton? We can't beat ISIS. He would beat them by the time he walked down to the front row. We don't beat ISIS. We're going to start winning again. We're going to win on every single level of this country. We're going to win every single time we do something. We're going to win. We're not going to make stupid deals anymore. We're going to be led by smart people and we're going to have our smartest people representing us. Now, I leave you with this. I leave you with us. It's so important. It's so important. Tomorrow is going to be the beginning. I hear we have a lead. It doesn't matter to me. It doesn't matter to me. Who the hell knows what the lead is? You have some snow it looks like it's going to stop. It's so important. We have something so special going on. You have to go out. You have to vote. We have to celebrate tomorrow evening. We have to have a great victory. It's so important because we are going to Make America Great Again. We are going to Make America greater, greater, greater than it's ever been before. And I love you all. I love you all. You're special. We will see you tomorrow. Let's have a big, big victory tomorrow. We love you. Thank you. Thank you."}