{"id":458,"author":"Donald Trump","title":"Speech: Donald Trump Delivers a Speech in Milford, NH","date":"2016-02-02","link":"https://factba.se/transcript/donald-trump-speech-milford-nh-february-2-2016","paragraphs":["Special people. Special place. We've had such an incredible journey since, I remember, June 16th... since June 16th, the famous escalator ride and we just got back from Iowa and I want to tell you they're great people in Iowa and I love them. You know what, I'll tell you. We really did. You know, I started off... and it was very interesting.","A very interesting little thing. It's a caucus system, which is a much more difficult system. I don't say better and I'd say worse but certainly more difficult. And we started off, and when I announced on June 16th, there were 17 people. I hadn't registered. I hadn't been put in polls. So I didn't know what was going to happen.","And in Iowa they said, don't go to Iowa, you don't play in Iowa. Me. And I said, why? I know people in Iowa. They're great people. They said, no, no. It's not going to work. If you go there, it's not gonna work. So I said I have to do it. I want to go there. And I went there and I think we did really well.","We did really well. And they said if you get in the top 10 you'd be lucky. And that actually came out, the first time, it was like number 10. And then it went to eight and it went to five. And we finished number two, and frankly had I known we could have finished number two, maybe I would have spent more time there.","I would have taken a day or two off from here, but that wouldn't have been good. But you know it's sort of interesting because I'm very proud of this. I skipped the debate because I wasn't treated properly nor... nor was it. No, I wasn't treated properly. And you know when our country isn't treated properly, we have to behave that way also, just so you understand.","When you're not treated like you're supposed to be treated, you have to remember that. Oh, that's all right. These are the stats I wanted to show you. And there's a lot of air blowing down here I'll tell you. And so what happened... what happened is, I did the debate and then I said, you can't do that. And they had it. We could have broken the world record.","We would have broken because the debate that we did, the first one, they had 24 million people. Really, I think it was even more than that after final count. And I think this thing would have had, probably 26 to 28 to 29 million people. But you couldn't do it and I'll tell you I am so happy I didn't do it. Because, in one hour, we raised six million dollars for the vets.","OK? Six million. We raised 6 million for the vets. And If you told me I could have finished first, if I did the debate or second plus six million for the vets, I'll take the six million for the vets all day long. So we got the biggest vote. I'm just looking at statistics here. We got the biggest vote ever in the history of a primary in Iowa.","By like 60,000 people came out extra. I'm not going to say that was me, but believe me, it was me. Well, you know, two nights ago, three nights ago, one of the candidates that I'm running against, highly respected, was here and they had 250 people. So we have five... that should be a good sign. That's like our poll, right?","That's like an automatic poll. So, the vote that I got... the vote that I got was, other than the one vote because we had so many people, was the biggest vote in the history of Iowa for a Republican caucus.I mean the biggest in the history of Iowa for a Republican caucus. You know, when you think, the amazing thing is the press... not all of them, some were great.","Some were saying, you know he came in second, he started off in 10th and he came in second. But with me they don't like to hear a second. I don't like to hear second that much either to be totally... but one poll came out that said I was leading by four or five points. And I guess, you know, come in second and the headlines were Trump Comes In Second.","He's humiliated. There were 17 people when we started. Now you have 11. I come in second. I'm not humiliated. You know you have... you have... think of it. These people are the most dishonest people ever. OK? Ever. So, Marco is a nice guy. Marco Rubio. Nice guy. And he comes in third, right? And all of a sudden he comes in third.","He's a senator, does this stuff for a living, he's a professional politician. He comes in third, I come in second. Trump, no good. Rubio, unbelievable night, unbelievable victory. Unbelievable. Think of it. You got to think of this. And then they said, he's very, very close. He's very close. Oh, he could maybe surpass... I think it's about a difference of almost 3,000 votes.","That's a lot. That's a lot of votes. But you know, for Iowa, that's a lot of votes, let me tell you. But I think it was like 25, 26 and some large amount of votes. It wasn't really close but he came in second. The headline is, Winner Of The Night: Marco Rubio. Trump humiliated. Nah, they didn't really use that word.","They used like, didn't do that well. And I'm saying, how come the guy that comes in third, and he's a professional politician, and I beat him by, you know, a lot. How come the guy that comes in third... isn't this typical reporter? The media, the worst people ever. The worst. The worst. How come the person that comes in third on many of the networks is being covered like it's one of the great victories in the history of politics in this country.","And the person that's not a professional politician, I'm a job creator, I build great companies, I build great buildings. I do a lot of great things. I've employed 10... I've... I don't do this crap. I've employed 10s of thousands of people over the years. I'm so proud of the company... I've built an unbelievable company.","In fact, they went to check it. When I did the filing with the FEC, Federal Elections. They were... see all those cameras back there? Triple them. They were down there. Oh, they were going to find... they... first they said I'll never run, right? Then they said he'll never file Form A. Form A is where you sign your life away.","You give up everything. The family, the dog, the house. You give up the world. They say he'll never file From A. Then they said, oh, filed Form A. Oh, he announced. They didn't believe it. Then they said, well, he'll never file his financials. And if he did, he'll ask for the extensions. Because you could get an extension that goes forever.","I didn't want an extension. I told one of the big accounting firms, one of the best firms in the world, one of the biggest, most respected. I said, listen you got to get these done. I filed almost 100 pages. Bigger than anything ever filed with Federal Election, by far. You know these politicians, they put one page in and they need five extensions.","OK? You know why? They're afraid somebody knows about the cash they've been taking. They want to be careful. OK? They want to be careful. They want to be careful. Politicians, all talk and no action. So, what happens... I love you too darling. So, what happens is, I go in, I file. And they come back and they say, I don't believe.","The company's much bigger, much better. Some of the greatest assets in the world. Buildings in Manhattan, Bank of America building, big chunk in San Francisco. Some of the greatest assets. Turnberry in Scotland, where they play the British Open. So many different great assets. Doral in Miami Beach. Hundreds of acres of Miami Beach.","You know Doral. So many. And they're looking and there's low debt. Very little debt. Almost no debt. So there's low debt, tremendous cash flow and some of the greatest assets in the world. And the number is through the roof. And I'm not saying that to be braggadocious. I'm saying because that's the kind of thinking we need in this country.","Our country's going to hell. It's going to hell. So the press goes down and they see it and it was... it was such a dud. They were devastated. They thought they'd say, Trump isn't... you know, they all said I wouldn't file and I wouldn't run because maybe I'm not as rich as people think, right? That's what they said that.","The hell was that? I'm wondering, this can only happen at a Trump rally. This can only happen... well, you know, that could be a way we get them to turn the cameras, right? And what the cameras don't have and what the press will never, ever, ever report is the crowds. They don't do it. They report it for Bernie.","They said the other day, recently... I had 12,000 people, he had 3,000 people. They said, Bernie Sanders had an amazing crowd of 3,000 people. I had 12,000. When it's my turn to go, Donald Trump made a speech today... front of a crowd. It's unbelievable. I'll tell you what, it is so dishonest... and I have friends that are reporters and they tell me, they can't report the truth.","They cannot report... they're told what to do. And if you happen to be on our side of the equation, for the most part, they're just very dishonest. I'll tell you, they're just very dishonest. So what I do like is, when that man holds up that sign... oh, by the way, I should reprimand him because, you know, remember when I took a lot of heat?","Remember that? Somebody said something that wasn't that nice to our President and they said, Donald Trump did not defend the President. I wonder if he'd defend me? You think you he'd defend me? They can defend... So they said, Donald Trump did not defend the President. And I said, oh, OK. So, they said I should have defended him and I should have done something.","So, sir, you're reprimanded. OK? But we're not throwing him out folks, right? We're not throwing... So I put it in these statements and they've been great. And I tell you because I probably would have filed them even if I didn't run. You know, it takes guts to run for President. It really does. It takes guts.","It takes guts. Especially, you know, if you're a politician you run and you run and you lose and you win and you run. It's all they do. With us, it takes courage. But we needed one of us. We have to do it. We have to do it. There's so many things that are wrong. So I wanted to just tell you... and I feel so good... and by the way, while I have... because I have all those cameras.","Good. I have to take care of a couple of things. OK? For the veterans, Carl Icahn, great business man. He'll... I'll put him in charge of negotiating with China. We'll stop their $500 billion trade deficit, I can tell you right now. I can tell you right now. But I have to say this. Good guy, tough guy, smart guy.","That's the kind of people we want. He's worth billions of dollars, doesn't want anything. He'd love to represent us. He'd love... we put him in charge of, let's say China, let's say Japan, let's say one or two countries. Probably one, because we have some great people. We have the greatest negotiators in the world.","We have the smartest business people in the world. We don't use them. We use political hacks. We use people that don't have a clue. We use people that got their job because they give campaign contributions to these guys. I mean that's how they get their job, and they don't give a damn about the country. they care about themselves.","And that's not the way it's going to work. OK. Carl Icahn great businessman gave 500,000 to the vets. Now, this was when I was supposed to be up debating. Oh, big deal. This was when I was supposed to be up debating. We have Steve Roth, friend, gave 50,000. We have the Fisher family, gave 75,000. Richard LeFrak, gave 100,000. Donald Trump... did you ever hear of Donald Trump?","Donald Trump gave one million dollars. We have a rich guy from New York City, a friend of mine. I can't believe it. This guy was the worst braggart I've ever seen. If he gave money he wanted his name up in lights, and all of a sudden he became like please, please don't tell my name, please. I'm saying, why?","Guy's loaded, by the way. Why? He said, because I've changed. See, people can change. I've changed a little bit, right? People can change. I said, you really don't want it named? I'd like... so I said, look, if you don't want me to name it, I won't. So I just call him rich guy from New York City, one million dollars for the vets.","OK? One of the great businessmen in this country, Mr. Phil Ruffin and his incredible wife, gave... from Las Vegas and lots of other places. He's got plenty of places. He gave one million dollars to the vets. Is that great? Ike Perlmutter from Marvel... you know, they do the great movies. I think he's got like five of the greatest grossing movies of all time.","He's a great genius, his wife is incredible, Laurie. One million dollars to the vets. OK? Isn't that great though? And there are many more. There are many more. So I just want to tell you that that was such an amazing... it was just such an amazing thing. And I'd call these people, I'd say, could you give a half a million?","One of them said to me... I said, could you give... these are really successful people. I said, could you give a half a million? He goes, no, I won't. I'll give a million. Ah, I said, OK, I'll take it, right? On behalf of the vets, I'll take it. So we have a lot of good things happening. So the whole experience in Iowa was great.","The only problem is the press didn't treat me right. Instead of saying you did really well, you didn't do too much over there. I mean I'm focused here and I have been focused here. And South Carolina, by the way, very much. But they said... instead of saying unbelievable job, they said, Trump, eh, he did all right.","It was a little disappointing. Now, third place was fantastic, but it was a little... So it was one of those things. So I had a good time. I learned a lot. I made a lot of good friends out in Iowa and they're really... they are great people. One other thing I have to say, because we're all... a lot of us are business people.","We want to make our country great again, right? Such a great theme. Is that like... is that the greatest of all themes? That's what it is. Somebody said, what are you going to do for the country? And I said to myself, you know I have a lot of time here. This is a radio person. And we... by the way, do we have Howie Carr?","He's around here someplace. Where's Howie? Where is Howie? Howie, where the hell are you? Is he a great guy? We love Howie Carr, right? We love Howie Carr. And who else do we love? We love Tom Brady. We love Tom Brady, right? We love Tom Brady and we love Coach Belichick. Don't worry. I'm telling you, he's the greatest coach.","Don't, don't ever lose him. But Tom is a great friend of mine. He's a great guy. He said the nicest things about me. You know, in Massachusetts, my poll numbers went up like 25 points. They went up to 48 or 51 or some... because Tom Brady said Trump is great. That was good. You know, you don't often get too many people, that say something nice where it has a positive impact, but Tom is in that category, right?","So where is Howie Carr? The legendary Howie. Because he's here. He's got that radio going. He has been so nice to me. Thank you Howie. We love you Howie. He's a good guy, isn't he though? So here's the final on that whole thing. In terms of money spent per vote, right? Right here, stats. Stats. Money spent for vote.","I was almost the last in Iowa. There's something nice about that. You know, there's something nice about that. You know, as an example, on the campaign... now I'm going to spend a lot of money. It's all my own. I'm self-funded Can you believe this? And I'll tell you something folks. Let me just tell you, because I said it before, I told it to the press.","They'll make it a big story probably. They always make everything... and then they change it, but that's OK. I told the press just... we had a press conference. I said, I'll be honest with you, I don't think that I have gotten the proper credit for the fact that I'm self-funding. I don't think it means anything to anybody.","Really. I have turned down... if I wanted... you know, Bush has $128 million dollars he got. I mean, wouldn't he have been better off just taking the money or throwing it out a window or something? But if you look at... if you look at Ted Cruz, he's got tremendous money from the oil companies. He's going to be taking care of the oil companies.","He's going to take care of Wall Street. Even though he didn't report his loans. He's going to take care of Wall Street. If you look at some of these people, all of them, they all have money. So... and it's all from Wall Street, it's from oil, it's from different things. Now, those people are 100% going to like a little puppet.","They're going to take care of those interests. With me, I have no... but I just want to take care of you. I just want to do the right thing. But I said something at the press conference, and I don't think they knew what the hell I was talking about. Some are smart but some of these guys are dumb as a rock.","And I mean... you know... you know, when this man lifted up the sign, I liked it for one reason. Because they had to move the cameras around to show the crowd. OK? That's the only way they see the crowds, is when we have... if we have protesters, I love it. In fact, sometimes I actually... thinking about doing it. I'm going to set my protesters up in corners of rooms.","Because those cameras never moved from my face because they don't want to show how many people I have. They don't want to show... it's a movement. We have a movement going folks. We have a movement going. And I have to be honest, and I want to thank him before I just... before it's too late. But Scott Brown for him to come up and call and say, I love what you're doing, I love where you're going.","He loves this area and he loves you people. For him to endorse me is a very important thing. So, wherever the hell Scott is... right? It's a very, very important thing. And I've had other great important... you know, just great ones. You know Jerry Falwell Jr., who's fantastic, Liberty University, the job he's done.","Sarah Palin gave us a tremendous endorsement. Tremendous. And you know who gave me a great endorsement that you people are really going to like? Because everybody likes this, Sheriff Joe from Arizona. OK? Sheriff Joe. You know, when Sheriff Joe gives you an endorsement, you know you're the king of the border, right?","You know, all these other guys that I'm competing against, they're all... and woman... they're all coming up. They're all coming up and they're saying... when I originally announced, I talked about illegal immigration. If I didn't bring it up... and did I take heat. If I didn't bring it up, it wouldn't even be a subject right now.","And then, all of a sudden... and I was gone. I said, this can't be like this. You can't go on like this for months and months. No human being can take this amount of incoming. No human being. And they were just going after me and they said it's terrible. And then after about two, three weeks people start saying, you know Trump has a point.","He has a point. Now they're coming. Then all of a sudden four weeks, five weeks go by. Then you see the kind of tremendous crime that's being committed by the people that come into our country illegally. Tremendous crime. Then you have the killing of Kate, beautiful Kate in San Francisco. Then you had the killing of Jamiel.","The woman. You have the killing of the woman, a 65-year old veteran who was raped, sodomized and killed by the illegal immigrant. And that's three people. That's... you have to see what's going on. You have to see what's going... how bad it is. And not only that, the economy. And I want people to come into the country.","But I want them to come in... they have to come in legally, right? Legally. They have to come in legally. So, we have all of these endorsements. They're incredible endorsements. But I do have to say, one of the gentlemen that I'm competing against... my wife is watching television the other day and she's listening to this guy, boring, falling asleep, OK? Falling asleep.","It's like a sleeper. And he said... I won't use the name because I don't want to embarrass anybody. He said... he said, and we will build a wall. And she said, darling come here. Listen, he just said we're going to build a wall. Who the hell ever heard of building a wall except for me. So now they... they don't give us credit.","When I said, in Iraq... when I said, take the oil, right? For four years I've been saying, take the oil. Then, after those horrible Paris attacks, all of a sudden they said, we will take the oil. The problem is they're four years late. And when I said take the oil, I meant take it. They mean blow it up. I mean take it. Take it and give some of the profits to our wounded warriors.","Give some of the profits to the vets and the families that have lost people in Iraq. I've been saying that... I've been saying that for four years, take the oil, and you know it. And they just did it. They... but... but they're not doing it right. You know, they don't want to bomb the oil because it would be environmentally... it would be a pollution event.","It would be an event of pollution, as they say. It will add to the carbon footprint. Now, do you believe this the way we fight our wars? Scott, do you think General Douglas MacArthur used to have the carbon footprint in mind when he bombed the hell out of... right? How about General Patton? Did he think... oh oh, the carbon footprint.","General Patton, if you ever mentioned the carbon footprint, he'd smack you in the face and say, what are you crazy? No, I mean, I actually heard this. I'm not sure I believe it, but I think I believe it. They said one of the reasons we're not bombing the oil is because they don't want that pollution going up into the atmosphere.","I mean, it's... the whole thing is ridiculous. Don't forget. We have a President that thinks that global warming... now there's many names. There's global warming, that wasn't working so well. There's... right? Climate change. There's extreme weather. The new one is extreme weather because how can you miss with extreme weather?","Even if it's nice you say it's extreme because it shouldn't be this nice. You know, the global warming was really bad. It was just not working. Then they went climate change and that was better but extreme weather is like perfect. And we have a President that talks about the biggest enemy of the United States, right?","The biggest number one enemy is... he calls it global warming. It's global warming. Climate change. No. One of those things. He doesn't know. Eeny, meeny, miney, mo. Whatever. Whatever the word... now, let... let me just tell you. So, climate change and the carbon footprint. So he says, for Christmas or whatever, he wants to go... Christmas, by the way, Merry Christmas.","Don't you want to say Merry Christmas? Merry Christmas. Merry Christmas. We're going to bring Christmas back. We're going to bring it back. Merry Christmas, Happy Holidays. We're going to bring it back. You see, these department stores, you can't say Merry Christmas anymore. Don't shop there. You'll say Merry Christmas again very quickly, believe me. But for Christmas... but for Christmas or whatever he celebrates.","He gets into a Boeing. A very, very old... it's called Air Force One. A very, very old Boeing 747, with the old engines spewing... spewing carbon and every other thing. I don't think it happens to hurt the air personally but that's OK. So these old engines are spewing into the atmosphere and think about the carbon footprint.","But he's only going to Hawaii. So, he's going from Washington to Hawaii. He's going to play golf like so many times. You know, he plays more golf than people on the PGA Tour. You know that, right? They admire him. They say, if they could play that much, they'd be even better players. So he's taking the Boeing 747 flying to Hawaii.","You know how long that is? Old engines. These are the big old engines spewing fumes. He's over there for two or three weeks playing golf. He then gets back, hops in the plane, flies back to Washington. Then he comes back and he talks about... global warming is our biggest problem. Somehow, I think that ISIS, Russia, Radical Islamic terrorists, right?","China. This maniac from North Korea. Somehow, I think that that's a bigger threat than global warming right now. OK? Somehow. The only global warming we should be fearing folks is global warming caused by nuclear weapons, and if we're not smart, that's what's going to happen. We better get really tough, really smart, really vigilant or we're going to have a problem.","We better stop playing games, believe me. We better stop playing games. So, we've become the policeman to the entire world. We take care of the world. They pay us peanuts. We take care of Japan. A lot of people don't even know that. I mention Japan, people go, we don't have... we have. Now, here's the deals we make.","If we are attacked, somebody attacks us. Wouldn't you rather have Trump as President if we're attacked. Oh, we'll beat the shit out of them. Anybody attacks us... You know, interestingly, speaking of potential, because he hates Obama so much, Putin, he said Donald Trump is a genius and he's the real leader over in that country.","And these people that I'm negotiating with all the time, these people on the stage with me, they said, you should disavow what Putin of Russia said. I said I'm not disavowing that he called me a genius. Are you crazy? Don't worry, I can't be seduced. But wouldn't it be nice? If you think about it, wouldn't it be nice if we actually got along with Russia and others, and we can use them to knock out ISIS with us, so that maybe we don't always have to pay for it. Knock the hell out of them but let them drop some of their bombs that cost a million dollars apiece.","Let them use some of their weapons that cost billions and billions of dollars. Let them beat the shit out of ISIS also, right? Right? So crazy. By the way, I have to say thank you. Oh, I love... look at Al. Al, my number one vet. Hey vets, is Al taking good care of you? If he doesn't take care of you, I will say, Al, you're fired.","Get out of here Al. Al's a great guy. He's become my friend. And I'm taking care of the vets. I told you before, we're gonna build our military so great, so strong. Nobody's gonna mess with us. Nobody's gonna mess with us. Don't forget, Jeb Bush and Hillary Clinton both, the same day they said, I don't like Donald Trump's tone.","Now, that day three heads were chopped off in the Middle East, they're worried about my tone. But don't forget this, this is important. I'm the one that didn't want to go and raid Iraq, and beat the hell out of Iraq, because I said you're going to destabilize the entire Middle East. And that was Reuters in 2004 and before that.","Reuters 2004, I said don't do it, you're going to destabilize. That's exactly what happened. We have destroyed... what happened is the Middle East is totally destabilized. Iran, which made one of the great deals ever, with $150 billion. They're going to make nuclear weapons. They're going to self-inspect.","How about that? They're going to self inspect. Listen, we hear... here's our President. We hear you're making nuclear weapons. Would you please check the area and call me back tomorrow? President Obama, I give you my word. I give you my word. We have just self-inspected. We are not going to ever, ever make nuclear weapons in those areas.","And then the guy's gone, right? Isn't sick? I mean, isn't it crazy? And then they have the other. Not only self-inspection but then they have the other, 24-day period. So, if we think they're making nuclear weapons, we have to inform them. The clock starts ticking maybe in a month or two months or five months before the 24 days kicks in, right?","So this thing could go on forever. In the meantime, they clean it up. They say, oh, 24 days wouldn't be enough to clean up. Enough for me to clean up anything, 24 days, right? And... and... and paint the floor battleship gray. So when we walk in, we say, oh, nothing's happening here. So they get 24 days.","This is the dumbest agreement I think I've ever seen. Done by your man, he's up from this area, Kerry. Is he the worst negotiator? I hear he wants to run for President if Hillary gets put in prison. That's what I hear. You know what? He can't run for President. That deal is so bad... boy would I love to run... just that one deal... I didn't even have to talk about how else he's messed up. That deal is so bad, would we love to run against Kerry?","Just for the deal. All we have to do... we paid $150 billion for four prisoners, right? 150 billion. Now, the most amazing thing... you wouldn't have started... anybody in this audience... no, not anybody. About 95% percent. You would've walked in, you would've said, we want our prisoners back. This is like four years ago.","This thing is the longest running deal I've ever seen. You would've said, I want our prisoners back. They would've said, no, no, no. You would have left, you would've doubled up the sanctions. They would've called you back almost immediately and they would have said take your prisoners, right? We have prisoners.","Then you make sure the prisoners have landed. The prisoners now have landed... this is the art of the deal by the way. The prisoners have landed. Now you go in a second time and you say, fellas... you know, I like to take the lumps out. My father always used to say, son, you're too tough. Try taking the lumps out.","I say, OK pop. So I'd like to be nice. So instead of saying we're not giving you $150 billion. You don't want to say it that way. Too tough. You know, too challenging. You say it this way, fellas we've got a problem. We owe $19 billion. Our stupid people in Washington just approved a budget three weeks ago.","How about that budget? They're getting everything. You know, Obama's a horrible negotiator, except when it comes to negotiating with the Republicans. He's a genius at negotiating with the Republicans. He's horrible with Iran, with Russia, with China, with Japan. But with the Republicans, he gets everything he wants.","We send these people there... you know, I don't mind the Democrats, because we know where they're coming from. But we send the Republicans there. They're going to get rid of Obamacare. They're going to get rid of 100 different things. They're going to cut the budget. They're going to balance the budget. They're going to do all these things, right?They go there.","What happens? What happens? You know, I tell the story... they walk into the beautiful halls of Congress. They walk in and they see the Capitol building, and they look up and they see the beautiful ceiling, and they see the columns that go so high, beautiful marble, and they say Alice or Jim, Alice... let's use Alice for this one.","Alice, we've arrived. We've made it. Now, we've made it. And then they say... they go in for a first vote. Do you approve an extension of Obam... right? Of who? Obamacare. Do you approve an extension of Obamacare? Yes sir. Yes sir. It's disgusting. It's disgusting. And by the way, I have been opposed to Obamacare from the day they conceived it and Ted Cruz comes out with an ad that I'm in favor of Obamacare.","Can you believe this? Just like he did with Carson, where Carson... he said, left Iowa. He's out of the race. Vote for him. Did you hear about this one? He's... he said he left Iowa. Carson's a nice guy. Ben... so Ben is, all of a sudden, getting calls that he quit the race. These guys said he quit the race.","He's gone. He's out. Send your votes to him. What kind of people are we dealing with, with these politicians? And made up... liar honestly... and made up stories. Made up stories. Everybody in here... many of you know me. From day one, I've been talking about, we're going to repeal and replace Obamacare from day one.","Now, we're going to do it. We're going to do it. If you remember, so important, from day one I've been saying, repeal and replace Obamacare. I've been talking about the five billion dollar website that never worked for years, right? All of a sudden I see an ad or something, Donald Trump is in favor of Obamacare.","And people are calling, oh, I thought you were against it. That's too bad. These are dishonest people, these politicians. These are worse than real estate people in New York, I'm telling you. No, no. These are truly dishonest people. Then he said, Ben Carson has quit the race the day of the election. Ben Carson... during a caucus.","Ben Carson has quit the race and Ben didn't quit the race. In other words, Ben Carson quit and let me have your votes. What kind of crap is this? And then he makes up a thing that says... like it's on a government document, voter violation. It says on top. Just like it comes right out of government, municipal, voter violation.","And it talks about... it gives grades F, F, F, F, you haven't voted. But it says you can go vote but you've got to go vote for him. And people are afraid, they think, oh, I'm in violation. I have to go vote. What kind of people are these people? And then the Attorney General in Iowa is investigated but by that time they're all gone, the election's over.","What kind of people do we have running for office? No. It's honestly, really, really dishonest. And I think I know why. You know why? Because he was born in Canada. Was. Happens to be a problem folks. That happens. You watch, the Democrats... they've already said they're going to sue him. He gets the nomination, they're going to sue his ass off.","Actually, they're going to sue the country but they're going to sue him. And that's a big problem. I wanted to mention one other thing because, in Iowa... while we're talking about Iowa. So, price per head per vote. Leading the pack, ladies and gentlemen, with the fabulous... He shouts out Bush. How did you know?","So, Bush got 1% or 2%. Leading the pack, the man that spent the most money per vote, the legendary Jeb Bush. With a number of... this is per vote. No, but you're not so far off. $2,884 per vote. You know, you could've won the election. Just promise everybody 1,000 bucks and you could have won it. You would've save money, right?","You would have won. You would've saved a lot of money. So Jeb Bush spent almost $3,000 a vote. That's got to be a record, right? Is that in the Guinness Book? Would you check the Guinness Book Of World Records? You have others with tremendous numbers. Marco spent a lot, almost $300 a vote. But at least he had a pretty good result.","He came in third. No, no. He had a fantastic result. Unbelievable. Unbelievable. He came in third. The guy that came in second, oh, terrible night, terrible night. Terrible night. Dishonest people. Dishonest people. Look at these numbers. So hundreds and hundreds of dollars in the... in the... Jeb paid, you know, close to $3,000 a vote.","So who's one of the lowest? I'm just about the lowest. Lowest. The great Donald Trump. Lowest. The great Donald Trump. By the way, I'm I'm very proud of the fact that I have spent less money than just about anybody else on the campaign. And I'm going to start spending a lot for two reasons, right? Number one, I don't want to take any chances.","Number two, I feel guilty. Because when Jeb has now spent 119 million or some ridiculous number, and much of it is sort of earmarked to me, ads. They can't be very good, because every time he takes an ad, my numbers go up. It's a crazy deal. But... but... so I've spent... because, nationally, I'm leading every poll.","In the state... I mean, honestly, other than Iowa, which was the weakest one I had. But, in the state, I'm leading the states. Leading here tremendously. But every single national poll I'm leading. And just about, I think, every state poll I'm leading. So I spent the least and I have the best result, right?","Right? Isn't that nice? Now, others have spent, like Jeb, like a couple of others, they've spent the most and they have the worst result. How the hell can you put them in charge? Now, think of this. Think of this. We have a school system... we are getting rid of Common Core by the way and we are preserving... Education in the United States is the most expensive, per pupil, in the entire world, right?","The most expensive in the entire world. And there is no second place because it's so much lower, it's ridiculous. Norway, Denmark, Sweden, China. These are like the top four or five places for education. We're number 30. I used to say 28, right? We just went up two notches. We're now number 30 in the world.","We spend the most per pupil by far and we have the worst education by far. So we're now number 30 and we spend the most. Wouldn't it be nice if they did like Trump, where I spend the least and I have the best result? Wouldn't it be good? Wouldn't that be good? Now, so important. And that's what I mean, our budget.","They said, we are working on the budget and we think, within 25 years, we can balance the budget. I said, 25 years? 25 years? These are serious people. They said 25 years to balance the... I'm talking about doing it relatively quickly, and I mean we're going to have a better country, we're going to better service.","We're going to get rid of the waste, fraud, abuse. All of the... all of the waste. The disgusting waste and the fraud. You look at the Veterans Administration... take a look at what's happening in Phoenix, Arizona. It's one of the great fraudulent scams you've ever seen, the Veterans Administration. We're going to take such great care of them.","What's going on is unbelievable. And we're going to make our country so strong and so solid. I said the other day we're going to make our country rich again and a woman said, Mr. Trump, that doesn't sound nice. I said, we can't be great unless we're rich. We're a debtor nation. That horrible budget I told you about a little while ago, that's worth two trillion dollars.","That takes care of our border, letting everyone in that Obama wants to come in. That takes care of the Syrian refugees who we're never going to let in folks. I have a big heart but we're never letting them in. We don't know who they are, we don't know where they come from. It's not going to happen. It's not going to happen.","And anybody... and anybody that comes in, I want everybody to know, we have to send them back. We cannot take chances. We can't afford it. We can't afford to make mistakes like that. You know we have the two people that were radicalized... probably she radicalized him, the married couple. How great. Who, in California, killed 14 people with plenty very badly injured in the hospital, right?","We didn't know this. We didn't know anything about it. We had Paris, where they have the toughest gun laws in the world. The toughest. Because we're going to preserve our Second Amendment. We're not touching that Second Amendment. Unless we're going to make it stronger. Unless we'll make it stronger. So, Paris has the toughest gun laws in the world, right?","The toughest in the world. You can't have a gun. Unless you're a bad guy, no problem. So these disgusting thugs walk in to various places and start shooting people. Boom, boom, boom. Move over, boom. 130 people dead. Many people so gravely injured that they will be gone. They're going to be dying. They're dying now.","And other people are going to live a life but they're going to live a life in hell because they're so horribly injured. Now, if we had a few people in this room... I can look at them. That guy right there, he's a mean... and if we had a few other people... you, you, you... let me pick a woman. You. And if somebody had a gun on their belt or somebody had a gun wrapped around their ankle, and those bullets started coming at you or you see they were going to, and you shoot the hell out of them.","Folks, that's the only form... it's our... it's our form of protection. You wouldn't have the carnage that you had there. How about the military base? Five great young soldiers, a gun free zone. One of the soldiers is a world class marksman one of the best in the world. They're all top of the line soldiers.","They're told to disarm, take their guns, put them 200 yards away. Sealed. A whack job walks in... these five great beautiful soldiers. Tough, smart, tremendous future. This whack job walks in and blows them away. Kills all five of them. That was it. Because you know what? When these crazy people see gun free zone that's like saying candy to a baby, right?","That's candy to a baby. So we're going to protect our Second Amendment. We're going to protect ourselves. We are not touching our Second Amendment. And it's under siege, they're playing now with bullets. They're playing now with magazines. They're playing with a lot. We are going to protect our Second Amendment.","Remember that. So when I started and when this all began on June 16th, coming down the escalator, it was all about border protection. And speaking of border protection, Ann Coulter, she has been such a great help to me. Where is Anne? Where's our Anne? Where is our Anne?Anne where the hell are you? Stand up Anne.","Oh, she is standing up. She is so great, right? Adios amigo. Is that right? Best seller, right? And... OK. She is so great. She has been so supportive of us. She wants border security. She wants people to come into the country legally. She wants people to come and they have to come in through a process. But there's nobody stronger on this subject.","Is that right? And I love the book. I read the book. Go out and buy the book everybody, all right? Great person. She's a great... she's a great person. So when I started this whole deal. I just come down and I talked about that. I talked about Obamacare, repealing it. I talked about the military. I talked about the vets.","I talked about Social Security, because we're going to save our Social Security. And I talked about trade. I talked about trade like nobody else could talk about trade. When Carl Icahn endorses me... and many of the best business men in the world, and women, they want to endorse me. I say, don't bother. Nobody knows who the hell you are.","It's true. You know? Not like the great Scott Brown. Nobody knows who they are but they're the best business people in the world. So when they endorse me and we use them, good. I talk about trade. China is making a fortune off us. We can't do it. Vietnam, Japan, Mexico, both at the border and with trade.","You got to see what's moving. Nabisco moving their big plant from Chicago into Mexico. Ford building one of the biggest auto plants in the world. Two and a half billion dollar auto plant in Mexico. What the hell are we doing? What are we doing? We're bringing back our jobs. Now we have a case, it's called corporate inversion.","Where companies used to move, like from here to Florida or from here to Texas or from Texas to here. Now we have a problem. Now we have companies... they don't want to move to Florida. They don't want to move to Texas. They don't want to move to New Hampshire. Boy, have you taken a beating, by the way. You talk about companies leaving.","You're like a prime example. What they've done to you is incredible. But we're going to bring them back. We're going to make it so they come back. So now we have corporate inversion. Where companies like Pfizer... Pfizer, great companies are moving outside of the United States because taxes are too high.","By the way, my bill... and Larry Kudlow and so many others, they think it's great. I put in tax policy. Big, big cuts for the middle class. The middle class in this country has been decimated. Big, big cuts for business. Big. We are the highest tax nation in the world. Big, big cuts. Right now. And it's going to pass, it's going to go through.","I get things done. That's what I do. I get things done. I deal with politicians all my life. We'll get it passed. We'll get it passed. So, I used to talk about that and then when we had that horrible event in Paris and we had the horrible event, as you know, in California... and we had many other horrible events.","I brought up the fact that we have to now start talking seriously about radical Islamic terrorism. We got to talk about it. And I said it. And it was just like... happened with the illegal immigration. I said it, it was heat. Two weeks later everyone's coming over and now they're all trying to be tougher than me. Nobody can be tougher than me by the way.","But they're all trying to be tougher than me. So now I talked about the whole situation. There is such hatred out there. When people are flying airplanes into the World Trade Center, when people are doing all of these acts... not just here. All over the world. And I have friends that are Muslim. They call me, they say, you have done a great service.","There is tremendous hatred. You can not solve a problem like that unless you start talking about it. We have a President that will not even discuss it or talk about it or use the words. He won't say radical Islamic terrorism. It's real. It's a problem. And you can't solve the problem unless you're going to be able to talk about it. So we've had tremendous... I took a lot of heat and now everybody is saying, thank you so much.","And it's under discussion. It's a big, big problem. And you know what? We're going to get it solved. One way or the other, we're going to get it solved. But we can no longer be the stupid country. We can no longer be the country that's led by incompetent people. We can no longer be the country that takes Sergeant Bergdahl, a traitor, a dirty rotten traitor and take him... and take him and swap him for five of the biggest killers that they have in the Middle East, that they've coveted and wanted for a period of at least nine years.","So, think of it. We get Bergdahl and they get these five killers that are already back in the battlefield trying to kill everything in front of them, including us. We're not making deals like that anymore folks. We're not making deals like that. So, just to finish off, you have to see the cover of Time magazine last week.","Amazing, amazing cover. Amazing writer. I never spoke to him. You know, I do better when I don't speak to the writers. When I speak to them they kill me. This was a Time... oh, give me that magazine. Throw that up here. Come here. Come on, just throw. Go ahead. Weak arm. That's OK. You have to go out, get this magazine.","This talks about our movement. It's a movement. This talks about the movement. This is... you know, in the old days maybe they would have said silent majority. It's really not the right... it's really the noisy majority. People are angry. They're upset. They're... they're... they're just... they can't even believe that this stuff is happening.","They can't believe it. We are going to make our country so strong. We're going to make it so just and we're gonna have a big heart. We're going to take care of people. We're going to take care of people. There are people that can't take care of themselves. We're gonna help people but we're going to make our country so good.","We're going to start winning. We're going to win with health care. We're going to win with our military. We're going to win with our veterans. We're going to win with every single thing we touch. We're going to win against China in trade. We're going to win against Mexico at the border and with trade. We're going to win against Japan, where they send us millions of cars and we can't send anything of value back to them.","We're going to start winning again. We're going to win so much and we are going to make our country. We are going to make this great, great country even greater. We're going to make America great again. I love you all. I love you. I love you. We love you. Thank you. Thank you. Thank you."],"text":" Special people. Special place. We've had such an incredible journey since, I remember, June 16th... since June 16th, the famous escalator ride and we just got back from Iowa and I want to tell you they're great people in Iowa and I love them. You know what, I'll tell you. We really did. You know, I started off... and it was very interesting. A very interesting little thing. It's a caucus system, which is a much more difficult system. I don't say better and I'd say worse but certainly more difficult. And we started off, and when I announced on June 16th, there were 17 people. I hadn't registered. I hadn't been put in polls. So I didn't know what was going to happen. And in Iowa they said, don't go to Iowa, you don't play in Iowa. Me. And I said, why? I know people in Iowa. They're great people. They said, no, no. It's not going to work. If you go there, it's not gonna work. So I said I have to do it. I want to go there. And I went there and I think we did really well. We did really well. And they said if you get in the top 10 you'd be lucky. And that actually came out, the first time, it was like number 10. And then it went to eight and it went to five. And we finished number two, and frankly had I known we could have finished number two, maybe I would have spent more time there. I would have taken a day or two off from here, but that wouldn't have been good. But you know it's sort of interesting because I'm very proud of this. I skipped the debate because I wasn't treated properly nor... nor was it. No, I wasn't treated properly. And you know when our country isn't treated properly, we have to behave that way also, just so you understand. When you're not treated like you're supposed to be treated, you have to remember that. Oh, that's all right. These are the stats I wanted to show you. And there's a lot of air blowing down here I'll tell you. And so what happened... what happened is, I did the debate and then I said, you can't do that. And they had it. We could have broken the world record. We would have broken because the debate that we did, the first one, they had 24 million people. Really, I think it was even more than that after final count. And I think this thing would have had, probably 26 to 28 to 29 million people. But you couldn't do it and I'll tell you I am so happy I didn't do it. Because, in one hour, we raised six million dollars for the vets. OK? Six million. We raised 6 million for the vets. And If you told me I could have finished first, if I did the debate or second plus six million for the vets, I'll take the six million for the vets all day long. So we got the biggest vote. I'm just looking at statistics here. We got the biggest vote ever in the history of a primary in Iowa. By like 60,000 people came out extra. I'm not going to say that was me, but believe me, it was me. Well, you know, two nights ago, three nights ago, one of the candidates that I'm running against, highly respected, was here and they had 250 people. So we have five... that should be a good sign. That's like our poll, right? That's like an automatic poll. So, the vote that I got... the vote that I got was, other than the one vote because we had so many people, was the biggest vote in the history of Iowa for a Republican caucus.I mean the biggest in the history of Iowa for a Republican caucus. You know, when you think, the amazing thing is the press... not all of them, some were great. Some were saying, you know he came in second, he started off in 10th and he came in second. But with me they don't like to hear a second. I don't like to hear second that much either to be totally... but one poll came out that said I was leading by four or five points. And I guess, you know, come in second and the headlines were Trump Comes In Second. He's humiliated. There were 17 people when we started. Now you have 11. I come in second. I'm not humiliated. You know you have... you have... think of it. These people are the most dishonest people ever. OK? Ever. So, Marco is a nice guy. Marco Rubio. Nice guy. And he comes in third, right? And all of a sudden he comes in third. He's a senator, does this stuff for a living, he's a professional politician. He comes in third, I come in second. Trump, no good. Rubio, unbelievable night, unbelievable victory. Unbelievable. Think of it. You got to think of this. And then they said, he's very, very close. He's very close. Oh, he could maybe surpass... I think it's about a difference of almost 3,000 votes. That's a lot. That's a lot of votes. But you know, for Iowa, that's a lot of votes, let me tell you. But I think it was like 25, 26 and some large amount of votes. It wasn't really close but he came in second. The headline is, Winner Of The Night: Marco Rubio. Trump humiliated. Nah, they didn't really use that word. They used like, didn't do that well. And I'm saying, how come the guy that comes in third, and he's a professional politician, and I beat him by, you know, a lot. How come the guy that comes in third... isn't this typical reporter? The media, the worst people ever. The worst. The worst. How come the person that comes in third on many of the networks is being covered like it's one of the great victories in the history of politics in this country. And the person that's not a professional politician, I'm a job creator, I build great companies, I build great buildings. I do a lot of great things. I've employed 10... I've... I don't do this crap. I've employed 10s of thousands of people over the years. I'm so proud of the company... I've built an unbelievable company. In fact, they went to check it. When I did the filing with the FEC, Federal Elections. They were... see all those cameras back there? Triple them. They were down there. Oh, they were going to find... they... first they said I'll never run, right? Then they said he'll never file Form A. Form A is where you sign your life away. You give up everything. The family, the dog, the house. You give up the world. They say he'll never file From A. Then they said, oh, filed Form A. Oh, he announced. They didn't believe it. Then they said, well, he'll never file his financials. And if he did, he'll ask for the extensions. Because you could get an extension that goes forever. I didn't want an extension. I told one of the big accounting firms, one of the best firms in the world, one of the biggest, most respected. I said, listen you got to get these done. I filed almost 100 pages. Bigger than anything ever filed with Federal Election, by far. You know these politicians, they put one page in and they need five extensions. OK? You know why? They're afraid somebody knows about the cash they've been taking. They want to be careful. OK? They want to be careful. They want to be careful. Politicians, all talk and no action. So, what happens... I love you too darling. So, what happens is, I go in, I file. And they come back and they say, I don't believe. The company's much bigger, much better. Some of the greatest assets in the world. Buildings in Manhattan, Bank of America building, big chunk in San Francisco. Some of the greatest assets. Turnberry in Scotland, where they play the British Open. So many different great assets. Doral in Miami Beach. Hundreds of acres of Miami Beach. You know Doral. So many. And they're looking and there's low debt. Very little debt. Almost no debt. So there's low debt, tremendous cash flow and some of the greatest assets in the world. And the number is through the roof. And I'm not saying that to be braggadocious. I'm saying because that's the kind of thinking we need in this country. Our country's going to hell. It's going to hell. So the press goes down and they see it and it was... it was such a dud. They were devastated. They thought they'd say, Trump isn't... you know, they all said I wouldn't file and I wouldn't run because maybe I'm not as rich as people think, right? That's what they said that. The hell was that? I'm wondering, this can only happen at a Trump rally. This can only happen... well, you know, that could be a way we get them to turn the cameras, right? And what the cameras don't have and what the press will never, ever, ever report is the crowds. They don't do it. They report it for Bernie. They said the other day, recently... I had 12,000 people, he had 3,000 people. They said, Bernie Sanders had an amazing crowd of 3,000 people. I had 12,000. When it's my turn to go, Donald Trump made a speech today... front of a crowd. It's unbelievable. I'll tell you what, it is so dishonest... and I have friends that are reporters and they tell me, they can't report the truth. They cannot report... they're told what to do. And if you happen to be on our side of the equation, for the most part, they're just very dishonest. I'll tell you, they're just very dishonest. So what I do like is, when that man holds up that sign... oh, by the way, I should reprimand him because, you know, remember when I took a lot of heat? Remember that? Somebody said something that wasn't that nice to our President and they said, Donald Trump did not defend the President. I wonder if he'd defend me? You think you he'd defend me? They can defend... So they said, Donald Trump did not defend the President. And I said, oh, OK. So, they said I should have defended him and I should have done something. So, sir, you're reprimanded. OK? But we're not throwing him out folks, right? We're not throwing... So I put it in these statements and they've been great. And I tell you because I probably would have filed them even if I didn't run. You know, it takes guts to run for President. It really does. It takes guts. It takes guts. Especially, you know, if you're a politician you run and you run and you lose and you win and you run. It's all they do. With us, it takes courage. But we needed one of us. We have to do it. We have to do it. There's so many things that are wrong. So I wanted to just tell you... and I feel so good... and by the way, while I have... because I have all those cameras. Good. I have to take care of a couple of things. OK? For the veterans, Carl Icahn, great business man. He'll... I'll put him in charge of negotiating with China. We'll stop their $500 billion trade deficit, I can tell you right now. I can tell you right now. But I have to say this. Good guy, tough guy, smart guy. That's the kind of people we want. He's worth billions of dollars, doesn't want anything. He'd love to represent us. He'd love... we put him in charge of, let's say China, let's say Japan, let's say one or two countries. Probably one, because we have some great people. We have the greatest negotiators in the world. We have the smartest business people in the world. We don't use them. We use political hacks. We use people that don't have a clue. We use people that got their job because they give campaign contributions to these guys. I mean that's how they get their job, and they don't give a damn about the country. they care about themselves. And that's not the way it's going to work. OK. Carl Icahn great businessman gave 500,000 to the vets. Now, this was when I was supposed to be up debating. Oh, big deal. This was when I was supposed to be up debating. We have Steve Roth, friend, gave 50,000. We have the Fisher family, gave 75,000. Richard LeFrak, gave 100,000. Donald Trump... did you ever hear of Donald Trump? Donald Trump gave one million dollars. We have a rich guy from New York City, a friend of mine. I can't believe it. This guy was the worst braggart I've ever seen. If he gave money he wanted his name up in lights, and all of a sudden he became like please, please don't tell my name, please. I'm saying, why? Guy's loaded, by the way. Why? He said, because I've changed. See, people can change. I've changed a little bit, right? People can change. I said, you really don't want it named? I'd like... so I said, look, if you don't want me to name it, I won't. So I just call him rich guy from New York City, one million dollars for the vets. OK? One of the great businessmen in this country, Mr. Phil Ruffin and his incredible wife, gave... from Las Vegas and lots of other places. He's got plenty of places. He gave one million dollars to the vets. Is that great? Ike Perlmutter from Marvel... you know, they do the great movies. I think he's got like five of the greatest grossing movies of all time. He's a great genius, his wife is incredible, Laurie. One million dollars to the vets. OK? Isn't that great though? And there are many more. There are many more. So I just want to tell you that that was such an amazing... it was just such an amazing thing. And I'd call these people, I'd say, could you give a half a million? One of them said to me... I said, could you give... these are really successful people. I said, could you give a half a million? He goes, no, I won't. I'll give a million. Ah, I said, OK, I'll take it, right? On behalf of the vets, I'll take it. So we have a lot of good things happening. So the whole experience in Iowa was great. The only problem is the press didn't treat me right. Instead of saying you did really well, you didn't do too much over there. I mean I'm focused here and I have been focused here. And South Carolina, by the way, very much. But they said... instead of saying unbelievable job, they said, Trump, eh, he did all right. It was a little disappointing. Now, third place was fantastic, but it was a little... So it was one of those things. So I had a good time. I learned a lot. I made a lot of good friends out in Iowa and they're really... they are great people. One other thing I have to say, because we're all... a lot of us are business people. We want to make our country great again, right? Such a great theme. Is that like... is that the greatest of all themes? That's what it is. Somebody said, what are you going to do for the country? And I said to myself, you know I have a lot of time here. This is a radio person. And we... by the way, do we have Howie Carr? He's around here someplace. Where's Howie? Where is Howie? Howie, where the hell are you? Is he a great guy? We love Howie Carr, right? We love Howie Carr. And who else do we love? We love Tom Brady. We love Tom Brady, right? We love Tom Brady and we love Coach Belichick. Don't worry. I'm telling you, he's the greatest coach. Don't, don't ever lose him. But Tom is a great friend of mine. He's a great guy. He said the nicest things about me. You know, in Massachusetts, my poll numbers went up like 25 points. They went up to 48 or 51 or some... because Tom Brady said Trump is great. That was good. You know, you don't often get too many people, that say something nice where it has a positive impact, but Tom is in that category, right? So where is Howie Carr? The legendary Howie. Because he's here. He's got that radio going. He has been so nice to me. Thank you Howie. We love you Howie. He's a good guy, isn't he though? So here's the final on that whole thing. In terms of money spent per vote, right? Right here, stats. Stats. Money spent for vote. I was almost the last in Iowa. There's something nice about that. You know, there's something nice about that. You know, as an example, on the campaign... now I'm going to spend a lot of money. It's all my own. I'm self-funded Can you believe this? And I'll tell you something folks. Let me just tell you, because I said it before, I told it to the press. They'll make it a big story probably. They always make everything... and then they change it, but that's OK. I told the press just... we had a press conference. I said, I'll be honest with you, I don't think that I have gotten the proper credit for the fact that I'm self-funding. I don't think it means anything to anybody. Really. I have turned down... if I wanted... you know, Bush has $128 million dollars he got. I mean, wouldn't he have been better off just taking the money or throwing it out a window or something? But if you look at... if you look at Ted Cruz, he's got tremendous money from the oil companies. He's going to be taking care of the oil companies. He's going to take care of Wall Street. Even though he didn't report his loans. He's going to take care of Wall Street. If you look at some of these people, all of them, they all have money. So... and it's all from Wall Street, it's from oil, it's from different things. Now, those people are 100% going to like a little puppet. They're going to take care of those interests. With me, I have no... but I just want to take care of you. I just want to do the right thing. But I said something at the press conference, and I don't think they knew what the hell I was talking about. Some are smart but some of these guys are dumb as a rock. And I mean... you know... you know, when this man lifted up the sign, I liked it for one reason. Because they had to move the cameras around to show the crowd. OK? That's the only way they see the crowds, is when we have... if we have protesters, I love it. In fact, sometimes I actually... thinking about doing it. I'm going to set my protesters up in corners of rooms. Because those cameras never moved from my face because they don't want to show how many people I have. They don't want to show... it's a movement. We have a movement going folks. We have a movement going. And I have to be honest, and I want to thank him before I just... before it's too late. But Scott Brown for him to come up and call and say, I love what you're doing, I love where you're going. He loves this area and he loves you people. For him to endorse me is a very important thing. So, wherever the hell Scott is... right? It's a very, very important thing. And I've had other great important... you know, just great ones. You know Jerry Falwell Jr., who's fantastic, Liberty University, the job he's done. Sarah Palin gave us a tremendous endorsement. Tremendous. And you know who gave me a great endorsement that you people are really going to like? Because everybody likes this, Sheriff Joe from Arizona. OK? Sheriff Joe. You know, when Sheriff Joe gives you an endorsement, you know you're the king of the border, right? You know, all these other guys that I'm competing against, they're all... and woman... they're all coming up. They're all coming up and they're saying... when I originally announced, I talked about illegal immigration. If I didn't bring it up... and did I take heat. If I didn't bring it up, it wouldn't even be a subject right now. And then, all of a sudden... and I was gone. I said, this can't be like this. You can't go on like this for months and months. No human being can take this amount of incoming. No human being. And they were just going after me and they said it's terrible. And then after about two, three weeks people start saying, you know Trump has a point. He has a point. Now they're coming. Then all of a sudden four weeks, five weeks go by. Then you see the kind of tremendous crime that's being committed by the people that come into our country illegally. Tremendous crime. Then you have the killing of Kate, beautiful Kate in San Francisco. Then you had the killing of Jamiel. The woman. You have the killing of the woman, a 65-year old veteran who was raped, sodomized and killed by the illegal immigrant. And that's three people. That's... you have to see what's going on. You have to see what's going... how bad it is. And not only that, the economy. And I want people to come into the country. But I want them to come in... they have to come in legally, right? Legally. They have to come in legally. So, we have all of these endorsements. They're incredible endorsements. But I do have to say, one of the gentlemen that I'm competing against... my wife is watching television the other day and she's listening to this guy, boring, falling asleep, OK? Falling asleep. It's like a sleeper. And he said... I won't use the name because I don't want to embarrass anybody. He said... he said, and we will build a wall. And she said, darling come here. Listen, he just said we're going to build a wall. Who the hell ever heard of building a wall except for me. So now they... they don't give us credit. When I said, in Iraq... when I said, take the oil, right? For four years I've been saying, take the oil. Then, after those horrible Paris attacks, all of a sudden they said, we will take the oil. The problem is they're four years late. And when I said take the oil, I meant take it. They mean blow it up. I mean take it. Take it and give some of the profits to our wounded warriors. Give some of the profits to the vets and the families that have lost people in Iraq. I've been saying that... I've been saying that for four years, take the oil, and you know it. And they just did it. They... but... but they're not doing it right. You know, they don't want to bomb the oil because it would be environmentally... it would be a pollution event. It would be an event of pollution, as they say. It will add to the carbon footprint. Now, do you believe this the way we fight our wars? Scott, do you think General Douglas MacArthur used to have the carbon footprint in mind when he bombed the hell out of... right? How about General Patton? Did he think... oh oh, the carbon footprint. General Patton, if you ever mentioned the carbon footprint, he'd smack you in the face and say, what are you crazy? No, I mean, I actually heard this. I'm not sure I believe it, but I think I believe it. They said one of the reasons we're not bombing the oil is because they don't want that pollution going up into the atmosphere. I mean, it's... the whole thing is ridiculous. Don't forget. We have a President that thinks that global warming... now there's many names. There's global warming, that wasn't working so well. There's... right? Climate change. There's extreme weather. The new one is extreme weather because how can you miss with extreme weather? Even if it's nice you say it's extreme because it shouldn't be this nice. You know, the global warming was really bad. It was just not working. Then they went climate change and that was better but extreme weather is like perfect. And we have a President that talks about the biggest enemy of the United States, right? The biggest number one enemy is... he calls it global warming. It's global warming. Climate change. No. One of those things. He doesn't know. Eeny, meeny, miney, mo. Whatever. Whatever the word... now, let... let me just tell you. So, climate change and the carbon footprint. So he says, for Christmas or whatever, he wants to go... Christmas, by the way, Merry Christmas. Don't you want to say Merry Christmas? Merry Christmas. Merry Christmas. We're going to bring Christmas back. We're going to bring it back. Merry Christmas, Happy Holidays. We're going to bring it back. You see, these department stores, you can't say Merry Christmas anymore. Don't shop there. You'll say Merry Christmas again very quickly, believe me. But for Christmas... but for Christmas or whatever he celebrates. He gets into a Boeing. A very, very old... it's called Air Force One. A very, very old Boeing 747, with the old engines spewing... spewing carbon and every other thing. I don't think it happens to hurt the air personally but that's OK. So these old engines are spewing into the atmosphere and think about the carbon footprint. But he's only going to Hawaii. So, he's going from Washington to Hawaii. He's going to play golf like so many times. You know, he plays more golf than people on the PGA Tour. You know that, right? They admire him. They say, if they could play that much, they'd be even better players. So he's taking the Boeing 747 flying to Hawaii. You know how long that is? Old engines. These are the big old engines spewing fumes. He's over there for two or three weeks playing golf. He then gets back, hops in the plane, flies back to Washington. Then he comes back and he talks about... global warming is our biggest problem. Somehow, I think that ISIS, Russia, Radical Islamic terrorists, right? China. This maniac from North Korea. Somehow, I think that that's a bigger threat than global warming right now. OK? Somehow. The only global warming we should be fearing folks is global warming caused by nuclear weapons, and if we're not smart, that's what's going to happen. We better get really tough, really smart, really vigilant or we're going to have a problem. We better stop playing games, believe me. We better stop playing games. So, we've become the policeman to the entire world. We take care of the world. They pay us peanuts. We take care of Japan. A lot of people don't even know that. I mention Japan, people go, we don't have... we have. Now, here's the deals we make. If we are attacked, somebody attacks us. Wouldn't you rather have Trump as President if we're attacked. Oh, we'll beat the shit out of them. Anybody attacks us... You know, interestingly, speaking of potential, because he hates Obama so much, Putin, he said Donald Trump is a genius and he's the real leader over in that country. And these people that I'm negotiating with all the time, these people on the stage with me, they said, you should disavow what Putin of Russia said. I said I'm not disavowing that he called me a genius. Are you crazy? Don't worry, I can't be seduced. But wouldn't it be nice? If you think about it, wouldn't it be nice if we actually got along with Russia and others, and we can use them to knock out ISIS with us, so that maybe we don't always have to pay for it. Knock the hell out of them but let them drop some of their bombs that cost a million dollars apiece. Let them use some of their weapons that cost billions and billions of dollars. Let them beat the shit out of ISIS also, right? Right? So crazy. By the way, I have to say thank you. Oh, I love... look at Al. Al, my number one vet. Hey vets, is Al taking good care of you? If he doesn't take care of you, I will say, Al, you're fired. Get out of here Al. Al's a great guy. He's become my friend. And I'm taking care of the vets. I told you before, we're gonna build our military so great, so strong. Nobody's gonna mess with us. Nobody's gonna mess with us. Don't forget, Jeb Bush and Hillary Clinton both, the same day they said, I don't like Donald Trump's tone. Now, that day three heads were chopped off in the Middle East, they're worried about my tone. But don't forget this, this is important. I'm the one that didn't want to go and raid Iraq, and beat the hell out of Iraq, because I said you're going to destabilize the entire Middle East. And that was Reuters in 2004 and before that. Reuters 2004, I said don't do it, you're going to destabilize. That's exactly what happened. We have destroyed... what happened is the Middle East is totally destabilized. Iran, which made one of the great deals ever, with $150 billion. They're going to make nuclear weapons. They're going to self-inspect. How about that? They're going to self inspect. Listen, we hear... here's our President. We hear you're making nuclear weapons. Would you please check the area and call me back tomorrow? President Obama, I give you my word. I give you my word. We have just self-inspected. We are not going to ever, ever make nuclear weapons in those areas. And then the guy's gone, right? Isn't sick? I mean, isn't it crazy? And then they have the other. Not only self-inspection but then they have the other, 24-day period. So, if we think they're making nuclear weapons, we have to inform them. The clock starts ticking maybe in a month or two months or five months before the 24 days kicks in, right? So this thing could go on forever. In the meantime, they clean it up. They say, oh, 24 days wouldn't be enough to clean up. Enough for me to clean up anything, 24 days, right? And... and... and paint the floor battleship gray. So when we walk in, we say, oh, nothing's happening here. So they get 24 days. This is the dumbest agreement I think I've ever seen. Done by your man, he's up from this area, Kerry. Is he the worst negotiator? I hear he wants to run for President if Hillary gets put in prison. That's what I hear. You know what? He can't run for President. That deal is so bad... boy would I love to run... just that one deal... I didn't even have to talk about how else he's messed up. That deal is so bad, would we love to run against Kerry? Just for the deal. All we have to do... we paid $150 billion for four prisoners, right? 150 billion. Now, the most amazing thing... you wouldn't have started... anybody in this audience... no, not anybody. About 95% percent. You would've walked in, you would've said, we want our prisoners back. This is like four years ago. This thing is the longest running deal I've ever seen. You would've said, I want our prisoners back. They would've said, no, no, no. You would have left, you would've doubled up the sanctions. They would've called you back almost immediately and they would have said take your prisoners, right? We have prisoners. Then you make sure the prisoners have landed. The prisoners now have landed... this is the art of the deal by the way. The prisoners have landed. Now you go in a second time and you say, fellas... you know, I like to take the lumps out. My father always used to say, son, you're too tough. Try taking the lumps out. I say, OK pop. So I'd like to be nice. So instead of saying we're not giving you $150 billion. You don't want to say it that way. Too tough. You know, too challenging. You say it this way, fellas we've got a problem. We owe $19 billion. Our stupid people in Washington just approved a budget three weeks ago. How about that budget? They're getting everything. You know, Obama's a horrible negotiator, except when it comes to negotiating with the Republicans. He's a genius at negotiating with the Republicans. He's horrible with Iran, with Russia, with China, with Japan. But with the Republicans, he gets everything he wants. We send these people there... you know, I don't mind the Democrats, because we know where they're coming from. But we send the Republicans there. They're going to get rid of Obamacare. They're going to get rid of 100 different things. They're going to cut the budget. They're going to balance the budget. They're going to do all these things, right?They go there. What happens? What happens? You know, I tell the story... they walk into the beautiful halls of Congress. They walk in and they see the Capitol building, and they look up and they see the beautiful ceiling, and they see the columns that go so high, beautiful marble, and they say Alice or Jim, Alice... let's use Alice for this one. Alice, we've arrived. We've made it. Now, we've made it. And then they say... they go in for a first vote. Do you approve an extension of Obam... right? Of who? Obamacare. Do you approve an extension of Obamacare? Yes sir. Yes sir. It's disgusting. It's disgusting. And by the way, I have been opposed to Obamacare from the day they conceived it and Ted Cruz comes out with an ad that I'm in favor of Obamacare. Can you believe this? Just like he did with Carson, where Carson... he said, left Iowa. He's out of the race. Vote for him. Did you hear about this one? He's... he said he left Iowa. Carson's a nice guy. Ben... so Ben is, all of a sudden, getting calls that he quit the race. These guys said he quit the race. He's gone. He's out. Send your votes to him. What kind of people are we dealing with, with these politicians? And made up... liar honestly... and made up stories. Made up stories. Everybody in here... many of you know me. From day one, I've been talking about, we're going to repeal and replace Obamacare from day one. Now, we're going to do it. We're going to do it. If you remember, so important, from day one I've been saying, repeal and replace Obamacare. I've been talking about the five billion dollar website that never worked for years, right? All of a sudden I see an ad or something, Donald Trump is in favor of Obamacare. And people are calling, oh, I thought you were against it. That's too bad. These are dishonest people, these politicians. These are worse than real estate people in New York, I'm telling you. No, no. These are truly dishonest people. Then he said, Ben Carson has quit the race the day of the election. Ben Carson... during a caucus. Ben Carson has quit the race and Ben didn't quit the race. In other words, Ben Carson quit and let me have your votes. What kind of crap is this? And then he makes up a thing that says... like it's on a government document, voter violation. It says on top. Just like it comes right out of government, municipal, voter violation. And it talks about... it gives grades F, F, F, F, you haven't voted. But it says you can go vote but you've got to go vote for him. And people are afraid, they think, oh, I'm in violation. I have to go vote. What kind of people are these people? And then the Attorney General in Iowa is investigated but by that time they're all gone, the election's over. What kind of people do we have running for office? No. It's honestly, really, really dishonest. And I think I know why. You know why? Because he was born in Canada. Was. Happens to be a problem folks. That happens. You watch, the Democrats... they've already said they're going to sue him. He gets the nomination, they're going to sue his ass off. Actually, they're going to sue the country but they're going to sue him. And that's a big problem. I wanted to mention one other thing because, in Iowa... while we're talking about Iowa. So, price per head per vote. Leading the pack, ladies and gentlemen, with the fabulous... He shouts out Bush. How did you know? So, Bush got 1% or 2%. Leading the pack, the man that spent the most money per vote, the legendary Jeb Bush. With a number of... this is per vote. No, but you're not so far off. $2,884 per vote. You know, you could've won the election. Just promise everybody 1,000 bucks and you could have won it. You would've save money, right? You would have won. You would've saved a lot of money. So Jeb Bush spent almost $3,000 a vote. That's got to be a record, right? Is that in the Guinness Book? Would you check the Guinness Book Of World Records? You have others with tremendous numbers. Marco spent a lot, almost $300 a vote. But at least he had a pretty good result. He came in third. No, no. He had a fantastic result. Unbelievable. Unbelievable. He came in third. The guy that came in second, oh, terrible night, terrible night. Terrible night. Dishonest people. Dishonest people. Look at these numbers. So hundreds and hundreds of dollars in the... in the... Jeb paid, you know, close to $3,000 a vote. So who's one of the lowest? I'm just about the lowest. Lowest. The great Donald Trump. Lowest. The great Donald Trump. By the way, I'm I'm very proud of the fact that I have spent less money than just about anybody else on the campaign. And I'm going to start spending a lot for two reasons, right? Number one, I don't want to take any chances. Number two, I feel guilty. Because when Jeb has now spent 119 million or some ridiculous number, and much of it is sort of earmarked to me, ads. They can't be very good, because every time he takes an ad, my numbers go up. It's a crazy deal. But... but... so I've spent... because, nationally, I'm leading every poll. In the state... I mean, honestly, other than Iowa, which was the weakest one I had. But, in the state, I'm leading the states. Leading here tremendously. But every single national poll I'm leading. And just about, I think, every state poll I'm leading. So I spent the least and I have the best result, right? Right? Isn't that nice? Now, others have spent, like Jeb, like a couple of others, they've spent the most and they have the worst result. How the hell can you put them in charge? Now, think of this. Think of this. We have a school system... we are getting rid of Common Core by the way and we are preserving... Education in the United States is the most expensive, per pupil, in the entire world, right? The most expensive in the entire world. And there is no second place because it's so much lower, it's ridiculous. Norway, Denmark, Sweden, China. These are like the top four or five places for education. We're number 30. I used to say 28, right? We just went up two notches. We're now number 30 in the world. We spend the most per pupil by far and we have the worst education by far. So we're now number 30 and we spend the most. Wouldn't it be nice if they did like Trump, where I spend the least and I have the best result? Wouldn't it be good? Wouldn't that be good? Now, so important. And that's what I mean, our budget. They said, we are working on the budget and we think, within 25 years, we can balance the budget. I said, 25 years? 25 years? These are serious people. They said 25 years to balance the... I'm talking about doing it relatively quickly, and I mean we're going to have a better country, we're going to better service. We're going to get rid of the waste, fraud, abuse. All of the... all of the waste. The disgusting waste and the fraud. You look at the Veterans Administration... take a look at what's happening in Phoenix, Arizona. It's one of the great fraudulent scams you've ever seen, the Veterans Administration. We're going to take such great care of them. What's going on is unbelievable. And we're going to make our country so strong and so solid. I said the other day we're going to make our country rich again and a woman said, Mr. Trump, that doesn't sound nice. I said, we can't be great unless we're rich. We're a debtor nation. That horrible budget I told you about a little while ago, that's worth two trillion dollars. That takes care of our border, letting everyone in that Obama wants to come in. That takes care of the Syrian refugees who we're never going to let in folks. I have a big heart but we're never letting them in. We don't know who they are, we don't know where they come from. It's not going to happen. It's not going to happen. And anybody... and anybody that comes in, I want everybody to know, we have to send them back. We cannot take chances. We can't afford it. We can't afford to make mistakes like that. You know we have the two people that were radicalized... probably she radicalized him, the married couple. How great. Who, in California, killed 14 people with plenty very badly injured in the hospital, right? We didn't know this. We didn't know anything about it. We had Paris, where they have the toughest gun laws in the world. The toughest. Because we're going to preserve our Second Amendment. We're not touching that Second Amendment. Unless we're going to make it stronger. Unless we'll make it stronger. So, Paris has the toughest gun laws in the world, right? The toughest in the world. You can't have a gun. Unless you're a bad guy, no problem. So these disgusting thugs walk in to various places and start shooting people. Boom, boom, boom. Move over, boom. 130 people dead. Many people so gravely injured that they will be gone. They're going to be dying. They're dying now. And other people are going to live a life but they're going to live a life in hell because they're so horribly injured. Now, if we had a few people in this room... I can look at them. That guy right there, he's a mean... and if we had a few other people... you, you, you... let me pick a woman. You. And if somebody had a gun on their belt or somebody had a gun wrapped around their ankle, and those bullets started coming at you or you see they were going to, and you shoot the hell out of them. Folks, that's the only form... it's our... it's our form of protection. You wouldn't have the carnage that you had there. How about the military base? Five great young soldiers, a gun free zone. One of the soldiers is a world class marksman one of the best in the world. They're all top of the line soldiers. They're told to disarm, take their guns, put them 200 yards away. Sealed. A whack job walks in... these five great beautiful soldiers. Tough, smart, tremendous future. This whack job walks in and blows them away. Kills all five of them. That was it. Because you know what? When these crazy people see gun free zone that's like saying candy to a baby, right? That's candy to a baby. So we're going to protect our Second Amendment. We're going to protect ourselves. We are not touching our Second Amendment. And it's under siege, they're playing now with bullets. They're playing now with magazines. They're playing with a lot. We are going to protect our Second Amendment. Remember that. So when I started and when this all began on June 16th, coming down the escalator, it was all about border protection. And speaking of border protection, Ann Coulter, she has been such a great help to me. Where is Anne? Where's our Anne? Where is our Anne?Anne where the hell are you? Stand up Anne. Oh, she is standing up. She is so great, right? Adios amigo. Is that right? Best seller, right? And... OK. She is so great. She has been so supportive of us. She wants border security. She wants people to come into the country legally. She wants people to come and they have to come in through a process. But there's nobody stronger on this subject. Is that right? And I love the book. I read the book. Go out and buy the book everybody, all right? Great person. She's a great... she's a great person. So when I started this whole deal. I just come down and I talked about that. I talked about Obamacare, repealing it. I talked about the military. I talked about the vets. I talked about Social Security, because we're going to save our Social Security. And I talked about trade. I talked about trade like nobody else could talk about trade. When Carl Icahn endorses me... and many of the best business men in the world, and women, they want to endorse me. I say, don't bother. Nobody knows who the hell you are. It's true. You know? Not like the great Scott Brown. Nobody knows who they are but they're the best business people in the world. So when they endorse me and we use them, good. I talk about trade. China is making a fortune off us. We can't do it. Vietnam, Japan, Mexico, both at the border and with trade. You got to see what's moving. Nabisco moving their big plant from Chicago into Mexico. Ford building one of the biggest auto plants in the world. Two and a half billion dollar auto plant in Mexico. What the hell are we doing? What are we doing? We're bringing back our jobs. Now we have a case, it's called corporate inversion. Where companies used to move, like from here to Florida or from here to Texas or from Texas to here. Now we have a problem. Now we have companies... they don't want to move to Florida. They don't want to move to Texas. They don't want to move to New Hampshire. Boy, have you taken a beating, by the way. You talk about companies leaving. You're like a prime example. What they've done to you is incredible. But we're going to bring them back. We're going to make it so they come back. So now we have corporate inversion. Where companies like Pfizer... Pfizer, great companies are moving outside of the United States because taxes are too high. By the way, my bill... and Larry Kudlow and so many others, they think it's great. I put in tax policy. Big, big cuts for the middle class. The middle class in this country has been decimated. Big, big cuts for business. Big. We are the highest tax nation in the world. Big, big cuts. Right now. And it's going to pass, it's going to go through. I get things done. That's what I do. I get things done. I deal with politicians all my life. We'll get it passed. We'll get it passed. So, I used to talk about that and then when we had that horrible event in Paris and we had the horrible event, as you know, in California... and we had many other horrible events. I brought up the fact that we have to now start talking seriously about radical Islamic terrorism. We got to talk about it. And I said it. And it was just like... happened with the illegal immigration. I said it, it was heat. Two weeks later everyone's coming over and now they're all trying to be tougher than me. Nobody can be tougher than me by the way. But they're all trying to be tougher than me. So now I talked about the whole situation. There is such hatred out there. When people are flying airplanes into the World Trade Center, when people are doing all of these acts... not just here. All over the world. And I have friends that are Muslim. They call me, they say, you have done a great service. There is tremendous hatred. You can not solve a problem like that unless you start talking about it. We have a President that will not even discuss it or talk about it or use the words. He won't say radical Islamic terrorism. It's real. It's a problem. And you can't solve the problem unless you're going to be able to talk about it. So we've had tremendous... I took a lot of heat and now everybody is saying, thank you so much. And it's under discussion. It's a big, big problem. And you know what? We're going to get it solved. One way or the other, we're going to get it solved. But we can no longer be the stupid country. We can no longer be the country that's led by incompetent people. We can no longer be the country that takes Sergeant Bergdahl, a traitor, a dirty rotten traitor and take him... and take him and swap him for five of the biggest killers that they have in the Middle East, that they've coveted and wanted for a period of at least nine years. So, think of it. We get Bergdahl and they get these five killers that are already back in the battlefield trying to kill everything in front of them, including us. We're not making deals like that anymore folks. We're not making deals like that. So, just to finish off, you have to see the cover of Time magazine last week. Amazing, amazing cover. Amazing writer. I never spoke to him. You know, I do better when I don't speak to the writers. When I speak to them they kill me. This was a Time... oh, give me that magazine. Throw that up here. Come here. Come on, just throw. Go ahead. Weak arm. That's OK. You have to go out, get this magazine. This talks about our movement. It's a movement. This talks about the movement. This is... you know, in the old days maybe they would have said silent majority. It's really not the right... it's really the noisy majority. People are angry. They're upset. They're... they're... they're just... they can't even believe that this stuff is happening. They can't believe it. We are going to make our country so strong. We're going to make it so just and we're gonna have a big heart. We're going to take care of people. We're going to take care of people. There are people that can't take care of themselves. We're gonna help people but we're going to make our country so good. We're going to start winning. We're going to win with health care. We're going to win with our military. We're going to win with our veterans. We're going to win with every single thing we touch. We're going to win against China in trade. We're going to win against Mexico at the border and with trade. We're going to win against Japan, where they send us millions of cars and we can't send anything of value back to them. We're going to start winning again. We're going to win so much and we are going to make our country. We are going to make this great, great country even greater. We're going to make America great again. I love you all. I love you. I love you. We love you. Thank you. Thank you. Thank you."}