{"id":459,"author":"Donald Trump","title":"Speech: Donald Trump Campaigns in Cedar Rapids, Iowa","date":"2016-02-01","link":"https://factba.se/transcript/donald-trump-speech-cedar-rapids-ia-february-1-2016","paragraphs":["What a great. Look at this. So beautiful. Well, I want to thank Sarah. First of all, having Sarah and her whole family, Todd, everybody. She's got a great family and she's a great woman and she really does love this country. So having your endorsements really means -- it's just so much, Sarah. Thank you very much.","And to have a crowd like this on our final day. Can you believe it? This is the day. This is the day we take our country back, remember that. This is the day we take our country back. So I got a little notice, in case you see the security guys, we have wonderful security guys they said, Mr. Trump, there may be somebody with tomatoes in the audience.","So if you see somebody getting ready to throw a tomato knock that crap out of them, would you? Seriously, just knock the hell -- I promise you, I will pay for the legal fees. I promise. I promise. There won't be so much because the courts agree with us too. What's going on in this country. So over the last period of time, this began, this journey on June 16th. Who would have known that it was going to turn out to be what it turned out to be? It's been so pleasurable.","I've seen so many people. I've gotten to know so many people. We have a movement and Sara alluded to it but we have a movement going, whether we go to Dallas, we have 21,000 people in the Mavericks arena, 35,000 people in Mobile, Alabama, 12,000 people the other night in Massachusetts. No matter where we go, we have incredible, incredible crowds that truly love this country.","And we are, in fact, going to take it back. You know our theme is Make America Great Again. It's very simple. It's very simple. And we're going to Make America Great Again. Now, you have to stick up for your rights in life. We were talking about this before with the group. And I wanted to debate so badly the other night, I wanted to go back but when people don't treat you properly, just like when they don't treat our country properly.","When Iran, after all, we did with the $150 billion, could you believe that? I can't even think about it. Iran, the deal we made. And then they capture our sailors, they put guns to their head. They make them sit in a begging position with their hands up. And the only reason they released them is because they wanted their $150 billion.","I mean, let's not kid ourselves. We have to develop and we have to get respect back for this country. We are not respected anymore. We've had leadership that's grossly incompetent. And it can't go on any longer. This is why on June 16th, I said I'm running, we're going to do something that's going to be so amazing.","And we are going to make our country great again. So with Fox and with the debate, and you know, we could have broken the record, they had 12 million, the record is close to 25 million, I was in that one, 25 million. We would have broken the record that night but we did the right thing. And frankly, Fox is great.","We're back. We're friends. All of that stuff. But I said I'm not going into that debate and we held something in lieu of the debate, I said, let's have a rally for the veterans, right? We love our veterans, right? And at that rally, we raised in one hour, $6 million. Is that good? So you know our veterans are not properly taken care of. It's a scandal.","The Veterans Administration is corrupt. It's incompetent. It's run so badly. We have veterans that wait six days for a doctor in a waiting room. Can you imagine? You go to a waiting room. You've done so much for the country. You were wounded. You're not feeling well. Something could be very, very -- I mean, you see what's happening with the -- something could be minor and you're waiting six days and it turns into be major.","So what we did, we raised this money, and we're giving it out. And we just gave out a check for $100,000 a little while ago. We're giving out another check and they can bring it up and we'll get it delivered, right -- it's Mulberry Street Veterans Shelter. They do an amazing job and we have been very careful.","We're giving this -- but bring it up there. So that's a great group of people and we have so many of these checks. They're all over the place. We're giving them out. This was in lieu. And by the way, the poll numbers just came down from New Hampshire, I went through the roof. I think they did it. They respect the fact that I -- that we stand up for our rights.","We have to stand up for the country and we have to stand up for our rights. So congratulations to Mulberry Street. We don't win anymore. Our country doesn't win. We used to win. We used to win plenty. We used to have great Generals. We used to have General George Patton, General Douglas MacArthur. We have the potential to have great Generals now.","You look at Annapolis and West Point, you look at the Air Force Academy, I know them so well. I know I'm all so well. We have great, young, brilliant people, but we don't have the right leadership on top. To think that ISIS -- oh, we're going to win. We're going to win so much. You're going to get so tired of winning.","We're going to win. We're going to keep on winning. It's true. It's true. We're going to keep winning. You're going to say, Mr. President, please, please, we can't stand it. We're winning too much. We can't. I'm going to say, I'm sorry, I'm not changing a thing. We're going to keep winning but we are not winning at all now.","But we're going to keep winning. We are indeed going to keep winning. We're going to win with trade. We're going to win with our military. We've got to build it big and strong and powerful. And you know what? Nobody's going to mess with us. It's the absolute cheapest thing we can do. It's the least expensive thing we can do. It's going to be big and strong and powerful again.","You know I have a friend, he's got a young son who's a great, great young man. He was over for two tours of duty. And I said how, how is the Middle East? How is it over there? He said it's so sad Mr. Trump, we have old equipment. The enemy has the good stuff. And I said, what are you talking about? He said, we give equipment to people that we think are on our side, a bullet's fired in the air, they run, the enemy goes takes the equipment.","And I talk about it all the time, 2,300 brand new armor-plated Humvees, Sarah, OK? Brand new, 2,300. I even say, how do you get them over there that many? And I thought it was a mistake. I figured they meant two or 20 Our wounded warriors, instead of losing their legs, their arms, worse, they're OK. They go for a little ride upward and they come down.","The best of, all gone. Taken by the enemy. Taken by the enemy. So we don't know who we're fighting for. We don't know how to fight anymore. We have Generals that go on television. They're always constantly on television. I don't want my Generals going on television and they talk. I saw one of them who's retiring.","They said what do you think of ISIS? Oh, they're very tough. They're very tough. I said what's he doing? What's he doing? You know you're talking about 30,000 people. What's he doing? Why is he saying that? It just emboldens them to do what they want to do. And we have to hit them so hard and so fast. They're cutting off Christians heads.","They're cutting off everyone else's heads. They're maniacs. We've got to hit him so hard and so fast and we're going to do it when I get in. And it's going to be over with quickly. We have to be unpredictable. You know, it's really, it's the system and the sys -- whoops. We have a protester. Oh, good. I hope we have a protester over there.","Camera, show them how many people are in this room. Get out of here, please. Get them out. Do you have a tomato? You can get them out. You know the story. I can't get the cameras to turn ever. And my wife Melania, who's here right now, in fact, come on up Melania. Come on up, come on. That's -- there's a true story.","So, now this is 100% true story, Melania. So great, such a great supporter. Unbelievable. She said, you know if you run I can't get the cameras to turn ever. And my wife Melania, who's here right now, in fact, come on up Melania. Come on up, come on. That's -- there's a true story. So, now this is 100% true story, Melania.","So great, such a great supporter. Unbelievable. She said, you know if you run you will win. I said, what do you mean? She's my poster. She turned out to be my poster. She said, people love you, and they respect you. If you run and actually run, she said, if you just say you're going to run they're never going to go with you because they're going to say it's never going to happen and it's not going to poll.","I said but I said it and they don't want to put it in the poll. She said you have to actually say you're going to run. And if you run, if you go out and actually run, you're going to win. So that's -- you know a lot of things have happened. But I have to tell you, she says to me, every time I come home. How big, how great was that audience?","Like in Dallas, the audience was unbelievable. There's a big stadium and it was packed in Mobile, so many places. Oklahoma, 20,000 people. And I'll say, did you see that crowd? She'd say, no, didn't see it. Didn't see it. Why? They never showed it. All they do is show your face. They never show the crowd.","And the only time they show the crowd is when there's a protester. So I love our protesters. And I actually thought, I actually thought 100% that these cameras, you know, their new beautiful -- look at all those networks back there. Look at all those lights on every one of them, every time I make a speech it's live.","I'd rather make speeches someday when it's not live. But you know what? Those cameras, I thought they were fixed, like, they couldn't turn because they never move. And then one day, we had a protester not so long ago. Rough guy. Big, big voice, sounded like Pavarotti. And he was throwing punches. He was swinging and he was hitting people, throwing punches.","And I was rough. I said get him out of here -- it was much louder than that. Get him out. Get that guy out of here. Beat the hell out of him. Who cares. And I'm screaming. And the next day -- this guy was a bad guy. He was a rough cookie. And then security took care of it. By the way, the police, the most incredible people, right?","Our police. We love our police. We love our police. Like our veterans, the police are not being treated properly either. I tell you what. They're not being treated properly. So they took this guy out and I was rough. And the next day headlines, Trump was horrible and abusive and this. All right. Next day, I'm making a speech and there's another protester.","And I said, please don't hurt him. Easy. Don't work, bah, bah. The next day in the newspapers, Trump's really not as strong as we thought he was. Maybe he's weak. But it is true. What happens, I go home and say, did you see the crowd? And Melania would say, no, I didn't see any crowd. They just keep it on your face.","And I said, Isn't that a shame? They purposely -- we have the biggest crowds there are. Bernie Sanders has -- by the way, he's second, in all fairness, oh, I'd love to run against him, oh. Can you believe it? To run against the communists in this country. I just don't know. I would love -- no, I'd love that.","Wouldn't that be great? And I have Sarah up here. We will have a lot of fun but I would love to but I think I might rather run against Hillary, right? I think, there'd be something really good about that. But the question is whether or not she's going to be able to run. So with Melania, I don't know. He's got a big, he's got a big question going.","So every night, so I'd say finally, I say you know what honey you're coming, I'm going to introduce you to the crowd. This is an incredible crowd. By the way, caucus tonight, Ivanka is going to be in this room. She's going to be my representative, who's standing right here, Ivanka can come up. Melania, say a few words come on.","Thank you, honey. This is so nice, you know, this is like the last speech before the big event. I'm going to go home. I'm going to let Ivanka really work up here tonight. She's staying right here because in this room, at 7 o'clock, she's going to convince everybody to caucus properly meaning Trump, right?","And if she doesn't do a good job, I'll say, Ivanka you're fired. So we're going to have a good time. Ivanka, say a few words, honey.","You know, this is a little like when I graduated from college or high school. It's over in terms of Iowa. For a little while, now we're going to be back for the General, OK? We're going to win the General. We're going to beat Hillary so bad. I'm telling you, we're going to beat her badly. Because I still think it's going to be her.","Because I think, basically, Sarah, I think you agree. I think the Democrats are protecting her. Do you agree with that? I think they'll find all sorts of things, all sorts of illegalities, it's already been found. I mean, how many lawyers have to go on television to say, she's guilty, guilty, guilty. They know the facts.","So it's gonna be very interesting to see what the Democrats do. They have a big problem on their hands. It's a tough, tough problem but one way or the other, we're going to do some big victories. You know when they go over the recent polls where I'm beating Hillary fairly substantially, but even more important, because it's a long way off.","I think we will win states that are not in the Republican view. For instance, for instance, numbers came out the other day really great in Michigan. Well, we're not going to win Michigan. The other people are not going to win Michigan. It's going to be, you know, you have your little formula. You have to win all six of -- six states.","I really think we have a lot of margin and I think we'll win those six anyway but we're going to win Michigan. We're going to win Ohio. We're going to win Florida. You know in Ohio and I like Kasich, I like him. But in Ohio, in the poll, I'm leading him by a lot, right? And then in Florida, I'm at 48 and Marco, who I also like, is at 11, and Jeb Bush.","He says low energy. Did any phrase ever hit a human being like low energy hit Jeb? Boy, you know he's spent -- the only reason I don't feel badly about it. He's spent $20 million, $25 million on negative ads on me, $25 million, I say, who is this guy? What's he doing? He's got to beat all these other people before he gets to me. He should go after them first and he goes after almost everybody.","He's got $128 million to waste. Wouldn't it be great to give that to the veterans groups? I mean, instead of wasting it, instead of wasting it. So I think we're going to win states that were never in the vocabulary. They were not going to be won by any Republican and you know, you look, and you just look at the kind of poll numbers.","When Florida is at 48% and that's 48%, a study came out the other day, a poll of sorts, said that Trump does great with the African-American community. And I know I do. I knew that. And they actually come up with a number of 25% and they said, you know, if Trump got 25%, no Republican gets more than 6% or 7%. They said, if Trump got actually 25%, the election's over.","It's actually over. You have yourself a Republican and you have somebody that's going to do a great job for you. And we're going to do great because we're going to bring back jobs. We're going to bring them back from China. We're going to bring them back from Japan. We're going to bring them back from Mexico who's doing a big number on us. I love Mexico, I love the Mexican people but their leaders are too smart for our leaders.","They're too cunning for our leaders. Their leaders are doing an unbelievable job. I wish our leaders could do the same job to other countries. But again, we don't win. We never have victory. So we're going to change that. You look at China. Take a look at what's going on and I talk about -- because that's really -- they have got us figured so beautifully.","And then, they come over, they're leaders come over, we give them fancy state dinners, we roll out the red carpet, you got to talk. You've got to negotiate. You don't have to have these dinners that last for seven hours. You got to talk and you got to negotiate and you've got to get him back on track. They're devaluing their currency which I don't think Obama even knows what the hell it means.","They're devaluing their currency. They make it impossible for our businesses to compete. Impossible. And again, I don't blame them. The largest bank in the world is a tenant in one of my buildings in Manhattan, OK? The largest in the world. They definitely pay their rent on time. I want to tell you. They are so big.","You talk about a bank too big to fail. This bank blows everything away by many times. So I have the biggest bank. I sell condos to these people for millions and tens of millions of dollars. Everything is good with China. The problem is their leaders are too smart and too cunning for our leaders. Our leaders can't handle them.","And what's happening is when they start devaluing, you know, when they devalued about six months ago. They devalued -- the largest devaluation they've done in two decades. And I said, wow, that's amazing because we figured that was the end of it. But we have so many other problems, and we have people that don't understand the art of negotiation.","But I do. Oh, they're not doing it with us don't worry. So beautiful, that was so cute. Thank you. Will you give her a hat, please. Give her a Make America -- That was so -- what timing. But they don't understand it. So what's happening is our country is being eaten away. Now, this is by everybody.","But China is the king when it comes to this. Now, what's happened is in the history of the world, there has never been a greater theft than what China has done to our country, the USA. There's never been anything like it. We have rebuilt China. We've rebuilt their roads, their bridges, their tunnels, we've rebuilt everything.","They've taken out so much money. And Boeing as an example, they make an order for planes, they want it built in China. They want all of the intellectual properties. They want all of the rights. This isn't like a normal situation. We have to stop it and we can stop it because we pull the cards. What people don't understand is we have all the cards but we're using people to negotiate that are political hacks.","They have no talent. They're not businesspeople. We have the greatest business people in the world. The greatest, many have endorsed me, Carl Icahn just endorsed me. You know Carl. And if we used a Carl Icahn or look, I know most of them, the greatest. Some are horrible people. Some are miserable, disgusting people that Sarah Palin would never, ever have dinner, she'd say, who is this person?","I never want to see him again. But who cares, Sarah. They're the best negotiators in the world. Those are the people we want, right? So you're OK with one quick dinner? We'll make it a McDonald's or something. Hey, they don't want to have dinner either. They just want to work. That's all they want to do. These are the greatest negotiators in the world.","I know them. I want them representing us with China, Japan, Vietnam, a new one that's really just killing us. They're going to represent us. We're going to make our country rich again before we can make it great again. A woman came over to me and a lovely woman recently, at one of the events, and she came over and she said, Mr. Trump, I really, really like you but two things.","Number one, are you nice enough to be President? I said honestly, I think I'm a really nice person. I love people. I love helping people that's why I'm doing this. We're going to straighten out the country. It's such a mess. I said, I really think I'm nice, but I don't think it matters that much anymore.","I think people want competence. They want toughness. They want straightness. They also want heart because we're going to get rid of Obamacare, and we're going to repeal it and replace it with something that's so good and so much less expensive. And we want to have heart and we want to take care of people.","We have to take care of people. So she said that -- she said, OK, I can understand that. I said, it really isn't about niceness, but I think I'm a nice person. Then she said but I don't like when you say you can make the country rich again Mr. Trump. Now, this was obviously, a pretty naive woman. In all fairness, as I tell the story, so you know I liked her a lot but it's pretty naive.","I said look, here's the story. It may not sound great and it may not sound even politically correct which is a good thing, not a bad thing because this poli -- political correctness is out of control, totally out of control. But I will tell you this, we right now, in terms of everything that we're doing, we're going to do, we're going to make our country rich as hell.","We're going to take it back. We're going to create all of these things that we've created. We're going to get rid of the regulations. I have so many people and small businesses, people that have farms, people that have -- where a little puddle forms and they consider it a lake, and you have to get environmental impact studies to get rid of your puddle.","They say it's absolutely impossible. So we're going to bring it back to where it was. We're going to make it strong. We're going to -- we're going to be competitive again. We're going to go with my tax plan. We're going to make our country rich as hell and we can't do anything else. Once we make it rich it becomes great.","But right now, we're a debtor nation, $19 trillion, going now because of a really horrible budget just to prove -- by the Republicans in -- one day it's going to be $21 trillion. So we're going to make our country rich. We're going to make our country great. We're going to do all of these things. And whether to start winning big on trade, we're going to start winning big, and we're going to create borders that are as good as any borders anywhere in the world.","They're going to be strong. They're going to be powerful. They're going to be amazing. And then, we're going to build a wall and the wall, and this is a real wall. This isn't a wall that's, you know like, the little walls we have where they drive the trucks over. I even say, you ever see the pictures I saw one today?","They have a wall and they just build a ramp and they drive the trucks over it, loaded up with drugs. So we get the drugs and they get the cash, comes back. Hard to believe. They build ramps right over these little walls. The walls I build -- Do you see that ceiling? Figure quite a bit higher. These are walls that if somebody gets up there, they're not coming down very easily.","Nobody's getting up there. We're going to have real Border Security, and people are going to come into our country, but they're going to come in legally. They're going to come in legally. We're going to have a country again. So, all of these elements we're doing, it's not that hard. We can't continue to go this way because we won't have anything left.","But it's not that hard. When they say it's going to take 25 years to balance our budget and you hear it, the politicians, they're all talk and no action. They'll never get it done, folks. I dealt with the politicians beyond anybody. Nobody knows politicians better than Donald Trump. I will tell you. They are all talk, they're no action.","They're good for one thing, getting re-elected over and over again, using people's money from their lobbyists, from their special interests, using people's money, and it's not going to happen anymore. You know a lot of times, you see, you see these really dumb deals, and you'll say, that's dumb. It doesn't make sense.","But then, when you think, it does make sense because these politicians are representing interests whether it's a country or a company where doing those stupid deals actually makes sense only for that politician, and for that company or country, OK? Those deals are done. I'm self-funding my own campaign. It's my money.","It's my money. I'm putting up my money. And remember this, so far, I have spent very little money, very little. I'm going to start spending. Two reasons: number one, I feel guilty. Number two, I don't want to take a chance. It's true. Sarah, I feel so guilty. When you have a guy like Jeb Bush that spent over $100 million and he comes out, and he's like down at the bottom of the totem pole, and I'm No. 1, and I've spent almost nothing.","I spent very little, very, very little. And I don't want to brag about that because I want to spend money. I want to spend it but it's hard to spend it because they give me so -- look at all those cameras. Nobody else has that. They give me so much time on television so they'll have a 15-minute segment, Trump, Trump, Trump, this Trump that, Trump that.","Then they stopped the segment they go, we'll be back with Trump on something else unrelated right after the commercial. So then I say man, how can we put a commercial that go Trump, Trump, Trump, Trump? So I was going to -- at this point to this day, virtually exactly, I was going to have spent $40 million and I spent almost nothing.","I spent almost nothing. But now, you notice I'm doing commercials, I'm spending. I want to spend because we don't want to take a chance. But think of it. Our educational process is so bad. You have Norway, Denmark, Sweden, China, these are the top of the pack. They have the best educational systems in the world according to the various lists, right?","We're number 28, 28 in the world. We have third world countries that are ahead of us, but cost per pupil, we're number one by far. So we're way, way up. In fact, number two doesn't even exist. It's such a difference. So we spend the most money like Jeb and these other people. We spend the most money up here but we're down at the bottom of the totem pole over here.","Wouldn't it be nice, if and I'm not just relating this to education? I'm relating it to a lot of things. I'm relating it to everything. Wouldn't it be nice, if we could spend the least and have the best result? Wouldn't that be nice? Wouldn't that be great? So, we're going to do that and we're going to do things where other people respect us. As an example, we protect and most people don't even know this, and I've really become somewhat of an expert on it. I will tell you because it's such common sense.","We protected Japan making a lot of money, by the way, Abe. Their new prime minister doing an unbelievable job. Do you know who he negotiates with? Caroline Kennedy. Do you believe it? They have Caroline Kennedy on 60 Minutes. I was on 60 Minutes with Putin. We were stablemates. We didn't do it together. They did Putin and Trump and we got one of their highest ratings.","I'm very -- so now I like Putin. Now, Putin called me a genius by the way. He said Donald Trump is a genius and he's the absolute leader over there and he's the smartest person. And my Republican opponents said you have to refute that. I said I'm not refuting it when somebody calls me a genius. Why would I refute it? Why the hell would I refute that?","But then I said it myself, wouldn't it be nice if we actually got along with Russia, and we got along with some of these countries, and we let Russia knock the hell out of ISIS also? I mean, that's not so bad. It's not so bad. But you look at the different things and the different countries that we've got throughout the world.","We're not respected by anybody and yet, they all take advantage of us. It'll be just the opposite. I have a friend and I tell the story all the time. He's a great contractor, excavator, one of the biggest. He digs foundations. A big guy, made a lot of money, has a great company, and he bought Komatsu excavators, a tremendous order of Komatsu, not Caterpillar.","By the way, take a look at Caterpillar stock, folks. And I told this story a year ago and anybody that really listened would have sold their Caterpillar stock, but he bought Komatsu. And I said, what's wrong? He looked unhappy. I told my wife, I told Melania. I said, you know, he's like unhappy because all his life he bought Caterpillar.","He said it was impossible to compete. They so devalued the Yen in Japan that -- and they came at me the government, everybody. They wanted me to buy -- and I have an obligation to my wife, to my family, to my company, to my employees, I have to buy what's right. The difference was so much, I said which is better at companies and Caterpillar is better, but the other's good.","It's fine. But I had an obligation and he was very, very upset about it, and I thought about it and I said, gee, that's really -- and I told the story you -- some of you have heard this story. This was like a year and a half ago, I told that story. And if somebody would have done a short on Caterpillar, they would have been very good because just based on that story it didn't make sense.","So 60 Minutes does a story on Caroline Kennedy and it's the most incredible thing you ever saw. And they said, how did you become the Ambassador to Japan? And she's a very nice person. Do you know why I say she's nice? Because my daughter Ivanka likes her, that's why. Anybody that my daughter Ivanka likes, I like, OK? That's a father.","But they said to Caroline Kennedy, and you can look this up, and you'll see it. I got all those cameras back there, they'll be checking it out, but you'll find them. They said, how did you become the Ambassador to Japan? She said very meekly, very nicely, but meekly she said, well, I wanted a job, I had nothing to do, so I went to the White House and I said, do you think you could perhaps find something for me to do? Could you get me a job?","And they said, would you like to be the Ambassador to Japan? And she said, really? OK, so now you carry it forward a couple of years and they're doing a story on her, and they have Abe, and they have all these Japanese guys, the top guys, wining and dining her, and giving her big celebrations, and doing a whole big number, and I said, oh, it's so sad.","It's so sad. I want one of my killers negotiating. I want one of our people negotiating. I don't want Caroline Kennedy negotiating. I don't want her. So another story was China because trade is so important. It so important. It's sucking the blood. China's taken so much from us. They've taken our money, our jobs, so a friend of mine is a great manufacturer, manufactures various products, and you know, you always hear about China and no tax at all this.","So China sends this stuff over here. We let them in. No tax, no problems, no nothing. And I am a free trader by the way, just so you understand. I believe -- but it's got to be fair. So my friend who manufactures great product better than what they make, cannot get his product into China. Finally, after years he gets it in and they charge a massive tax which they call a tariff.","Massive. I said, can I tell the story? He said I don't care. Tell the story. He said, they are brutal to do business with. They're absolutely impossible, and hence, we have a $500 billion a year trade deficit. We cannot continue to have that happen. Now, when I announced that I was going to run for President it takes guts, believe me. I never did this stuff before.","I create jobs. I do great buildings. I do a lot of stuff. I've created an unbelievable company. In fact, a lot of people said, he won't run because he just wants a good time. I don't -- it's not a good time. I love you people. I can think of something else to be doing right now, OK? Thank you, doll. I love you.","But, but I said, you know what? We have to do it. I don't even know if we have a choice. I see the people that are running. I know the people that we're running. We don't even have a choice. But when I did this it was different. I said I'll do it quickly, it wasn't going to happen so -- standing -- among the most dishonest people in the world are the people that are standing by those cameras.","I tell you what. The media. Totally, totally, totally dishonest. At least 75% to 80%, you might have 20%, probably 5% is really good, but 20%, 25%, OK, but very dishonest group of people. But you know what? We had to do something. We had to do it fast. If we didn't do it quickly, it wasn't going to happen.","So I'm standing at the top of the escalator with Melania. I took a deep breath. I looked down at Trump Tower. It was like the Academy Awards, there were so many cameras, and I said, is this true, honey? I said let's go. It's not something I really -- I mean, I had to do it but it wasn't that I wanted to do it. And everybody said the pundits all said, oh, he's not going to run.","He's just toying, he's just doing this, he's just trying to build up ratings for The Apprentice, which by the way, they want to renew for two more years, and I turned them down because of this. Steve Burke, a great guy, came up to my office from Comcast, great guy, and he wanted to renew for a long time, for as long as I want.","And now, we have Arnold Schwarzenegger. By the way, how well Arnold do on the show? Arnold Schwarzenegger. Will he be as good as Trump? No? He better be because I have a big chunk of that show. So we'll find out. It's, it's gonna be very interesting. So I come down the escalator and you remember, I'm waving, and I say what do we do? And I brought up illegal immigration and you wouldn't even be talking about illegal immigration had I not brought it up at that particular event, OK? You wouldn't even be talking about it. And I talked about other things but illegal immigration, turned out, and boy did I get -- remember Rush Limbaugh, he said, Donald Trump received more incoming than any human being I've ever seen.","And he was right. So what happened is I come in and man, was I being hit for three, four weeks. In fact, I said am I going to have to go like this for like a year? Do we get this whole thing done and win? And I said, boy, this is like, brutal. And then, about two or three weeks later, they started coming my way, and all these candidates started saying, well, you know, because they were seeing what was happening.","Because almost from the time I announced, I'd been number one on the polls and it was immigration. But it was also other things. It was toughness with ISIS. When CNN did their poll, who leads with ISIS? Trump. Who leads with security? Trump. Who leads on the border? Trump. Who leads with the economy? Trump.","But I don't mean a little bit. I mean, like, I was at 60 and 70, and 50 and 40, and they were at 2 and 1, and forget it, and I said, wow, that's really amazing, but we brought up things. And then you had Paris and you had 130 people killed by animals. And that the press called the mastermind, remember the mastermind?","They said, oh, the mastermind is still loose. I said, don't call him a mastermind. Call him the guy with the filthy, dirty hat who's probably a low-IQ guy. Call him a bad guy. He's not a mastermind. You know they're using our internet. They're using the Internet. To radicalize our youth. And they do that because these guys call a masterminds -- what he called that guy -- I have got and I have to tell you, I went on a rampage for about a week saying don't call him master -- I haven't heard that anymore.","They don't do that anymore. You can't -- you know, you're building, you're playing right into their heads. They're promoting. They're good promoters. ISIS is a good promoter. And when these kids leave our country and they join ISIS, and then we allow them back in our country, we're never going to do that again.","Day one, they leave, they fight for ISIS, they're gone, they never come back. They never come back. So what happened is we're coming down the escalator and I talked about trade, and I talked about Mexico, and I talked about a lot of different things because everybody's taken advantage of us, and we're losing a fortune, and we're just being destroyed.","And then all of a sudden you have Paris, and then you had as you know, recently in Los Angeles, say a similar thing. We had 14 people killed, other people by the way in the hospital, with Paris it's 130 people, and it's people that are in such bad shape in the hospital that there are many more going to die, and some wounded so badly that you wouldn't believe.","And remember this, Paris has the toughest gun laws in the world. France has among the toughest gun laws in the world. You can't have a gun unless you're a bad guy, in which case, you can have all the guns you want. So in Paris or in Los Angeles, if we had a few of these people, like you or you or that tough cookie, looks like he could be a very good shot, right?","If we had a few people in those rooms that happened to be carrying guns because we are going to protect our Second Amendment remember that. But if there were people in those rooms, you know, in the case of Los Angeles, I mean, they actually threw them a wedding party. They knew him. They were friends and they were still killed.","Just boom, boom, boom, nothing coming in the opposite direction. Now, if we had guns in that room where the bullets are coming in the opposite direction, you would not had the problem. You'd -- would have had a problem but they would have had a real big problem because they would have been gone. They would have been gone and they would have been gone fast.","So these people that talk about destroying our Second Amendment and chipping away like Obama, chipping away at it, like Hillary Clinton chipping away. She wants to do more than chip away. I mean, she wants, as far as I'm concerned, she wants to get rid of our Second Amendment. So that'll be a whole thing.","I guarantee you one thing, lots of things. Number one, Second Amendment, 100%, 100%, Second Amendment, so important. So important. And you need it. You need it today. You need it for protection. That's your last line of defense. You need it. You have to have it. And if you don't have it, we're not going to have a country either.","So many things and many institutions they're hurting. They are hurting Christianity. They're chipping away and fighting Christianity. You know, I came up the other day, and I said fairly recently at an event, I see the hatred, that total hatred, radical. Islamic terrorism. We have a President that refuses to use the words.","No matter what happens. No matter what happens. Even though it's 100% refuses to use the words. I said, we have to take a moratorium. We have to see what's going on. We have too much hatred. There's so much hatred. You see the danger and the problem that two young people that got married, that became radicalized have done, there's too much hatred.","Again, like what I did at the opening, I took tremendous heat. Two weeks later everyone saying, Trump is right. We have to study it. There's such hatred. He's the only one with the guts to say it. I don't want to say it. But they say he's the only one with the guts to say it. So I just want to thank everybody.","It's been so incredible. Iowa is an incredible place. It's just amazing. The people are amazing. But I have to say this, all over the country, they've been amazing. This is about the last speech that I'll be making in this position in Iowa. And it was special to me to come and do it, even though I had to drive through some pretty rocky, pretty rocky areas, right?","Pretty rocky stuff. But there was no way -- they said, you know Mr. Trump, I think based on the weather, you could probably get away with not making this speech. I said, are you kidding? I wouldn't even think about it, OK? So besides that, Sarah was here and if I ever had, I don't have the courage to not be here for my Sarah.","And Sarah again, I want to just say you, Todd, the entire family, you're spectacular peoples. Respected. You are so respected and there is a group of people, and it's a damn big group. They'll do anything for you. So stand up Sarah. I just want to thank you once again. Sarah Palin, everybody. So hopefully, we're going to have a great victory, and if we do have it, it's a very important -- I could say very easily, a lot of the news commentators, actually, some of whom I'm sort of friendly with a little bit, you get to know them.","They say, wouldn't you be better off if you just said we want to do well in Iowa? And I said, not really, I mean, I want to be truthful. I'm a truthful person. I want to win Iowa. I don't want to be do well. I want to win. I want to win. You know three weeks ago, I was 11 points down. Now, I'm seven or eight points up and there's been this tremendous swing.","And I really do, the Evangelicals have been incredible. The whole, everybody has been so incredible. So I could say -- I don't want to take the safe way. I want to win Iowa. It's going to send such a great message that we're not going to take it anymore.","We're not going to take it. We're not going to take it anymore. We're going to take our country back. We're going to Make America Great Again. We're going to be so happy. We're going to be so thrilled and we're going to be proud to say, we're from the USA and we are the best, and there's nobody like us. I love you all.","Make sure you caucus tonight. Make sure you all caucus tonight. We're going to have a tremendous victory. We love you. Thank you very much. Thank you."],"text":" What a great. Look at this. So beautiful. Well, I want to thank Sarah. First of all, having Sarah and her whole family, Todd, everybody. She's got a great family and she's a great woman and she really does love this country. So having your endorsements really means -- it's just so much, Sarah. Thank you very much. And to have a crowd like this on our final day. Can you believe it? This is the day. This is the day we take our country back, remember that. This is the day we take our country back. So I got a little notice, in case you see the security guys, we have wonderful security guys they said, Mr. Trump, there may be somebody with tomatoes in the audience. So if you see somebody getting ready to throw a tomato knock that crap out of them, would you? Seriously, just knock the hell -- I promise you, I will pay for the legal fees. I promise. I promise. There won't be so much because the courts agree with us too. What's going on in this country. So over the last period of time, this began, this journey on June 16th. Who would have known that it was going to turn out to be what it turned out to be? It's been so pleasurable. I've seen so many people. I've gotten to know so many people. We have a movement and Sara alluded to it but we have a movement going, whether we go to Dallas, we have 21,000 people in the Mavericks arena, 35,000 people in Mobile, Alabama, 12,000 people the other night in Massachusetts. No matter where we go, we have incredible, incredible crowds that truly love this country. And we are, in fact, going to take it back. You know our theme is Make America Great Again. It's very simple. It's very simple. And we're going to Make America Great Again. Now, you have to stick up for your rights in life. We were talking about this before with the group. And I wanted to debate so badly the other night, I wanted to go back but when people don't treat you properly, just like when they don't treat our country properly. When Iran, after all, we did with the $150 billion, could you believe that? I can't even think about it. Iran, the deal we made. And then they capture our sailors, they put guns to their head. They make them sit in a begging position with their hands up. And the only reason they released them is because they wanted their $150 billion. I mean, let's not kid ourselves. We have to develop and we have to get respect back for this country. We are not respected anymore. We've had leadership that's grossly incompetent. And it can't go on any longer. This is why on June 16th, I said I'm running, we're going to do something that's going to be so amazing. And we are going to make our country great again. So with Fox and with the debate, and you know, we could have broken the record, they had 12 million, the record is close to 25 million, I was in that one, 25 million. We would have broken the record that night but we did the right thing. And frankly, Fox is great. We're back. We're friends. All of that stuff. But I said I'm not going into that debate and we held something in lieu of the debate, I said, let's have a rally for the veterans, right? We love our veterans, right? And at that rally, we raised in one hour, $6 million. Is that good? So you know our veterans are not properly taken care of. It's a scandal. The Veterans Administration is corrupt. It's incompetent. It's run so badly. We have veterans that wait six days for a doctor in a waiting room. Can you imagine? You go to a waiting room. You've done so much for the country. You were wounded. You're not feeling well. Something could be very, very -- I mean, you see what's happening with the -- something could be minor and you're waiting six days and it turns into be major. So what we did, we raised this money, and we're giving it out. And we just gave out a check for $100,000 a little while ago. We're giving out another check and they can bring it up and we'll get it delivered, right -- it's Mulberry Street Veterans Shelter. They do an amazing job and we have been very careful. We're giving this -- but bring it up there. So that's a great group of people and we have so many of these checks. They're all over the place. We're giving them out. This was in lieu. And by the way, the poll numbers just came down from New Hampshire, I went through the roof. I think they did it. They respect the fact that I -- that we stand up for our rights. We have to stand up for the country and we have to stand up for our rights. So congratulations to Mulberry Street. We don't win anymore. Our country doesn't win. We used to win. We used to win plenty. We used to have great Generals. We used to have General George Patton, General Douglas MacArthur. We have the potential to have great Generals now. You look at Annapolis and West Point, you look at the Air Force Academy, I know them so well. I know I'm all so well. We have great, young, brilliant people, but we don't have the right leadership on top. To think that ISIS -- oh, we're going to win. We're going to win so much. You're going to get so tired of winning. We're going to win. We're going to keep on winning. It's true. It's true. We're going to keep winning. You're going to say, Mr. President, please, please, we can't stand it. We're winning too much. We can't. I'm going to say, I'm sorry, I'm not changing a thing. We're going to keep winning but we are not winning at all now. But we're going to keep winning. We are indeed going to keep winning. We're going to win with trade. We're going to win with our military. We've got to build it big and strong and powerful. And you know what? Nobody's going to mess with us. It's the absolute cheapest thing we can do. It's the least expensive thing we can do. It's going to be big and strong and powerful again. You know I have a friend, he's got a young son who's a great, great young man. He was over for two tours of duty. And I said how, how is the Middle East? How is it over there? He said it's so sad Mr. Trump, we have old equipment. The enemy has the good stuff. And I said, what are you talking about? He said, we give equipment to people that we think are on our side, a bullet's fired in the air, they run, the enemy goes takes the equipment. And I talk about it all the time, 2,300 brand new armor-plated Humvees, Sarah, OK? Brand new, 2,300. I even say, how do you get them over there that many? And I thought it was a mistake. I figured they meant two or 20 Our wounded warriors, instead of losing their legs, their arms, worse, they're OK. They go for a little ride upward and they come down. The best of, all gone. Taken by the enemy. Taken by the enemy. So we don't know who we're fighting for. We don't know how to fight anymore. We have Generals that go on television. They're always constantly on television. I don't want my Generals going on television and they talk. I saw one of them who's retiring. They said what do you think of ISIS? Oh, they're very tough. They're very tough. I said what's he doing? What's he doing? You know you're talking about 30,000 people. What's he doing? Why is he saying that? It just emboldens them to do what they want to do. And we have to hit them so hard and so fast. They're cutting off Christians heads. They're cutting off everyone else's heads. They're maniacs. We've got to hit him so hard and so fast and we're going to do it when I get in. And it's going to be over with quickly. We have to be unpredictable. You know, it's really, it's the system and the sys -- whoops. We have a protester. Oh, good. I hope we have a protester over there. Camera, show them how many people are in this room. Get out of here, please. Get them out. Do you have a tomato? You can get them out. You know the story. I can't get the cameras to turn ever. And my wife Melania, who's here right now, in fact, come on up Melania. Come on up, come on. That's -- there's a true story. So, now this is 100% true story, Melania. So great, such a great supporter. Unbelievable. She said, you know if you run I can't get the cameras to turn ever. And my wife Melania, who's here right now, in fact, come on up Melania. Come on up, come on. That's -- there's a true story. So, now this is 100% true story, Melania. So great, such a great supporter. Unbelievable. She said, you know if you run you will win. I said, what do you mean? She's my poster. She turned out to be my poster. She said, people love you, and they respect you. If you run and actually run, she said, if you just say you're going to run they're never going to go with you because they're going to say it's never going to happen and it's not going to poll. I said but I said it and they don't want to put it in the poll. She said you have to actually say you're going to run. And if you run, if you go out and actually run, you're going to win. So that's -- you know a lot of things have happened. But I have to tell you, she says to me, every time I come home. How big, how great was that audience? Like in Dallas, the audience was unbelievable. There's a big stadium and it was packed in Mobile, so many places. Oklahoma, 20,000 people. And I'll say, did you see that crowd? She'd say, no, didn't see it. Didn't see it. Why? They never showed it. All they do is show your face. They never show the crowd. And the only time they show the crowd is when there's a protester. So I love our protesters. And I actually thought, I actually thought 100% that these cameras, you know, their new beautiful -- look at all those networks back there. Look at all those lights on every one of them, every time I make a speech it's live. I'd rather make speeches someday when it's not live. But you know what? Those cameras, I thought they were fixed, like, they couldn't turn because they never move. And then one day, we had a protester not so long ago. Rough guy. Big, big voice, sounded like Pavarotti. And he was throwing punches. He was swinging and he was hitting people, throwing punches. And I was rough. I said get him out of here -- it was much louder than that. Get him out. Get that guy out of here. Beat the hell out of him. Who cares. And I'm screaming. And the next day -- this guy was a bad guy. He was a rough cookie. And then security took care of it. By the way, the police, the most incredible people, right? Our police. We love our police. We love our police. Like our veterans, the police are not being treated properly either. I tell you what. They're not being treated properly. So they took this guy out and I was rough. And the next day headlines, Trump was horrible and abusive and this. All right. Next day, I'm making a speech and there's another protester. And I said, please don't hurt him. Easy. Don't work, bah, bah. The next day in the newspapers, Trump's really not as strong as we thought he was. Maybe he's weak. But it is true. What happens, I go home and say, did you see the crowd? And Melania would say, no, I didn't see any crowd. They just keep it on your face. And I said, Isn't that a shame? They purposely -- we have the biggest crowds there are. Bernie Sanders has -- by the way, he's second, in all fairness, oh, I'd love to run against him, oh. Can you believe it? To run against the communists in this country. I just don't know. I would love -- no, I'd love that. Wouldn't that be great? And I have Sarah up here. We will have a lot of fun but I would love to but I think I might rather run against Hillary, right? I think, there'd be something really good about that. But the question is whether or not she's going to be able to run. So with Melania, I don't know. He's got a big, he's got a big question going. So every night, so I'd say finally, I say you know what honey you're coming, I'm going to introduce you to the crowd. This is an incredible crowd. By the way, caucus tonight, Ivanka is going to be in this room. She's going to be my representative, who's standing right here, Ivanka can come up. Melania, say a few words come on. Hello, Iowa. This is a very, very special night. And you're voting for your next President, the man who will work for you, who will work with you, and who is that man? I agree. He's the man. Good luck. Thank you. Thank you, honey. This is so nice, you know, this is like the last speech before the big event. I'm going to go home. I'm going to let Ivanka really work up here tonight. She's staying right here because in this room, at 7 o'clock, she's going to convince everybody to caucus properly meaning Trump, right? And if she doesn't do a good job, I'll say, Ivanka you're fired. So we're going to have a good time. Ivanka, say a few words, honey. Hi, everyone. It is so nice to be here and hopefully, I see all of you and then some back tonight. So that's -- that's when it really counts. My father has been working unbelievably hard his whole life. But now, he is dedicated to working unbelievably hard for each and every one of you. And people all over this great country. In order to do that you have to show up seven o'clock tonight. Be here and I have no doubt. And I can say without equivocation, my father will Make America Great Again. He will make you very, very proud, and he will exceed your expectations. So let's bring that to fruition and it all starts here. Thank you all, very, very much. You know, this is a little like when I graduated from college or high school. It's over in terms of Iowa. For a little while, now we're going to be back for the General, OK? We're going to win the General. We're going to beat Hillary so bad. I'm telling you, we're going to beat her badly. Because I still think it's going to be her. Because I think, basically, Sarah, I think you agree. I think the Democrats are protecting her. Do you agree with that? I think they'll find all sorts of things, all sorts of illegalities, it's already been found. I mean, how many lawyers have to go on television to say, she's guilty, guilty, guilty. They know the facts. So it's gonna be very interesting to see what the Democrats do. They have a big problem on their hands. It's a tough, tough problem but one way or the other, we're going to do some big victories. You know when they go over the recent polls where I'm beating Hillary fairly substantially, but even more important, because it's a long way off. I think we will win states that are not in the Republican view. For instance, for instance, numbers came out the other day really great in Michigan. Well, we're not going to win Michigan. The other people are not going to win Michigan. It's going to be, you know, you have your little formula. You have to win all six of -- six states. I really think we have a lot of margin and I think we'll win those six anyway but we're going to win Michigan. We're going to win Ohio. We're going to win Florida. You know in Ohio and I like Kasich, I like him. But in Ohio, in the poll, I'm leading him by a lot, right? And then in Florida, I'm at 48 and Marco, who I also like, is at 11, and Jeb Bush. He says low energy. Did any phrase ever hit a human being like low energy hit Jeb? Boy, you know he's spent -- the only reason I don't feel badly about it. He's spent $20 million, $25 million on negative ads on me, $25 million, I say, who is this guy? What's he doing? He's got to beat all these other people before he gets to me. He should go after them first and he goes after almost everybody. He's got $128 million to waste. Wouldn't it be great to give that to the veterans groups? I mean, instead of wasting it, instead of wasting it. So I think we're going to win states that were never in the vocabulary. They were not going to be won by any Republican and you know, you look, and you just look at the kind of poll numbers. When Florida is at 48% and that's 48%, a study came out the other day, a poll of sorts, said that Trump does great with the African-American community. And I know I do. I knew that. And they actually come up with a number of 25% and they said, you know, if Trump got 25%, no Republican gets more than 6% or 7%. They said, if Trump got actually 25%, the election's over. It's actually over. You have yourself a Republican and you have somebody that's going to do a great job for you. And we're going to do great because we're going to bring back jobs. We're going to bring them back from China. We're going to bring them back from Japan. We're going to bring them back from Mexico who's doing a big number on us. I love Mexico, I love the Mexican people but their leaders are too smart for our leaders. They're too cunning for our leaders. Their leaders are doing an unbelievable job. I wish our leaders could do the same job to other countries. But again, we don't win. We never have victory. So we're going to change that. You look at China. Take a look at what's going on and I talk about -- because that's really -- they have got us figured so beautifully. And then, they come over, they're leaders come over, we give them fancy state dinners, we roll out the red carpet, you got to talk. You've got to negotiate. You don't have to have these dinners that last for seven hours. You got to talk and you got to negotiate and you've got to get him back on track. They're devaluing their currency which I don't think Obama even knows what the hell it means. They're devaluing their currency. They make it impossible for our businesses to compete. Impossible. And again, I don't blame them. The largest bank in the world is a tenant in one of my buildings in Manhattan, OK? The largest in the world. They definitely pay their rent on time. I want to tell you. They are so big. You talk about a bank too big to fail. This bank blows everything away by many times. So I have the biggest bank. I sell condos to these people for millions and tens of millions of dollars. Everything is good with China. The problem is their leaders are too smart and too cunning for our leaders. Our leaders can't handle them. And what's happening is when they start devaluing, you know, when they devalued about six months ago. They devalued -- the largest devaluation they've done in two decades. And I said, wow, that's amazing because we figured that was the end of it. But we have so many other problems, and we have people that don't understand the art of negotiation. But I do. Oh, they're not doing it with us don't worry. So beautiful, that was so cute. Thank you. Will you give her a hat, please. Give her a Make America -- That was so -- what timing. But they don't understand it. So what's happening is our country is being eaten away. Now, this is by everybody. But China is the king when it comes to this. Now, what's happened is in the history of the world, there has never been a greater theft than what China has done to our country, the USA. There's never been anything like it. We have rebuilt China. We've rebuilt their roads, their bridges, their tunnels, we've rebuilt everything. They've taken out so much money. And Boeing as an example, they make an order for planes, they want it built in China. They want all of the intellectual properties. They want all of the rights. This isn't like a normal situation. We have to stop it and we can stop it because we pull the cards. What people don't understand is we have all the cards but we're using people to negotiate that are political hacks. They have no talent. They're not businesspeople. We have the greatest business people in the world. The greatest, many have endorsed me, Carl Icahn just endorsed me. You know Carl. And if we used a Carl Icahn or look, I know most of them, the greatest. Some are horrible people. Some are miserable, disgusting people that Sarah Palin would never, ever have dinner, she'd say, who is this person? I never want to see him again. But who cares, Sarah. They're the best negotiators in the world. Those are the people we want, right? So you're OK with one quick dinner? We'll make it a McDonald's or something. Hey, they don't want to have dinner either. They just want to work. That's all they want to do. These are the greatest negotiators in the world. I know them. I want them representing us with China, Japan, Vietnam, a new one that's really just killing us. They're going to represent us. We're going to make our country rich again before we can make it great again. A woman came over to me and a lovely woman recently, at one of the events, and she came over and she said, Mr. Trump, I really, really like you but two things. Number one, are you nice enough to be President? I said honestly, I think I'm a really nice person. I love people. I love helping people that's why I'm doing this. We're going to straighten out the country. It's such a mess. I said, I really think I'm nice, but I don't think it matters that much anymore. I think people want competence. They want toughness. They want straightness. They also want heart because we're going to get rid of Obamacare, and we're going to repeal it and replace it with something that's so good and so much less expensive. And we want to have heart and we want to take care of people. We have to take care of people. So she said that -- she said, OK, I can understand that. I said, it really isn't about niceness, but I think I'm a nice person. Then she said but I don't like when you say you can make the country rich again Mr. Trump. Now, this was obviously, a pretty naive woman. In all fairness, as I tell the story, so you know I liked her a lot but it's pretty naive. I said look, here's the story. It may not sound great and it may not sound even politically correct which is a good thing, not a bad thing because this poli -- political correctness is out of control, totally out of control. But I will tell you this, we right now, in terms of everything that we're doing, we're going to do, we're going to make our country rich as hell. We're going to take it back. We're going to create all of these things that we've created. We're going to get rid of the regulations. I have so many people and small businesses, people that have farms, people that have -- where a little puddle forms and they consider it a lake, and you have to get environmental impact studies to get rid of your puddle. They say it's absolutely impossible. So we're going to bring it back to where it was. We're going to make it strong. We're going to -- we're going to be competitive again. We're going to go with my tax plan. We're going to make our country rich as hell and we can't do anything else. Once we make it rich it becomes great. But right now, we're a debtor nation, $19 trillion, going now because of a really horrible budget just to prove -- by the Republicans in -- one day it's going to be $21 trillion. So we're going to make our country rich. We're going to make our country great. We're going to do all of these things. And whether to start winning big on trade, we're going to start winning big, and we're going to create borders that are as good as any borders anywhere in the world. They're going to be strong. They're going to be powerful. They're going to be amazing. And then, we're going to build a wall and the wall, and this is a real wall. This isn't a wall that's, you know like, the little walls we have where they drive the trucks over. I even say, you ever see the pictures I saw one today? They have a wall and they just build a ramp and they drive the trucks over it, loaded up with drugs. So we get the drugs and they get the cash, comes back. Hard to believe. They build ramps right over these little walls. The walls I build -- Do you see that ceiling? Figure quite a bit higher. These are walls that if somebody gets up there, they're not coming down very easily. Nobody's getting up there. We're going to have real Border Security, and people are going to come into our country, but they're going to come in legally. They're going to come in legally. We're going to have a country again. So, all of these elements we're doing, it's not that hard. We can't continue to go this way because we won't have anything left. But it's not that hard. When they say it's going to take 25 years to balance our budget and you hear it, the politicians, they're all talk and no action. They'll never get it done, folks. I dealt with the politicians beyond anybody. Nobody knows politicians better than Donald Trump. I will tell you. They are all talk, they're no action. They're good for one thing, getting re-elected over and over again, using people's money from their lobbyists, from their special interests, using people's money, and it's not going to happen anymore. You know a lot of times, you see, you see these really dumb deals, and you'll say, that's dumb. It doesn't make sense. But then, when you think, it does make sense because these politicians are representing interests whether it's a country or a company where doing those stupid deals actually makes sense only for that politician, and for that company or country, OK? Those deals are done. I'm self-funding my own campaign. It's my money. It's my money. I'm putting up my money. And remember this, so far, I have spent very little money, very little. I'm going to start spending. Two reasons: number one, I feel guilty. Number two, I don't want to take a chance. It's true. Sarah, I feel so guilty. When you have a guy like Jeb Bush that spent over $100 million and he comes out, and he's like down at the bottom of the totem pole, and I'm No. 1, and I've spent almost nothing. I spent very little, very, very little. And I don't want to brag about that because I want to spend money. I want to spend it but it's hard to spend it because they give me so -- look at all those cameras. Nobody else has that. They give me so much time on television so they'll have a 15-minute segment, Trump, Trump, Trump, this Trump that, Trump that. Then they stopped the segment they go, we'll be back with Trump on something else unrelated right after the commercial. So then I say man, how can we put a commercial that go Trump, Trump, Trump, Trump? So I was going to -- at this point to this day, virtually exactly, I was going to have spent $40 million and I spent almost nothing. I spent almost nothing. But now, you notice I'm doing commercials, I'm spending. I want to spend because we don't want to take a chance. But think of it. Our educational process is so bad. You have Norway, Denmark, Sweden, China, these are the top of the pack. They have the best educational systems in the world according to the various lists, right? We're number 28, 28 in the world. We have third world countries that are ahead of us, but cost per pupil, we're number one by far. So we're way, way up. In fact, number two doesn't even exist. It's such a difference. So we spend the most money like Jeb and these other people. We spend the most money up here but we're down at the bottom of the totem pole over here. Wouldn't it be nice, if and I'm not just relating this to education? I'm relating it to a lot of things. I'm relating it to everything. Wouldn't it be nice, if we could spend the least and have the best result? Wouldn't that be nice? Wouldn't that be great? So, we're going to do that and we're going to do things where other people respect us. As an example, we protect and most people don't even know this, and I've really become somewhat of an expert on it. I will tell you because it's such common sense. We protected Japan making a lot of money, by the way, Abe. Their new prime minister doing an unbelievable job. Do you know who he negotiates with? Caroline Kennedy. Do you believe it? They have Caroline Kennedy on 60 Minutes. I was on 60 Minutes with Putin. We were stablemates. We didn't do it together. They did Putin and Trump and we got one of their highest ratings. I'm very -- so now I like Putin. Now, Putin called me a genius by the way. He said Donald Trump is a genius and he's the absolute leader over there and he's the smartest person. And my Republican opponents said you have to refute that. I said I'm not refuting it when somebody calls me a genius. Why would I refute it? Why the hell would I refute that? But then I said it myself, wouldn't it be nice if we actually got along with Russia, and we got along with some of these countries, and we let Russia knock the hell out of ISIS also? I mean, that's not so bad. It's not so bad. But you look at the different things and the different countries that we've got throughout the world. We're not respected by anybody and yet, they all take advantage of us. It'll be just the opposite. I have a friend and I tell the story all the time. He's a great contractor, excavator, one of the biggest. He digs foundations. A big guy, made a lot of money, has a great company, and he bought Komatsu excavators, a tremendous order of Komatsu, not Caterpillar. By the way, take a look at Caterpillar stock, folks. And I told this story a year ago and anybody that really listened would have sold their Caterpillar stock, but he bought Komatsu. And I said, what's wrong? He looked unhappy. I told my wife, I told Melania. I said, you know, he's like unhappy because all his life he bought Caterpillar. He said it was impossible to compete. They so devalued the Yen in Japan that -- and they came at me the government, everybody. They wanted me to buy -- and I have an obligation to my wife, to my family, to my company, to my employees, I have to buy what's right. The difference was so much, I said which is better at companies and Caterpillar is better, but the other's good. It's fine. But I had an obligation and he was very, very upset about it, and I thought about it and I said, gee, that's really -- and I told the story you -- some of you have heard this story. This was like a year and a half ago, I told that story. And if somebody would have done a short on Caterpillar, they would have been very good because just based on that story it didn't make sense. So 60 Minutes does a story on Caroline Kennedy and it's the most incredible thing you ever saw. And they said, how did you become the Ambassador to Japan? And she's a very nice person. Do you know why I say she's nice? Because my daughter Ivanka likes her, that's why. Anybody that my daughter Ivanka likes, I like, OK? That's a father. But they said to Caroline Kennedy, and you can look this up, and you'll see it. I got all those cameras back there, they'll be checking it out, but you'll find them. They said, how did you become the Ambassador to Japan? She said very meekly, very nicely, but meekly she said, well, I wanted a job, I had nothing to do, so I went to the White House and I said, do you think you could perhaps find something for me to do? Could you get me a job? And they said, would you like to be the Ambassador to Japan? And she said, really? OK, so now you carry it forward a couple of years and they're doing a story on her, and they have Abe, and they have all these Japanese guys, the top guys, wining and dining her, and giving her big celebrations, and doing a whole big number, and I said, oh, it's so sad. It's so sad. I want one of my killers negotiating. I want one of our people negotiating. I don't want Caroline Kennedy negotiating. I don't want her. So another story was China because trade is so important. It so important. It's sucking the blood. China's taken so much from us. They've taken our money, our jobs, so a friend of mine is a great manufacturer, manufactures various products, and you know, you always hear about China and no tax at all this. So China sends this stuff over here. We let them in. No tax, no problems, no nothing. And I am a free trader by the way, just so you understand. I believe -- but it's got to be fair. So my friend who manufactures great product better than what they make, cannot get his product into China. Finally, after years he gets it in and they charge a massive tax which they call a tariff. Massive. I said, can I tell the story? He said I don't care. Tell the story. He said, they are brutal to do business with. They're absolutely impossible, and hence, we have a $500 billion a year trade deficit. We cannot continue to have that happen. Now, when I announced that I was going to run for President it takes guts, believe me. I never did this stuff before. I create jobs. I do great buildings. I do a lot of stuff. I've created an unbelievable company. In fact, a lot of people said, he won't run because he just wants a good time. I don't -- it's not a good time. I love you people. I can think of something else to be doing right now, OK? Thank you, doll. I love you. But, but I said, you know what? We have to do it. I don't even know if we have a choice. I see the people that are running. I know the people that we're running. We don't even have a choice. But when I did this it was different. I said I'll do it quickly, it wasn't going to happen so -- standing -- among the most dishonest people in the world are the people that are standing by those cameras. I tell you what. The media. Totally, totally, totally dishonest. At least 75% to 80%, you might have 20%, probably 5% is really good, but 20%, 25%, OK, but very dishonest group of people. But you know what? We had to do something. We had to do it fast. If we didn't do it quickly, it wasn't going to happen. So I'm standing at the top of the escalator with Melania. I took a deep breath. I looked down at Trump Tower. It was like the Academy Awards, there were so many cameras, and I said, is this true, honey? I said let's go. It's not something I really -- I mean, I had to do it but it wasn't that I wanted to do it. And everybody said the pundits all said, oh, he's not going to run. He's just toying, he's just doing this, he's just trying to build up ratings for The Apprentice, which by the way, they want to renew for two more years, and I turned them down because of this. Steve Burke, a great guy, came up to my office from Comcast, great guy, and he wanted to renew for a long time, for as long as I want. And now, we have Arnold Schwarzenegger. By the way, how well Arnold do on the show? Arnold Schwarzenegger. Will he be as good as Trump? No? He better be because I have a big chunk of that show. So we'll find out. It's, it's gonna be very interesting. So I come down the escalator and you remember, I'm waving, and I say what do we do? And I brought up illegal immigration and you wouldn't even be talking about illegal immigration had I not brought it up at that particular event, OK? You wouldn't even be talking about it. And I talked about other things but illegal immigration, turned out, and boy did I get -- remember Rush Limbaugh, he said, Donald Trump received more incoming than any human being I've ever seen. And he was right. So what happened is I come in and man, was I being hit for three, four weeks. In fact, I said am I going to have to go like this for like a year? Do we get this whole thing done and win? And I said, boy, this is like, brutal. And then, about two or three weeks later, they started coming my way, and all these candidates started saying, well, you know, because they were seeing what was happening. Because almost from the time I announced, I'd been number one on the polls and it was immigration. But it was also other things. It was toughness with ISIS. When CNN did their poll, who leads with ISIS? Trump. Who leads with security? Trump. Who leads on the border? Trump. Who leads with the economy? Trump. But I don't mean a little bit. I mean, like, I was at 60 and 70, and 50 and 40, and they were at 2 and 1, and forget it, and I said, wow, that's really amazing, but we brought up things. And then you had Paris and you had 130 people killed by animals. And that the press called the mastermind, remember the mastermind? They said, oh, the mastermind is still loose. I said, don't call him a mastermind. Call him the guy with the filthy, dirty hat who's probably a low-IQ guy. Call him a bad guy. He's not a mastermind. You know they're using our internet. They're using the Internet. To radicalize our youth. And they do that because these guys call a masterminds -- what he called that guy -- I have got and I have to tell you, I went on a rampage for about a week saying don't call him master -- I haven't heard that anymore. They don't do that anymore. You can't -- you know, you're building, you're playing right into their heads. They're promoting. They're good promoters. ISIS is a good promoter. And when these kids leave our country and they join ISIS, and then we allow them back in our country, we're never going to do that again. Day one, they leave, they fight for ISIS, they're gone, they never come back. They never come back. So what happened is we're coming down the escalator and I talked about trade, and I talked about Mexico, and I talked about a lot of different things because everybody's taken advantage of us, and we're losing a fortune, and we're just being destroyed. And then all of a sudden you have Paris, and then you had as you know, recently in Los Angeles, say a similar thing. We had 14 people killed, other people by the way in the hospital, with Paris it's 130 people, and it's people that are in such bad shape in the hospital that there are many more going to die, and some wounded so badly that you wouldn't believe. And remember this, Paris has the toughest gun laws in the world. France has among the toughest gun laws in the world. You can't have a gun unless you're a bad guy, in which case, you can have all the guns you want. So in Paris or in Los Angeles, if we had a few of these people, like you or you or that tough cookie, looks like he could be a very good shot, right? If we had a few people in those rooms that happened to be carrying guns because we are going to protect our Second Amendment remember that. But if there were people in those rooms, you know, in the case of Los Angeles, I mean, they actually threw them a wedding party. They knew him. They were friends and they were still killed. Just boom, boom, boom, nothing coming in the opposite direction. Now, if we had guns in that room where the bullets are coming in the opposite direction, you would not had the problem. You'd -- would have had a problem but they would have had a real big problem because they would have been gone. They would have been gone and they would have been gone fast. So these people that talk about destroying our Second Amendment and chipping away like Obama, chipping away at it, like Hillary Clinton chipping away. She wants to do more than chip away. I mean, she wants, as far as I'm concerned, she wants to get rid of our Second Amendment. So that'll be a whole thing. I guarantee you one thing, lots of things. Number one, Second Amendment, 100%, 100%, Second Amendment, so important. So important. And you need it. You need it today. You need it for protection. That's your last line of defense. You need it. You have to have it. And if you don't have it, we're not going to have a country either. So many things and many institutions they're hurting. They are hurting Christianity. They're chipping away and fighting Christianity. You know, I came up the other day, and I said fairly recently at an event, I see the hatred, that total hatred, radical. Islamic terrorism. We have a President that refuses to use the words. No matter what happens. No matter what happens. Even though it's 100% refuses to use the words. I said, we have to take a moratorium. We have to see what's going on. We have too much hatred. There's so much hatred. You see the danger and the problem that two young people that got married, that became radicalized have done, there's too much hatred. Again, like what I did at the opening, I took tremendous heat. Two weeks later everyone saying, Trump is right. We have to study it. There's such hatred. He's the only one with the guts to say it. I don't want to say it. But they say he's the only one with the guts to say it. So I just want to thank everybody. It's been so incredible. Iowa is an incredible place. It's just amazing. The people are amazing. But I have to say this, all over the country, they've been amazing. This is about the last speech that I'll be making in this position in Iowa. And it was special to me to come and do it, even though I had to drive through some pretty rocky, pretty rocky areas, right? Pretty rocky stuff. But there was no way -- they said, you know Mr. Trump, I think based on the weather, you could probably get away with not making this speech. I said, are you kidding? I wouldn't even think about it, OK? So besides that, Sarah was here and if I ever had, I don't have the courage to not be here for my Sarah. And Sarah again, I want to just say you, Todd, the entire family, you're spectacular peoples. Respected. You are so respected and there is a group of people, and it's a damn big group. They'll do anything for you. So stand up Sarah. I just want to thank you once again. Sarah Palin, everybody. So hopefully, we're going to have a great victory, and if we do have it, it's a very important -- I could say very easily, a lot of the news commentators, actually, some of whom I'm sort of friendly with a little bit, you get to know them. They say, wouldn't you be better off if you just said we want to do well in Iowa? And I said, not really, I mean, I want to be truthful. I'm a truthful person. I want to win Iowa. I don't want to be do well. I want to win. I want to win. You know three weeks ago, I was 11 points down. Now, I'm seven or eight points up and there's been this tremendous swing. And I really do, the Evangelicals have been incredible. The whole, everybody has been so incredible. So I could say -- I don't want to take the safe way. I want to win Iowa. It's going to send such a great message that we're not going to take it anymore. We're not going to take it. We're not going to take it anymore. We're going to take our country back. We're going to Make America Great Again. We're going to be so happy. We're going to be so thrilled and we're going to be proud to say, we're from the USA and we are the best, and there's nobody like us. I love you all. Make sure you caucus tonight. Make sure you all caucus tonight. We're going to have a tremendous victory. We love you. Thank you very much. Thank you."}