{"id":460,"author":"Donald Trump","title":"Speech: Donald Trump in Waterloo, IA","date":"2016-02-01","link":"https://factba.se/transcript/donald-trump-speech-waterloo-ia-february-1-2016","paragraphs":["Yeah, your governor, I mean the governor, yeah, your governor, I mean the governor, yeah, your governor, I mean the governor said you can't put Ted Cruz in because said you can't put Ted Cruz in because said you can't put Ted Cruz in because he's gonna destroy The ethanol business, he's gonna destroy the ethanol business.","He's gonna destroy the ethanol business. That's it. I had no idea how many jobs it. That's it. I had no idea how many jobs it. That's it. I had no idea how many jobs it means for Iowa. That's a major industry means for Iowa. That's a major industry means for Iowa. That's a major industry in Iowa. So you have to remember that now in Iowa.","So you have to remember that now in Iowa. So you have to remember that now I had a debate that I wasn't treated, I had a debate that I wasn't treated. I had a debate that I wasn't treated properly on. So what I did is I said you properly on. So what I did is I said you properly on, so what I did is I said, you know, you have to treat properly, you have know you have to treat properly, you have know you have to treat properly, you have to treat people properly and I wasn't To treat people properly and I wasn't to treat people properly and I wasn't treated properly and that's okay, I mean treated properly and that's okay, I mean treated properly and that's okay.","I mean, I've been there before. I've been there before. I've been there before, right? But what I did is I said I'm gonna, right, but what I did is I said I'm gonna, right, but what I did is I said I'm gonna have a little event, not a competing, have a little event, not a competing, have a little Event not a competing event and it wasn't a big deal event and it wasn't a big deal event and it wasn't a big deal.","And I had no idea how well it was gonna and I had no idea how well it was gonna and I had no idea how well it was gonna turn out. So we had a 700 seat theater turn out. So we had a 700 seat theater turn out. So we had a 700 seat theater about five minutes away from where the - about five minutes away from where the - about five minutes away from where the debate was.","And we had it for veterans, we debate was - and we had it for veterans, we debate was - and we had it for veterans. We had an event for veterans and at that had an event for veterans and at that had an event for veterans. And at that event, thank you. And the sad part is if I event thank you and the sad part is if I event thank you and the sad part is if I was in that debate, it didn't do very was in that debate.","It didn't do very was in that debate. It didn't do very well. It had 12 million people. The one well it had 12 million people. The one well it had 12 million people. The one that I was in the first one had 24 most that I was in the first one had 24 most that I was in. The first one had 24 most 25 million people and that was an 25 million people and that was an 25 million people.","And that was an all-time record in the history of cable, all-time record in the history of cable, all-time record in the history of cable television. And and honestly, if we had television and and honestly if we had television and and honestly, if we had - and very importantly, if I was there, we - and very importantly, if I was there, we - and very importantly, if I was there, we would have broken that record.","But much would have broken that record, but much would have broken that record, but much more importantly by not doing it. We have more importantly by not doing it. We have more importantly by not doing it, we have to defend ourselves and we have to, to defend ourselves and we have to, to defend ourselves and we have to defend our country if you have a defend our country, if you have a defend our country, if You have a president, you have to have a president's president, you have to have a president's president.","You have to have a president's going to defend your country, going to defend your country, going to defend your country more so than even himself or herself. I more so than even himself or herself I more so than even himself or herself, I mean has to happen. So I had a competing mean has to happen. So I had a competing mean has to happen.","So I had a competing of it and we did it for veterans because of it and we did it for veterans because of it. And we did it for veterans because the veterans in this country have been the veterans in this country, have been the veterans in this country, have been treated so horribly. They've been treated, treated so horribly.","They've been treated, treated so horribly. They've been treated so badly and we raised in one hour so badly and we raised in one hour so badly and we raised in one hour, listen to this one, six million dollars, listen to this one, six million dollars, listen to this one, six million dollars, okay. And I'm not gonna talk about polls today and I'm not gonna talk about polls today and I'm not gonna talk about polls today because frankly the polls today today we - because frankly the polls today today we - because frankly the polls today today we have Our ultimate poll, so I'd have to have our ultimate poll, so I'd have to have our ultimate poll.","So I'd have to talk about Paul's. But the one that just talk about Paul's but the one that just talk about Paul's but the one that just came out of New Hampshire has as way way came out of New Hampshire has as way way came out of New Hampshire has as way, way up. Because of the debate, because of what up because of the debate because of what up because of the debate, because of what I did, people respected that we don't - I did people respected that we don't - I did people respected that.","We don't take the stuff from people that you know take the stuff from people that you know take the stuff from people that you know shouldn't be treating us that way and shouldn't be treating us that way and shouldn't be treating us that way. And they respected it and I think they also - they respected it and I think they also - they respected it.","And I think they also like the fact that we didn't just not do like the fact that we didn't just not do like the fact that we didn't just not do it. We did something that benefits. So it - we did something that benefits. So it - we did something that benefits so many people and in this case the - the many people and in this case the - the many people and in this case the - the great veterans and veterans causes and great veterans and veterans causes and great veterans and veterans causes.","And so we've given away, I raised six, I have - so we've given away, I raised six. I have - so we've given away, I raised six, I have so many friends, Carl Icahn, who you don't so many friends, Carl Icahn who you don't so many friends. Carl Icahn, who you don't know, but he's a great businessman, he put know, but he's a great businessman, he put know, but he's a great businessman.","He put up a half a million dollars, Phil Ruffin up a half a million dollars. Phil Ruffin up a half a million dollars. Phil Ruffin, a great businessman from Las Vegas, put a great businessman from Las Vegas, put a great businessman from Las Vegas, put up a million dollars, the great Ike, up a million dollars, the great Ike, up a million dollars.","The great Ike Perlmutter and and Laurie Perlmutter, Perlmutter and and Laurie Perlmutter, Perlmutter and and Laurie Perlmutter, they put up a million dollars. Marvel, they put up a million dollars. Marvel, they put up a million dollars. Marvel Entertainment they did is incredible. The Entertainment they did is incredible.","The Entertainment they did is incredible. The Marvel, you know, they make all the great Marvel, you know, they make all the great Marvel, you know, they make all the great movies. I think he's got like I think movies, I think he's got like I think movies, I think he's got like I think he's got five of the top ten grossing, he's got five of the top ten grossing.","He's got five of the top ten grossing movies of all time. He's one of the great movies of all time. He's one of the great movies of all time. He's one of the great people and they are an amazing couple people and they are an amazing couple people and they are an amazing couple and they put up a million dollars and I - and they put up a million dollars and I - and they put up a Million dollars and I put up a million dollars and the bottom put up a million dollars and the bottom put up a million dollars and the bottom line is one hour six million dollars and line is one hour, six million dollars and line is one hour, six Million dollars and that evening was so beautiful.","We had a - that evening was so beautiful. We had a - that evening was so beautiful. We had a veteran that came in, lost his leg and he veteran that came in, lost his leg and he veteran that came in, lost his leg. And he gave a speech, a talk and about coming, gave a speech, a talk and about coming, gave a speech, a talk and about coming back and coming back and how tough it back and coming back and how tough it back and coming back and how tough It was to come back from the Middle East was to come back from the Middle East was to come back from the Middle East and all of a sudden be in society again and all of a sudden be in society again.","And all of a sudden be in society again and how difficult it was and how and how difficult it was and how and how difficult it was and how difficult it is for veterans generally difficult. It is for veterans generally difficult. It is for veterans generally and we have today one of our first and we have today one of our first and we have today one of our first recipients Americans for independent recipients, Americans for independent recipients, Americans for independent living.","And we have Arnold and Kim and living and we have Arnold and Kim and living and we have Arnold and Kim and they're here now to pick up a check for they're here now to pick up a check for they're here now to pick up a check For $ 100,000, it's one we're gonna give about $ 100,000, it's one we're gonna give about $ 100,000. It's one we're gonna give about 22 or 24 checks out and they've all been 22 or 24 checks out.","And they've all been 22 or 24 checks out and they've all been vetted. They've all been - you have the vetted, they've all been, you have the vetted, they've all been, you have the vets have been vetted because what we've vets have been vetted because what we've vets have been vetted because what we've done is we want to make sure that These done is we want to make sure that these done is we want to make sure that these are the - these people that get these are the - these people that get these are the - these people that get these checks are amazing.","People, amazing people, checks are amazing. People amazing people checks are amazing people, amazing people and Arnold and Kim have you come up and Arnold and Kim have you come up and Arnold and Kim have you come up. We're going to give you a nice beautiful. We're going to give you a nice beautiful. We're going to give you a nice, beautiful check and these - they've done an check and these - they've done an check and these they've done an incredible, incredible, incredible.","Just give a couple of minutes worth of just give a couple of minutes worth of just give a couple of minutes worth of what do you do because I know but they - what do you do because I know but they - what do you do because I know. But they don't know. Go ahead. Thank you everyone. Don't know. Go ahead. Thank you everyone.","Don't know. Go ahead. Thank you everyone. I'm Tim with Americans for independent. I'm Tim with Americans for independent. I'm Tim with Americans for independent living new organization here in the living new organization here in the living new organization here in the Waterloo area. We're here to help our Waterloo area.","We're here to help our Waterloo area. We're here to help our veterans that have returned home since veterans that have returned home since veterans that have returned home since 9/11 that have suffered major 9/11 that have suffered major 9/11 that have suffered major disabilities and we're looking to do the disabilities and we're looking To do the disabilities and we're looking to do the home modifications as much as we can to home modifications as much as we can to home modifications as much as we can to help them out that way so so they can help them out that way.","So, so they can help them out that way. So so they can make a house a home like the rest of us make a house a home like the rest of us make a house a home like the rest of us live in and and enjoy life. Instead of live in and and enjoy life instead of live in and and enjoy life instead of struggling with the challenges that struggling with the challenges that struggling with the challenges that they've come up with and in protecting, they've come up with and in protecting, they've come Up with and in protecting us and giving us our right to do what we us and giving us our right to do what we us and giving us our right to do what we do.","So this is what we're here for do. So this is what we're here for do. So this is what we're here for. Thank you very much. Appreciate, he said. Thank you very much. Appreciate he said. Thank you very much. Appreciate he said, we'll see you in the White House. That's - we'll see you in the White House, that's - we'll see you in the White House.","That's nice. I like him now. These people are nice. I like him now. These people are nice. I like him now. These people are amazing. I mean, they devote their lives amazing. I mean they devote their lives amazing, I mean they devote their lives to it and we were very careful because to it. And we were very careful because to it and we were very careful because you know you have some people that don't, you know, you have some people that don't, you know you have some people that don't do as good a job and we say that's okay.","Do as good a job and we say that's okay, do as good a job and we say that's okay, let somebody else help them, but these let somebody else help them, but these let somebody else help them. But these - some of the people that were giving this - some of the people that were giving this - some of the people that were giving this money to, you know it's they're money to, you know, it's they're money to, you know, it's - they're incredible people and such an Honor to incredible people and such an honor to incredible people and such an honor to be in a country with people like this be in a country with people like this be in a country with people like this and they really care.","That's what they - and they really care, that's what they and they really care, that's what they want. They want to help people and so want - they want to help people and so want - they want to help people. And so we're very happy to be able to help them. We're very happy to be able to help them. We're very happy to be able to help them.","Also, I have a couple of special people also. I have a couple of special people also. I have a couple of special people I'm going to introduce, right, because I - I'm going to introduce right, because I - I'm going to introduce right, because I see them standing in the back wings, see them standing in the back wings, see them standing in the back wings.","My wife Melania, who's been so supportive, my wife, Melania, who's been so supportive, my wife, Melania, who's been so supportive, come on up honey, so supportive. And my daughter thing look at ads. My and my daughter thing look at ads. My and my daughter thing, look at ads, my daughter, Ivanka, and her husband, Jared daughter, Ivanka and her husband, Jared daughter, Ivanka and her husband.","Jared, come on up, come on, up, come on up, and Jared's a very successful man from and Jared's a very successful man from and Jared's a very successful man from New York. He's done a fantastic job New York. He's done a fantastic job. New York. He's done a fantastic job, creates a lot of housing for people and creates a lot of housing for people and creates a lot of housing for people and real estate.","And Ivanka's, Ivanka, we know real estate and Ivanka's, Ivanka, we know real estate and Ivanka's Ivanka. We know Ivanka right and she's gonna have a baby Ivanka right and she's gonna have a baby Ivanka right and she's gonna have a baby perhaps in ten minutes or a week or two, perhaps in ten minutes or a week or two perhaps in Ten minutes or a week or two weeks or something, but we're ready, I you weeks or something, but we're ready.","I you weeks or something, but we're ready. I you know the joke has been going over. I said, know the joke has been going over. I said know the joke has been going over. I said please. Please have your baby in Iowa. I please please have your baby in Iowa. I please please have your baby in Iowa. I would not lose this.","It's no way I could would not lose this. It's no way I could would not lose this, it's no way I could lose. We're all prepared. We even have a lose. We're all prepared. We even have a lose. We're all prepared. We even have a place picked out. But you know, perhaps place picked out but you know perhaps place picked out, but you know perhaps that won't happen, but I just want to - that won't happen, but I just want to - that won't happen, but I just want to thank you all for being here.","Ivanka you thank you all for being here. Ivanka you. Thank you all for being here. Ivanka, you want to say a word for a second. It has want to say a word for a second. It has want to say a word for a second. It has been such a pleasure to be here for the been such a pleasure to be here for the been such a pleasure to be here for the last several days with my father going last several days with my father going last several days with my father Going around and meeting the amazing people of around and meeting the amazing people of around and meeting the amazing people of Iowa, the reception has been so warm and Iowa, the reception has been so warm and Iowa, the reception has been so warm.","And I think that's in part because my - I think that's in part because my - I think that's in part because my father's really created a movement with father's really created a movement with father's, really created a movement with all of your help. People want to see all of your help. People want to see all of your help.","People want to see change and he's gonna effectuate that change and he's gonna effectuate that change and he's gonna effectuate that change. It's been what he's done. His change. It's been what he's done, his change. It's been what he's done, his whole life. So my father will undoubtably whole life. So my father will undoubtably whole life.","So my father will undoubtably make America great again and we make America great again and we make America great again and we appreciate your support. So come out, appreciate your support. So come out, appreciate your support. So come out tonight, seven o'clock in caucus for tonight, seven o'clock in caucus for tonight, seven o'clock in caucus for Donald, J Trump.","Thank you everyone for Donald J Trump. Thank you everyone for Donald J Trump. Thank you everyone for being here. Nice family is always the best thing you - nice family is always the best thing. You - nice family is always the best thing. You know that right. People say I talk on know that right. People say I talk on know that right.","People say, I talk on success and now, but it's true success and now but it's true success and now but it's true, I talked so much on success where they - I talked so much on success where they - I talked so much on success where they asked me Would you make a speech on asked me, would you make a speech on asked me, would you make a speech on success?","I give a lot of money to charity success. I give a lot of money to charity success. I give a lot of money to charity talking about success and we get these talking about success and we get these talking about success and we get these big big crowds and people say what is it big, big crowds and people say what is it big, big Crowds and people say what is it like I said, let me tell you the most.","Like I said, let me tell you the most. Like I said, let me tell you the most important thing is family. It's really important thing is family, it's really important thing is family. It's really true. If you have - I've seen people, I've true if you have, I've seen people, I've true if you have, I've seen people, I've seen the most successful people in the - seen the most successful people in the - seen the most successful people in the world.","I deal with them, some of them are world, I deal with them, some of them are world, I deal with them, some of them are giving me money for the vets, but I deal giving me money for the vets, but I deal giving me money for the Vets, but I deal with them all the time and they have with them all the time and they have with them all the time and they have tremendous money and they've done a tremendous money and they've done a tremendous money and they've done a tremendous job and They put two, you know, tremendous job and they put two, you know, tremendous job and they put two, you know, working lots of jobs, lots of Education, working lots of jobs, lots of Education, working lots of jobs, lots of Education for families and hospitalization and all for Families and hospitalization and all for families and hospitalization and all sorts of things.","But when you have great sorts of things, but when you have great sorts of things. But when you have great family life, you have a wife and family, family life, you have a wife and family, family life, you have a wife and family that you love or you have a husband that that you love or you have a husband that that you Love or you have a husband that you love with your family, it's honestly you love with your family.","It's honestly you love with your family. It's honestly - those are the people that I see that are - those are the people that I see that are - those are the people that I see that are most successful people, some of the most successful people, some of the most successful people. Some of the people that have made this vast sum of people that have made this vast sum of people that have made this vast sum of money have and not all, but some of them money have and not all, but some of them money have and not All - but some of them are actually not happy at all and so are actually not happy at all and so are actually not happy at all.","And so when you say who's the successful person, when you say who's the successful person, when you say who's the successful person, somebody that's really happy because of somebody that's really happy because of somebody that's really happy because of the family and because of whatever and the Family and because of whatever and the family and because of whatever and or somebody that's made, you know or somebody that's made, you know or somebody that's made you know, billions of dollars and does not feel so billions of dollars and does not feel so billions of Dollars and does not feel so great about themselves and there's great about themselves and there's great about themselves and there's always wanting more, more and more.","You always wanting more, more and more. You always wanting more more and more. You know, it's like an interesting thing. But know, it's like an interesting thing, but know it's like an interesting thing. But the happiest people I've seen are the - the happiest people I've seen are the - the happiest people I've seen are the people with the great family life and by people with the great family life and by people with the great family life.","And by the way, believing in God so important, the way believing in God so important, the way believing in God so important and I've seen that so much so important and I've seen that so much so important and I've seen that so much. So important so important and I have to tell you, you so important and I have to tell you, you so important and I have to tell you, you know, I've been in Iowa now for a long know.","I've been in Iowa now for a long know. I've been in Iowa now for a long time. We've made many, many trips here time. We've made many, many trips here time. We've made many, many trips here, many, many stops that I've got to know. Many, many stops that I've got to know. Many, many stops that I've got to know many people, the evangelicals have been many people.","The evangelicals have been many people. The evangelicals have been unbelievable to Donald Trump. They have unbelievable to Donald Trump. They have unbelievable to Donald Trump. They have been unbelievable. Boy, do they understand been unbelievable? Boy, do they understand been unbelievable? Boy, do they understand me?","They understand me better than me. They understand me better than me. They understand me better than anybody. I said that this morning to anybody I said that this morning to anybody. I said that this morning to somebody I said I think the evangelicals somebody I said I think the evangelicals somebody I said, I think the evangelicals really do get me, but we're going to really do get me.","But we're going to really do get me. But we're going to protect so many things we're going to protect so many things we're going to protect so many things we're going to protect our country, we're going to protect our country, we're going to protect our country, we're going to protect Christianity, you know, protect Christianity.","You know, protect Christianity, you know, Christianity is under siege folks. It's Christianity is under siege folks. It's Christianity is under siege folks. It's under under under and we're gonna protect it and you know and we're gonna protect it and you know and we're gonna protect it and you know what Jerry Falwell was here yesterday what Jerry Falwell was here yesterday, what Jerry Falwell was here yesterday, Jerry Falwell Jr, who's an amazing guy, he Jerry Falwell Jr, who's an amazing guy, he Jerry Falwell Jr, who's an amazing guy.","He built with his father, Liberty University, built with his father, Liberty University, built with his father, Liberty University. And I was there two weeks ago and we set and I was there two weeks ago and we set and I was there two weeks ago and we set a record in terms of attendance. But he's a record in terms of attendance.","But he's a record in terms of attendance, but he's seen everybody come through Liberty, seen everybody come through Liberty, seen everybody come through Liberty because each one of the candidates, because each one of the candidates, because each one of the candidates automatically, it's like an automatic automatically.","It's like an automatic automatically, it's like an automatic stop and I guess every single candidate stop and I guess every single candidate stop and I guess every single candidate went through and what he endorsed me as went through and what he endorsed me as went through and What he endorsed me as a person, he endorsed me.","I was one of the a person he endorsed me. I was one of the a person he endorsed me. I was one of the great compliments that I could have had great compliments that I could have had great compliments that I could have had because he knows them all. He sees them because he knows them all. He sees them because he knows them all.","He sees them all, not an easy thing for him to do he all, not an easy thing for him to do he all, not an easy thing for him to do. He doesn't do that. I think this is the - doesn't do that. I think this is the - doesn't do that. I think this is the first time. So when he came out and did first time, so when he came out and did first time, so when he came out and did that, to me that was a great compliment.","That to me that was a great compliment that to me that was a great compliment and I think it had a huge impact frankly. And I think it had a huge impact frankly. And I think it had a huge impact, frankly, because our numbers with evangelicals, because our numbers with evangelicals, because our numbers with evangelicals, they were good before, but they weren't - they were good before, but they weren't - they were good before, but they weren't shooting through-the-roof.","So a shooting through-the-roof, so a shooting through-the-roof. So a combination of Jerry and Sarah Palin, who combination of Jerry and Sarah Palin, who combination of Jerry and Sarah Palin, who is a terrific person and a terrific, is a terrific person and a terrific - is a terrific person. And a terrific woman, she came out and endorsed us and woman.","She came out and endorsed us and woman. She came out and endorsed us and that was so nice and so great and I - that was so nice and so great and I - that was so nice and so great and I think that had an impact and on the think that had an impact. And on the think that had an impact and on the border who's better than Sheriff Joe of border who's better than Sheriff Joe of border who's better than Sheriff Joe of Arizona, right?","You know, all of these Arizona, right? You know, all of these Arizona, right? You know, all of these people are fighting and fighting and people are fighting and fighting and people are fighting and fighting and fighting and trying to say they're there fighting and trying to say they're there fighting and trying to say they're there.","It's very interesting because we're - it's very interesting because we're - it's very interesting because we're gonna have a lot of things. We're gonna gonna have a lot of things. We're gonna gonna have a lot of things. We're gonna do things that have not been done. I mean do things that have not been done.","I mean do things that have not been done. I mean we're gonna build that wall. It's gonna, we're gonna build that wall, it's gonna, we're gonna build that wall, it's gonna be a beautiful, big, strong, powerful wall, be a beautiful, big, strong, powerful wall, be a beautiful big, strong, powerful wall and people are gonna come through.","But - and people are gonna come through, but - and people are gonna come through, but they're gonna come through legally. They're gonna come through legally. They're gonna come through legally legally. They're coming through the world legally. They're coming through the world legally. They're coming through the world labor and - and that's awareness and it's labor and - and that's awareness and it's labor.","And - and that's awareness and it's - it's gonna be a great thing and it's - it's gonna be a great thing and it's - it's gonna be a great thing and it's gonna be wonderful to have a border gonna be wonderful to have a border Gon na be wonderful to have a border, we're gonna have a border and we are - we're gonna have a border and we are - we're gonna have a border and we are going to, you know who's paying for the going to you know who's paying For the going to, you know who's paying for the world, Mexico's paying for the law, okay?","I world Mexico's paying for the law, okay? I world Mexico's paying for the law, okay? I won't - even - I won't put you through the won't even - I won't put you through the won't even - I won't put you through the exit, who's paying for the wall. Everybody exit, who's paying for the wall, everybody exit, who's paying for the wall.","Everybody knows and they're going to - and the other knows and they're going to - and the other knows and they're going to - and the other candidates come up and they say why is candidates come up and they say why is candidates come up and they say why is Mexico paying, how can you do that, Mexico paying, how can you do that, Mexico paying, how can you do that?","They're not gonna pay for the ways of they're not gonna pay for the ways of they're not gonna pay for the ways. Of course, they are - they make so much money course they are - they make so much money course they are - they make so much money off the United States in terms of trade off the United States in terms of trade off the United States in terms of trade Deficits and trade the numbers are deficits and trade.","The numbers are deficits and trade. The numbers are astronomical. I'm not even including the astronomical. I'm not even including the astronomical. I'm not even including the drug traffic which probably triple said drug traffic, which probably triple said drug traffic, which probably triple said I'm sure you know the drugs come over.","So I'm sure you know the drugs come over. So I'm sure you know the drugs come over. So we get the drugs, they get the cash this we get the drugs, they get the cash this we get the drugs they get the cash. This is the way they have trucks, they drive is the way they have trucks. They drive is the way they have trucks.","They drive right over that. You ever see the walls right over that you ever see the walls right over that you ever see the walls would have a wall this high and they would have a wall this high and they would have a wall this high and they build a little ramp. I don't even know build a little ramp, I don't even know build a little ramp.","I don't even know why they build a ramp, why they build a ramp, why they build a ramp, just bulldoze it and just drive straight just bulldoze it and just drive straight. Just bulldoze it and just drive straight, you don't need a ramp. I don't know why you don't need a ramp. I don't know why you don't need a ramp.","I don't know why they do that. I guess they don't want to - they do that. I guess they don't want to - they do that, I guess they don't want to hurt the wall, but they build a ramp and hurt the wall, but they build a ramp and hurt the wall, but they build a ramp and they have jeeps and they have these.","They have jeeps and they have these - they have jeeps and they have these vehicles driving right over right over vehicles driving right over right over vehicles driving right over, right over its the most accredited in Time magazine, its the most accredited in Time magazine, its the most Accredited in Time magazine a picture of these vehicles driving over a picture of these vehicles driving over a picture of these vehicles driving over loaded up with drugs and we get the loaded up with drugs and we get the loaded up with drugs and we get the Drugs and you look at some places like drugs and you look at some places like drugs and you look at some places like New Hampshire, our next stop is New New Hampshire.","Our next stop is New New Hampshire. Our next stop is New Hampshire. They have a drug problem that Hampshire, they have a drug problem that Hampshire, they have a drug problem that you wouldn't believe and you wouldn't - you wouldn't believe and you wouldn't - you wouldn't believe and you wouldn't think of that for New Hampshire.","Think of that for New Hampshire, think of that for New Hampshire, it all comes from that southern border. It all comes from that southern border. It all comes from that southern border and they have an amazing problem up and they have an amazing problem up and they have an amazing problem up there and many of the New England states there and many of the New England states there and many of the New England states, but I mean our country as a whole, so.","But I mean our country as a whole, so - but I mean our country as a whole, so they come up and they come pouring, they come up and they come pouring, they come up and they come pouring across and they come back with the cash across and They come back with the cash across and they come back with the cash.","We're gonna stop it because this walls we're gonna stop it because this walls we're gonna stop it because this walls not gonna be a wall, you're gonna drive, not gonna be a wall, you're gonna drive, not gonna be a Wall, you're gonna drive over, see that ceiling, that ceilings over see that ceiling, that ceilings over see that ceiling, that ceilings peanuts compared to what we're talking peanuts compared to what we're talking peanuts compared to what we're talking about, okay?","There's a real wall. This is a about, okay, there's a real wall. This is a about, okay, there's a real wall. This is a wall. If they ever get up there, they're wall. If they ever get up there, they're wall. If they ever get up there, they're not coming down because they're gonna not coming down because they're gonna not coming down because they're gonna say, wow, it's a problem.","And I get a kick say, wow, it's a problem. And I get a kick say, wow, it's a problem and I get a kick out of I get a kick out of these people out of I get a kick out of these people out of I get a kick out of these people say, you know they Come out and they say, say, you know they come out and they say, say, you know they come out and they say the walls and the walls don't work walls, the walls and the walls, don't work walls, the walls and the walls don't work, walls don't work.","I mean the walls they build don't work. I mean the walls they build don't work. I mean the walls they build don't work. You ever see these things don't work. You ever see these things don't work. You ever see these things that like make it a paper mache no this that like make it a paper mache no this that like make it a paper mache, no, this is the real deal, okay.","This is - this is, is the real deal? Okay. This is - this is, is the real deal, okay, this is - this is gonna be - I know exactly what it's gonna gonna be. I know exactly what it's gonna gonna be. I know exactly what it's gonna look like. All right, that's what I do. I look like all right, that's what I do.","I look like all right, that's what I do. I really build good. Wouldn't it be nice to really build good? Wouldn't it be nice to really build good? Wouldn't it be nice to have a real building? I'm a really what I have a real building. I'm a really what I have a real building. I'm a really - what I do best in life is build and I built do best in life is build and I built do best in life is build and I built these buildings that are so great these buildings that are so great these buildings that are so Great, whether you look - no matter where you - whether you look no matter where you - whether you look no matter where you look, whether you go to Chicago or New look whether you go to Chicago or New look whether you go to Chicago or New York or anywhere.","I mean there right now York or anywhere, I mean there right now, York or anywhere. I mean there right now we have buildings going up all over the - we have buildings going up all over the - we have buildings going up all over the world. Doing this is actually tough world doing, this is actually tough world doing.","This is actually tough because I love what I do so much, but because I love what I do so much, but because I love what I do so much, but with Ivanka Don, Eric, my executives I with Ivanka Don, Eric, my executives I with Ivanka Don. Eric, my executives, I have great executives, I've built a great, have great executives, I've built a great, have great executives, I've built a great, great company, a powerful company, very great company, a powerful company, very great company, a powerful company, very low debt, tremendous cash flow from Me I low debt, tremendous cash flow from me.","I low debt, tremendous cash flow from me. I would have never believed that 20 years would have never believed that 20 years would have never believed that 20 years ago, 25 years ago, tremendous cash flow ago, 25 years ago, tremendous cash flow ago, 25 years ago, tremendous cash flow, some of the greatest assets in The world, some of the greatest assets in the world, some of the greatest assets in the world.","And then I filed the papers and everyone and then I filed the papers and everyone and then I filed the papers. And everyone said, Wow, because I'm a private company said, Wow, because I'm a private company said, Wow, because I'm a private company, they said he's much bigger than anyone. They said he's much bigger than anyone.","They said he's much bigger than anyone ever understood. And I've got rave ever understood and I've got rave ever understood and I've got rave reviews on it from a financial reviews on it, from a financial reviews on it from a financial standpoint. And I say it not in a standpoint, and I say it not in a standpoint and I say it not in a braggadocious way.","That's the kind of braggadocious way. That's the kind of braggadocious way that's the kind of thinking we need in this country because thinking we need in this country because thinking we need in this country because we have people that don't know what we have people that don't know what we have, people that Don't know what they're doing.","We have people that don't know what we have. People that don't know what we have people that don't know what they're doing. We have 19 trillion. They're doing. We have 19 trillion. They're doing. We have 19 trillion dollars, trillion down. Most people don't dollars trillion down, most people don't dollars trillion down.","Most people don't even know what it means to say a even know what it means to say a even know what it means to say a trillion dollars. If this wasn't a word, trillion dollars. If this wasn't a word, trillion dollars, if this wasn't a word that was in the vocabulary ten years ago that was in the vocabulary ten years ago that was in the vocabulary ten years ago and now we have 19 trillion dollars and now we have 19 trillion Dollars and now we have 19 trillion dollars worth of debt.","When you think of that now worth of debt, when you think of that now worth of debt, when you think of that now the budget they just approved two weeks, the budget, they just approved two weeks. The budget they just approved two weeks ago, which I don't know, I mean a lot of ago, which I don't know, I mean a lot of ago, which I don't know.","I mean, a lot of years shaken, you had, you know, exactly years shaken, you had, you know, exactly years shaken, you had, you know exactly what I'm talking about, think that done. What I'm talking about, think that done. What I'm talking about think that done in like two, two days if not even two in like two, two days if not even two in like two, two days if not even two days.","It was like a few hours, most people days it was like a few hours, most people days it was like a few hours. Most people didn't even know they were talking about, didn't even know they were talking about didn't even know they were talking about a budget and that budget funds a budget and that budget funds a budget and that budget funds everything for Obama, you know Obama's a everything For Obama, you know Obama's a everything for Obama, you know Obama's a terrible negotiator except when it comes terrible negotiator except when it comes terrible negotiator except when it comes to negotiating against the Republicans to negotiating against the Republicans to negotiating against the Republicans you ever notice.","And I'm not angry, I'm you ever notice and I'm not angry. I'm you ever notice and I'm not angry. I'm not even angry you give up with this, not even angry you give up with this, not even angry you give up with this stuff. Obama who cares? I'm not angry at stuff, Obama who cares. I'm not angry at stuff. Obama who cares.","I'm not angry at the Democrats because we understand the Democrats because we understand the Democrats because we understand where they're coming from. I'm angry at where they're coming from. I'm angry at where they're coming from. I'm angry at the Republicans because the Republicans, the Republicans because the Republicans, the Republicans because the Republicans roll over and they just allow all of the roll over and they just allow all of the roll over.","And they just allow all of the stuff to take place and then they talk stuff to take place and then they talk stuff to take place and then they talk about we're going to try and balance our about. We're going to try and balance our about - we're going to try and balance our budget in 25 years, 25 years, budget in 25 years, 25 years budget in 25 years, 25 years.","Why 25 years? We're getting rid of a lot why 25 years we're getting rid of a lot, why 25 years we're getting rid of a lot of things as an example, common core is of things as an example, common core is of things. As an example, common core is dead. It's gone, common core is gone, our dead, it's gone, common core is gone, our dead, it's gone, common core is gone.","Our Second Amendment we are going to fight Second Amendment. We are going to fight Second Amendment we are going to fight. So that is not going to be chipped away. So that is not going to be chipped away. So that is not going to be chipped away at, you know, they're chipping away at at, you know, they're chipping away at at, you know, they're chipping away at your second Amendment and pretty soon if your second Amendment and pretty soon if your second Amendment and pretty Soon if it's up to some people, you won't have a - it's up to some people, you won't have a - it's up to some people, you won't have a second Amendment.","You know, a couple of second Amendment, you know, a couple of second Amendment, you know a couple of things have happened, pretty big things. Things have happened pretty big things. Things have happened, pretty big things. I'll tell you Paris, remember California, I'll tell you Paris, remember California, I'll tell you Paris, remember California same thing, not as - not as great from the same thing, not as, not as great from the same thing, not as, not as great from the standpoint.","We lost 14 great American standpoint. We lost 14 great American standpoint. We lost 14 great American people in, in Paris. What happened there, people in, in Paris, what happened there? People in, in Paris what happened there, what happened in California? Just think what happened in California, just think what happened in California, just think of this, the gun-free zones of this, the gun-free zones of this, the gun-free zones, Paris is one of the absolute toughest Paris is one of the absolute toughest Paris is one of the absolute Toughest places in the world to get a gun one of places in the world to get a gun one of places in the world to get a gun one of the absolute toughest.","France is like the absolute toughest. France is like the absolute toughest. France is like said to be the toughest cutter you can't said to be the toughest cutter. You can't said to be the toughest cutter. You can't get a gun unless you're a bad guy what get a gun unless you're a bad guy what get a gun unless you're a bad guy.","What happened is they walk in and they start happened is they walk in and they start happened is they walk in and they start shooting people if like a few of you shooting people if like a few of you shooting people if like a few of you People were in that room and you had people were in that room and you had people were in that room and you had guns strapped to your ankle, your waist guns strapped to your ankle, your waist guns strapped to your ankle, your waist and the bullets were Flying in the - and the bullets were flying in the - and the bullets were flying in the opposite direction.","There wouldn't have opposite direction, there wouldn't have opposite direction. There wouldn't have been a hundred and thirty people killed, been a hundred and thirty people killed, been a hundred and thirty people killed by the way, 130 killed by the way 130 killed. By the way, 130 killed many, many, many right now in a hospital.","Many, many, many right now in a hospital, many, many, many right now in a hospital, so gravely injured that they're not so gravely injured that they're not so gravely injured that they're not gonna make it. And if they do make it gonna make it. And if they do make it gonna make it and if they do make it, it's not gonna be a pleasant life, okay?","It's not gonna be a pleasant life, okay? It's not gonna be a pleasant life, okay, because there was absolutely they could because there was absolutely they could because there was absolutely they could have stayed there longer and kept - have stayed there longer and kept - have stayed there longer and kept shooting.","But they were just saying you shooting, but they were just saying you shooting, but they were just saying you over boom you over boom, these are over boom you over boom, these are over boom you over boom, these are animals, these are animals and then the animals. These are animals and then the animals, these are animals and then the press called the masterminds, the press called the masterminds, the press called the masterminds, the mastermind.","They're not masterminds mastermind. They're not masterminds mastermind. They're not masterminds. They're animals and we have to stop it. They're animals and we have to stop it, they're animals and we have to stop it. We have to be so tough we have to be. So we have to be so tough we have to be. So we have to be so tough.","We have to be so vigilant. We can't allow this to happen, vigilant. We can't allow this to happen, vigilant. We can't allow this to happen to our country. So in California, 14 to our country, so in California, 14 to our country. So in California, 14 people dead numerous people in the people dead, numerous people in the people dead, numerous people in the hospital, horribly injured 14, these two hospital horribly injured 14, these two hospital horribly injured 14. These two people that gave wedding parties for the people that gave wedding parties for the people that gave wedding parties for the people, they knew him, they knew him and people, they knew him, they knew him and people, they knew him, they knew him and they walk Into the room and they started, they walk into the room and they started, they walk into the room and they started shooting.","So we have to be tough, we have shooting. So we have to be tough, we have shooting. So we have to be tough. We have to be vigilant, we can't allow it to - to be vigilant, we can't allow it to, to be vigilant, we can't allow it to happen and we have to protect our Second happen and we have to protect our Second happen and we have to protect our Second Amendment, if they had in California guns Amendment, if they had in California guns Amendment if they had in California guns, not many.","Just if a couple of people that not many, just if a couple of people that not many. Just if a couple of people that knew how to use them were in that room, knew how to use them were in that room, knew how to use them were in that room. It would have ended long before the 14th. It would have ended long before the 14th, it would have ended long before the 14th person.","I can tell you that and it's so person I can tell you that and it's so person I can tell you that and it's so sad. I mean you have another case which sad, I mean you have another case which sad I mean you have another case which is just absolutely crazy you have is just absolutely crazy. You have is just absolutely crazy.","You have military bases and you have gun-free military bases and you have gun-free military bases and you have gun-free zones and military bases and we had five zones and military bases and we had five zones and military bases. And we had five great young people killed military. Great young people killed military, great young people killed military people, people, people, two of them were world champions, one of two of them were world champions, one of two of them were world champions.","One of us is supposed to be one of the great us is supposed to be one of the great us is supposed to be one of the great experts on guns, a great shot, great experts on guns, a great shot, great experts on guns, a great shot, Great marksman and their guns were 200 yards, marksman and their guns were 200 yards marksman and their guns were 200 yards away.","He locked up because they had a gun away. He locked up because they had a gun away. He locked up because they had a gun for his own and this wacko comes in sees for his own and this wacko comes in sees for his own and this wacko comes in, sees these five guys shoots up kills him. Now these five guys shoots up kills him.","Now these five guys shoots up kills him. Now these were tough guys. These were guys - these were tough guys. These were guys - these were tough guys. These were guys that couldn't have been if they were - that couldn't have been. If they were - that couldn't have been - if they were having a gun, he wouldn't have lasted, he having a gun, he wouldn't have lasted, he having a gun, he wouldn't have lasted, he wouldn't - he would have not have gotten, wouldn't he would have not have gotten, wouldn't He would have not have gotten near the front door.","I mean one of them near the front door. I mean one of them near the front door. I mean one of them they says one of the best, but there were - they says one of the best. But there were - they says one of the best, but there were all great soldiers. They weren't allowed all great soldiers. They weren't allowed all great soldiers.","They weren't allowed to have a gun. Now they're supposed to, to have a gun. Now they're supposed to - to have a gun now they're supposed to protect us and they use guns and that's protect us and they use guns and that's protect us and they use guns and that's how they protect us and yet we have how they protect us.","And yet we have how they protect us and yet we have gun-free zones. I will end gun-free zones, gun-free zones. I will end gun-free zones, gun-free zones. I will end gun-free zones on military bases so fast, your head will on military bases. So fast, your head will on military bases so fast, your head will spin, it'll be the first thing.","The first spin, it'll be the first thing. The first spin, it'll be the first thing the first time. So they're chipping away at your faith. So they're chipping away at your faith, so they're chipping away at your faith. They're chipping away. I mean, the words they're chipping away. I mean, the words they're chipping away.","I mean the words Merry Christmas, you're gonna say Merry Merry Christmas, you're gonna say Merry Merry Christmas, you're gonna say Merry Christmas. A lot. Believe me folks, you Christmas a lot. Believe me folks, you Christmas a lot. Believe me folks, you know, you go now to a store, you go to a know you go now to a store, you go to a know you go now to a store, you go to a department store like Macy's, very department store like Macy's, very department store.","Like Macy's, very disloyal company, you go to - it's true disloyal company, you go to - it's true disloyal company, you go to - it's true first time I had when I went out is so first time I had when I went out is so first time I had when I went out is so true, I went out and I gave the opening true. I went out and I gave the opening true.","I went out and I gave the opening remarks a nice little thing in Macy's remarks, a nice little thing in Macy's remarks, a nice little thing in Macy's, not big stuff. Tie shirts, I make the not big stuff, tie shirts, I make the not big stuff, tie shirts. I make the opening rods talking about illegal opening rods, talking about illegal opening rods, talking about illegal immigration.","And they were told they're immigration and they were told they're immigration. And they were told they're gonna have a couple of pickets in front gonna have a couple of pickets in front gonna have a couple of pickets in front of Macy's. And what they did is they said of Macy's and what they did is they said of Macy's and what they did is they said, oh, oh, they called, Oh, what are we gonna?","Oh, oh! They called - Oh, what are we gonna? Oh, oh! They called, Oh, what are we gonna do? What are these? Our people? I knew very do what are these our people. I knew very do what are these our people. I knew very well, not a big business, but they said I - well, not a big business, but they said I - well, not a big business, but they said, I said what's the big deal?","They'll pick. It said what's the big deal? They'll pick. It said what's the big deal, they'll pick it for 20 minutes and then they want to go for 20 minutes and then they want to go for 20 minutes and then they want to go to lunch. It's not gonna be a bit who to lunch. It's not gonna be a bit who to lunch, it's not gonna be a bit who cares just at all, but this would be bad cares just at all, but this would be bad cares just at all, but this would be bad.","In the meantime, you know, they paid all in the meantime, you know they paid all. In the meantime, you know they paid all sorts of penalties and fines for sorts of penalties and fines for sorts of penalties and fines for non-inclusion and lots of other things. Non-inclusion and lots of other things non-inclusion and lots of other things, okay, but they terminated.","So they're very okay, but they terminated. So they're very okay, but they terminated. So they're very disloyal. I will never forget Macy's disloyal, I will never forget Macy's disloyal, I will never forget Macy's because I would have never thought that because I would have never thought that because I would have never thought that was possible and they did it over was possible and they Did it over was possible and they did it over illegal immigration, then it turned out illegal immigration, then it turned out illegal immigration.","Then it turned out two weeks up. By the way, would we be two weeks up? By the way, would we be two weeks up by the way, would we be selling right now, shirts and ties and selling right now shirts and ties and selling right now, shirts and ties and perfumes and you can get them elsewhere, perfumes and you can get them Elsewhere, perfumes and you can get them elsewhere by the way go get them elsewhere.","I don't by the way go get them elsewhere. I don't by the way go get them elsewhere. I don't like that. I never liked those stores like that. I never liked those stores like that. I never liked those stores very much anyway, very much anyway very much anyway but but if you think about it if you - but but if you think about it if you - but but if you think about it, if you think about it, you know the country's think About it, you know, the country's think about it, you know the country's about loyalty, you want loyalty in the about loyalty, you want loyalty in the about loyalty, you want loyalty in the country.","So I mentioned during that country. So I mentioned during that country. So I mentioned during that speech, illegal immigration and all hell speech, illegal immigration and all hell speech, illegal immigration and all hell broke loose, right, broke loose, right, broke loose, right? I took heat Rush Limbaugh, who's an I took heat Rush Limbaugh, who's an I took heat Rush Limbaugh, who's an amazing guy, Drudge an amazing, you know, amazing guy, Drudge, an amazing, you know, amazing guy, Drudge, an amazing, you know Drudge.","He's like one of the great people Drudge. He's like one of the great people Drudge. He's like one of the great people. He said he's a powerhouse, but - but I'll - he said he's a powerhouse, but - but I'll - he said he's a powerhouse. But - but I'll tell you a rush said, I've never seen tell you a rush said I've never seen tell you a rush said I've never seen anybody take more incoming than Donald.","Anybody take more incoming than Donald. Anybody take more incoming than Donald Trump for saying something that was Trump for saying something that was Trump for saying something that was right two weeks later. Everyone's trying right two weeks later, everyone's trying right two weeks later, everyone's trying to pivot to me.","They're all trying to - to pivot to me, they're all trying to - to pivot to me, they're all trying to come and talk about Italy. We wouldn't come and talk about Italy. We wouldn't come and talk about Italy. We wouldn't even be talking about illegal, even be talking about illegal, even be talking about illegal immigration if I didn't bring it up at immigration, if I didn't bring it up at immigration, if I didn't bring it up at that opening day June 16th, now it's a - That opening day June 16th, now it's a that opening day June 16th.","Now it's a long time ago. Hard to believe here we long time ago. Hard to believe here we long time ago, hard to believe here. We are first day, but June 16th, we wouldn't are first day, but June 16th, we wouldn't are first day. But June 16th, we wouldn't even be talking about illegal, even be talking about illegal, even be talking about illegal immigration.","Now they're all trying to immigration now they're all trying to immigration. Now they're all trying to say they're all trying to come on board, say they're all trying to come on board, say they're all trying to come on board. And the funny thing my wife said to me and the funny thing my wife said to me and the funny thing my wife said to me the other day darling, he just said wall the other day darling, he just said wall the other day darling.","He just said wall one of the candidates, one of the candidates, one of the candidates won't even say who - what difference does won't even say who - what difference does won't even say who - what difference does it make. But one of the candidates said it make, but one of the candidates said it make, but one of the candidates said we will build a wall another way.","They - we will build a wall another way. They - we will build a wall another way, they talk - they don't really talk. They they talk - they don't really talk. They they talk - they don't really talk. They they like everything's always like a debate like everything's always like a debate like everything's always like a debate.","They're talking to a reporter, we will - they're talking to a reporter, we will. They're talking to a reporter. We will build what I actually said about Ted build what I actually said about Ted build what I actually said about Ted, who's a nice guy. I said he's a good who's a nice guy. I said he's a good who's a nice guy.","I said he's a good debater, but he's a bad talker does that debater. But he's a bad talker does that debater, but he's a bad talker. Does that make sense? We will build a wall and my make sense, we will build a wall and my make sense. We will build a wall and my wife said to me, that's the first time wife said to me, that's the first time wife said.","To me, that's the first time I've heard anyone say they're gonna, I've heard anyone say they're gonna, I've heard anyone say they're gonna build a wall. Nobody ever said did you build a wall? Nobody ever said, did you build a wall? Nobody ever said. Did you hear anybody say they're gonna build a, hear anybody say they're gonna build a, hear anybody say they're gonna build a wall other than Trump and when we get wall other than Trump and when we get wall other than Trump and when we Get Sheriff, Joe, that really is, you know that Sheriff, Joe, that really is, you know that Sheriff, Joe, that really is, you know, that really validates what I'm saying.","But we really validates what I'm saying. But we really validates what I'm saying. But we have to build a wall because without a have to build a wall because without a have to build a wall because without a wall, we don't have a country wall. We don't have a country wall. We don't have a country. People are pouring through our border, people are pouring through our border, people are pouring through our border and all over.","It's like a sieve, it's like and all over. It's like a sieve, it's like and all over. It's like a sieve. It's like water just pouring right through and water just pouring right through and water just pouring right through and then Obama issues an executive order and then Obama issues an executive order and then Obama issues an executive order and he said let them come in and amazingly He said, let them come in and amazingly he said let them come in and amazingly the courts at least temporarily have the courts at least temporarily have the courts at least temporarily have stopped him.","But it doesn't matter stopped him, but it doesn't matter stopped him. But it doesn't matter because if I get in, that'll be the first because if I get in, that'll be the first because if I get in, that'll be the first executive order I. And is that executive executive order I. And is that executive executive order I? And is that executive order, we won't have to waste our money order.","We won't have to waste our money order. We won't have to waste our money on lawyers. We're not gonna have to waste on lawyers. We're not gonna have to waste on lawyers. We're not gonna have to waste our money on those, so just a few things, our money on those. So just a few things, our money on those. So just a few things and then we're gonna have a big day and - and then we're gonna have a big day and - and then we're gonna have a big day.","And look, the big thing is you got to get out - look, the big thing is you got to get out - look, the big thing is you got to get out - you got a caucus. I mean, another poll. You got a caucus. I mean, another poll. You got a caucus, I mean, another poll just came out Quinnipiac very good. Paul just came out Quinnipiac very good.","Paul just came out Quinnipiac very good, Paul. It came and we're actually higher than it came and we're actually higher than it came and we're actually higher than even the Des Moines Register. Bloomberg even the Des Moines Register, Bloomberg even the Des Moines Register, Bloomberg which came out yesterday I guess there, which came out yesterday I guess there, which came out yesterday, I guess there we were five or six points now.","I think we were five or six points now. I think we were five or six points now. I think we're seven points up in Quinnipiac, but we're seven points up in Quinnipiac, but we're seven points up in Quinnipiac, but it all doesn't matter because I hear it all doesn't matter because I hear it all doesn't matter because I hear they all have these great Ground games, they all have these great ground games.","They all have these great ground games, they got people pouring in buses and they got people pouring in buses and they got people pouring in buses and trucks. And you know, they're spending trucks and you know, they're spending trucks and you know, they're spending, they're spending all of this money that they're spending all of this money that they're spending all of this money that they're given by the special interests they're given by the special Interests, they're given by the special interests and the lobbyists, and they're spending and the lobbyists and they're spending and the lobbyists and they're spending and they have unlimited money for that, and they have unlimited money for that and they have unlimited money for that.","And so do I - frankly - I mean, they're so - and so do I - frankly - I mean, they're so - and so do I frankly - I mean, they're - so far, I'm very proud of something I've far. I'm very proud of something I've far I'm very proud of. Something I've spent less money than anybody else and I spent less money than anybody else and I spent less money than anybody else and I have the best result.","I'm number one, have the best result. I'm number one, have the best result. I'm number one, it's great. It's great, it's great and that's what I want to do for our - and that's what I want to do for our - and that's what I want to do for our country. I mean, a guy like Bush, he spent country, I mean a guy like Bush, he spent country, I mean a guy like Bush, he spent a hundred million dollars in, he's down a hundred million dollars in.","He's down a hundred million dollars in. He's down at the bottom. They spent a hundred at the bottom. They spent a hundred at the bottom. They spent a hundred million for the - but for our country I million for the - but for our country I million for the - but for our country. I want the person that's going to spend want the person that's going to spend, want the person that's going to spend the least and get the best result you the least and get the best result you the least and get the best result.","You know right now it's Norway well, right know right now it's Norway well, right know right now it's Norway. Well right now in education, its Norway, Sweden now in education its Norway, Sweden now in education its Norway, Sweden, Denmark, China, these are all great places. Denmark, China, these are all great places, Denmark, China, these are all great places for education, right?","We're number 28 in for education, right? We're number 28 in for education, right? We're number 28. In other words, we're toward the bottom of other words. We're toward the bottom of other words. We're toward the bottom of the pack. We have - we have literally the pack we have - we have literally the pack we have.","We have literally nations that you wouldn't believe ahead nations that you wouldn't believe ahead nations that you wouldn't believe ahead of us. They're like third world nations of us. They're like third world nations of us. They're like third world nations ahead of us in education. And yet we ahead of us in education and yet we ahead of us in education and yet we spend more money per pupil than anybody spend more money per pupil than anybody spend more money per pupil than anybody else by far.","Second place doesn't even else by far second place, doesn't even else by far. Second place doesn't even exist. It's so far behind. So we spend exist. It's so far behind. So we spend exist. It's so far behind. So we spend more money. That's like Jeb Bush, we spend more money. That's like Jeb Bush. We spend more money.","That's like Jeb Bush, we spend more money and we have a bad result, more money. And we have a bad result, more money. And we have a bad result. We're going to spend less money. We're - we're going to spend less money. We're - we're going to spend less money. We're gonna bring it back locally, you're gonna gonna bring it back locally, you're gonna gonna bring it back locally, you're gonna take over you, it's gonna be so beautiful take over you, it's gonna be so beautiful take over you.","It's gonna be so beautiful and you know, I've seen it, I've watched and you know, I've seen it, I've watched and you know, I've seen it, I've watched it because over the years I've watched it because over the years I've watched it because over the years I've watched it, I've seen parents that really joined it.","I've seen parents that really joined it. I've seen parents that really joined their school boards and joined their their school boards and joined their their school boards and joined their whole little circle of friends to make a whole little circle of friends to make a. Whole little circle of friends to make a school beautiful and good and their sons school beautiful and good and their sons school beautiful and good and their sons and daughters graduate and they stay on and daughters graduate and they stay on and daughters graduate and they stay On - and they love it, they love it, they do it and they love it, they love it, they do it and they love it, they love it, they do it with love and with intelligence by the - with love and with intelligence by the - with love and with Intelligence, by the way, but they do it with love instead of way.","But they do it with love instead of way. But they do it with love. Instead of having the bureaucrats from Washington having the bureaucrats from Washington having the bureaucrats from Washington running schools in Iowa, which is running schools in Iowa, which is running schools in Iowa, which is ridiculous.","So someday we're going to I ridiculous. So someday we're going to I ridiculous. So someday we're going to - I get in - I'm telling you we're gonna spend get in. I'm telling you we're gonna spend get in. I'm telling you we're gonna spend less money. We're gonna have much better, less money, we're gonna have much better, less money.","We're gonna have much better results, not only an education on results, not only an education on results, not only an education on everything else. You look at the military, everything else, you look at the military, everything else, you look at the military, we have a military that's being - we have a military that's being - we have a military that's being decimated, it's being decimated and the decimated, it's being decimated and the Decimated it's being decimated and the money we - you tree that, nobody knows where they're tree that nobody knows where they're tree that nobody knows where they're from, where they are.","And as I left this from where they are and as I left this from where they are and as I left this morning, I saw something very interesting morning. I saw something very interesting morning. I saw something very interesting in Sweden. They had gangs of people in, in Sweden, they had gangs of people in, in Sweden, they had gangs of people in masks and others, Swedish people that masks and others, Swedish people that masks and others, Swedish people that were going after the migrants because were going after The migrants because were going after the migrants because there's been tremendous crime committed, there's been tremendous crime committed.","There's been tremendous crime committed and they've had enough, you know, they've - and they've had enough, you know, they've - and they've had enough, you know, they've had enough - they've had enough of the had enough - they've had enough of the had enough, they've had enough of the stupidity. And these people we - I believe stupidity and these people we I believe stupidity and these people we I believe in protecting people, but you build a - in protecting people, but you build a in protecting people, but you build a safe zone.","I was the first one to say it safe zone. I was the first one to say it safe zone. I was the first one to say it build a big fat, beautiful, safe zone, build a big fat, beautiful, safe zone, build a big fat, beautiful safe zone someplace in Syria, where you can you someplace in Syria, where you can you someplace in Syria, where you can You know where you can have it right and you know where you can have it right and you know where you can have it right and you build it and you put, but you get the build it and you put, but you get the build it and You put - but you get the Gulf states, the Gulf states, Saudi Arabia, Gulf states, the Gulf states, Saudi Arabia, Gulf states, the Gulf states, Saudi Arabia before the oil came down.","But they're before the oil came down. But they're - before the oil came down. But they're still doing very well, of course, the still doing very well, of course, the still doing very well, of course, the bless to take out oil than anyplace else bless to take out oil than anyplace else bless to take out oil than anyplace else.","But Saudi Arabia was making a billion, but Saudi Arabia was making a billion, but Saudi Arabia was making a billion dollars a day and we protect them for dollars a day and we protect them for dollars a day and we protect them for nothing. It's gonna all change folks, it's nothing, it's gonna all change folks.","It's nothing, it's gonna all change folks, it's gonna all change. We spent so much money gonna all change. We spent so much money gonna all change. We spent so much money, everyone says, oh, well, we spend 10 times, everyone says, oh, well, we spend 10 times, everyone says, oh, well, we spend 10 times more than every other country or any more than every other country or any more than every other country or Any other country and even more than that other country and even more than that other country and even more than that.","But you know, we do, we spend it all but you know we do, we spend it all but you know we do, we spend it all protecting, we spend so much of it protecting we spend so much of it protecting we spend so much of it protecting Other countries and in some protecting other countries and in some protecting other countries and in some cases those other countries are economic cases.","Those other countries are economic cases. Those other countries are economic behemoths like Germany, like Japan, like behemoths, like Germany, like Japan, like behemoths, like Germany, like Japan, like South Korea. We protect South Korea and I - South Korea, we protect South Korea and I - South Korea, we protect South Korea and I have friends by the way love the people have friends by the way, love the people have friends by the way, love the people of Germany, love The people of Japan, love of Germany, love the people of Japan, love of Germany, love the people of Japan, love the people of South Korea have buildings.","The people of South Korea have buildings. The people of South Korea have buildings in South Korea. It's a very great place in South Korea. It's a very great place in South Korea. It's a very great place. But we have 28,000 soldiers, 28,000 on, but we have 28,000 soldiers, 28,000 on, but we have 28,000 soldiers, 28,000 on our line.","We have 28,000. Think of it, we - our line, we have 28,000, think of it. We - our line, we have 28,000. Think of it. We get like peanuts. So we're protecting, get like peanuts. So we're protecting, get like peanuts. So we're protecting them and try ordering a television, set them and try ordering a television, set them and try ordering a television set, just give it a shot made in the USA, just give it a shot made in the USA, just give it a shot made in The USA, there is no such thing, no such animal, there is no such thing, no such animal.","There is no such thing, no such animal, they're all made in South Korea and - and they're all made in South Korea and - and they're all made in South Korea and - and a little bit Japan because of Sony, but a little bit Japan because of Sony. But a little bit Japan because of Sony, but they're all made - most of them made in a - they're all made - most of them made in a - they're all made - most of them made in a order of thousands and thousands of order of thousands and thousands of order Of thousands and thousands of televisions a year and they're all made televisions a year and they're all made televisions a year and they're all made in South Korea.","I can't - I'd love to buy in South Korea. I can't - I'd love to buy in South Korea. I can't. I'd love to buy here, I would love to buy here, but you here I would love to buy here, but you here I would love to buy here, but you can't buy here. So we're gonna have them, can't buy here. So we're gonna have them.","Can't buy here, so we're gonna have them and this isn't like anything other than and this isn't like anything other than and this isn't like anything other than, hey, folks, you got to take care of us. Hey, folks, you got to take care of us. Hey, folks, you got to take care of us. This is a two-way street.","This is not a - this is a two-way street. This is not a - this is a two-way street. This is not a one-way street. We protect all these one-way street. We protect all these one-way street. We protect all these people every time this madman people every time this madman people, every time this madman such talking nuclear, we immediately such talking nuclear.","We immediately such talking nuclear. We immediately sends our ships and we don't get it. They sends our ships and we don't get it, they sends our ships and we don't get it. They pay us nothing. They pay us. Peanuts pay us, nothing. They pay us. Peanuts pay us nothing. They pay us peanuts compared to what it's costing us.","So what compared to what it's costing us, so what compared to what it's costing us. So what are we doing it for? Do you know that we are we doing it for - do you know that we are we doing it for - do you know that we have a pact with Japan that if Japan is - have a pact with Japan that if Japan is - have a pact with Japan that If Japan is attacked, we have to go to war, we go to attacked, we have to go to war, we go to attacked, we have to go to war, we go to war right away.","We're gonna protect your war right away. We're gonna protect your war right away. We're gonna protect your PIN, okay? But if we're attacked Japan PIN, okay. But if we're attacked Japan PIN, okay. But if we're attacked, Japan doesn't have to do anything, okay, that's doesn't have to do anything, okay, that's doesn't have to do anything, okay, that's the way we have.","In other words, if the way we have, in other words, if the way we have - in other words, if somebody attacks us, Japan doesn't have somebody attacks us. Japan doesn't have somebody attacks us. Japan doesn't have to do a thing. But if Japan is attacked to do a thing, but if Japan is attacked to do a thing, but if Japan is attacked, we have to immediately come to their - we have to immediately come to their - we have to immediately come to their defense, go to war, do Whatever is defense go to war, do whatever is defense go to war, do whatever is necessary and just not fair, it's not necessary and just not fair, it's not necessary and just not fair, it's not even a question of not fair.","It's that even a question of not fair, it's that even a question of not fair. It's that smart, it's not good and they don't even smart. It's not good and they don't even smart. It's not good and they don't even respect us for it because they say can respect us for it because they say can respect us for it because they say, can you believe, I can just see these people you believe.","I can just see these people you believe. I can just see these people they say can you believe how stupid they they say can you believe how stupid they they say can you believe how stupid they are, who would make deals like this and are who would make deals like this and are who would Make deals like this and we have many of them.","So we protect, we have many of them. So we protect, we have many of them. So we protect Germany, we protect Saudi Arabia, we, Germany, we protect Saudi Arabia, we - Germany, we protect Saudi Arabia. We protect different places in the Middle, protect different places in the Middle, protect different places in the Middle East.","These Gulf states aren't putting up East. These Gulf states aren't putting up East. These Gulf states aren't putting up any money toward the migrants and by the - any money toward the migrants and by the - any money toward the migrants. And by the way, I have a big heart. I want to take way I have a big heart.","I want to take way I have a big heart. I want to take care. I wait, but they're not coming into care. I wait, but they're not coming into care. I wait, but they're not coming into this country because we don't know who this country because we don't know who this country because we don't know who they are.","There's no way of finding out they are - there's no way of finding out they are - there's no way of finding out who they are. They have no papers, no, who they are. They have no papers, no, who they are. They have no papers, no documentation. They could be Isis and you documentation, they could be Isis and you documentation, they could be Isis.","And you look at those migration lines, you look look at those migration lines, you look, look at those migration lines, you look at that great migration, have you ever at that great migration, have you ever at that great migration? Have you ever seen so many people? It's like what are seen so many people.","It's like what are seen so many people. It's like what are the lines trying to get into our event, the lines trying to get into our event, the lines trying to get into our event the other night when we had it. The other - the other night when we had it, the other the other night when we had it the other night for the veterans, it was - I mean night for the veterans, it was - I mean night for the veterans, it was - I mean, literally it was.","So we could have filled literally it was so we could have filled literally it was. So we could have filled up that arena. We could have filled it up up that arena. We could have filled it up up that arena. We could have filled it up ten times over, it was the most ten times over. It was the most ten times over.","It was the most incredible thing. But when you look at incredible thing, but when you look at incredible thing, but when you look at that migration, so many people so many that migration so many people so many that migration so many people so many people and what's the story so many people and What's the story so many people and what's the story?","So many young, strong men, young, strong men and young, strong men, young, strong men and young, strong men, young, strong men. And you say what's going on? You say what's going on? You say what's going on. This doesn't look right. I mean, there's - this doesn't look right. I mean, there's - this doesn't look right.","I mean, there's something wrong here. So we are - we're not something wrong here. So we are - we're not something wrong here. So we are - we're not going to allow them. And if I win, they going to allow them and if I win, they going to allow them. And if I win, they have to go back. They're gonna have to go have to go back.","They're gonna have to go have to go back. They're gonna have to go back because we cannot allow our country back because we cannot allow our country back because we cannot allow our country to be riddled with problems any more to be riddled with problems any more to be riddled with problems any more than We already have than we already have than we already have.","We have a tremendous immigration problem. We have a tremendous immigration problem. We have a tremendous immigration problem. We have so many different problems. We - we have so many different problems. We - we have so many different problems. We don't know where these people come from. Don't know where these people come from.","Don't know where these people come from. We're never going to be able to find out. We're never going to be able to find out. We're never going to be able to find out where they come from. It could be the - where they come from, it could be the - where they come from, it could be the great Trojan horse of all time, great Trojan horse of all time, great Trojan horse of all time gonna have to go back.","We're gonna try gonna have to go back, we're gonna try gonna have to go back. We're gonna try and get the Gulf states. I would put I and get the Gulf states. I would put I and get the Gulf states. I would put - I tell you what, I'll put a lot of pressure tell you what I'll put a lot of pressure tell you what.","I'll put a lot of pressure on them because I don't want to spend on them because I don't want to spend on them. Because I don't want to spend our money, I want a safe zone, but I don't - our money, I want a safe zone, but I don't - our money, I want a safe zone, but I don't want to spend a lot of money on it, want to spend a Lot of money on it want to spend a lot of money on it because we don't have a lot of money because we don't have a lot of money because we don't have a lot of money.","That's why we should have never given. That's why we should have never given that's why we should have never given the money. Back to Iran, 150 billion, the money back to Iran, 150 billion, the money back to Iran, 150 billion dollars. We should have told her I'm dollars. We should have told her I'm dollars, we should have told her.","I'm sorry, we don't have it. We don't have it. Sorry, we don't have it. We don't have it. Sorry, we don't have it. We don't have it - sorry, folks. And we should have never - sorry, folks. And we should have never - sorry, folks and we should have never ever started that negotiation until we ever started that negotiation until we ever started that negotiation until we got to gut our prisoners back to go got to gut our prisoners back to go got to gut.","Our prisoners back to go through that whole negotiation and you through that whole negotiation and you through that whole negotiation and you watch that's going to lead to a lot of watch that's going to lead to a lot of watch that's going to lead to a lot Of bad things because we essentially paid bad things because we essentially paid bad things because we essentially paid 150 billion dollars to get our prisoners 150 billion dollars to get our prisoners 150 billion dollars to get our prisoners back.","That's gonna that's gonna lead to a back that's gonna that's gonna lead to a back that's gonna that's gonna lead to a lot of bad things. So I just want to say lot of bad things. So I just want to say lot of bad things. So I just want to say tonight is so important, this is the tonight is so important, this is the tonight is so important.","This is the beginning of taking our country back, beginning of taking our country back, beginning of taking our country back. It's going to be an amazing period of it's going to be an amazing period of it's going to be an amazing period of time. We're gonna all remember each other time, we're gonna all remember each other time, we're gonna all remember each other, I'm gonna, remember you, I'm gonna, I'm gonna, remember you, I'm gonna, I'm gonna, remember you, I'm gonna remember the Crowds and the - the - remember the crowds and the - the remember the crowds and the - the unbelievable positive, I mean they people unbelievable positive.","I mean they people unbelievable positive. I mean, they - people love this country so much. Somebody asked love this country so much. Somebody asked love this country so much, somebody asked me before. One of the reporters called me before, one of the reporters called me before, one of the reporters called they say what have you learned.","I said I they say what have you learned. I said I they say what have you learned, I said I learned how much people love our country, learned how much people love our country, learned how much people love our country. They love our country, it's incredible. They love our country, it's incredible. They love our country.","It's incredible when I see what goes on. It's just when I see what goes on, it's just when I see what goes on, it's just incredible when I see the kind of when incredible - when I see the kind of when incredible - when I see the kind of when we have 21,000 people in Dallas and We - we have 21,000 people in Dallas and we - we have 21,000 people in Dallas and we have so many men that the crowds are so have so many men that the crowds are so have so many men that the crowds are so incredible.","We have 35,000 people in incredible. We have 35,000 people in incredible. We have 35,000 people in Mobile, Alabama a couple of weeks ago. We Mobile Alabama a couple of weeks ago. We Mobile Alabama a couple of weeks ago, we had 20,000 people in Oklahoma and now had 20,000 people in Oklahoma and now had 20,000 people in Oklahoma.","And now we're leading all the polls. And we're - we're leading all the polls and we're - we're leading all the polls. And we're leading Iowa, but it doesn't mean leading Iowa, but it doesn't mean leading Iowa. But it doesn't mean anything you got to go out tonight. And anything you got to go out tonight and anything you got to go out tonight and caucus, I mean, you people are all fans caucus.","I mean, you people are - all fans caucus. I mean, you people are all fans and you're fans of ourselves. But tonight, and you're fans of ourselves, but tonight and you're fans of ourselves. But tonight, you have to go out and caucus and it. You have to go out and caucus and it. You have to go out and caucus and it looks like the snow storm is not going.","Looks like the snow storm is not going. Looks like the snow storm is not going to be hitting us until sometime fairly to be hitting us until sometime fairly to be hitting us until sometime fairly late, like 1 o'clock, 2 o'clock, 3 o'clock late, like 1 o'clock, 2 o'clock, 3 o'clock late, like 1 o'clock, 2 o'clock, 3 o'clock in the morning, maybe even not even till in the morning, maybe even not even till in the morning, maybe even not even till the next day.","And so that's really good the next day and so that's really good the next day. And so that's really good because they all say the more people because they all say the more people because they all say the more people that go out, the more the better we're that go out, the more the better we're that go out, the more the better We're going to do - and I don't say me, I say we going to do and I don't say me, I say we going to do and I don't say me, I say we - because it is we - it's a movement.","It's we - because it is we - it's a movement, it's we - because it is we - it's a movement, it's we - so you've got to go out. So you've got to go out. So you've got to go out. I - I kid when I say if you're in bed, if I - I kid when I say if you're in bed, if I I kid when I say if you're in bed, if you're sick, if you can't walk if the - you're sick, if you can't walk - if the - You're sick, if you can't walk - if the doctor says you cannot leave, I don't doctor says you cannot leave.","I don't doctor says you cannot leave, I don't care care care get out of bed and come. You got it, do it get out of bed and come, you got it, do it get out of bed and come, you got it, do it, you got ta do it. So hopefully tonight you got ta do it. So hopefully tonight you got ta do it. So hopefully tonight, we're going to have the beginning of - we're going to have the beginning of - we're going to have the beginning of what is going to be in a certain way, a, what is going to be in a certain way, a, what is going to be In a certain way, a very positive revolution, I mean this very positive revolution.","I mean this very positive revolution. I mean this would be a very, very positive revolution would be a very, very positive revolution would be a very, very positive revolution. We're going to take our country back and we're going to take our country back and we're going to take our country back and we are going to make America great.","Again. We are going to make America great. Again. We are going to make America great again and I love you all and thank you all and I love you all and thank you all and I love you all and thank you all special people. Thank you all. Appreciate special people. Thank you all. Appreciate special people. Thank you all.","Appreciate it. I'll sign something. Thank you. Thank it. I'll sign something. Thank you. Thank it. I'll sign something. Thank you. Thank you all you."],"text":" Yeah, your governor, I mean the governor, yeah, your governor, I mean the governor, yeah, your governor, I mean the governor said you can't put Ted Cruz in because said you can't put Ted Cruz in because said you can't put Ted Cruz in because he's gonna destroy The ethanol business, he's gonna destroy the ethanol business. He's gonna destroy the ethanol business. That's it. I had no idea how many jobs it. That's it. I had no idea how many jobs it. That's it. I had no idea how many jobs it means for Iowa. That's a major industry means for Iowa. That's a major industry means for Iowa. That's a major industry in Iowa. So you have to remember that now in Iowa. So you have to remember that now in Iowa. So you have to remember that now I had a debate that I wasn't treated, I had a debate that I wasn't treated. I had a debate that I wasn't treated properly on. So what I did is I said you properly on. So what I did is I said you properly on, so what I did is I said, you know, you have to treat properly, you have know you have to treat properly, you have know you have to treat properly, you have to treat people properly and I wasn't To treat people properly and I wasn't to treat people properly and I wasn't treated properly and that's okay, I mean treated properly and that's okay, I mean treated properly and that's okay. I mean, I've been there before. I've been there before. I've been there before, right? But what I did is I said I'm gonna, right, but what I did is I said I'm gonna, right, but what I did is I said I'm gonna have a little event, not a competing, have a little event, not a competing, have a little Event not a competing event and it wasn't a big deal event and it wasn't a big deal event and it wasn't a big deal. And I had no idea how well it was gonna and I had no idea how well it was gonna and I had no idea how well it was gonna turn out. So we had a 700 seat theater turn out. So we had a 700 seat theater turn out. So we had a 700 seat theater about five minutes away from where the - about five minutes away from where the - about five minutes away from where the debate was. And we had it for veterans, we debate was - and we had it for veterans, we debate was - and we had it for veterans. We had an event for veterans and at that had an event for veterans and at that had an event for veterans. And at that event, thank you. And the sad part is if I event thank you and the sad part is if I event thank you and the sad part is if I was in that debate, it didn't do very was in that debate. It didn't do very was in that debate. It didn't do very well. It had 12 million people. The one well it had 12 million people. The one well it had 12 million people. The one that I was in the first one had 24 most that I was in the first one had 24 most that I was in. The first one had 24 most 25 million people and that was an 25 million people and that was an 25 million people. And that was an all-time record in the history of cable, all-time record in the history of cable, all-time record in the history of cable television. And and honestly, if we had television and and honestly if we had television and and honestly, if we had - and very importantly, if I was there, we - and very importantly, if I was there, we - and very importantly, if I was there, we would have broken that record. But much would have broken that record, but much would have broken that record, but much more importantly by not doing it. We have more importantly by not doing it. We have more importantly by not doing it, we have to defend ourselves and we have to, to defend ourselves and we have to, to defend ourselves and we have to defend our country if you have a defend our country, if you have a defend our country, if You have a president, you have to have a president's president, you have to have a president's president. You have to have a president's going to defend your country, going to defend your country, going to defend your country more so than even himself or herself. I more so than even himself or herself I more so than even himself or herself, I mean has to happen. So I had a competing mean has to happen. So I had a competing mean has to happen. So I had a competing of it and we did it for veterans because of it and we did it for veterans because of it. And we did it for veterans because the veterans in this country have been the veterans in this country, have been the veterans in this country, have been treated so horribly. They've been treated, treated so horribly. They've been treated, treated so horribly. They've been treated so badly and we raised in one hour so badly and we raised in one hour so badly and we raised in one hour, listen to this one, six million dollars, listen to this one, six million dollars, listen to this one, six million dollars, okay. And I'm not gonna talk about polls today and I'm not gonna talk about polls today and I'm not gonna talk about polls today because frankly the polls today today we - because frankly the polls today today we - because frankly the polls today today we have Our ultimate poll, so I'd have to have our ultimate poll, so I'd have to have our ultimate poll. So I'd have to talk about Paul's. But the one that just talk about Paul's but the one that just talk about Paul's but the one that just came out of New Hampshire has as way way came out of New Hampshire has as way way came out of New Hampshire has as way, way up. Because of the debate, because of what up because of the debate because of what up because of the debate, because of what I did, people respected that we don't - I did people respected that we don't - I did people respected that. We don't take the stuff from people that you know take the stuff from people that you know take the stuff from people that you know shouldn't be treating us that way and shouldn't be treating us that way and shouldn't be treating us that way. And they respected it and I think they also - they respected it and I think they also - they respected it. And I think they also like the fact that we didn't just not do like the fact that we didn't just not do like the fact that we didn't just not do it. We did something that benefits. So it - we did something that benefits. So it - we did something that benefits so many people and in this case the - the many people and in this case the - the many people and in this case the - the great veterans and veterans causes and great veterans and veterans causes and great veterans and veterans causes. And so we've given away, I raised six, I have - so we've given away, I raised six. I have - so we've given away, I raised six, I have so many friends, Carl Icahn, who you don't so many friends, Carl Icahn who you don't so many friends. Carl Icahn, who you don't know, but he's a great businessman, he put know, but he's a great businessman, he put know, but he's a great businessman. He put up a half a million dollars, Phil Ruffin up a half a million dollars. Phil Ruffin up a half a million dollars. Phil Ruffin, a great businessman from Las Vegas, put a great businessman from Las Vegas, put a great businessman from Las Vegas, put up a million dollars, the great Ike, up a million dollars, the great Ike, up a million dollars. The great Ike Perlmutter and and Laurie Perlmutter, Perlmutter and and Laurie Perlmutter, Perlmutter and and Laurie Perlmutter, they put up a million dollars. Marvel, they put up a million dollars. Marvel, they put up a million dollars. Marvel Entertainment they did is incredible. The Entertainment they did is incredible. The Entertainment they did is incredible. The Marvel, you know, they make all the great Marvel, you know, they make all the great Marvel, you know, they make all the great movies. I think he's got like I think movies, I think he's got like I think movies, I think he's got like I think he's got five of the top ten grossing, he's got five of the top ten grossing. He's got five of the top ten grossing movies of all time. He's one of the great movies of all time. He's one of the great movies of all time. He's one of the great people and they are an amazing couple people and they are an amazing couple people and they are an amazing couple and they put up a million dollars and I - and they put up a million dollars and I - and they put up a Million dollars and I put up a million dollars and the bottom put up a million dollars and the bottom put up a million dollars and the bottom line is one hour six million dollars and line is one hour, six million dollars and line is one hour, six Million dollars and that evening was so beautiful. We had a - that evening was so beautiful. We had a - that evening was so beautiful. We had a veteran that came in, lost his leg and he veteran that came in, lost his leg and he veteran that came in, lost his leg. And he gave a speech, a talk and about coming, gave a speech, a talk and about coming, gave a speech, a talk and about coming back and coming back and how tough it back and coming back and how tough it back and coming back and how tough It was to come back from the Middle East was to come back from the Middle East was to come back from the Middle East and all of a sudden be in society again and all of a sudden be in society again. And all of a sudden be in society again and how difficult it was and how and how difficult it was and how and how difficult it was and how difficult it is for veterans generally difficult. It is for veterans generally difficult. It is for veterans generally and we have today one of our first and we have today one of our first and we have today one of our first recipients Americans for independent recipients, Americans for independent recipients, Americans for independent living. And we have Arnold and Kim and living and we have Arnold and Kim and living and we have Arnold and Kim and they're here now to pick up a check for they're here now to pick up a check for they're here now to pick up a check For $ 100,000, it's one we're gonna give about $ 100,000, it's one we're gonna give about $ 100,000. It's one we're gonna give about 22 or 24 checks out and they've all been 22 or 24 checks out. And they've all been 22 or 24 checks out and they've all been vetted. They've all been - you have the vetted, they've all been, you have the vetted, they've all been, you have the vets have been vetted because what we've vets have been vetted because what we've vets have been vetted because what we've done is we want to make sure that These done is we want to make sure that these done is we want to make sure that these are the - these people that get these are the - these people that get these are the - these people that get these checks are amazing. People, amazing people, checks are amazing. People amazing people checks are amazing people, amazing people and Arnold and Kim have you come up and Arnold and Kim have you come up and Arnold and Kim have you come up. We're going to give you a nice beautiful. We're going to give you a nice beautiful. We're going to give you a nice, beautiful check and these - they've done an check and these - they've done an check and these they've done an incredible, incredible, incredible. Just give a couple of minutes worth of just give a couple of minutes worth of just give a couple of minutes worth of what do you do because I know but they - what do you do because I know but they - what do you do because I know. But they don't know. Go ahead. Thank you everyone. Don't know. Go ahead. Thank you everyone. Don't know. Go ahead. Thank you everyone. I'm Tim with Americans for independent. I'm Tim with Americans for independent. I'm Tim with Americans for independent living new organization here in the living new organization here in the living new organization here in the Waterloo area. We're here to help our Waterloo area. We're here to help our Waterloo area. We're here to help our veterans that have returned home since veterans that have returned home since veterans that have returned home since 9/11 that have suffered major 9/11 that have suffered major 9/11 that have suffered major disabilities and we're looking to do the disabilities and we're looking To do the disabilities and we're looking to do the home modifications as much as we can to home modifications as much as we can to home modifications as much as we can to help them out that way so so they can help them out that way. So, so they can help them out that way. So so they can make a house a home like the rest of us make a house a home like the rest of us make a house a home like the rest of us live in and and enjoy life. Instead of live in and and enjoy life instead of live in and and enjoy life instead of struggling with the challenges that struggling with the challenges that struggling with the challenges that they've come up with and in protecting, they've come up with and in protecting, they've come Up with and in protecting us and giving us our right to do what we us and giving us our right to do what we us and giving us our right to do what we do. So this is what we're here for do. So this is what we're here for do. So this is what we're here for. Thank you very much. Appreciate, he said. Thank you very much. Appreciate he said. Thank you very much. Appreciate he said, we'll see you in the White House. That's - we'll see you in the White House, that's - we'll see you in the White House. That's nice. I like him now. These people are nice. I like him now. These people are nice. I like him now. These people are amazing. I mean, they devote their lives amazing. I mean they devote their lives amazing, I mean they devote their lives to it and we were very careful because to it. And we were very careful because to it and we were very careful because you know you have some people that don't, you know, you have some people that don't, you know you have some people that don't do as good a job and we say that's okay. Do as good a job and we say that's okay, do as good a job and we say that's okay, let somebody else help them, but these let somebody else help them, but these let somebody else help them. But these - some of the people that were giving this - some of the people that were giving this - some of the people that were giving this money to, you know it's they're money to, you know, it's they're money to, you know, it's - they're incredible people and such an Honor to incredible people and such an honor to incredible people and such an honor to be in a country with people like this be in a country with people like this be in a country with people like this and they really care. That's what they - and they really care, that's what they and they really care, that's what they want. They want to help people and so want - they want to help people and so want - they want to help people. And so we're very happy to be able to help them. We're very happy to be able to help them. We're very happy to be able to help them. Also, I have a couple of special people also. I have a couple of special people also. I have a couple of special people I'm going to introduce, right, because I - I'm going to introduce right, because I - I'm going to introduce right, because I see them standing in the back wings, see them standing in the back wings, see them standing in the back wings. My wife Melania, who's been so supportive, my wife, Melania, who's been so supportive, my wife, Melania, who's been so supportive, come on up honey, so supportive. And my daughter thing look at ads. My and my daughter thing look at ads. My and my daughter thing, look at ads, my daughter, Ivanka, and her husband, Jared daughter, Ivanka and her husband, Jared daughter, Ivanka and her husband. Jared, come on up, come on, up, come on up, and Jared's a very successful man from and Jared's a very successful man from and Jared's a very successful man from New York. He's done a fantastic job New York. He's done a fantastic job. New York. He's done a fantastic job, creates a lot of housing for people and creates a lot of housing for people and creates a lot of housing for people and real estate. And Ivanka's, Ivanka, we know real estate and Ivanka's, Ivanka, we know real estate and Ivanka's Ivanka. We know Ivanka right and she's gonna have a baby Ivanka right and she's gonna have a baby Ivanka right and she's gonna have a baby perhaps in ten minutes or a week or two, perhaps in ten minutes or a week or two perhaps in Ten minutes or a week or two weeks or something, but we're ready, I you weeks or something, but we're ready. I you weeks or something, but we're ready. I you know the joke has been going over. I said, know the joke has been going over. I said know the joke has been going over. I said please. Please have your baby in Iowa. I please please have your baby in Iowa. I please please have your baby in Iowa. I would not lose this. It's no way I could would not lose this. It's no way I could would not lose this, it's no way I could lose. We're all prepared. We even have a lose. We're all prepared. We even have a lose. We're all prepared. We even have a place picked out. But you know, perhaps place picked out but you know perhaps place picked out, but you know perhaps that won't happen, but I just want to - that won't happen, but I just want to - that won't happen, but I just want to thank you all for being here. Ivanka you thank you all for being here. Ivanka you. Thank you all for being here. Ivanka, you want to say a word for a second. It has want to say a word for a second. It has want to say a word for a second. It has been such a pleasure to be here for the been such a pleasure to be here for the been such a pleasure to be here for the last several days with my father going last several days with my father going last several days with my father Going around and meeting the amazing people of around and meeting the amazing people of around and meeting the amazing people of Iowa, the reception has been so warm and Iowa, the reception has been so warm and Iowa, the reception has been so warm. And I think that's in part because my - I think that's in part because my - I think that's in part because my father's really created a movement with father's really created a movement with father's, really created a movement with all of your help. People want to see all of your help. People want to see all of your help. People want to see change and he's gonna effectuate that change and he's gonna effectuate that change and he's gonna effectuate that change. It's been what he's done. His change. It's been what he's done, his change. It's been what he's done, his whole life. So my father will undoubtably whole life. So my father will undoubtably whole life. So my father will undoubtably make America great again and we make America great again and we make America great again and we appreciate your support. So come out, appreciate your support. So come out, appreciate your support. So come out tonight, seven o'clock in caucus for tonight, seven o'clock in caucus for tonight, seven o'clock in caucus for Donald, J Trump. Thank you everyone for Donald J Trump. Thank you everyone for Donald J Trump. Thank you everyone for being here. Nice family is always the best thing you - nice family is always the best thing. You - nice family is always the best thing. You know that right. People say I talk on know that right. People say I talk on know that right. People say, I talk on success and now, but it's true success and now but it's true success and now but it's true, I talked so much on success where they - I talked so much on success where they - I talked so much on success where they asked me Would you make a speech on asked me, would you make a speech on asked me, would you make a speech on success? I give a lot of money to charity success. I give a lot of money to charity success. I give a lot of money to charity talking about success and we get these talking about success and we get these talking about success and we get these big big crowds and people say what is it big, big crowds and people say what is it big, big Crowds and people say what is it like I said, let me tell you the most. Like I said, let me tell you the most. Like I said, let me tell you the most important thing is family. It's really important thing is family, it's really important thing is family. It's really true. If you have - I've seen people, I've true if you have, I've seen people, I've true if you have, I've seen people, I've seen the most successful people in the - seen the most successful people in the - seen the most successful people in the world. I deal with them, some of them are world, I deal with them, some of them are world, I deal with them, some of them are giving me money for the vets, but I deal giving me money for the vets, but I deal giving me money for the Vets, but I deal with them all the time and they have with them all the time and they have with them all the time and they have tremendous money and they've done a tremendous money and they've done a tremendous money and they've done a tremendous job and They put two, you know, tremendous job and they put two, you know, tremendous job and they put two, you know, working lots of jobs, lots of Education, working lots of jobs, lots of Education, working lots of jobs, lots of Education for families and hospitalization and all for Families and hospitalization and all for families and hospitalization and all sorts of things. But when you have great sorts of things, but when you have great sorts of things. But when you have great family life, you have a wife and family, family life, you have a wife and family, family life, you have a wife and family that you love or you have a husband that that you love or you have a husband that that you Love or you have a husband that you love with your family, it's honestly you love with your family. It's honestly you love with your family. It's honestly - those are the people that I see that are - those are the people that I see that are - those are the people that I see that are most successful people, some of the most successful people, some of the most successful people. Some of the people that have made this vast sum of people that have made this vast sum of people that have made this vast sum of money have and not all, but some of them money have and not all, but some of them money have and not All - but some of them are actually not happy at all and so are actually not happy at all and so are actually not happy at all. And so when you say who's the successful person, when you say who's the successful person, when you say who's the successful person, somebody that's really happy because of somebody that's really happy because of somebody that's really happy because of the family and because of whatever and the Family and because of whatever and the family and because of whatever and or somebody that's made, you know or somebody that's made, you know or somebody that's made you know, billions of dollars and does not feel so billions of dollars and does not feel so billions of Dollars and does not feel so great about themselves and there's great about themselves and there's great about themselves and there's always wanting more, more and more. You always wanting more, more and more. You always wanting more more and more. You know, it's like an interesting thing. But know, it's like an interesting thing, but know it's like an interesting thing. But the happiest people I've seen are the - the happiest people I've seen are the - the happiest people I've seen are the people with the great family life and by people with the great family life and by people with the great family life. And by the way, believing in God so important, the way believing in God so important, the way believing in God so important and I've seen that so much so important and I've seen that so much so important and I've seen that so much. So important so important and I have to tell you, you so important and I have to tell you, you so important and I have to tell you, you know, I've been in Iowa now for a long know. I've been in Iowa now for a long know. I've been in Iowa now for a long time. We've made many, many trips here time. We've made many, many trips here time. We've made many, many trips here, many, many stops that I've got to know. Many, many stops that I've got to know. Many, many stops that I've got to know many people, the evangelicals have been many people. The evangelicals have been many people. The evangelicals have been unbelievable to Donald Trump. They have unbelievable to Donald Trump. They have unbelievable to Donald Trump. They have been unbelievable. Boy, do they understand been unbelievable? Boy, do they understand been unbelievable? Boy, do they understand me? They understand me better than me. They understand me better than me. They understand me better than anybody. I said that this morning to anybody I said that this morning to anybody. I said that this morning to somebody I said I think the evangelicals somebody I said I think the evangelicals somebody I said, I think the evangelicals really do get me, but we're going to really do get me. But we're going to really do get me. But we're going to protect so many things we're going to protect so many things we're going to protect so many things we're going to protect our country, we're going to protect our country, we're going to protect our country, we're going to protect Christianity, you know, protect Christianity. You know, protect Christianity, you know, Christianity is under siege folks. It's Christianity is under siege folks. It's Christianity is under siege folks. It's under under under and we're gonna protect it and you know and we're gonna protect it and you know and we're gonna protect it and you know what Jerry Falwell was here yesterday what Jerry Falwell was here yesterday, what Jerry Falwell was here yesterday, Jerry Falwell Jr, who's an amazing guy, he Jerry Falwell Jr, who's an amazing guy, he Jerry Falwell Jr, who's an amazing guy. He built with his father, Liberty University, built with his father, Liberty University, built with his father, Liberty University. And I was there two weeks ago and we set and I was there two weeks ago and we set and I was there two weeks ago and we set a record in terms of attendance. But he's a record in terms of attendance. But he's a record in terms of attendance, but he's seen everybody come through Liberty, seen everybody come through Liberty, seen everybody come through Liberty because each one of the candidates, because each one of the candidates, because each one of the candidates automatically, it's like an automatic automatically. It's like an automatic automatically, it's like an automatic stop and I guess every single candidate stop and I guess every single candidate stop and I guess every single candidate went through and what he endorsed me as went through and what he endorsed me as went through and What he endorsed me as a person, he endorsed me. I was one of the a person he endorsed me. I was one of the a person he endorsed me. I was one of the great compliments that I could have had great compliments that I could have had great compliments that I could have had because he knows them all. He sees them because he knows them all. He sees them because he knows them all. He sees them all, not an easy thing for him to do he all, not an easy thing for him to do he all, not an easy thing for him to do. He doesn't do that. I think this is the - doesn't do that. I think this is the - doesn't do that. I think this is the first time. So when he came out and did first time, so when he came out and did first time, so when he came out and did that, to me that was a great compliment. That to me that was a great compliment that to me that was a great compliment and I think it had a huge impact frankly. And I think it had a huge impact frankly. And I think it had a huge impact, frankly, because our numbers with evangelicals, because our numbers with evangelicals, because our numbers with evangelicals, they were good before, but they weren't - they were good before, but they weren't - they were good before, but they weren't shooting through-the-roof. So a shooting through-the-roof, so a shooting through-the-roof. So a combination of Jerry and Sarah Palin, who combination of Jerry and Sarah Palin, who combination of Jerry and Sarah Palin, who is a terrific person and a terrific, is a terrific person and a terrific - is a terrific person. And a terrific woman, she came out and endorsed us and woman. She came out and endorsed us and woman. She came out and endorsed us and that was so nice and so great and I - that was so nice and so great and I - that was so nice and so great and I think that had an impact and on the think that had an impact. And on the think that had an impact and on the border who's better than Sheriff Joe of border who's better than Sheriff Joe of border who's better than Sheriff Joe of Arizona, right? You know, all of these Arizona, right? You know, all of these Arizona, right? You know, all of these people are fighting and fighting and people are fighting and fighting and people are fighting and fighting and fighting and trying to say they're there fighting and trying to say they're there fighting and trying to say they're there. It's very interesting because we're - it's very interesting because we're - it's very interesting because we're gonna have a lot of things. We're gonna gonna have a lot of things. We're gonna gonna have a lot of things. We're gonna do things that have not been done. I mean do things that have not been done. I mean do things that have not been done. I mean we're gonna build that wall. It's gonna, we're gonna build that wall, it's gonna, we're gonna build that wall, it's gonna be a beautiful, big, strong, powerful wall, be a beautiful, big, strong, powerful wall, be a beautiful big, strong, powerful wall and people are gonna come through. But - and people are gonna come through, but - and people are gonna come through, but they're gonna come through legally. They're gonna come through legally. They're gonna come through legally legally. They're coming through the world legally. They're coming through the world legally. They're coming through the world labor and - and that's awareness and it's labor and - and that's awareness and it's labor. And - and that's awareness and it's - it's gonna be a great thing and it's - it's gonna be a great thing and it's - it's gonna be a great thing and it's gonna be wonderful to have a border gonna be wonderful to have a border Gon na be wonderful to have a border, we're gonna have a border and we are - we're gonna have a border and we are - we're gonna have a border and we are going to, you know who's paying for the going to you know who's paying For the going to, you know who's paying for the world, Mexico's paying for the law, okay? I world Mexico's paying for the law, okay? I world Mexico's paying for the law, okay? I won't - even - I won't put you through the won't even - I won't put you through the won't even - I won't put you through the exit, who's paying for the wall. Everybody exit, who's paying for the wall, everybody exit, who's paying for the wall. Everybody knows and they're going to - and the other knows and they're going to - and the other knows and they're going to - and the other candidates come up and they say why is candidates come up and they say why is candidates come up and they say why is Mexico paying, how can you do that, Mexico paying, how can you do that, Mexico paying, how can you do that? They're not gonna pay for the ways of they're not gonna pay for the ways of they're not gonna pay for the ways. Of course, they are - they make so much money course they are - they make so much money course they are - they make so much money off the United States in terms of trade off the United States in terms of trade off the United States in terms of trade Deficits and trade the numbers are deficits and trade. The numbers are deficits and trade. The numbers are astronomical. I'm not even including the astronomical. I'm not even including the astronomical. I'm not even including the drug traffic which probably triple said drug traffic, which probably triple said drug traffic, which probably triple said I'm sure you know the drugs come over. So I'm sure you know the drugs come over. So I'm sure you know the drugs come over. So we get the drugs, they get the cash this we get the drugs, they get the cash this we get the drugs they get the cash. This is the way they have trucks, they drive is the way they have trucks. They drive is the way they have trucks. They drive right over that. You ever see the walls right over that you ever see the walls right over that you ever see the walls would have a wall this high and they would have a wall this high and they would have a wall this high and they build a little ramp. I don't even know build a little ramp, I don't even know build a little ramp. I don't even know why they build a ramp, why they build a ramp, why they build a ramp, just bulldoze it and just drive straight just bulldoze it and just drive straight. Just bulldoze it and just drive straight, you don't need a ramp. I don't know why you don't need a ramp. I don't know why you don't need a ramp. I don't know why they do that. I guess they don't want to - they do that. I guess they don't want to - they do that, I guess they don't want to hurt the wall, but they build a ramp and hurt the wall, but they build a ramp and hurt the wall, but they build a ramp and they have jeeps and they have these. They have jeeps and they have these - they have jeeps and they have these vehicles driving right over right over vehicles driving right over right over vehicles driving right over, right over its the most accredited in Time magazine, its the most accredited in Time magazine, its the most Accredited in Time magazine a picture of these vehicles driving over a picture of these vehicles driving over a picture of these vehicles driving over loaded up with drugs and we get the loaded up with drugs and we get the loaded up with drugs and we get the Drugs and you look at some places like drugs and you look at some places like drugs and you look at some places like New Hampshire, our next stop is New New Hampshire. Our next stop is New New Hampshire. Our next stop is New Hampshire. They have a drug problem that Hampshire, they have a drug problem that Hampshire, they have a drug problem that you wouldn't believe and you wouldn't - you wouldn't believe and you wouldn't - you wouldn't believe and you wouldn't think of that for New Hampshire. Think of that for New Hampshire, think of that for New Hampshire, it all comes from that southern border. It all comes from that southern border. It all comes from that southern border and they have an amazing problem up and they have an amazing problem up and they have an amazing problem up there and many of the New England states there and many of the New England states there and many of the New England states, but I mean our country as a whole, so. But I mean our country as a whole, so - but I mean our country as a whole, so they come up and they come pouring, they come up and they come pouring, they come up and they come pouring across and they come back with the cash across and They come back with the cash across and they come back with the cash. We're gonna stop it because this walls we're gonna stop it because this walls we're gonna stop it because this walls not gonna be a wall, you're gonna drive, not gonna be a wall, you're gonna drive, not gonna be a Wall, you're gonna drive over, see that ceiling, that ceilings over see that ceiling, that ceilings over see that ceiling, that ceilings peanuts compared to what we're talking peanuts compared to what we're talking peanuts compared to what we're talking about, okay? There's a real wall. This is a about, okay, there's a real wall. This is a about, okay, there's a real wall. This is a wall. If they ever get up there, they're wall. If they ever get up there, they're wall. If they ever get up there, they're not coming down because they're gonna not coming down because they're gonna not coming down because they're gonna say, wow, it's a problem. And I get a kick say, wow, it's a problem. And I get a kick say, wow, it's a problem and I get a kick out of I get a kick out of these people out of I get a kick out of these people out of I get a kick out of these people say, you know they Come out and they say, say, you know they come out and they say, say, you know they come out and they say the walls and the walls don't work walls, the walls and the walls, don't work walls, the walls and the walls don't work, walls don't work. I mean the walls they build don't work. I mean the walls they build don't work. I mean the walls they build don't work. You ever see these things don't work. You ever see these things don't work. You ever see these things that like make it a paper mache no this that like make it a paper mache no this that like make it a paper mache, no, this is the real deal, okay. This is - this is, is the real deal? Okay. This is - this is, is the real deal, okay, this is - this is gonna be - I know exactly what it's gonna gonna be. I know exactly what it's gonna gonna be. I know exactly what it's gonna look like. All right, that's what I do. I look like all right, that's what I do. I look like all right, that's what I do. I really build good. Wouldn't it be nice to really build good? Wouldn't it be nice to really build good? Wouldn't it be nice to have a real building? I'm a really what I have a real building. I'm a really what I have a real building. I'm a really - what I do best in life is build and I built do best in life is build and I built do best in life is build and I built these buildings that are so great these buildings that are so great these buildings that are so Great, whether you look - no matter where you - whether you look no matter where you - whether you look no matter where you look, whether you go to Chicago or New look whether you go to Chicago or New look whether you go to Chicago or New York or anywhere. I mean there right now York or anywhere, I mean there right now, York or anywhere. I mean there right now we have buildings going up all over the - we have buildings going up all over the - we have buildings going up all over the world. Doing this is actually tough world doing, this is actually tough world doing. This is actually tough because I love what I do so much, but because I love what I do so much, but because I love what I do so much, but with Ivanka Don, Eric, my executives I with Ivanka Don, Eric, my executives I with Ivanka Don. Eric, my executives, I have great executives, I've built a great, have great executives, I've built a great, have great executives, I've built a great, great company, a powerful company, very great company, a powerful company, very great company, a powerful company, very low debt, tremendous cash flow from Me I low debt, tremendous cash flow from me. I low debt, tremendous cash flow from me. I would have never believed that 20 years would have never believed that 20 years would have never believed that 20 years ago, 25 years ago, tremendous cash flow ago, 25 years ago, tremendous cash flow ago, 25 years ago, tremendous cash flow, some of the greatest assets in The world, some of the greatest assets in the world, some of the greatest assets in the world. And then I filed the papers and everyone and then I filed the papers and everyone and then I filed the papers. And everyone said, Wow, because I'm a private company said, Wow, because I'm a private company said, Wow, because I'm a private company, they said he's much bigger than anyone. They said he's much bigger than anyone. They said he's much bigger than anyone ever understood. And I've got rave ever understood and I've got rave ever understood and I've got rave reviews on it from a financial reviews on it, from a financial reviews on it from a financial standpoint. And I say it not in a standpoint, and I say it not in a standpoint and I say it not in a braggadocious way. That's the kind of braggadocious way. That's the kind of braggadocious way that's the kind of thinking we need in this country because thinking we need in this country because thinking we need in this country because we have people that don't know what we have people that don't know what we have, people that Don't know what they're doing. We have people that don't know what we have. People that don't know what we have people that don't know what they're doing. We have 19 trillion. They're doing. We have 19 trillion. They're doing. We have 19 trillion dollars, trillion down. Most people don't dollars trillion down, most people don't dollars trillion down. Most people don't even know what it means to say a even know what it means to say a even know what it means to say a trillion dollars. If this wasn't a word, trillion dollars. If this wasn't a word, trillion dollars, if this wasn't a word that was in the vocabulary ten years ago that was in the vocabulary ten years ago that was in the vocabulary ten years ago and now we have 19 trillion dollars and now we have 19 trillion Dollars and now we have 19 trillion dollars worth of debt. When you think of that now worth of debt, when you think of that now worth of debt, when you think of that now the budget they just approved two weeks, the budget, they just approved two weeks. The budget they just approved two weeks ago, which I don't know, I mean a lot of ago, which I don't know, I mean a lot of ago, which I don't know. I mean, a lot of years shaken, you had, you know, exactly years shaken, you had, you know, exactly years shaken, you had, you know exactly what I'm talking about, think that done. What I'm talking about, think that done. What I'm talking about think that done in like two, two days if not even two in like two, two days if not even two in like two, two days if not even two days. It was like a few hours, most people days it was like a few hours, most people days it was like a few hours. Most people didn't even know they were talking about, didn't even know they were talking about didn't even know they were talking about a budget and that budget funds a budget and that budget funds a budget and that budget funds everything for Obama, you know Obama's a everything For Obama, you know Obama's a everything for Obama, you know Obama's a terrible negotiator except when it comes terrible negotiator except when it comes terrible negotiator except when it comes to negotiating against the Republicans to negotiating against the Republicans to negotiating against the Republicans you ever notice. And I'm not angry, I'm you ever notice and I'm not angry. I'm you ever notice and I'm not angry. I'm not even angry you give up with this, not even angry you give up with this, not even angry you give up with this stuff. Obama who cares? I'm not angry at stuff, Obama who cares. I'm not angry at stuff. Obama who cares. I'm not angry at the Democrats because we understand the Democrats because we understand the Democrats because we understand where they're coming from. I'm angry at where they're coming from. I'm angry at where they're coming from. I'm angry at the Republicans because the Republicans, the Republicans because the Republicans, the Republicans because the Republicans roll over and they just allow all of the roll over and they just allow all of the roll over. And they just allow all of the stuff to take place and then they talk stuff to take place and then they talk stuff to take place and then they talk about we're going to try and balance our about. We're going to try and balance our about - we're going to try and balance our budget in 25 years, 25 years, budget in 25 years, 25 years budget in 25 years, 25 years. Why 25 years? We're getting rid of a lot why 25 years we're getting rid of a lot, why 25 years we're getting rid of a lot of things as an example, common core is of things as an example, common core is of things. As an example, common core is dead. It's gone, common core is gone, our dead, it's gone, common core is gone, our dead, it's gone, common core is gone. Our Second Amendment we are going to fight Second Amendment. We are going to fight Second Amendment we are going to fight. So that is not going to be chipped away. So that is not going to be chipped away. So that is not going to be chipped away at, you know, they're chipping away at at, you know, they're chipping away at at, you know, they're chipping away at your second Amendment and pretty soon if your second Amendment and pretty soon if your second Amendment and pretty Soon if it's up to some people, you won't have a - it's up to some people, you won't have a - it's up to some people, you won't have a second Amendment. You know, a couple of second Amendment, you know, a couple of second Amendment, you know a couple of things have happened, pretty big things. Things have happened pretty big things. Things have happened, pretty big things. I'll tell you Paris, remember California, I'll tell you Paris, remember California, I'll tell you Paris, remember California same thing, not as - not as great from the same thing, not as, not as great from the same thing, not as, not as great from the standpoint. We lost 14 great American standpoint. We lost 14 great American standpoint. We lost 14 great American people in, in Paris. What happened there, people in, in Paris, what happened there? People in, in Paris what happened there, what happened in California? Just think what happened in California, just think what happened in California, just think of this, the gun-free zones of this, the gun-free zones of this, the gun-free zones, Paris is one of the absolute toughest Paris is one of the absolute toughest Paris is one of the absolute Toughest places in the world to get a gun one of places in the world to get a gun one of places in the world to get a gun one of the absolute toughest. France is like the absolute toughest. France is like the absolute toughest. France is like said to be the toughest cutter you can't said to be the toughest cutter. You can't said to be the toughest cutter. You can't get a gun unless you're a bad guy what get a gun unless you're a bad guy what get a gun unless you're a bad guy. What happened is they walk in and they start happened is they walk in and they start happened is they walk in and they start shooting people if like a few of you shooting people if like a few of you shooting people if like a few of you People were in that room and you had people were in that room and you had people were in that room and you had guns strapped to your ankle, your waist guns strapped to your ankle, your waist guns strapped to your ankle, your waist and the bullets were Flying in the - and the bullets were flying in the - and the bullets were flying in the opposite direction. There wouldn't have opposite direction, there wouldn't have opposite direction. There wouldn't have been a hundred and thirty people killed, been a hundred and thirty people killed, been a hundred and thirty people killed by the way, 130 killed by the way 130 killed. By the way, 130 killed many, many, many right now in a hospital. Many, many, many right now in a hospital, many, many, many right now in a hospital, so gravely injured that they're not so gravely injured that they're not so gravely injured that they're not gonna make it. And if they do make it gonna make it. And if they do make it gonna make it and if they do make it, it's not gonna be a pleasant life, okay? It's not gonna be a pleasant life, okay? It's not gonna be a pleasant life, okay, because there was absolutely they could because there was absolutely they could because there was absolutely they could have stayed there longer and kept - have stayed there longer and kept - have stayed there longer and kept shooting. But they were just saying you shooting, but they were just saying you shooting, but they were just saying you over boom you over boom, these are over boom you over boom, these are over boom you over boom, these are animals, these are animals and then the animals. These are animals and then the animals, these are animals and then the press called the masterminds, the press called the masterminds, the press called the masterminds, the mastermind. They're not masterminds mastermind. They're not masterminds mastermind. They're not masterminds. They're animals and we have to stop it. They're animals and we have to stop it, they're animals and we have to stop it. We have to be so tough we have to be. So we have to be so tough we have to be. So we have to be so tough. We have to be so vigilant. We can't allow this to happen, vigilant. We can't allow this to happen, vigilant. We can't allow this to happen to our country. So in California, 14 to our country, so in California, 14 to our country. So in California, 14 people dead numerous people in the people dead, numerous people in the people dead, numerous people in the hospital, horribly injured 14, these two hospital horribly injured 14, these two hospital horribly injured 14. These two people that gave wedding parties for the people that gave wedding parties for the people that gave wedding parties for the people, they knew him, they knew him and people, they knew him, they knew him and people, they knew him, they knew him and they walk Into the room and they started, they walk into the room and they started, they walk into the room and they started shooting. So we have to be tough, we have shooting. So we have to be tough, we have shooting. So we have to be tough. We have to be vigilant, we can't allow it to - to be vigilant, we can't allow it to, to be vigilant, we can't allow it to happen and we have to protect our Second happen and we have to protect our Second happen and we have to protect our Second Amendment, if they had in California guns Amendment, if they had in California guns Amendment if they had in California guns, not many. Just if a couple of people that not many, just if a couple of people that not many. Just if a couple of people that knew how to use them were in that room, knew how to use them were in that room, knew how to use them were in that room. It would have ended long before the 14th. It would have ended long before the 14th, it would have ended long before the 14th person. I can tell you that and it's so person I can tell you that and it's so person I can tell you that and it's so sad. I mean you have another case which sad, I mean you have another case which sad I mean you have another case which is just absolutely crazy you have is just absolutely crazy. You have is just absolutely crazy. You have military bases and you have gun-free military bases and you have gun-free military bases and you have gun-free zones and military bases and we had five zones and military bases and we had five zones and military bases. And we had five great young people killed military. Great young people killed military, great young people killed military people, people, people, two of them were world champions, one of two of them were world champions, one of two of them were world champions. One of us is supposed to be one of the great us is supposed to be one of the great us is supposed to be one of the great experts on guns, a great shot, great experts on guns, a great shot, great experts on guns, a great shot, Great marksman and their guns were 200 yards, marksman and their guns were 200 yards marksman and their guns were 200 yards away. He locked up because they had a gun away. He locked up because they had a gun away. He locked up because they had a gun for his own and this wacko comes in sees for his own and this wacko comes in sees for his own and this wacko comes in, sees these five guys shoots up kills him. Now these five guys shoots up kills him. Now these five guys shoots up kills him. Now these were tough guys. These were guys - these were tough guys. These were guys - these were tough guys. These were guys that couldn't have been if they were - that couldn't have been. If they were - that couldn't have been - if they were having a gun, he wouldn't have lasted, he having a gun, he wouldn't have lasted, he having a gun, he wouldn't have lasted, he wouldn't - he would have not have gotten, wouldn't he would have not have gotten, wouldn't He would have not have gotten near the front door. I mean one of them near the front door. I mean one of them near the front door. I mean one of them they says one of the best, but there were - they says one of the best. But there were - they says one of the best, but there were all great soldiers. They weren't allowed all great soldiers. They weren't allowed all great soldiers. They weren't allowed to have a gun. Now they're supposed to, to have a gun. Now they're supposed to - to have a gun now they're supposed to protect us and they use guns and that's protect us and they use guns and that's protect us and they use guns and that's how they protect us and yet we have how they protect us. And yet we have how they protect us and yet we have gun-free zones. I will end gun-free zones, gun-free zones. I will end gun-free zones, gun-free zones. I will end gun-free zones on military bases so fast, your head will on military bases. So fast, your head will on military bases so fast, your head will spin, it'll be the first thing. The first spin, it'll be the first thing. The first spin, it'll be the first thing the first time. So they're chipping away at your faith. So they're chipping away at your faith, so they're chipping away at your faith. They're chipping away. I mean, the words they're chipping away. I mean, the words they're chipping away. I mean the words Merry Christmas, you're gonna say Merry Merry Christmas, you're gonna say Merry Merry Christmas, you're gonna say Merry Christmas. A lot. Believe me folks, you Christmas a lot. Believe me folks, you Christmas a lot. Believe me folks, you know, you go now to a store, you go to a know you go now to a store, you go to a know you go now to a store, you go to a department store like Macy's, very department store like Macy's, very department store. Like Macy's, very disloyal company, you go to - it's true disloyal company, you go to - it's true disloyal company, you go to - it's true first time I had when I went out is so first time I had when I went out is so first time I had when I went out is so true, I went out and I gave the opening true. I went out and I gave the opening true. I went out and I gave the opening remarks a nice little thing in Macy's remarks, a nice little thing in Macy's remarks, a nice little thing in Macy's, not big stuff. Tie shirts, I make the not big stuff, tie shirts, I make the not big stuff, tie shirts. I make the opening rods talking about illegal opening rods, talking about illegal opening rods, talking about illegal immigration. And they were told they're immigration and they were told they're immigration. And they were told they're gonna have a couple of pickets in front gonna have a couple of pickets in front gonna have a couple of pickets in front of Macy's. And what they did is they said of Macy's and what they did is they said of Macy's and what they did is they said, oh, oh, they called, Oh, what are we gonna? Oh, oh! They called - Oh, what are we gonna? Oh, oh! They called, Oh, what are we gonna do? What are these? Our people? I knew very do what are these our people. I knew very do what are these our people. I knew very well, not a big business, but they said I - well, not a big business, but they said I - well, not a big business, but they said, I said what's the big deal? They'll pick. It said what's the big deal? They'll pick. It said what's the big deal, they'll pick it for 20 minutes and then they want to go for 20 minutes and then they want to go for 20 minutes and then they want to go to lunch. It's not gonna be a bit who to lunch. It's not gonna be a bit who to lunch, it's not gonna be a bit who cares just at all, but this would be bad cares just at all, but this would be bad cares just at all, but this would be bad. In the meantime, you know, they paid all in the meantime, you know they paid all. In the meantime, you know they paid all sorts of penalties and fines for sorts of penalties and fines for sorts of penalties and fines for non-inclusion and lots of other things. Non-inclusion and lots of other things non-inclusion and lots of other things, okay, but they terminated. So they're very okay, but they terminated. So they're very okay, but they terminated. So they're very disloyal. I will never forget Macy's disloyal, I will never forget Macy's disloyal, I will never forget Macy's because I would have never thought that because I would have never thought that because I would have never thought that was possible and they did it over was possible and they Did it over was possible and they did it over illegal immigration, then it turned out illegal immigration, then it turned out illegal immigration. Then it turned out two weeks up. By the way, would we be two weeks up? By the way, would we be two weeks up by the way, would we be selling right now, shirts and ties and selling right now shirts and ties and selling right now, shirts and ties and perfumes and you can get them elsewhere, perfumes and you can get them Elsewhere, perfumes and you can get them elsewhere by the way go get them elsewhere. I don't by the way go get them elsewhere. I don't by the way go get them elsewhere. I don't like that. I never liked those stores like that. I never liked those stores like that. I never liked those stores very much anyway, very much anyway very much anyway but but if you think about it if you - but but if you think about it if you - but but if you think about it, if you think about it, you know the country's think About it, you know, the country's think about it, you know the country's about loyalty, you want loyalty in the about loyalty, you want loyalty in the about loyalty, you want loyalty in the country. So I mentioned during that country. So I mentioned during that country. So I mentioned during that speech, illegal immigration and all hell speech, illegal immigration and all hell speech, illegal immigration and all hell broke loose, right, broke loose, right, broke loose, right? I took heat Rush Limbaugh, who's an I took heat Rush Limbaugh, who's an I took heat Rush Limbaugh, who's an amazing guy, Drudge an amazing, you know, amazing guy, Drudge, an amazing, you know, amazing guy, Drudge, an amazing, you know Drudge. He's like one of the great people Drudge. He's like one of the great people Drudge. He's like one of the great people. He said he's a powerhouse, but - but I'll - he said he's a powerhouse, but - but I'll - he said he's a powerhouse. But - but I'll tell you a rush said, I've never seen tell you a rush said I've never seen tell you a rush said I've never seen anybody take more incoming than Donald. Anybody take more incoming than Donald. Anybody take more incoming than Donald Trump for saying something that was Trump for saying something that was Trump for saying something that was right two weeks later. Everyone's trying right two weeks later, everyone's trying right two weeks later, everyone's trying to pivot to me. They're all trying to - to pivot to me, they're all trying to - to pivot to me, they're all trying to come and talk about Italy. We wouldn't come and talk about Italy. We wouldn't come and talk about Italy. We wouldn't even be talking about illegal, even be talking about illegal, even be talking about illegal immigration if I didn't bring it up at immigration, if I didn't bring it up at immigration, if I didn't bring it up at that opening day June 16th, now it's a - That opening day June 16th, now it's a that opening day June 16th. Now it's a long time ago. Hard to believe here we long time ago. Hard to believe here we long time ago, hard to believe here. We are first day, but June 16th, we wouldn't are first day, but June 16th, we wouldn't are first day. But June 16th, we wouldn't even be talking about illegal, even be talking about illegal, even be talking about illegal immigration. Now they're all trying to immigration now they're all trying to immigration. Now they're all trying to say they're all trying to come on board, say they're all trying to come on board, say they're all trying to come on board. And the funny thing my wife said to me and the funny thing my wife said to me and the funny thing my wife said to me the other day darling, he just said wall the other day darling, he just said wall the other day darling. He just said wall one of the candidates, one of the candidates, one of the candidates won't even say who - what difference does won't even say who - what difference does won't even say who - what difference does it make. But one of the candidates said it make, but one of the candidates said it make, but one of the candidates said we will build a wall another way. They - we will build a wall another way. They - we will build a wall another way, they talk - they don't really talk. They they talk - they don't really talk. They they talk - they don't really talk. They they like everything's always like a debate like everything's always like a debate like everything's always like a debate. They're talking to a reporter, we will - they're talking to a reporter, we will. They're talking to a reporter. We will build what I actually said about Ted build what I actually said about Ted build what I actually said about Ted, who's a nice guy. I said he's a good who's a nice guy. I said he's a good who's a nice guy. I said he's a good debater, but he's a bad talker does that debater. But he's a bad talker does that debater, but he's a bad talker. Does that make sense? We will build a wall and my make sense, we will build a wall and my make sense. We will build a wall and my wife said to me, that's the first time wife said to me, that's the first time wife said. To me, that's the first time I've heard anyone say they're gonna, I've heard anyone say they're gonna, I've heard anyone say they're gonna build a wall. Nobody ever said did you build a wall? Nobody ever said, did you build a wall? Nobody ever said. Did you hear anybody say they're gonna build a, hear anybody say they're gonna build a, hear anybody say they're gonna build a wall other than Trump and when we get wall other than Trump and when we get wall other than Trump and when we Get Sheriff, Joe, that really is, you know that Sheriff, Joe, that really is, you know that Sheriff, Joe, that really is, you know, that really validates what I'm saying. But we really validates what I'm saying. But we really validates what I'm saying. But we have to build a wall because without a have to build a wall because without a have to build a wall because without a wall, we don't have a country wall. We don't have a country wall. We don't have a country. People are pouring through our border, people are pouring through our border, people are pouring through our border and all over. It's like a sieve, it's like and all over. It's like a sieve, it's like and all over. It's like a sieve. It's like water just pouring right through and water just pouring right through and water just pouring right through and then Obama issues an executive order and then Obama issues an executive order and then Obama issues an executive order and he said let them come in and amazingly He said, let them come in and amazingly he said let them come in and amazingly the courts at least temporarily have the courts at least temporarily have the courts at least temporarily have stopped him. But it doesn't matter stopped him, but it doesn't matter stopped him. But it doesn't matter because if I get in, that'll be the first because if I get in, that'll be the first because if I get in, that'll be the first executive order I. And is that executive executive order I. And is that executive executive order I? And is that executive order, we won't have to waste our money order. We won't have to waste our money order. We won't have to waste our money on lawyers. We're not gonna have to waste on lawyers. We're not gonna have to waste on lawyers. We're not gonna have to waste our money on those, so just a few things, our money on those. So just a few things, our money on those. So just a few things and then we're gonna have a big day and - and then we're gonna have a big day and - and then we're gonna have a big day. And look, the big thing is you got to get out - look, the big thing is you got to get out - look, the big thing is you got to get out - you got a caucus. I mean, another poll. You got a caucus. I mean, another poll. You got a caucus, I mean, another poll just came out Quinnipiac very good. Paul just came out Quinnipiac very good. Paul just came out Quinnipiac very good, Paul. It came and we're actually higher than it came and we're actually higher than it came and we're actually higher than even the Des Moines Register. Bloomberg even the Des Moines Register, Bloomberg even the Des Moines Register, Bloomberg which came out yesterday I guess there, which came out yesterday I guess there, which came out yesterday, I guess there we were five or six points now. I think we were five or six points now. I think we were five or six points now. I think we're seven points up in Quinnipiac, but we're seven points up in Quinnipiac, but we're seven points up in Quinnipiac, but it all doesn't matter because I hear it all doesn't matter because I hear it all doesn't matter because I hear they all have these great Ground games, they all have these great ground games. They all have these great ground games, they got people pouring in buses and they got people pouring in buses and they got people pouring in buses and trucks. And you know, they're spending trucks and you know, they're spending trucks and you know, they're spending, they're spending all of this money that they're spending all of this money that they're spending all of this money that they're given by the special interests they're given by the special Interests, they're given by the special interests and the lobbyists, and they're spending and the lobbyists and they're spending and the lobbyists and they're spending and they have unlimited money for that, and they have unlimited money for that and they have unlimited money for that. And so do I - frankly - I mean, they're so - and so do I - frankly - I mean, they're so - and so do I frankly - I mean, they're - so far, I'm very proud of something I've far. I'm very proud of something I've far I'm very proud of. Something I've spent less money than anybody else and I spent less money than anybody else and I spent less money than anybody else and I have the best result. I'm number one, have the best result. I'm number one, have the best result. I'm number one, it's great. It's great, it's great and that's what I want to do for our - and that's what I want to do for our - and that's what I want to do for our country. I mean, a guy like Bush, he spent country, I mean a guy like Bush, he spent country, I mean a guy like Bush, he spent a hundred million dollars in, he's down a hundred million dollars in. He's down a hundred million dollars in. He's down at the bottom. They spent a hundred at the bottom. They spent a hundred at the bottom. They spent a hundred million for the - but for our country I million for the - but for our country I million for the - but for our country. I want the person that's going to spend want the person that's going to spend, want the person that's going to spend the least and get the best result you the least and get the best result you the least and get the best result. You know right now it's Norway well, right know right now it's Norway well, right know right now it's Norway. Well right now in education, its Norway, Sweden now in education its Norway, Sweden now in education its Norway, Sweden, Denmark, China, these are all great places. Denmark, China, these are all great places, Denmark, China, these are all great places for education, right? We're number 28 in for education, right? We're number 28 in for education, right? We're number 28. In other words, we're toward the bottom of other words. We're toward the bottom of other words. We're toward the bottom of the pack. We have - we have literally the pack we have - we have literally the pack we have. We have literally nations that you wouldn't believe ahead nations that you wouldn't believe ahead nations that you wouldn't believe ahead of us. They're like third world nations of us. They're like third world nations of us. They're like third world nations ahead of us in education. And yet we ahead of us in education and yet we ahead of us in education and yet we spend more money per pupil than anybody spend more money per pupil than anybody spend more money per pupil than anybody else by far. Second place doesn't even else by far second place, doesn't even else by far. Second place doesn't even exist. It's so far behind. So we spend exist. It's so far behind. So we spend exist. It's so far behind. So we spend more money. That's like Jeb Bush, we spend more money. That's like Jeb Bush. We spend more money. That's like Jeb Bush, we spend more money and we have a bad result, more money. And we have a bad result, more money. And we have a bad result. We're going to spend less money. We're - we're going to spend less money. We're - we're going to spend less money. We're gonna bring it back locally, you're gonna gonna bring it back locally, you're gonna gonna bring it back locally, you're gonna take over you, it's gonna be so beautiful take over you, it's gonna be so beautiful take over you. It's gonna be so beautiful and you know, I've seen it, I've watched and you know, I've seen it, I've watched and you know, I've seen it, I've watched it because over the years I've watched it because over the years I've watched it because over the years I've watched it, I've seen parents that really joined it. I've seen parents that really joined it. I've seen parents that really joined their school boards and joined their their school boards and joined their their school boards and joined their whole little circle of friends to make a whole little circle of friends to make a. Whole little circle of friends to make a school beautiful and good and their sons school beautiful and good and their sons school beautiful and good and their sons and daughters graduate and they stay on and daughters graduate and they stay on and daughters graduate and they stay On - and they love it, they love it, they do it and they love it, they love it, they do it and they love it, they love it, they do it with love and with intelligence by the - with love and with intelligence by the - with love and with Intelligence, by the way, but they do it with love instead of way. But they do it with love instead of way. But they do it with love. Instead of having the bureaucrats from Washington having the bureaucrats from Washington having the bureaucrats from Washington running schools in Iowa, which is running schools in Iowa, which is running schools in Iowa, which is ridiculous. So someday we're going to I ridiculous. So someday we're going to I ridiculous. So someday we're going to - I get in - I'm telling you we're gonna spend get in. I'm telling you we're gonna spend get in. I'm telling you we're gonna spend less money. We're gonna have much better, less money, we're gonna have much better, less money. We're gonna have much better results, not only an education on results, not only an education on results, not only an education on everything else. You look at the military, everything else, you look at the military, everything else, you look at the military, we have a military that's being - we have a military that's being - we have a military that's being decimated, it's being decimated and the decimated, it's being decimated and the Decimated it's being decimated and the money we - you tree that, nobody knows where they're tree that nobody knows where they're tree that nobody knows where they're from, where they are. And as I left this from where they are and as I left this from where they are and as I left this morning, I saw something very interesting morning. I saw something very interesting morning. I saw something very interesting in Sweden. They had gangs of people in, in Sweden, they had gangs of people in, in Sweden, they had gangs of people in masks and others, Swedish people that masks and others, Swedish people that masks and others, Swedish people that were going after the migrants because were going after The migrants because were going after the migrants because there's been tremendous crime committed, there's been tremendous crime committed. There's been tremendous crime committed and they've had enough, you know, they've - and they've had enough, you know, they've - and they've had enough, you know, they've had enough - they've had enough of the had enough - they've had enough of the had enough, they've had enough of the stupidity. And these people we - I believe stupidity and these people we I believe stupidity and these people we I believe in protecting people, but you build a - in protecting people, but you build a in protecting people, but you build a safe zone. I was the first one to say it safe zone. I was the first one to say it safe zone. I was the first one to say it build a big fat, beautiful, safe zone, build a big fat, beautiful, safe zone, build a big fat, beautiful safe zone someplace in Syria, where you can you someplace in Syria, where you can you someplace in Syria, where you can You know where you can have it right and you know where you can have it right and you know where you can have it right and you build it and you put, but you get the build it and you put, but you get the build it and You put - but you get the Gulf states, the Gulf states, Saudi Arabia, Gulf states, the Gulf states, Saudi Arabia, Gulf states, the Gulf states, Saudi Arabia before the oil came down. But they're before the oil came down. But they're - before the oil came down. But they're still doing very well, of course, the still doing very well, of course, the still doing very well, of course, the bless to take out oil than anyplace else bless to take out oil than anyplace else bless to take out oil than anyplace else. But Saudi Arabia was making a billion, but Saudi Arabia was making a billion, but Saudi Arabia was making a billion dollars a day and we protect them for dollars a day and we protect them for dollars a day and we protect them for nothing. It's gonna all change folks, it's nothing, it's gonna all change folks. It's nothing, it's gonna all change folks, it's gonna all change. We spent so much money gonna all change. We spent so much money gonna all change. We spent so much money, everyone says, oh, well, we spend 10 times, everyone says, oh, well, we spend 10 times, everyone says, oh, well, we spend 10 times more than every other country or any more than every other country or any more than every other country or Any other country and even more than that other country and even more than that other country and even more than that. But you know, we do, we spend it all but you know we do, we spend it all but you know we do, we spend it all protecting, we spend so much of it protecting we spend so much of it protecting we spend so much of it protecting Other countries and in some protecting other countries and in some protecting other countries and in some cases those other countries are economic cases. Those other countries are economic cases. Those other countries are economic behemoths like Germany, like Japan, like behemoths, like Germany, like Japan, like behemoths, like Germany, like Japan, like South Korea. We protect South Korea and I - South Korea, we protect South Korea and I - South Korea, we protect South Korea and I have friends by the way love the people have friends by the way, love the people have friends by the way, love the people of Germany, love The people of Japan, love of Germany, love the people of Japan, love of Germany, love the people of Japan, love the people of South Korea have buildings. The people of South Korea have buildings. The people of South Korea have buildings in South Korea. It's a very great place in South Korea. It's a very great place in South Korea. It's a very great place. But we have 28,000 soldiers, 28,000 on, but we have 28,000 soldiers, 28,000 on, but we have 28,000 soldiers, 28,000 on our line. We have 28,000. Think of it, we - our line, we have 28,000, think of it. We - our line, we have 28,000. Think of it. We get like peanuts. So we're protecting, get like peanuts. So we're protecting, get like peanuts. So we're protecting them and try ordering a television, set them and try ordering a television, set them and try ordering a television set, just give it a shot made in the USA, just give it a shot made in the USA, just give it a shot made in The USA, there is no such thing, no such animal, there is no such thing, no such animal. There is no such thing, no such animal, they're all made in South Korea and - and they're all made in South Korea and - and they're all made in South Korea and - and a little bit Japan because of Sony, but a little bit Japan because of Sony. But a little bit Japan because of Sony, but they're all made - most of them made in a - they're all made - most of them made in a - they're all made - most of them made in a order of thousands and thousands of order of thousands and thousands of order Of thousands and thousands of televisions a year and they're all made televisions a year and they're all made televisions a year and they're all made in South Korea. I can't - I'd love to buy in South Korea. I can't - I'd love to buy in South Korea. I can't. I'd love to buy here, I would love to buy here, but you here I would love to buy here, but you here I would love to buy here, but you can't buy here. So we're gonna have them, can't buy here. So we're gonna have them. Can't buy here, so we're gonna have them and this isn't like anything other than and this isn't like anything other than and this isn't like anything other than, hey, folks, you got to take care of us. Hey, folks, you got to take care of us. Hey, folks, you got to take care of us. This is a two-way street. This is not a - this is a two-way street. This is not a - this is a two-way street. This is not a one-way street. We protect all these one-way street. We protect all these one-way street. We protect all these people every time this madman people every time this madman people, every time this madman such talking nuclear, we immediately such talking nuclear. We immediately such talking nuclear. We immediately sends our ships and we don't get it. They sends our ships and we don't get it, they sends our ships and we don't get it. They pay us nothing. They pay us. Peanuts pay us, nothing. They pay us. Peanuts pay us nothing. They pay us peanuts compared to what it's costing us. So what compared to what it's costing us, so what compared to what it's costing us. So what are we doing it for? Do you know that we are we doing it for - do you know that we are we doing it for - do you know that we have a pact with Japan that if Japan is - have a pact with Japan that if Japan is - have a pact with Japan that If Japan is attacked, we have to go to war, we go to attacked, we have to go to war, we go to attacked, we have to go to war, we go to war right away. We're gonna protect your war right away. We're gonna protect your war right away. We're gonna protect your PIN, okay? But if we're attacked Japan PIN, okay. But if we're attacked Japan PIN, okay. But if we're attacked, Japan doesn't have to do anything, okay, that's doesn't have to do anything, okay, that's doesn't have to do anything, okay, that's the way we have. In other words, if the way we have, in other words, if the way we have - in other words, if somebody attacks us, Japan doesn't have somebody attacks us. Japan doesn't have somebody attacks us. Japan doesn't have to do a thing. But if Japan is attacked to do a thing, but if Japan is attacked to do a thing, but if Japan is attacked, we have to immediately come to their - we have to immediately come to their - we have to immediately come to their defense, go to war, do Whatever is defense go to war, do whatever is defense go to war, do whatever is necessary and just not fair, it's not necessary and just not fair, it's not necessary and just not fair, it's not even a question of not fair. It's that even a question of not fair, it's that even a question of not fair. It's that smart, it's not good and they don't even smart. It's not good and they don't even smart. It's not good and they don't even respect us for it because they say can respect us for it because they say can respect us for it because they say, can you believe, I can just see these people you believe. I can just see these people you believe. I can just see these people they say can you believe how stupid they they say can you believe how stupid they they say can you believe how stupid they are, who would make deals like this and are who would make deals like this and are who would Make deals like this and we have many of them. So we protect, we have many of them. So we protect, we have many of them. So we protect Germany, we protect Saudi Arabia, we, Germany, we protect Saudi Arabia, we - Germany, we protect Saudi Arabia. We protect different places in the Middle, protect different places in the Middle, protect different places in the Middle East. These Gulf states aren't putting up East. These Gulf states aren't putting up East. These Gulf states aren't putting up any money toward the migrants and by the - any money toward the migrants and by the - any money toward the migrants. And by the way, I have a big heart. I want to take way I have a big heart. I want to take way I have a big heart. I want to take care. I wait, but they're not coming into care. I wait, but they're not coming into care. I wait, but they're not coming into this country because we don't know who this country because we don't know who this country because we don't know who they are. There's no way of finding out they are - there's no way of finding out they are - there's no way of finding out who they are. They have no papers, no, who they are. They have no papers, no, who they are. They have no papers, no documentation. They could be Isis and you documentation, they could be Isis and you documentation, they could be Isis. And you look at those migration lines, you look look at those migration lines, you look, look at those migration lines, you look at that great migration, have you ever at that great migration, have you ever at that great migration? Have you ever seen so many people? It's like what are seen so many people. It's like what are seen so many people. It's like what are the lines trying to get into our event, the lines trying to get into our event, the lines trying to get into our event the other night when we had it. The other - the other night when we had it, the other the other night when we had it the other night for the veterans, it was - I mean night for the veterans, it was - I mean night for the veterans, it was - I mean, literally it was. So we could have filled literally it was so we could have filled literally it was. So we could have filled up that arena. We could have filled it up up that arena. We could have filled it up up that arena. We could have filled it up ten times over, it was the most ten times over. It was the most ten times over. It was the most incredible thing. But when you look at incredible thing, but when you look at incredible thing, but when you look at that migration, so many people so many that migration so many people so many that migration so many people so many people and what's the story so many people and What's the story so many people and what's the story? So many young, strong men, young, strong men and young, strong men, young, strong men and young, strong men, young, strong men. And you say what's going on? You say what's going on? You say what's going on. This doesn't look right. I mean, there's - this doesn't look right. I mean, there's - this doesn't look right. I mean, there's something wrong here. So we are - we're not something wrong here. So we are - we're not something wrong here. So we are - we're not going to allow them. And if I win, they going to allow them and if I win, they going to allow them. And if I win, they have to go back. They're gonna have to go have to go back. They're gonna have to go have to go back. They're gonna have to go back because we cannot allow our country back because we cannot allow our country back because we cannot allow our country to be riddled with problems any more to be riddled with problems any more to be riddled with problems any more than We already have than we already have than we already have. We have a tremendous immigration problem. We have a tremendous immigration problem. We have a tremendous immigration problem. We have so many different problems. We - we have so many different problems. We - we have so many different problems. We don't know where these people come from. Don't know where these people come from. Don't know where these people come from. We're never going to be able to find out. We're never going to be able to find out. We're never going to be able to find out where they come from. It could be the - where they come from, it could be the - where they come from, it could be the great Trojan horse of all time, great Trojan horse of all time, great Trojan horse of all time gonna have to go back. We're gonna try gonna have to go back, we're gonna try gonna have to go back. We're gonna try and get the Gulf states. I would put I and get the Gulf states. I would put I and get the Gulf states. I would put - I tell you what, I'll put a lot of pressure tell you what I'll put a lot of pressure tell you what. I'll put a lot of pressure on them because I don't want to spend on them because I don't want to spend on them. Because I don't want to spend our money, I want a safe zone, but I don't - our money, I want a safe zone, but I don't - our money, I want a safe zone, but I don't want to spend a lot of money on it, want to spend a Lot of money on it want to spend a lot of money on it because we don't have a lot of money because we don't have a lot of money because we don't have a lot of money. That's why we should have never given. That's why we should have never given that's why we should have never given the money. Back to Iran, 150 billion, the money back to Iran, 150 billion, the money back to Iran, 150 billion dollars. We should have told her I'm dollars. We should have told her I'm dollars, we should have told her. I'm sorry, we don't have it. We don't have it. Sorry, we don't have it. We don't have it. Sorry, we don't have it. We don't have it - sorry, folks. And we should have never - sorry, folks. And we should have never - sorry, folks and we should have never ever started that negotiation until we ever started that negotiation until we ever started that negotiation until we got to gut our prisoners back to go got to gut our prisoners back to go got to gut. Our prisoners back to go through that whole negotiation and you through that whole negotiation and you through that whole negotiation and you watch that's going to lead to a lot of watch that's going to lead to a lot of watch that's going to lead to a lot Of bad things because we essentially paid bad things because we essentially paid bad things because we essentially paid 150 billion dollars to get our prisoners 150 billion dollars to get our prisoners 150 billion dollars to get our prisoners back. That's gonna that's gonna lead to a back that's gonna that's gonna lead to a back that's gonna that's gonna lead to a lot of bad things. So I just want to say lot of bad things. So I just want to say lot of bad things. So I just want to say tonight is so important, this is the tonight is so important, this is the tonight is so important. This is the beginning of taking our country back, beginning of taking our country back, beginning of taking our country back. It's going to be an amazing period of it's going to be an amazing period of it's going to be an amazing period of time. We're gonna all remember each other time, we're gonna all remember each other time, we're gonna all remember each other, I'm gonna, remember you, I'm gonna, I'm gonna, remember you, I'm gonna, I'm gonna, remember you, I'm gonna remember the Crowds and the - the - remember the crowds and the - the remember the crowds and the - the unbelievable positive, I mean they people unbelievable positive. I mean they people unbelievable positive. I mean, they - people love this country so much. Somebody asked love this country so much. Somebody asked love this country so much, somebody asked me before. One of the reporters called me before, one of the reporters called me before, one of the reporters called they say what have you learned. I said I they say what have you learned. I said I they say what have you learned, I said I learned how much people love our country, learned how much people love our country, learned how much people love our country. They love our country, it's incredible. They love our country, it's incredible. They love our country. It's incredible when I see what goes on. It's just when I see what goes on, it's just when I see what goes on, it's just incredible when I see the kind of when incredible - when I see the kind of when incredible - when I see the kind of when we have 21,000 people in Dallas and We - we have 21,000 people in Dallas and we - we have 21,000 people in Dallas and we have so many men that the crowds are so have so many men that the crowds are so have so many men that the crowds are so incredible. We have 35,000 people in incredible. We have 35,000 people in incredible. We have 35,000 people in Mobile, Alabama a couple of weeks ago. We Mobile Alabama a couple of weeks ago. We Mobile Alabama a couple of weeks ago, we had 20,000 people in Oklahoma and now had 20,000 people in Oklahoma and now had 20,000 people in Oklahoma. And now we're leading all the polls. And we're - we're leading all the polls and we're - we're leading all the polls. And we're leading Iowa, but it doesn't mean leading Iowa, but it doesn't mean leading Iowa. But it doesn't mean anything you got to go out tonight. And anything you got to go out tonight and anything you got to go out tonight and caucus, I mean, you people are all fans caucus. I mean, you people are - all fans caucus. I mean, you people are all fans and you're fans of ourselves. But tonight, and you're fans of ourselves, but tonight and you're fans of ourselves. But tonight, you have to go out and caucus and it. You have to go out and caucus and it. You have to go out and caucus and it looks like the snow storm is not going. Looks like the snow storm is not going. Looks like the snow storm is not going to be hitting us until sometime fairly to be hitting us until sometime fairly to be hitting us until sometime fairly late, like 1 o'clock, 2 o'clock, 3 o'clock late, like 1 o'clock, 2 o'clock, 3 o'clock late, like 1 o'clock, 2 o'clock, 3 o'clock in the morning, maybe even not even till in the morning, maybe even not even till in the morning, maybe even not even till the next day. And so that's really good the next day and so that's really good the next day. And so that's really good because they all say the more people because they all say the more people because they all say the more people that go out, the more the better we're that go out, the more the better we're that go out, the more the better We're going to do - and I don't say me, I say we going to do and I don't say me, I say we going to do and I don't say me, I say we - because it is we - it's a movement. It's we - because it is we - it's a movement, it's we - because it is we - it's a movement, it's we - so you've got to go out. So you've got to go out. So you've got to go out. I - I kid when I say if you're in bed, if I - I kid when I say if you're in bed, if I I kid when I say if you're in bed, if you're sick, if you can't walk if the - you're sick, if you can't walk - if the - You're sick, if you can't walk - if the doctor says you cannot leave, I don't doctor says you cannot leave. I don't doctor says you cannot leave, I don't care care care get out of bed and come. You got it, do it get out of bed and come, you got it, do it get out of bed and come, you got it, do it, you got ta do it. So hopefully tonight you got ta do it. So hopefully tonight you got ta do it. So hopefully tonight, we're going to have the beginning of - we're going to have the beginning of - we're going to have the beginning of what is going to be in a certain way, a, what is going to be in a certain way, a, what is going to be In a certain way, a very positive revolution, I mean this very positive revolution. I mean this very positive revolution. I mean this would be a very, very positive revolution would be a very, very positive revolution would be a very, very positive revolution. We're going to take our country back and we're going to take our country back and we're going to take our country back and we are going to make America great. Again. We are going to make America great. Again. We are going to make America great again and I love you all and thank you all and I love you all and thank you all and I love you all and thank you all special people. Thank you all. Appreciate special people. Thank you all. Appreciate special people. Thank you all. Appreciate it. I'll sign something. Thank you. Thank it. I'll sign something. Thank you. Thank it. I'll sign something. Thank you. Thank you all you."}