{"id":461,"author":"Donald Trump","title":"Speech: Donald Trump in Sioux City, IA","date":"2016-01-30","link":"https://factba.se/transcript/donald-trump-speech-sioux-city-ia-january-30-2016","paragraphs":["Thank you. Wow, what a nice crowd. It's a great place. Thank you very much everybody. Thank you very much Jerry. Jerry's been so amazing, actually, folks.","There they are. Melania, Ivanka, Jared. It's Ivanka's husband. That's so nice. And Ivanka's going to have a baby any minute, so we're all set. And I said, Ivanka, please, please have the baby in Iowa. It would guarantee victory.","Thank you very much, that's very nice. Thank you.","Actually, when he said we insist on doing that I doubled up the prices. I figured, what the hell?","These people are the worst. I thought real estate people in New York were bad. These politicians are the worst liars. Wow. They are terrible. These are terrible. They'll say anything. It's, like, incredible. Actually, we saw one. We were both amazed at it. It says, voter violation. We just -- did you see this today?","The Cruz campaign. Voter violation. And it's like an official document being sent to people in Iowa, that they have to get out vote because they're in violation, and then they have the grades for different things. And it says F. And it's so -- I mean, it's terrible. I've never seen anything like it. And I guess your attorney general is investigating it, and it just came out.","But I said, that is really terrible. It's a fraud as far as I'm concerned. But you're in a rough business over here. I'll tell you what -- and one thing I said before, Jerry, you haven't had a winner in Iowa in 16 years. We're going to have a winner, you better believe it. You're going to have a winner this time.","You going to have a winner. We're going to -- we're going to change that. That's a bad spell. 16, that's a lot of years.","I was on the committee.","One of them actually did. They said I was pushing Obama in '08. I was on McCain's committee. I liked McCain, he was a nice guy. He tried. It was a tough deal for him. I mean, that was an election that was tough to win because of what happened a couple of months previous, with the economy. But you know, the last election, we should have won.","That was the Romney election. I mean, sad. I'm not blaming anybody. I'm just saying sad that we didn't win it. And one thing I will say, Obama -- and you have to give him credit. He was on television every night. He was on David Letterman, Jay Leno. And Mitt was not around very much. And I'd call their campaign and say, why is he not going on television?","He's got to go on television. He ended up losing. That was an election that we should have won. That should have been a victory. He had a failed president and that was an election that should have been won.","Well, you know, I use that deal all the time. A lot of you have heard some of my speeches and -- see all the press we have back there? Look at these people. They just never stop. But a lot of you -- a lot of you have heard the different speeches that I've made, and a lot of times I'll use that whole Iran deal as an example of gross incompetence and horrible deal-making where we get nothing.","We're giving $150 billion. They're a terrorist state. And I don't know, I mean even beyond that, did you hear last week, where Kerry said, no, no. We would expect some money to be spent on terror. And I'm saying, did he really just say that? And I figured they'd issue some kind of a statement saying he didn't say it, even though that's what he said.","And he actually made that statement. Now they're going around though, and they're taking the money, they're spending it all over Europe, all over the world. They're spending it everywhere but our country. They just ordered 118 Airbus planes, which is obviously not made by Boeing. Instead of ordering Boeing jetliners, they ordered from Airbus, which is European manufactured.","They're buying in Italy. They're buying everywhere but us. They're buying missiles in Russia. I didn't know they were allowed to buy missiles but they're buying missiles in Russia. They shouldn't be allowed to buy missiles. And they're spending that money all over, except for one place, the United States.","That is the most incompetent deal I think I've ever seen in my life, of any kind. Horrible.","That's great.","Thank you.","So, we did. We had a great evening. And these are incredible people. And because of the largesse, because of the niceness of Carl Icahn, who's one of our great businessmen and who will help us with our negotiations with China -- believe me, we're going to come out just fine, and many other places and many other businessmen that are friends of mine.","Phil Ruffin gave a million dollars, from Las Vegas, and Carl gave a half a million dollars. Ike Perlmutter, the great Ike Perlmutter, the head of Marvel. A brilliant man. He and Laurie, his wife, gave one million dollars. And so many others. I mean, we've had such -- we had, in one hour, we raised six million dollars for the vets.","And Jerry, we vetted the vets very closely because we want to make sure. And we picked about 20 groups, 22 groups and we're giving a lot of money out and they're really happy about it. Tell us, what do you do exactly? What do you do to deserve all this money?","That's so great.","Well, that's so great. Congratulations. That's great. Thank you. Fantastic. Thank you. Thank you, darling. You take care of yourself. Thank you. Thank you very much. So many great people it's amazing.","Thank you. Thank you. Thank you Jerry.","So nice. Thank you Jerry.","Well, number one, we have to stop the fraud, waste and abuse. It's massive throughout our country. It's massive. And everybody's, you know, into that and we're going to do that. But we're going to bring back our jobs. If you look at what China has done to us. What Japan -- I've been talking about this for years, but the politicians, they're all talk, they have no action, they have no clue how to do it. But if you look at China, Japan, Mexico -- I have great relationships with Mexico, with the people of Mexico.","I have thousands of Hispanic employees. in fact, Ivanka was just telling me today, in The New York Post there's this great article about me and the Hispanics, where -- I guess it's from the Hispanics living here legally. I'm just doing so phenomenal. I'm number one in the polls with Hispanics living here legally.","I mean, my relationship with Hispanics is great. But --","Thank you. We're going to bring back jobs to this country. We're going to take them back from Mexico. We're going to bring them back from China. You know, I often say that what China has done to our country is the biggest theft and the greatest theft in the history of the world. They've taken our jobs, they've taken our money, they've taken our base, they've taken our heart and they've rebuilt China.","And we have the power over them. You know, we have a leader that has no idea -- if you call him a leader. He has no idea, has absolutely no idea what to do about this or how to negotiate. And every time the top people come over from China, they're getting these big, you know, beautiful -- they put a tent on the White House.","We don't have a ballroom at the White House. I offered, by the way Jerry, years ago, to build a ballroom at the White House, free of charge, a $100 million ballroom. I said we'll get the top five architects in America. We'll get the top people. Top everything. We'll have the best ballroom. Because I noticed they always put tents up on the lawn.","Number one, it's not a good security thing. Number two, the guy that owns the tents is making a fortune. OK? This poor guy, I mean, he's making so much money. All he needs is one tent and he charges them so much, he's making a fortune. All right. But I said, I will build a ballroom. I gave it to the Obama -- actually told David Axelrod, a good guy -- you know, very capable guy.","I told David Axelrod, David, I will build a ballroom, free of charge, at least $100 million. We'll make it the finest ballroom in the world. We'll put it someplace so it works contextually, magnificently. It'll be done. We'll have committees set up. I never heard back. I never heard back. It's -- you know, it's just one of just thousands of things.","I mean, if someone's going to give me a free ballroom, I'm going to take it. We'll put it in an area, it'll look great. But you know, we don't have a ballroom at the White House, so -- But I see the heads of China come in and we treat them so beautifully and yet, this year, we will have a trade deficit with China of $500 billion.","What kind of business is this? And this has been, by the way, going on for many, many years. And Japan, same thing. Smaller numbers but the same thing. They send the cars in by the millions and we have tremendous deficits. And Mexico, when I say we're building a wall, we're going to build a wall. Believe me. And who's going to pay?","Who's going to pay? Mexico.","Mexico, Jerry, is going to pay. And the politicians come off the stage with me and they say, you know, I don't understand. How can you say Mexico? Mexico's not going to pay for the wall. I said, of course they are. They said, how? And I don't want to really tell them because it's going to take them a while to figure it out.","But very simply, Mexico is making a fortune on the United States, OK? A fortune. Far greater than what we're talking about. And the cost of the wall is peanuts by comparison to what they're making. It will be, trust me, very, very easy. Very easy.","Well, look, the Second Amendment, we're going to protect it. We're going to take care of it and we're going to cherish it, and we're not going to let people nip away at it like they've been doing, OK? And --","If you look at what happened, as an example in Paris, Paris is the most difficult place, they say, in the world. Who knows? But it's certainly very difficult. And France, generally, you can't have a gun. You just -- it's impossible, practically, except for the bad guys. The bad guys can have a gun because they just have a gun.","Now, if we had, in California, the 14 people that were killed or as an example, in Paris where they killed 130 people with many more to follow. You know many people that are gravely -- I mean, really in bad shape. Lying in hospitals right now. At a minimum, their lives are destroyed and they're going to have a rough life.","But these guys walked in, boom, boom, boom, boom. They could've stayed there all day and done same thing. And they killed 130 people. So many badly injured. In California, I mean, where the wedding was actually, in a form, thrown. They were giving parties. They know each other. They knew everything about it. I guess they gave a baby party.","And it's the most incredible thing. Walk in they shot 14 people. Would have killed more. If we had somebody, like that gentleman with the beautiful white Make America Great Again hat on or the red Make America Great hat on or anybody, you, you. Anybody. If we had some people, meaning, if there were people in Paris or if there were people in California or if there were people, you know, the five soldiers that were killed nine months ago in a gun free zone on a military base -- I'd end that immediately, Jerry, with a executive order.","You can knock that out immediately.","The five soldiers, two of them were world class marksmen. They were all great soldiers. They were told they couldn't have their guns. Gun free zone. Put the guns 200 yards away. Lock them up. They can't be there. This whack job walks in, shoots all five of them. If they had their guns, would have been a different story.","If there were guns in Paris, on the other side -- just a few. Maybe on the ankle or on the waist, where you lift up and you start shooting bullets in the other direction, would have been a whole different story folks. If there were guns in California, where a couple of the people in that room, if not all -- but if a couple of people had guns, it would have been a totally different story.","You wouldn't have 14 dead. And you know one thing, the police wouldn't have had to go all over the place. And I think the police in Paris by the way, and the police in California, I thought they did an amazing job. I really did. And speaking of that, the police in this country are really taking a beating and they're great, great people.","The job they do is fantastic. Fantastic. So -- really true. So we have to protect our Second Amendment and we have to do it right or we're not going to have a country anymore folks. We're not going to have a country anymore.","Well the job numbers that come back are a total nonsense. You know, these numbers were made a number of years ago, and the way they compile the numbers so that politicians look good. That's all it is. Because if you're looking for a job and you give up, statistically you are considered employed. So you have millions and millions of people that have looked and looked and looked and they gave up. There is no job.","And if you look at the numbers that came out two weeks ago, they said that the numbers are 5.1 and 5.2%, which is total nonsense. I actually think it could be as high as 32, 35%. A lot of people think it's 35%. The real number. But if you look at the jobs that they do have, they're bad jobs. They're considered really bad jobs.","Somebody got on one of the shows, and I read in great depth and detail an account. These are among the worst jobs that we've ever been talking about and yet they're considered jobs. So we're going to get real jobs back. We're going to bring them back from overseas. We're going to bring them back from all these countries that have taken them away from us. I mean, you have an example, you call up for a credit card to check or somebody calls you and I'll say sometimes, where are you based?","And they'll be based in India. They'll be based -- I mean, it's amazing. And you notice, the accent is a little bit different. And where are you from? Well, I'm from India or I'm from another country. We're doing everything. We're not -- we don't have jobs. If you look at what's really going on with our country, we're going to be in such trouble.","We're gonna bring our jobs back from overseas. We have incredible people. One thing I've learned more than anything else, they said, what have you learned? You know, we have a movement going on folks. Every room is like this. They're packed. No matter where we go they're packed. The cover of Time magazine last week, we had the most unbelievable writer.","I never spoke to him. It was one of the best stories I ever had. And I said to my wife, I said, Melania I'm never going to speak to a reporter again. I got the best story and I never spoke to him. I don't waste my time. Because you know there's tremendous dishonesty with these people. They're the most dishonest among -- they're a little more honest than the politicians but -- you know.","Maybe that's why they're so dishonest because the other one, look who they're dealing with. And I'm not a politician. Remember, I'm a businessman. We're a businessman. We're a businessman.","But the cover of Time magazine is so amazing because it talks about the movement, and it's actually a picture of me talking to a crowd. It's actually a picture of the back of my head. I was very impressed. Fairly okay back there, with the -- you know. Not much of a bald spot, which is OK. But it's a picture of me standing, talking to a very large crowd of people.","Which is standard. And it talks about a movement and it literally didn't have a bad half sentence in there. They said there's never been anything like this. There's never been anything like what's happening. And this is why -- and I'll just interrupt Jerry for one second. It's so important. You know, we're leading now in the polls in Iowa.","So we're leading in everything. A poll just came down --","And the folks from Bloomberg are here, in all fairness. And even the Des Moines Register. Can you imagine? They couldn't have been happy with Trump leading their poll. They were not happy, I guess. But John and, you know, the group is here and there's some -- I mean, look, you do have some Mark and John and their wives and families are here.","You have some great people. You have some great people in this country. Some great, great people in this country. And I was going to say that, what I've learned more than anything else in doing this is how incredible, smart, committed the people of the United States are. It's incredible. They want to see America be great again.","It's very simple. They want to see our country be great again.","But I really wish you'd go see this because that story was so inspiring to read. And it's not a story, really, about me. It's a story about you. It's a story about people that are fed up. They're sick and tired, you can call it angry, at the debate before the one I skipped. And the reason I skipped it, by the way, was because I was not treated properly by Fox.","And they've been very nice since, and they were even very nice before, they wanted me to go on the debate. And they didn't do well on the debate. They would have done very well had I gone. We would've broken every record in the book. But I couldn't. But you know what? I'm glad, in many respects, I didn't do it. What happened -- a poll just came out in New Hampshire, just two minutes before we came on, and in that poll I have a 25-point lead.","You know what a 25-point lead is? And people respect the fact that I skipped the debate because I wasn't treated right. And we have to do that. I wasn't treated properly. And we have to think about that with our country. When our country isn't treated right, our leaders have to do what's right for the people.","I mean, we get beat up by everybody. We get beat up by everybody. There's nothing. We don't have victories anymore. we don't win anymore. I mean, when was the last time we had a victory? We don't win on trade. We can't beat ISIS. Can you imagine General George Patton or General MacArthur, Douglas MacArthur, saying ISIS is tough.","I've seen these generals. They're always interviewed on television, Jerry. They're in television. I don't want my generals on television. First of all, you want to be unpredictable. You want to be like -- you don't want them to think -- what do you want to -- what are you talking on television? Unless you're feeding false information.","And of course, we would never do that because we're not -- I mean, the whole thing is ridiculous. But we have to be strong. We have to be smart and we have to win this election, and we have to win in Iowa. You know, a lot of people say, Donald, just say do well in Iowa. I say, I can't do that. I really want to win.","Now, maybe it won't work that way, but if we, do we're going to run the table folks and we're going to make this country so great, you're going to have victories all over the place. You can have victories all over.","So, tomorrow -- tomorrow, it's donaldjtrump.com and you just go out, it's going to tell you exactly where to go to caucus. But you got to get out. And I joke, I say, if you're sick, if you've got a 104 temperature, right? I've been doing this. If your doctor says you can not leave your bed, you won't make it. It doesn't matter.","Get up and caucus. Get up and caucus.","So you've got to get there. And it looks like this snowstorm will start the following day, so hopefully that won't be an excuse. But even if it starts a little early, who the hell cares? Go through the storm. Because what we want to do, Jerry, we want to win a mandate. We want to win by mandate. We want to have such strength -- and going into New Hampshire with a 25-point lead.","But if we can come out of Iowa with a nice victory -- it's so important. It's so important. And it's going to be so important for Iowa because you're going to have a great victory and we're going to go all the way. You know, recent polls are showing I beat Hillary Clinton. And if she runs -- I mean, is she going to be able to run?","Jerry, I mean if she runs. But it shows that we beat Hillary Clinton and beat her fairly soundly in a couple. I just say this. We're going to win. We're going to take back our country. We are going to make you so proud, you're going to remember this night. We're going to make you so proud of your President.","But you're going to be so proud of yourselves. You going to be proud of your country again. OK?","That's great. Amazing spirit.","I am pro-life.","Well, see Jerry says you were betrayed. I would say you were lied to by the politicians. You were really lied to because -- and I see it, whether it's in Iowa or anywhere else. New Hampshire, same thing. I get the same complaints up there. You'll send these people to Congress or you'll send them to wherever you're sending them, into Washington -- mostly into Washington, and they get there and then they -- all of a sudden they turn weak and they turn stupid.","They don't do what they're supposed to do. And they extend, like two weeks ago, the new budget which is -- did you ever see a budget like that? And did you ever see anything like that for that kind of money? They've taken care of Obamacare. They've taken care of the Syrians coming in. They've taken care of migration.","They've taken care of people coming across the border, which we're going to stop folks. They've taken care of so many different things. And during the previous debate though they were saying, Donald Trump -- you had Nikki Haley, who's a good woman -- and actually, by the end of the day, she was saying we're friends because -- I mean, she was really -- people were really angry at her.","She said there's great anger. And I was asked that question on the previous debate -- which everyone said I won but I won't mention that. Won big. I won all the debates according -- but you know what? I was asked that question on the previous debate and they said, is it true that you are angry? And I said, well -- you know, I'm supposed to say, no, no. It's not true.","I'm not angry. I love the way things are going. Isn't the Iran deal wonderful? Isn't it great? Isn't the border protection beautiful? I mean, what's good? We don't win anyway. We don't win. And so they said, anger, like I'm supposed to fight it. I said, I am angry. I'm really angry, and the people that are with are angry too.","And you know, it's interesting, because we're not -- you know, they want us to look like maniacs. We're not angry people but we're angry at the stupidity and the incompetence of our leaders. That's all. And you know what? In a short --","It's true. And you're not angry people. But in a short period of time, if I get in and if we go and just -- we're going to do a great job. You're not going to be angry anymore. You're going to be happy because we're going to win so much. You're going to be happy people again. But they asked me that question, Jerry, like -- you know, they wanted me to say, I'm not angry.","I'm not. And I said, you know, I'm really angry. I'm right. You're right. And then Nikki Haley said, no, no. It's OK. Donald's a friend of mine. He's a contributor. He just that -- and she was very nice. I'm not knocking anybody. But originally it started out being that we're all angry people. We just want to see great government.","We want to see security. We want to see wealth again. We want our country to be rich again. Because unless we're rich -- you know, a woman came up to me, Jerry, and she said, Mr. Trump, I don't like that statement, where you say you're going to become rich again, for the country. I said, but unless we become rich again -- you know, we're a debtor nation right now.","We owe $19 trillion. I would've never given that $150 billion to Iran. I would have told them, listen, I'm sorry, we don't have it. We're a debtor nation. We don't have it. We don't have it.","I would have never given that money to Iran and I would have never in a million years. First of all, I would've gotten the prisoners back long before the negotiations started. That I could tell you. But I would have told them, I said, fellas look -- you know, I'm sorry, but we owe too much money. We can't give you back.","Let's go. What's your next subject? What's your next subject? Let's get off that. Believe me, we would've had to walk for a day or two and then they would have called us. We'll double up the sanctions, they call us back, we start talking. But I would have never given -- one of the biggest problems -- assuming I get in -- you know people always get angry, I say, if I make it. They go, no, no. You're going to make it. Look, things can happen.","We have people, they're professional politicians, I'm running against. They're governors, they're senators, et cetera, and some are smart. And frankly, some aren't very smart. I mean, if you look at Lindsey Graham, in South Carolina, the poll is I'm 38 and he's 1 and he's the sitting senator. Think of that.","But you look -- and by the way, I totally disagree with his ideas on the military. These ideas. These ideas have been going on for 15 years. What have we won? Nothing. We've won nothing. We have won absolutely nothing. And our military has such potential but I don't even want to think about using the military.","We just want to make it so strong, Jerry. It's the cheapest thing we can do. Be so strong that people just -- and I said it before, they're not going to play with us. They're not going to play the game. Right now they taunt us. They just taunt us. We're not going to let them play the game. We're going to be great again.","We're going to be strong again.","Thank you, Jerry. You know, just in finishing. I just wanted to add just a couple of things. Because I believe that I will win states that the Republicans never even put down as a possibility. I mean, we're going to win Virginia. We're going to win Michigan. Hey, I'm going to bring the car industry back into Michigan.","You know, when --","When Mexico takes the big Ford plant, two and a half billion dollar plant, that's not good for us folks, OK? There's nothing good about it. And we're going to win Michigan. They've already seen -- I've seen polls that are through the roof in Michigan. Somebody called me, they said, you know, you're winning Michigan.","We're talking in a general. And Ohio, we're going to win Ohio. And I like John Kasich very much but I'm beating him by a lot in the polls. I mean, I beat him in Ohio and he's a good Governor but I'm beating him by a lot. And you go to Florida, I'm at 48% and Marco Rubio, good guy, but he's at 11. And Jeb Bush is -- he's down.","","He's -- boom. You know he spent -- Jerry, he spent a hundred -- he's now up to $110 million. Think of it. I'm the -- OK. Look, I don't like to brag and I'm actually going to start to spend a lot of money because I feel guilty not doing it. Because these guys will start saying he should spend more money. But you know what?","Although they're very impressed. So I've spent just about the least money. He's spent the most. I'm in first place. He's in, like, last place. Isn't that great? Wouldn't that be great if we could do that for our country? Wouldn't that be great? Wouldn't that be great?","You know, in education, in the world you have -- in the world you have Sweden, you have Denmark, you have China. One, two, three. And it changes around a little bit. Basically it's Sweden, Denmark, Norway, China. That group. So we spend more money, by far, per pupil, than any other country in the world. By far.","Second place doesn't even exist. They're so far behind. We're ranked number 28 in the world in terms of education. Common Core is going by the way. It's gone. It's gone. OK? Gone.","It's so stupid. Educate the children in Iowa from Washington D.C., where you have bureaucrats. And not all are bad. But you know it's -- they're getting massive salaries. You ever see the Department of Education? The massiveness of that building and the people. What are they doing? Local education is the way to go. And it's obviously not working because we're ranked number 28. We have third world countries ahead of us. So when you equate it to me spending very little and now -- you know, compare that with the Bush and other people that have spent so much money, they're not doing well.","Wouldn't it be nice if we spent, in this country, on various things, we spend less and we're at the top of the heap. The same way. And that can happen. That can happen. So -- and that's what's going to happen. But I just want to tell, you this is a special man. We've traveled -- today is the third one we've done.","He doesn't do this and his wife is amazing. His family is amazing. And Becki was telling me, Jerry was so excited. He doesn't do this. And the job he's done at Liberty University, the job he's done there is incredible. When I went there recently -- I was very happy to say I broke the record but these are minor details.","I had to get that out. I had -- I'm sorry. But I was there a couple of weeks ago. What they've built at Liberty is so incredible. And for Jerry to devote, really, two days to endorsing me and going around as an individual, and bringing his family, is such an honor because truly he's one of the -- beyond religion.","Beyond Christianity. Beyond evangelical. He's such a great man. I mean, beyond and for -- to have the support of Jerry and his family is such an honor and I want to thank you very Jerry.","Thank you."],"text":" Thank you. Wow, what a nice crowd. It's a great place. Thank you very much everybody. Thank you very much Jerry. Jerry's been so amazing, actually, folks. You know I'm a farm boy from -- I live on a farm in Virginia, and I was riding on the plane with Mr. Trump today, and I expected champagne and caviar, but he served us -- he served us Wendy's cheeseburgers and so I felt -- I felt at home and I was suddenly put at ease but we are -- we're just so honored to be with you, Mr. Trump, and we just -- I just thought I would talk to you about some issues that are so important to our country and to all the folks here. And you know, one of the first questions a lot of people ask are -- you know, you had every reason not to run for President. You've been so successful in business. You have a wonderful family. His family's here with us tonight and he just -- he could have sat back, he could have enjoyed -- There they are. Melania, Ivanka, Jared. It's Ivanka's husband. That's so nice. And Ivanka's going to have a baby any minute, so we're all set. And I said, Ivanka, please, please have the baby in Iowa. It would guarantee victory. Thank you very much, that's very nice. Thank you. I brought my whole family too. If you guys would stand, Becki and Trey and Wesley. Right here. But we -- my younger son just got married at Mr. Trump's vineyard in -- it's near where we live. And my wife pointed out to a crowd earlier today, that we paid full market rate to use that venue. Not an -- not one penny discount, even though he offered it, so -- Actually, when he said we insist on doing that I doubled up the prices. I figured, what the hell? But it was worth every penny. It was a beautiful venue and so glad my family was able to join us. But what what motivated you to run for President when you could have just sat back and enjoyed your business successes and your family and, you know, the -- for a national politician, it's such a vicious atmosphere now. It's the scrutiny and the lies I heard, several lies told about you today, by some of the other candidates. These people are the worst. I thought real estate people in New York were bad. These politicians are the worst liars. Wow. They are terrible. These are terrible. They'll say anything. It's, like, incredible. Actually, we saw one. We were both amazed at it. It says, voter violation. We just -- did you see this today? The Cruz campaign. Voter violation. And it's like an official document being sent to people in Iowa, that they have to get out vote because they're in violation, and then they have the grades for different things. And it says F. And it's so -- I mean, it's terrible. I've never seen anything like it. And I guess your attorney general is investigating it, and it just came out. But I said, that is really terrible. It's a fraud as far as I'm concerned. But you're in a rough business over here. I'll tell you what -- and one thing I said before, Jerry, you haven't had a winner in Iowa in 16 years. We're going to have a winner, you better believe it. You're going to have a winner this time. You going to have a winner. We're going to -- we're going to change that. That's a bad spell. 16, that's a lot of years. Well, one of the candidates said that -- one of the candidates said you voted for Obama both times and I heard you tell Bill O'Reilly, the other night, that you voted for McCain and Romney. And you -- I was on the committee. Yeah, and you helped them raise money and so it's just -- they'll stop at nothing and it was -- anyway, but what -- One of them actually did. They said I was pushing Obama in '08. I was on McCain's committee. I liked McCain, he was a nice guy. He tried. It was a tough deal for him. I mean, that was an election that was tough to win because of what happened a couple of months previous, with the economy. But you know, the last election, we should have won. That was the Romney election. I mean, sad. I'm not blaming anybody. I'm just saying sad that we didn't win it. And one thing I will say, Obama -- and you have to give him credit. He was on television every night. He was on David Letterman, Jay Leno. And Mitt was not around very much. And I'd call their campaign and say, why is he not going on television? He's got to go on television. He ended up losing. That was an election that we should have won. That should have been a victory. He had a failed president and that was an election that should have been won. By the time Obama leaves office, Iran will have $150 billion of money that they don't have no. They're the leading state sponsor of terrorism in the world and -- tell us what you'll do about that. Well, you know, I use that deal all the time. A lot of you have heard some of my speeches and -- see all the press we have back there? Look at these people. They just never stop. But a lot of you -- a lot of you have heard the different speeches that I've made, and a lot of times I'll use that whole Iran deal as an example of gross incompetence and horrible deal-making where we get nothing. We're giving $150 billion. They're a terrorist state. And I don't know, I mean even beyond that, did you hear last week, where Kerry said, no, no. We would expect some money to be spent on terror. And I'm saying, did he really just say that? And I figured they'd issue some kind of a statement saying he didn't say it, even though that's what he said. And he actually made that statement. Now they're going around though, and they're taking the money, they're spending it all over Europe, all over the world. They're spending it everywhere but our country. They just ordered 118 Airbus planes, which is obviously not made by Boeing. Instead of ordering Boeing jetliners, they ordered from Airbus, which is European manufactured. They're buying in Italy. They're buying everywhere but us. They're buying missiles in Russia. I didn't know they were allowed to buy missiles but they're buying missiles in Russia. They shouldn't be allowed to buy missiles. And they're spending that money all over, except for one place, the United States. That is the most incompetent deal I think I've ever seen in my life, of any kind. Horrible. Well, you know, I -- I -- Mr. Trump first spoke at Liberty University in 2012. And I'm endorsing Mr. Trump personally. Not for Liberty University. But I just have to make that clear. But we started to learn a few things about Mr. Trump, I did, after I got to know him and he became a friend, and I started to learn about how he was so generous. He had found out about Clyde Frazier Jr., who had operated the Harlem Hoops basketball tournament in the inner city. He got killed in the 9/11 attacks on the United States. Mr. Trump tracked down his father, found him, gave the money to keep the tournament going. He heard about -- on 60 Minutes, about a Maytag plant in Newton, Iowa, that was moving to Mexico. And he heard about three businesses that -- in that little small town, that were closing down because the plant was leaving. He found ways to -- for his hotels, to buy supplies and to -- he paid for the cheese and the bread at the local Domino's to keep it open, and just little things like -- you know, he -- after he visited liberty, I told him about another Christian ministry in another state that needed some help. I learned, in a few days, he had donated $100 thousand to that ministry. A couple helped him on the side of the road. His limousine broke down on a deserted highway and he paid off the couple's mortgage. So, the other night, when all the other candidates -- the other night, when all the other candidates were sparring on the stage, he decided to hold an event to raise money for veterans. He raised $6 million for our veterans. And right now we're going to make -- this is the third disbursement to a local charity. This is -- That's great. This is for the Siouxland Soldiers and it's $100 thousand. Thank you. Thank you. So, we did. We had a great evening. And these are incredible people. And because of the largesse, because of the niceness of Carl Icahn, who's one of our great businessmen and who will help us with our negotiations with China -- believe me, we're going to come out just fine, and many other places and many other businessmen that are friends of mine. Phil Ruffin gave a million dollars, from Las Vegas, and Carl gave a half a million dollars. Ike Perlmutter, the great Ike Perlmutter, the head of Marvel. A brilliant man. He and Laurie, his wife, gave one million dollars. And so many others. I mean, we've had such -- we had, in one hour, we raised six million dollars for the vets. And Jerry, we vetted the vets very closely because we want to make sure. And we picked about 20 groups, 22 groups and we're giving a lot of money out and they're really happy about it. Tell us, what do you do exactly? What do you do to deserve all this money? Well, Support Siouxland Soldiers started as a care package program about 10 years ago, just right across the street, sending boxes of candy and snacks to the troops overseas. And over the last 10 years we've grown significantly, thanks to this wonderful community. Very patriotic community. Now we distribute groceries, we do hot meals, housing assistance, financial grants. We help however we can and we do it all based on donations just from this community, and we've been doing it for 10 years. So -- That's so great. This is going to help a lot. Thank you so much. Well, that's so great. Congratulations. That's great. Thank you. Fantastic. Thank you. Thank you, darling. You take care of yourself. Thank you. Thank you very much. So many great people it's amazing. You know that's one of the things that really endeared me to Mr. Trump, because it reminded me so much of my father. He was he was very outspoken. He had a sign -- a billboard at the entrance to Liberty's campus for years. It said, Liberty University, politically incorrect since 1971. But he was always so generous to people in need. He was -- he gave away so many scholarships to students in need, he almost bankrupted the school. That's a fact. And he -- my what my mom would never let him have the family checkbook, because if she had, he would have given all the money away to people in need and we wouldn't have any money to pay the bills. But that's something that reminded me of my father and Mr. Trump. But that's not why I endorsed him. I endorsed him because I sincerely believe -- you know my father was criticized, in the late 70's, early 80's, for supporting a Hollywood actor who had been divorced and remarried over a Southern Baptist Sunday school teacher. Of course the actor was Ronald Reagan. The Sunday school teacher was Jimmy Carter. But he said it -- you know, Jesus said, render unto Caesar the things that are Caesar's. And he believed that meant we're to be good citizens and rendering under Caesar means choosing the leader who'd make -- would make the best president of the United States. Not the best Sunday school teacher. Not the best pastor. It's just like when you have a sick child, you want to find the most qualified doctor to treat that child. Not necessarily one that shares your faith. And he believed that, he pounded that into me from an early age. And that's why I'm supporting Donald Trump. Because I believe, with our country's debt, where it is now, I believe with our -- with the attack -- terrorist attacks, with the open borders, that we need somebody from the private sector, not a career politician. Somebody who's done it in the real world. And that's why I decided to endorse Donald Trump. But I -- Thank you. Thank you. Thank you Jerry. But you know-- So nice. Thank you Jerry. You know, under Obama's leadership, we're gonna add $10 trillion to our debt. More than all the other Presidents in history combined. And you're going to inherit that mess. What will be your course of action to turn it around? Well, number one, we have to stop the fraud, waste and abuse. It's massive throughout our country. It's massive. And everybody's, you know, into that and we're going to do that. But we're going to bring back our jobs. If you look at what China has done to us. What Japan -- I've been talking about this for years, but the politicians, they're all talk, they have no action, they have no clue how to do it. But if you look at China, Japan, Mexico -- I have great relationships with Mexico, with the people of Mexico. I have thousands of Hispanic employees. in fact, Ivanka was just telling me today, in The New York Post there's this great article about me and the Hispanics, where -- I guess it's from the Hispanics living here legally. I'm just doing so phenomenal. I'm number one in the polls with Hispanics living here legally. I mean, my relationship with Hispanics is great. But -- Thank you. We're going to bring back jobs to this country. We're going to take them back from Mexico. We're going to bring them back from China. You know, I often say that what China has done to our country is the biggest theft and the greatest theft in the history of the world. They've taken our jobs, they've taken our money, they've taken our base, they've taken our heart and they've rebuilt China. And we have the power over them. You know, we have a leader that has no idea -- if you call him a leader. He has no idea, has absolutely no idea what to do about this or how to negotiate. And every time the top people come over from China, they're getting these big, you know, beautiful -- they put a tent on the White House. We don't have a ballroom at the White House. I offered, by the way Jerry, years ago, to build a ballroom at the White House, free of charge, a $100 million ballroom. I said we'll get the top five architects in America. We'll get the top people. Top everything. We'll have the best ballroom. Because I noticed they always put tents up on the lawn. Number one, it's not a good security thing. Number two, the guy that owns the tents is making a fortune. OK? This poor guy, I mean, he's making so much money. All he needs is one tent and he charges them so much, he's making a fortune. All right. But I said, I will build a ballroom. I gave it to the Obama -- actually told David Axelrod, a good guy -- you know, very capable guy. I told David Axelrod, David, I will build a ballroom, free of charge, at least $100 million. We'll make it the finest ballroom in the world. We'll put it someplace so it works contextually, magnificently. It'll be done. We'll have committees set up. I never heard back. I never heard back. It's -- you know, it's just one of just thousands of things. I mean, if someone's going to give me a free ballroom, I'm going to take it. We'll put it in an area, it'll look great. But you know, we don't have a ballroom at the White House, so -- But I see the heads of China come in and we treat them so beautifully and yet, this year, we will have a trade deficit with China of $500 billion. What kind of business is this? And this has been, by the way, going on for many, many years. And Japan, same thing. Smaller numbers but the same thing. They send the cars in by the millions and we have tremendous deficits. And Mexico, when I say we're building a wall, we're going to build a wall. Believe me. And who's going to pay? Who's going to pay? Mexico. Mexico, Jerry, is going to pay. And the politicians come off the stage with me and they say, you know, I don't understand. How can you say Mexico? Mexico's not going to pay for the wall. I said, of course they are. They said, how? And I don't want to really tell them because it's going to take them a while to figure it out. But very simply, Mexico is making a fortune on the United States, OK? A fortune. Far greater than what we're talking about. And the cost of the wall is peanuts by comparison to what they're making. It will be, trust me, very, very easy. Very easy. You know, in 2007, about an hour and a half from where I live, 32 students were murdered at Virginia Tech University by a deranged killer. And after that, Liberty University, where I'm president, we became one of only a handful of universities in the country that decided to allow concealed carry permits on campus. Because it just -- it haunted me to think what could have happened if just one or two in that room had had a -- had had their permit had been able to protect themselves. And then in San Bernardino, just recently we contacted the victims and many of them -- we learned, after contacting them, that some of them had just become Christians and were looking for a Christian university to send their children, and we've offered them scholarships and we've -- the only thing that made the news was that we had met our concealed carry permits, I mean our rules, even more convenient for permit holders to carry. But what we were trying to do is help the ones that were hurt. And you've talked a lot about what needs to be done, as far as Second Amendment rights. It seems like -- since 1950, of all the mass shootings in the United States, only one has been outside of a gun free zone or in a in a zone where guns were allowed. But what's your thoughts on that? Well, look, the Second Amendment, we're going to protect it. We're going to take care of it and we're going to cherish it, and we're not going to let people nip away at it like they've been doing, OK? And -- If you look at what happened, as an example in Paris, Paris is the most difficult place, they say, in the world. Who knows? But it's certainly very difficult. And France, generally, you can't have a gun. You just -- it's impossible, practically, except for the bad guys. The bad guys can have a gun because they just have a gun. Now, if we had, in California, the 14 people that were killed or as an example, in Paris where they killed 130 people with many more to follow. You know many people that are gravely -- I mean, really in bad shape. Lying in hospitals right now. At a minimum, their lives are destroyed and they're going to have a rough life. But these guys walked in, boom, boom, boom, boom. They could've stayed there all day and done same thing. And they killed 130 people. So many badly injured. In California, I mean, where the wedding was actually, in a form, thrown. They were giving parties. They know each other. They knew everything about it. I guess they gave a baby party. And it's the most incredible thing. Walk in they shot 14 people. Would have killed more. If we had somebody, like that gentleman with the beautiful white Make America Great Again hat on or the red Make America Great hat on or anybody, you, you. Anybody. If we had some people, meaning, if there were people in Paris or if there were people in California or if there were people, you know, the five soldiers that were killed nine months ago in a gun free zone on a military base -- I'd end that immediately, Jerry, with a executive order. You can knock that out immediately. The five soldiers, two of them were world class marksmen. They were all great soldiers. They were told they couldn't have their guns. Gun free zone. Put the guns 200 yards away. Lock them up. They can't be there. This whack job walks in, shoots all five of them. If they had their guns, would have been a different story. If there were guns in Paris, on the other side -- just a few. Maybe on the ankle or on the waist, where you lift up and you start shooting bullets in the other direction, would have been a whole different story folks. If there were guns in California, where a couple of the people in that room, if not all -- but if a couple of people had guns, it would have been a totally different story. You wouldn't have 14 dead. And you know one thing, the police wouldn't have had to go all over the place. And I think the police in Paris by the way, and the police in California, I thought they did an amazing job. I really did. And speaking of that, the police in this country are really taking a beating and they're great, great people. The job they do is fantastic. Fantastic. So -- really true. So we have to protect our Second Amendment and we have to do it right or we're not going to have a country anymore folks. We're not going to have a country anymore. Thank you. I hear what I think are phony reports on unemployment all the time. Five percent, six percent, whatever. But I think if you counted all of the people who have given up, who are not looking for jobs anymore, some people say the number could be as high as 20, 22%. And I just don't know how we can continue to thrive as a nation, or even start to thrive again, with that many people out of work. I mean, tell us what your plan is. Well the job numbers that come back are a total nonsense. You know, these numbers were made a number of years ago, and the way they compile the numbers so that politicians look good. That's all it is. Because if you're looking for a job and you give up, statistically you are considered employed. So you have millions and millions of people that have looked and looked and looked and they gave up. There is no job. And if you look at the numbers that came out two weeks ago, they said that the numbers are 5.1 and 5.2%, which is total nonsense. I actually think it could be as high as 32, 35%. A lot of people think it's 35%. The real number. But if you look at the jobs that they do have, they're bad jobs. They're considered really bad jobs. Somebody got on one of the shows, and I read in great depth and detail an account. These are among the worst jobs that we've ever been talking about and yet they're considered jobs. So we're going to get real jobs back. We're going to bring them back from overseas. We're going to bring them back from all these countries that have taken them away from us. I mean, you have an example, you call up for a credit card to check or somebody calls you and I'll say sometimes, where are you based? And they'll be based in India. They'll be based -- I mean, it's amazing. And you notice, the accent is a little bit different. And where are you from? Well, I'm from India or I'm from another country. We're doing everything. We're not -- we don't have jobs. If you look at what's really going on with our country, we're going to be in such trouble. We're gonna bring our jobs back from overseas. We have incredible people. One thing I've learned more than anything else, they said, what have you learned? You know, we have a movement going on folks. Every room is like this. They're packed. No matter where we go they're packed. The cover of Time magazine last week, we had the most unbelievable writer. I never spoke to him. It was one of the best stories I ever had. And I said to my wife, I said, Melania I'm never going to speak to a reporter again. I got the best story and I never spoke to him. I don't waste my time. Because you know there's tremendous dishonesty with these people. They're the most dishonest among -- they're a little more honest than the politicians but -- you know. Maybe that's why they're so dishonest because the other one, look who they're dealing with. And I'm not a politician. Remember, I'm a businessman. We're a businessman. We're a businessman. But the cover of Time magazine is so amazing because it talks about the movement, and it's actually a picture of me talking to a crowd. It's actually a picture of the back of my head. I was very impressed. Fairly okay back there, with the -- you know. Not much of a bald spot, which is OK. But it's a picture of me standing, talking to a very large crowd of people. Which is standard. And it talks about a movement and it literally didn't have a bad half sentence in there. They said there's never been anything like this. There's never been anything like what's happening. And this is why -- and I'll just interrupt Jerry for one second. It's so important. You know, we're leading now in the polls in Iowa. So we're leading in everything. A poll just came down -- And the folks from Bloomberg are here, in all fairness. And even the Des Moines Register. Can you imagine? They couldn't have been happy with Trump leading their poll. They were not happy, I guess. But John and, you know, the group is here and there's some -- I mean, look, you do have some Mark and John and their wives and families are here. You have some great people. You have some great people in this country. Some great, great people in this country. And I was going to say that, what I've learned more than anything else in doing this is how incredible, smart, committed the people of the United States are. It's incredible. They want to see America be great again. It's very simple. They want to see our country be great again. But I really wish you'd go see this because that story was so inspiring to read. And it's not a story, really, about me. It's a story about you. It's a story about people that are fed up. They're sick and tired, you can call it angry, at the debate before the one I skipped. And the reason I skipped it, by the way, was because I was not treated properly by Fox. And they've been very nice since, and they were even very nice before, they wanted me to go on the debate. And they didn't do well on the debate. They would have done very well had I gone. We would've broken every record in the book. But I couldn't. But you know what? I'm glad, in many respects, I didn't do it. What happened -- a poll just came out in New Hampshire, just two minutes before we came on, and in that poll I have a 25-point lead. You know what a 25-point lead is? And people respect the fact that I skipped the debate because I wasn't treated right. And we have to do that. I wasn't treated properly. And we have to think about that with our country. When our country isn't treated right, our leaders have to do what's right for the people. I mean, we get beat up by everybody. We get beat up by everybody. There's nothing. We don't have victories anymore. we don't win anymore. I mean, when was the last time we had a victory? We don't win on trade. We can't beat ISIS. Can you imagine General George Patton or General MacArthur, Douglas MacArthur, saying ISIS is tough. I've seen these generals. They're always interviewed on television, Jerry. They're in television. I don't want my generals on television. First of all, you want to be unpredictable. You want to be like -- you don't want them to think -- what do you want to -- what are you talking on television? Unless you're feeding false information. And of course, we would never do that because we're not -- I mean, the whole thing is ridiculous. But we have to be strong. We have to be smart and we have to win this election, and we have to win in Iowa. You know, a lot of people say, Donald, just say do well in Iowa. I say, I can't do that. I really want to win. Now, maybe it won't work that way, but if we, do we're going to run the table folks and we're going to make this country so great, you're going to have victories all over the place. You can have victories all over. So, tomorrow -- tomorrow, it's donaldjtrump.com and you just go out, it's going to tell you exactly where to go to caucus. But you got to get out. And I joke, I say, if you're sick, if you've got a 104 temperature, right? I've been doing this. If your doctor says you can not leave your bed, you won't make it. It doesn't matter. Get up and caucus. Get up and caucus. So you've got to get there. And it looks like this snowstorm will start the following day, so hopefully that won't be an excuse. But even if it starts a little early, who the hell cares? Go through the storm. Because what we want to do, Jerry, we want to win a mandate. We want to win by mandate. We want to have such strength -- and going into New Hampshire with a 25-point lead. But if we can come out of Iowa with a nice victory -- it's so important. It's so important. And it's going to be so important for Iowa because you're going to have a great victory and we're going to go all the way. You know, recent polls are showing I beat Hillary Clinton. And if she runs -- I mean, is she going to be able to run? Jerry, I mean if she runs. But it shows that we beat Hillary Clinton and beat her fairly soundly in a couple. I just say this. We're going to win. We're going to take back our country. We are going to make you so proud, you're going to remember this night. We're going to make you so proud of your President. But you're going to be so proud of yourselves. You going to be proud of your country again. OK? That's great. Amazing spirit. You know, 60% of Republicans say that they -- that the Republicans in Washington D.C. have betrayed them, have lied to them. A lot of evangelical Christians feel like they've been fed a line, for decades, on social issues. And now a majority of them are supporting you. You're pro-life. You are -- I am pro-life. Just like just like Ronald Reagan, you've evolved in your views on many issues. My father comes from a -- in rural Virginia, where I grew up, you could put -- 50 years ago, you could have put all the Republicans in that whole area in a phone booth, and including my family. But my father was the first one to move over to Reagan. And -- do you agree with that? Do you think that it's because they've been betrayed? That they're looking for somebody who might not say exactly what the consultants have told the politicians to say, only to be betrayed when they get into the White House and -- but you might not say everything exactly like your handlers would like you to say it. But, you know what? To me that makes it more believable to me. It's just my opinion. Well, see Jerry says you were betrayed. I would say you were lied to by the politicians. You were really lied to because -- and I see it, whether it's in Iowa or anywhere else. New Hampshire, same thing. I get the same complaints up there. You'll send these people to Congress or you'll send them to wherever you're sending them, into Washington -- mostly into Washington, and they get there and then they -- all of a sudden they turn weak and they turn stupid. They don't do what they're supposed to do. And they extend, like two weeks ago, the new budget which is -- did you ever see a budget like that? And did you ever see anything like that for that kind of money? They've taken care of Obamacare. They've taken care of the Syrians coming in. They've taken care of migration. They've taken care of people coming across the border, which we're going to stop folks. They've taken care of so many different things. And during the previous debate though they were saying, Donald Trump -- you had Nikki Haley, who's a good woman -- and actually, by the end of the day, she was saying we're friends because -- I mean, she was really -- people were really angry at her. She said there's great anger. And I was asked that question on the previous debate -- which everyone said I won but I won't mention that. Won big. I won all the debates according -- but you know what? I was asked that question on the previous debate and they said, is it true that you are angry? And I said, well -- you know, I'm supposed to say, no, no. It's not true. I'm not angry. I love the way things are going. Isn't the Iran deal wonderful? Isn't it great? Isn't the border protection beautiful? I mean, what's good? We don't win anyway. We don't win. And so they said, anger, like I'm supposed to fight it. I said, I am angry. I'm really angry, and the people that are with are angry too. And you know, it's interesting, because we're not -- you know, they want us to look like maniacs. We're not angry people but we're angry at the stupidity and the incompetence of our leaders. That's all. And you know what? In a short -- It's true. And you're not angry people. But in a short period of time, if I get in and if we go and just -- we're going to do a great job. You're not going to be angry anymore. You're going to be happy because we're going to win so much. You're going to be happy people again. But they asked me that question, Jerry, like -- you know, they wanted me to say, I'm not angry. I'm not. And I said, you know, I'm really angry. I'm right. You're right. And then Nikki Haley said, no, no. It's OK. Donald's a friend of mine. He's a contributor. He just that -- and she was very nice. I'm not knocking anybody. But originally it started out being that we're all angry people. We just want to see great government. We want to see security. We want to see wealth again. We want our country to be rich again. Because unless we're rich -- you know, a woman came up to me, Jerry, and she said, Mr. Trump, I don't like that statement, where you say you're going to become rich again, for the country. I said, but unless we become rich again -- you know, we're a debtor nation right now. We owe $19 trillion. I would've never given that $150 billion to Iran. I would have told them, listen, I'm sorry, we don't have it. We're a debtor nation. We don't have it. We don't have it. I would have never given that money to Iran and I would have never in a million years. First of all, I would've gotten the prisoners back long before the negotiations started. That I could tell you. But I would have told them, I said, fellas look -- you know, I'm sorry, but we owe too much money. We can't give you back. Let's go. What's your next subject? What's your next subject? Let's get off that. Believe me, we would've had to walk for a day or two and then they would have called us. We'll double up the sanctions, they call us back, we start talking. But I would have never given -- one of the biggest problems -- assuming I get in -- you know people always get angry, I say, if I make it. They go, no, no. You're going to make it. Look, things can happen. We have people, they're professional politicians, I'm running against. They're governors, they're senators, et cetera, and some are smart. And frankly, some aren't very smart. I mean, if you look at Lindsey Graham, in South Carolina, the poll is I'm 38 and he's 1 and he's the sitting senator. Think of that. But you look -- and by the way, I totally disagree with his ideas on the military. These ideas. These ideas have been going on for 15 years. What have we won? Nothing. We've won nothing. We have won absolutely nothing. And our military has such potential but I don't even want to think about using the military. We just want to make it so strong, Jerry. It's the cheapest thing we can do. Be so strong that people just -- and I said it before, they're not going to play with us. They're not going to play the game. Right now they taunt us. They just taunt us. We're not going to let them play the game. We're going to be great again. We're going to be strong again. You know, I've never gotten involved in national politics before. This weekend is the first time I've ever done something like this. But the reason I decided to step outside my comfort zone and try to help Mr. Trump is because I think our nation is at a crossroads. I think, not only is the debt about to spiral out of control, but the next president is likely to have four Supreme Court appointments. And I don't think that our values as a nation can survive four conservative Supreme Court justices being replaced by Hillary Clinton. I just don't believe that. And I have never, since Ronald Reagan, have seen anybody pull voters from from the Democratic Party. I've never -- from other demographic groups that don't usually vote Republican. From from every walk of life and many who've never voted before. The last time that happened was with Ronald Reagan, and this man is doing it. And -- So at this crucial point in our history, with so much is at stake, our security, our economy is at stake, our Supreme Court's at stake, we've got to choose a candidate on the Republican side who's electable and he's the only one that's electable in my opinion. Thank you, Jerry. You know, just in finishing. I just wanted to add just a couple of things. Because I believe that I will win states that the Republicans never even put down as a possibility. I mean, we're going to win Virginia. We're going to win Michigan. Hey, I'm going to bring the car industry back into Michigan. You know, when -- When Mexico takes the big Ford plant, two and a half billion dollar plant, that's not good for us folks, OK? There's nothing good about it. And we're going to win Michigan. They've already seen -- I've seen polls that are through the roof in Michigan. Somebody called me, they said, you know, you're winning Michigan. We're talking in a general. And Ohio, we're going to win Ohio. And I like John Kasich very much but I'm beating him by a lot in the polls. I mean, I beat him in Ohio and he's a good Governor but I'm beating him by a lot. And you go to Florida, I'm at 48% and Marco Rubio, good guy, but he's at 11. And Jeb Bush is -- he's down. He's -- boom. You know he spent -- Jerry, he spent a hundred -- he's now up to $110 million. Think of it. I'm the -- OK. Look, I don't like to brag and I'm actually going to start to spend a lot of money because I feel guilty not doing it. Because these guys will start saying he should spend more money. But you know what? Although they're very impressed. So I've spent just about the least money. He's spent the most. I'm in first place. He's in, like, last place. Isn't that great? Wouldn't that be great if we could do that for our country? Wouldn't that be great? Wouldn't that be great? You know, in education, in the world you have -- in the world you have Sweden, you have Denmark, you have China. One, two, three. And it changes around a little bit. Basically it's Sweden, Denmark, Norway, China. That group. So we spend more money, by far, per pupil, than any other country in the world. By far. Second place doesn't even exist. They're so far behind. We're ranked number 28 in the world in terms of education. Common Core is going by the way. It's gone. It's gone. OK? Gone. It's so stupid. Educate the children in Iowa from Washington D.C., where you have bureaucrats. And not all are bad. But you know it's -- they're getting massive salaries. You ever see the Department of Education? The massiveness of that building and the people. What are they doing? Local education is the way to go. And it's obviously not working because we're ranked number 28. We have third world countries ahead of us. So when you equate it to me spending very little and now -- you know, compare that with the Bush and other people that have spent so much money, they're not doing well. Wouldn't it be nice if we spent, in this country, on various things, we spend less and we're at the top of the heap. The same way. And that can happen. That can happen. So -- and that's what's going to happen. But I just want to tell, you this is a special man. We've traveled -- today is the third one we've done. He doesn't do this and his wife is amazing. His family is amazing. And Becki was telling me, Jerry was so excited. He doesn't do this. And the job he's done at Liberty University, the job he's done there is incredible. When I went there recently -- I was very happy to say I broke the record but these are minor details. He did. I had to get that out. I had -- I'm sorry. But I was there a couple of weeks ago. What they've built at Liberty is so incredible. And for Jerry to devote, really, two days to endorsing me and going around as an individual, and bringing his family, is such an honor because truly he's one of the -- beyond religion. Beyond Christianity. Beyond evangelical. He's such a great man. I mean, beyond and for -- to have the support of Jerry and his family is such an honor and I want to thank you very Jerry. Honored to do it. Well, it truly is an honor for me to be here and -- thank all of you for coming out tonight. And again I say, the next President of United States, Donald Trump. Thank you."}