{"id":462,"author":"Donald Trump","title":"Speech: Donald Trump in Dubuque, IA","date":"2016-01-30","link":"https://factba.se/transcript/donald-trump-speech-dubuque-ia-january-30-2016","paragraphs":["Just going to be just our smallest little crowd. This turned out to be about 10 times bigger than we thought. This is really nice. I'll tell you what, this is the beginning. This is now crunch time. This is it. This is what it's all about. So we have to get out there in caucus and do all of the things that we have to do or we've all wasted our time, folks.","We've all wasted our time. So here's the story. The United States has just ordered a three billion dollar plane, three billion. Do you think I could have made a better deal than that? They're getting a new Air Force One. I didn't want to do it because if I did it, they'd say, \"Why are you doing that?\" And I actually held my power here.","I held my fire because I don't mind getting that plane, but, you know, it does seem like an awful lot of money, doesn't it? Three billion dollars, they're spending on a Air Force One. But let's let him have it, right? Let's let him have it. But that's what's going on. I guarantee, we could do better.","We could negotiate cheaper. It's time to get one because it's an old plane. When President Obama flew from Washington to Hawaii talking about -- remember the carbon footprint, right, to play golf for two or three weeks. It's a long time. Who wants to leave the White House for two or three weeks when you're in the -- he says Obama.","That's true. And longer than that -- and longer than that. So look, so we're talking about a carbon footprint, right? So the carbon footprint, an old 747 with big, beautiful engines that is spewing, if you believe in that to start off with, right? Now, the question is, do we believe in that? But that's the story.","Look, we have a chance to do something so great. Make America great again. All these hats, make America great again. Not to make bad deals, but to only make great deals. We're losing on trade. We're losing with Obamacare, which will be repealed and replaced by the way. If -- if you look at Obamacare, right?","You look at Obamacare and you see what's going on. 25, 35, 45% increases in your premiums. 35, 45, 20 don't get to use it. So we're going to -- we're going to come out winners now, folks. We're going to start to win again. When was the last time we won? Do we ever win? Do we ever win? Think of it, as a country.","We're like the big bully that gets beat up all the time. Do we ever win? We don't win on trade, right? We don't win with the military. We certainly don't win with the military. We can't beat ISIS, which is basically 30,000 people, and we can't win. Can you imagine General George Patton saying, \"We can't beat ISIS.\"? Can you imagine?","And I've seen -- you know, they go on talk shows, our generals, they go on talk shows. Can you believe a general going on a talk show? I don't want generals on talk shows. We want to show something special. We don't want people talking about we're going to do this then we're going to do that, then we're going to do this and that, and we're going to attack from behind.","What the hell do we have to talk so much? Just do it, right? So bad. It's so bad. So look, we're going to win with our military. We're going to win a lot. And hopefully, we're not going to use it much. We're going to make our military so strong, so powerful that nobody is going to mess with us anymore. You know, it's been -- our military is going down from the standpoint that we have older equipment.","We're not replenishing. General Odierno left recently and he said, on a talk show, that he's never seen -- he talked -- he used the word preparedness -- preparedness. We have never been so poorly prepared to fight. And maybe just about in our country's history, this is when we have to be at least prepared.","We don't want to have to do it. We don't want to do it, but we have to at least be prepared. Remember one thing, and now I'm getting credit, they give me credit for vision. You know, vision is very important. You're running for President, you need vision, right? Smaller. I said, \"Hit the oil. Hit the oil.\" How many times have you seen that in over four years?","Hit the oil. Take out . They kept saying, \"That's not a good strategy.\" Really? Why? That's where they got all their wealth. That's where ISIS got its wealth. They're also getting -- and I'll tell you right now, from banking circuit, OK? And I understand bankings. Do I understand banking circuit . And I want to tell you, they're getting a lot of money from that.","So I'll shut that down so fast. They don't know how to shut it down. I know how to shut it down. But I've said for four years, and most of you have been friends for a long time, and I'm friends of yours, equally, believe me, because we're all in this together. You know, this is a movement. This isn't like -- we're supposed to have 50 or 70 people.","I was going to get off the plane and go and we have about five or six stops, and I see this kind of a crowd, so we have to -- we can't just leave you flat, right? We've got to talk for a little while. By the way, do any -- do we have any like young kids here, like 10 years old? OK, let's do this. I have a little bit of an idea.","We'll have a -- look at that handsome guy. I have a -- why do we put him over here and we'll let them -- but without their parents, we'll let them run through the plane. Does that sound good? Right? Look, the parents are all upset. So let's -- we'll get a little group together. We'll get some groups, we'll run them through.","That's like the helicopter rides, remember? We had a lot of fun with the helicopter rides. We'll let the kids go run through the plane. I don't want the parents running through because the parents will damage it, right? The kids won't damage it, but the parents will. So you'll work that out. Thank you very much.","I appreciate it. I appreciate it. Do you want to let them wear out their voices? How about that. All right. Get them out of here, please. Play . Get them out. Get them out. Get them out. Unbelievable. Get them out. USA, USA, USA, USA.","So ridiculous. And so crazy. You know, we spoke to those people. Assuming they have good intentions, if we spoke to them for a few minutes, we could convince them, I think, unless they're on something, which is a real possibility. Because you really say, \"What are they doing?\" All right, get them out.","Get them out. Get them out of there. Come on. Let's go, Scott. Come on, Scott. Let's go. Get them out. Thank you. Don't hurt them. Don't hurt them. Do not hurt them, please. You know, I've done it both ways. I've done it rough and I get criticized. I did it really rough. We had this one guy, really bad guy.","He was swinging and punching people, doing a -- and I'm screaming, \"Get him out of here. Get him out.\" The place is going wild. Next day, I got killed in the press. They said we were mean and horrible. You know, four people ended up -- one guy had a broken nose, a black eye. And I was rough, right? The next day, we had a similar kind of a thing.","And I said, \"Do me a favor, don't hurt him. Don't hurt him.\" Because of the press, right? \"Don't hurt him. Easy.\" And the next day, they accused me of being not strong enough. You believe it? See, you can't win. You can't win. But we can win. The country is going to win. The country is going to win. We're going to win -- honestly, we're going to win so much.","We're going to win on trade. We're going to win with our military. Now, I get credit because I was against the Iraq war. Now, two years ago, people would say, \"That's terrible.\" Although, actually, it's about five years ago if you think about it. Because if you remember, Jeb Bush, he didn't know what to say.","He didn't know, am I against the -- He didn't know. Remember, he didn't know -- he didn't know what to say. Should he be against it or not? Took him six days before he figured out the right answer. That's not what we need. And besides that, he's in favor of Common Core. I don't even -- why am I even talking?","He's got 2% in the poll. But -- but, you know, he advertises. He spends tens of millions of dollars on ads against me. So whenever I can, you got to take a shot. That's sort of -- you know, I do this in about 10 seconds, and that's the equivalent of him spending $10 million. Isn't it great? But if you look at what's going on with our competition, should we speak about the competition for a second?","OK. First of all, a couple of them said, including Hillary. She said -- right, that's actually much more exciting than Jeb Bush, talking about Hillary. Because hard to believe, it looks like she's going to get the nomination and it looks like they're not going to do anything to her. It's hard to believe.","OK? Hard to believe. But if you look at her, she said, \"I don't like the tone -- the tone of Mr. Trump, the tone.\" What's the tone? They're chopping off people's heads in the Middle East, especially if you happen to be Christian. They're chopping off heads and she's worried. And actually, Jeb Bush, the same day, he said, \"I don't like the tone.\" Well, the tone is that Hillary wanted to go to war with Iraq and we totally destabilized the Middle East, and, boy, what a mess.","And Trump said very strongly, \"Don't go to war. You're going to destabilize the Middle East.\" So, you know, I'm -- I'm the guy with the tone, but I'm the guy that didn't want to go to war. You have to know what to do. You have to know when to use your military. We used it incorrectly. Now, Obama then came in and really blew it because instead of keeping some troops and doing what he has to do and not giving an exact date.","Remember when he said, came in, gave the exact date as when -- and the enemy pulls back. They couldn't believe it. Actually, they thought it was a camouflage, right? They say, \"It can't be possible. Nobody -- nobody can do that. Nobody would give us -- nobody in a million years would give us the exact date.\" He gave them the exact date, the enemy pull back, waited.","We pulled out entirely and they just knocked the hell out of us, right? It's just unjust, it's a mess. So now you look at the Syria, you look at what's going on with Syria. You look at the migration. We want to take tens of thousands of people that we have no idea where they come from. This country has enough problems, folks.","We've got problems like nobody has pro -- I mean, we have big -- we owe $19 trillion. Your great representatives that you just sent to Congress approved the budget. It's your fault by the way. They approved the budget. Did you ever see a budget so fast two weeks ago? Right? Another two -- two trillion, right?","So we have $19 trillion in debt. We're going to add at least another 2 trillion with the budget. And I think that budget took like 24 hours to do. And they funded the migration coming in. They funded all sorts of things that we don't want funded, including Planned Parenthood, they funded. You saw that. They funded so many things.","They funded Obamacare, an extension of Obamacare. And which is -- by the way, which is dying, which is going to be dead by '17 anyway, unless the Republicans extend it. And it's disappointing to me. I'll tell what's disappointing. We have Republicans. We sent them. They sound smart and tough and sharp, and they go and you -- you get elected.","We're going to beat Obamacare. We're going to do this. All -- all the things we want to hear. There's like seven of them that are absolute. We're going to win on trade, we're going to -- they get to Washington, they don't do anything. They don't even vote against it. You know, and they always say -- they walk in with their wife or their husband.","They look at these beautiful marble columns. They look at the angels on the ceiling. And they say, \"Darling, we've arrived. We've arrived.\" And they leave Iowa with a tough as hell. They get over there and they're like a basket case, right? Not going to happen with me, not going to happen. It's not going to happen.","Did you ever hear where they're talking about balancing the budget over a period of 25 years? 25 years to balance the budget. We'll do it much faster, folks, believe me, so much faster. We're going to make our country so great. We're going to make our country so strong again. We're not respected. You look at the way people treat us. They don't respect us. They take our money.","They take all of our money. China -- and by the way, I'm extremely friendly with China. Many good friends I've made, many good deals. I sell condos to these people. They're great people. The biggest bank in the world is my tenant. Pays me a lot of rent. I mean, what do I have against China? I'll tell you what though, I have things against our people for allowing the leadership in China to take such advantage of us when we have a trade deficit.","Think of it, $500 billion a year. And then they say, \"We want free trade.\" I want free trade, but it's got to be on an equal footing. It's got to be fair. It's got to be equitable. It's not equitable. And then you look at Japan, they're sending millions of cars, , pouring through. They take practically nothing, and you people know it better than anything.","And when you send your product, half the time -- a lot of the time, it gets sent back. Right? It gets sent back. And then they charge you taxes. You know, in China, they send their product and no tax. Come on in, folks, dump it in, everything. When we send it over there, it's impossible. A friend of mine's a great manufacturer.","He does business with China. He said, \"Donald, it's impossible. You can't get your product in. And when you do, they charge you tax.\" Well, with us, you come right in and there's no tax. We've got to make it fair. People like Carl Icahn have endorsed us, great business leader. We're going to use those people to negotiate for us now.","We're not going to use the donors that we have. You know, where they give campaign contributions. These are people that are, in many cases, just hacks. They're like political hacks. And the Chinese send these geniuses, tough as hell, no games, no smiles. They don't say hello when they walk in the office.","They want to get to work, right? You understand what I'm -- then I'd say, \"Isn't that a beautiful day? It's so wonderful.\" They don't care if it's beautiful or not. These people mean business. We don't mean business. We send diplomats and we send hacks, political hacks. Not going to happen anymore. We have the greatest business people in the world.","We're going to use them to renegotiate our trade deals. We're going to use them -- we're going to do something with Iran. That is the worst deal that I've ever seen negotiated, ever. The recent deal with Iran, the worst deal. We give them $150 billion. They've got 24 days. But that doesn't start for a long time because you have to go through a whole process, so they could have months before we can go and do inspections.","And they even have the right of self-inspecting. Then what happens is we get -- when it's all done and the money's passed, we get our prisoners back. You know what that's going to mean in terms of kidnappings and in terms of all of the extortions, which is basically what they did to us, they extorted us. OK? So the one thing that I hate is no matter what I do, the money's already gone, the money's already gone.","No matter what I do, we're not going to get that money back, but we'll get it back in many other ways. OK? And by the way, you see what they're doing with the money. They're all over Europe spending our money. They're all over Europe. They ordered Airbus, they didn't order beautiful Boeing's like that one.","They could have that for the right price too, I tell you. They would have it for the right price, Boeing. I love Boeing. But Boeing is here, Airbus is un Eur -- you know, it's Europe. So they ordered 118 airplanes and they ordered them from Airbus. Why Airbus? They're buying all over Europe. They're buying in Russia.","They're buying missiles from Russia. You know what they're buying from us? Nothing. They're not buying anything from us. And the one thing -- well, they hate us, and we're not so exactly thrilled with them either, right? But the one thing, if you look at it, i -- it's respect.","And Kerry goes up the other day, maybe the worst statement of all. He was talking about terror, and probably most you heard it because nobody could believe it. He said, \"Yes, we expect -- essentially, we expect some money will be used on terror.\" Really? I didn't expect that. They haven't used it yet. We haven't seen any.","But we expect, yes, that could happen. So, you know, in other words, billions of dollars could be used in terror. So what the hell did he make the deal for? How do you make a deal like that anyway? And the way you really should have negotiated that deal is four years ago when they had the prisoners. Four years ago, you go and say, \"You have to let our prisoners go.\" And I tell this to people.","It's like one-O-one, business one-O-one. You have to let our prisoners go. And they're going to say no, OK. You leave the room. There's nothing wrong with leaving. I did it the other night for the debate. I left. You know, I left. And I love Fox and -- and I love Roger Ailes and all those guys. But I'll tell you what, they weren't treating me right.","They put out some nasty memos. And by the way, if I was there, the Washington Post and other papers, they didn't do very well. I'll tell you. They did about half the number they should have had. They did 12 million. When I was there for the first one, we did 24 million, and they want to put a spin on it and that's OK. And it had nothing to do with -- what was her name, Megyn Kelly?","I don't care about her. What the hell difference does it make? I didn't get treated fairly by her, but I don't care about her. I didn't like it when they sent out a memo and I had to get an apology and I wanted five million dollars to go to our veterans, right? So they said, well, no. Actually, I thought they said yes for a while, but in the end, they said no. So I didn't do the debate.","I held the thing and some of you were there probably. Did you ever see lines like that? We had 800 people. We had 800 seats. We had lines that would have filled up a stadium. And I felt badly because so many people got turned away. People in this crowd got turned away. And we had lines that would have filled up a stadium.","And we raised, in one hour, six million dollars for the vets. How about that? Six million. And the point is, people have to treat you with respect. Everyone said, \"No way, he's not going to do it.\" I think the debate turned out to be good that I didn't do it. It was a lousy debate anyway. Boring, boring.","That was a hard thing to watch, wasn't it? But it wouldn't have been hard if I was there. You would have liked it, right? So anyway -- but look -- but it worked out, and Fox has been terrific. And they were even terrific before. They wanted me to go, they wanted me to go. But then -- and all of a sudden, the new event took on a , and it wasn't broadcast in tel -- they said it was broadcast in tel -- it wasn't on television.","We allowed cameras like these guys to come in, do whatever you want to do. But we had an amazing evening. We had one vet who lost his legs. He gave a talk. It was the most incredible talk you've ever heard about coming home. And he came home a different person. He came home with one less leg. His family didn't know how to react.","The V.A. is not good, it's a disaster. By the way, we're going to fix the V.A. We're going to make it so good because our vets are not being taken care of. And at that night, we raised six million dollars and we did it in one hour. And I had guys like Carl Icahn put up 500,000. Phil Ruffin put up a million.","put up a million. A guy named Donald Trump, who you probably never heard of, put up a million dollars. But we -- I'm so happy and I guess we have like 18 or 20 groups that are really, really terrific groups that have done an amazing job. But we're going to give the money and let them go and do their job because they've been doing a great job, but we have them very well vetted.","But they are going to go out and do a great job. So I'm very proud of that. But you have to know -- so how to walk because I couldn't go in there with sort of like -- I would've felt foolish walking on stage and they're sort of pointing like in football, taunting, you got a penalty, right? So they had to have a penalty.","But in the end, it works out. Now, Kerry should have walked. Kerry should have walked. He should've left. He should have said, \"No, no. We need our prisoners back. And if you don't give them back, we're leaving.\" And they would have said no. And now you go back and you leave. And you double up the sanctions, maybe triple them up, but you double up the sanctions.","Within 48 hours, they are calling you, saying, \"We're giving you your prisoners, congratulations. Please, please, don't do this with the sanctions anymore and let's talk.\" Then you go in. And you do it separately, you do it separately. You say, \"By the way, you make sure the prisoners are landed. They're on U.S. soil.\" Right?","Unlike a certain person I know. Who's that person? Ted Cruz, who was not born on U.S. soil, it's a problem. It's a problem. He's going to have to stop. He -- by the way, he has to solve that problem. That is an incredible -- the Democrats are going to sue. I mean, he was born in Canada. He was a Canadian citizen until 15 months ago.","How the hell can he run for President? And a lot of constitutional lawyers have just -- and I'm not just talking about Laurence Tribe from Harvard because he said it's unsettled law. But now they're coming out, saying, \"You just can't run. You just can't run.\" And he really can't run. I mean, I don't think.","But you're going to have to find out. The problem is whether he can or whether he can't, it has to be tested through the court system. So he has to go in, get a declaratory judgment, do something quickly. Because how can you nominate somebody who frankly might not have the right to serve as President of the United States?","So you're going to be putting your guts and your heart into it. You can't do that. I'm not even talking about the loans from Goldman Sachs that he made that he didn't report or the loans from Citibank that he didn't report because he wants to show that he's Robin Hood and he's such a good guy with the banks.","Should've reported them, personal financial disclosure form, right? Should've reported them. But you got to -- you got to prove that you're able to run for the President of the United States. So he's got a problem. Other people have different problems. Ted's got a big problem. Other people have different problems.","And me, I have no problems, you know. Let me tell you, I'm self-funding. I don't need anybody's money. When I fly on that big plane, I'm paying for it. I'm not having Goldman Sachs pay for it. I'm not having lobbyists and I'm not having Citibank and I'm not having -- I'm -- I fund it myself. I do it. I pay -- it's expensive, but I do it. I pay for everything.","I'm paying -- I'm self-funding my campaign. I'm the only one on either side that's self-funding my campaign. And -- and, you know, I'm proud of it. I did well. I built this incredible company. I mean, I built an incredible company, and now they go and they check and they say, \"Wow, it really is.\" I mean, the reviews I've gotten.","Nobody knew because I was private. It's much bigger and much better, much stronger, very low debt, tremendous income. And honestly, if I win, I don't care about that company. I don't care. This is so big and so important. I want to put that talent or whatever the hell it is I have, we want to put it to work here for the United States.","You know, I say I joke, but I say it's true. I've been offered so much money to run. You know, all these lobbyists come up to me and this \"Don, we've got to help you for you. We want to give you millions and millions and millions.\" I would have had the biggest fund ever created because I know all the guys that put up the money, because seven months ago, I put up the money.","Right? I put up the money. I was putting up money. I gave $350,000 to the RGA, Republican Governors Association. Right? I gave -- I -- I gave tremendous amounts of money to these guys. And I was very much -- I hate to say this, I was establishment. Once I ran, I was the worst thing that ever happened to the establishment.","I mean, they wa -- I go from establishment to non-establishment in about two minutes. But once I did this -- and I had to make a decision. The reason I decided to do it is because our country is going to hell. We're being led by people that are incompetent. They don't know what they're doing. These are people that are grossly incompetent.","Somebody else would say they're stupid people, but I don't want to say that because I think it's too crude. OK? So I refuse to say it. But -- but let me just tell you, we're being led by incompetent people, just like Kerry making this deal for Iran where he gives them the 150. But he didn't have to do that.","He would have had the prisoners back. He then would have gone and said, \"We can't give you the money.\" Look, I believe in taking the lumps out. My father always said, \"Take the lumps out, son.\" From Brooklyn. He said, \"Take the lumps out.\" If I was dealing with a contractor. He said, \"Sometimes you get too rough.\" I said, \"I don't want to get too rough.\" And he'd say take the -- so here's how you take the lumps out, to them.","We can't give you -- we have our prisoners back, right? They're back. OK? Now we say, \"We can't give you the 150 billion. We got no money. We owe $19 trillion. I want to give it to you so badly, we can't.\" And our people, approved by our Republicans, Repub -- two trillion on top of the 19 trillion. So -- and this happened two weeks ago, folks.","This happened two weeks ago. You all know about it. So you say to them, \"We can't give you the $150 billion because we're a bust nation. We don't have the money.\" They're going to go nuts, but they'll be fine. They're going to be angry for about an hour. They're going to stop. You know, they're great negotiators.","The Persians are great negotiator. So they're going to stop and we'll probably have to leave for a couple of days, again, come back, and then you start the negotiation. So now we have our prisoners back, we don't give them the money. And now we're talking turkey, right? I mean, now what -- and I would have never, obviously, gave them self-inspection rights.","You ever hear that? They self-inspect. A place that's the worst of all. They didn't want us going there. So there they have the right to self-inspect. In other words, you call them up. \"Listen, we hear you're building nuclear weapons in that location. Could you please check and call us back.\" Next day, we get a phone call.","Mr. President, we've checked the area. There is no activity going on. Give me a break. Why? How can this happen to us? And then on top of it, we have 10 young beautiful sailors. Their engine should have been fixed and go back and wave, right? Both sides, you know, wave. They get brought to land. They get put in a begging position.","Raise your hands. And I heard the tone of that guy talking, and you did too. That was a nasty guy. That was a nasty guy. Hold your hands up. And this is -- and by the way, two days later, they got the 150 billion. And if they weren't getting it two days later, those sailors still wouldn't be back. They might never be back.","They'll be back if I get to be President. But they may never be back. So here's the story. We have a chance to do something historic. Look at the cover of Time magazine this week. It's the most incredible story because it talks about -- they actually show the back of my head, it's almost like this picture.","And I checked, no bald spot. I was very happy. It's true. But -- but it's like this beautiful story. It's written by an amazing writer, because the press is largely dishonest. I mean, they're the most dishonest human beings. They're the worst. 75% of them are worst. Honestly, you have 25 that are fine, you have 10 that are fantastic people.","But a lot of these guys -- look at all the cameras back there. A lot of these people are totally dishonest people. Cover of Time magazine, the story was so fair. They said we've created a movement. We have a movement. We had 35,000 people in Mobile, Alabama. We had 20,000 people at the Dallas Mavericks arena, Dallas.","We had 20,000 people in Oklahoma, twice. No matter where we go, we have the biggest crowds. By the way, we have the biggest crowds by far over Bernie. He is second, I will say. He beats the other Republicans and he beats the Democrats by a lot. But we have a movement like there's never -- there's never been.","I mean, they're writing things that are amazing. And they call me and they say, \"It doesn't matter.\" One of the great writers called me, said, \"How does it feel?\" I said, \"How's what feel?\" \"You have done something that's never been done before. It's the summer of Trump.\" This was three months ago, and now it's the autumn of Trump.","And he said, \"You've never been --\" I said, \"Yeah, but it doesn't mean anything unless I win.\" And I don't mean win the nomination, I mean win win, so we can change this place and put it back like it's supposed to be like our founders had in mind. They said, \"How does it feel?\" We have to do it. And I said that it doesn't feel like anything.","He said, \"No, no. It doesn't matter if you win or lose, what you've done is something that's never been done before in this country. Politically, it's never been done. It's amazing. And it doesn't matter whether or not you win.\" I said to him, \"Listen, I really appreciate it.\" And he's a highly respected guy and a great guy.","I said, \"I really appreciate it, but unless I win, I would consider it a big, fat, beautiful, and by the way, very expensive waste of time.\" I really believe that. It's just a waste of time. So you have to get out in caucus. You have to get out there. I don't care what happens. You know, I joke and I kid and we have fun, and they always take it seriously.","Did you hear what he said? Wasn't that terrible? Did you hear? I joke, I say, if your wife leaves you for another man, if you leave your wife because you don't like her, I don't care what it is. If you're sick, if, you know, you've got to get out. If you don't get out, we're wasting time just like I told the reporter, \"You're wasting time.\" We have a chance to do something so historic.","And the people, wherever I go, Florida, I have 48% in the poll. The sitting governor -- the s -- I -- I mean, you have no idea. We have a senator who is a nice guy, Marco Rubio, but he's -- he's at 11. And you have Jeb Bush, who is there for eight years, and he's like at four or five. And I'm at 48. We have a chance -- no, think of it, that's 48%. And that was taken -- I guess we had about 15 or 16, that was taken a month ago or so, we had like 15 or 16 candidates.","Now, a couple have left, and a couple of more are going to leave after Monday, and then you going to have a couple of more leave after New Hampshire where we have a tremendous lead also. But if we can win here, if we win in Iowa, everyone's talking about it, we can run the table for the first time ever. We can run the table.","It's so important. And I have to tell you, because I've gotten to love Iowa. I have so many friends here. I'm here a lot. I love it. In fact, I'm thinking about buying a farm. Is your farm for sale? No, but -- but I love it. I love the people. I love the people. But you know what, I have to say this, don't be insulted.","You haven't had a winner in 16 years. You pick people. I mean, what are you doing? You haven't had a winner in 16 years. If you pick me, I'm leading every single state, including this one. But this is the closest of all of them. This is the closest. I've -- a poll came out yesterday, there's something, I'm leading only by five points.","I'm not used to five points. I like South Carolina where I'm leading by 22 points. I like -- I like South Carolina where I was at 39 and Lindsey Graham, the sitting Senator, was at one. He was at one, and he's the sitting Senator. I like New Hampshire where I have a 21 point lead. I don't like this five points, if you got to get out.","I promise you this. We're all going to do it together. It's a we, not an I. We will make this country so strong. And, you know, some people don't like when I say it. But you have to say it. A woman came up to me, she said, \"Mr. Trump, it doesn't sound nice.\" I said, \"We're going to make the country strong, rich.\" Didn't like the word rich.","I said, \"We are going to make our country rich again and then great again.\" And she said it doesn't sound good. I said, \"Let me tell you something. We can't be great unless we're going to be rich again. We're a poor nation. We're debtor nation.\" So we're going to make our country rich again. We're going to make our country powerful and strong again.","And we're going to make our country respected again. And the bottom line is, we are going to make our country great again. OK? So -- so get out on Monday, caucus. The storm won't be until Tuesday, I hope, because they say, all of these people on television I'm watching, they're saying if a lot of people come, and they think it could be a record forever.","They think if a lot of people come, Trump wins by a lot. If they don't come, I won't win. I won't win. And if I don't win, maybe bad things happen. Who knows what happens? You know, they talk about the cascading effect. Don't we all like winning? We've got to win, OK? So look, get out on Monday caucus. I think the storm's going to be on Tuesday, I hope.","But -- and -- and you know what, supposing it's on Monday, so you go through some snow, OK? You're -- you're from Iowa. Are you afraid of snow? Are you afraid of snow? But I don't think it's going to be, it's going to be like Tuesday morning and that's what they tell me, like the geniuses in the weather bureau, you know, which always get it wrong.","That's the problem. So look, I love you, folks. I love this country so much. I'm doing this -- I'm doing this -- people say, \"Why do you do this? It's so hard and so much work. It's a --\" I could be someplace else right now. You know that, right? I'm doing it because we have such potential in this country.","We have such unbelievable people in this country. I love you all, go out and caucus. Let's have a big, beautiful victory on Monday night. Thank you."],"text":" Just going to be just our smallest little crowd. This turned out to be about 10 times bigger than we thought. This is really nice. I'll tell you what, this is the beginning. This is now crunch time. This is it. This is what it's all about. So we have to get out there in caucus and do all of the things that we have to do or we've all wasted our time, folks. We've all wasted our time. So here's the story. The United States has just ordered a three billion dollar plane, three billion. Do you think I could have made a better deal than that? They're getting a new Air Force One. I didn't want to do it because if I did it, they'd say, \"Why are you doing that?\" And I actually held my power here. I held my fire because I don't mind getting that plane, but, you know, it does seem like an awful lot of money, doesn't it? Three billion dollars, they're spending on a Air Force One. But let's let him have it, right? Let's let him have it. But that's what's going on. I guarantee, we could do better. We could negotiate cheaper. It's time to get one because it's an old plane. When President Obama flew from Washington to Hawaii talking about -- remember the carbon footprint, right, to play golf for two or three weeks. It's a long time. Who wants to leave the White House for two or three weeks when you're in the -- he says Obama. That's true. And longer than that -- and longer than that. So look, so we're talking about a carbon footprint, right? So the carbon footprint, an old 747 with big, beautiful engines that is spewing, if you believe in that to start off with, right? Now, the question is, do we believe in that? But that's the story. Look, we have a chance to do something so great. Make America great again. All these hats, make America great again. Not to make bad deals, but to only make great deals. We're losing on trade. We're losing with Obamacare, which will be repealed and replaced by the way. If -- if you look at Obamacare, right? You look at Obamacare and you see what's going on. 25, 35, 45% increases in your premiums. 35, 45, 20 don't get to use it. So we're going to -- we're going to come out winners now, folks. We're going to start to win again. When was the last time we won? Do we ever win? Do we ever win? Think of it, as a country. We're like the big bully that gets beat up all the time. Do we ever win? We don't win on trade, right? We don't win with the military. We certainly don't win with the military. We can't beat ISIS, which is basically 30,000 people, and we can't win. Can you imagine General George Patton saying, \"We can't beat ISIS.\"? Can you imagine? And I've seen -- you know, they go on talk shows, our generals, they go on talk shows. Can you believe a general going on a talk show? I don't want generals on talk shows. We want to show something special. We don't want people talking about we're going to do this then we're going to do that, then we're going to do this and that, and we're going to attack from behind. What the hell do we have to talk so much? Just do it, right? So bad. It's so bad. So look, we're going to win with our military. We're going to win a lot. And hopefully, we're not going to use it much. We're going to make our military so strong, so powerful that nobody is going to mess with us anymore. You know, it's been -- our military is going down from the standpoint that we have older equipment. We're not replenishing. General Odierno left recently and he said, on a talk show, that he's never seen -- he talked -- he used the word preparedness -- preparedness. We have never been so poorly prepared to fight. And maybe just about in our country's history, this is when we have to be at least prepared. We don't want to have to do it. We don't want to do it, but we have to at least be prepared. Remember one thing, and now I'm getting credit, they give me credit for vision. You know, vision is very important. You're running for President, you need vision, right? Smaller. I said, \"Hit the oil. Hit the oil.\" How many times have you seen that in over four years? Hit the oil. Take out . They kept saying, \"That's not a good strategy.\" Really? Why? That's where they got all their wealth. That's where ISIS got its wealth. They're also getting -- and I'll tell you right now, from banking circuit, OK? And I understand bankings. Do I understand banking circuit . And I want to tell you, they're getting a lot of money from that. So I'll shut that down so fast. They don't know how to shut it down. I know how to shut it down. But I've said for four years, and most of you have been friends for a long time, and I'm friends of yours, equally, believe me, because we're all in this together. You know, this is a movement. This isn't like -- we're supposed to have 50 or 70 people. I was going to get off the plane and go and we have about five or six stops, and I see this kind of a crowd, so we have to -- we can't just leave you flat, right? We've got to talk for a little while. By the way, do any -- do we have any like young kids here, like 10 years old? OK, let's do this. I have a little bit of an idea. We'll have a -- look at that handsome guy. I have a -- why do we put him over here and we'll let them -- but without their parents, we'll let them run through the plane. Does that sound good? Right? Look, the parents are all upset. So let's -- we'll get a little group together. We'll get some groups, we'll run them through. That's like the helicopter rides, remember? We had a lot of fun with the helicopter rides. We'll let the kids go run through the plane. I don't want the parents running through because the parents will damage it, right? The kids won't damage it, but the parents will. So you'll work that out. Thank you very much. I appreciate it. I appreciate it. Do you want to let them wear out their voices? How about that. All right. Get them out of here, please. Play . Get them out. Get them out. Get them out. Unbelievable. Get them out. USA, USA, USA, USA. So ridiculous. And so crazy. You know, we spoke to those people. Assuming they have good intentions, if we spoke to them for a few minutes, we could convince them, I think, unless they're on something, which is a real possibility. Because you really say, \"What are they doing?\" All right, get them out. Get them out. Get them out of there. Come on. Let's go, Scott. Come on, Scott. Let's go. Get them out. Thank you. Don't hurt them. Don't hurt them. Do not hurt them, please. You know, I've done it both ways. I've done it rough and I get criticized. I did it really rough. We had this one guy, really bad guy. He was swinging and punching people, doing a -- and I'm screaming, \"Get him out of here. Get him out.\" The place is going wild. Next day, I got killed in the press. They said we were mean and horrible. You know, four people ended up -- one guy had a broken nose, a black eye. And I was rough, right? The next day, we had a similar kind of a thing. And I said, \"Do me a favor, don't hurt him. Don't hurt him.\" Because of the press, right? \"Don't hurt him. Easy.\" And the next day, they accused me of being not strong enough. You believe it? See, you can't win. You can't win. But we can win. The country is going to win. The country is going to win. We're going to win -- honestly, we're going to win so much. We're going to win on trade. We're going to win with our military. Now, I get credit because I was against the Iraq war. Now, two years ago, people would say, \"That's terrible.\" Although, actually, it's about five years ago if you think about it. Because if you remember, Jeb Bush, he didn't know what to say. He didn't know, am I against the -- He didn't know. Remember, he didn't know -- he didn't know what to say. Should he be against it or not? Took him six days before he figured out the right answer. That's not what we need. And besides that, he's in favor of Common Core. I don't even -- why am I even talking? He's got 2% in the poll. But -- but, you know, he advertises. He spends tens of millions of dollars on ads against me. So whenever I can, you got to take a shot. That's sort of -- you know, I do this in about 10 seconds, and that's the equivalent of him spending $10 million. Isn't it great? But if you look at what's going on with our competition, should we speak about the competition for a second? OK. First of all, a couple of them said, including Hillary. She said -- right, that's actually much more exciting than Jeb Bush, talking about Hillary. Because hard to believe, it looks like she's going to get the nomination and it looks like they're not going to do anything to her. It's hard to believe. OK? Hard to believe. But if you look at her, she said, \"I don't like the tone -- the tone of Mr. Trump, the tone.\" What's the tone? They're chopping off people's heads in the Middle East, especially if you happen to be Christian. They're chopping off heads and she's worried. And actually, Jeb Bush, the same day, he said, \"I don't like the tone.\" Well, the tone is that Hillary wanted to go to war with Iraq and we totally destabilized the Middle East, and, boy, what a mess. And Trump said very strongly, \"Don't go to war. You're going to destabilize the Middle East.\" So, you know, I'm -- I'm the guy with the tone, but I'm the guy that didn't want to go to war. You have to know what to do. You have to know when to use your military. We used it incorrectly. Now, Obama then came in and really blew it because instead of keeping some troops and doing what he has to do and not giving an exact date. Remember when he said, came in, gave the exact date as when -- and the enemy pulls back. They couldn't believe it. Actually, they thought it was a camouflage, right? They say, \"It can't be possible. Nobody -- nobody can do that. Nobody would give us -- nobody in a million years would give us the exact date.\" He gave them the exact date, the enemy pull back, waited. We pulled out entirely and they just knocked the hell out of us, right? It's just unjust, it's a mess. So now you look at the Syria, you look at what's going on with Syria. You look at the migration. We want to take tens of thousands of people that we have no idea where they come from. This country has enough problems, folks. We've got problems like nobody has pro -- I mean, we have big -- we owe $19 trillion. Your great representatives that you just sent to Congress approved the budget. It's your fault by the way. They approved the budget. Did you ever see a budget so fast two weeks ago? Right? Another two -- two trillion, right? So we have $19 trillion in debt. We're going to add at least another 2 trillion with the budget. And I think that budget took like 24 hours to do. And they funded the migration coming in. They funded all sorts of things that we don't want funded, including Planned Parenthood, they funded. You saw that. They funded so many things. They funded Obamacare, an extension of Obamacare. And which is -- by the way, which is dying, which is going to be dead by '17 anyway, unless the Republicans extend it. And it's disappointing to me. I'll tell what's disappointing. We have Republicans. We sent them. They sound smart and tough and sharp, and they go and you -- you get elected. We're going to beat Obamacare. We're going to do this. All -- all the things we want to hear. There's like seven of them that are absolute. We're going to win on trade, we're going to -- they get to Washington, they don't do anything. They don't even vote against it. You know, and they always say -- they walk in with their wife or their husband. They look at these beautiful marble columns. They look at the angels on the ceiling. And they say, \"Darling, we've arrived. We've arrived.\" And they leave Iowa with a tough as hell. They get over there and they're like a basket case, right? Not going to happen with me, not going to happen. It's not going to happen. Did you ever hear where they're talking about balancing the budget over a period of 25 years? 25 years to balance the budget. We'll do it much faster, folks, believe me, so much faster. We're going to make our country so great. We're going to make our country so strong again. We're not respected. You look at the way people treat us. They don't respect us. They take our money. They take all of our money. China -- and by the way, I'm extremely friendly with China. Many good friends I've made, many good deals. I sell condos to these people. They're great people. The biggest bank in the world is my tenant. Pays me a lot of rent. I mean, what do I have against China? I'll tell you what though, I have things against our people for allowing the leadership in China to take such advantage of us when we have a trade deficit. Think of it, $500 billion a year. And then they say, \"We want free trade.\" I want free trade, but it's got to be on an equal footing. It's got to be fair. It's got to be equitable. It's not equitable. And then you look at Japan, they're sending millions of cars, , pouring through. They take practically nothing, and you people know it better than anything. And when you send your product, half the time -- a lot of the time, it gets sent back. Right? It gets sent back. And then they charge you taxes. You know, in China, they send their product and no tax. Come on in, folks, dump it in, everything. When we send it over there, it's impossible. A friend of mine's a great manufacturer. He does business with China. He said, \"Donald, it's impossible. You can't get your product in. And when you do, they charge you tax.\" Well, with us, you come right in and there's no tax. We've got to make it fair. People like Carl Icahn have endorsed us, great business leader. We're going to use those people to negotiate for us now. We're not going to use the donors that we have. You know, where they give campaign contributions. These are people that are, in many cases, just hacks. They're like political hacks. And the Chinese send these geniuses, tough as hell, no games, no smiles. They don't say hello when they walk in the office. They want to get to work, right? You understand what I'm -- then I'd say, \"Isn't that a beautiful day? It's so wonderful.\" They don't care if it's beautiful or not. These people mean business. We don't mean business. We send diplomats and we send hacks, political hacks. Not going to happen anymore. We have the greatest business people in the world. We're going to use them to renegotiate our trade deals. We're going to use them -- we're going to do something with Iran. That is the worst deal that I've ever seen negotiated, ever. The recent deal with Iran, the worst deal. We give them $150 billion. They've got 24 days. But that doesn't start for a long time because you have to go through a whole process, so they could have months before we can go and do inspections. And they even have the right of self-inspecting. Then what happens is we get -- when it's all done and the money's passed, we get our prisoners back. You know what that's going to mean in terms of kidnappings and in terms of all of the extortions, which is basically what they did to us, they extorted us. OK? So the one thing that I hate is no matter what I do, the money's already gone, the money's already gone. No matter what I do, we're not going to get that money back, but we'll get it back in many other ways. OK? And by the way, you see what they're doing with the money. They're all over Europe spending our money. They're all over Europe. They ordered Airbus, they didn't order beautiful Boeing's like that one. They could have that for the right price too, I tell you. They would have it for the right price, Boeing. I love Boeing. But Boeing is here, Airbus is un Eur -- you know, it's Europe. So they ordered 118 airplanes and they ordered them from Airbus. Why Airbus? They're buying all over Europe. They're buying in Russia. They're buying missiles from Russia. You know what they're buying from us? Nothing. They're not buying anything from us. And the one thing -- well, they hate us, and we're not so exactly thrilled with them either, right? But the one thing, if you look at it, i -- it's respect. And Kerry goes up the other day, maybe the worst statement of all. He was talking about terror, and probably most you heard it because nobody could believe it. He said, \"Yes, we expect -- essentially, we expect some money will be used on terror.\" Really? I didn't expect that. They haven't used it yet. We haven't seen any. But we expect, yes, that could happen. So, you know, in other words, billions of dollars could be used in terror. So what the hell did he make the deal for? How do you make a deal like that anyway? And the way you really should have negotiated that deal is four years ago when they had the prisoners. Four years ago, you go and say, \"You have to let our prisoners go.\" And I tell this to people. It's like one-O-one, business one-O-one. You have to let our prisoners go. And they're going to say no, OK. You leave the room. There's nothing wrong with leaving. I did it the other night for the debate. I left. You know, I left. And I love Fox and -- and I love Roger Ailes and all those guys. But I'll tell you what, they weren't treating me right. They put out some nasty memos. And by the way, if I was there, the Washington Post and other papers, they didn't do very well. I'll tell you. They did about half the number they should have had. They did 12 million. When I was there for the first one, we did 24 million, and they want to put a spin on it and that's OK. And it had nothing to do with -- what was her name, Megyn Kelly? I don't care about her. What the hell difference does it make? I didn't get treated fairly by her, but I don't care about her. I didn't like it when they sent out a memo and I had to get an apology and I wanted five million dollars to go to our veterans, right? So they said, well, no. Actually, I thought they said yes for a while, but in the end, they said no. So I didn't do the debate. I held the thing and some of you were there probably. Did you ever see lines like that? We had 800 people. We had 800 seats. We had lines that would have filled up a stadium. And I felt badly because so many people got turned away. People in this crowd got turned away. And we had lines that would have filled up a stadium. And we raised, in one hour, six million dollars for the vets. How about that? Six million. And the point is, people have to treat you with respect. Everyone said, \"No way, he's not going to do it.\" I think the debate turned out to be good that I didn't do it. It was a lousy debate anyway. Boring, boring. That was a hard thing to watch, wasn't it? But it wouldn't have been hard if I was there. You would have liked it, right? So anyway -- but look -- but it worked out, and Fox has been terrific. And they were even terrific before. They wanted me to go, they wanted me to go. But then -- and all of a sudden, the new event took on a , and it wasn't broadcast in tel -- they said it was broadcast in tel -- it wasn't on television. We allowed cameras like these guys to come in, do whatever you want to do. But we had an amazing evening. We had one vet who lost his legs. He gave a talk. It was the most incredible talk you've ever heard about coming home. And he came home a different person. He came home with one less leg. His family didn't know how to react. The V.A. is not good, it's a disaster. By the way, we're going to fix the V.A. We're going to make it so good because our vets are not being taken care of. And at that night, we raised six million dollars and we did it in one hour. And I had guys like Carl Icahn put up 500,000. Phil Ruffin put up a million. put up a million. A guy named Donald Trump, who you probably never heard of, put up a million dollars. But we -- I'm so happy and I guess we have like 18 or 20 groups that are really, really terrific groups that have done an amazing job. But we're going to give the money and let them go and do their job because they've been doing a great job, but we have them very well vetted. But they are going to go out and do a great job. So I'm very proud of that. But you have to know -- so how to walk because I couldn't go in there with sort of like -- I would've felt foolish walking on stage and they're sort of pointing like in football, taunting, you got a penalty, right? So they had to have a penalty. But in the end, it works out. Now, Kerry should have walked. Kerry should have walked. He should've left. He should have said, \"No, no. We need our prisoners back. And if you don't give them back, we're leaving.\" And they would have said no. And now you go back and you leave. And you double up the sanctions, maybe triple them up, but you double up the sanctions. Within 48 hours, they are calling you, saying, \"We're giving you your prisoners, congratulations. Please, please, don't do this with the sanctions anymore and let's talk.\" Then you go in. And you do it separately, you do it separately. You say, \"By the way, you make sure the prisoners are landed. They're on U.S. soil.\" Right? Unlike a certain person I know. Who's that person? Ted Cruz, who was not born on U.S. soil, it's a problem. It's a problem. He's going to have to stop. He -- by the way, he has to solve that problem. That is an incredible -- the Democrats are going to sue. I mean, he was born in Canada. He was a Canadian citizen until 15 months ago. How the hell can he run for President? And a lot of constitutional lawyers have just -- and I'm not just talking about Laurence Tribe from Harvard because he said it's unsettled law. But now they're coming out, saying, \"You just can't run. You just can't run.\" And he really can't run. I mean, I don't think. But you're going to have to find out. The problem is whether he can or whether he can't, it has to be tested through the court system. So he has to go in, get a declaratory judgment, do something quickly. Because how can you nominate somebody who frankly might not have the right to serve as President of the United States? So you're going to be putting your guts and your heart into it. You can't do that. I'm not even talking about the loans from Goldman Sachs that he made that he didn't report or the loans from Citibank that he didn't report because he wants to show that he's Robin Hood and he's such a good guy with the banks. Should've reported them, personal financial disclosure form, right? Should've reported them. But you got to -- you got to prove that you're able to run for the President of the United States. So he's got a problem. Other people have different problems. Ted's got a big problem. Other people have different problems. And me, I have no problems, you know. Let me tell you, I'm self-funding. I don't need anybody's money. When I fly on that big plane, I'm paying for it. I'm not having Goldman Sachs pay for it. I'm not having lobbyists and I'm not having Citibank and I'm not having -- I'm -- I fund it myself. I do it. I pay -- it's expensive, but I do it. I pay for everything. I'm paying -- I'm self-funding my campaign. I'm the only one on either side that's self-funding my campaign. And -- and, you know, I'm proud of it. I did well. I built this incredible company. I mean, I built an incredible company, and now they go and they check and they say, \"Wow, it really is.\" I mean, the reviews I've gotten. Nobody knew because I was private. It's much bigger and much better, much stronger, very low debt, tremendous income. And honestly, if I win, I don't care about that company. I don't care. This is so big and so important. I want to put that talent or whatever the hell it is I have, we want to put it to work here for the United States. You know, I say I joke, but I say it's true. I've been offered so much money to run. You know, all these lobbyists come up to me and this \"Don, we've got to help you for you. We want to give you millions and millions and millions.\" I would have had the biggest fund ever created because I know all the guys that put up the money, because seven months ago, I put up the money. Right? I put up the money. I was putting up money. I gave $350,000 to the RGA, Republican Governors Association. Right? I gave -- I -- I gave tremendous amounts of money to these guys. And I was very much -- I hate to say this, I was establishment. Once I ran, I was the worst thing that ever happened to the establishment. I mean, they wa -- I go from establishment to non-establishment in about two minutes. But once I did this -- and I had to make a decision. The reason I decided to do it is because our country is going to hell. We're being led by people that are incompetent. They don't know what they're doing. These are people that are grossly incompetent. Somebody else would say they're stupid people, but I don't want to say that because I think it's too crude. OK? So I refuse to say it. But -- but let me just tell you, we're being led by incompetent people, just like Kerry making this deal for Iran where he gives them the 150. But he didn't have to do that. He would have had the prisoners back. He then would have gone and said, \"We can't give you the money.\" Look, I believe in taking the lumps out. My father always said, \"Take the lumps out, son.\" From Brooklyn. He said, \"Take the lumps out.\" If I was dealing with a contractor. He said, \"Sometimes you get too rough.\" I said, \"I don't want to get too rough.\" And he'd say take the -- so here's how you take the lumps out, to them. We can't give you -- we have our prisoners back, right? They're back. OK? Now we say, \"We can't give you the 150 billion. We got no money. We owe $19 trillion. I want to give it to you so badly, we can't.\" And our people, approved by our Republicans, Repub -- two trillion on top of the 19 trillion. So -- and this happened two weeks ago, folks. This happened two weeks ago. You all know about it. So you say to them, \"We can't give you the $150 billion because we're a bust nation. We don't have the money.\" They're going to go nuts, but they'll be fine. They're going to be angry for about an hour. They're going to stop. You know, they're great negotiators. The Persians are great negotiator. So they're going to stop and we'll probably have to leave for a couple of days, again, come back, and then you start the negotiation. So now we have our prisoners back, we don't give them the money. And now we're talking turkey, right? I mean, now what -- and I would have never, obviously, gave them self-inspection rights. You ever hear that? They self-inspect. A place that's the worst of all. They didn't want us going there. So there they have the right to self-inspect. In other words, you call them up. \"Listen, we hear you're building nuclear weapons in that location. Could you please check and call us back.\" Next day, we get a phone call. Mr. President, we've checked the area. There is no activity going on. Give me a break. Why? How can this happen to us? And then on top of it, we have 10 young beautiful sailors. Their engine should have been fixed and go back and wave, right? Both sides, you know, wave. They get brought to land. They get put in a begging position. Raise your hands. And I heard the tone of that guy talking, and you did too. That was a nasty guy. That was a nasty guy. Hold your hands up. And this is -- and by the way, two days later, they got the 150 billion. And if they weren't getting it two days later, those sailors still wouldn't be back. They might never be back. They'll be back if I get to be President. But they may never be back. So here's the story. We have a chance to do something historic. Look at the cover of Time magazine this week. It's the most incredible story because it talks about -- they actually show the back of my head, it's almost like this picture. And I checked, no bald spot. I was very happy. It's true. But -- but it's like this beautiful story. It's written by an amazing writer, because the press is largely dishonest. I mean, they're the most dishonest human beings. They're the worst. 75% of them are worst. Honestly, you have 25 that are fine, you have 10 that are fantastic people. But a lot of these guys -- look at all the cameras back there. A lot of these people are totally dishonest people. Cover of Time magazine, the story was so fair. They said we've created a movement. We have a movement. We had 35,000 people in Mobile, Alabama. We had 20,000 people at the Dallas Mavericks arena, Dallas. We had 20,000 people in Oklahoma, twice. No matter where we go, we have the biggest crowds. By the way, we have the biggest crowds by far over Bernie. He is second, I will say. He beats the other Republicans and he beats the Democrats by a lot. But we have a movement like there's never -- there's never been. I mean, they're writing things that are amazing. And they call me and they say, \"It doesn't matter.\" One of the great writers called me, said, \"How does it feel?\" I said, \"How's what feel?\" \"You have done something that's never been done before. It's the summer of Trump.\" This was three months ago, and now it's the autumn of Trump. And he said, \"You've never been --\" I said, \"Yeah, but it doesn't mean anything unless I win.\" And I don't mean win the nomination, I mean win win, so we can change this place and put it back like it's supposed to be like our founders had in mind. They said, \"How does it feel?\" We have to do it. And I said that it doesn't feel like anything. He said, \"No, no. It doesn't matter if you win or lose, what you've done is something that's never been done before in this country. Politically, it's never been done. It's amazing. And it doesn't matter whether or not you win.\" I said to him, \"Listen, I really appreciate it.\" And he's a highly respected guy and a great guy. I said, \"I really appreciate it, but unless I win, I would consider it a big, fat, beautiful, and by the way, very expensive waste of time.\" I really believe that. It's just a waste of time. So you have to get out in caucus. You have to get out there. I don't care what happens. You know, I joke and I kid and we have fun, and they always take it seriously. Did you hear what he said? Wasn't that terrible? Did you hear? I joke, I say, if your wife leaves you for another man, if you leave your wife because you don't like her, I don't care what it is. If you're sick, if, you know, you've got to get out. If you don't get out, we're wasting time just like I told the reporter, \"You're wasting time.\" We have a chance to do something so historic. And the people, wherever I go, Florida, I have 48% in the poll. The sitting governor -- the s -- I -- I mean, you have no idea. We have a senator who is a nice guy, Marco Rubio, but he's -- he's at 11. And you have Jeb Bush, who is there for eight years, and he's like at four or five. And I'm at 48. We have a chance -- no, think of it, that's 48%. And that was taken -- I guess we had about 15 or 16, that was taken a month ago or so, we had like 15 or 16 candidates. Now, a couple have left, and a couple of more are going to leave after Monday, and then you going to have a couple of more leave after New Hampshire where we have a tremendous lead also. But if we can win here, if we win in Iowa, everyone's talking about it, we can run the table for the first time ever. We can run the table. It's so important. And I have to tell you, because I've gotten to love Iowa. I have so many friends here. I'm here a lot. I love it. In fact, I'm thinking about buying a farm. Is your farm for sale? No, but -- but I love it. I love the people. I love the people. But you know what, I have to say this, don't be insulted. You haven't had a winner in 16 years. You pick people. I mean, what are you doing? You haven't had a winner in 16 years. If you pick me, I'm leading every single state, including this one. But this is the closest of all of them. This is the closest. I've -- a poll came out yesterday, there's something, I'm leading only by five points. I'm not used to five points. I like South Carolina where I'm leading by 22 points. I like -- I like South Carolina where I was at 39 and Lindsey Graham, the sitting Senator, was at one. He was at one, and he's the sitting Senator. I like New Hampshire where I have a 21 point lead. I don't like this five points, if you got to get out. I promise you this. We're all going to do it together. It's a we, not an I. We will make this country so strong. And, you know, some people don't like when I say it. But you have to say it. A woman came up to me, she said, \"Mr. Trump, it doesn't sound nice.\" I said, \"We're going to make the country strong, rich.\" Didn't like the word rich. I said, \"We are going to make our country rich again and then great again.\" And she said it doesn't sound good. I said, \"Let me tell you something. We can't be great unless we're going to be rich again. We're a poor nation. We're debtor nation.\" So we're going to make our country rich again. We're going to make our country powerful and strong again. And we're going to make our country respected again. And the bottom line is, we are going to make our country great again. OK? So -- so get out on Monday, caucus. The storm won't be until Tuesday, I hope, because they say, all of these people on television I'm watching, they're saying if a lot of people come, and they think it could be a record forever. They think if a lot of people come, Trump wins by a lot. If they don't come, I won't win. I won't win. And if I don't win, maybe bad things happen. Who knows what happens? You know, they talk about the cascading effect. Don't we all like winning? We've got to win, OK? So look, get out on Monday caucus. I think the storm's going to be on Tuesday, I hope. But -- and -- and you know what, supposing it's on Monday, so you go through some snow, OK? You're -- you're from Iowa. Are you afraid of snow? Are you afraid of snow? But I don't think it's going to be, it's going to be like Tuesday morning and that's what they tell me, like the geniuses in the weather bureau, you know, which always get it wrong. That's the problem. So look, I love you, folks. I love this country so much. I'm doing this -- I'm doing this -- people say, \"Why do you do this? It's so hard and so much work. It's a --\" I could be someplace else right now. You know that, right? I'm doing it because we have such potential in this country. We have such unbelievable people in this country. I love you all, go out and caucus. Let's have a big, beautiful victory on Monday night. Thank you."}