{"id":464,"author":"Donald Trump","title":"Speech: Donald Trump in Lexington, SC","date":"2016-01-27","link":"https://factba.se/transcript/donald-trump-speech-lexington-sc-january-27-2016","paragraphs":["Thank you. You know you have thousands of people outside. It's crazy. It's crazy. It's -- it's been like this no matter where we go. It's packed and they're going to have, I guess, they have 4,000 people outside that are not coming in. We could have maybe gotten a bigger barn, as they said, we're a hat. They said to me, wear a hat tonight because we're in a barn.","But there's a pretty nice barn, a friendly barn, that's for sure, right? So I just want to thank everybody. I'll tell you what South Carolina has been with me from the beginning. Whenever I needed -- see I love, I love those polls, you know, those polls, I love. But whenever I needed a little solace, when I thought maybe some of the polls weren't looking so good.","We come over here to South Carolina, it was always like a big, big margin which is killing everybody. It's like amazing, amazing people. They're amazing people and it's an amazing state. I want to thank Henry, and I want to thank Peg, and I want to thank Henry Jr. because that is a great family, and to have your endorsement is so respected, and I really appreciate it. I mean, really pretty packed.","Thank you very much. I really appreciate it. So nice. Well, we're going to get it done. You know I sometimes start off but we have to start off a little differently. Do you know why? It's getting to be crunch time. We've got to do it. We're led by people that don't know what they're doing. We have no idea.","It's embarrassing. This is like embarrassing all the time. You know, I say, we don't win anymore. We don't win. We never win. When was the last time we had a win? We don't win anymore ever, ever. Even remember our sailors, two weeks ago. So what did we do wrong? We did nothing. We did nothing. So they go a little of course.","Probably shouldn't have been there but who cares, right? And these guys are in a begging position, 10 people, 10 people, one woman, nine men in a begging position with their hands up high and guns to their head, and we made a deal with these people. We made a deal. We made a deal where we're giving them $150 billion.","Think of it. You know the hardest part about taking over that deal because they've got to take over deals, I love to take over bad deals, you buy bad deals, you buy them cheap. Some of the guys, we can, we really do. We have some great business people in this audience. I know about four of them.","They're killers, OK. I know them. They don't look like much, you know, they come in with the T-shirt. I know one of them is a total killer. I said You look like hell but the mind is still good. It's part of this. But we have great business people here and when you look at the kind of deals that we make in the United States, it's like, what are we doing?","What are we doing? And we can't keep doing it. It can't happen. So we're going to change things but it's now getting to be that time. Very soon you're going to get the chance to vote and you know the polls. Thank you, darling. I appreciate it. Where is she? She's one stuck in the corner back there.","It's an amazing thing. No, it's amazing. You know in Dallas we had 20,000 -- 21,000 people. In Mobile, Alabama with 35,000 people. Every place we go, every place we go, I would have loved -- it's so nice outside. Let's just go outside and do this, right? I don't know. My only problem is these guys, the Secret Service guys, my -- love it and I love it. I love it. But we're going to do things and the key is we have to mobilize.","We have to get out and vote. And every poll shows us so good. Every poll says it's going to happen. And I'll tell you what, once we get there, we're going to beat Hillary. Hillary is not going to be hard to beat. She's not going to be hard to beat. I mean, I assume it's Hillary. I assume. I assume because I don't know.","I don't know, is she going to be in the clinker? Is she going to be -- I don't know. I don't know. I mean, General Petraeus, they ruined his life. They ruined his life over like 2% of what she did. General Petraeus, so many others, and it looks like, boy, she's being so nice to Obama. I mean, so nice. He's great.","He's one -- I wonder why. Can anyone figure that out? It's something, it's something that's going to happen but we're going to be -- you know in the polls, the most recent polls we beat Hillary every time and beat her pretty easily. Are they OK? Somebody went down, OK. You just help her out.","Good. Oh, I love you. We love her. Look at that. Thank you, honey. We love you. We love, do we love our people? We love our people. There's a woman, she waited eight hours to be in the front row and she faints. We got to bring her back, right?","Maybe she faked it at how good looking I am. I don't know. Who the hell knows, right? But she's OK? She's OK, right? OK. Good. If she's not OK I'm not going to be too happy. So we got to get out. We got to vote and here's what we're going to do. When I started on June 16th, I made an announcement, the famous escalator ride and it's so hard.","I mean honestly, it's hard. It takes guts, like, I love our police. By the way, do we love our police? We love them. We love them. They're all over. They're the greatest people. And it's hard, it's hard to do that, it's hard to do this. I've never done it before. I've never been a politician before and on June 16th, I went down the escalator.","The famous escalator ride with Melania and I said got to do it, too many things were happening, too many bad things. You look at our trade deals, and in the case of farmers, by the way, how badly are you being treated with the regulations? The farmers in this place and the farmers all over the country are being treated almost as bad as our vets which are being treated like the worst, you know the vets are being treated like the worst, right?","No, we're going to change it. You know the vets, by the way, the vets you have a case that just came out where they're waiting for five and six days to see a doctor. At the end of the five or six days sometimes the doctor leaves because he's going on vacation. I mean, things happen and these people are dying and they're dying by the thousands.","I didn't even realize it. They're dying by the thousands and they're, in the true sense, they're our greatest people. The Wounded Warriors, the vets, everybody says, we have illegal immigrants that are taken care of better than our vets. It's not going to happen. It's not going to happen. So I made the journey down the stairs and down the escalator, and it looked like they were having the Academy Awards in Trump Tower, I've never seen so many cameras.","But look over here, look at -- look back there, look. Look at that. That's a lot of cameras, right? I mean that is a lot of cameras but -- and especially tonight because, you know, from here, from here, where do I go? What am I going to do there? Who the hell knows. We're going to raise -- you know what we're going to do? We're going to raise a lot of money for the vets.","That's what we're going to do. We're going to raise a lot of money. I'm going to Iowa today. We just came back. I was there yesterday, I was there last night. We just came back and it's an amazing state, and it's a very interesting state because the whole caucus system is so different. And it really is, it's an amazing state with amazing people.","I think we're going to do really well there. Then we go to New Hampshire where we're leading very big, almost like here in terms of the lead is tremendous. We have like a 20-point lead and then we come here and, you know, we could do well in Iowa. I really think we can run the table. Now if we can't, I think we're going to win New Hampshire, but I think we're going to run the table.","If we can -- if we can win Iowa, we're doing great with the Evangelicals, with everybody, with the Tea Party, and I think it's going to be something -- I think is going to be a great experience because what we have going, and it's really important, it's a movement. It's not like a normal situation. We're on the cover and I say we because it's we, I'm like a messenger, it doesn't mean anything.","It's we, we are on the cover of Time Magazine, and if you read that story, it's the most incredible story about what's happened. And they used to call it the silent majority. Now they're calling it the noisy majority. We're fed, we're fed up, we're just fed up with what's going on. Oh, look let me see that magazine.","Let me see. You -- bring that up here. Bring that up. I love this magazine. I never liked Time Magazine much until they started writing good about me, right? Right? No, you got to get -- this story is so kind of because look it's me speaking to lots of people, thousands of people, and everybody's in love with our country.","They're so disappointed. Thank you, baby. So we're going to start doing things and lots of -- lots of things have happened, lots of things have happened, and now I have competition. We started off with 17 people, right? Am I allowed to talk about the competition? Nobody cares, right? I can say a bad thing, first of all, Hillary is going to be easy.","Bernie, oh, poor Bernie. Oh my God. Oh that's, that's like a dream. That's a dream. That's a dream. Well, I don't know who is going to happen and maybe it's Biden. You know they're talking about Biden coming back. Who cares? It doesn't matter. It doesn't matter. But we have competition. We have people that were born in Canada.","It's true. We have We have guys like Rand Paul, the cand -- he's a United States Senator, he can't even get on the stage. He goes I should be on the stage. I should be -- we have all these people. Jeb Bush spent over a hundred -- think of it over $100 million and he's nowhere.","He's nowhere and he spent a lot on me. The only reason I mentioned his name -- it's so much, tens of millions of dollars, every time I turn there's an ad about me and then I go up in the poll. There's something wrong with these ads because I keep going up in the poll. No, he spends -- think of it. Think of it. He spends $100 million, he's got $128 million that he raised, do you know who's putting it up? Donors, lobbyists, special interests, and they go to Jeb, and they go to Hillary, and they go to all of them.","They go to Ted Cruz. He's putting -- got a lot of oil money put up and the banks, you know, the loans and all this stuff, right? The loans, the birthplace, there's a whole mess there, there's a big mess going on with Ted. I mean, and his polls, the sinking, he's sinking like a rock, and he's nervous as hell.","I watched him tonight but he's hitting me because he thinks that maybe I was not treated fairly. You know that, right? Does everyone agree with that? And you know in life because when I fight for you, I'm fighting the same way. You have to be treated fairly. That's why if we would have walked away from the Iran deal, as an example, when they said we want this, we want that.","If we would have walked away, for instance, our prisoners should have been back here three or four years ago when they were first made prisoners. Not this stuff. This is baby stuff and we should have walked in and said we want our prisoners before we can start, right? Call them hostages but we want our prisoners before we start.","If you don't give them we're not doing it. They're going to say no and we walk out. We leave, right? You just leave that's what you do, you leave. And then you double up the sanctions and they'll call up within 48 hours, and they'll say, we will absolutely -- we'd love to give you your prisoners and they'll give them.","And then you go back in the second time, and you say listen, you know that $150 billion, we have a problem, we owe $19 trillion, we don't have any money because it's nice to be -- my father used to say take the lumps out rather than saying, no, you can't have it. You know a stupid person goes, no, you cannot have it. You don't have to. You have to. Just say, hey, we don't have any money.","It's no good. We have no money. We can't give you $150 billion, $150 billion. Do you see where they're spending all the money in Europe? They're spending it. They're giving it to Russia but they're going all over Europe. They ordered 114 planes, Airbus planes made in Europe, not Boeings, not Boeings, and did you see Kerry the other night?","Our great secretary, right? Secretary of State, he said, he said, no. Well, we would expect some money to be spent, some of the money to be spent on terror. Everyone said what? He just -- did he just say -- in other words, they expected. We haven't seen it yet but it'll happen probably. Can you believe this?","Here we are, we gave $150 billion, did anybody see that? Where he was, he was talking about the money. They expect some of that money will go to terror. And I say to myself, what are we doing? Why are we doing it? And what the hell are we doing? We need great people in our country. We have the greatest negotiators in the world.","We have the greatest business people in the world. We have to get with it folks or we're not going to have a country left. We're not going to have a country left. So I've been saying about the Iran deal. I love talking about the Iran deal because it's impossible to believe. First of all, it's so simple to understand.","They have a 24-day period, so if they -- we think they're building nukes in a certain place, 24 it is. What people don't tell you is they have a lot of time before the 24 days kicks in, think of it, 24 days. Why can't you like go in and say let me, let me take a look, right? Why do you need 24 days? But the 24 days could be months and months because there's a whole process before you start, before the clock starts ticking, right?","So we have that. Then we have an area where they self-inspect. We think you're building nuclear weapons over there. Could you please tell us. Oh, yes we will. Well, self -- call up the next day. No, no, no problem. We're not building it. It's -- isn't that ridiculous? I mean, is it, is it just ridiculous?","So you look at that, you see that, and it's going on all over the place. Now they take $150 billion. They start buying missiles from Russia. Do you believe it? Missiles. Frankly, the 24 days doesn't mean anything, self-inspection does it mean -- because the hell do they have to worry about nuclear? With the money they have, they can just buy it. They're going to buy it. And you're going to have nuclear proliferation and we didn't know, and by the way, for those people, I happen to be one of them that feel strongly about Israel.","Israel is -- the worst thing that ever happened to Israel is Barack Obama. The worst thing that's ever happened. The worst. So we're going to -- I was endorsed by Carl Icahn, a great businessman, one of our great businessmen and so many others. In fact, they want to have press conferences, right? And unlike the Senator, nobody knows who they are.","Some of these guys they're great. They're brutal, brutal people. You would never want to go -- there. I'm looking at this young, beautiful, woman. You wouldn't want to have dinner with any of these people, believe me. Is that your father, huh? You don't want you -- believe me. These are not nice people. Who cares?","They're great negotiators. We have the greatest negotiators in the world. We have the greatest business people in the world. We're going to use them now. We're going to use them when we have deals with Japan and when we have deals with China. So China, we lose $500 billion a year in trade deficits, five $500 billion.","How can you do this? By the way, this has been going on forever. It goes on forever. What China -- and I love China. They treat me great. I'd make great deals with them. I do sell them apartments all the time. I have banks that are in my building. The biggest bank in the world is in one of my buildings, pays me a lot of rent.","They love the building. I can't believe they want to say it's got my name on it. I love to put my name on things I have to tell you. But they came in and I just extended their lease. And I'm rough on China, you know, I respect China. I'm not angry at China. I'm angry at our people because I wish our people would negotiate the same way.","Why should this be? But they come in the other day, the leases has to be extended. So they want to extend, they only want to be in my building. I say are you sure? You know I can't even believe it because who speaks tougher about China? Look, China and they know it, they understand it. They understand the truth, so, therefore, they don't mind.","China, it's the greatest theft in the history of the world what they've done to our country. It's true. They've taken our money. They've taken our jobs. They've taken our base. They've taken everything. They've taken so much, and again, it's our fault. It's not their fault they can get away with it. They talk about free trade.","All these guys say, well. Mr. Trump, you're not a free trader. I said, no, no, you don't understand something. When China puts it in here for nothing and when I have friends that cannot sell their product in China because number one, they charge him so much tax it's impossible to believe. They call it a tariff but they charge so much tax, impossible to believe.","When they do that, folks. It's not fair. It's not fair. We're being ripped off at every single level of government. And that's why we owe $19 trillion. And then we make a budget like we did two weeks ago. It's going to add another $2 trillion, right? You see that she's waving, she's agreeing with me. She's like really young and she even agrees but we can't do this.","So we're going to be at $21 trillion. We're going to make this country so strong, so great. Let's start talking about a couple of areas. We are going to create a border so powerful, right? So powerful. You know when I -- when I started this journey. It's a journey. It's actually a journey. But when I started this journey, I talked about -- we're going to build a wall.","Who's going to pay for the wall tell me? 100%. I will talk about that but when I started, you know, I gave a speech and I talked about illegal immigration. It was like the world fell in. Nobody was talking about illegal immigration. And then two or three weeks later everybody came back.","Everybody was sort of coming toward me. There was a, you know, maybe he's right. Then you had the killing of Kate in San Francisco by an illegal immigrant who came in five times, shot her in the back. Beautiful Kate. Great Kate and Jameel in Los Angeles and so many others. The female, the woman, person, this wonderful woman she was a veteran, raped, sodomized, and killed in Los Angeles about three months ago by an illegal immigrant.","And he shouldn't have been here. Would -- should have never been allowed to be here. So what we're going to do is we're going to have tremendous borders and we're going to build a wall. It's going to be a real wall. It's going to be a beautiful wall. It's going to be big, strong, nobody's coming through the wall.","The only way they're coming through is if they come through legally, OK? It's the only way. It's the only way or we're just, we're just not going to have a country. We're just not going to have a country. So I gave the speech and I talked about illegal immigration. I talked about Mexico. I talked about a lot of things that turned out to be all true.","And all of a sudden, everyone would say, oh, this is brutal. He's never going to -- he's going to fade very fast. Well, you know, up, up, up, up. Remember when the numbers started coming in? I started at three, I wasn't too happy. I started at three, then went to six, then went to 12, then it started just like -- it was like a rocket ship.","Yesterday, we had a poll 42, can you imagine? 42. Actually, I hate to say there's one state that is beating you, Florida, 448 in Florida, 48 to 11 to 12 and nine. I mean, we're at 48 in Florida which is a very, very important state for us. I mean, really, really important. So all of a sudden though, these poll numbers started coming in, then CNN with those, all those cameras back there, CNN does a poll, and they say who's best on ISIS?","Trump, by a lot. I don't mean by like even 48, I mean, like, more. Who's best in security? Who's best on the economy? Trump. I will be the greatest jobs President that God ever created and that is true. We need jobs. No, I mean, when I look -- look when I look at some of these -- Thank you, darling.","Oh, we're going to take care of women. Do we love women, right? See here, I could say, we respect women. We cherish women. We love women. And thank you, OK? Thank you. Thank you very much. I like this woman. She's fantastic -- it's called, it's called spirit but we are going and we are going to take care of women.","We are going -- you know, when you look at women's health issues, I saw where Jeb Bush was asked about it, and he said, no, no, we don't want to put money into that. I want to put money into that. We're going to put -- there's women's health issues that some people don't want to fund. You know that and we're to take care of everybody.","We're going to take care of everybody. But I'm doing well with women for a lot of reasons but one thing is they feel, they want security in the country, and everybody feels that I will give us the best security in the country and I will. I will. And we are going to build -- we are going to build our military so big and so strong and so powerful, right?","There's nobody, nobody, I mean, nobody is going to be taken advantage of us. And you know it's funny. So with Iraq, everyone said like, I remember when we had Hillary. She said I don't like his tone. They're chopping off heads in the Middle East and she's worried about my tone. I don't like his tone. It's not nice, OK? It's not nice.","And Jeb said the same thing, and they said it the same day, Jeb Bush didn't like my tone. Here's a guy wastes $100 million, right? And he doesn't like my tone. It's just crazy by the way. Speaking of Jeb, he's in favor of Common Core which is the worst thing you could be and he's very, very, very, think of this, weak on the border.","Remember they come in, people come in as an act of love. You can't have that. Whether he's a nice person or not, we don't need -- do we care if a person is nice? We don't need nice. We're tired of the nice ones, right? We've had plenty. We've had plenty -- we've had plenty of nice but I was thinking about it. So you have a guy like him who's spent over $100 million on a failed campaign, right?","Over $100 million, he's here, right? And his money is here, he's spent this much. Me, my campaign, I'm number one by a lot. And I haven't spent any money. I feel guilty. I -- you know, I spent a little money but very little. Relatively, like almost nothing. Now I'm going to start, right? Why am I going to start?","Because I feel guilty, right? And because I don't want to take any chances. I don't want to be cute. So I'm going to start. I'm %38 million under budget. I was going to have $38 million spent. Actually, like $44 million spent right up to this point. I spent like that and it's almost, like, how can you? Say you go on television, like tonight, I did O'Reilly, Bill O'Reilly.","Good guy, right? In fact, when you go home, you'll see the second Bill O'Reilly. The one that comes on whatever the hell time like in 11:00 but he's a good guy. It was a tough interview. I have to tell you. It was an interesting interview but you'll see it when you go home. But when you think, so you have somebody who spends money and he's here.","Think about this, our education, we have the Common Core, it's not working. We spend more than any country in the world on education, any country in the world by far. It's not even close. It's like we're here and the second -- second country is off the charts. Your best countries are Norway, Sweden, China, in terms of education, right?","They're number one, two, three. We're number 28, so we spend the most, and we have like one of the worst results. We have third-world countries that do better than us, third-world countries. Wouldn't it be nice if it was like my campaign where we spend the least and we have the best, isn't that -- wouldn't that be nice?","It's what we have to do. We can do that. That's what we have to do. All right. So, I'm running against these people, and you know again, some are very nice people. I once -- I refused to say badly about, you know, bad about some of them. I just refuse. I can't do it. Nah, OK, so I will. By the way, we got the endorsement of Sarah Palin.","You saw that, right? Right? Do we love Falwell? Do we love Jerry? Do we love Falwell? One of the great people. Let me tell you what he's done at Liberty University, and the beautiful thing about Liberty University, virtually every candidate has gone to Liberty University, made a speech, have the most beautiful campus you've ever seen.","Everybody goes down. It's an incredible school and Jerry Falwell, Jr. came up and he chose us. We got a call, as you know, three or four days ago, and he announced, and he's endorsing Trump. It tells you so much because everybody goes there. Everybody wants to go there. Everybody does go there. It tells you so much.","Sarah Palin tells you so much. We got an endorsement from Sheriff Joe. Does everybody know? OK? How tough is -- I mean, this is a man. This is no games with Sheriff Joe. He likes our border position. When he says good that means I have the best border position. Let's face it, right? But we have certain people that we have to beat and we have to beat to get there.","But a couple of reasons and a couple of things a lot of people don't even know. I'm self-funding my campaign. I'm not getting money from all these people. So, so very importantly, I'm not get -- I'm putting up and you know what I get offered millions and millions and millions of dollars. I feel so foolish not taking it, my whole life I've taken money, right?","I've taken -- I want. I want. You're like greedy. I want more. I want more. Now I do but I want it for the United States. We're going to take in money. We're going to take in money. We're going to take it. We're going to take it in. We're going to bring it in. But I have these candidates and they say all sorts of things and a bunch of it. And some of it's right.","I mean frankly, some of it's right. One of them, Ted Cruz is talking about eminent domain. Donald Trump is in favor of eminent domain. And Ted is a good debater but he's not a good speaker. Do you know what I mean? When you talk to him it's like you're in a debate. Hello, Donald, how are you? Woah, no, no, he's a good debater.","I like him. Although who the hell won the last debate? Did Trump win it? Actually, can you believe we've already had six debates? Can you believe how -- when I did this, I never debated before. I create jobs. I do deals. I do buildings. I do stuff all over the world. I never debated. So I get on the stage like a number of months ago for the first debate.","I had no idea. It worked out fine. I got a very unfair question from somebody but we don't even talk about that. We don't talk about that. I refuse to, I refuse, I refuse to talk about that. But, but every single poll, you know, they have data. They have everything. They have polls for everything but every they have these debating polls and everything.","I think just about at least. I have to say just because if it's like one out of 60, then, I'll have a headline tomorrow, Donald Trump exaggerated. But virtually, every single poll, Time Magazine, Drudge is a phenomenal guy, by the way, all of these different polls slate. They came out and Trump won the debates every -- every debate.","I mean, every debate right from the beginning which is great. And then the last debate where they talked about New York values and New York City values and it was a terrible thing frankly, because I was there and I saw what people went through, and I saw the death, and I saw the destruction. And I'll tell you what, everybody loved New Yorkers.","New Yorkers are actually very good people and they have a lot of energy. They have a lot of energy, high energy, as opposed to Jeb. They have high -- they have -- thank you, man. They have high energy but -- so we went in and we have the debates. But they talked about eminent domain that Donald Trump loves eminent domain.","I don't love anything. I mean, eminent domain. Here's the story, they take your property because you have to build a highway. They take a piece of it. They might take a corner of it. They might take more of it. They might take less of it but eminent domain is a taking. Now when they take your property they pay you a fortune.","If you're smart because they pay you fair market value for your property. But if you didn't have eminent domain, you, and did you see these characters? You stupid 22 people. They wrote these things from this dying magazine, it's called the National Review. I think it's dead as a doornail. No, no, instead they said we are conservatives and somebody said Donald Trump is not a true conservative.","I'm trying to say what's wrong with these people? They're so out of it. So they talk about eminent domain. So without eminent domain, you don't have roadways, you don't have railroads, you don't have hospitals, you don't have schools, you don't have anything. So they say he loves eminent -- I don't love it. You need it. You've got to build a road.","You've got to build a highway. You've got to build a railroad. Excuse me, all these people like the Keystone Pipeline, right? They all like the Keystone pipeline. You wouldn't get 10 feet of the Keystone pipeline without eminent domain. And yet they take ads, Donald Trump likes eminent domain, and this is what I go through.","Then we have an I told -- I said to Ted, Ted, you have a problem. Ted Cruz was born in a place called Canada. Has anyone ever heard of Canada, right? He was born in Canada. It's a big problem. Laurence Tribe, a great Constitutional Law from Harvard said it's a problem. It's, you know, unsettled law, called it unsettled law, meaning there's a big doubt.","So you have many lawyers coming up saying it's unsettled law, meaning who knows? Now the Democrats have already started a suit but they're going to start a major suit if he ever got the nomination. So how can a guy run for office when he's got this cloud over his head? You know on real estate, they call it, you know what it is, it's called a cloud on title, right?","It's got a cloud. It's a cloud on title. He's got a cloud on title. It's called he was born in Canada. He was a citizen of Canada until 15 months ago. Now he said he didn't know that. He didn't know. Smart guy. He didn't know he -- didn't know he was a citizen of Canada. Here's a guy who is a United States Senator from Texas.","He was a citizen of Canada and he didn't know. So he's got a problem. Then another couple of constitutional lawyers just yesterday came out, and they said, no, no, it's not just, you know, unsettled. It is unsettled. You're not allowed to do it. You saw that they came down. They're not allowed to do it. Now here's the thing.","Nobody in this room knows whether you can do it or you can't do it. But it will take years to figure out in court. And I said go for what's called a declaratory judgment. You go into the court you ask the court for a ruling because it's unsettled law. You ask the court for a ruling. But how can a guy, and he's sort of in second place, and he's way, way behind frankly, which I'm very happy about?","But how does a guy run and then be very critical? He's always critical. How does the guy run -- but of course everybody's critical. I mean, today I heard a couple of people say such nasty things about me. These are nasty -- these politicians, you know, they're all talk, no action but they are nasty people.","They're terrible. But you say to yourself, how does a guy run for the office of President when there is a very major possibility that he's not allowed to do it? It's a real problem so you got to go and find out. And it has had an impact because I think 36% of the people consider it to be unsettled law, and many of them considered to be much more than unsettled law, and you have to be able to do it. And I don't like bringing it up. So I won't bring it up, OK? Is that all right?","I'm not going to bring it up but it's a problem, OK? It's a problem. Then in the case also of Ted, you do a personal financial disclosure form, and you have to sign it, and you're sort of signing your life away. Now he borrowed a lot of money, as you know, from Goldman Sachs and from Citibank. You got to -- you have to say that because he wants to be Robin Hood, he wants to convince everybody that he's the most honorable guy in the world, and he's going to fight for you, and those banks aren't going to do anything.","And they're not going to -- we are -- we have the banks totally under control. So we didn't put their banks down. So now it finds out that he had $1 million at very favorable rates from Citibank and from Goldman Sachs, Goldman Sachs, OK? You got to have a problem there, folks. I mean we have a problem. So the nice part about me is that I don't have any of that stuff.","I don't have it. I'm putting up my own. I'm not -- I'm not into Goldman Sachs. I don't care about Goldman Sachs. I built a great company, very important, when I ran, a lot of people said I'll never run, right? All these pundits, these geniuses, these people back there, morons, you're morons, OK? No, they're morons.","The pundits. Look at these -- they are the worst. They are the -- I think knowingly, too. I think they're probably not actually as dumb as we think. I think they knowingly just say the wrong thing. But you know what happens. Do you know what happens? It's sort of interesting. They said Donald Trump will never run.","He will never run. Don't worry about it. Well, then I ran. I announced. He said oh, he announced. So you know like George Bush has got the little spectacles, right? Those little tiny -- and he looks like a genius because of the spectacles. But if you took the spectacles off this guy, he wouldn't, he'd look like a dummy, OK? Which is what he is. So anyway, so Donald Trump will never run.","Then I ran. Then he said, well, he'll never sign for me. That's when you sign your life away, right? You signed, you know, your name. Your life is like over. It's like brutal. So you sign your life away, right? I signed for me. Then he said he'll never ever show his corporate papers or show all of his papers because maybe he's not as rich as everybody thinks.","So I put him in and then they said and he'll never do it fast. The worst is he'll take forever. You know, you get all these extensions in government. You need 45 days, another 45 days, you could extend forever. I said to my accountants and I paid them a lot of money. Who is our largest thing ever put into the federal elections by far, almost 100 pages?","I said to my people, I want to get it in early. I don't want any extensions. Just get it done. These guys work 24 hours a day, did a great job. They put it in the press. They were like, like you have -- you have got scavengers. You never saw anything like it. They were waiting, they were going to find, oh, Trump is not as rich as we thought.","We hope he's -- and then they find out, wow, I built a great company. In fact, what they don't know is if I decide -- because I was really undecided. Even if I wasn't going to run, I was going to submit my financials, OK? Can you believe it? Because I wanted to brag about the company I built. I'm a private company.","So I built it. I built a great company and it's got some of the great assets in the world. You know, Miami Beach, Doral Country Club, and so many other, Turnberry in Scotland on the ocean, 800 acres on the ocean. And all of these companies is a great, great buildings, they're great jobs, and I have many other businesses.","In addition to writing the art of the deal, many books, in addition to The Apprentice, which is one of the most successful shows on television, and by the way, NBC wanted to renew and I said can't do it. I mean, I can't do it because you're not allowed to do that if you run for -- you know the whole thing.","It's a little complicated. So we chose Arnold Schwarzenegger. How will Arnold do by the way? How do you think -- who's going to be better Arnold or Trump? Yeah, I think so. You've got to be very quick to do that show. When you have Omarosa and these people you've got to be very quick.","You cannot be slow-moving. You've got to move, your lips have to move, the mouth has to move, the body has to move. So it'll be interesting to see but I hope he does well because I have a big chunk of it. So we'll see. You remember Martha did it, right? Right? Remember that? Didn't work out so well. Fire Obama, President Obama?","No, I want to save it. Let me save it for something. We'll all do it together. We have to save that for the big leagues, right? We have to save there. We're going to be together. We're going to have some of the 4,000 -- 5,000 people outside. We got to get them together for that one. Don't we agree? I mean, these poor people they're standing out there.","They probably think they're getting in. They're not getting in. I'm going to be out of here. You're going to be out of here. They're going to be still standing. So anyway, so things are going to happen with our country. What did happen though, I talk about the border. I talk about trade. I talk about China.","I talk about Mexico. How Mexico is just killing us and they're good people. I have thousands of Mexicans and Hispanics that work for me. I'm winning the polls with Hispanics in Nevada. They just had a Hispanic poll I'm winning which I always said I would. I'm doing unbelievably with African-Americans in the polls.","With the African-Americans, we had won 25%, Republicans get 7% and 6%. Somebody said if he actually got 25% of the African-American vote, the election's over. It's over. So we're going to do great. We're going to do great. And you know why? Because I bring back jobs. We're going to bring jobs back from China.","We're bringing jobs back from Japan. We're bringing it back from Mexico. We're not going to let things happen like, as an example, Pfizer is moving to Ireland. This big massive drug company, moving to Ireland because of taxes and other reasons and they can't bring their money back, corporate inversions. So, we're going to do so many things.","You're going to be so happy. You're going to be so proud. So let me just leave it on this. Look, it is an unbelievable honor to have done what I've done. People are calling, even people that can't stand me, like some of them. But one, in particular, is a highly respected writer said nobody's ever done what we've done.","What we've done. Nobody's ever -- we've totally changed the dialogue of politics. That's why the cover of Time Magazine, nobody's ever done it. We are going to do something that's going to be so special. This is a movement that is so special. We are going to win in so many different aspects. We don't win now.","We don't win anymore. We're going to start winning so much. We're going to win on trade. We're going to win with the military. I mean, can you imagine? We have a military that can't beat ISIS, OK? Now ISIS they say are 30,000 people. Can you imagine General Douglas MacArthur saying, well, we can't do it? And I see these people.","They're on talk shows. The military people saying how tough ISIS is. General George Patton, I mean, he would be -- he would get them before he got over to the talk show. But he doesn't do talk shows, OK? We will beat -- we will have our military great. We're going to take care of our vets so well. We're going to take care of, we have to take care of our vets.","We have to take care of our vets. We're going to repeal and replace Obamacare which is a total, total disaster. We're repealing and replacing Obamacare. You know, I don't know if you see. I mean, I know you see, otherwise, you wouldn't have just gone crazy like that. Your premiums have gone up 25%, 35%, 45%. Your deductibles are worse than your premiums.","You never get to use it. You have to die to use it. Your -- your -- the Obamacare is a disaster. It's going to die of its own weight because in '17 unless the Republicans give them more money and keep extending, the Republicans are making it possible. You know look, we know where the Democrats are coming from, OK? We understand that.","The problem we have is these Republicans that we send to Congress and their hardline. We're going to stop Obamacare. We're going to fight ISIS. There are all these hard -- then all of a sudden, they get to Washington. They look at the angels and the ceiling, they look at the beautiful columns, they look at the beautiful marble floors, and they just keep raising their hand.","What happened to them? That's not going to happen to me. It's not going to happen to me. Not going to happen. So I leave you with this, very soon, it's going to be happening. You know on February 1st you start off. You know who we start with, right? Iowa. Unbelievable people, unbelievable place. I think we're going to do great there.","We start with Iowa. We go over to New Hampshire and then guess what we are? We're here. And for that period of a week and a half, I'm going to be here so much. You're going to be so sick of me. I'm going to be here. We don't want to take it. You're going to say get the hell out of here Trump we can't stand you anymore.","But let me just tell you something, we're going to win and then we're going to beat Hillary or whoever the hell they put in front of us. We're going to beat it because nobody's got this going. And folks, I started off by saying, we don't win anymore. We are going to start winning. We're going to win with the military, right?","We're going to win at the borders. We're going to win with trade. We're going to win with healthcare and Obamacare is going to be gone, but we're going to win with healthcare. We're going to win so much. You're going to be so proud of your President. You're going to be so proud of your country. I love the people of South Carolina from day one. I've loved them. We will be back a lot. Take care of yourself. Make sure you vote."],"text":" Thank you. You know you have thousands of people outside. It's crazy. It's crazy. It's -- it's been like this no matter where we go. It's packed and they're going to have, I guess, they have 4,000 people outside that are not coming in. We could have maybe gotten a bigger barn, as they said, we're a hat. They said to me, wear a hat tonight because we're in a barn. But there's a pretty nice barn, a friendly barn, that's for sure, right? So I just want to thank everybody. I'll tell you what South Carolina has been with me from the beginning. Whenever I needed -- see I love, I love those polls, you know, those polls, I love. But whenever I needed a little solace, when I thought maybe some of the polls weren't looking so good. We come over here to South Carolina, it was always like a big, big margin which is killing everybody. It's like amazing, amazing people. They're amazing people and it's an amazing state. I want to thank Henry, and I want to thank Peg, and I want to thank Henry Jr. because that is a great family, and to have your endorsement is so respected, and I really appreciate it. I mean, really pretty packed. Thank you very much. I really appreciate it. So nice. Well, we're going to get it done. You know I sometimes start off but we have to start off a little differently. Do you know why? It's getting to be crunch time. We've got to do it. We're led by people that don't know what they're doing. We have no idea. It's embarrassing. This is like embarrassing all the time. You know, I say, we don't win anymore. We don't win. We never win. When was the last time we had a win? We don't win anymore ever, ever. Even remember our sailors, two weeks ago. So what did we do wrong? We did nothing. We did nothing. So they go a little of course. Probably shouldn't have been there but who cares, right? And these guys are in a begging position, 10 people, 10 people, one woman, nine men in a begging position with their hands up high and guns to their head, and we made a deal with these people. We made a deal. We made a deal where we're giving them $150 billion. Think of it. You know the hardest part about taking over that deal because they've got to take over deals, I love to take over bad deals, you buy bad deals, you buy them cheap. Some of the guys, we can, we really do. We have some great business people in this audience. I know about four of them. They're killers, OK. I know them. They don't look like much, you know, they come in with the T-shirt. I know one of them is a total killer. I said You look like hell but the mind is still good. It's part of this. But we have great business people here and when you look at the kind of deals that we make in the United States, it's like, what are we doing? What are we doing? And we can't keep doing it. It can't happen. So we're going to change things but it's now getting to be that time. Very soon you're going to get the chance to vote and you know the polls. Thank you, darling. I appreciate it. Where is she? She's one stuck in the corner back there. It's an amazing thing. No, it's amazing. You know in Dallas we had 20,000 -- 21,000 people. In Mobile, Alabama with 35,000 people. Every place we go, every place we go, I would have loved -- it's so nice outside. Let's just go outside and do this, right? I don't know. My only problem is these guys, the Secret Service guys, my -- love it and I love it. I love it. But we're going to do things and the key is we have to mobilize. We have to get out and vote. And every poll shows us so good. Every poll says it's going to happen. And I'll tell you what, once we get there, we're going to beat Hillary. Hillary is not going to be hard to beat. She's not going to be hard to beat. I mean, I assume it's Hillary. I assume. I assume because I don't know. I don't know, is she going to be in the clinker? Is she going to be -- I don't know. I don't know. I mean, General Petraeus, they ruined his life. They ruined his life over like 2% of what she did. General Petraeus, so many others, and it looks like, boy, she's being so nice to Obama. I mean, so nice. He's great. He's one -- I wonder why. Can anyone figure that out? It's something, it's something that's going to happen but we're going to be -- you know in the polls, the most recent polls we beat Hillary every time and beat her pretty easily. Are they OK? Somebody went down, OK. You just help her out. Good. Oh, I love you. We love her. Look at that. Thank you, honey. We love you. We love, do we love our people? We love our people. There's a woman, she waited eight hours to be in the front row and she faints. We got to bring her back, right? Maybe she faked it at how good looking I am. I don't know. Who the hell knows, right? But she's OK? She's OK, right? OK. Good. If she's not OK I'm not going to be too happy. So we got to get out. We got to vote and here's what we're going to do. When I started on June 16th, I made an announcement, the famous escalator ride and it's so hard. I mean honestly, it's hard. It takes guts, like, I love our police. By the way, do we love our police? We love them. We love them. They're all over. They're the greatest people. And it's hard, it's hard to do that, it's hard to do this. I've never done it before. I've never been a politician before and on June 16th, I went down the escalator. The famous escalator ride with Melania and I said got to do it, too many things were happening, too many bad things. You look at our trade deals, and in the case of farmers, by the way, how badly are you being treated with the regulations? The farmers in this place and the farmers all over the country are being treated almost as bad as our vets which are being treated like the worst, you know the vets are being treated like the worst, right? No, we're going to change it. You know the vets, by the way, the vets you have a case that just came out where they're waiting for five and six days to see a doctor. At the end of the five or six days sometimes the doctor leaves because he's going on vacation. I mean, things happen and these people are dying and they're dying by the thousands. I didn't even realize it. They're dying by the thousands and they're, in the true sense, they're our greatest people. The Wounded Warriors, the vets, everybody says, we have illegal immigrants that are taken care of better than our vets. It's not going to happen. It's not going to happen. So I made the journey down the stairs and down the escalator, and it looked like they were having the Academy Awards in Trump Tower, I've never seen so many cameras. But look over here, look at -- look back there, look. Look at that. That's a lot of cameras, right? I mean that is a lot of cameras but -- and especially tonight because, you know, from here, from here, where do I go? What am I going to do there? Who the hell knows. We're going to raise -- you know what we're going to do? We're going to raise a lot of money for the vets. That's what we're going to do. We're going to raise a lot of money. I'm going to Iowa today. We just came back. I was there yesterday, I was there last night. We just came back and it's an amazing state, and it's a very interesting state because the whole caucus system is so different. And it really is, it's an amazing state with amazing people. I think we're going to do really well there. Then we go to New Hampshire where we're leading very big, almost like here in terms of the lead is tremendous. We have like a 20-point lead and then we come here and, you know, we could do well in Iowa. I really think we can run the table. Now if we can't, I think we're going to win New Hampshire, but I think we're going to run the table. If we can -- if we can win Iowa, we're doing great with the Evangelicals, with everybody, with the Tea Party, and I think it's going to be something -- I think is going to be a great experience because what we have going, and it's really important, it's a movement. It's not like a normal situation. We're on the cover and I say we because it's we, I'm like a messenger, it doesn't mean anything. It's we, we are on the cover of Time Magazine, and if you read that story, it's the most incredible story about what's happened. And they used to call it the silent majority. Now they're calling it the noisy majority. We're fed, we're fed up, we're just fed up with what's going on. Oh, look let me see that magazine. Let me see. You -- bring that up here. Bring that up. I love this magazine. I never liked Time Magazine much until they started writing good about me, right? Right? No, you got to get -- this story is so kind of because look it's me speaking to lots of people, thousands of people, and everybody's in love with our country. They're so disappointed. Thank you, baby. So we're going to start doing things and lots of -- lots of things have happened, lots of things have happened, and now I have competition. We started off with 17 people, right? Am I allowed to talk about the competition? Nobody cares, right? I can say a bad thing, first of all, Hillary is going to be easy. Bernie, oh, poor Bernie. Oh my God. Oh that's, that's like a dream. That's a dream. That's a dream. Well, I don't know who is going to happen and maybe it's Biden. You know they're talking about Biden coming back. Who cares? It doesn't matter. It doesn't matter. But we have competition. We have people that were born in Canada. It's true. We have We have guys like Rand Paul, the cand -- he's a United States Senator, he can't even get on the stage. He goes I should be on the stage. I should be -- we have all these people. Jeb Bush spent over a hundred -- think of it over $100 million and he's nowhere. He's nowhere and he spent a lot on me. The only reason I mentioned his name -- it's so much, tens of millions of dollars, every time I turn there's an ad about me and then I go up in the poll. There's something wrong with these ads because I keep going up in the poll. No, he spends -- think of it. Think of it. He spends $100 million, he's got $128 million that he raised, do you know who's putting it up? Donors, lobbyists, special interests, and they go to Jeb, and they go to Hillary, and they go to all of them. They go to Ted Cruz. He's putting -- got a lot of oil money put up and the banks, you know, the loans and all this stuff, right? The loans, the birthplace, there's a whole mess there, there's a big mess going on with Ted. I mean, and his polls, the sinking, he's sinking like a rock, and he's nervous as hell. I watched him tonight but he's hitting me because he thinks that maybe I was not treated fairly. You know that, right? Does everyone agree with that? And you know in life because when I fight for you, I'm fighting the same way. You have to be treated fairly. That's why if we would have walked away from the Iran deal, as an example, when they said we want this, we want that. If we would have walked away, for instance, our prisoners should have been back here three or four years ago when they were first made prisoners. Not this stuff. This is baby stuff and we should have walked in and said we want our prisoners before we can start, right? Call them hostages but we want our prisoners before we start. If you don't give them we're not doing it. They're going to say no and we walk out. We leave, right? You just leave that's what you do, you leave. And then you double up the sanctions and they'll call up within 48 hours, and they'll say, we will absolutely -- we'd love to give you your prisoners and they'll give them. And then you go back in the second time, and you say listen, you know that $150 billion, we have a problem, we owe $19 trillion, we don't have any money because it's nice to be -- my father used to say take the lumps out rather than saying, no, you can't have it. You know a stupid person goes, no, you cannot have it. You don't have to. You have to. Just say, hey, we don't have any money. It's no good. We have no money. We can't give you $150 billion, $150 billion. Do you see where they're spending all the money in Europe? They're spending it. They're giving it to Russia but they're going all over Europe. They ordered 114 planes, Airbus planes made in Europe, not Boeings, not Boeings, and did you see Kerry the other night? Our great secretary, right? Secretary of State, he said, he said, no. Well, we would expect some money to be spent, some of the money to be spent on terror. Everyone said what? He just -- did he just say -- in other words, they expected. We haven't seen it yet but it'll happen probably. Can you believe this? Here we are, we gave $150 billion, did anybody see that? Where he was, he was talking about the money. They expect some of that money will go to terror. And I say to myself, what are we doing? Why are we doing it? And what the hell are we doing? We need great people in our country. We have the greatest negotiators in the world. We have the greatest business people in the world. We have to get with it folks or we're not going to have a country left. We're not going to have a country left. So I've been saying about the Iran deal. I love talking about the Iran deal because it's impossible to believe. First of all, it's so simple to understand. They have a 24-day period, so if they -- we think they're building nukes in a certain place, 24 it is. What people don't tell you is they have a lot of time before the 24 days kicks in, think of it, 24 days. Why can't you like go in and say let me, let me take a look, right? Why do you need 24 days? But the 24 days could be months and months because there's a whole process before you start, before the clock starts ticking, right? So we have that. Then we have an area where they self-inspect. We think you're building nuclear weapons over there. Could you please tell us. Oh, yes we will. Well, self -- call up the next day. No, no, no problem. We're not building it. It's -- isn't that ridiculous? I mean, is it, is it just ridiculous? So you look at that, you see that, and it's going on all over the place. Now they take $150 billion. They start buying missiles from Russia. Do you believe it? Missiles. Frankly, the 24 days doesn't mean anything, self-inspection does it mean -- because the hell do they have to worry about nuclear? With the money they have, they can just buy it. They're going to buy it. And you're going to have nuclear proliferation and we didn't know, and by the way, for those people, I happen to be one of them that feel strongly about Israel. Israel is -- the worst thing that ever happened to Israel is Barack Obama. The worst thing that's ever happened. The worst. So we're going to -- I was endorsed by Carl Icahn, a great businessman, one of our great businessmen and so many others. In fact, they want to have press conferences, right? And unlike the Senator, nobody knows who they are. Some of these guys they're great. They're brutal, brutal people. You would never want to go -- there. I'm looking at this young, beautiful, woman. You wouldn't want to have dinner with any of these people, believe me. Is that your father, huh? You don't want you -- believe me. These are not nice people. Who cares? They're great negotiators. We have the greatest negotiators in the world. We have the greatest business people in the world. We're going to use them now. We're going to use them when we have deals with Japan and when we have deals with China. So China, we lose $500 billion a year in trade deficits, five $500 billion. How can you do this? By the way, this has been going on forever. It goes on forever. What China -- and I love China. They treat me great. I'd make great deals with them. I do sell them apartments all the time. I have banks that are in my building. The biggest bank in the world is in one of my buildings, pays me a lot of rent. They love the building. I can't believe they want to say it's got my name on it. I love to put my name on things I have to tell you. But they came in and I just extended their lease. And I'm rough on China, you know, I respect China. I'm not angry at China. I'm angry at our people because I wish our people would negotiate the same way. Why should this be? But they come in the other day, the leases has to be extended. So they want to extend, they only want to be in my building. I say are you sure? You know I can't even believe it because who speaks tougher about China? Look, China and they know it, they understand it. They understand the truth, so, therefore, they don't mind. China, it's the greatest theft in the history of the world what they've done to our country. It's true. They've taken our money. They've taken our jobs. They've taken our base. They've taken everything. They've taken so much, and again, it's our fault. It's not their fault they can get away with it. They talk about free trade. All these guys say, well. Mr. Trump, you're not a free trader. I said, no, no, you don't understand something. When China puts it in here for nothing and when I have friends that cannot sell their product in China because number one, they charge him so much tax it's impossible to believe. They call it a tariff but they charge so much tax, impossible to believe. When they do that, folks. It's not fair. It's not fair. We're being ripped off at every single level of government. And that's why we owe $19 trillion. And then we make a budget like we did two weeks ago. It's going to add another $2 trillion, right? You see that she's waving, she's agreeing with me. She's like really young and she even agrees but we can't do this. So we're going to be at $21 trillion. We're going to make this country so strong, so great. Let's start talking about a couple of areas. We are going to create a border so powerful, right? So powerful. You know when I -- when I started this journey. It's a journey. It's actually a journey. But when I started this journey, I talked about -- we're going to build a wall. Who's going to pay for the wall tell me? 100%. I will talk about that but when I started, you know, I gave a speech and I talked about illegal immigration. It was like the world fell in. Nobody was talking about illegal immigration. And then two or three weeks later everybody came back. Everybody was sort of coming toward me. There was a, you know, maybe he's right. Then you had the killing of Kate in San Francisco by an illegal immigrant who came in five times, shot her in the back. Beautiful Kate. Great Kate and Jameel in Los Angeles and so many others. The female, the woman, person, this wonderful woman she was a veteran, raped, sodomized, and killed in Los Angeles about three months ago by an illegal immigrant. And he shouldn't have been here. Would -- should have never been allowed to be here. So what we're going to do is we're going to have tremendous borders and we're going to build a wall. It's going to be a real wall. It's going to be a beautiful wall. It's going to be big, strong, nobody's coming through the wall. The only way they're coming through is if they come through legally, OK? It's the only way. It's the only way or we're just, we're just not going to have a country. We're just not going to have a country. So I gave the speech and I talked about illegal immigration. I talked about Mexico. I talked about a lot of things that turned out to be all true. And all of a sudden, everyone would say, oh, this is brutal. He's never going to -- he's going to fade very fast. Well, you know, up, up, up, up. Remember when the numbers started coming in? I started at three, I wasn't too happy. I started at three, then went to six, then went to 12, then it started just like -- it was like a rocket ship. Yesterday, we had a poll 42, can you imagine? 42. Actually, I hate to say there's one state that is beating you, Florida, 448 in Florida, 48 to 11 to 12 and nine. I mean, we're at 48 in Florida which is a very, very important state for us. I mean, really, really important. So all of a sudden though, these poll numbers started coming in, then CNN with those, all those cameras back there, CNN does a poll, and they say who's best on ISIS? Trump, by a lot. I don't mean by like even 48, I mean, like, more. Who's best in security? Who's best on the economy? Trump. I will be the greatest jobs President that God ever created and that is true. We need jobs. No, I mean, when I look -- look when I look at some of these -- Thank you, darling. Oh, we're going to take care of women. Do we love women, right? See here, I could say, we respect women. We cherish women. We love women. And thank you, OK? Thank you. Thank you very much. I like this woman. She's fantastic -- it's called, it's called spirit but we are going and we are going to take care of women. We are going -- you know, when you look at women's health issues, I saw where Jeb Bush was asked about it, and he said, no, no, we don't want to put money into that. I want to put money into that. We're going to put -- there's women's health issues that some people don't want to fund. You know that and we're to take care of everybody. We're going to take care of everybody. But I'm doing well with women for a lot of reasons but one thing is they feel, they want security in the country, and everybody feels that I will give us the best security in the country and I will. I will. And we are going to build -- we are going to build our military so big and so strong and so powerful, right? There's nobody, nobody, I mean, nobody is going to be taken advantage of us. And you know it's funny. So with Iraq, everyone said like, I remember when we had Hillary. She said I don't like his tone. They're chopping off heads in the Middle East and she's worried about my tone. I don't like his tone. It's not nice, OK? It's not nice. And Jeb said the same thing, and they said it the same day, Jeb Bush didn't like my tone. Here's a guy wastes $100 million, right? And he doesn't like my tone. It's just crazy by the way. Speaking of Jeb, he's in favor of Common Core which is the worst thing you could be and he's very, very, very, think of this, weak on the border. Remember they come in, people come in as an act of love. You can't have that. Whether he's a nice person or not, we don't need -- do we care if a person is nice? We don't need nice. We're tired of the nice ones, right? We've had plenty. We've had plenty -- we've had plenty of nice but I was thinking about it. So you have a guy like him who's spent over $100 million on a failed campaign, right? Over $100 million, he's here, right? And his money is here, he's spent this much. Me, my campaign, I'm number one by a lot. And I haven't spent any money. I feel guilty. I -- you know, I spent a little money but very little. Relatively, like almost nothing. Now I'm going to start, right? Why am I going to start? Because I feel guilty, right? And because I don't want to take any chances. I don't want to be cute. So I'm going to start. I'm %38 million under budget. I was going to have $38 million spent. Actually, like $44 million spent right up to this point. I spent like that and it's almost, like, how can you? Say you go on television, like tonight, I did O'Reilly, Bill O'Reilly. Good guy, right? In fact, when you go home, you'll see the second Bill O'Reilly. The one that comes on whatever the hell time like in 11:00 but he's a good guy. It was a tough interview. I have to tell you. It was an interesting interview but you'll see it when you go home. But when you think, so you have somebody who spends money and he's here. Think about this, our education, we have the Common Core, it's not working. We spend more than any country in the world on education, any country in the world by far. It's not even close. It's like we're here and the second -- second country is off the charts. Your best countries are Norway, Sweden, China, in terms of education, right? They're number one, two, three. We're number 28, so we spend the most, and we have like one of the worst results. We have third-world countries that do better than us, third-world countries. Wouldn't it be nice if it was like my campaign where we spend the least and we have the best, isn't that -- wouldn't that be nice? It's what we have to do. We can do that. That's what we have to do. All right. So, I'm running against these people, and you know again, some are very nice people. I once -- I refused to say badly about, you know, bad about some of them. I just refuse. I can't do it. Nah, OK, so I will. By the way, we got the endorsement of Sarah Palin. You saw that, right? Right? Do we love Falwell? Do we love Jerry? Do we love Falwell? One of the great people. Let me tell you what he's done at Liberty University, and the beautiful thing about Liberty University, virtually every candidate has gone to Liberty University, made a speech, have the most beautiful campus you've ever seen. Everybody goes down. It's an incredible school and Jerry Falwell, Jr. came up and he chose us. We got a call, as you know, three or four days ago, and he announced, and he's endorsing Trump. It tells you so much because everybody goes there. Everybody wants to go there. Everybody does go there. It tells you so much. Sarah Palin tells you so much. We got an endorsement from Sheriff Joe. Does everybody know? OK? How tough is -- I mean, this is a man. This is no games with Sheriff Joe. He likes our border position. When he says good that means I have the best border position. Let's face it, right? But we have certain people that we have to beat and we have to beat to get there. But a couple of reasons and a couple of things a lot of people don't even know. I'm self-funding my campaign. I'm not getting money from all these people. So, so very importantly, I'm not get -- I'm putting up and you know what I get offered millions and millions and millions of dollars. I feel so foolish not taking it, my whole life I've taken money, right? I've taken -- I want. I want. You're like greedy. I want more. I want more. Now I do but I want it for the United States. We're going to take in money. We're going to take in money. We're going to take it. We're going to take it in. We're going to bring it in. But I have these candidates and they say all sorts of things and a bunch of it. And some of it's right. I mean frankly, some of it's right. One of them, Ted Cruz is talking about eminent domain. Donald Trump is in favor of eminent domain. And Ted is a good debater but he's not a good speaker. Do you know what I mean? When you talk to him it's like you're in a debate. Hello, Donald, how are you? Woah, no, no, he's a good debater. I like him. Although who the hell won the last debate? Did Trump win it? Actually, can you believe we've already had six debates? Can you believe how -- when I did this, I never debated before. I create jobs. I do deals. I do buildings. I do stuff all over the world. I never debated. So I get on the stage like a number of months ago for the first debate. I had no idea. It worked out fine. I got a very unfair question from somebody but we don't even talk about that. We don't talk about that. I refuse to, I refuse, I refuse to talk about that. But, but every single poll, you know, they have data. They have everything. They have polls for everything but every they have these debating polls and everything. I think just about at least. I have to say just because if it's like one out of 60, then, I'll have a headline tomorrow, Donald Trump exaggerated. But virtually, every single poll, Time Magazine, Drudge is a phenomenal guy, by the way, all of these different polls slate. They came out and Trump won the debates every -- every debate. I mean, every debate right from the beginning which is great. And then the last debate where they talked about New York values and New York City values and it was a terrible thing frankly, because I was there and I saw what people went through, and I saw the death, and I saw the destruction. And I'll tell you what, everybody loved New Yorkers. New Yorkers are actually very good people and they have a lot of energy. They have a lot of energy, high energy, as opposed to Jeb. They have high -- they have -- thank you, man. They have high energy but -- so we went in and we have the debates. But they talked about eminent domain that Donald Trump loves eminent domain. I don't love anything. I mean, eminent domain. Here's the story, they take your property because you have to build a highway. They take a piece of it. They might take a corner of it. They might take more of it. They might take less of it but eminent domain is a taking. Now when they take your property they pay you a fortune. If you're smart because they pay you fair market value for your property. But if you didn't have eminent domain, you, and did you see these characters? You stupid 22 people. They wrote these things from this dying magazine, it's called the National Review. I think it's dead as a doornail. No, no, instead they said we are conservatives and somebody said Donald Trump is not a true conservative. I'm trying to say what's wrong with these people? They're so out of it. So they talk about eminent domain. So without eminent domain, you don't have roadways, you don't have railroads, you don't have hospitals, you don't have schools, you don't have anything. So they say he loves eminent -- I don't love it. You need it. You've got to build a road. You've got to build a highway. You've got to build a railroad. Excuse me, all these people like the Keystone Pipeline, right? They all like the Keystone pipeline. You wouldn't get 10 feet of the Keystone pipeline without eminent domain. And yet they take ads, Donald Trump likes eminent domain, and this is what I go through. Then we have an I told -- I said to Ted, Ted, you have a problem. Ted Cruz was born in a place called Canada. Has anyone ever heard of Canada, right? He was born in Canada. It's a big problem. Laurence Tribe, a great Constitutional Law from Harvard said it's a problem. It's, you know, unsettled law, called it unsettled law, meaning there's a big doubt. So you have many lawyers coming up saying it's unsettled law, meaning who knows? Now the Democrats have already started a suit but they're going to start a major suit if he ever got the nomination. So how can a guy run for office when he's got this cloud over his head? You know on real estate, they call it, you know what it is, it's called a cloud on title, right? It's got a cloud. It's a cloud on title. He's got a cloud on title. It's called he was born in Canada. He was a citizen of Canada until 15 months ago. Now he said he didn't know that. He didn't know. Smart guy. He didn't know he -- didn't know he was a citizen of Canada. Here's a guy who is a United States Senator from Texas. He was a citizen of Canada and he didn't know. So he's got a problem. Then another couple of constitutional lawyers just yesterday came out, and they said, no, no, it's not just, you know, unsettled. It is unsettled. You're not allowed to do it. You saw that they came down. They're not allowed to do it. Now here's the thing. Nobody in this room knows whether you can do it or you can't do it. But it will take years to figure out in court. And I said go for what's called a declaratory judgment. You go into the court you ask the court for a ruling because it's unsettled law. You ask the court for a ruling. But how can a guy, and he's sort of in second place, and he's way, way behind frankly, which I'm very happy about? But how does a guy run and then be very critical? He's always critical. How does the guy run -- but of course everybody's critical. I mean, today I heard a couple of people say such nasty things about me. These are nasty -- these politicians, you know, they're all talk, no action but they are nasty people. They're terrible. But you say to yourself, how does a guy run for the office of President when there is a very major possibility that he's not allowed to do it? It's a real problem so you got to go and find out. And it has had an impact because I think 36% of the people consider it to be unsettled law, and many of them considered to be much more than unsettled law, and you have to be able to do it. And I don't like bringing it up. So I won't bring it up, OK? Is that all right? I'm not going to bring it up but it's a problem, OK? It's a problem. Then in the case also of Ted, you do a personal financial disclosure form, and you have to sign it, and you're sort of signing your life away. Now he borrowed a lot of money, as you know, from Goldman Sachs and from Citibank. You got to -- you have to say that because he wants to be Robin Hood, he wants to convince everybody that he's the most honorable guy in the world, and he's going to fight for you, and those banks aren't going to do anything. And they're not going to -- we are -- we have the banks totally under control. So we didn't put their banks down. So now it finds out that he had $1 million at very favorable rates from Citibank and from Goldman Sachs, Goldman Sachs, OK? You got to have a problem there, folks. I mean we have a problem. So the nice part about me is that I don't have any of that stuff. I don't have it. I'm putting up my own. I'm not -- I'm not into Goldman Sachs. I don't care about Goldman Sachs. I built a great company, very important, when I ran, a lot of people said I'll never run, right? All these pundits, these geniuses, these people back there, morons, you're morons, OK? No, they're morons. The pundits. Look at these -- they are the worst. They are the -- I think knowingly, too. I think they're probably not actually as dumb as we think. I think they knowingly just say the wrong thing. But you know what happens. Do you know what happens? It's sort of interesting. They said Donald Trump will never run. He will never run. Don't worry about it. Well, then I ran. I announced. He said oh, he announced. So you know like George Bush has got the little spectacles, right? Those little tiny -- and he looks like a genius because of the spectacles. But if you took the spectacles off this guy, he wouldn't, he'd look like a dummy, OK? Which is what he is. So anyway, so Donald Trump will never run. Then I ran. Then he said, well, he'll never sign for me. That's when you sign your life away, right? You signed, you know, your name. Your life is like over. It's like brutal. So you sign your life away, right? I signed for me. Then he said he'll never ever show his corporate papers or show all of his papers because maybe he's not as rich as everybody thinks. So I put him in and then they said and he'll never do it fast. The worst is he'll take forever. You know, you get all these extensions in government. You need 45 days, another 45 days, you could extend forever. I said to my accountants and I paid them a lot of money. Who is our largest thing ever put into the federal elections by far, almost 100 pages? I said to my people, I want to get it in early. I don't want any extensions. Just get it done. These guys work 24 hours a day, did a great job. They put it in the press. They were like, like you have -- you have got scavengers. You never saw anything like it. They were waiting, they were going to find, oh, Trump is not as rich as we thought. We hope he's -- and then they find out, wow, I built a great company. In fact, what they don't know is if I decide -- because I was really undecided. Even if I wasn't going to run, I was going to submit my financials, OK? Can you believe it? Because I wanted to brag about the company I built. I'm a private company. So I built it. I built a great company and it's got some of the great assets in the world. You know, Miami Beach, Doral Country Club, and so many other, Turnberry in Scotland on the ocean, 800 acres on the ocean. And all of these companies is a great, great buildings, they're great jobs, and I have many other businesses. In addition to writing the art of the deal, many books, in addition to The Apprentice, which is one of the most successful shows on television, and by the way, NBC wanted to renew and I said can't do it. I mean, I can't do it because you're not allowed to do that if you run for -- you know the whole thing. It's a little complicated. So we chose Arnold Schwarzenegger. How will Arnold do by the way? How do you think -- who's going to be better Arnold or Trump? Yeah, I think so. You've got to be very quick to do that show. When you have Omarosa and these people you've got to be very quick. You cannot be slow-moving. You've got to move, your lips have to move, the mouth has to move, the body has to move. So it'll be interesting to see but I hope he does well because I have a big chunk of it. So we'll see. You remember Martha did it, right? Right? Remember that? Didn't work out so well. Fire Obama, President Obama? No, I want to save it. Let me save it for something. We'll all do it together. We have to save that for the big leagues, right? We have to save there. We're going to be together. We're going to have some of the 4,000 -- 5,000 people outside. We got to get them together for that one. Don't we agree? I mean, these poor people they're standing out there. They probably think they're getting in. They're not getting in. I'm going to be out of here. You're going to be out of here. They're going to be still standing. So anyway, so things are going to happen with our country. What did happen though, I talk about the border. I talk about trade. I talk about China. I talk about Mexico. How Mexico is just killing us and they're good people. I have thousands of Mexicans and Hispanics that work for me. I'm winning the polls with Hispanics in Nevada. They just had a Hispanic poll I'm winning which I always said I would. I'm doing unbelievably with African-Americans in the polls. With the African-Americans, we had won 25%, Republicans get 7% and 6%. Somebody said if he actually got 25% of the African-American vote, the election's over. It's over. So we're going to do great. We're going to do great. And you know why? Because I bring back jobs. We're going to bring jobs back from China. We're bringing jobs back from Japan. We're bringing it back from Mexico. We're not going to let things happen like, as an example, Pfizer is moving to Ireland. This big massive drug company, moving to Ireland because of taxes and other reasons and they can't bring their money back, corporate inversions. So, we're going to do so many things. You're going to be so happy. You're going to be so proud. So let me just leave it on this. Look, it is an unbelievable honor to have done what I've done. People are calling, even people that can't stand me, like some of them. But one, in particular, is a highly respected writer said nobody's ever done what we've done. What we've done. Nobody's ever -- we've totally changed the dialogue of politics. That's why the cover of Time Magazine, nobody's ever done it. We are going to do something that's going to be so special. This is a movement that is so special. We are going to win in so many different aspects. We don't win now. We don't win anymore. We're going to start winning so much. We're going to win on trade. We're going to win with the military. I mean, can you imagine? We have a military that can't beat ISIS, OK? Now ISIS they say are 30,000 people. Can you imagine General Douglas MacArthur saying, well, we can't do it? And I see these people. They're on talk shows. The military people saying how tough ISIS is. General George Patton, I mean, he would be -- he would get them before he got over to the talk show. But he doesn't do talk shows, OK? We will beat -- we will have our military great. We're going to take care of our vets so well. We're going to take care of, we have to take care of our vets. We have to take care of our vets. We're going to repeal and replace Obamacare which is a total, total disaster. We're repealing and replacing Obamacare. You know, I don't know if you see. I mean, I know you see, otherwise, you wouldn't have just gone crazy like that. Your premiums have gone up 25%, 35%, 45%. Your deductibles are worse than your premiums. You never get to use it. You have to die to use it. Your -- your -- the Obamacare is a disaster. It's going to die of its own weight because in '17 unless the Republicans give them more money and keep extending, the Republicans are making it possible. You know look, we know where the Democrats are coming from, OK? We understand that. The problem we have is these Republicans that we send to Congress and their hardline. We're going to stop Obamacare. We're going to fight ISIS. There are all these hard -- then all of a sudden, they get to Washington. They look at the angels and the ceiling, they look at the beautiful columns, they look at the beautiful marble floors, and they just keep raising their hand. What happened to them? That's not going to happen to me. It's not going to happen to me. Not going to happen. So I leave you with this, very soon, it's going to be happening. You know on February 1st you start off. You know who we start with, right? Iowa. Unbelievable people, unbelievable place. I think we're going to do great there. We start with Iowa. We go over to New Hampshire and then guess what we are? We're here. And for that period of a week and a half, I'm going to be here so much. You're going to be so sick of me. I'm going to be here. We don't want to take it. You're going to say get the hell out of here Trump we can't stand you anymore. But let me just tell you something, we're going to win and then we're going to beat Hillary or whoever the hell they put in front of us. We're going to beat it because nobody's got this going. And folks, I started off by saying, we don't win anymore. We are going to start winning. We're going to win with the military, right? We're going to win at the borders. We're going to win with trade. We're going to win with healthcare and Obamacare is going to be gone, but we're going to win with healthcare. We're going to win so much. You're going to be so proud of your President. You're going to be so proud of your country. I love the people of South Carolina from day one. I've loved them. We will be back a lot. Take care of yourself. Make sure you vote."}