{"id":465,"author":"Donald Trump","title":"Speech: Donald Trump in Iowa City, IA","date":"2016-01-26","link":"https://factba.se/transcript/donald-trump-speech-iowa-city-ia-january-26-2016","paragraphs":["You know, I have to start, I'll tell you. I met some real athletes. You know, we don't see athletes too often. I have to come to Iowa to meet athletes, right? I have to come, right? I have to. So we had a great football team here that I really enjoyed watching. That last game, I mean, we could have done maybe a little bit better.","Where is my football team? Get over here, football team. The football team. Come on, University of Iowa. Look at the size of these guys, they're monsters. He's -- we got the next Tom Brady right over here, the quarterback. He's going to be the next Tom Brady. The next Tom Brady. Come on. And I know Tom, and he's a great guy.","I want to tell you. Come on over here. Look at the size of these guys. Come on up here. Come on up, right? Get up. What a team. What a team. And they were so nice, they endorsed Trump. They like Trump, and I like them. I love you, guys. Look at the size, how big and strong. That's what we like. Thank you, fellas.","We'll get it next season, right? So now, I met some other guys that are really in serious shape. Believe it or not, I wrestled. I was such a lousy wrestler. I was a -- but you have an undefeated team, so get the wrestlers up here. Come on, fellas. Where are they? Where are they? These guys -- I'm not messing with them.","I said to a couple of them, they weigh half my weight. I said, \"You think I could take them?\" The other guys said, \"No, sir, I'm sorry.\" Look at these guys. Undefeated team. University of Iowa. He's the number one in the United States, but he's got a bad leg. So I said to the other guys -- look at the condition.","I said, \"Can I take him?\" They all said, \"Not even a chance, Mr. Trump.\" Can you believe it? Anyway, we love you, guys. Thank you. Keep going. Bring home the championship, right? Bring it home, fellas. They are in some condition, I'll tell you. I know how hard the wrestling stuff is. So it's bee -- it's been amazing.","It's been an amazing period of time. Started on June 16th, and I'm coming down the escalator, do you remember? Coming down the escalator. It's hard just like, you know, what these guys do. It takes guts. You run for President, it takes guts. I don't do this. I create jobs, I do buildings, I do businesses.","All of a sudden. But I saw what was happening to our country. When you look at the Iran deal, we give them a $150 billion and they put guns to our sailors' heads. Not going to happen anymore. Not going to happen anymore. It's not going to happen anymore. So I looked and I watched and I saw and I love this country and I love my business.","We built this great business. I have a wonderful family. This is tough stuff. I mean, coming around and doing this, and as much as I love you people, I could be someplace else. I'd be very happy. I could be very used to it. But we have to do something. We have this incredible, incredible country. And it's run by incompetent people that truly don't know what they're doing.","They don't know what they're doing. You look at, as an example, you look at our trade deals with China. We lose hundreds of billions of dollars a year. Look at these deals. We have people that are political hacks dealing with these smart, tough, hardened people from China that are trained from the time they are three years old how to negotiate, how to deal, how to wheel, and we have hacks.","We have hacks. And it's not going to happen anymore. We have guys that give campaign contributions to politicians and that's how they get their jobs. I'm self-funding, I'm putting up my money, I'm putting up my money. I'm not taking money from other people. No money from other people. And -- and you look at, as an example, just take a look, Japan.","They send us millions of cars. They pour in. I was in Los Angeles, the biggest ships you've ever seen. The cars are just pouring in. We give them like nothing. You people know because you give them a little bit. What do they get? Peanuts by comparison. Those days are gone. We have the greatest business people in the world and we don't use them.","We don't use them. We use the wrong people. We can't continue to go down this track. And it started when I said, \"Look, let's go.\" They wanted to renew The Apprentice. They came to my office. They said, \"Please, please.\" They came. Nice people, great people. And I said, \"I'm not going to do it.\" You know, if you run -- if you do this, you're not allowed to have a show.","It's called equal time. You can't have equal time. It's ridiculous. In other words, if I do this and you do Apprentice, you have to give everybody that's running the chance to do The Apprentice. Somehow I don't think NBC is going to love that idea. Do you believe it? Because you know what we're running with, right?","And especially on the other side of the aisle. I'll tell you what, on the other side, I watched that debate, if you call it that last night. Was that the most boring experience? You know, I feel I have an obligation to watch it. I could not watch it. I tried. I tried. I even went back. I went back three different times.","You couldn't watch it. You have a communist. It's true, communist. You have Hillary. I mean, you have Hillary who is a disaster. You want to let the football team take care of it? It is incredible. It's incredible. I'll tell you. It is so incredible. That's all right. You know, when I'm rough with somebody like that.","What I do like is the -- the cameras turn. The only way -- you know the story. They don't turn. They don't turn. All the time, my wife, she says, \"Darling, did you have many people there tonight?\" So the place was packed. We've had the Mavericks Arena packed. We've had at -- in Mobile, Alabama, 35,000 people.","They keep the camera right on my face. They'll never show because they don't want to show the crowds. I remember where they had Bernie Sanders a couple of weeks ago, a couple of nights ago. I had 12,000 people and we had to send away seven because they couldn't get into the arena. Bernie Sanders had 3,000 people.","And they said, \"Bernie Sanders had a really, really big crowd tonight. He had 3,000 people.\" Now I had 12, and we had to send away seven, 5-7, and they wouldn't mention it. I said, \"How come they don't mention that?\" But the -- wa -- the reason -- I agree. The reason I like -- the reason I like protesters is because the cameras are like fixed.","I thought it was like a thing they couldn't move. But whenever there's a protester, they like -- they turn like a pretzel because it's a negative thought, so they turn. So people see how big our crowds are. So anybody want to protest, go ahead, it's fine. Go ahead. So we had an amazing day and we had an amazing week.","We had Sarah Palin, as you know, were -- who is fantastic. She -- she endorses last week, and she is a fantastic. Well, today, we had Jerry Falwell who is amazing. We had Sheriff Joe. You talk about a border, Sheriff Joe keeps the border, folks, right? He keeps -- he keeps the border. And look, we have to do things in our country and we're going to do them right.","I came to Iowa, your Governor was saying about a certain person that I'm campaigning against, who I think is number two, but he's like a nervous wreck. He's dropping like a rock in the ratings. He's dropping like a rock in the polls. I love the polls. To me -- to me, a poll, I think I made polls famous because we're number one in so many -- we're number one in every poll.","It's almost embarrassing, but let's keep it that way. Let's keep it that way. Now, Ted Cruz, you know, the Canadian. He was a Canadian. So Ted -- Ted is not happy because the polls just came out. And here's what it is, folks. And this is so important because I love Iowa. I've been here. I'm going to be here.","I stayed at your Holiday Express the other night. Everybody was surprised. It was actually very nice. It was very, very nice. The bed was good. It was -- I asked for two things. Give me a good bed and let it be clean. I had a good bed and it was clean. We were happy. Right, folks? But Iowa, like your football team, like your wrestling, Iowa needs a win.","16 years, you haven't picked a winner. For 16 years, you haven't picked a winner. Now, you're going to pick a winner. It's going to be Trump, I hope. OK? And -- and you know what happened last time -- the last two times. I supported John McCain, worked with him, raised money, did everything. Didn't work out, lost.","And it was a tough one because, in all fairness, that was a tough race because of what had happened just previous to the election. But I went with McCain, didn't win. Romney's a nice guy. I went with Romney, it didn't work. I said, \"So we lost here, we lost here. This year, we're going to do it ourselves, folks.","We're going to do it ourselves.\" We are going to do it. We're going to do it ourselves and it's going to be something that's going to be special, OK? It's going to be special. Now, here's what just came out. Fox News, right? Wonderful, wonderful place, Fox News. It's wonderful. Wonderful. Trump -- this is in Iowa, Trump 34%, Cruz 23, Rubio 12. So have a nice lead.","Another Iowa, Trump 39, Cruz much lower, and Rubio much lower, and Carson much lower. Florida -- Florida, big state, great state. Trump 48. These are new. Cruz 16, Rubio 11. Arizona, Trump 38 to 15 to 11. Listen to this. When Zogby, very good poll, highly respected, Trump 45. Remember when I used to have the numbers, they said, \"Well, that's a plateau.\" I saw it, remember, he knows, this kid shouts out plateau.","These guys, the most dishonest people in the world, just about -- no, 25% of them we're actually good. But -- maybe not 25, maybe a little bit less. But I will tell you, you've heard that before, the plateaus, right? It's always the plateau. So what happens is I started off, you know, you start off like with nothing, then you go up to four and then you go to six.","My wife said, \"You know, if you run, you're going to win. But you actually have to announce.\" And I said, \"You know, I don't want to really announce unless I know I'm going to win.\" I hate to do that. I want to know. \"Yeah, I know, go for it.\" But eventually, I said I have to do it because the pollsters were putting my name in and nobody believed I was going to run.","They all put the name. They said Donald Trump is going to run. Who the hell is that? A protester? Sounds like a protester. Trump, Trump, Trump. Don't worry. No, I think it's a fella. So -- so don't worry. That's a nice whistle. Actually, I think -- I think they're wrestling in the back of the room.","So what happened is, she said, \"If you run, you're going to win.\" They put the name in, it didn't register because nobody believed it. She said, \"You don't understand. If you don't actually run, nobody's going to believe, and they're not going to do it, you can't poll.\" So I said, \"You know what, let's take a chance.\" So right from the beginning, it went up, and it started at six and it went to 12, and it went to 14. And every time I was on a show, they'd say six.","Well, that's a plateau. In other words, you won't get any more than six. But then you go to 12, then you go to 14. Then we went to 18 to 22 to 24. Now we went to 28 about two months ago, and they started saying -- they started saying, \"Holy, this is really just -- \", I'm starting to say I like the plateau.","Don't forget, that's against -- we started out with 17 people. So what you have, 28, and now we have polls at 42 and 45. I want to -- I want to plateau at 42 and 45. So a lot of things have happened. And a big thing happened, and that had to do with Paris. And you know, we've got to -- we've got to stop.","We've got to either have a border. Remember this, we've had -- we have to have a border. And if we don't have a border, we don't have a country. We're going to build a wall. It's going to be a real wall. We're going to let people come in, but they have to come in legally. They have to come in legally. They have to. It's amazing.","You know, whenever I want to knock out a protest, I just talk about the wall, the place goes crazy, nobody ever hears the protest. But it's true. And you know, the people I am with on the stage, and sometimes on the stage, the people that I'm with on the stage, they talk about it. Well, they say, \"What do you mean?\" Because you know who is going to pay for the wall.","Who's going to pay? Mexico. Mexico. Mexico. Oh, we have another one. Oh, OK. Take your time. Where? Where? Right there? Get him out. Get him out. Get him out. Get him out. It's unbelievable. Get him out. You know, when I say it nicely -- like the first time we had a protester, I was rough. I said, \"Get him out of here.\" The guy was rough.","He was punching everybody, he was going crazy. Rough guy too. But the cops, I love the cops. Do they take good care? The police, I love them. But this guy was a rough guy. He was a loud guy, screaming. He sounded like Pavarotti. He had a voice, big voice, I -- and he started swinging and punching and I was rough.","I said get him out and I'm screaming, \"Get him out.\" Then the next day that I got killed. The press, they said it was horrible the way I treated him. He's punching people, they're punching the hell out of people. So the next day, we had another one and I was very gentle. I said, \"Oh, that's OK. Please, don't hurt him.","Oh.\" And then they said I was weak, OK, I was weak. And the last thing I want to be called is weak, right? Right? We've got enough problems in this country with that. Boy, are we weak? Boy, are we weak? So about June 16th, it was going to be about trade. It was going to be about the borders. It was going to be about Obamacare, which you we were going to repeal and we're going to replace with something much better.","It was going to be about the Second Amendment, which is so important. We're going to keep the Second Amendment. We were going to focus on Common Core. There was not going to be Common Core coming out of Washington to educate the kids. You guys are all too old for this stuff, but I don't even know if you know what the hell Common Core is, but that's OK. Trust me, it's not good.","Coming out of Washington, we want our children educated from Iowa not from Washington, OK? You know. And it was all about that. And by the way, speaking of that. So we're spending tremendous amounts of money to educate our children. In the world, we're number one per pupil by a factor of four. I mean, so far ahead of everyone else.","We spend more money than anybody else, any other country in the world by a lot. And yet, we're number 28 on the list. So we have -- we're 28th in terms of quality. So that means we have 27 countries ahead of us. And yet in terms of cost, we're number one by far. So I was trying to equate that to what I'm doing.","I'm running a campaign. Thank you, darling. I don't think that's a University of Iowa student, do you? Get him out. Ready? Are you ready? Get him out of here. Get him out of here. Get the hell out of here. These people, what are they doing? You know, we're all in the same boat. We want to have strong military.","We want to take care of our vets. What the hell are they doing? You know, we all want the same thing, probably. Unless they're just troublemakers, which they are. Get the hell out of here. You know, it's like, what are they doing? It's really protests just for the sake of protesting. Well, you know, if you think about it, whether you're Conservative or Liberal or Republican never -- we want to have a strong military, we want to have a country.","We want to have great health care. We want to have great education. You know, what the hell are they doing? Every time you go out and somebody blows a whistle, somebody does something. It's sort of crazy, isn't it? I always say, I could take a person like that unless there's a substance abuse problem which it could very well be. I could take a person like that, honestly.","I could sit down with that person for 10 or 15 minutes and I think, really, they'd come over to our side. It's like let's have a great country again. I really believe it. I really believe it. So I was thinking about education, and I talk about this. I mean, I equate it to what I've seen on the campaign trail.","Because coming from the private sector, I know how to negotiate. I do deals. In fact, I'm doing a big hotel in Washington that I got from the United States Government under the Obama administration. Now that's negotiating, right? On Pennsylvania Avenue. I figure, if I don't make it to the White House, at least I'll have a hotel right nearby, right?","So I'll be -- one way or the other, I'm going to be on Pennsylvania Avenue. And by the way, I'm going to be on Pennsylvania Avenue not because I want to be, because I want to make the country great again. I'm working with you. I want to make the country great again. I thought I want to do. We have so much potential.","So I was thinking, and I'm watching these guys like Jeb, low energy, Jeb Bush. So low, oh. You fall asleep looking at him. No, you really do. So -- and I wouldn't no -- normally be upset, but you know what, he's spending tens of millions of dollars, he's spending like a fortune advertising against me. Then he goes on, \"I'm the only one that has the courage to take on Donald Trump.\" Big deal.","Big deal. Those wrestlers would take me on and so with the football player. But -- but Jeb Bush -- so here's a guy who spends a fortune. He's up to a $100 million. Wouldn't it be nice if we could give that money to the wounded warriors instead of wasting it? Wouldn't it be nice? Give it to the vets. Give it to anybody.","Instead of his people that are really taking it. You know, they advertise and they get big chunks every time they put an ad on, they get big, big chunks. These guys make more ads better than being a real estate broker. But here's . So Jeb has spent over a $100 million on a campaign and he's down here in the toilet, OK? He's down here.","He spent a 100. Now, just -- I'm going to start spending a lot because I don't want to take a chance, number one, and I feel guilty, number two. But I've spent almost nothing. And I'm number one by a lot. Now, forget that. Wouldn't it be nice if our country could do that so that instead of spending the most per pupil and having terrible results, we spend less per pupil or even the least and we have great results.","That's what's happening. So when you look at what we got, and I've seen so much and I've learned so much. In my whole life, I've dealt with politicians. They're all talk, no action. It's never going to get done. You're not going to be taken to the Promised Land. Believe me. It's just more talk. They're all controlled by their special interest, by their donors.","They're all controlled by that. And believe me, what -- you know, I tell the story about Ford and I tell the story, Nabisco is now moving its big plant from Chicago to Mexico. So -- so what does that mean? No more Oreos, right? Now, Ford is building a two and a half billion dollar plant in Mexico. Another plant was going to be built in the great state of Tennessee, and all of a sudden, at the last moment, they decided to move to Mexico.","Mexico is like the new China. Mexico, what they're doing to us on the border and with business and trade, it's unbelievable. And the problem we have is we know it's no good. Anybody knows it's no good. You don't have to go to the Wharton School of Finance. You don't have to go to Harvard. You don't have to go to Iowa, which frankly tonight I like much better.","University of Iowa, tonight I like. Tonight that's my favorite school. I do like it actually. But honestly, you don't have to go, all you have to know is it's no good. They're building this plant. They're going to build cars, trucks, and parts. They're going to sell them all over, but they're going to sell them to the United States.","No tax, no nothing. They come right across the border. You'll have illegals driving the cars right across the border because you save a lot of money. Nobody's going to stop them. Who's going to stop them? Under Obama, nobody stops them. So what happens -- what happens is they're building a plant. Now, Hillary knows it's no good.","Hillary . This is a beauty. Hillary knows -- Hillary knows it's no good. When she says it's no good, if she's President, she's going to be called by a lobbyist that has total control over her. She's going to be controlled. And -- and believe me, and I mean controlled. She's going to be called by a special interest, a donor.","She's going to be called by these people and they're going to say, \"You can't do this. These people gave you five million dollars on your campaign. You can't do this.\" Now, a guy like Jeb Bush or any of these guys, they're all controlled by the people that gave them the money. OK? So when it comes time for them to call Ford, say we don't want that deal, that deal is no good for us. We want those plants built in Michigan or wherever.","But just as long as they're in the United States, right? I mean, that's the way I look at it. So we want those plants. We want those plants built in the United States. So when I do it, it's different. I say, \"Folks, you can't do it.\" Now, I'll be called by the lobbyist, I know half of them. I know so many lobbyists.","I used to use them. Now, you know, now, I'm a politician. I can't believe. I'm calling myself a politician. But when they come to me, I say, \"Forget it. forget it.\" And if you're going to do that, we're going to charge you with 35% tax to bring those cars across and -- and nobody's going to talk me out of it. Nobody is going to talk me out of it. So when the lobbyist calls me and they say, Donald, if they know me or they say Mr. President or whatever the hell they want to call me, I'm going to tell them very simply, it's a very simple thing.","I'm not going to do it. I'm not going to do it. And when the head of Ford calls me to make one final plea, I'm not interested. They will call back within 24-48 hours saying, \"Mr. President, we've decided to build our plant in the United States.\" That's what's going to happen, folk. That's what's going to happen.","So a couple of other things. Look, we talked too much with our military, with everything. We are going to build our military so big and so strong and so powerful, nobody's going to mess with us. And you know what's going to happen? It's the cheapest thing we can do. We'll never have to use it. Now there's a couple of more.","Oh these people, these people. That's all right. You get him out of here. Throw him out. Throw him the hell out. It's unbelievable, right? And it's always like a little group. Hold up, man. This guy's been to so many of my things. No, behind you. All right. Bye bye, darling. It's like one person here, one person there.","But look at those cameras, look at the way they spin those cameras. Isn't that beautiful? They are the worst. Look at the way they spin those cameras. I love you too, man. I love you too. I love you too. I love this country. I'll tell you what. The thing that I've learned about this country is how smart the people are.","They get it. They get it. They really are. They're smart. They're incredible. They want to see great things happen. They don't want to see us taken to the cleaners. You talk about that deal, I can't get over the deal, the Iran deal, I can't get over it. I understand China has out dealt us for decades, and I understand it. I understand everything.","I just don't understand how we could have made a deal where we're giving somebody that's a terror nation a $150 billion. We're getting nothing. We're getting nothing for that deal except you're going to have nuclear proliferation. Worst thing that could ever happen as far as Israel's concerned, everybody in that deal, there is not a damn thing that's good in that deal.","I don't understand how it's even possible to be made. Why didn't we walk? We don't get our prisoners back, and now we're getting our prisoners after we pay a $150 billion. And you know what that's going to lead to? That's going to lead to more and more and more hostages all over the place. I would say -- by the way, don't go to the Middle East, OK? Don't go. It's going to lead to more -- and it's already happening.","It happened in Iraq two days ago. It's already happening. It's going to lead to more and more when they see that. And then what happens? They're getting the money in two days and we have 10 young sailors. And as a show of total disrespect, they take guns, put them to their heads. They put them in a begging position with their hands up, and they give them back after a day and a half.","And you know why they gave them back? Because they wanted the $150 billion. They've got no respect for our country. They have no respect for our leadership, and it's an absolute disgrace. So here's what's going happen. I'm going to run. It's going to be so important that you go out and caucus on February 1st. You got to do it. You got to do it. We're going to turn this country around so fast.","And you know what, if we have another four years of the Obama mentality, the -- the Hillary Clinton stuff. I mean, she should be going to jail. I don't know what the hell's going on. Oh, I don't know what's going on. No, I mean, think of it. Think of it. General Petraeus -- and by the way, leave him alone.","Now they want to strip him of his rank. They've destroyed this man. Now they want to take away his rank. Leave him alone. You know, we're supposed to be fighting ISIS, right? We're supposed to be making trade deals and doing all -- all they do is focus on General Petraeus. Leave General Petraeus alone. It's enough.","It's enough. It's enough. But they destroy General Petraeus for doing one-10th of what Hillary Clinton did. They destroyed him. So I don't know what's going to happen. I don't know who we're going to be running against. I can tell you, it's looking pretty good right now. But so important is Iowa, your caucus on February 1st. And I can tell you this, there's a big move to take Iowa and move it to the back of the pack, right?","You know that. And they don't want to have it be number one caucus, et cetera, et cetera. So it's Iowa, then it's New Hampshire, then it's South Carolina. They want to move Iowa to the back. I give you my word. This is such an unbelievable tradition. Even the whole concept of caucus, you know, there's something beautiful about it. It's harder, it's more complicated, but it's really, you learn about voting and you learn about your country.","There's something really special about. The fact that it's a little bit harder is a good thing. But on February 1st, I hope you're going to get out there because we're going to make such an unbelievable difference. Remember a couple of things. I am a fan of ethanol. That's a very big thing in this state.","That's a very important thing for the farmers. And it's additional fuel source. I mean, it's additional fuel. It's good. We don't ever want to be in the hands of OPEC like we were in the past. That's how we get into all this trouble in the first place. It's OPEC. So we have to do a lot of things. As a country, we have to be more unpredictable.","Everything we do, they know. We -- we have generals, they go on television. Who the hell wants our generals on television? I don't want. I want General George Patton. I want great generals. I want Douglas MacArthur. We have him. You -- you look at West Point, you look at Annapolis, you look at the Air Force Academy, you look at these great places, we have great talent there and we're going to find the right guys.","I see this general. He's leaving. And they said to him -- on a talk show, what do you think of ISIS? Oh, that's very tough, they were -- can you believe? Do you think General George Patton -- well, the first of all, he wouldn't be on a talk show. He'd be fighting. He'd be fighting. By the time the talk show ended, the war would be ended, OK? But we can't have this, and we need unpredictability.","Oftentimes, we'll be asked questions. There was a what would you do here? What would you do there? What would you do in terms of this? And it's like you don't want to give the answer because you're giving away everything, you're giving away all your secrets. For what? You're giving away. Remember what I've been saying for four years, take the oil.","Take the oil. Take the oil. ISIS has the oil. Iran has the oil. They're taking it away. Iran, right now, Iran is taking over Iraq. We spent two trillion dollars, and I was against that by the way, people say, \"Oh, Trump is a tough guy. He may be too quick on the trigger.\" I'm not quick on the trigger. I'll be the opposite.","I was the one that didn't want to go. And if you look back 2003, 2004, I was against it. I said you're going to destabilize the entire Middle East. That's what happened. And Wolf Blitzer the other day did a show which was so nice. He said, you know -- he was doing an interview with me, and he said, you know, Donald, it was very -- I -- I think Wolf Blitzer is a terrific guy by the way.","But what the heck. But he said, Donald, everything you said long time ago, because he was going through his tapes from 10 years, 12 years, 14 years. He said, so many of these things, almost all of it. I think all of it came true. It all came -- it came to us. He said you predicted so many different things, you said what was going to happen with the Middle East.","You were against the war in Iraq. And he played the tapes, and the tapes were like in -- oh, no, not again. Oh, throw him the hell out of here. Am I allowed to rip that whistle out of the mouth, I'd rip that whistle. I'd rip it right out. I would rip that whistle. Should somebody do that? Boy oh boy oh boy.","OK. Maybe we should bring that person up. We have a little debate with that person. Isn't it terrible though? Isn't it terrible? I mean, where do the -- where do these people come from? You really wonder. Hey -- hey, security, get him the hell out of here, will you please? Security is not quite as tough as Sheriff Joe tonight.","Get him out of here. Isn't it incredible though? What's the purpose? What's the purpose? So we're going to hopefully have a victory. I'll tell you what's happened. We picked up 11 points this week, 11. That's a lot of points, right? A lot. And all of my people and all of the experts say, \"Mr. Trump, don't say you want to win.","Just say you want to do well, because that way you can't lose.\" I can't do that. I want to win Iowa, because if we win Iowa, we're going to win New Hampshire, we're going to win South Carolina, we're going to run the table. We may be the first one every single state. Iowa is so important. So are you ready?","I love you all. February 1st, you've got to get out. You are going to be so damn proud of your country. We are going to win so much. We're not going to lose anymore. We're going to make great deals. We're going to take care of health. We are going to make our country great again. I love you. February 1st, you have to get out. You have to get out. Thank you very much. I love you all. Thank you. Thank you. I love you."],"text":" You know, I have to start, I'll tell you. I met some real athletes. You know, we don't see athletes too often. I have to come to Iowa to meet athletes, right? I have to come, right? I have to. So we had a great football team here that I really enjoyed watching. That last game, I mean, we could have done maybe a little bit better. Where is my football team? Get over here, football team. The football team. Come on, University of Iowa. Look at the size of these guys, they're monsters. He's -- we got the next Tom Brady right over here, the quarterback. He's going to be the next Tom Brady. The next Tom Brady. Come on. And I know Tom, and he's a great guy. I want to tell you. Come on over here. Look at the size of these guys. Come on up here. Come on up, right? Get up. What a team. What a team. And they were so nice, they endorsed Trump. They like Trump, and I like them. I love you, guys. Look at the size, how big and strong. That's what we like. Thank you, fellas. We'll get it next season, right? So now, I met some other guys that are really in serious shape. Believe it or not, I wrestled. I was such a lousy wrestler. I was a -- but you have an undefeated team, so get the wrestlers up here. Come on, fellas. Where are they? Where are they? These guys -- I'm not messing with them. I said to a couple of them, they weigh half my weight. I said, \"You think I could take them?\" The other guys said, \"No, sir, I'm sorry.\" Look at these guys. Undefeated team. University of Iowa. He's the number one in the United States, but he's got a bad leg. So I said to the other guys -- look at the condition. I said, \"Can I take him?\" They all said, \"Not even a chance, Mr. Trump.\" Can you believe it? Anyway, we love you, guys. Thank you. Keep going. Bring home the championship, right? Bring it home, fellas. They are in some condition, I'll tell you. I know how hard the wrestling stuff is. So it's bee -- it's been amazing. It's been an amazing period of time. Started on June 16th, and I'm coming down the escalator, do you remember? Coming down the escalator. It's hard just like, you know, what these guys do. It takes guts. You run for President, it takes guts. I don't do this. I create jobs, I do buildings, I do businesses. All of a sudden. But I saw what was happening to our country. When you look at the Iran deal, we give them a $150 billion and they put guns to our sailors' heads. Not going to happen anymore. Not going to happen anymore. It's not going to happen anymore. So I looked and I watched and I saw and I love this country and I love my business. We built this great business. I have a wonderful family. This is tough stuff. I mean, coming around and doing this, and as much as I love you people, I could be someplace else. I'd be very happy. I could be very used to it. But we have to do something. We have this incredible, incredible country. And it's run by incompetent people that truly don't know what they're doing. They don't know what they're doing. You look at, as an example, you look at our trade deals with China. We lose hundreds of billions of dollars a year. Look at these deals. We have people that are political hacks dealing with these smart, tough, hardened people from China that are trained from the time they are three years old how to negotiate, how to deal, how to wheel, and we have hacks. We have hacks. And it's not going to happen anymore. We have guys that give campaign contributions to politicians and that's how they get their jobs. I'm self-funding, I'm putting up my money, I'm putting up my money. I'm not taking money from other people. No money from other people. And -- and you look at, as an example, just take a look, Japan. They send us millions of cars. They pour in. I was in Los Angeles, the biggest ships you've ever seen. The cars are just pouring in. We give them like nothing. You people know because you give them a little bit. What do they get? Peanuts by comparison. Those days are gone. We have the greatest business people in the world and we don't use them. We don't use them. We use the wrong people. We can't continue to go down this track. And it started when I said, \"Look, let's go.\" They wanted to renew The Apprentice. They came to my office. They said, \"Please, please.\" They came. Nice people, great people. And I said, \"I'm not going to do it.\" You know, if you run -- if you do this, you're not allowed to have a show. It's called equal time. You can't have equal time. It's ridiculous. In other words, if I do this and you do Apprentice, you have to give everybody that's running the chance to do The Apprentice. Somehow I don't think NBC is going to love that idea. Do you believe it? Because you know what we're running with, right? And especially on the other side of the aisle. I'll tell you what, on the other side, I watched that debate, if you call it that last night. Was that the most boring experience? You know, I feel I have an obligation to watch it. I could not watch it. I tried. I tried. I even went back. I went back three different times. You couldn't watch it. You have a communist. It's true, communist. You have Hillary. I mean, you have Hillary who is a disaster. You want to let the football team take care of it? It is incredible. It's incredible. I'll tell you. It is so incredible. That's all right. You know, when I'm rough with somebody like that. What I do like is the -- the cameras turn. The only way -- you know the story. They don't turn. They don't turn. All the time, my wife, she says, \"Darling, did you have many people there tonight?\" So the place was packed. We've had the Mavericks Arena packed. We've had at -- in Mobile, Alabama, 35,000 people. They keep the camera right on my face. They'll never show because they don't want to show the crowds. I remember where they had Bernie Sanders a couple of weeks ago, a couple of nights ago. I had 12,000 people and we had to send away seven because they couldn't get into the arena. Bernie Sanders had 3,000 people. And they said, \"Bernie Sanders had a really, really big crowd tonight. He had 3,000 people.\" Now I had 12, and we had to send away seven, 5-7, and they wouldn't mention it. I said, \"How come they don't mention that?\" But the -- wa -- the reason -- I agree. The reason I like -- the reason I like protesters is because the cameras are like fixed. I thought it was like a thing they couldn't move. But whenever there's a protester, they like -- they turn like a pretzel because it's a negative thought, so they turn. So people see how big our crowds are. So anybody want to protest, go ahead, it's fine. Go ahead. So we had an amazing day and we had an amazing week. We had Sarah Palin, as you know, were -- who is fantastic. She -- she endorses last week, and she is a fantastic. Well, today, we had Jerry Falwell who is amazing. We had Sheriff Joe. You talk about a border, Sheriff Joe keeps the border, folks, right? He keeps -- he keeps the border. And look, we have to do things in our country and we're going to do them right. I came to Iowa, your Governor was saying about a certain person that I'm campaigning against, who I think is number two, but he's like a nervous wreck. He's dropping like a rock in the ratings. He's dropping like a rock in the polls. I love the polls. To me -- to me, a poll, I think I made polls famous because we're number one in so many -- we're number one in every poll. It's almost embarrassing, but let's keep it that way. Let's keep it that way. Now, Ted Cruz, you know, the Canadian. He was a Canadian. So Ted -- Ted is not happy because the polls just came out. And here's what it is, folks. And this is so important because I love Iowa. I've been here. I'm going to be here. I stayed at your Holiday Express the other night. Everybody was surprised. It was actually very nice. It was very, very nice. The bed was good. It was -- I asked for two things. Give me a good bed and let it be clean. I had a good bed and it was clean. We were happy. Right, folks? But Iowa, like your football team, like your wrestling, Iowa needs a win. 16 years, you haven't picked a winner. For 16 years, you haven't picked a winner. Now, you're going to pick a winner. It's going to be Trump, I hope. OK? And -- and you know what happened last time -- the last two times. I supported John McCain, worked with him, raised money, did everything. Didn't work out, lost. And it was a tough one because, in all fairness, that was a tough race because of what had happened just previous to the election. But I went with McCain, didn't win. Romney's a nice guy. I went with Romney, it didn't work. I said, \"So we lost here, we lost here. This year, we're going to do it ourselves, folks. We're going to do it ourselves.\" We are going to do it. We're going to do it ourselves and it's going to be something that's going to be special, OK? It's going to be special. Now, here's what just came out. Fox News, right? Wonderful, wonderful place, Fox News. It's wonderful. Wonderful. Trump -- this is in Iowa, Trump 34%, Cruz 23, Rubio 12. So have a nice lead. Another Iowa, Trump 39, Cruz much lower, and Rubio much lower, and Carson much lower. Florida -- Florida, big state, great state. Trump 48. These are new. Cruz 16, Rubio 11. Arizona, Trump 38 to 15 to 11. Listen to this. When Zogby, very good poll, highly respected, Trump 45. Remember when I used to have the numbers, they said, \"Well, that's a plateau.\" I saw it, remember, he knows, this kid shouts out plateau. These guys, the most dishonest people in the world, just about -- no, 25% of them we're actually good. But -- maybe not 25, maybe a little bit less. But I will tell you, you've heard that before, the plateaus, right? It's always the plateau. So what happens is I started off, you know, you start off like with nothing, then you go up to four and then you go to six. My wife said, \"You know, if you run, you're going to win. But you actually have to announce.\" And I said, \"You know, I don't want to really announce unless I know I'm going to win.\" I hate to do that. I want to know. \"Yeah, I know, go for it.\" But eventually, I said I have to do it because the pollsters were putting my name in and nobody believed I was going to run. They all put the name. They said Donald Trump is going to run. Who the hell is that? A protester? Sounds like a protester. Trump, Trump, Trump. Don't worry. No, I think it's a fella. So -- so don't worry. That's a nice whistle. Actually, I think -- I think they're wrestling in the back of the room. So what happened is, she said, \"If you run, you're going to win.\" They put the name in, it didn't register because nobody believed it. She said, \"You don't understand. If you don't actually run, nobody's going to believe, and they're not going to do it, you can't poll.\" So I said, \"You know what, let's take a chance.\" So right from the beginning, it went up, and it started at six and it went to 12, and it went to 14. And every time I was on a show, they'd say six. Well, that's a plateau. In other words, you won't get any more than six. But then you go to 12, then you go to 14. Then we went to 18 to 22 to 24. Now we went to 28 about two months ago, and they started saying -- they started saying, \"Holy, this is really just -- \", I'm starting to say I like the plateau. Don't forget, that's against -- we started out with 17 people. So what you have, 28, and now we have polls at 42 and 45. I want to -- I want to plateau at 42 and 45. So a lot of things have happened. And a big thing happened, and that had to do with Paris. And you know, we've got to -- we've got to stop. We've got to either have a border. Remember this, we've had -- we have to have a border. And if we don't have a border, we don't have a country. We're going to build a wall. It's going to be a real wall. We're going to let people come in, but they have to come in legally. They have to come in legally. They have to. It's amazing. You know, whenever I want to knock out a protest, I just talk about the wall, the place goes crazy, nobody ever hears the protest. But it's true. And you know, the people I am with on the stage, and sometimes on the stage, the people that I'm with on the stage, they talk about it. Well, they say, \"What do you mean?\" Because you know who is going to pay for the wall. Who's going to pay? Mexico. Mexico. Mexico. Oh, we have another one. Oh, OK. Take your time. Where? Where? Right there? Get him out. Get him out. Get him out. Get him out. It's unbelievable. Get him out. You know, when I say it nicely -- like the first time we had a protester, I was rough. I said, \"Get him out of here.\" The guy was rough. He was punching everybody, he was going crazy. Rough guy too. But the cops, I love the cops. Do they take good care? The police, I love them. But this guy was a rough guy. He was a loud guy, screaming. He sounded like Pavarotti. He had a voice, big voice, I -- and he started swinging and punching and I was rough. I said get him out and I'm screaming, \"Get him out.\" Then the next day that I got killed. The press, they said it was horrible the way I treated him. He's punching people, they're punching the hell out of people. So the next day, we had another one and I was very gentle. I said, \"Oh, that's OK. Please, don't hurt him. Oh.\" And then they said I was weak, OK, I was weak. And the last thing I want to be called is weak, right? Right? We've got enough problems in this country with that. Boy, are we weak? Boy, are we weak? So about June 16th, it was going to be about trade. It was going to be about the borders. It was going to be about Obamacare, which you we were going to repeal and we're going to replace with something much better. It was going to be about the Second Amendment, which is so important. We're going to keep the Second Amendment. We were going to focus on Common Core. There was not going to be Common Core coming out of Washington to educate the kids. You guys are all too old for this stuff, but I don't even know if you know what the hell Common Core is, but that's OK. Trust me, it's not good. Coming out of Washington, we want our children educated from Iowa not from Washington, OK? You know. And it was all about that. And by the way, speaking of that. So we're spending tremendous amounts of money to educate our children. In the world, we're number one per pupil by a factor of four. I mean, so far ahead of everyone else. We spend more money than anybody else, any other country in the world by a lot. And yet, we're number 28 on the list. So we have -- we're 28th in terms of quality. So that means we have 27 countries ahead of us. And yet in terms of cost, we're number one by far. So I was trying to equate that to what I'm doing. I'm running a campaign. Thank you, darling. I don't think that's a University of Iowa student, do you? Get him out. Ready? Are you ready? Get him out of here. Get him out of here. Get the hell out of here. These people, what are they doing? You know, we're all in the same boat. We want to have strong military. We want to take care of our vets. What the hell are they doing? You know, we all want the same thing, probably. Unless they're just troublemakers, which they are. Get the hell out of here. You know, it's like, what are they doing? It's really protests just for the sake of protesting. Well, you know, if you think about it, whether you're Conservative or Liberal or Republican never -- we want to have a strong military, we want to have a country. We want to have great health care. We want to have great education. You know, what the hell are they doing? Every time you go out and somebody blows a whistle, somebody does something. It's sort of crazy, isn't it? I always say, I could take a person like that unless there's a substance abuse problem which it could very well be. I could take a person like that, honestly. I could sit down with that person for 10 or 15 minutes and I think, really, they'd come over to our side. It's like let's have a great country again. I really believe it. I really believe it. So I was thinking about education, and I talk about this. I mean, I equate it to what I've seen on the campaign trail. Because coming from the private sector, I know how to negotiate. I do deals. In fact, I'm doing a big hotel in Washington that I got from the United States Government under the Obama administration. Now that's negotiating, right? On Pennsylvania Avenue. I figure, if I don't make it to the White House, at least I'll have a hotel right nearby, right? So I'll be -- one way or the other, I'm going to be on Pennsylvania Avenue. And by the way, I'm going to be on Pennsylvania Avenue not because I want to be, because I want to make the country great again. I'm working with you. I want to make the country great again. I thought I want to do. We have so much potential. So I was thinking, and I'm watching these guys like Jeb, low energy, Jeb Bush. So low, oh. You fall asleep looking at him. No, you really do. So -- and I wouldn't no -- normally be upset, but you know what, he's spending tens of millions of dollars, he's spending like a fortune advertising against me. Then he goes on, \"I'm the only one that has the courage to take on Donald Trump.\" Big deal. Big deal. Those wrestlers would take me on and so with the football player. But -- but Jeb Bush -- so here's a guy who spends a fortune. He's up to a $100 million. Wouldn't it be nice if we could give that money to the wounded warriors instead of wasting it? Wouldn't it be nice? Give it to the vets. Give it to anybody. Instead of his people that are really taking it. You know, they advertise and they get big chunks every time they put an ad on, they get big, big chunks. These guys make more ads better than being a real estate broker. But here's . So Jeb has spent over a $100 million on a campaign and he's down here in the toilet, OK? He's down here. He spent a 100. Now, just -- I'm going to start spending a lot because I don't want to take a chance, number one, and I feel guilty, number two. But I've spent almost nothing. And I'm number one by a lot. Now, forget that. Wouldn't it be nice if our country could do that so that instead of spending the most per pupil and having terrible results, we spend less per pupil or even the least and we have great results. That's what's happening. So when you look at what we got, and I've seen so much and I've learned so much. In my whole life, I've dealt with politicians. They're all talk, no action. It's never going to get done. You're not going to be taken to the Promised Land. Believe me. It's just more talk. They're all controlled by their special interest, by their donors. They're all controlled by that. And believe me, what -- you know, I tell the story about Ford and I tell the story, Nabisco is now moving its big plant from Chicago to Mexico. So -- so what does that mean? No more Oreos, right? Now, Ford is building a two and a half billion dollar plant in Mexico. Another plant was going to be built in the great state of Tennessee, and all of a sudden, at the last moment, they decided to move to Mexico. Mexico is like the new China. Mexico, what they're doing to us on the border and with business and trade, it's unbelievable. And the problem we have is we know it's no good. Anybody knows it's no good. You don't have to go to the Wharton School of Finance. You don't have to go to Harvard. You don't have to go to Iowa, which frankly tonight I like much better. University of Iowa, tonight I like. Tonight that's my favorite school. I do like it actually. But honestly, you don't have to go, all you have to know is it's no good. They're building this plant. They're going to build cars, trucks, and parts. They're going to sell them all over, but they're going to sell them to the United States. No tax, no nothing. They come right across the border. You'll have illegals driving the cars right across the border because you save a lot of money. Nobody's going to stop them. Who's going to stop them? Under Obama, nobody stops them. So what happens -- what happens is they're building a plant. Now, Hillary knows it's no good. Hillary . This is a beauty. Hillary knows -- Hillary knows it's no good. When she says it's no good, if she's President, she's going to be called by a lobbyist that has total control over her. She's going to be controlled. And -- and believe me, and I mean controlled. She's going to be called by a special interest, a donor. She's going to be called by these people and they're going to say, \"You can't do this. These people gave you five million dollars on your campaign. You can't do this.\" Now, a guy like Jeb Bush or any of these guys, they're all controlled by the people that gave them the money. OK? So when it comes time for them to call Ford, say we don't want that deal, that deal is no good for us. We want those plants built in Michigan or wherever. But just as long as they're in the United States, right? I mean, that's the way I look at it. So we want those plants. We want those plants built in the United States. So when I do it, it's different. I say, \"Folks, you can't do it.\" Now, I'll be called by the lobbyist, I know half of them. I know so many lobbyists. I used to use them. Now, you know, now, I'm a politician. I can't believe. I'm calling myself a politician. But when they come to me, I say, \"Forget it. forget it.\" And if you're going to do that, we're going to charge you with 35% tax to bring those cars across and -- and nobody's going to talk me out of it. Nobody is going to talk me out of it. So when the lobbyist calls me and they say, Donald, if they know me or they say Mr. President or whatever the hell they want to call me, I'm going to tell them very simply, it's a very simple thing. I'm not going to do it. I'm not going to do it. And when the head of Ford calls me to make one final plea, I'm not interested. They will call back within 24-48 hours saying, \"Mr. President, we've decided to build our plant in the United States.\" That's what's going to happen, folk. That's what's going to happen. So a couple of other things. Look, we talked too much with our military, with everything. We are going to build our military so big and so strong and so powerful, nobody's going to mess with us. And you know what's going to happen? It's the cheapest thing we can do. We'll never have to use it. Now there's a couple of more. Oh these people, these people. That's all right. You get him out of here. Throw him out. Throw him the hell out. It's unbelievable, right? And it's always like a little group. Hold up, man. This guy's been to so many of my things. No, behind you. All right. Bye bye, darling. It's like one person here, one person there. But look at those cameras, look at the way they spin those cameras. Isn't that beautiful? They are the worst. Look at the way they spin those cameras. I love you too, man. I love you too. I love you too. I love this country. I'll tell you what. The thing that I've learned about this country is how smart the people are. They get it. They get it. They really are. They're smart. They're incredible. They want to see great things happen. They don't want to see us taken to the cleaners. You talk about that deal, I can't get over the deal, the Iran deal, I can't get over it. I understand China has out dealt us for decades, and I understand it. I understand everything. I just don't understand how we could have made a deal where we're giving somebody that's a terror nation a $150 billion. We're getting nothing. We're getting nothing for that deal except you're going to have nuclear proliferation. Worst thing that could ever happen as far as Israel's concerned, everybody in that deal, there is not a damn thing that's good in that deal. I don't understand how it's even possible to be made. Why didn't we walk? We don't get our prisoners back, and now we're getting our prisoners after we pay a $150 billion. And you know what that's going to lead to? That's going to lead to more and more and more hostages all over the place. I would say -- by the way, don't go to the Middle East, OK? Don't go. It's going to lead to more -- and it's already happening. It happened in Iraq two days ago. It's already happening. It's going to lead to more and more when they see that. And then what happens? They're getting the money in two days and we have 10 young sailors. And as a show of total disrespect, they take guns, put them to their heads. They put them in a begging position with their hands up, and they give them back after a day and a half. And you know why they gave them back? Because they wanted the $150 billion. They've got no respect for our country. They have no respect for our leadership, and it's an absolute disgrace. So here's what's going happen. I'm going to run. It's going to be so important that you go out and caucus on February 1st. You got to do it. You got to do it. We're going to turn this country around so fast. And you know what, if we have another four years of the Obama mentality, the -- the Hillary Clinton stuff. I mean, she should be going to jail. I don't know what the hell's going on. Oh, I don't know what's going on. No, I mean, think of it. Think of it. General Petraeus -- and by the way, leave him alone. Now they want to strip him of his rank. They've destroyed this man. Now they want to take away his rank. Leave him alone. You know, we're supposed to be fighting ISIS, right? We're supposed to be making trade deals and doing all -- all they do is focus on General Petraeus. Leave General Petraeus alone. It's enough. It's enough. It's enough. But they destroy General Petraeus for doing one-10th of what Hillary Clinton did. They destroyed him. So I don't know what's going to happen. I don't know who we're going to be running against. I can tell you, it's looking pretty good right now. But so important is Iowa, your caucus on February 1st. And I can tell you this, there's a big move to take Iowa and move it to the back of the pack, right? You know that. And they don't want to have it be number one caucus, et cetera, et cetera. So it's Iowa, then it's New Hampshire, then it's South Carolina. They want to move Iowa to the back. I give you my word. This is such an unbelievable tradition. Even the whole concept of caucus, you know, there's something beautiful about it. It's harder, it's more complicated, but it's really, you learn about voting and you learn about your country. There's something really special about. The fact that it's a little bit harder is a good thing. But on February 1st, I hope you're going to get out there because we're going to make such an unbelievable difference. Remember a couple of things. I am a fan of ethanol. That's a very big thing in this state. That's a very important thing for the farmers. And it's additional fuel source. I mean, it's additional fuel. It's good. We don't ever want to be in the hands of OPEC like we were in the past. That's how we get into all this trouble in the first place. It's OPEC. So we have to do a lot of things. As a country, we have to be more unpredictable. Everything we do, they know. We -- we have generals, they go on television. Who the hell wants our generals on television? I don't want. I want General George Patton. I want great generals. I want Douglas MacArthur. We have him. You -- you look at West Point, you look at Annapolis, you look at the Air Force Academy, you look at these great places, we have great talent there and we're going to find the right guys. I see this general. He's leaving. And they said to him -- on a talk show, what do you think of ISIS? Oh, that's very tough, they were -- can you believe? Do you think General George Patton -- well, the first of all, he wouldn't be on a talk show. He'd be fighting. He'd be fighting. By the time the talk show ended, the war would be ended, OK? But we can't have this, and we need unpredictability. Oftentimes, we'll be asked questions. There was a what would you do here? What would you do there? What would you do in terms of this? And it's like you don't want to give the answer because you're giving away everything, you're giving away all your secrets. For what? You're giving away. Remember what I've been saying for four years, take the oil. Take the oil. Take the oil. ISIS has the oil. Iran has the oil. They're taking it away. Iran, right now, Iran is taking over Iraq. We spent two trillion dollars, and I was against that by the way, people say, \"Oh, Trump is a tough guy. He may be too quick on the trigger.\" I'm not quick on the trigger. I'll be the opposite. I was the one that didn't want to go. And if you look back 2003, 2004, I was against it. I said you're going to destabilize the entire Middle East. That's what happened. And Wolf Blitzer the other day did a show which was so nice. He said, you know -- he was doing an interview with me, and he said, you know, Donald, it was very -- I -- I think Wolf Blitzer is a terrific guy by the way. But what the heck. But he said, Donald, everything you said long time ago, because he was going through his tapes from 10 years, 12 years, 14 years. He said, so many of these things, almost all of it. I think all of it came true. It all came -- it came to us. He said you predicted so many different things, you said what was going to happen with the Middle East. You were against the war in Iraq. And he played the tapes, and the tapes were like in -- oh, no, not again. Oh, throw him the hell out of here. Am I allowed to rip that whistle out of the mouth, I'd rip that whistle. I'd rip it right out. I would rip that whistle. Should somebody do that? Boy oh boy oh boy. OK. Maybe we should bring that person up. We have a little debate with that person. Isn't it terrible though? Isn't it terrible? I mean, where do the -- where do these people come from? You really wonder. Hey -- hey, security, get him the hell out of here, will you please? Security is not quite as tough as Sheriff Joe tonight. Get him out of here. Isn't it incredible though? What's the purpose? What's the purpose? So we're going to hopefully have a victory. I'll tell you what's happened. We picked up 11 points this week, 11. That's a lot of points, right? A lot. And all of my people and all of the experts say, \"Mr. Trump, don't say you want to win. Just say you want to do well, because that way you can't lose.\" I can't do that. I want to win Iowa, because if we win Iowa, we're going to win New Hampshire, we're going to win South Carolina, we're going to run the table. We may be the first one every single state. Iowa is so important. So are you ready? I love you all. February 1st, you've got to get out. You are going to be so damn proud of your country. We are going to win so much. We're not going to lose anymore. We're going to make great deals. We're going to take care of health. We are going to make our country great again. I love you. February 1st, you have to get out. You have to get out. Thank you very much. I love you all. Thank you. Thank you. I love you."}