{"id":466,"author":"Donald Trump","title":"Speech: Donald Trump in Farmington, NH","date":"2016-01-25","link":"https://factba.se/transcript/donald-trump-speech-farmington-nh-january-25-2016","paragraphs":["Young, young people, young people. Beautiful. Good evening. We love New Hampshire. Good evening. February 9th, we have to go out and vote. We got to do it. We have to bring it home, right? We got to bring it home. So we're getting down now to crunch time. You know this is now crunch time, right? And we're having a lot of good signs and New Hampshire has been so amazing.","From day one, we've done great up here, from day one. And -- I was yesterday -- thank you, honey. I love you too. Thank you. Thank you. And so important, honestly, we just have to bring it home. We have to have a mandate. We have to do well. We have to get big numbers and we've got to send even the world a signal because we're together, we're unified.","The people we have, this is a movement. I don't know if you've been reading like Time Magazine, the cover of Time magazine, it's a movement, what's going on. People love this country so much and they want to bring it back. And we're going to bring it back. We're going to bring it back. We just had, you know I have to tell you this, I love talking about it and I've made pollsters very famous actually.","But when you're No. 1, you always like to talk about it, right? So Zogby just comment at national poll, 45 to 13. Can you believe that one? I don't believe it even, I mean some are. Maybe I should say let's make it close. Everybody's got to get out. You've got to get out and vote. Don't worry about polls because there's only one poll that count.","You know what that is. February 9th for you people, right? February 1st for Iowa, February 9th for you. In New Hampshire, Trump, 33. This is Franklin Pierce. We all know Franklin Pierce. Then you have Cruz, Kasich in a -- oh, boy poor Bush. You guys spent $100 million. What is he doing? What is he doing wasting all that?","Such a waste. Such a waste of money isn't it? What is he doing, that poor guy? Oh, we just -- we got another one in Iowa American Research 33, 26. Boston Herald just came out 33, 14. I mean they're just one after another. Florida, how about this one, Trump, 48 the you have Rubio at 11 and you have Governor Bush down much lower than that envelope.","The Monmouth -- he's low energy, he's right. Monmouth poll, 36 to 17, can you imagine that? The Morning Consult, 39 to Cruz, 13 to Rubio, nine -- wow, I love this. Reuters 40.6 to 10.2 to 9.7. So you know, I mean it makes us all feel good but we've got to get that vote, I mean because who knows.","I've seen bad things happen in life, you know. You take things for granted. That's why, in one way, these polls have gone so crazy and so positive that I hate to tell them, gee. Because I want you to go out. You got to go out. I want to bring this country back so strongly, so good we can do it. See the hats, all the hats, make America -- right?","Make America Great Again. And that's what we're going to do. That's what we're going to do. You know it's very interesting. So over the last few months, five months, six months now, June 16th, that was a very, very difficult thing. You know it takes guts to go and run for president, OK? It's tough. Believe me. I don't do this for a living.","I build buildings and I do a lot of things and I create tens of thousands of jobs over the year. Tens of thousands of jobs. And I love doing it. You know I love what I'm doing. I love my wife, I have a great family, I have wonderful -- I built a tremendous company that's been really good. In fact, when I filed my papers, everyone went down to check out the company and they said, wow, this is really a good company.","Very low debt. Some of the great assets of the world. Some of the great real estate assets, any in the world -- anywhere in the world. You look at Trump National Doral in Miami or Turnberry. You take a look at Turnberry in Scotland where they played the British Open, now called the Open Championship, the biggest golf tournament, and so many others.","We have so many, so many buildings in Manhattan. 40 Wall Street, Trump Tower, a lot. The Nike, Nike Town, all these different things, and I love what I was doing, and I loved it but I watched and I saw and I looked, like you, like everybody, what is going on with our country? I'd see the deals that are made.","I'd see a Sergeant Bergdahl where Sergeant Bergdahl would be. He was a traitor, right? And yet for Sergeant Bergdahl we gave them, how many guys? Five, right? Five. We gave him five people that they wanted so desperately and people were killed, five or six people were killed going out looking for Sergeant Bergdahl.","And you see the parents of those young kids, those great young soldiers and you see him on television. It's just like devastating. And in the old days there would have been very big repercussions. Today, who the hell knows, probably won't get anything. It's unbelievable what's going on in the country. Then you look at the Iran deal where we give $150 billion dollars.","Now think of it, it's so sad. I mean, when you look at that deal, and that deal epitomizes what the United States is all about now, we don't win anymore. You know, we used to win, right? We'd have a country and we'd win, and we don't win anymore. We don't go and we don't do and we should win. We have some of the great negotiators, we have the best business people, we have the best business people in the world, best businessmen, best business women I know so many of them.","Instead, to negotiate with China, who do we use? Political hacks. We use people that gave campaign contributions to represent us with different countries and probably, who the hell knows, they probably have an interest in making bad deals. I mean, you don't even know anymore in this country. You don't even know, you don't know what's going on. And some of the deals are so bad that it's not that our people are that incompetent, believe me, this dishonesty, you look at these people that are raising all of the money, I'm self funding my campaign, I'm putting up all my own money which I think is important.","I mean, nobody, no lobbyist is going to say, I gave you $5 million, you have to come through for me. None of that -- I don't -- hey, I was on the other side of the table. I was a big contributor for years and I was totally, I mean, I guess I was establishment. Now I'm not an establishment, OK? But you know, it's sort of interesting because we're competing against a lot of different people.","We started off with 17, rapidly disappearing, OK? Fortunately for all of you, I've to tell you because you don't want to you know what I know. And these people -- but we have some -- and we have some very good people. I mean, I have to tell you, I, on stage, I've gotten to know and I really like some of the people.","I hate criticizing some of them actually. But you look at what's going on where a guy like Bush raises $128 million and then he takes ads. The ads about me, constant ads coming on about me, and my poll keeps going up and he keeps going down. Explain it. No, explain it. Low energy, low energy. We don't need low energy people.","And I keep saying, you know, I'd never even talked. He's so low in the poll, I would never talk to him. But, I mean, why would I talk about the guy except he takes so many ads about me and he said today and told me, I'm the only one that attacks Donald Trump. Oh, big deal. Big deal. He thinks he's going to get point.","First, he attacks and loses. He doesn't win. But it's sort of -- it's sort of an amazing thing. And you know my new battle is with a gentleman named Ted Cruz because you got to speak the truth. You've got to speak the truth. The Canadian, the man from Canada. Thank you, that was very helpful. I don't know.","That's so succinct. That was very good. The accent is it screams out the Canadian. Yeah, that's right, the Canadian. He could run right now for Prime Minister of Canada. He'd never have no problem. But he does have a problem. I mean, does anyone agree with me on this because it seems -- Right?","How do you -- OK. So you have a constitution, you have very strong, you know, all your life you're here, you have to be born in this country, born in this country. He's born in Canada on Canadian soil. And, I mean, come on. Then what happens is from Harvard, you know who I'm talking about, very talented lawyer, Laurence Tribe, very top, top constitutional lawyer.","He comes out, he says it's totally untested law and then other lawyers come out said not untested, he can't do it. You can't do that if you're born in a different place. I mean like John McCain was born on a military base outside of the United States. I fully understand that. To two parents, by the way, that we're American citizens.","Big difference. You know, military base and to parents who were actually in the armed forces but -- so that's a lot different. But you know in the case of -- in the case of Ted Cruz, he was born on Canadian soil. So what do you do? You have to go to court and you have to get a declaratory judgment or you have to get something.","Now he's already being sued by two groups. I hear Illinois is saying, we don't think we're going to approve you. Now maybe they will, maybe they won't. Big state, very powerful state. A lot of voters. Got to get on the ballot, right? How do you approve somebody who can't get on the ballot? How do you approve somebody -- how do you as an example, let's say he's the nominee and he goes and you know the first week or probably the first day the Democrats are going to sue, they've already said they're going to sue.","So they're going to sue. Now he has a cloud over his head. It's like a cloud on title in real estate. You got a cloud. You don't know and you won't know until you get to the court and probably or possibly the Supreme Court of the United States. That takes a long time. So I mentioned this. And then of course he comes out with his loans and he's, you know, he's Robinhood.","He's Mr. Robinhood and he's going to protect you from the horrible Wall Street bankers. And in his financial disclosure he didn't report. He didn't report. I don't know why. I think I know why but I won't say it, but he didn't report that he's got loans from Goldman Sachs and Citi, and actually Citi came after and he had $1 million that he had very low interest loans.","And number 1, Goldman Sachs has him and Citi hasn't. Supposing Citi Bank or Goldman Sachs calls up and they say, listen, we'd like you to do this. We'd like you -- he's going to do it. That's the nice part about what I'm doing. That's the nice part. Nobody, nobody is giving me anything. These politicians.","These politicians, all talk no action. It doesn't get done. But a lot of the things you see, what you think are stupid aren't so stupid because those companies that are making these great deal and, frankly, the countries that are making the great deals, the countries. They're represented by people that gave a lot of money to Hillary and Jeb and -- and Ted and all of them, all of them.","They're representing -- I mean, you look at some of the people that are giving them money, these people don't care about our candidates. They care about what our candidate is going to do for them, not for the country, but for them. So I'm the only one that's funding my own campaign on either side whether it be Democrat or Republican, which makes me feel a little bit lonely.","And it makes me feel a little bit foolish in many ways. My whole life has been about taking. See, I'm telling the young kids, I want to take. I'm greedy. I want to take, take. My whole life has been taking and now what am I going to do? I'm going to take and I'm going to be greedy for the United States of America.","So to take, take. And we're going to help our military and we're going to build a strong and powerful and big, and beautiful military. We're going to rebuild that and it's going to be great. It's going to be great. And nobody's going to mess with us and hopefully we'll never have to use it because nobody is going to want to mess with us, but we don't do that right now.","Our military is being decimated. It's being decimated. We have trucks and we have ammo and we have rifles and we have all this stuff gets shipped to our enemies and, you know ,our enemies take it. I don't know if you know that because as soon as they fire a bullet up in the air, you've heard it, the people that we gave it to, they run.","They drop everything, they run for the hills, right? 2300 Humvees. This is the thing that gets me because I say that's so much. How many ships does it take? 2,300 brand new armor-plated Humvees. Now if you think about that, we have wounded warriors, our greatest people. These people have the best attitude, the best attitude.","They lost their legs or they lost their arms or they lost both or they lost worse. And their attitude -- and you see him and I see him and they're smiling and, I mean, these are amazing people not being taken care of properly by the Veterans Administration. We're going to make sure that is solved, our veterans General.","But but think of this, 2,300 Humvees, armor-plated, now the ones that our guys became wounded warriors driving around in because a bomb goes off underneath and it was like driving around in a regular Jeep or a regular car. I mean, these things are incredible. So they're over there. The enemy has them. And the young soldier, the son of a friend of mine came back.","He's been there three tours and he came back and he said, you know what's sad, Mr. Trump, the enemies had better equipment than we do. It's our equipment. They take it, they take it. We give them to these people that we don't even know who the hell they are. You know, people fighting for us, insurgents, all these people, they're fighting for us, right?","They call them revolutionary this and, you know, all people we think it's good they have nice names. And what are we doing, folks? What are we doing? Why, why are we so stupid? Why are we so incompetent? Why do we allow these things to happen? This is a young -- Obama? Well, it is. It is. Look, we shouldn't have gotten in. We shouldn't have gotten in. And I was against it. And you have to give credit for vision.","We should have never been in Iraq. You know, think of it. So in 2003, 2004, Reuters, they wrote an article Trump is totally opposed to the war. Now a lot of people say temperament, you know, temperament. I was going to say dummy Bush but I refuse to say. Bush, he said I don't like his tone. Tone, they're cutting off people's heads all over the place and he's worried about tone.","They're cutting off Christians heads in the Middle East and were worried about tone. But you know, they say, does he have the right temperament? I have a great time. You know, I built this incredible company, incredible. I have a great temperament. I have an unbelievable temperament. Somebody said the other day, he's angry.","Nikki Haley, a wonderful woman, I've supported her. I support her, but she -- in her speech she said she was referring to me, she said this. She said I'm angry and they asked me at the last debate. Who won the last debate by the way? But they asked me last week that, you know, Nikki said you are angry and I never thought of it, but I said you know what I am angry.","I'm angry about ISIS. We can't beat them. I'm angry about the border. I'm angry about the fact we're not putting up a wall. We will put up a wall by the way. We will put up a wall and Mexico is going to pay, right? Mexico's got to pay. Hey look, Mexico's going to pay for the wall, they'll make a fortune.","Look at the trade deficit that we have with Mexico. I'm not even talking about all the drugs that are pouring across the border. That's, you know, that's in addition to. Look at the trade deficit that we have with Mexico. It's ridiculous, OK? So these politicians come up, they say Donald, I understand the wall.","Actually Ted just came out a couple of days ago. My wife was watching, she said, darling, he just said he wants to build a wall. He never said that. I never heard him say it. Maybe he did. Did he ever say that? All of a sudden these politicians are coming out. We will build a wall. Number one, they wouldn't know where to start.","Number two, it'll never get built. And guys like Ted were for amnesty and they're weak. Now all of a sudden they're trying to strengthen up. I will say this, when I announced that I was running, when I announced I brought up illegal immigration. Nobody ever talked about it. Now it's like a mainstay and you have a tremendous problem up here.","Of all the people you would think in New Hampshire you wouldn't have this problem, but you have a tremendous amount of drugs pouring in. Is that right? I get more questions, I get more question -- when I come to New Hampshire. You know you start to see it that way. You could see some areas may be where you would think it but not in New Hampshire.","And yet the question I get just about No. 1 when I come up to New Hampshire are the drugs that are pouring in. It's incredible. I don't know why. I don't know what it is, but they're coming across the southern border. And we're going to stop it. We're going to stop it and we're going to try, we're going to try and help the young people and the old people and the middle aged people and everybody that got addicted because they're addicted and we can get them off it. It's tough though, it's tough.","What's much easier if we could just stop it where they don't start and we can talk to people and talk to the kids and say don't do it. Don't do it, you'll be hooked and you'll destroy yourselves. Don't do it because you know it's, it's easy not to do it. It's easy not to do it if you never start, right? It's easy.","There's nothing. I mean if you offered me that stuff I'd say you, uh,forget it. Who wants it? But if you're addicted to it it's a very tough thing. I've known some very tough, very smart people. You get addicted to it. It's a very tough thing. So we're going to clog that up. We're going to stop it. We're going to help the people that have the problem and try and get them off it and we can do that.","And it's hard, it's hard, but we're going to do that. But what really is easy is to convince everybody, don't take it. And what's really the best is, don't make it available. Right now it's so damn available, people take it. So we're not going to make it available. And you know where it comes from. So Cruz has a lot of problems, I think, and we'll see, but you know the last poll that just came out it's like amazing in Iowa.","I went way up. He went way down. He's falling. He's nervous. He's concerned. And he should be, you know. It was interesting, a magazine which is a failing magazine, National Review. You've probably -- and not to -- Terrible, but they did something that was I think quite stupid. They came out these 20 -- one guy came up asking me for money.","For he's got some deal and wants money. Another one wants me to be on his radio show and I couldn't do it, I just could do it, the show. Glenn Beck calling, show, be on my show be, on my show. Guy, every time I see him he's a weird guy. He's always crying. He's always -- he's a weird dude. His show is failing by the way, so is his deal.","So he gets fired, he gets fired from Fox and you know what, I'm not blaming him really because he gets fired from Fox, has a show starts. Everyone thought it's going to be good. It's the total -- it looks like it's a bomb, OK? but that's OK. He wants me to be the show. I would -- I would have done it actually, but I couldn't because of time and everything else.","And then you know, you go to No.1 and then you people start thinking, this is true with everybody, you people start thinking how great we are. No good. I don't think how great I am. But people maybe they say, and they make it a little bit harder for him, all of a sudden he starts blasting me. Then once you blast I don't want to go on the show anymore, right?","So he blast. If I would have done the show I'd have no problem, but because I didn't do a show, he went -- he writes a little article. So you got all these different people, 22 people, and a guy wrote something. I -- should I read it real quick? Quickly, I'm going to read it, all right? Doug Ibendahl, and I thought it was amazing, he wrote it very negative to the net -- to the National Review.","Again, National Review is a magazine that I think is going to be out of business very soon. It's doing so badly. I don't think it's got any influence anymore. They got a little publicity but I think it was better for me. Here's what he writes. So clueless is the gang of 22, these are the writers, they can't even see how they've stumbled right into the narrative Trump's been communicating so successfully for months.","I have been communicating. We have definitely been communicating, right? Just like the elected officials from both parties, the gang of 22 has been great at complaining about stuff year after year after year. But getting anything accomplished, not so much. In other words, they complain and they talk and they talk.","They don't do anything. Many of the gang of 22 have been hanging around and chatting for decades and some are active cogs, right? And the conservative entertainment complex deriving their income by pandering to conservative anger while offering no real solutions, right? They never tell you what to do. They say, are you conservative?","Are you this? They have no idea. I don't even think they know what it means. Donald Trump represents a threat to these ineffectual poo-bahs in the same way he represents a threat to do nothing. Public officials of which we do have plenty. Jealousy is also seriously at work here. Trump is inspiring and exciting a broad spectrum of the country like no member of the gang of 22 ever has or ever will.","You have to see the crowds we have like this is a packed house, every single place we go to, we were in Oklahoma the other day, we filled up a stadium, we had to send away from 5,000 to 7,000 people. No matter where we go. I mean, we have, we have people last night and by the way this week in Iowa, we were just absolutely every single place they have, you know, staging areas where the people they can't get into the main room are put into another room and it's like the whole thing is unbelievable.","So we really have, what? It is a movement, man. I like that guy. It is , I mean, it's a movement. We want to take our country back. So seven months of campaigning, Trump has already more Americans listening which is true to the Republican message in the entire gang of 22 could muster over decades and decades and decades.","Trump understands that before you can advance the ball you have to convince people to take time from their busy lives to listen. No one on the GOP side since Ronald Reagan, great guy, has accomplished that like Trump which is very nice. Obviously, this gentleman likes. And actually no one else has come close and certainly no one from the effete corps of impudent stops to which the National Review thinks we should defer the gang of 22 had their chance, which is true.","They've been talking for years. They talk and talk. They're worse than politicians, OK? Maybe not. The gang of 22 had their chance of it long time. They've done a lot of bitching over the years and it's paid well for some. Some of these guys make a couple of bucks. But Americans care about results. We're result-oriented, right?","They can plainly see all of this is empty talk, at the same time when Americans look at Donald Trump's life, they get a lot of assurance that here is finally a man who shares their focus and actually wants to get results and is getting results. I've done a good job, what can I tell you. Built a great business, many great selling books including The Art of the Deal which is just about, I guess, it should be the No. 1 best selling business book of all time.","The Apprentice was this tremendous success. They want to sign me up for a long time. I said I couldn't do it because I'm running for president along with other things. And Trump, we charge the respect by recognizing regular hard working Americans who are a lot smarter than any of their ideological eunuchs in all their pontificating glory.","So just to finish. Isn't it true though? This guy writes so big. I love what he's write, maybe because it's a positive. If it was a negative I don't think -- what voters are looking for this year is competence and accomplishment. They really are. We're looking for competence, right? We're looking for -- we want smart.","We want to be the smart people again not the dummies that we've been for years with the Iran deal and all of these horrible deals, our trade deals with China. Donald Trump has an actual record of delivering both in spades. The gang of 22 is right to be terrified. A president who could get things done would expose them as the irrelevant creatures they truly are.","It can't happen fast enough. I thought that was really -- right? I, honestly, I thought it was good. I thought the way he wrote it and it's right, it's right. I mean these people, I never like critics. I watched Broadway plays and I'd see a play that's good. And then next day you wake up and you see the New York Times critic going to write about the Broadway play and they'll say horrible things.","The actress was no good and then this. Maybe sometimes they're right sometimes they're wrong. But I always say they can't do it themselves, you know. I like being a critic only like I'm being a critic, a big critic of Obama. He's done a terrible job but we're going to fix things. We're not going to just criticize.","We want to fix it and we want to be -- you want me to fire him? Maybe we'll save it for a more appropriate time, OK? Maybe worst thing, but you know what, we will -- I'll tell you what, we're going to make you so proud. We're going to make you so happy with what's going on. We are going to make you so happy.","But I thought that article was amazing because here you have people that really criticize. We have to get critics, but we have to get critics that know how to fix things. So when I started on June 16th coming down that escalator, remember the famous escalator ride, it did take courage and I looked downstairs and it looked like the Academy Awards.","There were so many cam. Look at all of them back there even tonight. Look, all of these guys and there were so many cameras downstairs. You've never seen anything like it. And I said boy, I said to my wife, come on let's do it. And I took a deep breath. I got on the escalator. I rode it down and I started talking about illegal immigration, a lot of things, took a lot of heat for a couple of weeks and then people started saying he's right, he's right.","And then you had Kate killed in San Francisco, shot in the back by a illegal immigrant who should have never been here. And you had Jamiel in Los Angeles, a young man going to college, getting ready to just start college. Good athlete, great father, he was a friend of mine and he was killed, shot in the face three or four times in the face and for no reason, walking home to his father.","And so many others, the veteran, 65-year old veteran who was raped, sodomized and killed ,who is supposed to be a wonderful woman, by an illegal immigrant. And so many others, by the way those are three examples. But so many others and they also look at the economics of it. What's happening economically.","And I said we have to do something and all of a sudden everybody's saying, well, Trump's right. Trump's right. Now they're trying to get so tough, so tough. They were all weak as hell. Now they're tough guys all of a sudden, but as soon as their donors and special interests and the lobbyists go to them, they're going to immediately fold, you know that, everybody knows that they fold.","That's what they are. Politicians always fold. Just remember that they will fold. And then I brought up -- not me, not me. No, I don't fold. I don't fold. I don't fold. There's no reason for me. I will tell you if somebody gave me lots of money and if I were a politician and somebody gave lots and lots of money, you know, the natural instinct when they called you, I always tell the story about the Ford plant, right?","You know, they're building a plant $2.5 billion, closing other plants, obviously, for this one. And you know when some president is here, they got a lot of money from whether it's Ford or their lobbyists or their special interests or one of the owners of a piece of the company. They're going to do pretty much what those people want because that's the way politicians work.","Me, I got to do what's right. I don't want Ford building in Mexico. I don't want. You know if you look at -- if you look at New England, New England has lost so much business to different places but to Mexico and to other places, which is a shame. It's a big shame. And we're going to bring it back. We're going to stop being the stupid people.","We're going to stop having stupid people represent us. We are not represented. We are not represented by people that are looking out for our interests or they have other problems. And who knows what those problems are. And personally, I don't care it's going to end. We have the greatest business people in the world.","They're going to rep -- I know who they are. Many of them. Some are phenomenal, some are good, some are OK. I know the good ones, I know the great ones, I know the ones that are going to represent us with China, I know the ones that are going to rep -- we're not going to lose $500 billion a year with China.","Think of it, $505 billion trade deficit. It's not going to happen folks. Not going to happen. They view us, they can't even believe I have a lot of friends from China. I have a lot of friends from China. I have the biggest bank in the world as a tenant of mine in one of my buildings. But I have a lot of friends from China.","They can't even believe they get away. You know they pay me millions of dollars for condos, I build the building, they give you checks -- you know I like China. It's great. The Bank of America building, I have a big chunk of that in San Francisco, 1290 Avenue of the Americas got from China. Look, we can do great with China but we don't have the right people.","We have hacks negotiate. We have people that don't know anything about business negotiating with the sharpest people you've ever seen. These guys don't play games, you know. These Chinese, they come in, boom, they want business, we want business. They're dealing with a bunch of babies. They're dealing with diplomats in some cases and they're good political hackses, right?","They're all political hacks, but we're dealing with people that don't have a clue even if they're honest, which maybe they are, maybe they're not. I don't really care because the job's not getting done either way, but we're dealing with people that truly don't have our best interests. And even if they did, they couldn't do anything about it. They're not smart enough, they're not tough enough, they're not cunning enough.","And we're going to change all that. We got to change it. We don't have a choice. I mean, you look at Mexico. You've lost a lot to Mexico. New Hampshire's lost a lot to Mexico, right? For what? For what? Some treaty that everyone's always wondered what the hell are we getting out of it. You lost. I see where they're converting factories into a apartments, but you know sometimes those factories, you know, you can only have so many apartments, you still need jobs, right?","It's wonderful. You build senior citizen, you build this, you build that. You got plenty empty. These jobs have gone to Mexico. They've gone to other places. We're going to bring those jobs back folks. We're bringing them back. We're going to bring them back. So we're lowering our tax rates, big for the middle income people.","But I mean, the middle income people have been decimated in this country. The middle income people built America, OK? They are being decimated. Between them and our veterans, there are two groups that are treated so badly. So I'm lowering the tax rates big, I'm lowering them for business because business is leaving.","You know you have corporate inversions where businesses are leaving the United States. Pfizer, right. Pfizer is leaving the United States. Massive company, big -- OK, I won't say it. Shout that out once more, go. See, I didn't say it. Do they make Viagra?","Is it Pfizer? Oh, that's funny. This guy's a comedian. I didn't say it, I didn't say it. See, if I said that it would be a headline tomorrow. Isn't that terrible? Isn't that terrible? Unbelievable. That was very good, though. I did. I wanted you to speak. You know it's called freedom of speech, right? Right?","We had to give him. Only in New Hampshire can this happen only. Very good. Go ahead, shout it out, shout it out, tell me. What did you -- Oh that's right. Oh that's right. You know he's right. I have to admonish you because otherwise, I'll be criticized by the press. You are hereby admonished, OK? It's funny, I have some good fans, over here.","No, that's right, I took a lot of heat when I was up here and somebody made some statements that were a little bit rough about somebody, about our president, and I said I wonder if our president would come to my defense. The answer is no. But I didn't -- you know the guy made a statement, he has made a statement.","I went on to the next one and the press said why didn't you admonish him? So from now on the person that made this statement -- so from now on when somebody says something like you just said I have to say your admonished, OK? I'll say you're admonished but we still love you, right? It's very funny actually.","So we're going to take back trade. We're going to bring back jobs. We're going to do so many things. So what happened is we had a terrible tragedy in Paris. Well, Paris isn't here. It's representing something. They are totally against, as you know, having guns in Paris. It's got probably the strictest gun laws anywhere in the world they say.","So who knows. But they were very strict. Paris and France very strict. So that means that the good people, the the law abiding people cannot have guns. But the bad guys, you can have as many guns as you can carry into the country, OK? No, but who's going to check you? Who's going to be able to fight. So these animals walked in and they just shot 130 people and somebody said to me, and many are injured so badly that they're going to die, and they're going to lead rough lives.","Badly, badly injured. But 130 people killed and if we would have had guns on the other side of the aisle, and we would have had somebody like like this guy, the Mr. Viagra over here. If we would have had guns, if he would have had a gun strapped to his ankle or his waist and if you, and you and a few of you would have had a few guns, would have been a whole different story, folks.","Would have been a whole different story. Would have been a whole different story. And so sad, it's so sad. And then you go over to California where you had the two young -- they call them the newlyweds, the press, the newlyweds, oh newlyweds? I don't think they're newly weds. So you know to radicalize people and they went in and they killed 14 people.","Again, a lot of people hurt, badly hurt, but killed 14 people. These are people that gave them wedding gifts and ceremonies and parties and celebrated with them. These are people they knew. There's something going on, folks. There's something and you go to a place like Brussels, you go to a place like Paris, you go to so many different places.","It's like, it's like they're in a different world now. There's bad stuff happening. There's bad stuff happening. Many cities. I mean, honestly many cities, many places. And so when I talked about radical Islamic terrorism, all the world, the whole world. Now the world's saying he might have a point. I don't have a -- I have a major point.","And what happens, I mean, we have a president, we have a president who does it -- who refuses to mention the term. Now why? Who knows? He won't say radical Islamic terrorism. There's nothing wrong with saying it. It's a problem. We're going to solve the problem. Hopefully, we're going to solve that problem.","But we have hatred out there. There is hatred that nobody can believe. We're going to solve the problem and you have to know the problem. You have to have somebody that will say, yeah, we do have a problem here. He won't say it. I don't understand. Does anybody know why he won't say it? Does anybody know?","Well, he won't say it. And and you know what? So I brought it up. I brought up illegal immigration. Then I brought up radical Islamic terror, and that's what it is. And it's a shame, it's a very sad thing. I have friends who are Muslim and who called me in some cases, not in all cases, I must be honest. But in some cases, and they said what you've done is an amazing service, and we never thought anybody would have the guts to do it. You've brought to the fore a problem that has to be solved.","It's got to be solved because the level of hatred is too much. When you have a Paris or when you have California, and when you have this shooting where they killed our five soldiers in the gun-free zones, by the way, gun-free zones. No good. How about gun-free zones -- how about this, gun-free zones on a military base.","One of the soldiers is one of the great marksmen, an extraordinary expert with weapons not allowed to have his gun, and this wacko walks in and kills five soldiers. These were all great soldiers. Kills five soldiers and it says gun-free zone. And when you say gun-free zone, you know what that is, that's like candy for a baby that's like here darling.","That's what it is. It's candy for a baby because these whack jobs, these sick, sick, horrible people. They hear gun-free that means they're not going to be shot at. They don't want to die. They don't want to die ever since they want to die, they don't want to die. Believe me, OK? They don't want to die. So what I'm saying is, we've got to change our ways.","We've got to be vigilant. We've got to be smart. And if we're not, we're not going to end up having the country anymore. We're just going to have one big mess and take a look at what's happening in Europe. Europe's got problems. I mean, people are talking literally, people are talking about revolution. You look at what's going on in Germany, we have millions of people pouring in and they're not assimilating.","And I don't know if they are going to assimilate, and they want Sharia law. Well, you tell the Germans that they want Sharia law. That's not so well with the Germans. And what Angela Merkel, what she's doing, nobody understands what's going on over there. What's going on? But you look at what's going with the migration and then we have President Obama wants to take it. He said 10,000. It's thousands and thousands.","It's not 10,000, in fact at the debate, the Democrat debate, they brought up 65,000, right? But then he's says 10, it's 10. It's just a little bigger. This could be the great Trojan horse of all time. We cannot allow it to happen. These people are coming. We don't know where they are from. They have no papers, they have no one.","I've been watching law experts, I spoke to a couple. There is no way you can tell where they are coming from. They're young, they're strong. You look at that migration line, you see so many young strong men. You say why aren't they back fighting for their country? What's going on here? And you know, if you look at Germany on New Year's Eve, did you see all the crime and the rape and the problems.","I mean, it was all over the world. What are we doing, folks? What are we doing? So I say this, I like the idea you build a safe zone in Syria. We put up some money, we have to get the Gulf states, have so much money, so much money. We have to get the Gulf states put up money. We can even lead it, but I don't want to put up the money.","We don't have any money. We owe $19 trillion. We don't have any money. We're always putting up money. We'll get other people to put up money. We'll get other people to put up money, and we'll put something up because you know what? From a human standpoint, it's a terrible thing. You look at that migration, it's a terrible thing.","But we can't take a chance. Somebody said, well, it could be 10%, it could be 24%, maybe it's only 7%. Can you imagine? supposing we take in 50,000 -- 60,000 or 70,000 people and you're talking about 7% or 10%, that's 7000 people. Look what two people did in California. Look what two people did. So we can't do this anymore.","We have to run our country tough and smart, and we have to run it with heart. We have to save Social Security we have to do a lot of things, but we're going to save Medicare. We're going to save Social Security. We're going to do a lot of things. We're going to do a lot of things. But, but we need leadership.","We don't have a leader right now. We don't have and we haven't had for a long time, frankly. And you know what? And we have President Trump, I love this guy. Here's a friendly crowd tonight. I'll tell you what. Well, I can tell you one thing, we're going to be out there and some of it. Like for instance, drugs with Medicare they don't bid them out.","They don't bid them. They pay like this wholesale incredible number, hundreds of -- they say like $300 billion could be saved, if we bid them out. We don't do it. Why? Because of the drug companies, folks. You take a look at the drug companies. Take a look at Johnson & Johnson. Take a look at Pfizer. They're leaving us and we're still not doing anything.","Hey, we're leaving, by the way, don't dare negotiate drugs, right? Excuse me, excuse me, but we have so many instances like that. That's one instance hundreds of billions of dollars. We don't bid it out. We bid it out in Trump but we don't bid it out with politicians because they don't even know what it means to bid out.","And you know so many things have happened over the last week, Sarah Palin endorsed me who is a wonderful woman, wonderful woman. And Willie endorsed us. Willie so -- what a great guy. Duck Dynasty. He was great. What a good guy. And he's a friend of my son Don and he's a great guy. And Sarah Palin though came out and everyone thought she was going to endorse Cruz and she endorsed him for Texas, and she likes Trump better.","She likes what we're doing. I mean, it's amazing thing and she came out and she was terrific, and she was -- she's just a very, very, fine woman and a loyal woman, and she's smart, and I love that she -- I love that she did it. I love that she did it. One other thing I'll talk to you about. You know, so you see some of these foolish people that you know, right?","And they talk about Donald Trump is in favor of eminent domain. You know what eminent domain? Most people don't even know. They think it's a wonderful commercial. Eminent domain. All these people. Well, eminent domain is it's a taking, it's taking, but it's not a taking where you don't get money. It's to take away and you make a fortune.","If they take your property for a road or a highway, they pay you a fortune. They don't say that. They leave little things like this out of the edge because Ted did an ad, and I think Jeb did an ad in a couple of other people did an ad, and it was amazing. One group comes into my office, they're like so a conservative think tank.","And they come in and they ask me for $1 million. Remember the story? They said we'd like -- could you contribute $1 million? It's $1 million, I don't even know who you are. Who are you? What do you do? You know, you can be rich but you don't want to be stupid, right? All of a sudden they start hitting me with eminent domain ads and I'm saying do people even know what eminent domain is? So eminent domain is where you take the land and you pay the people that have the land so you can build little things like highways and roads to your towns and schools and hospitals.","And by the way, pipelines and you know the one thing that's sort of funny about eminent domain because they attacked me recently with an ad, Donald Trump is in favor of eminent domain and loves eminent. I don't love eminent domain but you won't have a country, you won't have any road, you wouldn't have any railroad tracks, you wouldn't have anything, but it was sort of funny because I looked at eminent domain and they're all for -- all these conservatives are for the Keystone Pipeline.","And so am I, I like the Keystone Pipeline. I'd make a different deal. No, but wait. The politicians are for it. The you know, conservatives and Republicans, generally are for it. A lot of the Democrats are for it. What do we have to lose? It's thousands and thousands of jobs of putting something under the ground.","Who the hell cares? Frankly, it's more fear. We never want to be under the guise of OPEC again. We never want to be under that. So it's fine. But, but you wouldn't have 10 feet of that pipeline if it weren't for eminent domain because that pipeline goes from Canada, the birthplace of Ted Cruz. He was born there and now he goes all the way to Texas.","Maybe as a conflict of interest, that's interest. This actually goes from Canada that's interesting. Hey, goes from Canada to Texas where he's decided. I don't know. Is there something going on there? So anyway, but it goes from Canada to Texas. Now during that, you're going through the backyards of farms, you're going through the front yard of a house, you going through different places.","They have a whole section on eminent domain. What it means, how we're going to use it judiciously. You couldn't have a pipeline, you couldn't have a road, you couldn't have a highway, you couldn't have anything. And I'm being attacked by him about eminent domain. Give me a break. You understand how stupid it is, how crazy it is. It's been such an interesting journey.","It's been a journey where -- and I tell this to people just like this group tonight, no matter where I go, whether I go to Texas, whether I go to Los Angeles, no matter where I go, Florida, Florida came out 48% for Trump. I mean, no matter where I go, the people have the same almost identical spirit. It's incredible.","They asked me what's the difference between New Hampshire people that are in New Hampshire and live here, and people in other places. I said I want to tell you, these are all amazing people. They want what's good for the country. They want strong services. They want a strong military. They want their veterans taken care of. I want my veterans taken care of. They want to have borders.","We want borders. We want to have a country without borders, you don't have a country. We want to terminate Obamacare and come out with something that's so much better. So much better. Almost everybody, other than Jeb Bush, everybody wants to get rid of Common Core. I don't want my kids educated from Washington.","Costs a fortune. You know, in the world of education, we are ranked number 28 in the world. We have third world countries that do better than us in education. Third world countries, right? we're ranked number 28 and yet, in terms of per pupil cost we're No. 1 by a factor like you wouldn't even believe. So far ahead of everybody else.","So we spend the most and we get the least and it's Common Core. A lot of it comes out of Washington where you have bureaucrats making 250, 350, you make a lot of money. And some of them do care but a lot of them don't care about the kids. They don't care about your kids in New Hampshire. They just want to make their money.","We want to bring it. I've seen it local where the parents are involved even when their kids graduate from school and they go to -- the parents stay involved. They're in love with the place. They do so good. It's love, not money, it's love. Most of them don't even get paid. They want to do it and we can make our educational system so good.","But we spend the most and we're at the bottom of the pack. I mean, think of it. It's terrible. It's terrible. And you know I bring this up and I'll make a sort of a last point because I think it's sort of cool, frankly. So the campaign goes on and I start focusing very much on ISIS and on all of these different things and then CNN did some polls and so did others where Trump is No. 1 with ISIS by far, No. 1 with security, No. 1 with the military, No. 1 with the economy.","That was an easy one that you'd expect, but No. 1 with all these other things. And I think a lot of that led because I'm so strong on the border because we want protection for our people and I'm very strong on the border. But you look at all of these different things and what I sort of love, the campaign.","I've spent less money than anybody else practically, essentially, almost no ads until recently. And I -- you know and the only reason recently, I really didn't do anything but I feel guilty, I do. When you see a schlub like Bush spending $100 million, $100 million, and then he brings his mother, who is a very nice woman by the way, but he brings his mother out and I say Jeb Your mother's not going to help you negotiate with China.","She's not going to help. She can't help. And she's not going to help you with ISIS, Jeb. But think of it. Here's a guy who's probably by now spent a $100 million and he's going down, and I've spent nothing and I'm in no one place. Wouldn't it be by far. By a lot. But think of this, this isn't even meant to be insulting.","Wouldn't it be nice if we had a country where we spent less and had great results instead of spending most and having the worst result, right? Wouldn't that be nice. Wouldn't that be nice. And we're going to have it. Now, here's the thing and I am usually by saying this or something like this, but our whole theme is Make America Great Again, right?","But the problem is we don't win. We lost on the Iran deal. We lose on everything. We lose on everything. We can't even beat ISIS. Can you imagine General Douglas MacArthur whom -- can you imagine General George Patton, you know, he was so rough. People didn't even like to look him in the eye. General George Patton, can you imagine him?","I watch these generals on talk shows, they're on talk shows, talking about how -- what do you think of ISIS. One of the generals who just retired, he was on one of those shows, and they said what do you think of ISIS? Oh, they're tough. There's something like 30,000 people in ISIS. They're tough. I said to myself do you think General George Patton -- first of all he wouldn't have been on a talk show, OK? He wouldn't have been on a talk show.","But do you think General George Patton would have been saying how tough they are? You know what you do, you embolden them when you start talking that way. There's one of our top people, I guess he was retiring or retired, and he said they're tough. Another one who just retired, General Odierno, he's a good man, I think.","But he said we're the least prepared, preparedness. He thinks maybe ever. I watched and I said maybe he meant from the second World War. I think it said forever, for you know, from almost the beginning with our preparedness. And I see that, I see that. Our military is just, it's horrible what's happening to us. We're being beaten at every front.","We can't have it. So when I see a general George Patton and I look at and I read the books and I love that and I love General MacArthur in terms of the modern day generals. We had some great ones and then I see these guys talking about ISIS. They would be wiped out so fast your head would spin. By the time you walk to the main door, it would be over.","It would be over. So we're going to make our country strong again. And we're going to make our military powerful again. And you know, if we do that, and let me tell you, a lot of people so that's going to take a lot of money. It's actually the cheapest thing we can do. No. 1 it guarantees that we are going to be around for a long time.","But it's the smartest thing we can do. It's the cheapest thing we can do because nobody is going to mess with us. Nobody is going to mess with us. That's the way we have to have it. And here's the thing. We don't win, but we're going to win. We're going to win so much. We're going to win on healthcare. We're going to win with China.","We're going to win with Japan. We're going to win with Mexico. We're going to win and win and win. And sometimes I kid, I say you're going to get so tired of winning you're going to say, Mr. President, please let's lose just a little bit, and I'll say no, we're going to make our country great again. We're going to keep winning and winning.","So we are going to win and we are going to make America great again. Thank you all. Thank you."],"text":" Young, young people, young people. Beautiful. Good evening. We love New Hampshire. Good evening. February 9th, we have to go out and vote. We got to do it. We have to bring it home, right? We got to bring it home. So we're getting down now to crunch time. You know this is now crunch time, right? And we're having a lot of good signs and New Hampshire has been so amazing. From day one, we've done great up here, from day one. And -- I was yesterday -- thank you, honey. I love you too. Thank you. Thank you. And so important, honestly, we just have to bring it home. We have to have a mandate. We have to do well. We have to get big numbers and we've got to send even the world a signal because we're together, we're unified. The people we have, this is a movement. I don't know if you've been reading like Time Magazine, the cover of Time magazine, it's a movement, what's going on. People love this country so much and they want to bring it back. And we're going to bring it back. We're going to bring it back. We just had, you know I have to tell you this, I love talking about it and I've made pollsters very famous actually. But when you're No. 1, you always like to talk about it, right? So Zogby just comment at national poll, 45 to 13. Can you believe that one? I don't believe it even, I mean some are. Maybe I should say let's make it close. Everybody's got to get out. You've got to get out and vote. Don't worry about polls because there's only one poll that count. You know what that is. February 9th for you people, right? February 1st for Iowa, February 9th for you. In New Hampshire, Trump, 33. This is Franklin Pierce. We all know Franklin Pierce. Then you have Cruz, Kasich in a -- oh, boy poor Bush. You guys spent $100 million. What is he doing? What is he doing wasting all that? Such a waste. Such a waste of money isn't it? What is he doing, that poor guy? Oh, we just -- we got another one in Iowa American Research 33, 26. Boston Herald just came out 33, 14. I mean they're just one after another. Florida, how about this one, Trump, 48 the you have Rubio at 11 and you have Governor Bush down much lower than that envelope. The Monmouth -- he's low energy, he's right. Monmouth poll, 36 to 17, can you imagine that? The Morning Consult, 39 to Cruz, 13 to Rubio, nine -- wow, I love this. Reuters 40.6 to 10.2 to 9.7. So you know, I mean it makes us all feel good but we've got to get that vote, I mean because who knows. I've seen bad things happen in life, you know. You take things for granted. That's why, in one way, these polls have gone so crazy and so positive that I hate to tell them, gee. Because I want you to go out. You got to go out. I want to bring this country back so strongly, so good we can do it. See the hats, all the hats, make America -- right? Make America Great Again. And that's what we're going to do. That's what we're going to do. You know it's very interesting. So over the last few months, five months, six months now, June 16th, that was a very, very difficult thing. You know it takes guts to go and run for president, OK? It's tough. Believe me. I don't do this for a living. I build buildings and I do a lot of things and I create tens of thousands of jobs over the year. Tens of thousands of jobs. And I love doing it. You know I love what I'm doing. I love my wife, I have a great family, I have wonderful -- I built a tremendous company that's been really good. In fact, when I filed my papers, everyone went down to check out the company and they said, wow, this is really a good company. Very low debt. Some of the great assets of the world. Some of the great real estate assets, any in the world -- anywhere in the world. You look at Trump National Doral in Miami or Turnberry. You take a look at Turnberry in Scotland where they played the British Open, now called the Open Championship, the biggest golf tournament, and so many others. We have so many, so many buildings in Manhattan. 40 Wall Street, Trump Tower, a lot. The Nike, Nike Town, all these different things, and I love what I was doing, and I loved it but I watched and I saw and I looked, like you, like everybody, what is going on with our country? I'd see the deals that are made. I'd see a Sergeant Bergdahl where Sergeant Bergdahl would be. He was a traitor, right? And yet for Sergeant Bergdahl we gave them, how many guys? Five, right? Five. We gave him five people that they wanted so desperately and people were killed, five or six people were killed going out looking for Sergeant Bergdahl. And you see the parents of those young kids, those great young soldiers and you see him on television. It's just like devastating. And in the old days there would have been very big repercussions. Today, who the hell knows, probably won't get anything. It's unbelievable what's going on in the country. Then you look at the Iran deal where we give $150 billion dollars. Now think of it, it's so sad. I mean, when you look at that deal, and that deal epitomizes what the United States is all about now, we don't win anymore. You know, we used to win, right? We'd have a country and we'd win, and we don't win anymore. We don't go and we don't do and we should win. We have some of the great negotiators, we have the best business people, we have the best business people in the world, best businessmen, best business women I know so many of them. Instead, to negotiate with China, who do we use? Political hacks. We use people that gave campaign contributions to represent us with different countries and probably, who the hell knows, they probably have an interest in making bad deals. I mean, you don't even know anymore in this country. You don't even know, you don't know what's going on. And some of the deals are so bad that it's not that our people are that incompetent, believe me, this dishonesty, you look at these people that are raising all of the money, I'm self funding my campaign, I'm putting up all my own money which I think is important. I mean, nobody, no lobbyist is going to say, I gave you $5 million, you have to come through for me. None of that -- I don't -- hey, I was on the other side of the table. I was a big contributor for years and I was totally, I mean, I guess I was establishment. Now I'm not an establishment, OK? But you know, it's sort of interesting because we're competing against a lot of different people. We started off with 17, rapidly disappearing, OK? Fortunately for all of you, I've to tell you because you don't want to you know what I know. And these people -- but we have some -- and we have some very good people. I mean, I have to tell you, I, on stage, I've gotten to know and I really like some of the people. I hate criticizing some of them actually. But you look at what's going on where a guy like Bush raises $128 million and then he takes ads. The ads about me, constant ads coming on about me, and my poll keeps going up and he keeps going down. Explain it. No, explain it. Low energy, low energy. We don't need low energy people. And I keep saying, you know, I'd never even talked. He's so low in the poll, I would never talk to him. But, I mean, why would I talk about the guy except he takes so many ads about me and he said today and told me, I'm the only one that attacks Donald Trump. Oh, big deal. Big deal. He thinks he's going to get point. First, he attacks and loses. He doesn't win. But it's sort of -- it's sort of an amazing thing. And you know my new battle is with a gentleman named Ted Cruz because you got to speak the truth. You've got to speak the truth. The Canadian, the man from Canada. Thank you, that was very helpful. I don't know. That's so succinct. That was very good. The accent is it screams out the Canadian. Yeah, that's right, the Canadian. He could run right now for Prime Minister of Canada. He'd never have no problem. But he does have a problem. I mean, does anyone agree with me on this because it seems -- Right? How do you -- OK. So you have a constitution, you have very strong, you know, all your life you're here, you have to be born in this country, born in this country. He's born in Canada on Canadian soil. And, I mean, come on. Then what happens is from Harvard, you know who I'm talking about, very talented lawyer, Laurence Tribe, very top, top constitutional lawyer. He comes out, he says it's totally untested law and then other lawyers come out said not untested, he can't do it. You can't do that if you're born in a different place. I mean like John McCain was born on a military base outside of the United States. I fully understand that. To two parents, by the way, that we're American citizens. Big difference. You know, military base and to parents who were actually in the armed forces but -- so that's a lot different. But you know in the case of -- in the case of Ted Cruz, he was born on Canadian soil. So what do you do? You have to go to court and you have to get a declaratory judgment or you have to get something. Now he's already being sued by two groups. I hear Illinois is saying, we don't think we're going to approve you. Now maybe they will, maybe they won't. Big state, very powerful state. A lot of voters. Got to get on the ballot, right? How do you approve somebody who can't get on the ballot? How do you approve somebody -- how do you as an example, let's say he's the nominee and he goes and you know the first week or probably the first day the Democrats are going to sue, they've already said they're going to sue. So they're going to sue. Now he has a cloud over his head. It's like a cloud on title in real estate. You got a cloud. You don't know and you won't know until you get to the court and probably or possibly the Supreme Court of the United States. That takes a long time. So I mentioned this. And then of course he comes out with his loans and he's, you know, he's Robinhood. He's Mr. Robinhood and he's going to protect you from the horrible Wall Street bankers. And in his financial disclosure he didn't report. He didn't report. I don't know why. I think I know why but I won't say it, but he didn't report that he's got loans from Goldman Sachs and Citi, and actually Citi came after and he had $1 million that he had very low interest loans. And number 1, Goldman Sachs has him and Citi hasn't. Supposing Citi Bank or Goldman Sachs calls up and they say, listen, we'd like you to do this. We'd like you -- he's going to do it. That's the nice part about what I'm doing. That's the nice part. Nobody, nobody is giving me anything. These politicians. These politicians, all talk no action. It doesn't get done. But a lot of the things you see, what you think are stupid aren't so stupid because those companies that are making these great deal and, frankly, the countries that are making the great deals, the countries. They're represented by people that gave a lot of money to Hillary and Jeb and -- and Ted and all of them, all of them. They're representing -- I mean, you look at some of the people that are giving them money, these people don't care about our candidates. They care about what our candidate is going to do for them, not for the country, but for them. So I'm the only one that's funding my own campaign on either side whether it be Democrat or Republican, which makes me feel a little bit lonely. And it makes me feel a little bit foolish in many ways. My whole life has been about taking. See, I'm telling the young kids, I want to take. I'm greedy. I want to take, take. My whole life has been taking and now what am I going to do? I'm going to take and I'm going to be greedy for the United States of America. So to take, take. And we're going to help our military and we're going to build a strong and powerful and big, and beautiful military. We're going to rebuild that and it's going to be great. It's going to be great. And nobody's going to mess with us and hopefully we'll never have to use it because nobody is going to want to mess with us, but we don't do that right now. Our military is being decimated. It's being decimated. We have trucks and we have ammo and we have rifles and we have all this stuff gets shipped to our enemies and, you know ,our enemies take it. I don't know if you know that because as soon as they fire a bullet up in the air, you've heard it, the people that we gave it to, they run. They drop everything, they run for the hills, right? 2300 Humvees. This is the thing that gets me because I say that's so much. How many ships does it take? 2,300 brand new armor-plated Humvees. Now if you think about that, we have wounded warriors, our greatest people. These people have the best attitude, the best attitude. They lost their legs or they lost their arms or they lost both or they lost worse. And their attitude -- and you see him and I see him and they're smiling and, I mean, these are amazing people not being taken care of properly by the Veterans Administration. We're going to make sure that is solved, our veterans General. But but think of this, 2,300 Humvees, armor-plated, now the ones that our guys became wounded warriors driving around in because a bomb goes off underneath and it was like driving around in a regular Jeep or a regular car. I mean, these things are incredible. So they're over there. The enemy has them. And the young soldier, the son of a friend of mine came back. He's been there three tours and he came back and he said, you know what's sad, Mr. Trump, the enemies had better equipment than we do. It's our equipment. They take it, they take it. We give them to these people that we don't even know who the hell they are. You know, people fighting for us, insurgents, all these people, they're fighting for us, right? They call them revolutionary this and, you know, all people we think it's good they have nice names. And what are we doing, folks? What are we doing? Why, why are we so stupid? Why are we so incompetent? Why do we allow these things to happen? This is a young -- Obama? Well, it is. It is. Look, we shouldn't have gotten in. We shouldn't have gotten in. And I was against it. And you have to give credit for vision. We should have never been in Iraq. You know, think of it. So in 2003, 2004, Reuters, they wrote an article Trump is totally opposed to the war. Now a lot of people say temperament, you know, temperament. I was going to say dummy Bush but I refuse to say. Bush, he said I don't like his tone. Tone, they're cutting off people's heads all over the place and he's worried about tone. They're cutting off Christians heads in the Middle East and were worried about tone. But you know, they say, does he have the right temperament? I have a great time. You know, I built this incredible company, incredible. I have a great temperament. I have an unbelievable temperament. Somebody said the other day, he's angry. Nikki Haley, a wonderful woman, I've supported her. I support her, but she -- in her speech she said she was referring to me, she said this. She said I'm angry and they asked me at the last debate. Who won the last debate by the way? But they asked me last week that, you know, Nikki said you are angry and I never thought of it, but I said you know what I am angry. I'm angry about ISIS. We can't beat them. I'm angry about the border. I'm angry about the fact we're not putting up a wall. We will put up a wall by the way. We will put up a wall and Mexico is going to pay, right? Mexico's got to pay. Hey look, Mexico's going to pay for the wall, they'll make a fortune. Look at the trade deficit that we have with Mexico. I'm not even talking about all the drugs that are pouring across the border. That's, you know, that's in addition to. Look at the trade deficit that we have with Mexico. It's ridiculous, OK? So these politicians come up, they say Donald, I understand the wall. Actually Ted just came out a couple of days ago. My wife was watching, she said, darling, he just said he wants to build a wall. He never said that. I never heard him say it. Maybe he did. Did he ever say that? All of a sudden these politicians are coming out. We will build a wall. Number one, they wouldn't know where to start. Number two, it'll never get built. And guys like Ted were for amnesty and they're weak. Now all of a sudden they're trying to strengthen up. I will say this, when I announced that I was running, when I announced I brought up illegal immigration. Nobody ever talked about it. Now it's like a mainstay and you have a tremendous problem up here. Of all the people you would think in New Hampshire you wouldn't have this problem, but you have a tremendous amount of drugs pouring in. Is that right? I get more questions, I get more question -- when I come to New Hampshire. You know you start to see it that way. You could see some areas may be where you would think it but not in New Hampshire. And yet the question I get just about No. 1 when I come up to New Hampshire are the drugs that are pouring in. It's incredible. I don't know why. I don't know what it is, but they're coming across the southern border. And we're going to stop it. We're going to stop it and we're going to try, we're going to try and help the young people and the old people and the middle aged people and everybody that got addicted because they're addicted and we can get them off it. It's tough though, it's tough. What's much easier if we could just stop it where they don't start and we can talk to people and talk to the kids and say don't do it. Don't do it, you'll be hooked and you'll destroy yourselves. Don't do it because you know it's, it's easy not to do it. It's easy not to do it if you never start, right? It's easy. There's nothing. I mean if you offered me that stuff I'd say you, uh,forget it. Who wants it? But if you're addicted to it it's a very tough thing. I've known some very tough, very smart people. You get addicted to it. It's a very tough thing. So we're going to clog that up. We're going to stop it. We're going to help the people that have the problem and try and get them off it and we can do that. And it's hard, it's hard, but we're going to do that. But what really is easy is to convince everybody, don't take it. And what's really the best is, don't make it available. Right now it's so damn available, people take it. So we're not going to make it available. And you know where it comes from. So Cruz has a lot of problems, I think, and we'll see, but you know the last poll that just came out it's like amazing in Iowa. I went way up. He went way down. He's falling. He's nervous. He's concerned. And he should be, you know. It was interesting, a magazine which is a failing magazine, National Review. You've probably -- and not to -- Terrible, but they did something that was I think quite stupid. They came out these 20 -- one guy came up asking me for money. For he's got some deal and wants money. Another one wants me to be on his radio show and I couldn't do it, I just could do it, the show. Glenn Beck calling, show, be on my show be, on my show. Guy, every time I see him he's a weird guy. He's always crying. He's always -- he's a weird dude. His show is failing by the way, so is his deal. So he gets fired, he gets fired from Fox and you know what, I'm not blaming him really because he gets fired from Fox, has a show starts. Everyone thought it's going to be good. It's the total -- it looks like it's a bomb, OK? but that's OK. He wants me to be the show. I would -- I would have done it actually, but I couldn't because of time and everything else. And then you know, you go to No.1 and then you people start thinking, this is true with everybody, you people start thinking how great we are. No good. I don't think how great I am. But people maybe they say, and they make it a little bit harder for him, all of a sudden he starts blasting me. Then once you blast I don't want to go on the show anymore, right? So he blast. If I would have done the show I'd have no problem, but because I didn't do a show, he went -- he writes a little article. So you got all these different people, 22 people, and a guy wrote something. I -- should I read it real quick? Quickly, I'm going to read it, all right? Doug Ibendahl, and I thought it was amazing, he wrote it very negative to the net -- to the National Review. Again, National Review is a magazine that I think is going to be out of business very soon. It's doing so badly. I don't think it's got any influence anymore. They got a little publicity but I think it was better for me. Here's what he writes. So clueless is the gang of 22, these are the writers, they can't even see how they've stumbled right into the narrative Trump's been communicating so successfully for months. I have been communicating. We have definitely been communicating, right? Just like the elected officials from both parties, the gang of 22 has been great at complaining about stuff year after year after year. But getting anything accomplished, not so much. In other words, they complain and they talk and they talk. They don't do anything. Many of the gang of 22 have been hanging around and chatting for decades and some are active cogs, right? And the conservative entertainment complex deriving their income by pandering to conservative anger while offering no real solutions, right? They never tell you what to do. They say, are you conservative? Are you this? They have no idea. I don't even think they know what it means. Donald Trump represents a threat to these ineffectual poo-bahs in the same way he represents a threat to do nothing. Public officials of which we do have plenty. Jealousy is also seriously at work here. Trump is inspiring and exciting a broad spectrum of the country like no member of the gang of 22 ever has or ever will. You have to see the crowds we have like this is a packed house, every single place we go to, we were in Oklahoma the other day, we filled up a stadium, we had to send away from 5,000 to 7,000 people. No matter where we go. I mean, we have, we have people last night and by the way this week in Iowa, we were just absolutely every single place they have, you know, staging areas where the people they can't get into the main room are put into another room and it's like the whole thing is unbelievable. So we really have, what? It is a movement, man. I like that guy. It is , I mean, it's a movement. We want to take our country back. So seven months of campaigning, Trump has already more Americans listening which is true to the Republican message in the entire gang of 22 could muster over decades and decades and decades. Trump understands that before you can advance the ball you have to convince people to take time from their busy lives to listen. No one on the GOP side since Ronald Reagan, great guy, has accomplished that like Trump which is very nice. Obviously, this gentleman likes. And actually no one else has come close and certainly no one from the effete corps of impudent stops to which the National Review thinks we should defer the gang of 22 had their chance, which is true. They've been talking for years. They talk and talk. They're worse than politicians, OK? Maybe not. The gang of 22 had their chance of it long time. They've done a lot of bitching over the years and it's paid well for some. Some of these guys make a couple of bucks. But Americans care about results. We're result-oriented, right? They can plainly see all of this is empty talk, at the same time when Americans look at Donald Trump's life, they get a lot of assurance that here is finally a man who shares their focus and actually wants to get results and is getting results. I've done a good job, what can I tell you. Built a great business, many great selling books including The Art of the Deal which is just about, I guess, it should be the No. 1 best selling business book of all time. The Apprentice was this tremendous success. They want to sign me up for a long time. I said I couldn't do it because I'm running for president along with other things. And Trump, we charge the respect by recognizing regular hard working Americans who are a lot smarter than any of their ideological eunuchs in all their pontificating glory. So just to finish. Isn't it true though? This guy writes so big. I love what he's write, maybe because it's a positive. If it was a negative I don't think -- what voters are looking for this year is competence and accomplishment. They really are. We're looking for competence, right? We're looking for -- we want smart. We want to be the smart people again not the dummies that we've been for years with the Iran deal and all of these horrible deals, our trade deals with China. Donald Trump has an actual record of delivering both in spades. The gang of 22 is right to be terrified. A president who could get things done would expose them as the irrelevant creatures they truly are. It can't happen fast enough. I thought that was really -- right? I, honestly, I thought it was good. I thought the way he wrote it and it's right, it's right. I mean these people, I never like critics. I watched Broadway plays and I'd see a play that's good. And then next day you wake up and you see the New York Times critic going to write about the Broadway play and they'll say horrible things. The actress was no good and then this. Maybe sometimes they're right sometimes they're wrong. But I always say they can't do it themselves, you know. I like being a critic only like I'm being a critic, a big critic of Obama. He's done a terrible job but we're going to fix things. We're not going to just criticize. We want to fix it and we want to be -- you want me to fire him? Maybe we'll save it for a more appropriate time, OK? Maybe worst thing, but you know what, we will -- I'll tell you what, we're going to make you so proud. We're going to make you so happy with what's going on. We are going to make you so happy. But I thought that article was amazing because here you have people that really criticize. We have to get critics, but we have to get critics that know how to fix things. So when I started on June 16th coming down that escalator, remember the famous escalator ride, it did take courage and I looked downstairs and it looked like the Academy Awards. There were so many cam. Look at all of them back there even tonight. Look, all of these guys and there were so many cameras downstairs. You've never seen anything like it. And I said boy, I said to my wife, come on let's do it. And I took a deep breath. I got on the escalator. I rode it down and I started talking about illegal immigration, a lot of things, took a lot of heat for a couple of weeks and then people started saying he's right, he's right. And then you had Kate killed in San Francisco, shot in the back by a illegal immigrant who should have never been here. And you had Jamiel in Los Angeles, a young man going to college, getting ready to just start college. Good athlete, great father, he was a friend of mine and he was killed, shot in the face three or four times in the face and for no reason, walking home to his father. And so many others, the veteran, 65-year old veteran who was raped, sodomized and killed ,who is supposed to be a wonderful woman, by an illegal immigrant. And so many others, by the way those are three examples. But so many others and they also look at the economics of it. What's happening economically. And I said we have to do something and all of a sudden everybody's saying, well, Trump's right. Trump's right. Now they're trying to get so tough, so tough. They were all weak as hell. Now they're tough guys all of a sudden, but as soon as their donors and special interests and the lobbyists go to them, they're going to immediately fold, you know that, everybody knows that they fold. That's what they are. Politicians always fold. Just remember that they will fold. And then I brought up -- not me, not me. No, I don't fold. I don't fold. I don't fold. There's no reason for me. I will tell you if somebody gave me lots of money and if I were a politician and somebody gave lots and lots of money, you know, the natural instinct when they called you, I always tell the story about the Ford plant, right? You know, they're building a plant $2.5 billion, closing other plants, obviously, for this one. And you know when some president is here, they got a lot of money from whether it's Ford or their lobbyists or their special interests or one of the owners of a piece of the company. They're going to do pretty much what those people want because that's the way politicians work. Me, I got to do what's right. I don't want Ford building in Mexico. I don't want. You know if you look at -- if you look at New England, New England has lost so much business to different places but to Mexico and to other places, which is a shame. It's a big shame. And we're going to bring it back. We're going to stop being the stupid people. We're going to stop having stupid people represent us. We are not represented. We are not represented by people that are looking out for our interests or they have other problems. And who knows what those problems are. And personally, I don't care it's going to end. We have the greatest business people in the world. They're going to rep -- I know who they are. Many of them. Some are phenomenal, some are good, some are OK. I know the good ones, I know the great ones, I know the ones that are going to represent us with China, I know the ones that are going to rep -- we're not going to lose $500 billion a year with China. Think of it, $505 billion trade deficit. It's not going to happen folks. Not going to happen. They view us, they can't even believe I have a lot of friends from China. I have a lot of friends from China. I have the biggest bank in the world as a tenant of mine in one of my buildings. But I have a lot of friends from China. They can't even believe they get away. You know they pay me millions of dollars for condos, I build the building, they give you checks -- you know I like China. It's great. The Bank of America building, I have a big chunk of that in San Francisco, 1290 Avenue of the Americas got from China. Look, we can do great with China but we don't have the right people. We have hacks negotiate. We have people that don't know anything about business negotiating with the sharpest people you've ever seen. These guys don't play games, you know. These Chinese, they come in, boom, they want business, we want business. They're dealing with a bunch of babies. They're dealing with diplomats in some cases and they're good political hackses, right? They're all political hacks, but we're dealing with people that don't have a clue even if they're honest, which maybe they are, maybe they're not. I don't really care because the job's not getting done either way, but we're dealing with people that truly don't have our best interests. And even if they did, they couldn't do anything about it. They're not smart enough, they're not tough enough, they're not cunning enough. And we're going to change all that. We got to change it. We don't have a choice. I mean, you look at Mexico. You've lost a lot to Mexico. New Hampshire's lost a lot to Mexico, right? For what? For what? Some treaty that everyone's always wondered what the hell are we getting out of it. You lost. I see where they're converting factories into a apartments, but you know sometimes those factories, you know, you can only have so many apartments, you still need jobs, right? It's wonderful. You build senior citizen, you build this, you build that. You got plenty empty. These jobs have gone to Mexico. They've gone to other places. We're going to bring those jobs back folks. We're bringing them back. We're going to bring them back. So we're lowering our tax rates, big for the middle income people. But I mean, the middle income people have been decimated in this country. The middle income people built America, OK? They are being decimated. Between them and our veterans, there are two groups that are treated so badly. So I'm lowering the tax rates big, I'm lowering them for business because business is leaving. You know you have corporate inversions where businesses are leaving the United States. Pfizer, right. Pfizer is leaving the United States. Massive company, big -- OK, I won't say it. Shout that out once more, go. See, I didn't say it. Do they make Viagra? Is it Pfizer? Oh, that's funny. This guy's a comedian. I didn't say it, I didn't say it. See, if I said that it would be a headline tomorrow. Isn't that terrible? Isn't that terrible? Unbelievable. That was very good, though. I did. I wanted you to speak. You know it's called freedom of speech, right? Right? We had to give him. Only in New Hampshire can this happen only. Very good. Go ahead, shout it out, shout it out, tell me. What did you -- Oh that's right. Oh that's right. You know he's right. I have to admonish you because otherwise, I'll be criticized by the press. You are hereby admonished, OK? It's funny, I have some good fans, over here. No, that's right, I took a lot of heat when I was up here and somebody made some statements that were a little bit rough about somebody, about our president, and I said I wonder if our president would come to my defense. The answer is no. But I didn't -- you know the guy made a statement, he has made a statement. I went on to the next one and the press said why didn't you admonish him? So from now on the person that made this statement -- so from now on when somebody says something like you just said I have to say your admonished, OK? I'll say you're admonished but we still love you, right? It's very funny actually. So we're going to take back trade. We're going to bring back jobs. We're going to do so many things. So what happened is we had a terrible tragedy in Paris. Well, Paris isn't here. It's representing something. They are totally against, as you know, having guns in Paris. It's got probably the strictest gun laws anywhere in the world they say. So who knows. But they were very strict. Paris and France very strict. So that means that the good people, the the law abiding people cannot have guns. But the bad guys, you can have as many guns as you can carry into the country, OK? No, but who's going to check you? Who's going to be able to fight. So these animals walked in and they just shot 130 people and somebody said to me, and many are injured so badly that they're going to die, and they're going to lead rough lives. Badly, badly injured. But 130 people killed and if we would have had guns on the other side of the aisle, and we would have had somebody like like this guy, the Mr. Viagra over here. If we would have had guns, if he would have had a gun strapped to his ankle or his waist and if you, and you and a few of you would have had a few guns, would have been a whole different story, folks. Would have been a whole different story. Would have been a whole different story. And so sad, it's so sad. And then you go over to California where you had the two young -- they call them the newlyweds, the press, the newlyweds, oh newlyweds? I don't think they're newly weds. So you know to radicalize people and they went in and they killed 14 people. Again, a lot of people hurt, badly hurt, but killed 14 people. These are people that gave them wedding gifts and ceremonies and parties and celebrated with them. These are people they knew. There's something going on, folks. There's something and you go to a place like Brussels, you go to a place like Paris, you go to so many different places. It's like, it's like they're in a different world now. There's bad stuff happening. There's bad stuff happening. Many cities. I mean, honestly many cities, many places. And so when I talked about radical Islamic terrorism, all the world, the whole world. Now the world's saying he might have a point. I don't have a -- I have a major point. And what happens, I mean, we have a president, we have a president who does it -- who refuses to mention the term. Now why? Who knows? He won't say radical Islamic terrorism. There's nothing wrong with saying it. It's a problem. We're going to solve the problem. Hopefully, we're going to solve that problem. But we have hatred out there. There is hatred that nobody can believe. We're going to solve the problem and you have to know the problem. You have to have somebody that will say, yeah, we do have a problem here. He won't say it. I don't understand. Does anybody know why he won't say it? Does anybody know? Well, he won't say it. And and you know what? So I brought it up. I brought up illegal immigration. Then I brought up radical Islamic terror, and that's what it is. And it's a shame, it's a very sad thing. I have friends who are Muslim and who called me in some cases, not in all cases, I must be honest. But in some cases, and they said what you've done is an amazing service, and we never thought anybody would have the guts to do it. You've brought to the fore a problem that has to be solved. It's got to be solved because the level of hatred is too much. When you have a Paris or when you have California, and when you have this shooting where they killed our five soldiers in the gun-free zones, by the way, gun-free zones. No good. How about gun-free zones -- how about this, gun-free zones on a military base. One of the soldiers is one of the great marksmen, an extraordinary expert with weapons not allowed to have his gun, and this wacko walks in and kills five soldiers. These were all great soldiers. Kills five soldiers and it says gun-free zone. And when you say gun-free zone, you know what that is, that's like candy for a baby that's like here darling. That's what it is. It's candy for a baby because these whack jobs, these sick, sick, horrible people. They hear gun-free that means they're not going to be shot at. They don't want to die. They don't want to die ever since they want to die, they don't want to die. Believe me, OK? They don't want to die. So what I'm saying is, we've got to change our ways. We've got to be vigilant. We've got to be smart. And if we're not, we're not going to end up having the country anymore. We're just going to have one big mess and take a look at what's happening in Europe. Europe's got problems. I mean, people are talking literally, people are talking about revolution. You look at what's going on in Germany, we have millions of people pouring in and they're not assimilating. And I don't know if they are going to assimilate, and they want Sharia law. Well, you tell the Germans that they want Sharia law. That's not so well with the Germans. And what Angela Merkel, what she's doing, nobody understands what's going on over there. What's going on? But you look at what's going with the migration and then we have President Obama wants to take it. He said 10,000. It's thousands and thousands. It's not 10,000, in fact at the debate, the Democrat debate, they brought up 65,000, right? But then he's says 10, it's 10. It's just a little bigger. This could be the great Trojan horse of all time. We cannot allow it to happen. These people are coming. We don't know where they are from. They have no papers, they have no one. I've been watching law experts, I spoke to a couple. There is no way you can tell where they are coming from. They're young, they're strong. You look at that migration line, you see so many young strong men. You say why aren't they back fighting for their country? What's going on here? And you know, if you look at Germany on New Year's Eve, did you see all the crime and the rape and the problems. I mean, it was all over the world. What are we doing, folks? What are we doing? So I say this, I like the idea you build a safe zone in Syria. We put up some money, we have to get the Gulf states, have so much money, so much money. We have to get the Gulf states put up money. We can even lead it, but I don't want to put up the money. We don't have any money. We owe $19 trillion. We don't have any money. We're always putting up money. We'll get other people to put up money. We'll get other people to put up money, and we'll put something up because you know what? From a human standpoint, it's a terrible thing. You look at that migration, it's a terrible thing. But we can't take a chance. Somebody said, well, it could be 10%, it could be 24%, maybe it's only 7%. Can you imagine? supposing we take in 50,000 -- 60,000 or 70,000 people and you're talking about 7% or 10%, that's 7000 people. Look what two people did in California. Look what two people did. So we can't do this anymore. We have to run our country tough and smart, and we have to run it with heart. We have to save Social Security we have to do a lot of things, but we're going to save Medicare. We're going to save Social Security. We're going to do a lot of things. We're going to do a lot of things. But, but we need leadership. We don't have a leader right now. We don't have and we haven't had for a long time, frankly. And you know what? And we have President Trump, I love this guy. Here's a friendly crowd tonight. I'll tell you what. Well, I can tell you one thing, we're going to be out there and some of it. Like for instance, drugs with Medicare they don't bid them out. They don't bid them. They pay like this wholesale incredible number, hundreds of -- they say like $300 billion could be saved, if we bid them out. We don't do it. Why? Because of the drug companies, folks. You take a look at the drug companies. Take a look at Johnson & Johnson. Take a look at Pfizer. They're leaving us and we're still not doing anything. Hey, we're leaving, by the way, don't dare negotiate drugs, right? Excuse me, excuse me, but we have so many instances like that. That's one instance hundreds of billions of dollars. We don't bid it out. We bid it out in Trump but we don't bid it out with politicians because they don't even know what it means to bid out. And you know so many things have happened over the last week, Sarah Palin endorsed me who is a wonderful woman, wonderful woman. And Willie endorsed us. Willie so -- what a great guy. Duck Dynasty. He was great. What a good guy. And he's a friend of my son Don and he's a great guy. And Sarah Palin though came out and everyone thought she was going to endorse Cruz and she endorsed him for Texas, and she likes Trump better. She likes what we're doing. I mean, it's amazing thing and she came out and she was terrific, and she was -- she's just a very, very, fine woman and a loyal woman, and she's smart, and I love that she -- I love that she did it. I love that she did it. One other thing I'll talk to you about. You know, so you see some of these foolish people that you know, right? And they talk about Donald Trump is in favor of eminent domain. You know what eminent domain? Most people don't even know. They think it's a wonderful commercial. Eminent domain. All these people. Well, eminent domain is it's a taking, it's taking, but it's not a taking where you don't get money. It's to take away and you make a fortune. If they take your property for a road or a highway, they pay you a fortune. They don't say that. They leave little things like this out of the edge because Ted did an ad, and I think Jeb did an ad in a couple of other people did an ad, and it was amazing. One group comes into my office, they're like so a conservative think tank. And they come in and they ask me for $1 million. Remember the story? They said we'd like -- could you contribute $1 million? It's $1 million, I don't even know who you are. Who are you? What do you do? You know, you can be rich but you don't want to be stupid, right? All of a sudden they start hitting me with eminent domain ads and I'm saying do people even know what eminent domain is? So eminent domain is where you take the land and you pay the people that have the land so you can build little things like highways and roads to your towns and schools and hospitals. And by the way, pipelines and you know the one thing that's sort of funny about eminent domain because they attacked me recently with an ad, Donald Trump is in favor of eminent domain and loves eminent. I don't love eminent domain but you won't have a country, you won't have any road, you wouldn't have any railroad tracks, you wouldn't have anything, but it was sort of funny because I looked at eminent domain and they're all for -- all these conservatives are for the Keystone Pipeline. And so am I, I like the Keystone Pipeline. I'd make a different deal. No, but wait. The politicians are for it. The you know, conservatives and Republicans, generally are for it. A lot of the Democrats are for it. What do we have to lose? It's thousands and thousands of jobs of putting something under the ground. Who the hell cares? Frankly, it's more fear. We never want to be under the guise of OPEC again. We never want to be under that. So it's fine. But, but you wouldn't have 10 feet of that pipeline if it weren't for eminent domain because that pipeline goes from Canada, the birthplace of Ted Cruz. He was born there and now he goes all the way to Texas. Maybe as a conflict of interest, that's interest. This actually goes from Canada that's interesting. Hey, goes from Canada to Texas where he's decided. I don't know. Is there something going on there? So anyway, but it goes from Canada to Texas. Now during that, you're going through the backyards of farms, you're going through the front yard of a house, you going through different places. They have a whole section on eminent domain. What it means, how we're going to use it judiciously. You couldn't have a pipeline, you couldn't have a road, you couldn't have a highway, you couldn't have anything. And I'm being attacked by him about eminent domain. Give me a break. You understand how stupid it is, how crazy it is. It's been such an interesting journey. It's been a journey where -- and I tell this to people just like this group tonight, no matter where I go, whether I go to Texas, whether I go to Los Angeles, no matter where I go, Florida, Florida came out 48% for Trump. I mean, no matter where I go, the people have the same almost identical spirit. It's incredible. They asked me what's the difference between New Hampshire people that are in New Hampshire and live here, and people in other places. I said I want to tell you, these are all amazing people. They want what's good for the country. They want strong services. They want a strong military. They want their veterans taken care of. I want my veterans taken care of. They want to have borders. We want borders. We want to have a country without borders, you don't have a country. We want to terminate Obamacare and come out with something that's so much better. So much better. Almost everybody, other than Jeb Bush, everybody wants to get rid of Common Core. I don't want my kids educated from Washington. Costs a fortune. You know, in the world of education, we are ranked number 28 in the world. We have third world countries that do better than us in education. Third world countries, right? we're ranked number 28 and yet, in terms of per pupil cost we're No. 1 by a factor like you wouldn't even believe. So far ahead of everybody else. So we spend the most and we get the least and it's Common Core. A lot of it comes out of Washington where you have bureaucrats making 250, 350, you make a lot of money. And some of them do care but a lot of them don't care about the kids. They don't care about your kids in New Hampshire. They just want to make their money. We want to bring it. I've seen it local where the parents are involved even when their kids graduate from school and they go to -- the parents stay involved. They're in love with the place. They do so good. It's love, not money, it's love. Most of them don't even get paid. They want to do it and we can make our educational system so good. But we spend the most and we're at the bottom of the pack. I mean, think of it. It's terrible. It's terrible. And you know I bring this up and I'll make a sort of a last point because I think it's sort of cool, frankly. So the campaign goes on and I start focusing very much on ISIS and on all of these different things and then CNN did some polls and so did others where Trump is No. 1 with ISIS by far, No. 1 with security, No. 1 with the military, No. 1 with the economy. That was an easy one that you'd expect, but No. 1 with all these other things. And I think a lot of that led because I'm so strong on the border because we want protection for our people and I'm very strong on the border. But you look at all of these different things and what I sort of love, the campaign. I've spent less money than anybody else practically, essentially, almost no ads until recently. And I -- you know and the only reason recently, I really didn't do anything but I feel guilty, I do. When you see a schlub like Bush spending $100 million, $100 million, and then he brings his mother, who is a very nice woman by the way, but he brings his mother out and I say Jeb Your mother's not going to help you negotiate with China. She's not going to help. She can't help. And she's not going to help you with ISIS, Jeb. But think of it. Here's a guy who's probably by now spent a $100 million and he's going down, and I've spent nothing and I'm in no one place. Wouldn't it be by far. By a lot. But think of this, this isn't even meant to be insulting. Wouldn't it be nice if we had a country where we spent less and had great results instead of spending most and having the worst result, right? Wouldn't that be nice. Wouldn't that be nice. And we're going to have it. Now, here's the thing and I am usually by saying this or something like this, but our whole theme is Make America Great Again, right? But the problem is we don't win. We lost on the Iran deal. We lose on everything. We lose on everything. We can't even beat ISIS. Can you imagine General Douglas MacArthur whom -- can you imagine General George Patton, you know, he was so rough. People didn't even like to look him in the eye. General George Patton, can you imagine him? I watch these generals on talk shows, they're on talk shows, talking about how -- what do you think of ISIS. One of the generals who just retired, he was on one of those shows, and they said what do you think of ISIS? Oh, they're tough. There's something like 30,000 people in ISIS. They're tough. I said to myself do you think General George Patton -- first of all he wouldn't have been on a talk show, OK? He wouldn't have been on a talk show. But do you think General George Patton would have been saying how tough they are? You know what you do, you embolden them when you start talking that way. There's one of our top people, I guess he was retiring or retired, and he said they're tough. Another one who just retired, General Odierno, he's a good man, I think. But he said we're the least prepared, preparedness. He thinks maybe ever. I watched and I said maybe he meant from the second World War. I think it said forever, for you know, from almost the beginning with our preparedness. And I see that, I see that. Our military is just, it's horrible what's happening to us. We're being beaten at every front. We can't have it. So when I see a general George Patton and I look at and I read the books and I love that and I love General MacArthur in terms of the modern day generals. We had some great ones and then I see these guys talking about ISIS. They would be wiped out so fast your head would spin. By the time you walk to the main door, it would be over. It would be over. So we're going to make our country strong again. And we're going to make our military powerful again. And you know, if we do that, and let me tell you, a lot of people so that's going to take a lot of money. It's actually the cheapest thing we can do. No. 1 it guarantees that we are going to be around for a long time. But it's the smartest thing we can do. It's the cheapest thing we can do because nobody is going to mess with us. Nobody is going to mess with us. That's the way we have to have it. And here's the thing. We don't win, but we're going to win. We're going to win so much. We're going to win on healthcare. We're going to win with China. We're going to win with Japan. We're going to win with Mexico. We're going to win and win and win. And sometimes I kid, I say you're going to get so tired of winning you're going to say, Mr. President, please let's lose just a little bit, and I'll say no, we're going to make our country great again. We're going to keep winning and winning. So we are going to win and we are going to make America great again. Thank you all. Thank you."}