{"id":467,"author":"Donald Trump","title":"Speech: Donald Trump in Muscatine, IA","date":"2016-01-24","link":"https://factba.se/transcript/donald-trump-speech-muscatine-ia-january-24-2016","paragraphs":["Hey, what a day. Just got back from church and it was good. It was really good. I learned something we talked about humility at church today. I don't know if that was aimed at me, perhaps. Now, the church I don't think knew that I was coming. So maybe, it was just by luck. But we talked about humility. So this is crunch time.","We're coming down to a point, we're just about a week. A little bit more. And I just hope you get out there and caucus and do your thing because if we do it, we're going to have an unbelievable victory. We're going to have an unbelievable, we're going to -- just look at all these beautiful hats, Make America Great Again.","We're going to follow what it says. We're going to make -- look at that. We're going to make America great again. We're going to do such a great job. And you know, when I went onto this journey, June 16th down the escalator, remember the famous escalator ride. I will tell you that takes guts. It took guts and it took certain courage and it's not something I've ever done.","And you know, politicians they run for office, they win they, lose they win, they lose, they don't care. They're all talk, no action. That's what their business is to run for office. With me, I've never done it before. And the receptivity has been incredible. The polls have been amazing. Just like this room is packed and every room is packed no matter where we go. We have the biggest crowds by far.","We have much bigger than Bernie Sanders has, who's second. Now, we have the biggest crowd. They never talk about my crowds. You know, the press never talks about it. They always -- but when somebody else has a crowd. So I tell you, last week we had 12,000 people, Bernie Sanders had 3,000 that's good 3,000, and he is second.","Way, way down the line. But he's second. But we're having these incredible crowds 20,000, 35,000 people. And Bernie Sanders has 3,000, and we have 12,000 and they talked about Bernie Sanders, and they said, he had 3,000 people, it was a great -- then they talked about Trump. I had 12,000 and we had to send 5,000 home because we couldn't get them in. But you know, they didn't mention that.","They don't mention it. And I always say, the cameras they always are on my face. They never want to show the crowds. It's an incredible thing. But it's OK because the people get it. The people are really, really smart. And somebody asked me the other day, what was the thing you most learned and I learned a lot.","But because this has been sort of an unbelievable journey. Hello, darling. How are you? Look at -- I love these people. We have the most loyal people too. We have the most loyal. We have and that's the other thing I learned, the loyalty, you know, the other they do polls and everything. They do polls on the debate.","We win all those polls on the debate. We have another debate coming up on Thursday, and I think, that'll be fine. But we win the polls in the debate. But you know, they have -- I mean, I don't know if it's going to be fair. But we'll handle it one way or the other, OK? It's what we've got to do. But you know, I learned the level of loyalty to our movement that it's really to me, but it's really beyond me. This is a movement, folks.","This isn't like a normal situation, we're the cover of Time Magazine this week. With a really fair story, a really professional beautiful story about the fact that there's never been anything like this. There's never been anything like this. It's been an incredible journey. They they've -- they're going to study it and I get calls all the time for reporters, one in particular, how does it feel to do what you've done?","I said, I haven't done anything because unless we win, we're just wasting our time, folks. We're just wasting our time. That's why on February 1st, you got to caucus. You got to go out. You got to do it. I jokingly say, no matter how you feel, if you're feeling sick, if you're having fights with your wife or your husband, no matter what -- no matter what's going on, if you lost your job 15 minutes before, if they said you're fired because the economy stinks which it does, if -- no matter what happens, you got to get out and caucus because we're going to change things.","We're going to change it. And it's just been very exciting, and the chairman just told me that so many calls are made, and I want to thank Jeff. He's fantastic by the way. He really is a dynamic guy and a great guy. But he just he just had -- so many calls are coming in where people want to change their party.","I've been saying this is going to happen, where they're going from Democrat to Republican. And he said, he's never seen anything like it. He's been doing this for a long time. People outside -- whether it's Republican, honestly, whether it's Republican, Democrat, Liberal, Conservative, they're sick and tired of seeing our country ripped off by every single nation in the world.","They're sick and tired of it and we're going to stop it. So yesterday, couple of things happened, but during the last week, we had a wonderful woman, a really wonderful woman who the press does not treat fairly, but these are minor details. Sarah Palin came out and endorsed us. And she is a wonder -- if you knew her personally, you'd understand even more so. I mean, I can see even from that that everybody likes Sarah.","But if you knew her, she's an amazing woman. Her husband Todd is fantastic and we get a call, we'd like to work with you, we'd like to endorse you. And I said how nice is that? And I thought she'd go to Ted Cruz because, you know, she endorsed him for senator. And he was at 2% and he'll tell the story. He was a 2%, she came and endorsed him, and he became the senator from Texas, even though he was born in Canada and was a Canadian citizen it's a -- I don't know, maybe if she knew he was a Canadian citizen at the time, she wouldn't have done that.","But it was sort of interesting, but she she's amazing and her level of success with endorsements is tremendous. And the press does not give her her just do. But I will tell you, she's a wonderful woman who loves this country. And I was so happy to have her endorsement. And a lot of the fans were so I want to thank you, Sarah who's probably watching because we have all those cameras on right now.","We have a lot of cameras, right? We have we have a lot of cameras. A couple of things you know, we'll talk about individual, individual candidates for a little while. Should we do that? I think so, right? We have to go through the whole thing. I could -- should I go through a couple of polls, no? Yes?","OK. So Fox just came out. Big, big turn 12 or 14 points. Trump is up. You heard about that right? Trump is out in Iowa. And now the rest of that -- you're still lagging behind everybody, folks, OK? Because the rest of the nation -- I mean, we are just through the roof. We -- we had a poll yesterday 48% and we had another one 42%, and we have him at 36%, 38%, we're doing great.","That's on a national basis. We're doing unbelievably -- also numbers came out from Fox and CBS this morning for New Hampshire where we're through the roof. In South Carolina, through the roof. All of them, Nevada, all of them. And really, I'm so happy because I spent a lot of time here. And I love the people of Iowa.","And I think we're going to win Iowa. And you know, it's much easier -- even my people they say please don't say you're going to win because if you come in second, it's going to -- I said that's OK. I want to win. I want to win it. Iowa's very important. First of all, you haven't had a winner in 16 years, folks.","It's time, OK? It's time. It's time. That's it. Look at that person, Make America Great Again. You better believe it, man. Thank you. Think of it. I'll put this -- you have not picked a winner in 16 years. If you choose me, we're going to finally have a winner. You know, they want to move you, I hate to say it. They want to move you to the back of the pack.","You know that, right? There's a big move that Iowa was not going to be where you are now. First, with the caucus and they want to move you. And I give you this pledge. I win, they are never ever moving you. You're staying there, OK? You're staying, 100. You are staying where you are. And you know, honestly, regardless of me, and it's a great tradition here.","It's an amazing thing. It's an amazing, it's an amazing place. It's a great place and you're going to stay where you are, and I think we're going to win. So I'm not saying, oh gee, I'm going to be thrilled if I come in second. I don't think we're going to come in second anymore. You know, I'm looking at what's happening.","So there's a theory that I'll do much -- even though I'm leading all the polls, I'll actually do better than the polls. And people said, well, they might not poll. I mean, you know these polls with Trump, they were saying and one of the people this morning was saying not even a fan. But he said, you know Trump is going to win.","You know, the whole thing. Trump is going to win. He's going to be the nominee and he probably will do very well against Hillary because look at what he did last week against Hillary. Look, I was the best thing that ever happened to Bernie Sanders because my attack on Hillary. All of a sudden she went down and Sanders got all the credit for her, right?","This guy, I mean, you know, this guy Bernie Sanders give me a break. How does he figure this whole thing? But he got all the credit. It's unbelievable. So I have to say that once, I assume the press is listening today, but I had to hit her because she said false things about me. So I hit her hard but I haven't even focused.","You know, on the Fox poll and another poll that just came out, that I'm beating Hillary and I'm beating Hillary. I'll beat Hillary. But I haven't even focused. We haven't even focused on Hillary or Bernie Sanders yet. I mean, here's a guy who's a -- well, they say socialist but some people would say he's a communist, OK? But I shouldn't hit him too hard though because if I hit him hard, he'll go down and then it'll be more of a fight with Hillary, and maybe we want him to fight for a while.","So I'll say, isn't he a wonderful guy and wonderful -- I don't want to hit him too hard. It's interesting. I was thinking, I never thought of -- when I hit Hillary last week and Bill, but I did the right thing. But all of a sudden they did this and then they start saying Bernie Sanders is surging, an amazing thing happened.","I did it. I'm saying I did that. So name -- now maybe, I should hit -- oh, I could hit him. I have stuff in my mind. I could hit him so hard, he would drop, he would drop. No, he's, he's, no. He's too easy. He's too easy. He's really too easy. But -- so look at these candidates that we're against. We have -- you know Jeb Puja.","We have Jeb exclamation point and I talk about him, and the only reason I even bring him up, honestly, he's spending millions of dollars of negative ads. Nobody else is hitting me with negative ads. Jeb Bush, here's a guy spent close to $100 million. The polls coming out this morning, he went down. He's down at the bottom.","It's time to give up Jeb. It's time to give up. Now, you know in life, in life sometimes you have to admit when you don't have it. He doesn't have it. He doesn't have it. And I don't like people -- here's a guy, takes his ads, vicious ads. He is not a conservative. He is not a true conservative.","What the hell does this guy know about me? He said, he will not win the race. Well, if he's so good, how come I'm beating him by 38 points. You know, it's like, unbelievable. He will not win. He's at three and I'm at 42 when he's say. Oh, these people that you have. I don't know, we're going to have to do something about it. But I mentioned it, but here's this guy, spent almost $100 million.","I spent almost nothing. You know that. I'm guilty. I feel guilty. I was supposed to spend now it's up to almost $40 million. Yesterday I was talking about $30 million and my people said, I had a budget at this point to have spent $40 million, by the way, I'm spending my own money. I'm not using other people's money.","I'm the only one. I'm the only one. I'm the only one doing that. Everybody else, Hillary and, and every single candidate, every single candidate is doing what they're doing, OK? So you have Cruz. I mean, Cruz is getting oil money, by the way, he is so against ethanol, you can forget it, OK? You can forget it. All of those wonderful farmers that produce what they have to produce.","Cruz is totally against -- then he changed, they're like said, well, he's very principled. He's not so principled because a couple of weeks ago he changed, and he got a little bit more and he changed again, got a little bit more. What's that about principle? If he's against it, let him be against it. But he was against it strongly, getting killed, and then he changed and he changed twice.","So -- but by the way, and he'll change back so fast because who's giving the money? Oil people are giving him money. Nobody's giving me money. I turned down so much money. I feel so foolish. I feel so -- you know my whole life I take, right? Greedy. I take, I take, greedy, greedy. Now, I'm going to be greedy for the United States.","I'm going to take for the United States. I'm going to be so greedy. We're not going to have any more of these deals with Iran where we give them $150 billion, $150 billion. We should have never given it and we should had our prisoners back years ago before the negotiations started. You don't start the negotiation unless they give us back our prisoners.","You don't start it. You don't even think of it. I tell that story all the time because it's amazing. You go in, right? They have our prisoners. They actually had three, then they had four, and by the way, it's going to set a wave of kidnapping like you've never seen before. You watch. People see that deal and putting that deal together with the other, it's going to set a wave.","If they would have done it my way, you wouldn't have it. You walk in they're going to say, let's start. We're going to say, we have to have our prisoners back. They're going to say no. We're going to say can we have our prisoners back? They're going to say no, you walk out. Why didn't they walk out? You walk out, you double up the sanctions, they will call you within 48 hours, assures you standing here.","Sorry couldn't get you seats there are too many people. There are people outside still trying to get in. They will call you, as sure as you're standing here, and they'll say, you've got your prisoners. OK, now you get the prisoners. Now, you go in and say listen, there's one other minor item. We can't give you back the $150 billion.","What do you mean? What do you mean? You know, the Persians are great negotiators. We have, we have guys that are better. We can't give you back the hundred -- we want to get the prisoners back for us. This is what we should have done. Now, we would have had our prisoners back and we didn't make any deals.","We got our prisoners back. You say now, $150 billion, can't give it. We're a we're a debtor nation. We're bust. We've got $19 trillion in debt. We can't give you the money back. You know, want to take the lumps out. My father always used to say, yeah, take the lumps out, take the lumps out. Make it nice.","So instead of saying, no we're not giving it to you. We've got $150 billion, we don't have the money. We owe $19 trillion now with a stupid budget deal they just made. You believe that deal two weeks ago? Now, we're at $21 billion because that's going to -- trillion. So now, we're at $21 trillion, trillion, trillion.","So we say to them, we can't do it. We have $19 trillion, we're going to be $21 trillion, and they're going to be angry. And so what you do is you leave the room and that's the end of that. And they'll call you back, you double up the sanctions, and they'll call you back and you start. Now, you don't have to give them back the money because what they made in that deal is so 24-hour inspection periods.","What they did is so incredible. We could have had a great deal. I like the idea of deals. I think deals are good. I mean, one of the problems with Ted Cruz is everybody hates him. I mean, he's such a nasty guy. Everybody hates him. He can't talk. Think of it. Not one United States senator has endorsed him.","Not one and Senator Grassley yesterday was with me and introduced us. I mean, what a wonderful guy he is by the way. Senator Grassley you have a -- he's a great guy. But think of it. This is something wrong when you deal with people on a daily basis and not one person endorses you. There's something missing there.","I mean, there's something bad. And with me, remember this, he hit me first during the debate. No matter what I did, no matter what -- I could have done anything. He was backing me up, right? I said this guy seems like a nice guy, more than anybody else. Carson actually back me up very nicely, and he was a good guy too.","Carson, Ben Carson, nice guy. And a couple of -- I mean, honestly, I like a number of them that are running. But with Cruz, he was so positive, everything was great. I did the Muslim, great, because somebody has to do it. Somebody has to say what's going on, I mean, we have radical Islamic terror going on all over the place, all over the world.","And we have a president that won't say it. He won't even talk about it. So I did that, he was fine with that, a lot of people weren't. And now they are. You notice the way now they're saying well, you know, Trump does have a point, why think so? I have a point. When planes fly into the World Trade Center and into the Pentagon, and wherever the third plane was going.","When people are shooting their friends in California, when they're shooting their friend -- bye, Goodbye. Goodbye. Goodbye. No, He wasn't wearing one of those hats, was he? Was he was he wearing one of those hats? And he never will, and he never will, and he never will. And that's OK. But you know, we got to do something for us because it's not working.","And all over the world, they're talking about it and people, frankly, I have friends that are Muslims, and they call me up. Not all of them, but some of them, and they said, you're doing a great service because there's tremendous hatred. And we have to get to the bottom of what's going on. When you have people that go -- these two that got married, these two young people that got married, they were radicalized.","And they go in -- to people that gave them wedding receptions, and gave them parties when they were getting -- and then, you shoot them, you kill them. You kill them. And then you have in Paris, where you lose 130 people that don't have guns. And by the way, we're going to protect the Second Amendment if I'm President.","That I can tell you. That I can tell you. You know, if in Paris the toughest gun laws in the world in Paris, the toughest they say in the world, who knows? But the toughest. In France, the toughest gun laws in the world as a country, can't have a gun. And yet, the bad guys can always have a gun, right? So if I had -- and I'll pick out some people.","You with a white hat, right? If I pick out you, you right there with the sign, you. If I pick out a few people out of this audience. I could pick out almost anybody. If you had a gun and the bullets were firing the other way in Paris or in California or remember the military officers, the five that were killed.","The military officers that were killed on a gun-free zone, on a military base. That's going to end the first day, no more. No more. But if there were some people in there with guns, you wouldn't have 130 people killed. It would have been a much, much smaller -- and you know what, they wouldn't have been looking for the guy with the dirty hat.","Believe me. They wouldn't have been looking for him for long. They wouldn't re -- and you know the other thing, the press. And they have been good about this because they're very dishonest group of people. The guy with the dirty hat. They called him the mastermind, right? The mastermind. And for two days they're looking from him, they call him the mastermind to miss him.","Now what did he do? He sent people into a different couple of places in Paris, right? He said shoot everybody that you can. What do they get? What's going on? This is the mastermind. And so the president -- the mastermind does -- we think we have him under control. We think we found him. We don't know. He's a brilliant man.","They don't even know who the hell he is. And then you see him, and I called him right from the beginning. The guy with the dirty hat. Probably got a very low IQ. He's a moron. He's a frickin' moron, OK? And the press, No, the press is calling -- and then they wonder, they're calling the mastermind. And then, they wonder why our youth is being radicalized.","What's happening with the youth. And they're wondering -- you know they're using the Internet better than we use it, and our guys invented it, right? Because they're hearing oh, dad, the mastermind. He's a mastermind. He's a moron. He's a dirty, rotten moron, and we kill them fortunately. And the cops in France, they did a great job, and the cops in California they did an amazing job.","I mean, our police, I'll tell you what, the most mistreated people practically in this country, two groups, our police and our veterans. Remember that. I mean, I looked at what they went through in California with all the shooting going on and all this stuff. And I tell you what, they did a hell of a job.","Same thing honestly, in France. The police are tremendous people. And you know what, if you have that one 101% where a horrible thing happens or where a mistake happens or where a guy chokes and he does something you shouldn't or there's a bad policeman. That can happen too. That's huge story all over the world, all over.","They play it up, but they don't talk about all the good things we wouldn't be here right now, if it wasn't for the police. So I tell you. Yeah, give them a hand. Give them a hand. I've had so many endorsements from police all over the country. Yeah, the police and -- I just respect them a lot. I mean, they go through a lot and I mean, they're afraid.","Every time nowadays, every time they're afraid to talk to anybody. They'll talk to somebody, if they're a little bit rough, they end up losing their pension, their job. I mean, it's terrible, what's going on with our police. People are afraid to call them. People call the police, I mean literally, I've had policemen that are tough, tough cookies where they're literally afraid to be a little bit rough with people that are really bad people because they're afraid they're going to end up getting brought before the commissions and lose their job.","So we've got to, we've got to cherish our police officers. It's very important, very important. So, so the one guy Bush spends $100 million, he's down here and I say to myself, why do I talk -- and the only reason I mentioned him is because you get angry at it. But here's the story, if we could do what we've done.","I've spent nothing, practically. I mean, the biggest expense is my airplane and I own it, I have to pay myself. Do you believe it? It's true. I have to pay myself because I own my airplane. So I pay myself. So at least I have an expense but you know, you find the market value of the plane, you pay yourself.","The whole thing is ridiculous. But I spent very little money, but I'm going to for two reasons. Number one, I feel guilty. There's going to be up to about $40 million, I spent peanuts. I feel guilty. And number two, I don't want to take a chance. I don't want to be a wise guy because oh, I'm going to win without spend.","I'm willing to spend whatever the hell it takes, I'm going to spend. I don't want to be a wise guy. But one line that I hate getting rid of. It's so cool to say that you've spent the least. I've spent less than anybody, just about. You've spent the least and you're by far number one, right? It's so cool.","It's so cool. And I don't really have to spend, a lot of people say why you're doing good? You don't have to. You know, I get so much of the -- they call earned media, earned, meaning they have you on television because I get good ratings. It's very simple, right? You know, Face the Nation, a show, a very good show.","John Dickerson. Face the Nation last night, and I got to be straight, look at all those cameras, you think if I was wrong on those, do you think I'd be -- headlines, Trump said this. OK. Face the Nation put out a release last week. You know, Face the Nation, right? Big show, big show, CBS. They put out a release last week.","I did a show a couple of weeks ago from Florida where I'm leading 48 to very low numbers, OK? I'm very, I love Florida. We're going to win Florida. We're going to win a lot of states that nobody ever thought about winning for Republicans I tell you. But Face the Nation put out a release last week that they had their interview with Donald Trump.","Long interview from Florida, that it was the highest rated show they've had in 15 or 16 years since the fall of the World Trade Center, highest rated show. That gives you power, that gives you power. And when you look at the debates, I mean, Fox had 24 million, CNN had 23 million, CNN says it's the largest show they've ever had in the history of CNN.","Now, they cover wars or they cover big events. The biggest ratings they've ever had was the debate. Now, I know they're not watching Jeb, and I know, you know, he's a low energy person. I know they're not watching Ted. He's a wonderful guy but they're not watching Ted. I know -- I don't want to insult the rest of -- I mean, I get along with people.","I want to be nice. I don't want them call me, why did you say that about me? So I'm not going to say all the other people that are up on the stage. But if you look at four years ago and eight years ago and it used to be like a throwaway. Nobody even wanted to broadcast the debates. They had to do it as part of their licensing.","They didn't even want to put them on. Now, it's like they can't get enough. The debates are coming up, the big debates. I mean, it's crazy. I won't take credit for it. But every magazine, they call them the Trump debates, variety all these, the Trump debate last night sort of crazy, right? But it gives us, not me. It gives us some power because we are the silent majority that's turned to be the noisy majority, with a noisy.","And it gives us power. And by the way, the same thing with Meet the Press, Chuck Todd he's a nice guy. They were down in the toilet with the ratings and then I agreed to a show finally because he started treating me with respect. And I agreed to do a show, he went through the roof. They had millions of people watching.","They all said, what happened? And he's going to go in and get a raise now, probably. And George Stephanopoulos, we do his show, it goes through the roof. So it gives us and CNN by the way, good guy there. And it went, you know, they get good ratings. It gives us power. Now, they don't actually care about the poll numbers.","I care more about the poll numbers. But I have to tell you, when I see those ratings, it makes me feel good because that means that people are listening to our point of view. That's what it means. That's what it means. So, so what's happened is an ad was put out by Ted Cruz and it was so false. And it's about Eminent domain and they make eminent.","Most people don't even know what Eminent domain is. You know, Eminent domain that's where government takes property for a full payment. They pay you. They don't just take it. They call it a taking. It's called a taking. But it's a taking, but you got paid a fortune. Frankly, more than you'd ever get because you're dealing with politicians.","And politicians as we have learned over the last twenty five years, they pay too much, right? So if you are building a road. If you're building a highway because let's say you have a community like this, and look at all the people, and you need roads, and you need highways, and you need schools, and you need hospitals, and you may have somebody that has a little farm, and the corner of their farm makes it impossible to build let's say, a school or let's say a hospital or let's say, you can't build a highway because the farmer says I do not want to sell under any circumstance.","You have a highway coming except to have a prob;lem. You can't get the land, right? It's called Eminent domain. So what they do is, they'll take that sliver and they'll pay you a fortune. They say it's fair market value but it's really more than that if you're smart. OK. So they had this thing about Donald Trump Eminent domain, and that I had something to do with.","You know, there's an economic development project where I would have loved to have used Eminent domain. Ultimately, I didn't use it. They said in the ad that I did. They said I ripped down this house from an old woman. Never happened. I didn't go forward with it. If I did, we would have had thousands of jobs, it would have been a big hotel and all that stuff, but it didn't go forward, it never happened.","But they showed me ripping that -- they have something a bulldozers ripping down a house. It's just all false stuff. But let me tell you about Eminent domain. All of these conservative people, the National Review as you know is a dying magazine. Does anybody here read it? Nobody. So they do this, I mean, it's dying.","The thing is dead. It's a doornail. It's going to be closed. I bet it's closed in a fairly short period of time. And it's a shame, but what they did is they have a couple of guys at the lead, and they took people and they wrote and they got some publicity. And it's probably the best thing that's happened to me because my poll numbers just went through the roof because nobody respects these people.","These were the people -- these were the people that said very strongly, Trump will never run. If he does run, it's not going to happen. Don't even talk about it. So then I ran. Then they say, he'll never sign for May, which is a forum where you basically sign your life away. You know, it takes guts to run for president.","I went -- I never did this stuff before. So today, I signed for May. Then they said, well, he'll never put it in his financials because his financials, maybe he's not as rich as everyone thinks and he doesn't want to hurt his image. Well, I turned out I'm much richer than anybody ever knew. I mean, I put it in these financials almost 100 pages, almost 100 pages of financials, right?","And they were great. Big great jobs, Doral in Miami and Turnberry in Scotland where they play the British Open, and so many different -- so many different things, all the stuff in Manhattan. And it turned out to be great. Low debt, tremendous cash flow. Some of the best assets in the world, and the only reason I tell you that is because, and it's not as a Braggadocios.","Although, if I didn't run, I probably would have put it into because I wanted people to see it. But these guys went down, they said oh, this is bad news. I mean, not -- and I put them in where I didn't ask for extensions. When I put it in, they said, well, he'll ask for an extension because you're entitled to many, many extensions.","And some of the politicians who filed like a one or two page report they asked for extensions, OK? So I didn't ask for extensions and people couldn't believe it. The only reason I tell you is that's the kind of thinking our country needs to make us great again, and rich again, and strong again, and solvent, and all of these things.","I mean, we have as an example with China, we have political hacks. They're political hacks that are negotiating and we have a trade deficit with China of 305, well, actually it used to be, it's now actually, I heard just this morning it's more accurate number, five, listen to this, $505 billion. We have a trade deficit, $505 billion.","And then Obama says our partner China. I love China. I know everybody. These people come to me. They buy my apartments. The biggest bank in the world is from China. They're a tenant and one of my buildings in Manhattan. I mean, I do great with China. I own a big building in San Francisco along with a group.","That's a great group. And we own the bank of America building in San Francisco. Nobody even knows that. I own another in 1290 Avenue of the Americas through China, where I win. I mean, I had wins. That's how I got them. I beat them. I beat China. But I have wins. We got to have wins. We don't win. Our country doesn't win anymore.","So I tell you that only because that's the kind of thinking we have. Because we have people that are real stiffs. We have people that should never be doing what they're doing. Should never. So I look at this stuff and I see what's happening, and I look at Ted and I say, wait a minute, I put in this report and all of these people, that for the National Review, they were all saying I wasn't going to run, I was going to file, and never file financials, you know.","And by the way, when I found my financials, it looked like Grand Central Terminal in front of the Federal Elections Commission with reporters. Oh, they were going to give me, they were going to get -- so what did they get instead? Ted Cruz with a couple of pages. He forgot to say that Goldman Sachs gave him money.","He forgot to say that Citibank gave him money. OK, because he's a man of the people. He's Robin Hood, right? He's this great man of the people, even though nobody likes him, even though no senators endorsed him, even though all of this, and he's a nasty guy. He's the man of the people. He's going to help people.","Well, he doesn't want to know that he borrowed from Goldman Sachs because let me tell you, Goldman Sachs has him. Citibank has him, OK? He's going to come out with rulings that are negative at Goldman Sachs and he's got personal guarantees with Goldman Sachs. I don't think so. So he said, oh, he didn't know.","He didn't know. Oh, I didn't know. You know, guy's got two banks, he got two loans or may have more than that. But let's assume he has two banks, two loans. How do you not put that on your personal disclosure form? How do you not put it? It's impossible. Smart guy. So you know that your banks and you didn't put them.","He didn't put them because he didn't want you people to know that Goldman Sachs, that he owes money to them, and that you got guarantees to Goldman Sachs. And then, you got loans at way below interest, he got very low interest rate loans called favorite nations loans. He's got low interest rate loans. They're very favorable rates, in other words, they're like peanuts.","So when Goldman Sachs goes to your Senator in Texas, in the case of the people from Texas, and they say, we got to have this. We got to have that. He's going to do it. The nice part about me, I'm not taking anybody's money. I'm not taking anybody's money. The other problem with Ted is that, as you know, and has come out very strongly, Laurence Tribe, great lawyer, great constitutional lawyer from Harvard said this is an unsettled matter.","This great constitutional lawyer. Other lawyers have since come out, saying he can't run for president. He can't. I don't know. What -- maybe he can, maybe he can't. I don't know. He should go into court and seek a declaratory judgment because the people voting for Ted, for Ted Cruz, those people. I think, there's a real chance that he's not allowed to run for president.","I know this. He can run for prime minister of Canada. He was born on Canadian land. It's true. People actually laugh, it's actually true. He qualifies because he was born on Canadian soil, right? He was born in Canada and then he said another beauty. So he was a citizen of Canada until 15 months ago. Did you know that?","Does anyone know that? He's a citizen of Canada. So he's a joint with the United States. So he's a citizen of Canada. And they said, you know, you're nice -- Senator, you're a citizen of Canada. Somebody found out. These reporters they ultimately find out everything whether we like him or not, right? Much of it's false stuff, but this happens to be true.","He's a citizen of Canada. And they said, you're a citizen of Canada. Oh, I didn't know. So he just said the other day, they said, how could it be that you're a citizen of Canada? He said, he didn't know about it. OK. So he didn't know he was a citizen of Canada. And there are advantages to being a citizen of different places, you understand that.","So he didn't know he was a citizen of Canada and he didn't know he had loans out to Goldman Sachs and he didn't know it was a known -- I mean, come on folks, look. Are we babies? Are we babies? So we're going to find out what happens. We're going to find out -- and then he makes a false ad about me that I'm ripping down some woman's house that I ultimately said, forget about it, does not work.","And by the way, I saved a fortune. Because it was in Atlantic City, I left Atlantic City like eight, nine years ago. Atlantic City has totally collapsed. I made a great deal. The smart people give me an A for vision. I left. I mean, think of it, I would've built this tower at Atlantic -- I mean, so the woman did me a big favor by, you know, not wanting to sell, but I never ripped down her house, and she was perfectly fine.","I never ripped down her house. They show tractors ripping down a house. That's really, you know, it's false stuff. OK. It's not nice. He should actually give me an apology. Do you think he'll apologize? I don't know. But he should. He should give me an apology. He said I ripped down her house. They show a tractor ripping down something.","It's not her house because I didn't rip it down. But they show this big beautiful, could be a John Deere but I think it was a caterpillar, that it was -- that was before, right? That was before started doing all the business because Japan has so devalued their yen that it's very hard for Caterpillar and John Deere.","And by the way, speaking of John Deere, we love John Deere. I buy millions and millions of dollars worth of equipment. Millions. So Ted has a problem and I -- you know, I don't know what the problem is, but I can say that the polls that came out this morning, there's been a tremendous turn, 12 points, 14 points of a swing.","And we're way up. And he went way down. So we'll see what happens. Look, ultimately, you got to go out. You got to caucus. Who knows what's going to happen. If you don't go out, we're not going to make this country great again. That I can tell you. If you don't go out and do it, then you have these people at National Review.","OK, I'll talk about that for a second because it's gotten a lot of publicity. It's a failing magazine. Got no influence whatsoever. And you have one guy, Brent Bozell, he's up in my office. I don't even know the guy. He's up my office asking for money something to do with advertising or something.","Money. I want money. A while ago, I want money. I said, what is the guy -- he's asking for money. Who is this guy? So he's up asking me for money, right? So I think, I might have given him a check for his charitable contributions, something, this is a long time ago before I was thinking about doing this, and I gave him money.","Then he calls again, he wants more money. And I said, hey look, you know, you could be rich, but what the hell do we have to give money to -- I'd rather keep it or give it to charity or do something with it, right? So Brent Bozell, the next time I hear his name, I'm writing a piece about Donald Trump and what about.","I guarantee you, folks, if I gave him more money, you end up giving it for the rest of your life. But if I gave him more money, it would have been fine. He wouldn't have written the piece. But then you have what's his name, Glenn Beck. Glenn Beck. How about Glenn Beck always crying, every time I see him.","He is -- you know why he's crying? because Fox fired him, OK? And now, he's got a loser going on, the things a total loser. But in all fairness, I don't blame him. He asked for an interview. A lot of times, I'd been really busy and don't forget, until I did this, I was really sort of not thinking about this, and maybe I was going to do it maybe.","So I didn't give him an interview, only because I was busy, not because of any other reason. I didn't give him an interview. And I probably would have acted the same way as him. He called my people and then all of a sudden, I go to a first place because you know I've been in first place almost since the day I announced.","Can you believe that? Almost as -- and probably my people, you know, when you go to first place, your people all of a sudden become geniuses, right? Oh, well, we wouldn't give him an interview. They're probably giving him a hard time. Anyway, I never gave him an interview. I should have given him ended -- an interview and I didn't do it. So I didn't give Glenn Beck an interview that he asked for many, many, many times, called me up said his father's in the hospital.","His father was sick and not well, and in the hospital. And I don't know how that worked out. I hope it worked out OK. But he's telling me about that. I said I'll do your show, I'll do your show, I promise, I'll do your show. Bottom line is probably called up and we didn't do a show. It comes out against me. That's all it is. If I did interviews with him then, he wouldn't have done it. That's the way life is, folks.","I mean, you know, this isn't something -- you don't learn this at the Wharton School of Finance, OK? But that's the way life is. And I don't blame him. If I called somebody and I had a network, a failing network especially, if I had a network, If I had a network and I called somebody, and they wouldn't do the interview, I wouldn't -- and there was just no reason other than I got enough things to do, right?","Because I would have done it. If I called somebody and they wouldn't do it, probably I'd be swayed to knock the hell out of them. Why wouldn't I, right? You know, so they came out with this stupid cover about, you know, they got 22 guys. I mean, these are just two examples, I could go over others too, and some of them are very nice people.","I was actually surprised and a lot of them weren't even very vicious. Some of them I actually thought they wrote positive articles about me. But they did this and they're trying to sell some magazines. And I don't know, if it might sell this one. But basically, the National Review is finished. It's a dead magazine and they came out, and they tried to do something that was good.","They got some publicity. I think, it probably helps me. I mean, probably it helps me. So here's the story. We have a very, very major election coming up. I think it's going to be the most important election that we've had in modern times. Our country is going to hell. We have people that are incompetent leading our country.","We have people that are frankly, you know, they like to say, Trump likes to speak. You know, I'm an Ivy League. I went to an Ivy League College. I went to the Wharton School of Finance which is the best business school in the world. I'm like a smart person. I always say. I'm what -- I always say my uncle, my uncle, you know, because I do believe in the racehorse theory, right?","You know, slow horses don't produce fast horses, right? You know, the old racehorse, but my uncle was a professor for years up and a great Engineer, Dr. John Trump at M.I.T., like one of the most brilliant people. And you know, like we're smart. The people in this room are smart. My people are the smartest people in my opinion because they get it. My people, my foll -- these are the smartest people.","The most loyal and the smartest. The most loyal and the smartest. But you look at what goes on and we know and we see, and they always like to say, he's plain spoken. I don't know, is that a positive or not? You don't have -- you don't need a plain spoken person, but think of it. When you have a word to describe your leadership in this country.","What's a better word than the word stupid. There's no better word. Now, I can come up and I can go to Thesaurus, I can go to different things and come up with other -- but there's just no better word. Am I right? I used to say incompetent and that's pretty good, but stupid is better.","I mean, it's better. When you look at these deals that we make. When you look at what we do with China. When you look at what we do with Mexico. Mexico, they're friends of mine. I employ, I employ thousands of people over the years. Tens of thousands of Hispanics. And in Nevada, I'm leading. The polls just came, I'm leading in Nevada with Hispanics, and I said I'm going to win with Hispanics.","And I'm going to win with African-Americans, too. I'm getting great numbers with African-Americans because I'm going to get jobs for people. I'm taking our jobs back. What has Obama done for African-Americans? They're in relatively speaking, the worst shape they've ever been in. You look at kids, they're 58% unemployment.","You look at people that are 35, 45, 50, in their prime, their unemployment is through the roof. So Obama's done nothing. I mean, with him it's all talk. He's like a typical politician, all talk no action. I mean, just a bad guy. I'll tell you what, I'll tell you what, I thought Obama would be a great cheerleader at a minimum for this country.","I thought at least he'd be a cheerleader. Guess what? He's been a horrible cheerleader for our country. He's been a divider. He's been a divider. Our country is divided and it's divided very, very badly. And we have to bring it back. And if we don't bring it back, we're going to have a problem. But we've going to bring it back.","I'm going to bring it back. People don't know this about me. I'm a cheerleader, too. And I'm somebody that does unify. Everyone thinks, oh, he's very divisive. He's very divisive. A woman came up to me yesterday, we had -- I did two speeches yesterday, packed houses, different parts of Iowa, and a woman, beautiful wonderful woman walks up to me because Mr. Trump, all my friends want to vote with you, but they're a little bit concerned that if you're president, will you still speak so tough?","I say no, it's different. Well, yeah, probably. He says, you bet you, I hope so. Well, there's a little truth, hey, a little truth to that too. Do we want to ease up? But I say it's different. I'm running originally against 17 people. So four or five are down the tubes. Now, we have a big group that's going to be down the tubes.","Despite all the money. Can you imagine all the money they spend in there down the tubes? But you know, it's sort of interesting. I said to her, well, what you mean? She said, the only thing they have against you is they think your rhetoric is very tough. I said I have to be tough, I have these guys coming.","They're lying. They're coming all sides. You saw that debate? Boom. Trump. Trump. Hit Trump. But we came out. Did Trump win the debate by the way? Did Trump win? We did. We did. OK. I said so I have to be because I'm dealing with all these people, and then, I'm going to have to deal against Hillary, if she doesn't go to jail or I'm going to have to deal against Bernie.","Or somebody or Bloomberg comes in which would be great. I'd love to have them come in because I love the competition, frankly, I mean, it would be great if Bloomberg -- I love Bloomberg to come in. So I'm dealing with all these people and I have to be a little bit tough, and I have to be quick because I don't have enough time to be so nice, right?","But if I'm president, I would have a little bit of a different demeanor. But don't worry, the demeanor would be a little bit different. But don't worry it'll be the same attitude. You understand that, OK? We're not going to change, OK? Now, he was worried. He said please don't change. Don't worry but I'll be a little bit softer.","Maybe the attitude will be tougher. But the words will be softer. You know, I tell people, I'm like, you know, it's real easy. I can be so politically correct. I've been. I go to Palm Beach. I own a great place in Palm Beach. We have the great society people in Palm Beach. They always want me sitting next to them for a lot of reasons, right?","And I sit next to ladies. Oh, Donald, it's so beautiful to have you with us, it's so -- and I talk to them. You look so lovely tonight. See now in modern day society, you're not allowed to say that about a woman, right? You can't say that but I've never had anybody complain. But they are very up in the air and they're very nice people.","And they raise a lot of money for charity and I'm so politically correct. In fact, they leave, they say, I can't believe it how sophisticated Donald is. I can't do it any different way. The problem we have is our country has a problem. I don't have time to be politically correct. Does that make sense? We don't have time.","It takes a lot of time. Takes a lot. It takes a lot of time. So when I began this journey coming down the escalator, I looked down in the atrium, it looked like the Academy Awards. There were so many -- I mean, even look today, look, look back there. Look at all these guys, look at it. Who has that on a Sunday morning?","Here we are in Iowa, Sunday morning. Now, look at, look, look unbelievable. Now, I'll tell you what's going to happen, watch. This one section that for structural reasons they couldn't have people up there right, OK? Watch. Look every single seat is back. People are outside standing all, but for structural reasons, it's under repair.","So there's one section where they couldn't have it. They'll probably have one wise guy show that one section. Well, not that many people attended. Oh, what sleaze. What sleaze. Their disgusting. Well, that's why I liked our protester. You know, our protester because they have to show up, they'll say, boy that's a lot of people.","I tell the story. My wife always says, were there many people that I said -- didn't you watch? Yeah, because it's on all live. It's on CNN, it's on all of them, right? Didn't you watch? And she said, Donald they never leave your face. They never leave you. It's like a tight shot. They never leave your face.","I said, I don't like that. Did they show we were in Lowell Massachusetts, it's a stadium. We were in Oral Roberts University. Great, beautiful, basketball setting. The place had 12,000; 13,000 people in it. We had to send away 5,000 or 7,000 people, right? They never once showed the stadium. My wife says, were there many people there?","I said didn't they show it? No, I said really? She said, I could tell by the sound there had to be a lot. You know because it sounds like a pur. It's not like, you know, when you have 200 people. It's like this purr, she's said I could tell there were a lot of people, but they never show. It's, it's terrible.","So if you see the section that's being under repair and you see these sleaze bags over there showing it. Remember what I said. They are the worst. They are so dishonest. But you people get it. I wanted just -- by the way, I want to backtrack because there's one thing I want to say about conservatives.","You know, like, like I watch some of these guys go, Donald Trump is not a true conservative. Jeb Bush, here's Jeb Bush. Donald Trump is not a true conservative. You know, he's a low energy person. This guy is going to get nothing done. But he spent $100 million. But here's what happens. One of the things they say is Eminent domain and I talked about Eminent domain.","All conservatives want the Keystone pipeline. Is that right? All, I want it. I want it. I want to make a better deal. By the way, here's my deal. They all want it. They want it. So it's -- So Obama either approves or doesn't. He didn't. Hillary said no good. You know, why Hillary is with Obama on so many things?","Why? Why? Because she doesn't want to go to jail. The man in the front row, he gets it. And you haven't been at one of my deals where you were you? He gets it. Huh, oh, he was at number six, but you know what, she doesn't want to take him on. So she's saying things and she will until the end. She's saying things that which you would never see.","So she's against the Keystone pipeline. So everyone, all the conservatives are for it. But here's the difference. I'm for it too by the way. I'm totally for it. All right. Because what the hell difference does it make? It's a lot of jobs. I don't like frankly, I'm not in love with the idea of taking Canadian oil, and say, you know, what the hell -- I love, I love Canada by the way.","Look, you know, who is going to approve that deal fast? Ted Cruz, he's from Canada. He's from Canada. Oh, I'd never thought of that. This is a first. Ted Cruz will approve the Keystone pipeline because it benefits Canada. It's great. He could be the only guy. He'll run for president, then he'll run for prime minister of Canada.","So anyway, here's where the Keystone Pipeline. Without Eminent domain, you know, these guys are all saying, you know, take a -- Donald Trump is against Eminent domain. Yeah, I want to have a highway built. I want to have a road built. I want to have a hospital. But you know what can't be built without Eminent domain, the Keystone pipeline.","No pipeline could be built because it goes thousands of miles. It goes from Canada down to Texas, right? And it goes through farmland and it goes through a person's house and it goes through -- But without this, and you know, when you look under the Keystone pipeline, they have a whole section dedicated to Eminent domain.","What it means, how we're going to use it judiciously, and all. Now, they take it. They're saying, I'm not a conservative because of Eminent domain. I'm not in love with Eminent domain, but you need it, if -- you're not going to have roads and you're not going to have a country, OK? So I say, the Keystone pipeline could not be done, could not be done without Eminent domain.","It probably couldn't go 20 feet. You got to use it and here's what happens. They condemn, they take the property, they pay you a fortune. There are people that make a living off buying Eminent domain rights because they're supposed to pay you fair market value, but you're negotiating with the government.","So unless you're stupid, you get much more money than it's worth, right? You make a fortune with Eminent domain. So if you listen to them, they talked about it the other day. Donald Trump believes in the taking of property. Well, they forgot to say, you've got a fortune for it, OK? These are minor thing.","So these are dishonest, these are really dishonest people. So Eminent domain, Keystone pipeline, but here's the difference in business, while we're on Keystone Pipeline. Here's the difference. The Conservatives and all the Republicans they want it approved. So you have the Democrats that say no. Although, a lot of the Democrats think it should be approved by the way.","You know that. But you have a group that says, no or you have a group that says, yes. Here's what I say, yes. But I also say, no, but I'm not finished. I also say this for the country. I want to take for the United States, some of the profits. Why should we let them build this massive pipeline using our power of Eminent domain, go through all these farms and through farmland and through cities or wherever the hell they're going, have to use Eminent domain.","I want 25% of the deal for the United States. They're going to make a fortune. They're going to make a fortune. So when they do this pipeline, it's going to be a very profitable thing. And it's really Canada oil coming down. So you know, it's not -- I want to -- I like Canada. I want these people to be happy, but I want the developers of the pipeline to give the United States a big, big chunk of the profits or even ownership rights, like I do in business.","That's what I do. That's what I do. So you won't hear that. Now, here's what's going to happen tomorrow. So simple, right? But these people never think and you've never heard of it. In fact, when I said take the oil, nobody else said take the oil, now everyone says take the oil, right? I said in Iraq. Take the oil.","Nobody else said it. Now, they're all saying it. So with the Keystone pipeline, I want a big piece of the deal. Otherwise, I'm not going to approve it. They will give us a lot. I don't want to be you, know, I don't want to be too greedy. But if I'm greedy, I'm greedy for the country. I want to be greedy for the country.","So when they do the Keystone pipeline, I want it approved. I want all those jobs. I like a lot of oil flow because right now, we're low. But you know, I remember what OPEC would do for us for years. We don't want to ever be in that position, again. But I want a piece of the deal. Doesn't that make sense and you're not going to hear that from anyone else.","So tomorrow you're going to have all these bloodsuckers saying, I have an idea. I want a piece of the deal for the United -- they wouldn't know where to begin. They wouldn't -- you know Carl Icahn, the great businessman endorsed me. Many, many businessmen want to endorse -- even the ones that don't like me want to endorse me because they say, he's the one that gets it. We have corporate inversions going on right now where companies are leaving the United States.","You know, they used to leave Iowa and they go to some other place. Some of them went to Mexico, in all fairness, a lot of them. Newton, Newton, Iowa. But they used to leave Iowa. They'd leave New Hampshire. They'd leave different places. They'd leave New York and they'd go to Florida. Now, they leave our place and they leave New Jersey and they're going to Ireland.","Pfizer is going to move to Ireland. Thousands and thousands of jobs because they can't bring their money back into the country. And because the taxes are too high. My tax plan is an amazing plan. It's just like an amazing -- it's going to make us so dynamic. Larry Kudlow who's a great guy, a great a great guy.","Larry Kudlow said it's a phenomenal plan. So many other people said it's a phenomenal, but it's going to lower taxes for corporations, going to lower taxes for business. It's going to get rid of a lot of rules regulations which is coming out soon because we're being -- I know as farmers, people that have farms are telling me stories that are a disaster.","They can't even take care of their farms anymore. It's so bad with the environmental impact stuff. So we're going to get it back and we're going to bring it back, and we're going to go back to sanity and we're going to do things that are incredible. We're going to do things that are incredible in this country, OK? But my tax plan, you know, we're now the highest taxed nation in the world, and we're going to bring it so that we're one of the lowest.","It's going to be actually one of the lowest. And we're going to become a dynamic force again. Now, all of that money, it's at least $2.5 trillion that's sitting offshore. And this is interesting. The Democrats want it brought back in. It's good. It's money that was made outside of the country, they can't get it back in. And if they got it back in, they'd spend it here.","But they can't because it's so restrictive. First of all, they can't do it bureaucratically, they can't get it back in. So all of that money, $2.5 trillion. But I think, it's much more than that. The government has no idea. They have no idea what it is. Just like they have no idea how many illegals are in this country.","They have no clue. Just like they have no idea what was on the Obamacare website that cost $5 billion. These people have no idea -- that still doesn't work by the way. So all of that money that's offshore. The Democrats want it and the Republicans want it. This has been going on for three and a half years.","They can't get together and they all agree because they have no leader. Every Democrat wants it, every Republican. What's not to want. We want money brought back into the country. They can't get it done. The reason they can't get it done, no leadership. You know, it's one thing if they're opposed, somebody wants Obamacare, somebody doesn't, they have a log jam, that's different.","Here's something, here's something where they want the money to come in for years, and they can't get it done. There's total gridlock. Total gridlock in Washington. And a guy like Ted Cruz can never get it done because he's like, I mean, it's never going to happen. It's never going to happen. You need somebody that can wheel and deal and get things done, and we go back to a system where we don't need as Jack the executive orders.","All Obama does now is sign executive orders. We want this, he can't get it. Boom, executive order. And he'll be out on a golf course in two, three, four or five years, and the courts will start getting these executive orders. And they'll say, what he's saying is look, I don't know if it works or not, here's an executive order, in five years don't worry, I'll be playing golf.","What the hell difference does it make? We want people, remember Ronald Reagan and Tip O'Neill? The country is running good, they got a law and you got Congress, I mean, he's doing an executive order in the Second Amendment essentially, how terrible is that? We can't do that stuff. So here's the story. I started, I was talking about trade.","I was talking about China. I was talking about Japan, millions of cars pouring in, we give them practically nothing. So unfair. I was talking about Mexico. They beat us in trade. They beat us at the border. People are flowing through. Drugs are coming across, pouring across, anchor babies which I was right about.","The fact that somebody has a baby who's an illegal on our land, doesn't mean we have to take care of that baby for the next 90 years. By the way, I'm right. I'm right, and we don't need a constitutional amendment. I was right. The greatest lawyer, some of the greatest lawyers in the world actually said, Trump was right.","But all of these things I talk about. Then you had Paris and you had Los Angeles, and you had various other things happen, and you had different tragedies happen. And then CNN does a poll, who's best on the economy? Trump by a factor of many times, I mean, like in the 60s and 70s. We sort of understand that.","I'll be the greatest jobs president that God ever created. Believe me. Believe me. So the economy, but then they started because of what happened in Paris and what happened in California. The -- then they started talking about who's best on security for the country, Trump. Who's best in the military, Trump.","Who's best to an ISIS, Trump, by a lot, not by like little. And the narrative started changing. I was talking about all the different things, trade. And here's what I say, folks. Trust me. The trade is going to be great. We're going to bring back jobs. We're going to make good deals, not bad deals. I'm going to use the greatest business people in the world, I know many of them, most of them.","I know the good ones. I know the bad ones. I know the ones that are overrated. I know people that you never heard of that are better than all of them. I have the greatest business people in the world. They all want to do it. To them, it's sport. They love the country, some of them. Some of them don't care.","These are tough people. Some of them will move a company out of the United States, if they can save $2. But I know the great negotiators and we're going to now have the best negotiators in the world, negotiating against Japan and Mexico and China and Vietnam, and all of these countries that are absolutely killing us. What China has done to us, is perhaps the greatest theft in the history of the world.","We have rebuilt China. What they've done to us. They've taken so much money out of this country and we owe them $1.7 trillion. Can you believe it? They kill us and we owe them money. Japan we owe them 1.5 trillion. So here's the story. We're going to take care of that, but now it's going on -- we're going to knock the hell out of ISIS.","We're going to knock the head -- remember I am the most militaristic person, the most. I am the most militaristic person. We're going to build our military strong and powerful, but I hope we never have to. It's very important. I don't want to use it. And you know, some people say, well, Trump is very tough, and he might be very quick on the trigger.","Quick on the trigger, all these weak people want to use our military. I'm the one that said don't go into Iraq and I said it in 2003, 2004 because you're going to destabilize the Middle East. I'm the sane one in the group, OK? But I want to have the strongest military. I want to make it bigger and better and stronger, and technologically nobody can compete because I don't want to have to use it. And going along with that, I got a lot of vets up here.","We're going to take care of our vets. We're going to take care of our vets. Our vets are not being treated right. We have illegal immigrants that are being treated better than our vets. They're not being treated right. They're going to be treated right. They're our greatest people. They're going to be treated right.","So look, in closing, I just want to say this. It's been wonderful. You can read all the Time Magazine cover stories you want. In my opinion, if we don't win, we all wasted a lot of time. You've got to February first, you've got to go caucus. You got to go caucus. Otherwise, we're going to have something -- it's, it's amazing.","Here's what they're saying, they're saying if Trump wins Iowa -- so you're giving me a lot of power there. If Trump wins Iowa, he's going to run the table, meaning he's going to win al most -- if I don't win Iowa, and honestly, anything's possible. If I don't win Iowa, I have to go to New Hampshire where I have a massive lead like a 20-point lead, a big lead.","Incredible people in New Hampshire, incredible people there too. If I don't win, I'm going to go. And I think, we're going to win anyway. I think, we're going to win because New Hampshire is strong. South Carolina is through the roof. We have a 28-point lead or something there. We have a huge lead in Nevada.","The SEC, I'm doing great. George has been amazing. I told you about Florida 48%. So what if I can win Iowa, I'm telling you, we're going to run the table, and it's going to be important. And I honestly think, first of all, I want you to do what's right. I want you to go for the person you -- but I honestly believe, I honestly believe, it's very important because you have not had a winner in so long.","You're going to have a winner. I give you my word. You're going to have a winner. We're going to make our country so good. I love you. I love you. Love you. We're going to make our -- thank you, and I love you, too. I love you, too. I do. We're going to make our country strong again.","We're going to make our country smart again. People are going to respect us again. They don't respect us now. When you see 10 young sailors sitting in a boat on their hands and knees with their hands up in the air, and they're in a begging position, and you have thugs with guns to their head making them say whatever they want to say, and the only reason we got them back is that, they happen to be smart, the Iranians.","They got two days later, $150 billion. So if you didn't have that, those sailors would be there until about February 1st of next year. They would've been back here long before that. That I can tell you. OK, that I can tell. But, but I thought that was a very humiliating -- does everyone agree? Was that humiliating for us? Believe me, if the $150 billion wasn't coming two days later, those people would be over there for years to come, if you had a normal president.","So here's the story. We're going to win again. We're going to win a lot. We're going to make our country great again. We're going to be very proud of these days. But you have to go out. You have to caucus. The more of a mandate we can win b,y and I don't want to come in second, I'm saying it, there. If I come in second, every word I say up here is going to be played all night long.","Oh, Trump was humiliated. OK. I don't care. They can say whatever they want. I want to come in first. We need a mandate. We want to take our country back. We want to be the smart country again. We want to do things that we never did before. We can be stronger and better than ever before. So what I'm asking you.","February 1st, go caucus. Stay there, get that thing done. And we are going to have a lot of fun for a lot of years, OK? I love you all. I love you all. Thank you. Thank you. Thank you. Thank you very much."],"text":" Hey, what a day. Just got back from church and it was good. It was really good. I learned something we talked about humility at church today. I don't know if that was aimed at me, perhaps. Now, the church I don't think knew that I was coming. So maybe, it was just by luck. But we talked about humility. So this is crunch time. We're coming down to a point, we're just about a week. A little bit more. And I just hope you get out there and caucus and do your thing because if we do it, we're going to have an unbelievable victory. We're going to have an unbelievable, we're going to -- just look at all these beautiful hats, Make America Great Again. We're going to follow what it says. We're going to make -- look at that. We're going to make America great again. We're going to do such a great job. And you know, when I went onto this journey, June 16th down the escalator, remember the famous escalator ride. I will tell you that takes guts. It took guts and it took certain courage and it's not something I've ever done. And you know, politicians they run for office, they win they, lose they win, they lose, they don't care. They're all talk, no action. That's what their business is to run for office. With me, I've never done it before. And the receptivity has been incredible. The polls have been amazing. Just like this room is packed and every room is packed no matter where we go. We have the biggest crowds by far. We have much bigger than Bernie Sanders has, who's second. Now, we have the biggest crowd. They never talk about my crowds. You know, the press never talks about it. They always -- but when somebody else has a crowd. So I tell you, last week we had 12,000 people, Bernie Sanders had 3,000 that's good 3,000, and he is second. Way, way down the line. But he's second. But we're having these incredible crowds 20,000, 35,000 people. And Bernie Sanders has 3,000, and we have 12,000 and they talked about Bernie Sanders, and they said, he had 3,000 people, it was a great -- then they talked about Trump. I had 12,000 and we had to send 5,000 home because we couldn't get them in. But you know, they didn't mention that. They don't mention it. And I always say, the cameras they always are on my face. They never want to show the crowds. It's an incredible thing. But it's OK because the people get it. The people are really, really smart. And somebody asked me the other day, what was the thing you most learned and I learned a lot. But because this has been sort of an unbelievable journey. Hello, darling. How are you? Look at -- I love these people. We have the most loyal people too. We have the most loyal. We have and that's the other thing I learned, the loyalty, you know, the other they do polls and everything. They do polls on the debate. We win all those polls on the debate. We have another debate coming up on Thursday, and I think, that'll be fine. But we win the polls in the debate. But you know, they have -- I mean, I don't know if it's going to be fair. But we'll handle it one way or the other, OK? It's what we've got to do. But you know, I learned the level of loyalty to our movement that it's really to me, but it's really beyond me. This is a movement, folks. This isn't like a normal situation, we're the cover of Time Magazine this week. With a really fair story, a really professional beautiful story about the fact that there's never been anything like this. There's never been anything like this. It's been an incredible journey. They they've -- they're going to study it and I get calls all the time for reporters, one in particular, how does it feel to do what you've done? I said, I haven't done anything because unless we win, we're just wasting our time, folks. We're just wasting our time. That's why on February 1st, you got to caucus. You got to go out. You got to do it. I jokingly say, no matter how you feel, if you're feeling sick, if you're having fights with your wife or your husband, no matter what -- no matter what's going on, if you lost your job 15 minutes before, if they said you're fired because the economy stinks which it does, if -- no matter what happens, you got to get out and caucus because we're going to change things. We're going to change it. And it's just been very exciting, and the chairman just told me that so many calls are made, and I want to thank Jeff. He's fantastic by the way. He really is a dynamic guy and a great guy. But he just he just had -- so many calls are coming in where people want to change their party. I've been saying this is going to happen, where they're going from Democrat to Republican. And he said, he's never seen anything like it. He's been doing this for a long time. People outside -- whether it's Republican, honestly, whether it's Republican, Democrat, Liberal, Conservative, they're sick and tired of seeing our country ripped off by every single nation in the world. They're sick and tired of it and we're going to stop it. So yesterday, couple of things happened, but during the last week, we had a wonderful woman, a really wonderful woman who the press does not treat fairly, but these are minor details. Sarah Palin came out and endorsed us. And she is a wonder -- if you knew her personally, you'd understand even more so. I mean, I can see even from that that everybody likes Sarah. But if you knew her, she's an amazing woman. Her husband Todd is fantastic and we get a call, we'd like to work with you, we'd like to endorse you. And I said how nice is that? And I thought she'd go to Ted Cruz because, you know, she endorsed him for senator. And he was at 2% and he'll tell the story. He was a 2%, she came and endorsed him, and he became the senator from Texas, even though he was born in Canada and was a Canadian citizen it's a -- I don't know, maybe if she knew he was a Canadian citizen at the time, she wouldn't have done that. But it was sort of interesting, but she she's amazing and her level of success with endorsements is tremendous. And the press does not give her her just do. But I will tell you, she's a wonderful woman who loves this country. And I was so happy to have her endorsement. And a lot of the fans were so I want to thank you, Sarah who's probably watching because we have all those cameras on right now. We have a lot of cameras, right? We have we have a lot of cameras. A couple of things you know, we'll talk about individual, individual candidates for a little while. Should we do that? I think so, right? We have to go through the whole thing. I could -- should I go through a couple of polls, no? Yes? OK. So Fox just came out. Big, big turn 12 or 14 points. Trump is up. You heard about that right? Trump is out in Iowa. And now the rest of that -- you're still lagging behind everybody, folks, OK? Because the rest of the nation -- I mean, we are just through the roof. We -- we had a poll yesterday 48% and we had another one 42%, and we have him at 36%, 38%, we're doing great. That's on a national basis. We're doing unbelievably -- also numbers came out from Fox and CBS this morning for New Hampshire where we're through the roof. In South Carolina, through the roof. All of them, Nevada, all of them. And really, I'm so happy because I spent a lot of time here. And I love the people of Iowa. And I think we're going to win Iowa. And you know, it's much easier -- even my people they say please don't say you're going to win because if you come in second, it's going to -- I said that's OK. I want to win. I want to win it. Iowa's very important. First of all, you haven't had a winner in 16 years, folks. It's time, OK? It's time. It's time. That's it. Look at that person, Make America Great Again. You better believe it, man. Thank you. Think of it. I'll put this -- you have not picked a winner in 16 years. If you choose me, we're going to finally have a winner. You know, they want to move you, I hate to say it. They want to move you to the back of the pack. You know that, right? There's a big move that Iowa was not going to be where you are now. First, with the caucus and they want to move you. And I give you this pledge. I win, they are never ever moving you. You're staying there, OK? You're staying, 100. You are staying where you are. And you know, honestly, regardless of me, and it's a great tradition here. It's an amazing thing. It's an amazing, it's an amazing place. It's a great place and you're going to stay where you are, and I think we're going to win. So I'm not saying, oh gee, I'm going to be thrilled if I come in second. I don't think we're going to come in second anymore. You know, I'm looking at what's happening. So there's a theory that I'll do much -- even though I'm leading all the polls, I'll actually do better than the polls. And people said, well, they might not poll. I mean, you know these polls with Trump, they were saying and one of the people this morning was saying not even a fan. But he said, you know Trump is going to win. You know, the whole thing. Trump is going to win. He's going to be the nominee and he probably will do very well against Hillary because look at what he did last week against Hillary. Look, I was the best thing that ever happened to Bernie Sanders because my attack on Hillary. All of a sudden she went down and Sanders got all the credit for her, right? This guy, I mean, you know, this guy Bernie Sanders give me a break. How does he figure this whole thing? But he got all the credit. It's unbelievable. So I have to say that once, I assume the press is listening today, but I had to hit her because she said false things about me. So I hit her hard but I haven't even focused. You know, on the Fox poll and another poll that just came out, that I'm beating Hillary and I'm beating Hillary. I'll beat Hillary. But I haven't even focused. We haven't even focused on Hillary or Bernie Sanders yet. I mean, here's a guy who's a -- well, they say socialist but some people would say he's a communist, OK? But I shouldn't hit him too hard though because if I hit him hard, he'll go down and then it'll be more of a fight with Hillary, and maybe we want him to fight for a while. So I'll say, isn't he a wonderful guy and wonderful -- I don't want to hit him too hard. It's interesting. I was thinking, I never thought of -- when I hit Hillary last week and Bill, but I did the right thing. But all of a sudden they did this and then they start saying Bernie Sanders is surging, an amazing thing happened. I did it. I'm saying I did that. So name -- now maybe, I should hit -- oh, I could hit him. I have stuff in my mind. I could hit him so hard, he would drop, he would drop. No, he's, he's, no. He's too easy. He's too easy. He's really too easy. But -- so look at these candidates that we're against. We have -- you know Jeb Puja. We have Jeb exclamation point and I talk about him, and the only reason I even bring him up, honestly, he's spending millions of dollars of negative ads. Nobody else is hitting me with negative ads. Jeb Bush, here's a guy spent close to $100 million. The polls coming out this morning, he went down. He's down at the bottom. It's time to give up Jeb. It's time to give up. Now, you know in life, in life sometimes you have to admit when you don't have it. He doesn't have it. He doesn't have it. And I don't like people -- here's a guy, takes his ads, vicious ads. He is not a conservative. He is not a true conservative. What the hell does this guy know about me? He said, he will not win the race. Well, if he's so good, how come I'm beating him by 38 points. You know, it's like, unbelievable. He will not win. He's at three and I'm at 42 when he's say. Oh, these people that you have. I don't know, we're going to have to do something about it. But I mentioned it, but here's this guy, spent almost $100 million. I spent almost nothing. You know that. I'm guilty. I feel guilty. I was supposed to spend now it's up to almost $40 million. Yesterday I was talking about $30 million and my people said, I had a budget at this point to have spent $40 million, by the way, I'm spending my own money. I'm not using other people's money. I'm the only one. I'm the only one. I'm the only one doing that. Everybody else, Hillary and, and every single candidate, every single candidate is doing what they're doing, OK? So you have Cruz. I mean, Cruz is getting oil money, by the way, he is so against ethanol, you can forget it, OK? You can forget it. All of those wonderful farmers that produce what they have to produce. Cruz is totally against -- then he changed, they're like said, well, he's very principled. He's not so principled because a couple of weeks ago he changed, and he got a little bit more and he changed again, got a little bit more. What's that about principle? If he's against it, let him be against it. But he was against it strongly, getting killed, and then he changed and he changed twice. So -- but by the way, and he'll change back so fast because who's giving the money? Oil people are giving him money. Nobody's giving me money. I turned down so much money. I feel so foolish. I feel so -- you know my whole life I take, right? Greedy. I take, I take, greedy, greedy. Now, I'm going to be greedy for the United States. I'm going to take for the United States. I'm going to be so greedy. We're not going to have any more of these deals with Iran where we give them $150 billion, $150 billion. We should have never given it and we should had our prisoners back years ago before the negotiations started. You don't start the negotiation unless they give us back our prisoners. You don't start it. You don't even think of it. I tell that story all the time because it's amazing. You go in, right? They have our prisoners. They actually had three, then they had four, and by the way, it's going to set a wave of kidnapping like you've never seen before. You watch. People see that deal and putting that deal together with the other, it's going to set a wave. If they would have done it my way, you wouldn't have it. You walk in they're going to say, let's start. We're going to say, we have to have our prisoners back. They're going to say no. We're going to say can we have our prisoners back? They're going to say no, you walk out. Why didn't they walk out? You walk out, you double up the sanctions, they will call you within 48 hours, assures you standing here. Sorry couldn't get you seats there are too many people. There are people outside still trying to get in. They will call you, as sure as you're standing here, and they'll say, you've got your prisoners. OK, now you get the prisoners. Now, you go in and say listen, there's one other minor item. We can't give you back the $150 billion. What do you mean? What do you mean? You know, the Persians are great negotiators. We have, we have guys that are better. We can't give you back the hundred -- we want to get the prisoners back for us. This is what we should have done. Now, we would have had our prisoners back and we didn't make any deals. We got our prisoners back. You say now, $150 billion, can't give it. We're a we're a debtor nation. We're bust. We've got $19 trillion in debt. We can't give you the money back. You know, want to take the lumps out. My father always used to say, yeah, take the lumps out, take the lumps out. Make it nice. So instead of saying, no we're not giving it to you. We've got $150 billion, we don't have the money. We owe $19 trillion now with a stupid budget deal they just made. You believe that deal two weeks ago? Now, we're at $21 billion because that's going to -- trillion. So now, we're at $21 trillion, trillion, trillion. So we say to them, we can't do it. We have $19 trillion, we're going to be $21 trillion, and they're going to be angry. And so what you do is you leave the room and that's the end of that. And they'll call you back, you double up the sanctions, and they'll call you back and you start. Now, you don't have to give them back the money because what they made in that deal is so 24-hour inspection periods. What they did is so incredible. We could have had a great deal. I like the idea of deals. I think deals are good. I mean, one of the problems with Ted Cruz is everybody hates him. I mean, he's such a nasty guy. Everybody hates him. He can't talk. Think of it. Not one United States senator has endorsed him. Not one and Senator Grassley yesterday was with me and introduced us. I mean, what a wonderful guy he is by the way. Senator Grassley you have a -- he's a great guy. But think of it. This is something wrong when you deal with people on a daily basis and not one person endorses you. There's something missing there. I mean, there's something bad. And with me, remember this, he hit me first during the debate. No matter what I did, no matter what -- I could have done anything. He was backing me up, right? I said this guy seems like a nice guy, more than anybody else. Carson actually back me up very nicely, and he was a good guy too. Carson, Ben Carson, nice guy. And a couple of -- I mean, honestly, I like a number of them that are running. But with Cruz, he was so positive, everything was great. I did the Muslim, great, because somebody has to do it. Somebody has to say what's going on, I mean, we have radical Islamic terror going on all over the place, all over the world. And we have a president that won't say it. He won't even talk about it. So I did that, he was fine with that, a lot of people weren't. And now they are. You notice the way now they're saying well, you know, Trump does have a point, why think so? I have a point. When planes fly into the World Trade Center and into the Pentagon, and wherever the third plane was going. When people are shooting their friends in California, when they're shooting their friend -- bye, Goodbye. Goodbye. Goodbye. No, He wasn't wearing one of those hats, was he? Was he was he wearing one of those hats? And he never will, and he never will, and he never will. And that's OK. But you know, we got to do something for us because it's not working. And all over the world, they're talking about it and people, frankly, I have friends that are Muslims, and they call me up. Not all of them, but some of them, and they said, you're doing a great service because there's tremendous hatred. And we have to get to the bottom of what's going on. When you have people that go -- these two that got married, these two young people that got married, they were radicalized. And they go in -- to people that gave them wedding receptions, and gave them parties when they were getting -- and then, you shoot them, you kill them. You kill them. And then you have in Paris, where you lose 130 people that don't have guns. And by the way, we're going to protect the Second Amendment if I'm President. That I can tell you. That I can tell you. You know, if in Paris the toughest gun laws in the world in Paris, the toughest they say in the world, who knows? But the toughest. In France, the toughest gun laws in the world as a country, can't have a gun. And yet, the bad guys can always have a gun, right? So if I had -- and I'll pick out some people. You with a white hat, right? If I pick out you, you right there with the sign, you. If I pick out a few people out of this audience. I could pick out almost anybody. If you had a gun and the bullets were firing the other way in Paris or in California or remember the military officers, the five that were killed. The military officers that were killed on a gun-free zone, on a military base. That's going to end the first day, no more. No more. But if there were some people in there with guns, you wouldn't have 130 people killed. It would have been a much, much smaller -- and you know what, they wouldn't have been looking for the guy with the dirty hat. Believe me. They wouldn't have been looking for him for long. They wouldn't re -- and you know the other thing, the press. And they have been good about this because they're very dishonest group of people. The guy with the dirty hat. They called him the mastermind, right? The mastermind. And for two days they're looking from him, they call him the mastermind to miss him. Now what did he do? He sent people into a different couple of places in Paris, right? He said shoot everybody that you can. What do they get? What's going on? This is the mastermind. And so the president -- the mastermind does -- we think we have him under control. We think we found him. We don't know. He's a brilliant man. They don't even know who the hell he is. And then you see him, and I called him right from the beginning. The guy with the dirty hat. Probably got a very low IQ. He's a moron. He's a frickin' moron, OK? And the press, No, the press is calling -- and then they wonder, they're calling the mastermind. And then, they wonder why our youth is being radicalized. What's happening with the youth. And they're wondering -- you know they're using the Internet better than we use it, and our guys invented it, right? Because they're hearing oh, dad, the mastermind. He's a mastermind. He's a moron. He's a dirty, rotten moron, and we kill them fortunately. And the cops in France, they did a great job, and the cops in California they did an amazing job. I mean, our police, I'll tell you what, the most mistreated people practically in this country, two groups, our police and our veterans. Remember that. I mean, I looked at what they went through in California with all the shooting going on and all this stuff. And I tell you what, they did a hell of a job. Same thing honestly, in France. The police are tremendous people. And you know what, if you have that one 101% where a horrible thing happens or where a mistake happens or where a guy chokes and he does something you shouldn't or there's a bad policeman. That can happen too. That's huge story all over the world, all over. They play it up, but they don't talk about all the good things we wouldn't be here right now, if it wasn't for the police. So I tell you. Yeah, give them a hand. Give them a hand. I've had so many endorsements from police all over the country. Yeah, the police and -- I just respect them a lot. I mean, they go through a lot and I mean, they're afraid. Every time nowadays, every time they're afraid to talk to anybody. They'll talk to somebody, if they're a little bit rough, they end up losing their pension, their job. I mean, it's terrible, what's going on with our police. People are afraid to call them. People call the police, I mean literally, I've had policemen that are tough, tough cookies where they're literally afraid to be a little bit rough with people that are really bad people because they're afraid they're going to end up getting brought before the commissions and lose their job. So we've got to, we've got to cherish our police officers. It's very important, very important. So, so the one guy Bush spends $100 million, he's down here and I say to myself, why do I talk -- and the only reason I mentioned him is because you get angry at it. But here's the story, if we could do what we've done. I've spent nothing, practically. I mean, the biggest expense is my airplane and I own it, I have to pay myself. Do you believe it? It's true. I have to pay myself because I own my airplane. So I pay myself. So at least I have an expense but you know, you find the market value of the plane, you pay yourself. The whole thing is ridiculous. But I spent very little money, but I'm going to for two reasons. Number one, I feel guilty. There's going to be up to about $40 million, I spent peanuts. I feel guilty. And number two, I don't want to take a chance. I don't want to be a wise guy because oh, I'm going to win without spend. I'm willing to spend whatever the hell it takes, I'm going to spend. I don't want to be a wise guy. But one line that I hate getting rid of. It's so cool to say that you've spent the least. I've spent less than anybody, just about. You've spent the least and you're by far number one, right? It's so cool. It's so cool. And I don't really have to spend, a lot of people say why you're doing good? You don't have to. You know, I get so much of the -- they call earned media, earned, meaning they have you on television because I get good ratings. It's very simple, right? You know, Face the Nation, a show, a very good show. John Dickerson. Face the Nation last night, and I got to be straight, look at all those cameras, you think if I was wrong on those, do you think I'd be -- headlines, Trump said this. OK. Face the Nation put out a release last week. You know, Face the Nation, right? Big show, big show, CBS. They put out a release last week. I did a show a couple of weeks ago from Florida where I'm leading 48 to very low numbers, OK? I'm very, I love Florida. We're going to win Florida. We're going to win a lot of states that nobody ever thought about winning for Republicans I tell you. But Face the Nation put out a release last week that they had their interview with Donald Trump. Long interview from Florida, that it was the highest rated show they've had in 15 or 16 years since the fall of the World Trade Center, highest rated show. That gives you power, that gives you power. And when you look at the debates, I mean, Fox had 24 million, CNN had 23 million, CNN says it's the largest show they've ever had in the history of CNN. Now, they cover wars or they cover big events. The biggest ratings they've ever had was the debate. Now, I know they're not watching Jeb, and I know, you know, he's a low energy person. I know they're not watching Ted. He's a wonderful guy but they're not watching Ted. I know -- I don't want to insult the rest of -- I mean, I get along with people. I want to be nice. I don't want them call me, why did you say that about me? So I'm not going to say all the other people that are up on the stage. But if you look at four years ago and eight years ago and it used to be like a throwaway. Nobody even wanted to broadcast the debates. They had to do it as part of their licensing. They didn't even want to put them on. Now, it's like they can't get enough. The debates are coming up, the big debates. I mean, it's crazy. I won't take credit for it. But every magazine, they call them the Trump debates, variety all these, the Trump debate last night sort of crazy, right? But it gives us, not me. It gives us some power because we are the silent majority that's turned to be the noisy majority, with a noisy. And it gives us power. And by the way, the same thing with Meet the Press, Chuck Todd he's a nice guy. They were down in the toilet with the ratings and then I agreed to a show finally because he started treating me with respect. And I agreed to do a show, he went through the roof. They had millions of people watching. They all said, what happened? And he's going to go in and get a raise now, probably. And George Stephanopoulos, we do his show, it goes through the roof. So it gives us and CNN by the way, good guy there. And it went, you know, they get good ratings. It gives us power. Now, they don't actually care about the poll numbers. I care more about the poll numbers. But I have to tell you, when I see those ratings, it makes me feel good because that means that people are listening to our point of view. That's what it means. That's what it means. So, so what's happened is an ad was put out by Ted Cruz and it was so false. And it's about Eminent domain and they make eminent. Most people don't even know what Eminent domain is. You know, Eminent domain that's where government takes property for a full payment. They pay you. They don't just take it. They call it a taking. It's called a taking. But it's a taking, but you got paid a fortune. Frankly, more than you'd ever get because you're dealing with politicians. And politicians as we have learned over the last twenty five years, they pay too much, right? So if you are building a road. If you're building a highway because let's say you have a community like this, and look at all the people, and you need roads, and you need highways, and you need schools, and you need hospitals, and you may have somebody that has a little farm, and the corner of their farm makes it impossible to build let's say, a school or let's say a hospital or let's say, you can't build a highway because the farmer says I do not want to sell under any circumstance. You have a highway coming except to have a prob;lem. You can't get the land, right? It's called Eminent domain. So what they do is, they'll take that sliver and they'll pay you a fortune. They say it's fair market value but it's really more than that if you're smart. OK. So they had this thing about Donald Trump Eminent domain, and that I had something to do with. You know, there's an economic development project where I would have loved to have used Eminent domain. Ultimately, I didn't use it. They said in the ad that I did. They said I ripped down this house from an old woman. Never happened. I didn't go forward with it. If I did, we would have had thousands of jobs, it would have been a big hotel and all that stuff, but it didn't go forward, it never happened. But they showed me ripping that -- they have something a bulldozers ripping down a house. It's just all false stuff. But let me tell you about Eminent domain. All of these conservative people, the National Review as you know is a dying magazine. Does anybody here read it? Nobody. So they do this, I mean, it's dying. The thing is dead. It's a doornail. It's going to be closed. I bet it's closed in a fairly short period of time. And it's a shame, but what they did is they have a couple of guys at the lead, and they took people and they wrote and they got some publicity. And it's probably the best thing that's happened to me because my poll numbers just went through the roof because nobody respects these people. These were the people -- these were the people that said very strongly, Trump will never run. If he does run, it's not going to happen. Don't even talk about it. So then I ran. Then they say, he'll never sign for May, which is a forum where you basically sign your life away. You know, it takes guts to run for president. I went -- I never did this stuff before. So today, I signed for May. Then they said, well, he'll never put it in his financials because his financials, maybe he's not as rich as everyone thinks and he doesn't want to hurt his image. Well, I turned out I'm much richer than anybody ever knew. I mean, I put it in these financials almost 100 pages, almost 100 pages of financials, right? And they were great. Big great jobs, Doral in Miami and Turnberry in Scotland where they play the British Open, and so many different -- so many different things, all the stuff in Manhattan. And it turned out to be great. Low debt, tremendous cash flow. Some of the best assets in the world, and the only reason I tell you that is because, and it's not as a Braggadocios. Although, if I didn't run, I probably would have put it into because I wanted people to see it. But these guys went down, they said oh, this is bad news. I mean, not -- and I put them in where I didn't ask for extensions. When I put it in, they said, well, he'll ask for an extension because you're entitled to many, many extensions. And some of the politicians who filed like a one or two page report they asked for extensions, OK? So I didn't ask for extensions and people couldn't believe it. The only reason I tell you is that's the kind of thinking our country needs to make us great again, and rich again, and strong again, and solvent, and all of these things. I mean, we have as an example with China, we have political hacks. They're political hacks that are negotiating and we have a trade deficit with China of 305, well, actually it used to be, it's now actually, I heard just this morning it's more accurate number, five, listen to this, $505 billion. We have a trade deficit, $505 billion. And then Obama says our partner China. I love China. I know everybody. These people come to me. They buy my apartments. The biggest bank in the world is from China. They're a tenant and one of my buildings in Manhattan. I mean, I do great with China. I own a big building in San Francisco along with a group. That's a great group. And we own the bank of America building in San Francisco. Nobody even knows that. I own another in 1290 Avenue of the Americas through China, where I win. I mean, I had wins. That's how I got them. I beat them. I beat China. But I have wins. We got to have wins. We don't win. Our country doesn't win anymore. So I tell you that only because that's the kind of thinking we have. Because we have people that are real stiffs. We have people that should never be doing what they're doing. Should never. So I look at this stuff and I see what's happening, and I look at Ted and I say, wait a minute, I put in this report and all of these people, that for the National Review, they were all saying I wasn't going to run, I was going to file, and never file financials, you know. And by the way, when I found my financials, it looked like Grand Central Terminal in front of the Federal Elections Commission with reporters. Oh, they were going to give me, they were going to get -- so what did they get instead? Ted Cruz with a couple of pages. He forgot to say that Goldman Sachs gave him money. He forgot to say that Citibank gave him money. OK, because he's a man of the people. He's Robin Hood, right? He's this great man of the people, even though nobody likes him, even though no senators endorsed him, even though all of this, and he's a nasty guy. He's the man of the people. He's going to help people. Well, he doesn't want to know that he borrowed from Goldman Sachs because let me tell you, Goldman Sachs has him. Citibank has him, OK? He's going to come out with rulings that are negative at Goldman Sachs and he's got personal guarantees with Goldman Sachs. I don't think so. So he said, oh, he didn't know. He didn't know. Oh, I didn't know. You know, guy's got two banks, he got two loans or may have more than that. But let's assume he has two banks, two loans. How do you not put that on your personal disclosure form? How do you not put it? It's impossible. Smart guy. So you know that your banks and you didn't put them. He didn't put them because he didn't want you people to know that Goldman Sachs, that he owes money to them, and that you got guarantees to Goldman Sachs. And then, you got loans at way below interest, he got very low interest rate loans called favorite nations loans. He's got low interest rate loans. They're very favorable rates, in other words, they're like peanuts. So when Goldman Sachs goes to your Senator in Texas, in the case of the people from Texas, and they say, we got to have this. We got to have that. He's going to do it. The nice part about me, I'm not taking anybody's money. I'm not taking anybody's money. The other problem with Ted is that, as you know, and has come out very strongly, Laurence Tribe, great lawyer, great constitutional lawyer from Harvard said this is an unsettled matter. This great constitutional lawyer. Other lawyers have since come out, saying he can't run for president. He can't. I don't know. What -- maybe he can, maybe he can't. I don't know. He should go into court and seek a declaratory judgment because the people voting for Ted, for Ted Cruz, those people. I think, there's a real chance that he's not allowed to run for president. I know this. He can run for prime minister of Canada. He was born on Canadian land. It's true. People actually laugh, it's actually true. He qualifies because he was born on Canadian soil, right? He was born in Canada and then he said another beauty. So he was a citizen of Canada until 15 months ago. Did you know that? Does anyone know that? He's a citizen of Canada. So he's a joint with the United States. So he's a citizen of Canada. And they said, you know, you're nice -- Senator, you're a citizen of Canada. Somebody found out. These reporters they ultimately find out everything whether we like him or not, right? Much of it's false stuff, but this happens to be true. He's a citizen of Canada. And they said, you're a citizen of Canada. Oh, I didn't know. So he just said the other day, they said, how could it be that you're a citizen of Canada? He said, he didn't know about it. OK. So he didn't know he was a citizen of Canada. And there are advantages to being a citizen of different places, you understand that. So he didn't know he was a citizen of Canada and he didn't know he had loans out to Goldman Sachs and he didn't know it was a known -- I mean, come on folks, look. Are we babies? Are we babies? So we're going to find out what happens. We're going to find out -- and then he makes a false ad about me that I'm ripping down some woman's house that I ultimately said, forget about it, does not work. And by the way, I saved a fortune. Because it was in Atlantic City, I left Atlantic City like eight, nine years ago. Atlantic City has totally collapsed. I made a great deal. The smart people give me an A for vision. I left. I mean, think of it, I would've built this tower at Atlantic -- I mean, so the woman did me a big favor by, you know, not wanting to sell, but I never ripped down her house, and she was perfectly fine. I never ripped down her house. They show tractors ripping down a house. That's really, you know, it's false stuff. OK. It's not nice. He should actually give me an apology. Do you think he'll apologize? I don't know. But he should. He should give me an apology. He said I ripped down her house. They show a tractor ripping down something. It's not her house because I didn't rip it down. But they show this big beautiful, could be a John Deere but I think it was a caterpillar, that it was -- that was before, right? That was before started doing all the business because Japan has so devalued their yen that it's very hard for Caterpillar and John Deere. And by the way, speaking of John Deere, we love John Deere. I buy millions and millions of dollars worth of equipment. Millions. So Ted has a problem and I -- you know, I don't know what the problem is, but I can say that the polls that came out this morning, there's been a tremendous turn, 12 points, 14 points of a swing. And we're way up. And he went way down. So we'll see what happens. Look, ultimately, you got to go out. You got to caucus. Who knows what's going to happen. If you don't go out, we're not going to make this country great again. That I can tell you. If you don't go out and do it, then you have these people at National Review. OK, I'll talk about that for a second because it's gotten a lot of publicity. It's a failing magazine. Got no influence whatsoever. And you have one guy, Brent Bozell, he's up in my office. I don't even know the guy. He's up my office asking for money something to do with advertising or something. Money. I want money. A while ago, I want money. I said, what is the guy -- he's asking for money. Who is this guy? So he's up asking me for money, right? So I think, I might have given him a check for his charitable contributions, something, this is a long time ago before I was thinking about doing this, and I gave him money. Then he calls again, he wants more money. And I said, hey look, you know, you could be rich, but what the hell do we have to give money to -- I'd rather keep it or give it to charity or do something with it, right? So Brent Bozell, the next time I hear his name, I'm writing a piece about Donald Trump and what about. I guarantee you, folks, if I gave him more money, you end up giving it for the rest of your life. But if I gave him more money, it would have been fine. He wouldn't have written the piece. But then you have what's his name, Glenn Beck. Glenn Beck. How about Glenn Beck always crying, every time I see him. He is -- you know why he's crying? because Fox fired him, OK? And now, he's got a loser going on, the things a total loser. But in all fairness, I don't blame him. He asked for an interview. A lot of times, I'd been really busy and don't forget, until I did this, I was really sort of not thinking about this, and maybe I was going to do it maybe. So I didn't give him an interview, only because I was busy, not because of any other reason. I didn't give him an interview. And I probably would have acted the same way as him. He called my people and then all of a sudden, I go to a first place because you know I've been in first place almost since the day I announced. Can you believe that? Almost as -- and probably my people, you know, when you go to first place, your people all of a sudden become geniuses, right? Oh, well, we wouldn't give him an interview. They're probably giving him a hard time. Anyway, I never gave him an interview. I should have given him ended -- an interview and I didn't do it. So I didn't give Glenn Beck an interview that he asked for many, many, many times, called me up said his father's in the hospital. His father was sick and not well, and in the hospital. And I don't know how that worked out. I hope it worked out OK. But he's telling me about that. I said I'll do your show, I'll do your show, I promise, I'll do your show. Bottom line is probably called up and we didn't do a show. It comes out against me. That's all it is. If I did interviews with him then, he wouldn't have done it. That's the way life is, folks. I mean, you know, this isn't something -- you don't learn this at the Wharton School of Finance, OK? But that's the way life is. And I don't blame him. If I called somebody and I had a network, a failing network especially, if I had a network, If I had a network and I called somebody, and they wouldn't do the interview, I wouldn't -- and there was just no reason other than I got enough things to do, right? Because I would have done it. If I called somebody and they wouldn't do it, probably I'd be swayed to knock the hell out of them. Why wouldn't I, right? You know, so they came out with this stupid cover about, you know, they got 22 guys. I mean, these are just two examples, I could go over others too, and some of them are very nice people. I was actually surprised and a lot of them weren't even very vicious. Some of them I actually thought they wrote positive articles about me. But they did this and they're trying to sell some magazines. And I don't know, if it might sell this one. But basically, the National Review is finished. It's a dead magazine and they came out, and they tried to do something that was good. They got some publicity. I think, it probably helps me. I mean, probably it helps me. So here's the story. We have a very, very major election coming up. I think it's going to be the most important election that we've had in modern times. Our country is going to hell. We have people that are incompetent leading our country. We have people that are frankly, you know, they like to say, Trump likes to speak. You know, I'm an Ivy League. I went to an Ivy League College. I went to the Wharton School of Finance which is the best business school in the world. I'm like a smart person. I always say. I'm what -- I always say my uncle, my uncle, you know, because I do believe in the racehorse theory, right? You know, slow horses don't produce fast horses, right? You know, the old racehorse, but my uncle was a professor for years up and a great Engineer, Dr. John Trump at M.I.T., like one of the most brilliant people. And you know, like we're smart. The people in this room are smart. My people are the smartest people in my opinion because they get it. My people, my foll -- these are the smartest people. The most loyal and the smartest. The most loyal and the smartest. But you look at what goes on and we know and we see, and they always like to say, he's plain spoken. I don't know, is that a positive or not? You don't have -- you don't need a plain spoken person, but think of it. When you have a word to describe your leadership in this country. What's a better word than the word stupid. There's no better word. Now, I can come up and I can go to Thesaurus, I can go to different things and come up with other -- but there's just no better word. Am I right? I used to say incompetent and that's pretty good, but stupid is better. I mean, it's better. When you look at these deals that we make. When you look at what we do with China. When you look at what we do with Mexico. Mexico, they're friends of mine. I employ, I employ thousands of people over the years. Tens of thousands of Hispanics. And in Nevada, I'm leading. The polls just came, I'm leading in Nevada with Hispanics, and I said I'm going to win with Hispanics. And I'm going to win with African-Americans, too. I'm getting great numbers with African-Americans because I'm going to get jobs for people. I'm taking our jobs back. What has Obama done for African-Americans? They're in relatively speaking, the worst shape they've ever been in. You look at kids, they're 58% unemployment. You look at people that are 35, 45, 50, in their prime, their unemployment is through the roof. So Obama's done nothing. I mean, with him it's all talk. He's like a typical politician, all talk no action. I mean, just a bad guy. I'll tell you what, I'll tell you what, I thought Obama would be a great cheerleader at a minimum for this country. I thought at least he'd be a cheerleader. Guess what? He's been a horrible cheerleader for our country. He's been a divider. He's been a divider. Our country is divided and it's divided very, very badly. And we have to bring it back. And if we don't bring it back, we're going to have a problem. But we've going to bring it back. I'm going to bring it back. People don't know this about me. I'm a cheerleader, too. And I'm somebody that does unify. Everyone thinks, oh, he's very divisive. He's very divisive. A woman came up to me yesterday, we had -- I did two speeches yesterday, packed houses, different parts of Iowa, and a woman, beautiful wonderful woman walks up to me because Mr. Trump, all my friends want to vote with you, but they're a little bit concerned that if you're president, will you still speak so tough? I say no, it's different. Well, yeah, probably. He says, you bet you, I hope so. Well, there's a little truth, hey, a little truth to that too. Do we want to ease up? But I say it's different. I'm running originally against 17 people. So four or five are down the tubes. Now, we have a big group that's going to be down the tubes. Despite all the money. Can you imagine all the money they spend in there down the tubes? But you know, it's sort of interesting. I said to her, well, what you mean? She said, the only thing they have against you is they think your rhetoric is very tough. I said I have to be tough, I have these guys coming. They're lying. They're coming all sides. You saw that debate? Boom. Trump. Trump. Hit Trump. But we came out. Did Trump win the debate by the way? Did Trump win? We did. We did. OK. I said so I have to be because I'm dealing with all these people, and then, I'm going to have to deal against Hillary, if she doesn't go to jail or I'm going to have to deal against Bernie. Or somebody or Bloomberg comes in which would be great. I'd love to have them come in because I love the competition, frankly, I mean, it would be great if Bloomberg -- I love Bloomberg to come in. So I'm dealing with all these people and I have to be a little bit tough, and I have to be quick because I don't have enough time to be so nice, right? But if I'm president, I would have a little bit of a different demeanor. But don't worry, the demeanor would be a little bit different. But don't worry it'll be the same attitude. You understand that, OK? We're not going to change, OK? Now, he was worried. He said please don't change. Don't worry but I'll be a little bit softer. Maybe the attitude will be tougher. But the words will be softer. You know, I tell people, I'm like, you know, it's real easy. I can be so politically correct. I've been. I go to Palm Beach. I own a great place in Palm Beach. We have the great society people in Palm Beach. They always want me sitting next to them for a lot of reasons, right? And I sit next to ladies. Oh, Donald, it's so beautiful to have you with us, it's so -- and I talk to them. You look so lovely tonight. See now in modern day society, you're not allowed to say that about a woman, right? You can't say that but I've never had anybody complain. But they are very up in the air and they're very nice people. And they raise a lot of money for charity and I'm so politically correct. In fact, they leave, they say, I can't believe it how sophisticated Donald is. I can't do it any different way. The problem we have is our country has a problem. I don't have time to be politically correct. Does that make sense? We don't have time. It takes a lot of time. Takes a lot. It takes a lot of time. So when I began this journey coming down the escalator, I looked down in the atrium, it looked like the Academy Awards. There were so many -- I mean, even look today, look, look back there. Look at all these guys, look at it. Who has that on a Sunday morning? Here we are in Iowa, Sunday morning. Now, look at, look, look unbelievable. Now, I'll tell you what's going to happen, watch. This one section that for structural reasons they couldn't have people up there right, OK? Watch. Look every single seat is back. People are outside standing all, but for structural reasons, it's under repair. So there's one section where they couldn't have it. They'll probably have one wise guy show that one section. Well, not that many people attended. Oh, what sleaze. What sleaze. Their disgusting. Well, that's why I liked our protester. You know, our protester because they have to show up, they'll say, boy that's a lot of people. I tell the story. My wife always says, were there many people that I said -- didn't you watch? Yeah, because it's on all live. It's on CNN, it's on all of them, right? Didn't you watch? And she said, Donald they never leave your face. They never leave you. It's like a tight shot. They never leave your face. I said, I don't like that. Did they show we were in Lowell Massachusetts, it's a stadium. We were in Oral Roberts University. Great, beautiful, basketball setting. The place had 12,000; 13,000 people in it. We had to send away 5,000 or 7,000 people, right? They never once showed the stadium. My wife says, were there many people there? I said didn't they show it? No, I said really? She said, I could tell by the sound there had to be a lot. You know because it sounds like a pur. It's not like, you know, when you have 200 people. It's like this purr, she's said I could tell there were a lot of people, but they never show. It's, it's terrible. So if you see the section that's being under repair and you see these sleaze bags over there showing it. Remember what I said. They are the worst. They are so dishonest. But you people get it. I wanted just -- by the way, I want to backtrack because there's one thing I want to say about conservatives. You know, like, like I watch some of these guys go, Donald Trump is not a true conservative. Jeb Bush, here's Jeb Bush. Donald Trump is not a true conservative. You know, he's a low energy person. This guy is going to get nothing done. But he spent $100 million. But here's what happens. One of the things they say is Eminent domain and I talked about Eminent domain. All conservatives want the Keystone pipeline. Is that right? All, I want it. I want it. I want to make a better deal. By the way, here's my deal. They all want it. They want it. So it's -- So Obama either approves or doesn't. He didn't. Hillary said no good. You know, why Hillary is with Obama on so many things? Why? Why? Because she doesn't want to go to jail. The man in the front row, he gets it. And you haven't been at one of my deals where you were you? He gets it. Huh, oh, he was at number six, but you know what, she doesn't want to take him on. So she's saying things and she will until the end. She's saying things that which you would never see. So she's against the Keystone pipeline. So everyone, all the conservatives are for it. But here's the difference. I'm for it too by the way. I'm totally for it. All right. Because what the hell difference does it make? It's a lot of jobs. I don't like frankly, I'm not in love with the idea of taking Canadian oil, and say, you know, what the hell -- I love, I love Canada by the way. Look, you know, who is going to approve that deal fast? Ted Cruz, he's from Canada. He's from Canada. Oh, I'd never thought of that. This is a first. Ted Cruz will approve the Keystone pipeline because it benefits Canada. It's great. He could be the only guy. He'll run for president, then he'll run for prime minister of Canada. So anyway, here's where the Keystone Pipeline. Without Eminent domain, you know, these guys are all saying, you know, take a -- Donald Trump is against Eminent domain. Yeah, I want to have a highway built. I want to have a road built. I want to have a hospital. But you know what can't be built without Eminent domain, the Keystone pipeline. No pipeline could be built because it goes thousands of miles. It goes from Canada down to Texas, right? And it goes through farmland and it goes through a person's house and it goes through -- But without this, and you know, when you look under the Keystone pipeline, they have a whole section dedicated to Eminent domain. What it means, how we're going to use it judiciously, and all. Now, they take it. They're saying, I'm not a conservative because of Eminent domain. I'm not in love with Eminent domain, but you need it, if -- you're not going to have roads and you're not going to have a country, OK? So I say, the Keystone pipeline could not be done, could not be done without Eminent domain. It probably couldn't go 20 feet. You got to use it and here's what happens. They condemn, they take the property, they pay you a fortune. There are people that make a living off buying Eminent domain rights because they're supposed to pay you fair market value, but you're negotiating with the government. So unless you're stupid, you get much more money than it's worth, right? You make a fortune with Eminent domain. So if you listen to them, they talked about it the other day. Donald Trump believes in the taking of property. Well, they forgot to say, you've got a fortune for it, OK? These are minor thing. So these are dishonest, these are really dishonest people. So Eminent domain, Keystone pipeline, but here's the difference in business, while we're on Keystone Pipeline. Here's the difference. The Conservatives and all the Republicans they want it approved. So you have the Democrats that say no. Although, a lot of the Democrats think it should be approved by the way. You know that. But you have a group that says, no or you have a group that says, yes. Here's what I say, yes. But I also say, no, but I'm not finished. I also say this for the country. I want to take for the United States, some of the profits. Why should we let them build this massive pipeline using our power of Eminent domain, go through all these farms and through farmland and through cities or wherever the hell they're going, have to use Eminent domain. I want 25% of the deal for the United States. They're going to make a fortune. They're going to make a fortune. So when they do this pipeline, it's going to be a very profitable thing. And it's really Canada oil coming down. So you know, it's not -- I want to -- I like Canada. I want these people to be happy, but I want the developers of the pipeline to give the United States a big, big chunk of the profits or even ownership rights, like I do in business. That's what I do. That's what I do. So you won't hear that. Now, here's what's going to happen tomorrow. So simple, right? But these people never think and you've never heard of it. In fact, when I said take the oil, nobody else said take the oil, now everyone says take the oil, right? I said in Iraq. Take the oil. Nobody else said it. Now, they're all saying it. So with the Keystone pipeline, I want a big piece of the deal. Otherwise, I'm not going to approve it. They will give us a lot. I don't want to be you, know, I don't want to be too greedy. But if I'm greedy, I'm greedy for the country. I want to be greedy for the country. So when they do the Keystone pipeline, I want it approved. I want all those jobs. I like a lot of oil flow because right now, we're low. But you know, I remember what OPEC would do for us for years. We don't want to ever be in that position, again. But I want a piece of the deal. Doesn't that make sense and you're not going to hear that from anyone else. So tomorrow you're going to have all these bloodsuckers saying, I have an idea. I want a piece of the deal for the United -- they wouldn't know where to begin. They wouldn't -- you know Carl Icahn, the great businessman endorsed me. Many, many businessmen want to endorse -- even the ones that don't like me want to endorse me because they say, he's the one that gets it. We have corporate inversions going on right now where companies are leaving the United States. You know, they used to leave Iowa and they go to some other place. Some of them went to Mexico, in all fairness, a lot of them. Newton, Newton, Iowa. But they used to leave Iowa. They'd leave New Hampshire. They'd leave different places. They'd leave New York and they'd go to Florida. Now, they leave our place and they leave New Jersey and they're going to Ireland. Pfizer is going to move to Ireland. Thousands and thousands of jobs because they can't bring their money back into the country. And because the taxes are too high. My tax plan is an amazing plan. It's just like an amazing -- it's going to make us so dynamic. Larry Kudlow who's a great guy, a great a great guy. Larry Kudlow said it's a phenomenal plan. So many other people said it's a phenomenal, but it's going to lower taxes for corporations, going to lower taxes for business. It's going to get rid of a lot of rules regulations which is coming out soon because we're being -- I know as farmers, people that have farms are telling me stories that are a disaster. They can't even take care of their farms anymore. It's so bad with the environmental impact stuff. So we're going to get it back and we're going to bring it back, and we're going to go back to sanity and we're going to do things that are incredible. We're going to do things that are incredible in this country, OK? But my tax plan, you know, we're now the highest taxed nation in the world, and we're going to bring it so that we're one of the lowest. It's going to be actually one of the lowest. And we're going to become a dynamic force again. Now, all of that money, it's at least $2.5 trillion that's sitting offshore. And this is interesting. The Democrats want it brought back in. It's good. It's money that was made outside of the country, they can't get it back in. And if they got it back in, they'd spend it here. But they can't because it's so restrictive. First of all, they can't do it bureaucratically, they can't get it back in. So all of that money, $2.5 trillion. But I think, it's much more than that. The government has no idea. They have no idea what it is. Just like they have no idea how many illegals are in this country. They have no clue. Just like they have no idea what was on the Obamacare website that cost $5 billion. These people have no idea -- that still doesn't work by the way. So all of that money that's offshore. The Democrats want it and the Republicans want it. This has been going on for three and a half years. They can't get together and they all agree because they have no leader. Every Democrat wants it, every Republican. What's not to want. We want money brought back into the country. They can't get it done. The reason they can't get it done, no leadership. You know, it's one thing if they're opposed, somebody wants Obamacare, somebody doesn't, they have a log jam, that's different. Here's something, here's something where they want the money to come in for years, and they can't get it done. There's total gridlock. Total gridlock in Washington. And a guy like Ted Cruz can never get it done because he's like, I mean, it's never going to happen. It's never going to happen. You need somebody that can wheel and deal and get things done, and we go back to a system where we don't need as Jack the executive orders. All Obama does now is sign executive orders. We want this, he can't get it. Boom, executive order. And he'll be out on a golf course in two, three, four or five years, and the courts will start getting these executive orders. And they'll say, what he's saying is look, I don't know if it works or not, here's an executive order, in five years don't worry, I'll be playing golf. What the hell difference does it make? We want people, remember Ronald Reagan and Tip O'Neill? The country is running good, they got a law and you got Congress, I mean, he's doing an executive order in the Second Amendment essentially, how terrible is that? We can't do that stuff. So here's the story. I started, I was talking about trade. I was talking about China. I was talking about Japan, millions of cars pouring in, we give them practically nothing. So unfair. I was talking about Mexico. They beat us in trade. They beat us at the border. People are flowing through. Drugs are coming across, pouring across, anchor babies which I was right about. The fact that somebody has a baby who's an illegal on our land, doesn't mean we have to take care of that baby for the next 90 years. By the way, I'm right. I'm right, and we don't need a constitutional amendment. I was right. The greatest lawyer, some of the greatest lawyers in the world actually said, Trump was right. But all of these things I talk about. Then you had Paris and you had Los Angeles, and you had various other things happen, and you had different tragedies happen. And then CNN does a poll, who's best on the economy? Trump by a factor of many times, I mean, like in the 60s and 70s. We sort of understand that. I'll be the greatest jobs president that God ever created. Believe me. Believe me. So the economy, but then they started because of what happened in Paris and what happened in California. The -- then they started talking about who's best on security for the country, Trump. Who's best in the military, Trump. Who's best to an ISIS, Trump, by a lot, not by like little. And the narrative started changing. I was talking about all the different things, trade. And here's what I say, folks. Trust me. The trade is going to be great. We're going to bring back jobs. We're going to make good deals, not bad deals. I'm going to use the greatest business people in the world, I know many of them, most of them. I know the good ones. I know the bad ones. I know the ones that are overrated. I know people that you never heard of that are better than all of them. I have the greatest business people in the world. They all want to do it. To them, it's sport. They love the country, some of them. Some of them don't care. These are tough people. Some of them will move a company out of the United States, if they can save $2. But I know the great negotiators and we're going to now have the best negotiators in the world, negotiating against Japan and Mexico and China and Vietnam, and all of these countries that are absolutely killing us. What China has done to us, is perhaps the greatest theft in the history of the world. We have rebuilt China. What they've done to us. They've taken so much money out of this country and we owe them $1.7 trillion. Can you believe it? They kill us and we owe them money. Japan we owe them 1.5 trillion. So here's the story. We're going to take care of that, but now it's going on -- we're going to knock the hell out of ISIS. We're going to knock the head -- remember I am the most militaristic person, the most. I am the most militaristic person. We're going to build our military strong and powerful, but I hope we never have to. It's very important. I don't want to use it. And you know, some people say, well, Trump is very tough, and he might be very quick on the trigger. Quick on the trigger, all these weak people want to use our military. I'm the one that said don't go into Iraq and I said it in 2003, 2004 because you're going to destabilize the Middle East. I'm the sane one in the group, OK? But I want to have the strongest military. I want to make it bigger and better and stronger, and technologically nobody can compete because I don't want to have to use it. And going along with that, I got a lot of vets up here. We're going to take care of our vets. We're going to take care of our vets. Our vets are not being treated right. We have illegal immigrants that are being treated better than our vets. They're not being treated right. They're going to be treated right. They're our greatest people. They're going to be treated right. So look, in closing, I just want to say this. It's been wonderful. You can read all the Time Magazine cover stories you want. In my opinion, if we don't win, we all wasted a lot of time. You've got to February first, you've got to go caucus. You got to go caucus. Otherwise, we're going to have something -- it's, it's amazing. Here's what they're saying, they're saying if Trump wins Iowa -- so you're giving me a lot of power there. If Trump wins Iowa, he's going to run the table, meaning he's going to win al most -- if I don't win Iowa, and honestly, anything's possible. If I don't win Iowa, I have to go to New Hampshire where I have a massive lead like a 20-point lead, a big lead. Incredible people in New Hampshire, incredible people there too. If I don't win, I'm going to go. And I think, we're going to win anyway. I think, we're going to win because New Hampshire is strong. South Carolina is through the roof. We have a 28-point lead or something there. We have a huge lead in Nevada. The SEC, I'm doing great. George has been amazing. I told you about Florida 48%. So what if I can win Iowa, I'm telling you, we're going to run the table, and it's going to be important. And I honestly think, first of all, I want you to do what's right. I want you to go for the person you -- but I honestly believe, I honestly believe, it's very important because you have not had a winner in so long. You're going to have a winner. I give you my word. You're going to have a winner. We're going to make our country so good. I love you. I love you. Love you. We're going to make our -- thank you, and I love you, too. I love you, too. I do. We're going to make our country strong again. We're going to make our country smart again. People are going to respect us again. They don't respect us now. When you see 10 young sailors sitting in a boat on their hands and knees with their hands up in the air, and they're in a begging position, and you have thugs with guns to their head making them say whatever they want to say, and the only reason we got them back is that, they happen to be smart, the Iranians. They got two days later, $150 billion. So if you didn't have that, those sailors would be there until about February 1st of next year. They would've been back here long before that. That I can tell you. OK, that I can tell. But, but I thought that was a very humiliating -- does everyone agree? Was that humiliating for us? Believe me, if the $150 billion wasn't coming two days later, those people would be over there for years to come, if you had a normal president. So here's the story. We're going to win again. We're going to win a lot. We're going to make our country great again. We're going to be very proud of these days. But you have to go out. You have to caucus. The more of a mandate we can win b,y and I don't want to come in second, I'm saying it, there. If I come in second, every word I say up here is going to be played all night long. Oh, Trump was humiliated. OK. I don't care. They can say whatever they want. I want to come in first. We need a mandate. We want to take our country back. We want to be the smart country again. We want to do things that we never did before. We can be stronger and better than ever before. So what I'm asking you. February 1st, go caucus. Stay there, get that thing done. And we are going to have a lot of fun for a lot of years, OK? I love you all. I love you all. Thank you. Thank you. Thank you. Thank you very much."}