{"id":468,"author":"Donald Trump","title":"Speech: Donald Trump in Norwalk, IA","date":"2016-01-20","link":"https://factba.se/transcript/donald-trump-speech-norwalk-ia-january-20-2016","paragraphs":["To be here. You know, Hillary was here not so long ago. She had 20 people. I just asked the police chief, how many were here? About 20. And I won't talk about the Republicans, but they were here and they had less than 20. We have a big crowd and I appreciate it. People are still coming in. Amazing. So we had a big day yesterday.","Yesterday was amazing in every way. We had Sarah came along and she said, we love what's happening. It's a movement and no matter where we go, it's a movement. And right now, we're leaving, as soon as I'm finished, we're going to Oklahoma and we're going to have anywhere from 15,000 to 20,000 people in Oklahoma.","The place is packed. We're going to be turning away people unfortunately. That's one of the problems that we endure. Last time we went to Oklahoma, we had 20,000 people at least outside. You know, outside, you can have as many as you want. Inside, it's a little bit tougher, right? It's a little bit tougher.","But no matter where we go, we went to Dallas, we had 20,000 people. Mobile Alabama, we had 35,000. Everywhere in Iowa we're packed. Everywhere in New Hampshire. Everywhere in South Carolina. Everywhere we go, we're packed. It's just determined by the size of the room. So I just want to thank you all. It's early, I know, and it's a little bit cool outside, right?","We're going through a little bit of a cool spell. I don't know despite global warming, it's awfully cold in these different places. It is really cold. I never thought of Iowa -- I'm here so much and I never thought of Iowa with such cold weather, but we're having a little bit of a cold spell. Don't we love it? We love it, right?","So I just want to thank you all for being here and we're going to have a tremendous -- I think we're going to have a tremendous -- thank you, darling. Thank you. I love your hat too, make America great again. Make America great again. Thank you. Wow. I like that. Wow. That's great. Look at her. She's a fan.","I know one thing on February 1st, she's out at the caucus. There's no question about that. She is gonna caucus. By the way, speaking of that. You have to get out, February 1st because otherwise -- OK. Good. Thank you. Good. February 1st, so important. Otherwise, honestly, we're just wasting our time. You know, it's wonderful.","You'll hear me speak for a little while and all that. We're all wasting our time. Somebody called, a major major reporter, great reporter, actually, I am very liberal in this case and that's OK. They could be good too. They're putting their point of view. But the question was, how does it feel? I said, how does what feel?","How does it feel? Because this was about four months ago, the summer of Trump, they called it, right? And probably, they thought that that would be the end and then would fade into oblivion. You know, they've been waiting and waiting and waiting and we keep going higher and higher and higher. And now they're not waiting so much anymore.","That's the good news. They've been with me a long time. These people back there. We've been suffering together. The reporters, we suffered together. I call them, untruthful and they sort of just take it and actually, it doesn't hurt them because you know the truth sometimes they understand it. But we've had a hard time with them.","But some are actually, some are very good about 25%, tops tops. But we've been together now for a long time. But, you know, it's interesting. So this reporter called the summer of trump, how does it feel? I said, it doesn't feel like anything. What's to feel? He said, you've done something that nobody has ever done before.","What's happening here in terms of what's happened with, you know, with even concept with the way to run a campaign. Because if you look at what I've done, I mean now I'm spending money, but I've spent no money, practically, no money. And a guy like Bush spent $79 million, up to $79 million maybe even over 80 million and he's down here at the bottom and I'm at the top.","And I said, wouldn't it be great if we could do that with our country, where we spent less money than anybody else and have the best product. You know, really, it would be really -- no, wouldn't that be great. But he said, how does it feel? And I said, it doesn't feel anything. He says, no, you don't understand.","Even if you don't win, which I don't like to hear, even if you don't win, what you've done has never been done before. I said, let me tell you something, if I don't win, I've wasted my time. That's the way I view it. You know, maybe they'll say, hey, Trump ran a good campaign. Who cares? Doesn't mean anything to me. I guess I'll go back to building buildings and things, right?","I do a good job with it. But -- and employing a lot of people. But he said that and I said, no, you don't understand. It really -- if I don't win, if I don't win, it's a whole different ball game. It means nothing. Everything I've done, everything my incredible people have done with Hope and Corey and Tanner and everybody and Chuck and Sam, honestly, it doesn't mean anything.","It doesn't mean anything. So we want to get in and we want to win. And when I say win, we got to win here. And if we can win here, we're gonna run the table. I tell you but we're going to talk about that in a second. But when I talk to the reporter, I meant win for president because if we don't win for President, even if I won the nomination and didn't win, I would consider that a major loss.","And other way, people would say, oh, what a great campaign. Not a great campaign. Because the only way we can really do real change, not Obama change, remember, change. We got change all right. I know the farmers got real change. They can't they can't plow. They can't do anything now with the water problems and the puddles that go and they call them a lake.","You know, it's considered a lake. A puddle forms on your land it's four feet by four feet, oh, that's considered a lake. You can't touch it. This is this is reserved, the water. I mean, what you're going through or what everybody is going through with regulations and everything. I mean, look, everything.","Everything you look at, all of that's going to be gone and we're going to go back to being a healthy, strong, beautiful and beautifully run nation again. So important. So we're going to go out and I just want to say, so February 1st, you've got to get out there. You've got to bring your friends and I joke and I kid.","If you don't feel well, no matter what's happening, if you have the worst day of your life, it doesn't matter. You have to get out there. You have to caucus and we're going to bring it home. I mean ideally, we're going to bring it home. I'll tell you how important Iowa is though and I've been saying this more and more as we get to the finish line.","Can you believe we're almost at the finish line? February 4 is the big day. You started it all. But I've been saying it more and more. If we can win Iowa, which is, by the way, the only state in the union where I'm close. Everyone else, Florida just came down a little while ago was on Morning Joe and the different newscasts, just came down a little while ago and 48% percent in Florida.","And you have a sitting senator and he was at I think 11 or 12 and you have a governor, that a former Governor Bush who spends a lot of money. Yeah, Bush and he was less than that. I mean, it's amazing and people couldn't believe it. They said, there must be a mistake. You know, 48%. Florida is a very big -- you know, very important state not only in terms of this.","Somebody is from Florida over there. Somebody loves rock. But I love Florida but -- and I have a lot of investment in Florida. Big investments in Florida. I employ thousands of people in Florida. But Florida is a special place but very big, very powerful and very important in terms of the process. And I have this massive lead in Florida that everybody was saying, wow, that has to be -- they actually thought it was a mistake when it went up. They thought the poll was a mistake, 48%. So and I'm doing I'm doing great all over.","If we can do well in Iowa, we're going to run the table. If not, then I have to go and we got to win New Hampshire. Now New Hampshire has been really strong. But they say bad psychological things happen if you lose, OK? And they're really putting more pressure because they're saying, especially if Trump loses because he always talks about winning winning winning and if he loses Iowa that would be a terrible thing.","The press. And so I don't know what the impact is. But I can tell you this, I think we're going to win. It's probably our closest state and I think we're going to win Iowa and it would be a lot easier if I said, no, I just want to do well. Good luck everybody on the first. If you're busy or something, don't bother.","You to go out and caucus. Because if you can win and if we can win together, if we can win Iowa, the signal -- look, I'm not going to say anything is over. And even the biggest pundits, even my the worst liars and you know, some guys had said, we're never going to run. Even if he ran, he's just going to have a good time.","Not a good time. I mean, I love you people but I could be someplace else right now, OK? I could be very happy being someplace else. But if we -- and really and they say it. If we win Iowa, we're going to run the table. We may not lose a state because it's just going to feed. Iowa is very important and one other thing with Iowa, you know, there's a lot of talk about moving Iowa to the middle of the pack or even the back of the pack.","Not going to happen if I get elected. It won't happen. There's an incredible tradition. I've developed so many friends, you know, I've been here for a lot. I've come a lot and I'm going to be here all next week. You're going to be so sick of me. You're going to get sick. You're gonna say, get the hell out of here Trump.","Don't worry about it. You're going to win. We don't want to take any chances. You know, one of the reasons I said that I spent very little money but now I'm spending money for two reasons. Number one, I feel guilty because I'm like $35 million, $38 million under budget. I -- who's going to spend a lot of money?","But I've had so much airtime I haven't had to spend any money. So it's sort of interesting. No, it's true. You know they give me so much television airtime. I'm on all the time. Can you imagine they have this report, that report, that were all on Trump then they have a commercial. Now I have -- if I have a Trump commercial then they go back to trump the whole show plus the commercials.","I say, if I put commercials on, they're going to OD on Trump. It's no good. It's no go. So anyway, but we're going to put them on now because I feel guilty. I really do. I haven't run commercials. And so I just started some good ones, I think. Who knows. But we have a couple of commercials going up. Lot of money.","And the other reason is I'm so far under budget, I really feel I don't want to take a chance. Does that make sense? In other words, I feel confident. The polls are all saying we're leading nationwide by a tremendous amount. I don't want to take a chance. I don't want to be cute. Oh, I don't have to spend.","I don't have to spend. So I'm not taking a chance so we're spending some good money, where you're going to see some good commercials going up very shortly. In fact, they're already up in Iowa. Some of you have probably seen them. Are they good? I think pretty good, right? I think they're pretty good. So Iowa is so important because by doing that we're sending a signal, and that's why I want to win it. I don't want to lose by two votes where they say, well, Trump came in second and that's OK. Winning would be so incredible.","Look at these people, they don't stop. No matter where you go, no matter where you go, they don't stop. Would you like me to stand up against -- no matter -- it doesn't matter. I can't lose them. Look at them, the paparazzi. Look at them. I don't even know what the hell they do with all the pictures. They're taking pictures all day long.","Then you see one picture in a newspaper. You say, all that work for one picture. Anyway, but they're good. They're very very good. Hey look, we're all doing our thing right. They're doing their thing. You're doing, we're all doing our thing. But the one thing we all have in common, including them, by the way, is we want to make America great again.","We really do. We really do. The polls have come out and I love talking about polls. My favorite subject actually as long as I'm number one. If I was number two and I always get killed on the polls because the other candidates come up to me. Why do you always mention polls? Because I'm number one. And if you were number one you'd be mentioning them too.","But I think I brought polls to a whole new art and a whole new level. I don't think other people even if they were number one used to talk about them, you know, but I'm different. I'm a little bit different. I talk about them because when you're number one, you talk about. OK, ready? So we have a new poll came out, NBC News National, 38% for Trump.","Second place is Cruz in this one, 21%. 38%, 21%. And the third is Rubio at 11%. In South Carolina, we're way way way way above everybody. I mean, it's been incredible. Reuters has us at 41%. Gravis has us at 41%. Wow. Florida, I just -- you have is -- just the one that just came out has us at 48%. Georgia, we're in the mid 30s and probably the low 40s because I saw one.","In Connecticut, we're 35%, meaning we're 35% other guys are at 12% and 10% and 8% and 2% and nothing. They are at -- some guys are nothing. And I see him on television. Yes, we'll never leave the race. You know they're leaving the race right away, right? I watch these politicians, I watch a couple of politicians, who was at one or two and he said, no, I will never leave the race.","You know, he's already planning. His people are already calling, could you you hire us, please? And it's one of their -- they're politicians, that's what they do, they talk. All talk, no action and that's what we don't need. You know, that's what we don't need. In Iowa, we have a great CNN poll. I told the other day, I said, why don't they ever use the CNN poll?","Even CNN doesn't use the CNN poll because it's too good. Trump 33%, Cruz is second at 20%. So I'm up by 13 points and nobody ever uses it. So CNN reports and they show other people's polls, which is closer. I say -- and by the way, they spent a lot of money on this poll and I think their poll is probably better and I think it's more indicative.","I think, we might even be better than that. I said, why are you not using the poll that says 33% to 20%? Why are you using one that says 21% to 20% and this and that. And they have no answer. You can't answer. You know, what the answer is. It's really unfair stuff. It's called welcome to the world of Trump or welcome to the world of being a conservative Republican or welcome to whatever world it is. But here they are, they pay for their own poll and they don't put it up. So it's a little bit unfair but these are minor details, folks.","I want to just -- so the polls are looking good and everything is looking good and it's so important. And I stayed here last night and actually had good steak. You have good steak and I've always heard that, you know? I had good steak last night. I mean you should have. If you don't have a good steak, who's going to have good steak?","If they don't have good steak in Iowa, we have some problems, right? But you do and it was, it was great. I want to just say though and I said it a little and I alluded it -- I alluded to it. Sarah mentioned it yesterday, Sarah Palin came in and she was so great, she was so great yesterday and so popular and amazing actually and everybody wanted her endorsement.","And she just saw what was happening. She said, you've got a movement. This is a movement going on. This is beyond what a normal situation is. And seriously, I mean they were telling me when some of these other candidates have like nine people and 20 people come in. And even for Hillary, she had very very few people coming in. And you know, you look at a crowd like this and it's early in the morning and all of that.","And you know, it's -- something is happening out there, something really special you know they used to call it the silent majority. And I'm not -- I used to say, with the silent majority, I resurrected the term. Some people didn't like that term because it was associated with Nixon or it was associated with something.","And I don't even care. I mean, it's just great term but it's not really accurate because the accurate is the noisy majority. We're really -- I mean, you have to see these people. They go crazy. We go into stadiums and they want to rip down the stadium sometimes. It's amazing. And it's really become the noisy majority and that's what we have.","We have an amazing group of people that want to just see this country get great and be strong and be smart, and not be ripped off with trade and not be ripped off with so many different things. I mean, you look at China, $505 billion. We have a trade deficit, a deficit. What they get, what we get. $505 billion a year.","This isn't like in 20 years. This is a year. It goes on. It goes on. And I have some of the great business leaders endorse me, like Carl Icahn endorsed me, who's a fantastic guy and a fantastic business leader. And when he endorsed me, I mean a lot of other business leaders also want to endorse me. Problem is nobody ever heard of him.","But I'm going to use him. Then I said, you don't have to endorse me. What difference does it make? Nobody knows who you are. The guy could be worth $5 billion. Nobody cares. You know, it's amazing. But they're great negotiators and they want to do great things for the country. And right now, you know, take China as -- and I've been talking about China for years.","You know, nobody knows how to negotiate with these people. I made a lot of money with China and dealing with China. And I own a major building in California along with a group, that's a phenomenal building, the Bank of America building in San Francisco and 1290 Avenue of the Americas, a big chunk of that.","And you know, dealing with Chinese and he know how to deal. I mean, I sell condos to the Chinese a lot. I have them as tenants. The biggest bank in the world is a tenant of mine in one of my buildings and they pay me rent and they're great. I mean, the Chinese are great people. And the Mexicans are great people, but their leaders are too smart for our leaders.","They're too cunning. They're too cunning. They're Cunning. They're smart. They toy with us like we're a bunch of dopes. They toy with us. They think everybody is like Obama. They toy -- no, it's true. No, it's true. I mean they toy with us and that won't happen anymore, folks. That won't happen. It's not going to happen.","No, it's disgusting when you see, you know, when you see the trade deficits that we have with Mexico. Everyone of these politicians come up, you won't be able to build a wall. Why? Explain to me why? Well, who's going to -- I said, number one, the wall is gonna be paid for by? Correct. He knows. This guy knows.","It's gonna be paid for by Mexico. So the politicians come up say, why do you always say that? You know, you know the guys that I'm negotiating, the guys that I'm dealing with. How good did I do in the debate last time, good? You know, I've never done this stuff before. But they all said I won the debate.","Even the people that hate me back there, even the pundits. You know, every every debate, I've won with the polls. You know, they do the polls. Drudge is an amazing guy, by the way. You have Drudge and you have all these different polls, Time Magazine and Slate and PBS. And I win almost all of them and -- on the debate.","And I'll get 40%, 50%, 60%, 70%. Who's going to win -- who won the debate. Yeah, it's a lot when you're 14, 15 people up there and you get 70% but I get a lot and I've done well. But this last debate for some reason even the pundits finally broke down and they said, Trump won. It's nice. OK? Took him a while, took a while.","And now we have another debate coming up. I hope I get treated fairly. Some people on that debate stage that I don't know if they'll treat me fairly, but we'll see. But I hope they won't. I don't think they will either, frankly. We have some people up there that will -- we're gonna to find out whether or not they treat fairly.","I'll be prepared. Believe me, I'll be prepared. But we're going to find out. And I think, I think it's important for actually for them as professionals that they treat me fairly. I don't want to be treated any better, but I have to be treated fairly. I thought I was not treated fairly in a couple of instances.","But nevertheless, we came out fine. We came out really good. Sort of interesting after the debates, the poll goes up, you know, my big polls go up. After the last debate, my poll went up 11 points. Now, I also brought up some pretty big security measures in all fairness so maybe that had to do with it. You know what I'm talking about.","But that was important and now we have a dialogue going. The world is having a dialogue because of what I brought up, radical Islamic terrorism. We mentioned it. And the world is in dialogue now. The world is talking. But we have a president that won't mention the terms. I mean they won't even -- he won't mention what's going on. When a building is blown up, when people are killed in Paris, when people are killed in California, when five great great soldiers are killed because they're told to stand down with their guns, to take their guns off and put them 100 yards away and lock them up. And then they go have coffee and a whack job.","You know, when they see, when they see a gun free zone, these wacko -- they're just wackos. When they see gun free zone that's like holding candy for a baby, OK? Gun free zone. By the way, I'm going to protect your Second Amendment 100%. 100%. If we had guns in California or even you know take a look at Paris, the toughest gun laws in the world, the toughest they say in the world, Paris.","You can't have a gun in Paris. Unless you're a bad guy, you put a gun in your pocket, you have a gun all right? But you can't have a gun in Paris. In France, the toughest gun laws. So you had these guys, these thugs, these thugs, the press, you know the name the press called them, right? We don't call them that anymore.","We call them the guy with a dirty hat. These are stupid people and these are disgusting people, right? These are disgusting. They call them the mastermind, the leader, the mastermind. And I took the press the task. I haven't heard -- I must say I have been hitting them so hard about it because you know they're radicalizing our children.","They're using the Internet better than us, and we're the people that invented the land that invented the Internet and they're using it better than us. They're radicalizing our children online and they're going around, the press calling them mastermind, the mastermind this and that. And I'm saying to myself, why are they calling them a mastermind?","Why would anybody call them mastermind? You're building them up. You're building up the image, Robin Hood, you know, you're building up the image. And I'll tell you what, honestly, the press has pretty much stopped. It's been very interesting. The press is very stopped. How come you're aiming those cameras over there.","What's over there? Just curious. Huh? Why are you aiming over there? Huh? OK. Cutaway, it's OK. It's the first time I've ever seen that happen. Now I'm trying to figure. You know, my story, right? They never aim the cameras at the room. I'm in a stadium with 20,000 people. My wife keeps saying, but you don't know -- I mean, how many people?","I said like 20,000 with the Mavericks, the Dallas Mavericks play 20,000. She had no idea because they never -- they never do cutaways. Now he does a cutaway and he's aiming in that little corner in the back of the room. I can imagine. I can imagine. Why did you do a cutaway over there just out of curiosity?","He can't. He can't tell you. Yes, he can't tell you. I can tell you why, I tell you these people are the worst. They are. They are disgusting. They're disgusting people. So anyways. So isn't it really terrible though? It's really terrible. And you know the one thing that's -- I'll call them out. Other people, they just sit there.","They don't call. They don't call anybody out, but we call them out. They're really, they're really dishonest people, really really dishonest and disgusting people. So we're out there and and we will -- I will tell you, we will do things that nobody else can do. And when they say, but Mexico can't pay for the walls.","Of course, they can. We have a trade deficit with Mexico that's unbelievably big, humongous. It's a humongous number. It's billions and billions of dollars, far more than what we're talking about for the wall. The wall is peanuts compared to that. But they don't understand that because they're politicians and not business people.","Mexico will pay for the wall, OK? One way the other. There's five different ways they can pay. One of those five or all of them will take -- you know, we will we will not be paying for that wall, but the wall is going to be built fast. And we're going to be getting some people. You know, a lot of the gangs, you look at Los Angeles and some of these places, they have gangs where they're made up of illegal immigrants.","OK? They're made up of illegal immigrants. Mexico doesn't want them. So they send them to us because we take everybody. We're so brilliant. We're so wonderful we take everybody. Even the anchor baby stuff, a woman is pregnancy, she walks onto the land. She has the baby. Here, we take care of the baby. Now, becomes a person, becomes a person and you know grows up and beautiful and the babies here, beautiful baby, now we take care of the baby for 85 years.","OK? It doesn't read that way. And remember when I first came out and said that, I turned out to be right because the legal scholars say, you're right. You can't come over illegally, have a baby and we're supposed to take care of it. I mean, if anything else, I've proven that. Now somebody will challenge it. Somebody will go to court.","But that's the way it reads. You may need a raise of the hands of Congress, but they were all saying you need a major constitutional amendment, which would take forever to get and all those things are like impossible to get because of the process. I said, well, you don't need a constitutional amendment. You can't come in, have a baby and then the baby we're supposed to take care of that baby for the rest and the baby is like you can't do anything.","It's nonsense. Well, now the great legal scholars, the real legal scholars are saying Trump is right, OK? Trump is right. And you know and I'm very good when it comes to the law, I've been through plenty of law and you know speaking of law. Ted, do we all like Ted Cruz? I like him. I think he's a nice guy.","No? You don't like him? All right. Look, he's fine. He's two-faced. A lot of people don't like him. A lot of people don't like him, frankly. But look, Ted Cruz has a problem. He's got a problem. He was born in Canada. He was -- he's a Canadian citizen until just recently. Canadian citizen and he's running for president.","And a lot of lawyers and you've been seeing him on television, you've been reading about him in the papers. A lot of people are saying, he's not allowed to run for president because he wasn't born on the land. You know, natural born citizen is a real question as to what that definition is. And some of the best lawyers in the country, some of the biggest lawyer, Laurence Tribe of Harvard and others say, it's unsettled law.","It's totally unsettled. And honestly, Ted has a problem because how can you have -- let's say, you have him as a candidate and he's running and then you find out you lose in court. You don't have a candidate all of a sudden. Or let's say even worse, let's say, he wins and the courts say that he's not allowed to run.","I mean, you've got to find out. So you go for declaratory judgment. You go into the courts. But he actually has to go in to the courts. Now I understand he was sued recently over the last couple of days. Fact, I understand there are two lawsuits out there. But there will be more the Democrats will sue. If they're going to run again, they're not gonna sue now.","They'll take their time. But at the right time, just as sure as you're standing here, sorry, we couldn't give you a seat. There's too many people sorry about that. But just as you are like you're standing here, the Democrats are going to sue. So how can you be running with a cloud over your head? Hillary is running with a cloud over her head too.","It's called, you know, what the cloud is, right? He says it's called indictment. Well, no. I mean, what she's done is unbelievable that she's getting away with this. I think, personally, I think they're protecting her and they're going to continue to protect her. A lot of people say that's impossible because she broke the law so much worse than anybody else.","I mean, there's never been anything like this. Look at General Petraeus, what that man has gone through and now they want to take away his title. And I would say this, leave him alone, OK? Right? Leave Petraeus alone. We have other problems. We have ISIS. Focus on ISIS. Don't focus on Petraeus. No, they want to reduce him in rank.","I think he's suffered enough. But look at the way he suffered, and by the way I mean that, leave him alone. Don't reduce his rank. Just leave him alone. What that guy has gone through. He made a mistake. Leave him alone. But what he's going through and what others have gone through, and Hillary is just looking like she's sailing in. Now she might not win of her own volition.","I don't know she's not doing very well. But on the assumption she won, I don't know how you can run for president. But she has a different kind of a problem, but he's got a problem of uncertainty. You just don't know. I mean, you just don't know. So let's see what happens with Cruz. But it's very hard to let somebody go through a whole long process and at the end of the process, should he win, they're going to get be suing him just like he's already being sued.","And the fact is he was born in Canada and he was a Canadian citizen. I mean that's big stuff. And that's -- you're talking about 15 months ago. He was actually a Canadian citizen. If you think about this, he was a Canadian citizen while he was a United States senator. He was a joint citizen of the United States and Canada, but how do you do that?","And he said, he didn't know about it, which is interesting. He didn't know about it. So I don't think, I don't think you can have a situation where, gee, I didn't know about it. Then in his papers, you know, his financial applications, it's a very very strict, very -- he didn't put in a couple of minor things.","He said he was going to sell assets to run for the Senate and all of this. Well, that's not what he did. He borrowed money from Goldman Sachs and he borrowed money from Citibank. So it came out a week ago, a little while ago that he borrowed money from Goldman Sachs. But nobody knew about Citibank that he came out that he borrowed money.","He never put it in his personal financial disclosure form. That's a big no, no. If I did that, can you imagine the headlines of me? I have billions and billions of dollars of stuff. I put in almost 100 pages. Every reporter back there. They've gone over every word. I mean, you haven't heard anything. I mean, I've professional people doing it but you haven't -- I guess, I got the right professional people because believe me if there was two cents worth of mistake, I have nothing but you know newspaper headlines.","But I put in almost a hundred, the largest personal financial statement ever ever written, ever done, almost 100 pages and it's fine. You know, it's fine. It's gone over by everybody and it's fine. Here's a guy with two bank loans that we know of. But the problem is he didn't do it purposely because what he wanted to do is say, I will protect you from Goldman Sachs.","I want to protect you from Citibank and I will protect you for the base because I'm Robin Hood and I'm this wonderful senator and I'm going to protect you for these banks and then he's borrowing from the banks. And by the way, he's got personal guarantees and he got low interest loans, got low interest loans, low interest.","And now he's going to go after Goldman Sachs? Doesn't work that way. Goldman Sachs owns him. Remember that, folks. They own him. And what he did was wrong because he didn't want you to know that he's dealing with banks, that he's borrowing money with banks, that he's personally guaranteeing loans with banks because if he puts him down then he's just like all the other guys, OK? It's wrong.","It's wrong. It's really wrong. And you can say what you want but it's absolutely wrong. So he's got a double problem. He's got that problem because it was just revealed. And now everybody is saying, oh, I thought he was trying to protect us. Well, what's he gonna to do? Be rough on Goldman Sachs when he has a personal guarantee for like whatever the number was a million dollars?","So I think you've got to think about that. I think you've got to think about that. You agree with it? A lot of people don't know that, but it just came out. I mean, it just came out. And he said, with the -- being a Canadian citizen, he said, oh, I didn't know that. How did he not know that? Then he said with the loans, oh, I didn't know that.","Smart guy. He doesn't know that. Yeah. That's worse than Hillary when you think about it. So anyways, I think we got to get a little bit you know fair in here because he says things about me that is so wrong. I mean, he says things, takes ads and says things about me that is so wrong. I mean, we have to disclose the real facts and these are facts.","These aren't like, oh gee, this didn't -- this is like he didn't put down on his personal financial disclosure form, very strong that signature on the bottom. You sign that, you've got problems if you make mistakes. He didn't put down two big banks loaning a money because he didn't want you to see that, OK? That's a problem, OK? That's a problem.","And I think when you go to caucus, you should think about that problem, OK? You should think about it. And the other thing, of course, is you have a great governor in this state. Terry Branstad came out yesterday and he said, you can't have, you can't have Cruz. You can't have Cruz. And I understand what he's saying.","I understand exactly what he's saying. And I think it has to do with more than ethanol. I think it has to do with maybe other things too. It's a strong statement. You have a great governor. Here is the longest serving governor in the history of the United States as of a couple of months ago. And when I was with him, I really like him, I think he's smart and he's amazing and he loves the people of Iowa.","I really like him and he says he's not endorsing anybody and I think that's great. But it took -- for him to come out with that statement, that was a big statement to come out with yesterday. Yesterday was a W. That statement, he had Sarah Palin, that was a good day for Trump. And the governor is doing the right thing.","You know, he's the guy -- he's a governor that's going to do the right thing. You know, a lot of people do everything for politics. He doesn't do it for politics. He's beyond it and he does what is the right thing. So he's an amazing guy, I can tell you that. So we've got to keep him elected for a long time to come, folks, right?","We want to have him. Let him, let him double up his record, but it's an amazing record. Think of it, in the history of the United States, he's the longest serving governor in the history of the United States. That's a lot. So we are going to do tremendous things. We're going to work hard on trade. I'm going to get the smartest, the best, the greatest people in the world.","We're going to work really really hard on trade. We're going to work really really hard on everything. And when we work hard, we get it done. We're going to get the best people. We're going to make the best deals. I joke sometimes. I go, we're going to win and we're going to win again and again and again and you're going to be begging me, please Mr. Trump, please, President Trump, no more victories.","We can't take any more victories. We can't take any more victories. Please, let's lose a couple of times, please. I'll say, no we're never going to lose. We're going to make America great again and everyone goes crazy. You know, we have fun with it. We have fun with it but we are, we're going to win so much.","We are going to win so much. We're going to get rid of Obamacare and we're going to put something that's so much better. We're going to repeal it. We're going to replace it. We're going to get -- I tell you what, there are so many better things that are out there. But your premiums are going up, you see what's happening 25%, 35%, 45%. Your deductible is through the roof.","You almost have to be dead to try and collect any of the deductible. That's become so high that I mean frankly, unless you need massive major surgery, you're out of business. It's ridiculous what's going on. And it's going to die in '17 anyway. They say, by '17, it's going to be dead because the wrong people are -- in terms of the people with the money aren't signing up. It's people without and it's just it just can't carry itself and it's just a disaster.","It's a basic disaster. So that's going to be gone. We are going to do so great with our military. We're going to make our military so big and so strong and so powerful, and by the way, that's so much less expensive than what we're doing now. Nobody is going to mess with us. Nobody. Nobody is going to mess with us. We're going to take care of our vets and we're going to take care of them properly.","Illegal immigrants are treated better in many cases than our vets. Our vets are treated horribly. They wait six days in a reception room before they can get care. We're going to take care of our vets and a lot of that's management. It's not even the money. They pour money into it. But you know, the corruption in the Veterans Administration is legendary and massive.","You see what's going on in Arizona and other places. It's absolutely disgraceful. One other thing that I think is important and in Iowa, in particular, for whatever reason they love this, I'm self funding my own campaign, OK? I'm not having guys come up and give me millions and millions of dollars, and one guy wants insurance and one guy wants something else and one guy, you know, he's in such and such a business, oil or gas or this or that.","And you know, we are -- I'm self funding and I'll tell you what, I have turned down so much money that I actually feel foolish in here. My whole life has been to take, take, right, take. I was greedy. I take, I take. Now, I'm going to be greedy for the United States. I'm going to take for the United States.","I'm going to be greedy for our country. I'm going to take. We're not going to be the stupid people anymore. We're going to be the really smart people and we're going to bring it back. You know, we own $19 trillion, $19 trillion. That's rapidly going up to $21 trillion because of the ridiculous budget. You see the budget that was passed two weeks ago?","We're funding everything. We're funding Obamacare. We're funding the Syrians coming in, which, by the way, not gonna happen. That's not going to happen. The Syrians, not -- we don't know who they are. We don't know who they are. We don't know where they come from. Some are ISIS, I think. I think, it's gonna be ISIS.","You know, three, four weeks ago, I wouldn't have said that. But now, based if you look at what's happening with Denmark and Norway, if you look at what's happening with Germany, I mean take a look at Germany, what a disaster that is. And I was on Time Magazine -- by the way, get this week's Time Magazine spread.","I'm on the cover. I like this week better than the last time. But this week -- this week's Time magazine story is amazing. It tells you about the campaign, what's happened. It's amazing and it's been an incredible story. But if you look at what's happening with the migration and we're taking in people. We have no idea who they are.","And law enforcement, I've spoken to many of them, I've watched them, I've read about it so much and they say, there's no way of saying where these people are from, what they represent, who they represent. This could be the greatest Trojan horse in history. This could be the real deal Trojan horse and we want to take thousands and thousands and don't believe the 10,000 number.","You know, even in the debate, the previous debate, they talked about 65,000 people, OK? And don't believe the numbers. They want to bring in tremendous, tremendous. And you know, very sadly, if they're Christian, they don't come in, OK? If they're Christian, they don't come in. And before this whole mess, if you were in Syria two, three, four years ago, one of the top experts told me this on borders and on the military, I mean this is a real guy that really understands what's going on. He said, you know, Mr. Trump, first time I heard it. He said, if you're from Syria and if you're a Muslim, it's very easy to come into the United States.","One of the easier places. But if you're from Syria and if you're a Christian, it's almost impossible to come into the United States. One of the hardest things to do. If you -- I never forgot it. That was three years ago he told me, three and a half years ago. I never forgot what he said because Christianity is under siege, folks, whether you want to hear it or not, it's under siege.","And we've got to reverse it. But if you were from Syria three years ago, four years ago, three and a half years ago, you wanted to come into this country, if you were Christian, one of the hardest places on earth to come into the United States was a Syrian who happen to be Christian. Something wrong. And they're the ones that really needed the protection more than anybody else.","So it's all gonna change. It's all gonna change. We're going to use our heads. We're going to be fair. We're going to deal from the heart. We're going to deal from the brain and we're going to make America great again. And I'm telling you, so important is on February 1st. You have to get out there and you have to show our stuff because otherwise, you've wasted your time.","I've wasted my time. I won't even say wasted money. It's a lot of money. Who cares. I don't care about the money. I've wasted a lot of time, a lot of energy, a lot of effort. We have to do this for the good of the country because we can turn our country around. And I will say, make America great again. And lately I've been adding because I've seen the people, they're incredible people make America great again.","We can make it greater and I really mean this. I think we can make it greater than ever before. It's true. But if we go four more years, we've got four more years with Obama and maybe worse between either of them. I mean how about this guy, this socialist, Bernie Sanders. I mean, this guy is a total whack job.","But if we go with either one of them, but let's assume, it's Hillary. I mean, you know, let's assume, if we go with either of these two people, I'm not sure you ever come back from it. It's going to be an abyss that I'm not sure that you can ever bring it back. But we can make America greater than ever before. Thank you very much everybody. Thank you. Thank you very much."],"text":" To be here. You know, Hillary was here not so long ago. She had 20 people. I just asked the police chief, how many were here? About 20. And I won't talk about the Republicans, but they were here and they had less than 20. We have a big crowd and I appreciate it. People are still coming in. Amazing. So we had a big day yesterday. Yesterday was amazing in every way. We had Sarah came along and she said, we love what's happening. It's a movement and no matter where we go, it's a movement. And right now, we're leaving, as soon as I'm finished, we're going to Oklahoma and we're going to have anywhere from 15,000 to 20,000 people in Oklahoma. The place is packed. We're going to be turning away people unfortunately. That's one of the problems that we endure. Last time we went to Oklahoma, we had 20,000 people at least outside. You know, outside, you can have as many as you want. Inside, it's a little bit tougher, right? It's a little bit tougher. But no matter where we go, we went to Dallas, we had 20,000 people. Mobile Alabama, we had 35,000. Everywhere in Iowa we're packed. Everywhere in New Hampshire. Everywhere in South Carolina. Everywhere we go, we're packed. It's just determined by the size of the room. So I just want to thank you all. It's early, I know, and it's a little bit cool outside, right? We're going through a little bit of a cool spell. I don't know despite global warming, it's awfully cold in these different places. It is really cold. I never thought of Iowa -- I'm here so much and I never thought of Iowa with such cold weather, but we're having a little bit of a cold spell. Don't we love it? We love it, right? So I just want to thank you all for being here and we're going to have a tremendous -- I think we're going to have a tremendous -- thank you, darling. Thank you. I love your hat too, make America great again. Make America great again. Thank you. Wow. I like that. Wow. That's great. Look at her. She's a fan. I know one thing on February 1st, she's out at the caucus. There's no question about that. She is gonna caucus. By the way, speaking of that. You have to get out, February 1st because otherwise -- OK. Good. Thank you. Good. February 1st, so important. Otherwise, honestly, we're just wasting our time. You know, it's wonderful. You'll hear me speak for a little while and all that. We're all wasting our time. Somebody called, a major major reporter, great reporter, actually, I am very liberal in this case and that's OK. They could be good too. They're putting their point of view. But the question was, how does it feel? I said, how does what feel? How does it feel? Because this was about four months ago, the summer of Trump, they called it, right? And probably, they thought that that would be the end and then would fade into oblivion. You know, they've been waiting and waiting and waiting and we keep going higher and higher and higher. And now they're not waiting so much anymore. That's the good news. They've been with me a long time. These people back there. We've been suffering together. The reporters, we suffered together. I call them, untruthful and they sort of just take it and actually, it doesn't hurt them because you know the truth sometimes they understand it. But we've had a hard time with them. But some are actually, some are very good about 25%, tops tops. But we've been together now for a long time. But, you know, it's interesting. So this reporter called the summer of trump, how does it feel? I said, it doesn't feel like anything. What's to feel? He said, you've done something that nobody has ever done before. What's happening here in terms of what's happened with, you know, with even concept with the way to run a campaign. Because if you look at what I've done, I mean now I'm spending money, but I've spent no money, practically, no money. And a guy like Bush spent $79 million, up to $79 million maybe even over 80 million and he's down here at the bottom and I'm at the top. And I said, wouldn't it be great if we could do that with our country, where we spent less money than anybody else and have the best product. You know, really, it would be really -- no, wouldn't that be great. But he said, how does it feel? And I said, it doesn't feel anything. He says, no, you don't understand. Even if you don't win, which I don't like to hear, even if you don't win, what you've done has never been done before. I said, let me tell you something, if I don't win, I've wasted my time. That's the way I view it. You know, maybe they'll say, hey, Trump ran a good campaign. Who cares? Doesn't mean anything to me. I guess I'll go back to building buildings and things, right? I do a good job with it. But -- and employing a lot of people. But he said that and I said, no, you don't understand. It really -- if I don't win, if I don't win, it's a whole different ball game. It means nothing. Everything I've done, everything my incredible people have done with Hope and Corey and Tanner and everybody and Chuck and Sam, honestly, it doesn't mean anything. It doesn't mean anything. So we want to get in and we want to win. And when I say win, we got to win here. And if we can win here, we're gonna run the table. I tell you but we're going to talk about that in a second. But when I talk to the reporter, I meant win for president because if we don't win for President, even if I won the nomination and didn't win, I would consider that a major loss. And other way, people would say, oh, what a great campaign. Not a great campaign. Because the only way we can really do real change, not Obama change, remember, change. We got change all right. I know the farmers got real change. They can't they can't plow. They can't do anything now with the water problems and the puddles that go and they call them a lake. You know, it's considered a lake. A puddle forms on your land it's four feet by four feet, oh, that's considered a lake. You can't touch it. This is this is reserved, the water. I mean, what you're going through or what everybody is going through with regulations and everything. I mean, look, everything. Everything you look at, all of that's going to be gone and we're going to go back to being a healthy, strong, beautiful and beautifully run nation again. So important. So we're going to go out and I just want to say, so February 1st, you've got to get out there. You've got to bring your friends and I joke and I kid. If you don't feel well, no matter what's happening, if you have the worst day of your life, it doesn't matter. You have to get out there. You have to caucus and we're going to bring it home. I mean ideally, we're going to bring it home. I'll tell you how important Iowa is though and I've been saying this more and more as we get to the finish line. Can you believe we're almost at the finish line? February 4 is the big day. You started it all. But I've been saying it more and more. If we can win Iowa, which is, by the way, the only state in the union where I'm close. Everyone else, Florida just came down a little while ago was on Morning Joe and the different newscasts, just came down a little while ago and 48% percent in Florida. And you have a sitting senator and he was at I think 11 or 12 and you have a governor, that a former Governor Bush who spends a lot of money. Yeah, Bush and he was less than that. I mean, it's amazing and people couldn't believe it. They said, there must be a mistake. You know, 48%. Florida is a very big -- you know, very important state not only in terms of this. Somebody is from Florida over there. Somebody loves rock. But I love Florida but -- and I have a lot of investment in Florida. Big investments in Florida. I employ thousands of people in Florida. But Florida is a special place but very big, very powerful and very important in terms of the process. And I have this massive lead in Florida that everybody was saying, wow, that has to be -- they actually thought it was a mistake when it went up. They thought the poll was a mistake, 48%. So and I'm doing I'm doing great all over. If we can do well in Iowa, we're going to run the table. If not, then I have to go and we got to win New Hampshire. Now New Hampshire has been really strong. But they say bad psychological things happen if you lose, OK? And they're really putting more pressure because they're saying, especially if Trump loses because he always talks about winning winning winning and if he loses Iowa that would be a terrible thing. The press. And so I don't know what the impact is. But I can tell you this, I think we're going to win. It's probably our closest state and I think we're going to win Iowa and it would be a lot easier if I said, no, I just want to do well. Good luck everybody on the first. If you're busy or something, don't bother. You to go out and caucus. Because if you can win and if we can win together, if we can win Iowa, the signal -- look, I'm not going to say anything is over. And even the biggest pundits, even my the worst liars and you know, some guys had said, we're never going to run. Even if he ran, he's just going to have a good time. Not a good time. I mean, I love you people but I could be someplace else right now, OK? I could be very happy being someplace else. But if we -- and really and they say it. If we win Iowa, we're going to run the table. We may not lose a state because it's just going to feed. Iowa is very important and one other thing with Iowa, you know, there's a lot of talk about moving Iowa to the middle of the pack or even the back of the pack. Not going to happen if I get elected. It won't happen. There's an incredible tradition. I've developed so many friends, you know, I've been here for a lot. I've come a lot and I'm going to be here all next week. You're going to be so sick of me. You're going to get sick. You're gonna say, get the hell out of here Trump. Don't worry about it. You're going to win. We don't want to take any chances. You know, one of the reasons I said that I spent very little money but now I'm spending money for two reasons. Number one, I feel guilty because I'm like $35 million, $38 million under budget. I -- who's going to spend a lot of money? But I've had so much airtime I haven't had to spend any money. So it's sort of interesting. No, it's true. You know they give me so much television airtime. I'm on all the time. Can you imagine they have this report, that report, that were all on Trump then they have a commercial. Now I have -- if I have a Trump commercial then they go back to trump the whole show plus the commercials. I say, if I put commercials on, they're going to OD on Trump. It's no good. It's no go. So anyway, but we're going to put them on now because I feel guilty. I really do. I haven't run commercials. And so I just started some good ones, I think. Who knows. But we have a couple of commercials going up. Lot of money. And the other reason is I'm so far under budget, I really feel I don't want to take a chance. Does that make sense? In other words, I feel confident. The polls are all saying we're leading nationwide by a tremendous amount. I don't want to take a chance. I don't want to be cute. Oh, I don't have to spend. I don't have to spend. So I'm not taking a chance so we're spending some good money, where you're going to see some good commercials going up very shortly. In fact, they're already up in Iowa. Some of you have probably seen them. Are they good? I think pretty good, right? I think they're pretty good. So Iowa is so important because by doing that we're sending a signal, and that's why I want to win it. I don't want to lose by two votes where they say, well, Trump came in second and that's OK. Winning would be so incredible. Look at these people, they don't stop. No matter where you go, no matter where you go, they don't stop. Would you like me to stand up against -- no matter -- it doesn't matter. I can't lose them. Look at them, the paparazzi. Look at them. I don't even know what the hell they do with all the pictures. They're taking pictures all day long. Then you see one picture in a newspaper. You say, all that work for one picture. Anyway, but they're good. They're very very good. Hey look, we're all doing our thing right. They're doing their thing. You're doing, we're all doing our thing. But the one thing we all have in common, including them, by the way, is we want to make America great again. We really do. We really do. The polls have come out and I love talking about polls. My favorite subject actually as long as I'm number one. If I was number two and I always get killed on the polls because the other candidates come up to me. Why do you always mention polls? Because I'm number one. And if you were number one you'd be mentioning them too. But I think I brought polls to a whole new art and a whole new level. I don't think other people even if they were number one used to talk about them, you know, but I'm different. I'm a little bit different. I talk about them because when you're number one, you talk about. OK, ready? So we have a new poll came out, NBC News National, 38% for Trump. Second place is Cruz in this one, 21%. 38%, 21%. And the third is Rubio at 11%. In South Carolina, we're way way way way above everybody. I mean, it's been incredible. Reuters has us at 41%. Gravis has us at 41%. Wow. Florida, I just -- you have is -- just the one that just came out has us at 48%. Georgia, we're in the mid 30s and probably the low 40s because I saw one. In Connecticut, we're 35%, meaning we're 35% other guys are at 12% and 10% and 8% and 2% and nothing. They are at -- some guys are nothing. And I see him on television. Yes, we'll never leave the race. You know they're leaving the race right away, right? I watch these politicians, I watch a couple of politicians, who was at one or two and he said, no, I will never leave the race. You know, he's already planning. His people are already calling, could you you hire us, please? And it's one of their -- they're politicians, that's what they do, they talk. All talk, no action and that's what we don't need. You know, that's what we don't need. In Iowa, we have a great CNN poll. I told the other day, I said, why don't they ever use the CNN poll? Even CNN doesn't use the CNN poll because it's too good. Trump 33%, Cruz is second at 20%. So I'm up by 13 points and nobody ever uses it. So CNN reports and they show other people's polls, which is closer. I say -- and by the way, they spent a lot of money on this poll and I think their poll is probably better and I think it's more indicative. I think, we might even be better than that. I said, why are you not using the poll that says 33% to 20%? Why are you using one that says 21% to 20% and this and that. And they have no answer. You can't answer. You know, what the answer is. It's really unfair stuff. It's called welcome to the world of Trump or welcome to the world of being a conservative Republican or welcome to whatever world it is. But here they are, they pay for their own poll and they don't put it up. So it's a little bit unfair but these are minor details, folks. I want to just -- so the polls are looking good and everything is looking good and it's so important. And I stayed here last night and actually had good steak. You have good steak and I've always heard that, you know? I had good steak last night. I mean you should have. If you don't have a good steak, who's going to have good steak? If they don't have good steak in Iowa, we have some problems, right? But you do and it was, it was great. I want to just say though and I said it a little and I alluded it -- I alluded to it. Sarah mentioned it yesterday, Sarah Palin came in and she was so great, she was so great yesterday and so popular and amazing actually and everybody wanted her endorsement. And she just saw what was happening. She said, you've got a movement. This is a movement going on. This is beyond what a normal situation is. And seriously, I mean they were telling me when some of these other candidates have like nine people and 20 people come in. And even for Hillary, she had very very few people coming in. And you know, you look at a crowd like this and it's early in the morning and all of that. And you know, it's -- something is happening out there, something really special you know they used to call it the silent majority. And I'm not -- I used to say, with the silent majority, I resurrected the term. Some people didn't like that term because it was associated with Nixon or it was associated with something. And I don't even care. I mean, it's just great term but it's not really accurate because the accurate is the noisy majority. We're really -- I mean, you have to see these people. They go crazy. We go into stadiums and they want to rip down the stadium sometimes. It's amazing. And it's really become the noisy majority and that's what we have. We have an amazing group of people that want to just see this country get great and be strong and be smart, and not be ripped off with trade and not be ripped off with so many different things. I mean, you look at China, $505 billion. We have a trade deficit, a deficit. What they get, what we get. $505 billion a year. This isn't like in 20 years. This is a year. It goes on. It goes on. And I have some of the great business leaders endorse me, like Carl Icahn endorsed me, who's a fantastic guy and a fantastic business leader. And when he endorsed me, I mean a lot of other business leaders also want to endorse me. Problem is nobody ever heard of him. But I'm going to use him. Then I said, you don't have to endorse me. What difference does it make? Nobody knows who you are. The guy could be worth $5 billion. Nobody cares. You know, it's amazing. But they're great negotiators and they want to do great things for the country. And right now, you know, take China as -- and I've been talking about China for years. You know, nobody knows how to negotiate with these people. I made a lot of money with China and dealing with China. And I own a major building in California along with a group, that's a phenomenal building, the Bank of America building in San Francisco and 1290 Avenue of the Americas, a big chunk of that. And you know, dealing with Chinese and he know how to deal. I mean, I sell condos to the Chinese a lot. I have them as tenants. The biggest bank in the world is a tenant of mine in one of my buildings and they pay me rent and they're great. I mean, the Chinese are great people. And the Mexicans are great people, but their leaders are too smart for our leaders. They're too cunning. They're too cunning. They're Cunning. They're smart. They toy with us like we're a bunch of dopes. They toy with us. They think everybody is like Obama. They toy -- no, it's true. No, it's true. I mean they toy with us and that won't happen anymore, folks. That won't happen. It's not going to happen. No, it's disgusting when you see, you know, when you see the trade deficits that we have with Mexico. Everyone of these politicians come up, you won't be able to build a wall. Why? Explain to me why? Well, who's going to -- I said, number one, the wall is gonna be paid for by? Correct. He knows. This guy knows. It's gonna be paid for by Mexico. So the politicians come up say, why do you always say that? You know, you know the guys that I'm negotiating, the guys that I'm dealing with. How good did I do in the debate last time, good? You know, I've never done this stuff before. But they all said I won the debate. Even the people that hate me back there, even the pundits. You know, every every debate, I've won with the polls. You know, they do the polls. Drudge is an amazing guy, by the way. You have Drudge and you have all these different polls, Time Magazine and Slate and PBS. And I win almost all of them and -- on the debate. And I'll get 40%, 50%, 60%, 70%. Who's going to win -- who won the debate. Yeah, it's a lot when you're 14, 15 people up there and you get 70% but I get a lot and I've done well. But this last debate for some reason even the pundits finally broke down and they said, Trump won. It's nice. OK? Took him a while, took a while. And now we have another debate coming up. I hope I get treated fairly. Some people on that debate stage that I don't know if they'll treat me fairly, but we'll see. But I hope they won't. I don't think they will either, frankly. We have some people up there that will -- we're gonna to find out whether or not they treat fairly. I'll be prepared. Believe me, I'll be prepared. But we're going to find out. And I think, I think it's important for actually for them as professionals that they treat me fairly. I don't want to be treated any better, but I have to be treated fairly. I thought I was not treated fairly in a couple of instances. But nevertheless, we came out fine. We came out really good. Sort of interesting after the debates, the poll goes up, you know, my big polls go up. After the last debate, my poll went up 11 points. Now, I also brought up some pretty big security measures in all fairness so maybe that had to do with it. You know what I'm talking about. But that was important and now we have a dialogue going. The world is having a dialogue because of what I brought up, radical Islamic terrorism. We mentioned it. And the world is in dialogue now. The world is talking. But we have a president that won't mention the terms. I mean they won't even -- he won't mention what's going on. When a building is blown up, when people are killed in Paris, when people are killed in California, when five great great soldiers are killed because they're told to stand down with their guns, to take their guns off and put them 100 yards away and lock them up. And then they go have coffee and a whack job. You know, when they see, when they see a gun free zone, these wacko -- they're just wackos. When they see gun free zone that's like holding candy for a baby, OK? Gun free zone. By the way, I'm going to protect your Second Amendment 100%. 100%. If we had guns in California or even you know take a look at Paris, the toughest gun laws in the world, the toughest they say in the world, Paris. You can't have a gun in Paris. Unless you're a bad guy, you put a gun in your pocket, you have a gun all right? But you can't have a gun in Paris. In France, the toughest gun laws. So you had these guys, these thugs, these thugs, the press, you know the name the press called them, right? We don't call them that anymore. We call them the guy with a dirty hat. These are stupid people and these are disgusting people, right? These are disgusting. They call them the mastermind, the leader, the mastermind. And I took the press the task. I haven't heard -- I must say I have been hitting them so hard about it because you know they're radicalizing our children. They're using the Internet better than us, and we're the people that invented the land that invented the Internet and they're using it better than us. They're radicalizing our children online and they're going around, the press calling them mastermind, the mastermind this and that. And I'm saying to myself, why are they calling them a mastermind? Why would anybody call them mastermind? You're building them up. You're building up the image, Robin Hood, you know, you're building up the image. And I'll tell you what, honestly, the press has pretty much stopped. It's been very interesting. The press is very stopped. How come you're aiming those cameras over there. What's over there? Just curious. Huh? Why are you aiming over there? Huh? OK. Cutaway, it's OK. It's the first time I've ever seen that happen. Now I'm trying to figure. You know, my story, right? They never aim the cameras at the room. I'm in a stadium with 20,000 people. My wife keeps saying, but you don't know -- I mean, how many people? I said like 20,000 with the Mavericks, the Dallas Mavericks play 20,000. She had no idea because they never -- they never do cutaways. Now he does a cutaway and he's aiming in that little corner in the back of the room. I can imagine. I can imagine. Why did you do a cutaway over there just out of curiosity? He can't. He can't tell you. Yes, he can't tell you. I can tell you why, I tell you these people are the worst. They are. They are disgusting. They're disgusting people. So anyways. So isn't it really terrible though? It's really terrible. And you know the one thing that's -- I'll call them out. Other people, they just sit there. They don't call. They don't call anybody out, but we call them out. They're really, they're really dishonest people, really really dishonest and disgusting people. So we're out there and and we will -- I will tell you, we will do things that nobody else can do. And when they say, but Mexico can't pay for the walls. Of course, they can. We have a trade deficit with Mexico that's unbelievably big, humongous. It's a humongous number. It's billions and billions of dollars, far more than what we're talking about for the wall. The wall is peanuts compared to that. But they don't understand that because they're politicians and not business people. Mexico will pay for the wall, OK? One way the other. There's five different ways they can pay. One of those five or all of them will take -- you know, we will we will not be paying for that wall, but the wall is going to be built fast. And we're going to be getting some people. You know, a lot of the gangs, you look at Los Angeles and some of these places, they have gangs where they're made up of illegal immigrants. OK? They're made up of illegal immigrants. Mexico doesn't want them. So they send them to us because we take everybody. We're so brilliant. We're so wonderful we take everybody. Even the anchor baby stuff, a woman is pregnancy, she walks onto the land. She has the baby. Here, we take care of the baby. Now, becomes a person, becomes a person and you know grows up and beautiful and the babies here, beautiful baby, now we take care of the baby for 85 years. OK? It doesn't read that way. And remember when I first came out and said that, I turned out to be right because the legal scholars say, you're right. You can't come over illegally, have a baby and we're supposed to take care of it. I mean, if anything else, I've proven that. Now somebody will challenge it. Somebody will go to court. But that's the way it reads. You may need a raise of the hands of Congress, but they were all saying you need a major constitutional amendment, which would take forever to get and all those things are like impossible to get because of the process. I said, well, you don't need a constitutional amendment. You can't come in, have a baby and then the baby we're supposed to take care of that baby for the rest and the baby is like you can't do anything. It's nonsense. Well, now the great legal scholars, the real legal scholars are saying Trump is right, OK? Trump is right. And you know and I'm very good when it comes to the law, I've been through plenty of law and you know speaking of law. Ted, do we all like Ted Cruz? I like him. I think he's a nice guy. No? You don't like him? All right. Look, he's fine. He's two-faced. A lot of people don't like him. A lot of people don't like him, frankly. But look, Ted Cruz has a problem. He's got a problem. He was born in Canada. He was -- he's a Canadian citizen until just recently. Canadian citizen and he's running for president. And a lot of lawyers and you've been seeing him on television, you've been reading about him in the papers. A lot of people are saying, he's not allowed to run for president because he wasn't born on the land. You know, natural born citizen is a real question as to what that definition is. And some of the best lawyers in the country, some of the biggest lawyer, Laurence Tribe of Harvard and others say, it's unsettled law. It's totally unsettled. And honestly, Ted has a problem because how can you have -- let's say, you have him as a candidate and he's running and then you find out you lose in court. You don't have a candidate all of a sudden. Or let's say even worse, let's say, he wins and the courts say that he's not allowed to run. I mean, you've got to find out. So you go for declaratory judgment. You go into the courts. But he actually has to go in to the courts. Now I understand he was sued recently over the last couple of days. Fact, I understand there are two lawsuits out there. But there will be more the Democrats will sue. If they're going to run again, they're not gonna sue now. They'll take their time. But at the right time, just as sure as you're standing here, sorry, we couldn't give you a seat. There's too many people sorry about that. But just as you are like you're standing here, the Democrats are going to sue. So how can you be running with a cloud over your head? Hillary is running with a cloud over her head too. It's called, you know, what the cloud is, right? He says it's called indictment. Well, no. I mean, what she's done is unbelievable that she's getting away with this. I think, personally, I think they're protecting her and they're going to continue to protect her. A lot of people say that's impossible because she broke the law so much worse than anybody else. I mean, there's never been anything like this. Look at General Petraeus, what that man has gone through and now they want to take away his title. And I would say this, leave him alone, OK? Right? Leave Petraeus alone. We have other problems. We have ISIS. Focus on ISIS. Don't focus on Petraeus. No, they want to reduce him in rank. I think he's suffered enough. But look at the way he suffered, and by the way I mean that, leave him alone. Don't reduce his rank. Just leave him alone. What that guy has gone through. He made a mistake. Leave him alone. But what he's going through and what others have gone through, and Hillary is just looking like she's sailing in. Now she might not win of her own volition. I don't know she's not doing very well. But on the assumption she won, I don't know how you can run for president. But she has a different kind of a problem, but he's got a problem of uncertainty. You just don't know. I mean, you just don't know. So let's see what happens with Cruz. But it's very hard to let somebody go through a whole long process and at the end of the process, should he win, they're going to get be suing him just like he's already being sued. And the fact is he was born in Canada and he was a Canadian citizen. I mean that's big stuff. And that's -- you're talking about 15 months ago. He was actually a Canadian citizen. If you think about this, he was a Canadian citizen while he was a United States senator. He was a joint citizen of the United States and Canada, but how do you do that? And he said, he didn't know about it, which is interesting. He didn't know about it. So I don't think, I don't think you can have a situation where, gee, I didn't know about it. Then in his papers, you know, his financial applications, it's a very very strict, very -- he didn't put in a couple of minor things. He said he was going to sell assets to run for the Senate and all of this. Well, that's not what he did. He borrowed money from Goldman Sachs and he borrowed money from Citibank. So it came out a week ago, a little while ago that he borrowed money from Goldman Sachs. But nobody knew about Citibank that he came out that he borrowed money. He never put it in his personal financial disclosure form. That's a big no, no. If I did that, can you imagine the headlines of me? I have billions and billions of dollars of stuff. I put in almost 100 pages. Every reporter back there. They've gone over every word. I mean, you haven't heard anything. I mean, I've professional people doing it but you haven't -- I guess, I got the right professional people because believe me if there was two cents worth of mistake, I have nothing but you know newspaper headlines. But I put in almost a hundred, the largest personal financial statement ever ever written, ever done, almost 100 pages and it's fine. You know, it's fine. It's gone over by everybody and it's fine. Here's a guy with two bank loans that we know of. But the problem is he didn't do it purposely because what he wanted to do is say, I will protect you from Goldman Sachs. I want to protect you from Citibank and I will protect you for the base because I'm Robin Hood and I'm this wonderful senator and I'm going to protect you for these banks and then he's borrowing from the banks. And by the way, he's got personal guarantees and he got low interest loans, got low interest loans, low interest. And now he's going to go after Goldman Sachs? Doesn't work that way. Goldman Sachs owns him. Remember that, folks. They own him. And what he did was wrong because he didn't want you to know that he's dealing with banks, that he's borrowing money with banks, that he's personally guaranteeing loans with banks because if he puts him down then he's just like all the other guys, OK? It's wrong. It's wrong. It's really wrong. And you can say what you want but it's absolutely wrong. So he's got a double problem. He's got that problem because it was just revealed. And now everybody is saying, oh, I thought he was trying to protect us. Well, what's he gonna to do? Be rough on Goldman Sachs when he has a personal guarantee for like whatever the number was a million dollars? So I think you've got to think about that. I think you've got to think about that. You agree with it? A lot of people don't know that, but it just came out. I mean, it just came out. And he said, with the -- being a Canadian citizen, he said, oh, I didn't know that. How did he not know that? Then he said with the loans, oh, I didn't know that. Smart guy. He doesn't know that. Yeah. That's worse than Hillary when you think about it. So anyways, I think we got to get a little bit you know fair in here because he says things about me that is so wrong. I mean, he says things, takes ads and says things about me that is so wrong. I mean, we have to disclose the real facts and these are facts. These aren't like, oh gee, this didn't -- this is like he didn't put down on his personal financial disclosure form, very strong that signature on the bottom. You sign that, you've got problems if you make mistakes. He didn't put down two big banks loaning a money because he didn't want you to see that, OK? That's a problem, OK? That's a problem. And I think when you go to caucus, you should think about that problem, OK? You should think about it. And the other thing, of course, is you have a great governor in this state. Terry Branstad came out yesterday and he said, you can't have, you can't have Cruz. You can't have Cruz. And I understand what he's saying. I understand exactly what he's saying. And I think it has to do with more than ethanol. I think it has to do with maybe other things too. It's a strong statement. You have a great governor. Here is the longest serving governor in the history of the United States as of a couple of months ago. And when I was with him, I really like him, I think he's smart and he's amazing and he loves the people of Iowa. I really like him and he says he's not endorsing anybody and I think that's great. But it took -- for him to come out with that statement, that was a big statement to come out with yesterday. Yesterday was a W. That statement, he had Sarah Palin, that was a good day for Trump. And the governor is doing the right thing. You know, he's the guy -- he's a governor that's going to do the right thing. You know, a lot of people do everything for politics. He doesn't do it for politics. He's beyond it and he does what is the right thing. So he's an amazing guy, I can tell you that. So we've got to keep him elected for a long time to come, folks, right? We want to have him. Let him, let him double up his record, but it's an amazing record. Think of it, in the history of the United States, he's the longest serving governor in the history of the United States. That's a lot. So we are going to do tremendous things. We're going to work hard on trade. I'm going to get the smartest, the best, the greatest people in the world. We're going to work really really hard on trade. We're going to work really really hard on everything. And when we work hard, we get it done. We're going to get the best people. We're going to make the best deals. I joke sometimes. I go, we're going to win and we're going to win again and again and again and you're going to be begging me, please Mr. Trump, please, President Trump, no more victories. We can't take any more victories. We can't take any more victories. Please, let's lose a couple of times, please. I'll say, no we're never going to lose. We're going to make America great again and everyone goes crazy. You know, we have fun with it. We have fun with it but we are, we're going to win so much. We are going to win so much. We're going to get rid of Obamacare and we're going to put something that's so much better. We're going to repeal it. We're going to replace it. We're going to get -- I tell you what, there are so many better things that are out there. But your premiums are going up, you see what's happening 25%, 35%, 45%. Your deductible is through the roof. You almost have to be dead to try and collect any of the deductible. That's become so high that I mean frankly, unless you need massive major surgery, you're out of business. It's ridiculous what's going on. And it's going to die in '17 anyway. They say, by '17, it's going to be dead because the wrong people are -- in terms of the people with the money aren't signing up. It's people without and it's just it just can't carry itself and it's just a disaster. It's a basic disaster. So that's going to be gone. We are going to do so great with our military. We're going to make our military so big and so strong and so powerful, and by the way, that's so much less expensive than what we're doing now. Nobody is going to mess with us. Nobody. Nobody is going to mess with us. We're going to take care of our vets and we're going to take care of them properly. Illegal immigrants are treated better in many cases than our vets. Our vets are treated horribly. They wait six days in a reception room before they can get care. We're going to take care of our vets and a lot of that's management. It's not even the money. They pour money into it. But you know, the corruption in the Veterans Administration is legendary and massive. You see what's going on in Arizona and other places. It's absolutely disgraceful. One other thing that I think is important and in Iowa, in particular, for whatever reason they love this, I'm self funding my own campaign, OK? I'm not having guys come up and give me millions and millions of dollars, and one guy wants insurance and one guy wants something else and one guy, you know, he's in such and such a business, oil or gas or this or that. And you know, we are -- I'm self funding and I'll tell you what, I have turned down so much money that I actually feel foolish in here. My whole life has been to take, take, right, take. I was greedy. I take, I take. Now, I'm going to be greedy for the United States. I'm going to take for the United States. I'm going to be greedy for our country. I'm going to take. We're not going to be the stupid people anymore. We're going to be the really smart people and we're going to bring it back. You know, we own $19 trillion, $19 trillion. That's rapidly going up to $21 trillion because of the ridiculous budget. You see the budget that was passed two weeks ago? We're funding everything. We're funding Obamacare. We're funding the Syrians coming in, which, by the way, not gonna happen. That's not going to happen. The Syrians, not -- we don't know who they are. We don't know who they are. We don't know where they come from. Some are ISIS, I think. I think, it's gonna be ISIS. You know, three, four weeks ago, I wouldn't have said that. But now, based if you look at what's happening with Denmark and Norway, if you look at what's happening with Germany, I mean take a look at Germany, what a disaster that is. And I was on Time Magazine -- by the way, get this week's Time Magazine spread. I'm on the cover. I like this week better than the last time. But this week -- this week's Time magazine story is amazing. It tells you about the campaign, what's happened. It's amazing and it's been an incredible story. But if you look at what's happening with the migration and we're taking in people. We have no idea who they are. And law enforcement, I've spoken to many of them, I've watched them, I've read about it so much and they say, there's no way of saying where these people are from, what they represent, who they represent. This could be the greatest Trojan horse in history. This could be the real deal Trojan horse and we want to take thousands and thousands and don't believe the 10,000 number. You know, even in the debate, the previous debate, they talked about 65,000 people, OK? And don't believe the numbers. They want to bring in tremendous, tremendous. And you know, very sadly, if they're Christian, they don't come in, OK? If they're Christian, they don't come in. And before this whole mess, if you were in Syria two, three, four years ago, one of the top experts told me this on borders and on the military, I mean this is a real guy that really understands what's going on. He said, you know, Mr. Trump, first time I heard it. He said, if you're from Syria and if you're a Muslim, it's very easy to come into the United States. One of the easier places. But if you're from Syria and if you're a Christian, it's almost impossible to come into the United States. One of the hardest things to do. If you -- I never forgot it. That was three years ago he told me, three and a half years ago. I never forgot what he said because Christianity is under siege, folks, whether you want to hear it or not, it's under siege. And we've got to reverse it. But if you were from Syria three years ago, four years ago, three and a half years ago, you wanted to come into this country, if you were Christian, one of the hardest places on earth to come into the United States was a Syrian who happen to be Christian. Something wrong. And they're the ones that really needed the protection more than anybody else. So it's all gonna change. It's all gonna change. We're going to use our heads. We're going to be fair. We're going to deal from the heart. We're going to deal from the brain and we're going to make America great again. And I'm telling you, so important is on February 1st. You have to get out there and you have to show our stuff because otherwise, you've wasted your time. I've wasted my time. I won't even say wasted money. It's a lot of money. Who cares. I don't care about the money. I've wasted a lot of time, a lot of energy, a lot of effort. We have to do this for the good of the country because we can turn our country around. And I will say, make America great again. And lately I've been adding because I've seen the people, they're incredible people make America great again. We can make it greater and I really mean this. I think we can make it greater than ever before. It's true. But if we go four more years, we've got four more years with Obama and maybe worse between either of them. I mean how about this guy, this socialist, Bernie Sanders. I mean, this guy is a total whack job. But if we go with either one of them, but let's assume, it's Hillary. I mean, you know, let's assume, if we go with either of these two people, I'm not sure you ever come back from it. It's going to be an abyss that I'm not sure that you can ever bring it back. But we can make America greater than ever before. Thank you very much everybody. Thank you. Thank you very much."}