{"id":469,"author":"Donald Trump","title":"Speech: Donald Trump in Winterset, IA","date":"2016-01-19","link":"https://factba.se/transcript/donald-trump-speech-winterset-ia-january-19-2016","paragraphs":["That is so -- Come on. Get right next to me. John Wayne would be very, very proud of you right now. I think maybe, maybe he would say, \"What are you doing?\" John Wayne would be and and I'll tell you what I've been a longtime fan and this all began when I came here and I was so fascinated and I really didn't want to leave, there's so much to see.","And I said Who put this all together and it was put together by great love with yourself, your directors, everybody, and I see that kind of effort and a little did I know that you'd be endorsing me and supporting me, so I really appreciate it. This is such an honor today. You see what happens with the press this is an amazing accumulation of press.","We have three events today and this is very important to me because of John -- John and his whole legacy. I met him one time and it made such an impression. When you talk about bigger than life, right? There aren't too many people bigger than life. Come to think of it, who do we have that's bigger than life today?","I won't use some of the names of the actors but not the same thing, not the same thing. So it's an honor to be here. It's a tremendous honor to have your support and endorsement. And we really very much appreciate it. Thank you very much. OK. Would be anybody else like to speak?","Yeah, sure.","Oh, good. Thank you. Thank you very much, I appreciate it. Press, any -- any questions Yes, Jeremy?","We have a tremendous event planned in a little while. That'll be our third stop. This is our first stop. And again, I just have to say, I was such a fan of John Wayne and the one meeting I had with him was just an amazing meeting. And it was toward the end of his life. He was just an incredible guy. He said some things to me that were very special.","And so this is a very great honor. That'll be -- that'll be a very big event. I think you'll be very impressed.","I'm a big fan of Sarah Palin. Yes. That I won't say. I am a big fan of Sarah Palin but I'm not saying who it is. Yes.","Well -- we'll talk about it later. I think. We'll talk about that later. But it's a very big event planned and I think everyone's going to be very impressed. And nobody knows who it is and that's fine. Yes, sir.","Well, I have a real conservative and Russia has been terrific to me and Russia's really been amazing to me. And I actually read what he said and he's -- he's still amazing to me. So I appreciate everything Russia's done for me, 100%.","Well there is and at first I didn't feel that necessarily they'd come together like that. But when you think of a John Wayne represented strength, he represented power, he represented what the people are looking today because we have exactly the opposite from John Wayne right now in this country, and he represented real strength and an inner strength that you don't see very often.","And that's why with this endorsement, it meant so much to me and that's why we actually went very far out of our way to come and be with the family and the group and the director and to be right here because they've done such an incredible job. I mean, this really all started, I walked around and we were here and we got here a little bit early and I looked at everything, I said, \"They've done an incredible job.\" and I would imagine they will get a lot of people coming here especially now with all of you characters.","You get a lot of -- You can have a lot of people probably, there'll be a rush to the front door tomorrow, you'll say, \"What happened?\" but he deserves it. John Wayne and the family they deserve it. Yes.","Well I think endorsements are depending on who -- very valuable. I've never been a huge fan of endorsements of the candidate mostly. And I've seen very important people endorse others and, you know, nothing happened. But I think, you know, having a John Wayne and John Wayne family endorsement means a lot because it does mean that strength that you don't see and I think you'll be impressed with the endorsement we get later on.","Excuse me?","I think so it could. It could. I think it could very well and you know result in votes would do it very well. The polls just came out in South Carolina where, as you saw, I went up four points and Cruz went down three and most of the others sort of went down and were doing really well in South Carolina. That just came out I guess is a very big poll coming up today in New Hampshire that I hear is going to be released fairly soon.","I don't know what the results are. But I just can tell you I'm doing very well in New Hampshire from every -- every indication.","Well I think I feel very good about my ground game. We have a great group of people. Where's Chuck? Chuck. Come here, Chuck. Get over here, Chuck. I'm going to put all the pressure on Chuck. Come here, Chuck. The question is how do we feel about our ground game? Can Chuck answer that question, please. Because if he doesn't do a good, Chuck, you're fired.",". Get them. How are you doing lately?","Better than we like you people, believe me.","He was strong and he was honest. You know we like that better. And one of the things I like about Chuck. He doesn't want to bother with the press because he gets so misrepresented and so do we, and he doesn't want to bother with the press. But you know because I've seen things that they've that he said and then they totally misrepresent.","I think we have a great ground game, I think we're going to have a great shot at winning Iowa hopefully win Iowa. We're going to give it our best. We're even in the polls were up in some of the polls. Sarah, in your poll was substantially up on CNN with 33 to 20 but nobody ever talks about that poll. Chuck, they never talk about the CNN poll, right?","No. Even CNN doesn't talk. They don't report their own poll. CNN does a poll, they spend a fortune on it and they don't talk about it because the numbers were too good. And so we're reading other polls that CNN has nothing to do with. So you'll have to figure that one out, Sarah. OK. I think I have it figured out pretty well.","But anyway, yes.","My goal is just to win, if we can. And I think we're gonna do very well in Iowa. We have a great relationship with evangelicals, with the Tea Party, with everybody in Iowa. And I think we're going to do really well in Iowa. And you know, I guess a lot of other people think we're going to do really well it's a question where we win it or not.","I hope we win. It would be a lot easier for me to say, \"Well I just want to do well.\" I'd really like to win. And don't forget Iowa hasn't picked that winner for 16 years. If they pick somebody other than me they're going to pick another loser. OK. So I want to see Iowa win and I think it's very important that Iowa picks the right person this time.","And you know they've had a rough, they've had a rough 16 years but we are going to win. You know we're beating Hillary in many of the recent polls, substantially in some, and we're going to win. We're going to bring in states like New York that are never in play for Republicans. Pennsylvania, Virginia, Ohio, we're going to win.","We're going to win Florida. We're going to win a lot of states West Virginia, here is like through the roof for Trump. They just came out with a poll but we're going to bring a lot of states in that a traditional politician is never gonna even go to to visit and we're going to win. I think we have a really good chance as an example of New York State.","So we'll see what happens. Yes.","Yeah.","I did very well. I did very well with the Taj Mahal. Made a lot of money. All right. Who else?","Well, I always like to threaten to sue reporters because I think they're among the most dishonest people I've ever dealt with in my life. So usually and sometimes I do actually said no. Reporters -- Who are you with, by the way?","Oh, good. Great. Great. I don't recognize you. No I threatened to sue reporters only when they're dishonest. Actually there's some reporters I have great respect for. Hard to believe. I was a little bit inaccurate but it's irrelevant. I did very well with it as you probably noticed. Yes, go ahead.","Well it's a shame what's happening in Flint, Michigan. Things like that shouldn't happen. But again I don't want to comment on that. They've got a very difficult problem and I know the governor has got a very difficult time going. But you know I shouldn't be commenting on Flint. Yes.","Well, no. At some point I will. We had a tremendous event yesterday at Liberty. We had the highest attendance they've ever had. In fact, Dr. Falwell just announced that a little while ago. He just announced he was the highest attendance they've ever had an event. And you said nobody -- nobody says that you know it's interesting Bernie Sanders had like 3,000 people the other day in an event and they said, \"Oh what a big crowd.\" I had 14 or 15,000 at a different event.","Nobody talked about the size of my crowd. It's an incredible thing that goes on here. But no, it wasn't appropriate to mention him and then in the second part of the event it wasn't really appropriate. But at the right -- but people understand and people understand.","No, no. No, not at all because I was in front of a very large crowd and I didn't want to speak about other people but that was an amazing event yesterday at Liberty, I was really happy with it. And Dr. Falwell just announced a little while ago is the biggest attendance they've ever had in the history of Liberty University, so I'm very happy with that.","Sarah did you have another one?","Well I think I have a great temperament. In fact, if you notice, I'm the only one that didn't want to go into Iraq. OK. You know people are always surprised that Trump did want to go in the most militaristic of any of them. Feel stronger about the military than anybody. But if you go back to Reuters in 2004 or even before that, you'll see Trump did want to go into Iraq because I said it's going to totally destabilize the Middle East and I'm absolutely right.","So when you talk about temperament, Ted has got a rough temperament. I don't know, you can't say, you know, you can't call people liars on the Senate floor when they're your leader. It's not a good thing to do if you want to sort of curry favor and get the positive votes later on down. So Ted is worried about his temperament and people are talking about his temperament.","I haven't talked about his temperament but he's got to be careful because his temperament is, you know, has been questioned a lot.","Oh, I think I work great. In fact, I will say this, because we're leading so big in virtually every poll and after the debate performance, where I think you will say almost everybody said Trump won. Is that a correct statement Sarah?","A strong debate. OK. Well most people said I win and I think you believe that too. But I will say that we have been contacted by so-called establishment types and maybe that's a bad thing that could be a bad sign. I'm not sure I'm happy about it. But we've been complimented and by so many people and we've been contacted by the establishment types they all want to know how did they get involved with the campaign.","They're giving up on their candidates. And how do they get it. And I mean these are real establishment people that I've known when I was a member of the establishment and meaning a giver, a big donor. But they are contacting us. Corey, I think we can say that very honestly. They're contacting us left and right about joining the campaign.","And these are serious establishment types. I also said just now Corey I'm not sure that's a good thing or a bad thing, frankly. And I don't even care that much. It doesn't matter. We want to just, very simple, Make America Great Again. So I'll see you, folks, in a little while and I'll see you specifically at our third meeting where we can have a good time.","Thank you. And we love John Wayne. We love John Wayne and we love his family equally, right? Equally. And thank you very much. Thank you."],"text":" -- welcome personally here to the birthplace of John Wayne and that is Mr. Donald Trump. And hopefully for America, he'll be our next president of the United States. And the reason that I'm here to support Mr. Trump is because America needs help and we need a strong leader and we need someone like Mr. Trump with leadership qualities, someone with courage, someone that's strong like John Wayne. And I'll tell you what, if John Wayne were around, he'd be standing right here instead of me. So with that I just want you to welcome Mr. Donald Trump. That is so -- Come on. Get right next to me. John Wayne would be very, very proud of you right now. I think maybe, maybe he would say, \"What are you doing?\" John Wayne would be and and I'll tell you what I've been a longtime fan and this all began when I came here and I was so fascinated and I really didn't want to leave, there's so much to see. And I said Who put this all together and it was put together by great love with yourself, your directors, everybody, and I see that kind of effort and a little did I know that you'd be endorsing me and supporting me, so I really appreciate it. This is such an honor today. You see what happens with the press this is an amazing accumulation of press. We have three events today and this is very important to me because of John -- John and his whole legacy. I met him one time and it made such an impression. When you talk about bigger than life, right? There aren't too many people bigger than life. Come to think of it, who do we have that's bigger than life today? I won't use some of the names of the actors but not the same thing, not the same thing. So it's an honor to be here. It's a tremendous honor to have your support and endorsement. And we really very much appreciate it. Thank you very much. OK. Would be anybody else like to speak? Yeah, sure. Oh, good. Thank you. Thank you very much, I appreciate it. Press, any -- any questions Yes, Jeremy? We have a tremendous event planned in a little while. That'll be our third stop. This is our first stop. And again, I just have to say, I was such a fan of John Wayne and the one meeting I had with him was just an amazing meeting. And it was toward the end of his life. He was just an incredible guy. He said some things to me that were very special. And so this is a very great honor. That'll be -- that'll be a very big event. I think you'll be very impressed. I'm a big fan of Sarah Palin. Yes. That I won't say. I am a big fan of Sarah Palin but I'm not saying who it is. Yes. Well -- we'll talk about it later. I think. We'll talk about that later. But it's a very big event planned and I think everyone's going to be very impressed. And nobody knows who it is and that's fine. Yes, sir. Well, I have a real conservative and Russia has been terrific to me and Russia's really been amazing to me. And I actually read what he said and he's -- he's still amazing to me. So I appreciate everything Russia's done for me, 100%. Well there is and at first I didn't feel that necessarily they'd come together like that. But when you think of a John Wayne represented strength, he represented power, he represented what the people are looking today because we have exactly the opposite from John Wayne right now in this country, and he represented real strength and an inner strength that you don't see very often. And that's why with this endorsement, it meant so much to me and that's why we actually went very far out of our way to come and be with the family and the group and the director and to be right here because they've done such an incredible job. I mean, this really all started, I walked around and we were here and we got here a little bit early and I looked at everything, I said, \"They've done an incredible job.\" and I would imagine they will get a lot of people coming here especially now with all of you characters. You get a lot of -- You can have a lot of people probably, there'll be a rush to the front door tomorrow, you'll say, \"What happened?\" but he deserves it. John Wayne and the family they deserve it. Yes. Well I think endorsements are depending on who -- very valuable. I've never been a huge fan of endorsements of the candidate mostly. And I've seen very important people endorse others and, you know, nothing happened. But I think, you know, having a John Wayne and John Wayne family endorsement means a lot because it does mean that strength that you don't see and I think you'll be impressed with the endorsement we get later on. Excuse me? I think so it could. It could. I think it could very well and you know result in votes would do it very well. The polls just came out in South Carolina where, as you saw, I went up four points and Cruz went down three and most of the others sort of went down and were doing really well in South Carolina. That just came out I guess is a very big poll coming up today in New Hampshire that I hear is going to be released fairly soon. I don't know what the results are. But I just can tell you I'm doing very well in New Hampshire from every -- every indication. Well I think I feel very good about my ground game. We have a great group of people. Where's Chuck? Chuck. Come here, Chuck. Get over here, Chuck. I'm going to put all the pressure on Chuck. Come here, Chuck. The question is how do we feel about our ground game? Can Chuck answer that question, please. Because if he doesn't do a good, Chuck, you're fired. . Get them. How are you doing lately? I feel fantastic about the ground game and I know we go radio silent on those things but there is nothing about this campaign that's like all the rest, for any of those in the past. We do things different and we reach out to people that would normally be caught dead at caucus events. And so we feel really good about our chances. We feel really good about our reach. And I think you're going to have a surprise on caucus night. You know we don't advertise our caucus trainings and we generally don't like you folks in because we're working, and it's not about you it's about our ground game. We've had just in the last week 13 caucus trainings, now misreported in the media yesterday wildly, horribly that we had 12 people at that caucus training last Friday. It was 120 and you all know it but no one corrected it. One hundred and twenty. No. So that's why we don't talk to you folks all that much about our ground game because you're welcomed in we get your cameras in and then you misreported anyway. So I'm getting off on a I'm a big fan of John Wayne. Better than we like you people, believe me. Oh, yeah, yeah. He was strong and he was honest. You know we like that better. And one of the things I like about Chuck. He doesn't want to bother with the press because he gets so misrepresented and so do we, and he doesn't want to bother with the press. But you know because I've seen things that they've that he said and then they totally misrepresent. I think we have a great ground game, I think we're going to have a great shot at winning Iowa hopefully win Iowa. We're going to give it our best. We're even in the polls were up in some of the polls. Sarah, in your poll was substantially up on CNN with 33 to 20 but nobody ever talks about that poll. Chuck, they never talk about the CNN poll, right? No. Even CNN doesn't talk. They don't report their own poll. CNN does a poll, they spend a fortune on it and they don't talk about it because the numbers were too good. And so we're reading other polls that CNN has nothing to do with. So you'll have to figure that one out, Sarah. OK. I think I have it figured out pretty well. But anyway, yes. My goal is just to win, if we can. And I think we're gonna do very well in Iowa. We have a great relationship with evangelicals, with the Tea Party, with everybody in Iowa. And I think we're going to do really well in Iowa. And you know, I guess a lot of other people think we're going to do really well it's a question where we win it or not. I hope we win. It would be a lot easier for me to say, \"Well I just want to do well.\" I'd really like to win. And don't forget Iowa hasn't picked that winner for 16 years. If they pick somebody other than me they're going to pick another loser. OK. So I want to see Iowa win and I think it's very important that Iowa picks the right person this time. And you know they've had a rough, they've had a rough 16 years but we are going to win. You know we're beating Hillary in many of the recent polls, substantially in some, and we're going to win. We're going to bring in states like New York that are never in play for Republicans. Pennsylvania, Virginia, Ohio, we're going to win. We're going to win Florida. We're going to win a lot of states West Virginia, here is like through the roof for Trump. They just came out with a poll but we're going to bring a lot of states in that a traditional politician is never gonna even go to to visit and we're going to win. I think we have a really good chance as an example of New York State. So we'll see what happens. Yes. Yeah. I did very well. I did very well with the Taj Mahal. Made a lot of money. All right. Who else? Well, I always like to threaten to sue reporters because I think they're among the most dishonest people I've ever dealt with in my life. So usually and sometimes I do actually said no. Reporters -- Who are you with, by the way? Oh, good. Great. Great. I don't recognize you. No I threatened to sue reporters only when they're dishonest. Actually there's some reporters I have great respect for. Hard to believe. I was a little bit inaccurate but it's irrelevant. I did very well with it as you probably noticed. Yes, go ahead. Well it's a shame what's happening in Flint, Michigan. Things like that shouldn't happen. But again I don't want to comment on that. They've got a very difficult problem and I know the governor has got a very difficult time going. But you know I shouldn't be commenting on Flint. Yes. Well, no. At some point I will. We had a tremendous event yesterday at Liberty. We had the highest attendance they've ever had. In fact, Dr. Falwell just announced that a little while ago. He just announced he was the highest attendance they've ever had an event. And you said nobody -- nobody says that you know it's interesting Bernie Sanders had like 3,000 people the other day in an event and they said, \"Oh what a big crowd.\" I had 14 or 15,000 at a different event. Nobody talked about the size of my crowd. It's an incredible thing that goes on here. But no, it wasn't appropriate to mention him and then in the second part of the event it wasn't really appropriate. But at the right -- but people understand and people understand. No, no. No, not at all because I was in front of a very large crowd and I didn't want to speak about other people but that was an amazing event yesterday at Liberty, I was really happy with it. And Dr. Falwell just announced a little while ago is the biggest attendance they've ever had in the history of Liberty University, so I'm very happy with that. Sarah did you have another one? Well I think I have a great temperament. In fact, if you notice, I'm the only one that didn't want to go into Iraq. OK. You know people are always surprised that Trump did want to go in the most militaristic of any of them. Feel stronger about the military than anybody. But if you go back to Reuters in 2004 or even before that, you'll see Trump did want to go into Iraq because I said it's going to totally destabilize the Middle East and I'm absolutely right. So when you talk about temperament, Ted has got a rough temperament. I don't know, you can't say, you know, you can't call people liars on the Senate floor when they're your leader. It's not a good thing to do if you want to sort of curry favor and get the positive votes later on down. So Ted is worried about his temperament and people are talking about his temperament. I haven't talked about his temperament but he's got to be careful because his temperament is, you know, has been questioned a lot. Oh, I think I work great. In fact, I will say this, because we're leading so big in virtually every poll and after the debate performance, where I think you will say almost everybody said Trump won. Is that a correct statement Sarah? A strong debate. OK. Well most people said I win and I think you believe that too. But I will say that we have been contacted by so-called establishment types and maybe that's a bad thing that could be a bad sign. I'm not sure I'm happy about it. But we've been complimented and by so many people and we've been contacted by the establishment types they all want to know how did they get involved with the campaign. They're giving up on their candidates. And how do they get it. And I mean these are real establishment people that I've known when I was a member of the establishment and meaning a giver, a big donor. But they are contacting us. Corey, I think we can say that very honestly. They're contacting us left and right about joining the campaign. And these are serious establishment types. I also said just now Corey I'm not sure that's a good thing or a bad thing, frankly. And I don't even care that much. It doesn't matter. We want to just, very simple, Make America Great Again. So I'll see you, folks, in a little while and I'll see you specifically at our third meeting where we can have a good time. Thank you. And we love John Wayne. We love John Wayne and we love his family equally, right? Equally. And thank you very much. Thank you."}