{"id":470,"author":"Donald Trump","title":"Speech: Donald Trump Delivers a Campaign Speech in Ames, IA","date":"2016-01-19","link":"https://factba.se/transcript/donald-trump-speech-ames-ia-january-19-2016","paragraphs":["Wow. What a crowd. Thank you very much, everybody. Such an honor. With the snow coming down and it's a little cold outside and you have hundreds of people still outside trying to get in, but you know, we won't wait. We'll go ahead, right? Huh? We'll go ahead. First of all, congratulations to the Iowa State basketball team.","You had -- what was that all about? I turned on the game. I said, wow, this shouldn't be that good a game. And then at the end of the game, I said, who won? Yes? That was great. That was great and that's a great achievement. I want to also pay my respects. Ben Carson they had a really bad accident. Some of his staffers were hurt pretty bad.","So I just want to pay my respects to Ben. He's a good guy, a really good guy and his staffers. And hopefully, they get better. Say a prayer for him, OK? We've had an amazing time today. We've been all over Iowa and we're gonna be here tomorrow. We're gonna be here so much. You're gonna get so sick of me. You're gonna say, please, tell him to get out of here.","Tell him to leave. Tell him to go, but we've had an incredible time. And you know, it started really we've had really a pretty good week. The debate last week, everybody watched the debate. And who knew about these debates? I didn't know anything about the debates. And it's been, it's been fun and it's been interesting.","And I've been treated semi fairly by the moderators, not 100%. Some have been very fair actually and some have been not so fair. But, you know, a lot of the press hasn't been very fair. Well, look at all the press back there. They must think there's a big event gonna happen today. Wow. That's a lot of -- this is like the Academy Awards.","But we've had an amazing -- it's been an amazing experience. And it started really on June 16th when we came down the escalator. We came down that escalator and it was -- I said let's go to my wife, who's been so supportive and so wonderful. I said let's go. We're gonna make America great again. That's what we're going to do. And you know, it was -- it's hard to do this because when you think of it, I've never done it before.","I've never been a politician. Thank goodness. But I've never been a -- I've always done jobs and put a lot of people to work. Tens of thousands of people over the years. And you know, I have thousands of Hispanics that love me. The Nevada polls just came out where I'm leading with Hispanics, which I knew, I knew.","And we came out and at that particular opening, when I opened and said I'm gonna run for president. I gave up a lot, you know, gave up a lot of different things, including telling our friends at NBC no more Apprentice. That's hard to do. You have a top show. When you say, I'm not doing it anymore. I'm sorry.","They wanted to do it so badly. And Steve Berke, who is a fantastic executive, came up to my office and he said, come on, Donald. Come on do it. You're not gonna run. Do it. Do it. I said, Steve, I'm gonna run. I was pretty sure. You know, that was about two months before. I was pretty sure. It really is a tough thing to do. You know, all my life I've heard if you're a very successful person, you'll never run for president.","You'll never really run for politics, but you'll never ever run for president. And I built a great company and it's a tremendous numbers. You saw the filings and the press was gonna look so closely that it was like -- it was like D-Day when we put those papers in. You know, first thing I did, I announced.","They said, oh, he's actually gonna do it because most of them said he'll never do it. Then I signed -- when I signed Form A it's -- that's when you sign your life away. And I signed that. They said, whoa, he signed that. Well, he'll never file the financials because maybe he's not as rich as everybody thinks.","And I filed the financials and they saw an unbelievable -- you didn't hear a thing about it. Oh boy, were they looking. I mean, were they looking. And almost 100 pages, the biggest report ever filed with the FEC in terms of that and it showed a company that's a phenomenal company, of some of the great assets, very little debt, tremendous cash flow.","You know, the way it's supposed to be and it was -- it's great. And the reason I tell you that is because that is the kind of thinking we need now in the United States. We need that kind of thinking. We need that whatever it is. We need a mentality that's gonna -- you know, we're at $19 trillion in debt.","It's gonna be up to $21 trillion. You saw that horrible budget, horrible, horrible budget that was approved two weeks ago and that's gonna lift it. And so we went along and a lot of things have happened and then the polls came out, which I love. And new ones came out today, by the way, I'll tell you right now.","You know, and now that we're at it. And they came out, some brand new ones, some beauties and ones coming out, I guess, a big one is coming out. I don't know exactly what it is. But it's got to be pretty good because I see the response. I mean even this, with all the people still trying to come in to this building.","Somebody said it's a barn. This is a very nice barn actually. But with all of the people still trying to come in, you see what it is and we do have something special in a couple of minutes really. To me, it's really special because it's a person that I think is a spectacular person. So it's very special to me. But then the polls came out and some of them, as an example, National polls: 38% for Trump; 20% for second.","I wouldn't even mention names, right? All right. I won't even mention. I'm gonna be non confrontational today for a change. 21% for the second; 11% and then they're all down and some of them are actually like 0 and 1%. I don't know. Jeb? You know, Jeb has got one problem. He loves Common Core.","Meaning he wants your kids educated from Washington, which is immediately no good. And his second problem is he's very, you know, very weak on illegal immigration. Remember he said they come as an act of love. I said what? They come as an act of love. So I think those are two very bad points, frankly. But you -- Thank you.","USA. USA. USA. USA. USA. Thank you. Thank you, everybody. Thank you. Thank you very much. So we had we had another one, a big one come out. Go ahead. You can get him out please. Yeah, you can take him out now please. Never fails. Thank you. Thank you, darling. Maybe you could be quiet a little bit while they take you out.","You know, I have to be careful. If I'm too rough, they say he was too rough. Then when I'm moderate and nice, they were saying what happened to Trump. He's not tough enough. So you can't win with these people. The one good thing is they always show the crowd. That's the only way they show how big our crowds are.","So all right, get him out. Get him out of here. All right. So South Carolina just came out and that's 32 for Trump; 18 for second; 11 for third. Great. Florida leading by a lot: 31, 19, 13 and then all down in the dumps. Georgia you just came out, I have 33%. Yeah, don't forget that 33%. It's hard to believe that's with 14 people, 15 people.","I don't know when they took it, but it was recent. 33%. Connecticut. Now Tom Brady loves me and that's sort of like, you know. And I love Tom Brady, by the way. 35% to 18% to 9% to 2% to nothing. Maryland just came out. Maryland great place. 32% to 15% to 11% to 9% and then you know they sort of phase out.","You ever hear of a place called Iowa? Oh, I love this. We're doing actually great. First off, I have to tell you, you know, they never reported. Even CNN doesn't report it. CNN does a poll, probably spend millions. They never report their poll. The CNN poll was 33 for Trump, 20 for Cruz.","Nobody talks about it. Nobody talks. They don't talk. They talk about CNN is reporting other people's polls. So I call up. I said, wait a minute, you're CNN, you spent a fortune on polls and you don't report your own poll because I'm winning by a lot. And they have no excuse but they keep reporting other polls.","But we're doing well. I think we're doing a lot better than anyone knows. Gravis just came out: 34 for Trump, 28 for Cruz. PPP: 28 for Trump, 26 for Cruz. In other words, it's a little close here. Quinnipiac poll, very respected, 31 for Trump, 29 for Cruz. And then again CNN, 33 to 20. So we're -- I think we're doing good.","I think we're actually doing better in the polls. Now, I could do this. I could say, well, I just want to do well in Iowa. I want to win Iowa, folks. Because look, I love the people. The evangelicals have been phenomenal. I'm doing great with the evangelicals. But nationwide, I'm winning with evangelicals.","I don't know if you that by a lot, nationwide. With Iowa, I'm doing really well with the evangelicals. We're doing really well with the Tea Party. We're doing well. I mean, you hear the numbers, I mean these are the numbers. But I actually think we're doing even better than the polls. And you know there's the thing that a lot of people said.","Well, you know, they call up. Are you gonna vote for Trump? He's got very, very tough immigration policies. He wants to destroy Obamacare and replace it with something a lot better. I'm gonna do tough, OK? But you know, and a lot of people that pick up a phone and they'll hear different things. And they'll say, no, I'll vote for -- and then they get in the booth.","They'll say, Trump is my man. There are a lot of people saying that we're gonna do a lot better. Well, we'll see. Because February 1st, you have to get to caucus, you have to go out. You got to do it. It's so -- Otherwise, we've all wasted our time. You know, one of the groups in Maine and it was like incredible.","We were in different places up in New England recently and New Hampshire was amazing. And the people are standing. It was so cold. It was one little group of -- despite global warming, you know you hear all of that. It was so cold. It was windchill below zero. And people are standing outside for hours trying to get in. And then you hear the announcers, well, will they show up to vote?","And I don't know much but I say like if people are to stand out for four hours in the cold or the heat because believe me they stood out in heat during the summer and during the fall like you wouldn't believe. In Tennessee, in Texas, we have 21,000 people. No matter where we go, we have these big crowds.","But they'll stand for hours and hours to get in. Why aren't they gonna go and vote or in your case, caucus? Why are they gonna go and vote? It's sort of an amazing thing. So we think they're gonna really be -- why would somebody wait four hours, for four hours and then we're not gonna take two minutes to vote?","Boom. Now, yours is a little more complicated because the caucus system is a little bit different. It's very, very interesting system but it is different. Here's what I have to say about Iowa. It's very important. So you know, there's a movement to move Iowa to the back of the pack, OK? You know that. You'll still see me, but you won't see other people.","Believe me. I'm loyal. To a fault, I'm loyal. But you're gonna see. I give you my word. I win. They're not touching Iowa. This is an amazing tradition. No, seriously. This is an amazing tradition. They're not moving Iowa. They're not -- and they're not moving New Hampshire either because they're talking about Iowa and New Hampshire.","They're not touching New Hampshire. So we're gonna just keep it the way it is. It really is. It's an amazing -- first of all, you're amazing people. But all over the country, it's a movement, all over the country. The people are incredible. They want to make America great again. They're gonna do something that's special.","And you know, we used to talk silent majority. I say it's the noisy majority because it's actually a noisy majority. It's not a silent majority. But people are fed up. So I started on June 16th and we did well right practically from the beginning. We went up. And if you remember, we started at nothing. We started at nothing because nobody believed I was gonna vote.","So even when they -- my wife said, you know if you run, you're going to win. I said, what do you mean? People don't believe you're gonna run. So the polls -- you know because I was getting these little polls, I felt like some of these guys now that the Senators and Governors they get these little polls -- it's getting these... They can't get this guy.","He goes Jeb again, right? Boy, he's getting -- he's taken a lot of abuse, you know? I told him. I said, you know what, you should use the name Bush. What's wrong? Use the name Bush. I mean, maybe it's not working. But it's better than Jeb, right? You know, I really do. Get rid of the exclamation point. I just put Jeb Bush.","That's your name. Don't be ashamed of your name. So anyway. So anyway. So I hope -- you know, I wish him the best. But you know, I sort of -- so I started and I started at like two or three. And then it went to six and then went to nine. And each time the pundits, these real geniuses back here, some of them are sitting back there.","These real geniuses, like George Will, with a little glasses. Take away the glasses, he looks like a dumb guy. I'm telling you. But each time these geniuses would say, well, he's reached his plateau. He's plateaued at six, right? Then it goes to eleven. Well, you know, this is surprising but he's reached his plateau.","And then it goes to 18. Then it went to 22, 24, 28. Then it went to 32. Then it went actually to 42 in the Gravis poll. And in Reuters, we get to 42 and even a little above that. And all of a sudden, you didn't hear so much about the plateau. I want to plateau at 42. You know, 42 with like 14 people. That's pretty good.","But they kept saying he plateaued. That's all he'll get. He's got these followers. We have the smartest followers there are, number one. We have the smartest and the hardest working followers. We have people that love the country more than anybody, and they want to take back what's happened because our country is gonna hell.","We can be nice about it. We can say it nice and soft. Our country is going to hell. When you look at this crazy Iran deal where we're paying $150 billion and they give us five back, but they don't know where the fifth is. And you understand what that means, that's not a good sign. But they give us five people, but they get seven and they get 14 off the Interpol list.","These are bad dudes. They get 14 plus seven, so they're getting 21 people and they have the right to do whatever they want from an enterprise standpoint, right to do oil, right to do whatever they want. But why do they also get out of that deal? First of all, they're gonna get nuclear. They don't have to develop missiles.","They can buy them. For the kind of money we gave, they're gonna buy them. Why are they gonna develop? Remember the deal? 24 days, they have 24 days for inspection period. They also have self inspection, right? But we paid $150 billion. And I was saying, wow, what a great -- the Persians are great negotiators.","I say what a great deal that is. And then I said -- two weeks ago I started. I said, wait a minute. That's not a good deal compared to the other deal, they took over Iraq. We gave them Iraq. We knocked the hell out of Iraq. We decimated their armed forces. And you know for years, they would fight. For many, many years, for decades, they'd fight, fight, fight.","Nobody would win. Fight. They've rest and they go back to fight. They were the same. And now, we gave them the second largest oil reserves in the world, which is Iraq. We gave it to him. Now, they're going into Yemen. And if you look at Yemen, take a look, they're gonna get Syria. They're gonna get Yemen.","Unless you know -- trust me a lot of good things are gonna happen if I get in. But let's just sort of leave it the way it is. They get Syria. They get Yemen. Now they didn't want Yemen. But you ever see the border between Yemen and Saudi Arabia? They want Saudi Arabia. So what are they gonna have? They're gonna have Iraq.","They gonna can have Iran. They're gonna have Iraq. They're gonna have Yemen. They're gonna have Syria. They're gonna have everything. They're gonna be a monster. We've created this with stupid leadership, really stupid leadership. So when I started I said, we have to do something about it. It's not something I wanted to do. It's something we have to do because we're gonna make -- I'm representing you.","I'm not taking any money. I'm not -- you know like some of these guys where they're getting millions and millions of dollars from people I know. And they're nice people and some are very bad people. But they have no interest in the country. They have interest in their company or they have interest in countries that they're representing.","And these people and these politicians are gonna do exactly as they're told by their lobbyists and their special interests and their donors. Me? I'm gonna do the right thing. And I always tell the story. When Ford moves to Mexico, I'm gonna talk him out of it. When Nabisco moves its plant from Chicago to Mexico, I'm gonna talk him out of it. Believe me. It's gonna be easy.","It's gonna be easy. So I started and I talked about the border, very strong on immigration and illegal immigration, took a lot of heat. But you wouldn't even be talking about that subject if I didn't bring it up, and I talked about -- again, I talked about ISIS. I talked about -- but what really happened is after Paris, we had 130 people killed.","And by the way, I told you Common Core is dead. And Second Amendment is right this way. We're gonna protect the Second Amendment. We're gonna protect the guns. We're gonna protect your guns. You know, if in Paris and if in Los Angeles, where you had the two maniacs that were married. She came on a fiancee permit.","Fiancee, you know, wonderful fiancee. She was totally radicalized, maybe radicalized him. Maybe he was already that way. But we got to -- I think we have to start using our head. Bad stuff is happening. We have to find out what's going on. We have a president who won't even talk about the term. If you think, he won't even mention anything to do with what we all know is going on and you can't solve the problem.","If you don't talk about it. You have to talk about it. So very, very strongly we started talking about that. And then after Paris -- and by the way, if we had a couple of you and you and you, we had three or four people in that room in Paris, as an example, where they have the toughest gun laws like in the world.","You can't have a gun. Unless you're a bad guy, you point a gun. And they walked in and just said, boom, boom, boom. You, move over. Boom. Killed 130 more to follow because there are people that are so badly wounded. But if we had a couple a few of the people I pointed out I could pick plenty and this audience, believe me. But if they had guns on their waist, if they had guns around their ankle, where the bullets went the opposite direction, it would have been a whole different story, folks.","Be a whole different story. So very very big on Second Amendment. But what happened is, all of a sudden, after Paris and then to an extent, into a pretty big extent, Los Angeles too, you know in California. What happened is these polls started coming in where everybody like Trump even more. I went up 11 points.","I don't want to do it for that reason, but it went up because people want strength just like having the family of John Wayne, who is great. I love John Wayne from Iowa. But out of nowhere I got the most beautiful letter from his daughter who you just met who is an incredible woman. And she said, we'd like to endorse you.","John Wayne was a strong guy. We need strength. We need strength in this country because we're withering away with political correctness nonsense, OK? Nonsense. I mean, if you think of it, you can't say Merry Christmas anymore. We're gonna say Merry Christmas again. You go to these department stores, they don't have any Christmas displays.","They don't have the signs: Merry Christmas. Even people that aren't Christian are saying Merry Christmas. We love Christmas. Let us say Merry Christmas. Happy holidays. But people like to see it. And stores don't put it up anymore. We're withering away. We're going in the wrong direction. So I said, we're gonna do this.","And I had no idea it was gonna work this. I figured I'd be in the pack and maybe like a racehorse you know, just at the end you can sort of inch it out. I had no idea that I have 21 point. Nationally, we're up by so much. And you know I want to keep it that way. I want to keep it that way. When you think and just one thing before I introduce our incredible person, our incredible guest.","But one thing, I've spent to this point almost nothing. And I'm in first place by a lot. I tell the story. I'm not bragging about spend. I'm just saying I'm telling a story. I have spent -- they'll tell you almost nothing and I'm in first place by -- some polls have me 21 points. That's a lot. OK? There are some people I have two.","I have a lead of 20, but I'm in first place by a lot. Jeb has spent now $77 million. Think of it. And you know the reason I bring him up, I wouldn't even bring him up, but he spends a fortune on ads against me. You people have all seen it before. I got along with everybody. I contributed. I was a world-class businessman.","Now, I'm a politician, which I hate to tell you. But you go with everybody. You want to love everybody. You want them all to love you unless you're stupid. But you want everybody to love you. Everybody knows the story. But so much money has been spent on me. But he spent $79 million. I spent nothing. I'm in first by a lot.","He's down on like two at the bottom of the pack. And I said to myself, it's amazing. Wouldn't that be great if this were the country doing this? As an example, education. We're number 28 in the world. We have third-world countries that are ahead of us. Education is very important to me. 28 in the world. World.","I mean countries that you wouldn't believe are ahead of us. You wouldn't believe it if you heard the names of some of these countries. So we're 28, but we're number one in spending per pupil, by far. Wouldn't it be nice if you had like this election process where we spent the least that we had the best education.","You know? So Sweden and Norway and China and others are the best. We're nowhere near them and yet, we spend far more per pupil. So we're gonna change it. And I told you we're gonna get it localized but we're gonna change that. Watch. You just watch. How? I could tell you we are -- and I just -- I will tell you this.","You can't educate your children through bureaucrats in Washington, and that's what happens with Common Core. When the parents take over, when the parents take over and I really mean this because I've seen it. When the parents around those schools and they love those kids and they love those pupils and even when their kids graduate, they are committed to those schools.","They're committed to education. You can do so much better in Iowa than they can possibly do telling you what to do in Washington. And not all of them but most of them are just interested in where's my check. How much do I get. Let's make the process complicated. And some of the things that your kids are made to study are an outrage, OK? So we're gonna bring that back locally and it's gonna be great.","OK. So what happened essentially is I started looking and all of a sudden, things changed. And people are now looking. They know I'll do great with China. I'm gonna do great with Japan. I'm gonna do great with Mexico, who's killing us in trade and killing us also at the border. We will build a wall. And you know who's gonna pay for the wall.","Mexico. They're gonna pay for it because they make a fortune. And all of those things. But now, we're really focused on security and I'm honored because I will tell you that all of the polls and the CNN polls in particular, where they said, Trump is just not by a little bit by many, many, many percentage points winning on ISIS, winning on the military, winning with the vets.","We're gonna take care of our vets, big league, by the way. Big league. Big league. And we're gonna really take care of our military. It's going to be big and strong and powerful and nobody is gonna mess with us. It's the cheapest thing we can do. I can tell you that right now. So it's been a real focus. I just want to now say just a couple of words about a very special person.","This is a person who I've known for a long time, who I've respected for so long. An incredible husband, an incredible family and somebody that when I heard that she was going to endorse me, I was so honored. You have no idea how honored.","And I would like to bring up, if I might, Governor Sarah Palin, special, special person. Thank you.","We're gonna give him hell. I just want to thank Sarah and Todd. Just really amazing people. This is a woman that from day one I said, if I ever do this, I have to get her support. She feels it. She understands it better than anybody. And Sarah, on behalf of myself, my family and the country, I want to thank you very much. Thank you, darling. Thank you."],"text":" Wow. What a crowd. Thank you very much, everybody. Such an honor. With the snow coming down and it's a little cold outside and you have hundreds of people still outside trying to get in, but you know, we won't wait. We'll go ahead, right? Huh? We'll go ahead. First of all, congratulations to the Iowa State basketball team. You had -- what was that all about? I turned on the game. I said, wow, this shouldn't be that good a game. And then at the end of the game, I said, who won? Yes? That was great. That was great and that's a great achievement. I want to also pay my respects. Ben Carson they had a really bad accident. Some of his staffers were hurt pretty bad. So I just want to pay my respects to Ben. He's a good guy, a really good guy and his staffers. And hopefully, they get better. Say a prayer for him, OK? We've had an amazing time today. We've been all over Iowa and we're gonna be here tomorrow. We're gonna be here so much. You're gonna get so sick of me. You're gonna say, please, tell him to get out of here. Tell him to leave. Tell him to go, but we've had an incredible time. And you know, it started really we've had really a pretty good week. The debate last week, everybody watched the debate. And who knew about these debates? I didn't know anything about the debates. And it's been, it's been fun and it's been interesting. And I've been treated semi fairly by the moderators, not 100%. Some have been very fair actually and some have been not so fair. But, you know, a lot of the press hasn't been very fair. Well, look at all the press back there. They must think there's a big event gonna happen today. Wow. That's a lot of -- this is like the Academy Awards. But we've had an amazing -- it's been an amazing experience. And it started really on June 16th when we came down the escalator. We came down that escalator and it was -- I said let's go to my wife, who's been so supportive and so wonderful. I said let's go. We're gonna make America great again. That's what we're going to do. And you know, it was -- it's hard to do this because when you think of it, I've never done it before. I've never been a politician. Thank goodness. But I've never been a -- I've always done jobs and put a lot of people to work. Tens of thousands of people over the years. And you know, I have thousands of Hispanics that love me. The Nevada polls just came out where I'm leading with Hispanics, which I knew, I knew. And we came out and at that particular opening, when I opened and said I'm gonna run for president. I gave up a lot, you know, gave up a lot of different things, including telling our friends at NBC no more Apprentice. That's hard to do. You have a top show. When you say, I'm not doing it anymore. I'm sorry. They wanted to do it so badly. And Steve Berke, who is a fantastic executive, came up to my office and he said, come on, Donald. Come on do it. You're not gonna run. Do it. Do it. I said, Steve, I'm gonna run. I was pretty sure. You know, that was about two months before. I was pretty sure. It really is a tough thing to do. You know, all my life I've heard if you're a very successful person, you'll never run for president. You'll never really run for politics, but you'll never ever run for president. And I built a great company and it's a tremendous numbers. You saw the filings and the press was gonna look so closely that it was like -- it was like D-Day when we put those papers in. You know, first thing I did, I announced. They said, oh, he's actually gonna do it because most of them said he'll never do it. Then I signed -- when I signed Form A it's -- that's when you sign your life away. And I signed that. They said, whoa, he signed that. Well, he'll never file the financials because maybe he's not as rich as everybody thinks. And I filed the financials and they saw an unbelievable -- you didn't hear a thing about it. Oh boy, were they looking. I mean, were they looking. And almost 100 pages, the biggest report ever filed with the FEC in terms of that and it showed a company that's a phenomenal company, of some of the great assets, very little debt, tremendous cash flow. You know, the way it's supposed to be and it was -- it's great. And the reason I tell you that is because that is the kind of thinking we need now in the United States. We need that kind of thinking. We need that whatever it is. We need a mentality that's gonna -- you know, we're at $19 trillion in debt. It's gonna be up to $21 trillion. You saw that horrible budget, horrible, horrible budget that was approved two weeks ago and that's gonna lift it. And so we went along and a lot of things have happened and then the polls came out, which I love. And new ones came out today, by the way, I'll tell you right now. You know, and now that we're at it. And they came out, some brand new ones, some beauties and ones coming out, I guess, a big one is coming out. I don't know exactly what it is. But it's got to be pretty good because I see the response. I mean even this, with all the people still trying to come in to this building. Somebody said it's a barn. This is a very nice barn actually. But with all of the people still trying to come in, you see what it is and we do have something special in a couple of minutes really. To me, it's really special because it's a person that I think is a spectacular person. So it's very special to me. But then the polls came out and some of them, as an example, National polls: 38% for Trump; 20% for second. I wouldn't even mention names, right? All right. I won't even mention. I'm gonna be non confrontational today for a change. 21% for the second; 11% and then they're all down and some of them are actually like 0 and 1%. I don't know. Jeb? You know, Jeb has got one problem. He loves Common Core. Meaning he wants your kids educated from Washington, which is immediately no good. And his second problem is he's very, you know, very weak on illegal immigration. Remember he said they come as an act of love. I said what? They come as an act of love. So I think those are two very bad points, frankly. But you -- Thank you. USA. USA. USA. USA. USA. Thank you. Thank you, everybody. Thank you. Thank you very much. So we had we had another one, a big one come out. Go ahead. You can get him out please. Yeah, you can take him out now please. Never fails. Thank you. Thank you, darling. Maybe you could be quiet a little bit while they take you out. You know, I have to be careful. If I'm too rough, they say he was too rough. Then when I'm moderate and nice, they were saying what happened to Trump. He's not tough enough. So you can't win with these people. The one good thing is they always show the crowd. That's the only way they show how big our crowds are. So all right, get him out. Get him out of here. All right. So South Carolina just came out and that's 32 for Trump; 18 for second; 11 for third. Great. Florida leading by a lot: 31, 19, 13 and then all down in the dumps. Georgia you just came out, I have 33%. Yeah, don't forget that 33%. It's hard to believe that's with 14 people, 15 people. I don't know when they took it, but it was recent. 33%. Connecticut. Now Tom Brady loves me and that's sort of like, you know. And I love Tom Brady, by the way. 35% to 18% to 9% to 2% to nothing. Maryland just came out. Maryland great place. 32% to 15% to 11% to 9% and then you know they sort of phase out. You ever hear of a place called Iowa? Oh, I love this. We're doing actually great. First off, I have to tell you, you know, they never reported. Even CNN doesn't report it. CNN does a poll, probably spend millions. They never report their poll. The CNN poll was 33 for Trump, 20 for Cruz. Nobody talks about it. Nobody talks. They don't talk. They talk about CNN is reporting other people's polls. So I call up. I said, wait a minute, you're CNN, you spent a fortune on polls and you don't report your own poll because I'm winning by a lot. And they have no excuse but they keep reporting other polls. But we're doing well. I think we're doing a lot better than anyone knows. Gravis just came out: 34 for Trump, 28 for Cruz. PPP: 28 for Trump, 26 for Cruz. In other words, it's a little close here. Quinnipiac poll, very respected, 31 for Trump, 29 for Cruz. And then again CNN, 33 to 20. So we're -- I think we're doing good. I think we're actually doing better in the polls. Now, I could do this. I could say, well, I just want to do well in Iowa. I want to win Iowa, folks. Because look, I love the people. The evangelicals have been phenomenal. I'm doing great with the evangelicals. But nationwide, I'm winning with evangelicals. I don't know if you that by a lot, nationwide. With Iowa, I'm doing really well with the evangelicals. We're doing really well with the Tea Party. We're doing well. I mean, you hear the numbers, I mean these are the numbers. But I actually think we're doing even better than the polls. And you know there's the thing that a lot of people said. Well, you know, they call up. Are you gonna vote for Trump? He's got very, very tough immigration policies. He wants to destroy Obamacare and replace it with something a lot better. I'm gonna do tough, OK? But you know, and a lot of people that pick up a phone and they'll hear different things. And they'll say, no, I'll vote for -- and then they get in the booth. They'll say, Trump is my man. There are a lot of people saying that we're gonna do a lot better. Well, we'll see. Because February 1st, you have to get to caucus, you have to go out. You got to do it. It's so -- Otherwise, we've all wasted our time. You know, one of the groups in Maine and it was like incredible. We were in different places up in New England recently and New Hampshire was amazing. And the people are standing. It was so cold. It was one little group of -- despite global warming, you know you hear all of that. It was so cold. It was windchill below zero. And people are standing outside for hours trying to get in. And then you hear the announcers, well, will they show up to vote? And I don't know much but I say like if people are to stand out for four hours in the cold or the heat because believe me they stood out in heat during the summer and during the fall like you wouldn't believe. In Tennessee, in Texas, we have 21,000 people. No matter where we go, we have these big crowds. But they'll stand for hours and hours to get in. Why aren't they gonna go and vote or in your case, caucus? Why are they gonna go and vote? It's sort of an amazing thing. So we think they're gonna really be -- why would somebody wait four hours, for four hours and then we're not gonna take two minutes to vote? Boom. Now, yours is a little more complicated because the caucus system is a little bit different. It's very, very interesting system but it is different. Here's what I have to say about Iowa. It's very important. So you know, there's a movement to move Iowa to the back of the pack, OK? You know that. You'll still see me, but you won't see other people. Believe me. I'm loyal. To a fault, I'm loyal. But you're gonna see. I give you my word. I win. They're not touching Iowa. This is an amazing tradition. No, seriously. This is an amazing tradition. They're not moving Iowa. They're not -- and they're not moving New Hampshire either because they're talking about Iowa and New Hampshire. They're not touching New Hampshire. So we're gonna just keep it the way it is. It really is. It's an amazing -- first of all, you're amazing people. But all over the country, it's a movement, all over the country. The people are incredible. They want to make America great again. They're gonna do something that's special. And you know, we used to talk silent majority. I say it's the noisy majority because it's actually a noisy majority. It's not a silent majority. But people are fed up. So I started on June 16th and we did well right practically from the beginning. We went up. And if you remember, we started at nothing. We started at nothing because nobody believed I was gonna vote. So even when they -- my wife said, you know if you run, you're going to win. I said, what do you mean? People don't believe you're gonna run. So the polls -- you know because I was getting these little polls, I felt like some of these guys now that the Senators and Governors they get these little polls -- it's getting these... They can't get this guy. He goes Jeb again, right? Boy, he's getting -- he's taken a lot of abuse, you know? I told him. I said, you know what, you should use the name Bush. What's wrong? Use the name Bush. I mean, maybe it's not working. But it's better than Jeb, right? You know, I really do. Get rid of the exclamation point. I just put Jeb Bush. That's your name. Don't be ashamed of your name. So anyway. So anyway. So I hope -- you know, I wish him the best. But you know, I sort of -- so I started and I started at like two or three. And then it went to six and then went to nine. And each time the pundits, these real geniuses back here, some of them are sitting back there. These real geniuses, like George Will, with a little glasses. Take away the glasses, he looks like a dumb guy. I'm telling you. But each time these geniuses would say, well, he's reached his plateau. He's plateaued at six, right? Then it goes to eleven. Well, you know, this is surprising but he's reached his plateau. And then it goes to 18. Then it went to 22, 24, 28. Then it went to 32. Then it went actually to 42 in the Gravis poll. And in Reuters, we get to 42 and even a little above that. And all of a sudden, you didn't hear so much about the plateau. I want to plateau at 42. You know, 42 with like 14 people. That's pretty good. But they kept saying he plateaued. That's all he'll get. He's got these followers. We have the smartest followers there are, number one. We have the smartest and the hardest working followers. We have people that love the country more than anybody, and they want to take back what's happened because our country is gonna hell. We can be nice about it. We can say it nice and soft. Our country is going to hell. When you look at this crazy Iran deal where we're paying $150 billion and they give us five back, but they don't know where the fifth is. And you understand what that means, that's not a good sign. But they give us five people, but they get seven and they get 14 off the Interpol list. These are bad dudes. They get 14 plus seven, so they're getting 21 people and they have the right to do whatever they want from an enterprise standpoint, right to do oil, right to do whatever they want. But why do they also get out of that deal? First of all, they're gonna get nuclear. They don't have to develop missiles. They can buy them. For the kind of money we gave, they're gonna buy them. Why are they gonna develop? Remember the deal? 24 days, they have 24 days for inspection period. They also have self inspection, right? But we paid $150 billion. And I was saying, wow, what a great -- the Persians are great negotiators. I say what a great deal that is. And then I said -- two weeks ago I started. I said, wait a minute. That's not a good deal compared to the other deal, they took over Iraq. We gave them Iraq. We knocked the hell out of Iraq. We decimated their armed forces. And you know for years, they would fight. For many, many years, for decades, they'd fight, fight, fight. Nobody would win. Fight. They've rest and they go back to fight. They were the same. And now, we gave them the second largest oil reserves in the world, which is Iraq. We gave it to him. Now, they're going into Yemen. And if you look at Yemen, take a look, they're gonna get Syria. They're gonna get Yemen. Unless you know -- trust me a lot of good things are gonna happen if I get in. But let's just sort of leave it the way it is. They get Syria. They get Yemen. Now they didn't want Yemen. But you ever see the border between Yemen and Saudi Arabia? They want Saudi Arabia. So what are they gonna have? They're gonna have Iraq. They gonna can have Iran. They're gonna have Iraq. They're gonna have Yemen. They're gonna have Syria. They're gonna have everything. They're gonna be a monster. We've created this with stupid leadership, really stupid leadership. So when I started I said, we have to do something about it. It's not something I wanted to do. It's something we have to do because we're gonna make -- I'm representing you. I'm not taking any money. I'm not -- you know like some of these guys where they're getting millions and millions of dollars from people I know. And they're nice people and some are very bad people. But they have no interest in the country. They have interest in their company or they have interest in countries that they're representing. And these people and these politicians are gonna do exactly as they're told by their lobbyists and their special interests and their donors. Me? I'm gonna do the right thing. And I always tell the story. When Ford moves to Mexico, I'm gonna talk him out of it. When Nabisco moves its plant from Chicago to Mexico, I'm gonna talk him out of it. Believe me. It's gonna be easy. It's gonna be easy. So I started and I talked about the border, very strong on immigration and illegal immigration, took a lot of heat. But you wouldn't even be talking about that subject if I didn't bring it up, and I talked about -- again, I talked about ISIS. I talked about -- but what really happened is after Paris, we had 130 people killed. And by the way, I told you Common Core is dead. And Second Amendment is right this way. We're gonna protect the Second Amendment. We're gonna protect the guns. We're gonna protect your guns. You know, if in Paris and if in Los Angeles, where you had the two maniacs that were married. She came on a fiancee permit. Fiancee, you know, wonderful fiancee. She was totally radicalized, maybe radicalized him. Maybe he was already that way. But we got to -- I think we have to start using our head. Bad stuff is happening. We have to find out what's going on. We have a president who won't even talk about the term. If you think, he won't even mention anything to do with what we all know is going on and you can't solve the problem. If you don't talk about it. You have to talk about it. So very, very strongly we started talking about that. And then after Paris -- and by the way, if we had a couple of you and you and you, we had three or four people in that room in Paris, as an example, where they have the toughest gun laws like in the world. You can't have a gun. Unless you're a bad guy, you point a gun. And they walked in and just said, boom, boom, boom. You, move over. Boom. Killed 130 more to follow because there are people that are so badly wounded. But if we had a couple a few of the people I pointed out I could pick plenty and this audience, believe me. But if they had guns on their waist, if they had guns around their ankle, where the bullets went the opposite direction, it would have been a whole different story, folks. Be a whole different story. So very very big on Second Amendment. But what happened is, all of a sudden, after Paris and then to an extent, into a pretty big extent, Los Angeles too, you know in California. What happened is these polls started coming in where everybody like Trump even more. I went up 11 points. I don't want to do it for that reason, but it went up because people want strength just like having the family of John Wayne, who is great. I love John Wayne from Iowa. But out of nowhere I got the most beautiful letter from his daughter who you just met who is an incredible woman. And she said, we'd like to endorse you. John Wayne was a strong guy. We need strength. We need strength in this country because we're withering away with political correctness nonsense, OK? Nonsense. I mean, if you think of it, you can't say Merry Christmas anymore. We're gonna say Merry Christmas again. You go to these department stores, they don't have any Christmas displays. They don't have the signs: Merry Christmas. Even people that aren't Christian are saying Merry Christmas. We love Christmas. Let us say Merry Christmas. Happy holidays. But people like to see it. And stores don't put it up anymore. We're withering away. We're going in the wrong direction. So I said, we're gonna do this. And I had no idea it was gonna work this. I figured I'd be in the pack and maybe like a racehorse you know, just at the end you can sort of inch it out. I had no idea that I have 21 point. Nationally, we're up by so much. And you know I want to keep it that way. I want to keep it that way. When you think and just one thing before I introduce our incredible person, our incredible guest. But one thing, I've spent to this point almost nothing. And I'm in first place by a lot. I tell the story. I'm not bragging about spend. I'm just saying I'm telling a story. I have spent -- they'll tell you almost nothing and I'm in first place by -- some polls have me 21 points. That's a lot. OK? There are some people I have two. I have a lead of 20, but I'm in first place by a lot. Jeb has spent now $77 million. Think of it. And you know the reason I bring him up, I wouldn't even bring him up, but he spends a fortune on ads against me. You people have all seen it before. I got along with everybody. I contributed. I was a world-class businessman. Now, I'm a politician, which I hate to tell you. But you go with everybody. You want to love everybody. You want them all to love you unless you're stupid. But you want everybody to love you. Everybody knows the story. But so much money has been spent on me. But he spent $79 million. I spent nothing. I'm in first by a lot. He's down on like two at the bottom of the pack. And I said to myself, it's amazing. Wouldn't that be great if this were the country doing this? As an example, education. We're number 28 in the world. We have third-world countries that are ahead of us. Education is very important to me. 28 in the world. World. I mean countries that you wouldn't believe are ahead of us. You wouldn't believe it if you heard the names of some of these countries. So we're 28, but we're number one in spending per pupil, by far. Wouldn't it be nice if you had like this election process where we spent the least that we had the best education. You know? So Sweden and Norway and China and others are the best. We're nowhere near them and yet, we spend far more per pupil. So we're gonna change it. And I told you we're gonna get it localized but we're gonna change that. Watch. You just watch. How? I could tell you we are -- and I just -- I will tell you this. You can't educate your children through bureaucrats in Washington, and that's what happens with Common Core. When the parents take over, when the parents take over and I really mean this because I've seen it. When the parents around those schools and they love those kids and they love those pupils and even when their kids graduate, they are committed to those schools. They're committed to education. You can do so much better in Iowa than they can possibly do telling you what to do in Washington. And not all of them but most of them are just interested in where's my check. How much do I get. Let's make the process complicated. And some of the things that your kids are made to study are an outrage, OK? So we're gonna bring that back locally and it's gonna be great. OK. So what happened essentially is I started looking and all of a sudden, things changed. And people are now looking. They know I'll do great with China. I'm gonna do great with Japan. I'm gonna do great with Mexico, who's killing us in trade and killing us also at the border. We will build a wall. And you know who's gonna pay for the wall. Mexico. They're gonna pay for it because they make a fortune. And all of those things. But now, we're really focused on security and I'm honored because I will tell you that all of the polls and the CNN polls in particular, where they said, Trump is just not by a little bit by many, many, many percentage points winning on ISIS, winning on the military, winning with the vets. We're gonna take care of our vets, big league, by the way. Big league. Big league. And we're gonna really take care of our military. It's going to be big and strong and powerful and nobody is gonna mess with us. It's the cheapest thing we can do. I can tell you that right now. So it's been a real focus. I just want to now say just a couple of words about a very special person. This is a person who I've known for a long time, who I've respected for so long. An incredible husband, an incredible family and somebody that when I heard that she was going to endorse me, I was so honored. You have no idea how honored. And I would like to bring up, if I might, Governor Sarah Palin, special, special person. Thank you. Thank you so much. It's so great to be in Iowa. We're here just thawing out. Todd Nye and a couple of our friends here from Alaska lending our support for the next president of our great United States of America Donald J. Trump. Mr. Trump, you're right. Look back, they're in the press box. Heads are spinning. Media heads are spinning. This is gonna be so much fun. Are you ready to make America great again? We all have a part in this. We all have a responsibility. Look around it, all of you, you are hard working Iowa families, you farm families and teachers and teamsters and cops and cooks. You rock and rollers and holy rollers. All of you who have worked so hard. You full-time moms. You with the hands that rock the cradle. You all make the world go round. And now, our cause is one. When asked, why I would jump in into a primary, trying to stir it up a little bit maybe. And choose one over some friends who are running and I've endorsed a couple others in their races before they just I was told, you know, warn left and right. You are gonna get so clobbered in the press. You are just gonna get beat up and chewed up and spit out and you know, I'm thinking. And yeah -- you guys haven't tried to do that every day since that night in 08. When I was on stage nominated for V.P. and I got to say, yeah. I'll go, send me. You betcha. I'll serve. And like you all I'm still standing. So those of us who've kind of gone through the ringer as Mr. Trump has makes me respect you even more that you're here and you're putting your efforts and you're putting reputations. You're putting relationships on the line to do the right thing for this country because you are ready to make America great again. Well, I am here because like you I know that it is now or never. I'm in it to win it because we believe in America and we love our freedom. And if you love your freedom, think a vet. Think a vet and know that the United States military deserves a commander in chief, who loves our country passionately and will never apologize for this country. A new commander in chief who will never leave our men behind. A new commander in chief, one who will never lie to the families of the fallen. I'm in it because just last week we're watching our sailors suffer and be humiliated on a world stage at the hands of Iranian captors in violation of international law. Because a weak need capitulator in chief has decided that America will lead from behind. And he who would negotiate deals kind of like with the skills of a community organizer maybe organizing a neighborhood tea. Yeah. Well, he deciding that no American would apologize. And as part of the deal, as the enemy sends a message to the rest of the world that they capture and we kowtow and we apologize and then we bend over and say, thank you, enemy. We are ready for a change. We are ready and our troops deserve the best. A new commander in chief, who's track record of success has proven he is the master at the art of the deal. He is one who would know to negotiate. Only one candidate's record of success proves he is the master of the art of the deal. He is beholden to no one but we, the people. How refreshing. He is perfectly positioned to let you make America great again. Are you ready for that, Iowa? No more pussyfooting around. Our troops deserve the best. You deserve the best. He's from the private sector. Not a politician. Can I get a hallelujah? We're in the private sector. You actually have to balance budgets in order to prioritize, to keep the main thing the main thing and he knows the main thing. A president is to keep us safe economically and militarily. He knows the main thing and he knows how to lead the charge. So troops hang in there because help's on the way because he, better than anyone, isn't he known for being able to command fire. Are you ready for a commander in chief? You ready for a commander in chief who will let our warriors do their job and go, kick ISIS ass. Ready for someone who will secure our borders, to secure our jobs and to secure our homes? Ready to make America great again. Are you ready to stump for Trump? I'm here to support the next president of the United States Donald Trump. Now, eight years ago, I warned that Obama's promised fundamental transformation of America that it was gonna take more from you and leave America weaker on the world stage. And that we would soon be unrecognizable. Well, it's the one promise that Obama kept. But he didn't do it alone. And this is important to remember, especially those of you like me, a member of the GOP. This is what we have to remember in this very contested, competitive, great primary race. Trump's candidacy, it has exposed not just that tragic, the ramifications of that betrayal of a transformation of our country. But two, he has exposed that complicity on both sides of the aisle that has enabled it. OK? Trump -- what he's been able to do, which is really ticking people off, which I'm glad about. He's going rogue left and right, man. That's why he's doing so well. He's been able to tear the veil off this idea of the system. The way that the system really works and please hear me on this. I want you guys to understand more and more how the system, the establishment works. And has gotten us into the troubles that we are in, in America. The permanent political class has been doing the bidding of their campaign donor class and that's why you see that the borders are kept open for them, for their cheap labor that they want to come in. That's why they've been bloating budgets. It's for crony capitalists to be able to suck off of them. It's why we see these lousy trade deals that gut our industry for special interests elsewhere. We need someone new who has the power and is in the position to bust up that establishment, to make things great again. It's part of the problem. His candidacy, which is a movement. It's a force. It's a strategy. It proves as long as the politicos they get to keep their titles and their perks and their media ratings, they don't really care who wins elections. Believe me on this. And the proof of this, look what's happening today. Our own GOP machine, the establishment, they who would assemble the political landscape. They're attacking their own front runner. Now with the left ever -- will the DNC ever come after their front runner and her supporters? No. Because they don't eat their own. They don't self-destruct. But for the GOP establishment to be coming after Donald Trump's supporters even with accusations that are so false. They are so busted the way that this thing works. We, you, a diverse dynamic needed support base that they would attack. And now, some of them even whispering they're ready to throw in for Hillary over Trump because they can't afford to see the status quo go. Otherwise, they won't be able to be slurping off the gravy train that's been feeding them all these years. They don't want that to end. Well, and then funny, haha. Not funny. But now what they're doing is wailing. Well, Trump and his his trumpeters well they're not conservative enough. Oh my goodness gracious. What the heck would the establishment know about conservatism. Tell me is this conservative? GOP majorities handing Obama a blank check to fund Obamacare and planned parenthood and illegal immigration that competes for your jobs and turn in safety nets into hammocks. And all these new Democrat voters that are gonna be coming on over the border as we keep the borders open and bequeathing our children millions in new debt and refusing to fight back for our solvency and our sovereignty. Even though that's why we elected him and sent him as a majority to D.C. No. If they're not willing to do that then how are they to tell us that we're not conservative enough in order to be able to make these changes in America that we know, need to be. Now, they're concerned about this ideological purity. Give me a break. Who are they to say that? Oh and tell somebody like Phyllis Schlafly. She is the Republican conservative movement icon and hero and a Trump supporter. Tell her she's not conservative. How about the rest of us, right wing and bitter clinging, proud clingers of our guns, our gutter and our religions and our constitution. Tell us that we're not red enough. Yeah. Coming from the establishment. Right. Well. He, being the only one, who's been willing. He's got the guts to wear the issues that need to be spoken about and debated on his sleeve. Were the rest of some of these establishment candidates they just wanted to duck and hide. They didn't want to talk about these issues till he brought them up. In fact, they've been wearing this political correctness kind of like a suicide vest. And enough is enough. These issues that Donald Trump talks about had to be debated and he brought them to the forefront. And that's why we are where we are today, with good discussion, a good heated and very competitive primaries where we are. And now though, to be lectured that well, you guys are all sound and kind of angry is what we're hearing from the establishment. Doug on right. We're angry. Justifiably so. Yes. You know, they stomp on our neck and then they tell us, just chill. OK. Just -- yeah, just relax. Well, look, we are mad and we've been had. They need to get used to it. This election is more than just your basic ABC's, anybody but Clinton. It's more than that this go around. When we're talking about a nation without borders, when we're talking about a bankruptcies in our federal government, debt that our children and our grandchildren and they'll never be able to pay off. When we're talking about no more Reagan-esque power that comes from strength, power through strength. Well, then we're talking about our very existence. So no we're not gonna chill. In fact, it's time to drill. Baby drill down. And hold these folks accountable. And we need to stop the self sabotage and elect new and independent, a candidate who represents that and represents America first. Finally, pro Constitution, commonsense, solutions that he brings to the table. Yes, the status quo has got to go. Otherwise, we're just gonna get more of the same. And with their failed agenda, it can't be salvaged. It must be salvaged. And Donald Trump is the right one to do that. Are you ready for new and are you ready for the leader who will let you make America great again? It's gonna take a whole team. It's gonna take a whole team. Fighters. All of us in the private sector, fighters in the House and the Senate. So our friends who are fighters in the house, in the Senate today. They need to stay there and help out. They can help our new leader in the positions that they are in. Let me say something really positive about one of those individuals. Rand Paul. I'm gonna tell you about that libertarian streak in him that is healthy because he knows you only go to war, if you're determined to win the war. And you quit footing the bill for these nations who are oil-rich we're paying for some of their skirmishes that have been going on for centuries where they're fighting each other and yelling all the bar, calling jihad on each other's heads forever and ever. Like I've said before, let them do get out and let us sort it out. We'll fight for American interests. And as Donald Trump has said, the other nations where we have been footing the bill, but we haven't prioritized our own domestic budgets well enough to be able to afford what we're doing overseas. Things are gonna change under President Trump. So we can be an unbeatable team with fighters there in the House and the Senate. Yeah, our leader, he's a little bit different. He's a multibillionaire. Not that there's anything wrong with that, but it's amazing. He is not elitist at all. Oh, I just hope you all get to know him more and more as a person and a family man. And what he's been able to accomplish and with his -- it's kind of this quite generosity. Yeah, maybe his largesse kind of -- I don't know. Some would say gets in the way of that quiet generosity and and his compassion. But if you know him as a person and you'll get to know him more and more, you'll have even more respect, not just for his record of success and the good intentions for America, but who he is as a person. He's not an elitist. And yes, as a multibillionaire, we still root him on because he roots us on. And he has -- He's spent his life with the working man and he tells us Joe Six-Pack. He said, you know I worked very very hard and I've succeeded, hugely I've succeeded, he says. And he says, and I want you to succeed too. And that is refreshing. Because he, as he builds things, he builds big things. Things that touch the sky, big infrastructure that puts other people to work. He has spent his life looking up and respecting the hardhats and the steel toed boots and the work ethic that you all have within you. He being an optimist passionate about equal opportunity to work. This self-made success of his. You know that he doesn't get his power, his high off of opium, other people's money. Like a lot of dopes in Washington do. They're addicted to opium where they take other people's money and then their high is getting to redistribute it, right? And then they get to be really popular people when they get to give out your hard earned money. Well, he doesn't do that. His power, his passion is the fabric of America and it's woven by work ethic and dreams and drive and faith in the Almighty. What a combination. Are you ready to share in that again Iowa? Because that's what's gonna let you make America great again. He's gonna be able to empower you to look out for one another again instead of relying on a bankrupt government. To supposedly be looking out for you know. NO, and I think you're ready for that. And Iowa, I believe too that you're ready to see that our vets are treated better than illegal immigrants are treated in this country. And you are ready for the tax reform he talks about to open up Main Street again. And you're ready to stop the race baiting and the division based on color and zip code, to unify around the right issues. The issues important to me or I wouldn't be endorsing him. Pro-life, pro Second Amendment, Strict Constitutionality. Those things that are unifying values and their time tested truth involved. These are unifying values from big cities and tiny towns from big mountain states and the Big Apple to the big beautiful heartland that's in between. Now finally, friends, I want you to try to picture this. It's a nice thing to picture exactly one year from tomorrow. Former President Barack Obama, he packs up the teleprompters and the selfie sticks and the Greek columns and all that hope change-y stuff and he heads on back to Chicago, where I'm sure he can find some community there to organize again. There, he can finally look up. President Obama will be able to look up and there over his head. He'll be able to see that shining towering Trump Tower. Yes, Barack. He built that and that says a lot. Iowa, you say a lot being here tonight supporting the right man who will allow you to make America great again. God bless you. God bless the United States of America, and our next president of the United States, Donald J. Trump. We're gonna give him hell. I just want to thank Sarah and Todd. Just really amazing people. This is a woman that from day one I said, if I ever do this, I have to get her support. She feels it. She understands it better than anybody. And Sarah, on behalf of myself, my family and the country, I want to thank you very much. Thank you, darling. Thank you."}