{"id":471,"author":"Donald Trump","title":"Speech: Donald Trump in Altoona, IA","date":"2016-01-19","link":"https://factba.se/transcript/donald-trump-speech-altoona-ia-january-19-2016","paragraphs":["I was a very nice introduction. I - I was a very nice introduction. I - I was a very nice introduction. I appreciate it very much. It's so much fun, appreciate it very much. It's so much fun, appreciate it very much. It's so much fun and so interesting and I know the - and so interesting and I know the - and so interesting and I know the governor just made a very big statement, governor just made a very big statement.","Governor just made a very big statement that was appreciated by many and that that was appreciated by many and that, that was appreciated by many. And that was amazing actually. And he's a - was amazing actually and he's a - was amazing actually and he's a respected man. And when he speaks people respected man and when he speaks people respected man and when he speaks people listen.","So I thought that it just came, listen, so I thought that it just came. Listen, so I thought that it just came out over the news, his feelings about, one out over the news, his feelings about, one out over the news, his feelings about one of the other candidates that's strong of the other candidates that's strong of the other candidates.","That's strong feelings, so that'll be very interested feelings. So that'll be very interested feelings. So that'll be very interested. I agree. I agree. And you know, he's been - I agree, I agree and you know he's been - I agree, I agree and you know he's been mixed on the subject. He goes wherever mixed on the subject.","He goes wherever mixed on the subject. He goes wherever the votes are. So he all of a sudden went the votes are so he all of a sudden went the votes are so he all of a sudden went over here and then all of a sudden he over here and then all of a sudden he over here and then All of a sudden he got slapped, so it's very interesting to got slapped.","So it's very interesting to got slapped. So it's very interesting to see, you know, I sat back and I actually see, you know, I sat back and I actually see, you know, I sat back and I actually wrote a few things down, wrote a few things down, wrote a few things down. Concerning ethanol, biofuel and and I concerning ethanol, biofuel and and I concerning ethanol, biofuel and - and I wanted to just read what I wrote because wanted to just read what I wrote because wanted to just read what I wrote because I think it's very important from the - I think it's very important from the - I think it's very important from the standpoint, certainly of this room standpoint, certainly of this room standpoint, certainly of this room, there's a little bit different.","I'm going - there's a little bit different. I'm going - there's a little bit different. I'm going in a little while to do an introduction in a little while to do an introduction in a little while to do an introduction of a person who's so highly regarded and of a person who's so highly regarded and of a person who's so highly regarded.","And - and a tremendous person, well, we're and a tremendous person, well, we're and a tremendous person, well, we're getting an endorsement, and that'll be getting an endorsement, and that'll be getting an endorsement, and that'll be exciting. So it's been an exciting and I exciting. So it's been an exciting and I exciting, so it's been an exciting and I just left the John Wayne Museum where just left the John Wayne Museum where just left the John Wayne Museum, where were we endorsed by the family and the - were we endorsed by the Family and the were we endorsed by the family and the daughter who was such an amazing woman daughter who was such an amazing woman daughter who was such an amazing woman.","And so John, Wayne has endorsed Trump I and so John Wayne has endorsed Trump I and so John Wayne has endorsed Trump. I like that. That's what we need. We need a like that. That's what we need. We need a like that. That's what we need. We need a little more John Wayne around here in little more John Wayne around here in little more John Wayne around here in this world.","I will tell you certainly in this world, I will tell you certainly in this world, I will tell you certainly in our country, maybe the rest of the world, our country, maybe the rest of the world, our country, maybe the rest of the world has a lot Of John Wayne, we don't have - it has a lot of John, Wayne, we don't have - it has a lot of John, Wayne, we don't have it.","So it's very important, but I wrote this. So it's very important, but I wrote this. So it's very important. But I wrote this out and I thought I'd just read it a out and I thought I'd just read it a out and I thought I'd just read it a little bit of it to you and I think little bit of it to you. And I think little bit of it to you and I think you'll agree with me and if you don't, you'll agree with me.","And if you don't, you'll agree with me. And if you don't, you'll let me know. That's one thing I - you'll let me know. That's one thing I - you'll let me know. That's one thing I know about you people - you're gonna let know about you people, you're gonna let know about you people, you're gonna, let me know the RFS which is renewable fuel me know the RFS, which is renewable fuel me know the RFS, which Is renewable fuel standard is an important tool in the standard is an important tool in the standard is an important tool in the mission to achieve energy independence mission to achieve energy independence mission to achieve energy independence for the United States.","I will do all that for the United States. I will do all that for the United States. I will do all that is in my power as president to achieve is in my power as president to achieve is in my power as president to achieve that goal. So far you agree with me right as president, I will encourage Congress as president.","I will encourage Congress as president. I will encourage Congress to be cautious in attempting to charge - to be cautious in attempting to charge - to be cautious in attempting to charge and change any part of the RFS. I mean, we - and change any part of the RFS. I mean, we - and change any part of the RFS. I mean, we have to do that.","Any part of the RFS have to do that. Any part of the RFS have to do that. Any part of the RFS energy independence is a requirement of energy independence is a requirement of energy independence is a requirement of Americans to become great. Again, my theme Americans to become great. Again, my theme Americans to become great.","Again, my theme is make America great again. It's an is make America great again, it's an is make America great again, it's an important part of it. The EPA should important part of it. The EPA should important part of it. The EPA should ensure that biofuel, RV, OHS or blend ensure that biofuel, RV, OHS or blend ensure that biofuel, RV, OHS or blend levels mats, a statutory level set by levels, mats, a statutory level set by levels, mats, a statutory level set by Congress under the RFS. The RFS and the Congress under the RFS, the RFS and the Congress under the RFS, the RFS and the associated RV OHS, which is very associated RV OHS, which is very associated RV OHS, which is very important or blend levels past the important or blend levels past The important or blend levels past the current 2022 cutoff must be part of a current 2022 cutoff must be part of a current 2022 cutoff must be part of a comprehensive energy program that comprehensive energy program, that comprehensive energy program that benefits all Americans and ensures again Benefits all Americans and ensures again benefits all Americans and ensures again that we are energy independent as president.","I would encourage as president I would encourage as president. I would encourage regulators to end restrictions that keep regulators to end restrictions that keep regulators to end restrictions that keep higher blends of ethanol and biofuel, higher blends of ethanol and biofuel, higher blends of ethanol and biofuel from being sold.","So we are with you folks from being sold. So we are with you folks from being sold. So we are with you folks and we've been with you from day one and - and we've been with you from day one and - and we've been with you from day one and I was over here about four weeks ago and I was over here about four weeks Ago and I was over here about four weeks ago and I actually toured some of the plants and I actually toured some of the plants and I actually toured some of the plants and metal out of the employees is amazing.","Metal out of the employees is amazing. Metal out of the employees is amazing what's going on with ethanol, with what's going on with ethanol, with what's going on with ethanol, with biofuel, with the different elements, it's biofuel with the different elements. It's biofuel with the different elements.","It's a different world and we're going to a different world and we're going to a different world and we're going to remain energy independent. We're going to remain energy independent. We're going to remain energy independent. We're going to be energy independent. We could have been be energy independent.","We could have been be energy independent. We could have been there a long time ago if we would have there a long time ago, if we would have there a long time ago if we would have been allowed to be there. But it's very been allowed to be there. But it's very been allowed to be there, but it's very important and you do a fantastic service important and you do a fantastic service important and you do a fantastic service.","I know not everybody's there, but I am - I know not everybody's there, but I am - I know not everybody's there, but I am there with you a hundred percent. So there with you a hundred percent so there with you a hundred percent. So that's the story and congratulations. That's the story and congratulations.","That's the story and congratulations. We are in a very interesting period of - we are in a very interesting period of - we are in a very interesting period of time. It's - it's vicious, it's vicious, not time. It's - it's vicious, it's vicious, not time. It's - it's vicious, it's vicious, not since medieval times.","Have you read about since medieval times, have you read about since medieval times, have you read about heads being chopped off, people being heads, being chopped off, people, being heads, being chopped off, people being murdered and killed to the extent that murdered and killed. To the extent that murdered and killed to the extent that they're being murdered and killed now, they're being murdered and killed.","Now they're being murdered and killed. Now when I would go and read and study when I would go and read and study when I would go and read and study history, I always loved history for some history. I always loved history for some history. I always loved history for some reason and you'd read about medieval reason and you'd read about medieval reason and you'd read about medieval times.","This is medieval times we're in times. This is medieval times. We're in times. This is medieval times. We're in mediaeval times in terms of the world mediaeval times in terms of the world mediaeval times in terms of the world and what's going on, you go to the Middle and what's going on, you go to the Middle and what's going on.","You go to the Middle East and you look at Christians where East and you look at Christians where East and you look at Christians where their heads are chopped off because their heads are chopped off because their heads are chopped off because they're Christian. You look at others, they're Christian, you look at others, they're Christian.","You look at others, same thing. I mean, they're drowning, same thing. I mean, they're drowning, same thing. I mean, they're drowning people in cages. There's never been a people in cages. There's never been a people in cages. There's never been a time like this. And I was against the war time like this.","And I was against the war time like this and I was against the war in Iraq. I felt it was going to in Iraq. I felt it was going to in Iraq, I felt it was going to destabilize the Middle East has been destabilize. The Middle East has been destabilize. The Middle East has been tremendous coverage of that.","My my - the tremendous coverage of that, my my - the tremendous coverage of that, my my - the fact that I was very strongly opposed to fact that I was very strongly opposed to fact that I was very strongly opposed to it. I just felt it would be totally a it. I just felt it would be totally a it. I just felt it would be totally a mess and it's turned out to be a bigger mess and it's turned out to be a bigger mess and it's turned out to be a bigger mess than anybody could have ever mess than anybody could have ever mess than Anybody could have ever believed and what's happened and what's believed and what's happened and what's believed and what's happened.","And what's happened very strongly is that we went - happened very strongly is that we went - happened very strongly is that we went into the war into the war, into the war. We totally decapitated one of the two. We totally decapitated one of the two. We totally decapitated one of the two powers in terms of military might and I powers in terms of military might and I powers in terms of military might and I said the other one will take over and said the other one will take over and said the Other one will take over and that's exactly what's happened.","Iran is that's exactly what's happened. Iran is that's exactly what's happened. Iran is taking over Iraq, the Iran deal is one of taking over Iraq. The Iran deal is one of taking over Iraq. The Iran deal is one of the worst deals I've ever seen. The worst deals I've ever seen, the worst deals I've ever seen negotiated, ever, ever, ever of, any kind negotiated, ever, ever, ever of any kind negotiated, ever, ever, ever of any kind, whether it's countries or whether it's whether it's countries or whether it's whether it's countries or Whether it's deals or whether it's just a simple deals or whether it's just a simple deals or whether it's just a simple contract contract contract, one of the most incompetently negotiated one of the most incompetently negotiated one of the most incompetently negotiated deals.","All we had to do is increase the deals. All we had to do is increase the deals. All we had to do is increase the sanctions. We would have gotten the sanctions. We would have gotten the sanctions. We would have gotten the prisoners back three years ago. We would prisoners back three years ago, we would prisoners back three years ago.","We would have had everything we wanted. We would have had everything we wanted. We would have had everything we wanted. We would have made a much better deal. We wouldn't have made a much better deal, we wouldn't have made a much better deal. We wouldn't giving them a hundred and fifty billion giving them a hundred and fifty billion giving them a hundred and fifty billion dollars.","I mean to think of what happened dollars. I mean to think of what happened dollars, I mean to think of what happened and then on top of it right before the - and then on top of it right before the - and then on top of it right before the deal, they take our seven sailors. They deal, they take our seven sailors.","They deal, they take our seven sailors. They make them drop to the begging position, make them drop to the begging position, make them drop to the begging position, hands up guns to their heads and hands up guns to their heads. And hands up guns to their heads and embarrass us and humiliate us as a embarrass us and humiliate us as a embarrass us and humiliate us as a country.","And it's a disgrace, it's a country and it's a disgrace. It's a country and it's a disgrace. It's a disgrace and frankly, if we weren't disgrace and frankly if we weren't disgrace and frankly if we weren't giving them, I mean these are great giving them. I mean these are great giving them. I mean these are great negotiators.","The Persians have always negotiators the Persians have always negotiators the Persians have always been great negotiators if we weren't been great negotiators. If we weren't been great negotiators, if we weren't giving them that money the following day giving them that money the following day giving them that money the following day or two days, they would have never given or two days.","They would have never given or two days. They would have never given us those sailors back because they have us those sailors back because they have us those sailors back because they have no respect for our country. They have no - no respect for our country. They have no - no respect for our country. They have no respect for our leadership.","They have no respect for our leadership. They have no respect for our leadership. They have no respect for us. They have no respect for respect for us. They have no respect for respect for us. They have no respect for any - any - any having to do with the United States they having to do with the United States they having to do with the United States.","They will respect us again, believe me, believe will respect us again, believe me, believe will respect us again, believe me, believe me. So I saw what happened and I watched me. So I saw what happened and I watched me. So I saw what happened and I watched and I've been watching what's been going and I've been watching what's been going and I've been watching what's been going on with the country and how sad it is on with the country and how sad it is on with The country and how sad it is actually, if you look at so many - actually if you look at so many - actually if you look at so many different things we're losing with the different things we're losing with the different things we're losing with the military.","Our military is being decimated, military, our military is being decimated. Military, our military is being decimated with cuts and - and problems and not with cuts and - and problems and not with cuts and - and problems and not having proper leadership. We can't beat having proper leadership. We can't beat having proper leadership.","We can't beat Isis. You know there was a time we could Isis. You know, there was a time we could Isis. You know there was a time we could be Germany, we could be Japan, we could be Germany, we could be Japan, we could be Germany, we could be Japan, we could beat whoever was in front of us, but now beat whoever was in front of us.","But now beat whoever was in front of us, but now we can't beat Isis, which is a group we can't beat Isis, which is a group we can't beat Isis, which is a group probably of 30,000 people. And they're probably of 30,000 people and they're probably of 30,000 people and they're dispersed in a certain way that dispersed in a certain way that dispersed in a certain way that shouldn't bother.","I think General Patton shouldn't bother. I think General Patton shouldn't bother. I think General Patton would have figured it out. Do you agree, would have figured it out, do you agree would have figured it out? Do you agree very quickly? I think General Douglas very quickly, I think General Douglas very quickly, I think General Douglas MacArthur would have figured that out MacArthur would have figured that out.","MacArthur would have figured that out very, very rapidly, very, very quickly. So very, very rapidly, very, very quickly. So very, very rapidly, very, very quickly. So we will get that figured out and we will - we will get that figured out and we will - we will get that figured out and we will knock the hell out of him because we knock the hell out of him because we knock the hell out of Him because we can't, you know, well, I didn't want to go, can't you know?","Well, I didn't want to go, can't you know. Well, I didn't want to go in the way we got out was wrong. We got in the way we got out was wrong. We got in the way we got out was wrong, we got out and we announced a date and the out and we announced a date and the out and we announced a date and the enemy sat back and waited, they probably enemy sat back and waited.","They probably enemy sat back and waited. They probably couldn't believe that we were announcing, couldn't believe that we were announcing, couldn't believe that we were announcing a date, but we announced a date and after a date, but we announced a date and after a date. But we announced a date and after that date was announced, the enemy pulls that date was announced.","The enemy pulls that date was announced, the enemy pulls back. They waited, we got out and they've back, they waited, we got out and they've back, they waited. We got out and they've look what's happened now, look what's - look, what's happened now, look what's - look, what's happened now, look, what's happened now then you have the migration happened now then you have the migration happened.","Now then you have the migration where we want to take in thousands and where we want to take in thousands and where we want to take in thousands and thousands and thousands of people. I thousands and thousands of people, I thousands and thousands of people. I think far greater than any numbers that think far greater than any numbers that think far greater than any numbers that you're hearing, frankly.","And we have no - you're hearing frankly and we have no - you're hearing frankly and we have no idea who these people are. So we want to idea who these people are, so we want to idea who these people are. So we want to have strong borders. We want to have have strong borders, we want to have have strong borders, we want to have strong lines.","You know, this all started strong lines, you know, this all started strong lines. You know this all started. One of the reasons I'm doing so well in one of the reasons I'm doing so well in one of the reasons I'm doing so well in the polls and I think I'm doing really the polls. And I think I'm doing really the polls.","And I think I'm doing really well in Iowa. I think it's really, really well in Iowa. I think it's really, really well in Iowa. I think it's really, really been strong in Iowa. I think even been strong in Iowa, I think even been strong in Iowa. I think even stronger than the polls say and the stronger than the polls say and the stronger than the polls say and the polls have us pretty much in first place.","Polls have us pretty much in first place. Polls have us pretty much in first place or at a minimum tied for first place CNN or at a minimum tied for first place CNN or at a minimum tied for first place. CNN had a poll recently 33 to 20 with me had a poll recently 33 to 20 with me had a poll recently 33 to 20 with me being 233, which is nice.","But - but I think being 233, which is nice. But - but I think being 233, which is nice, but - but I think we're doing really well here. I hope to - we're doing really well here. I hope to - we're doing really well here. I hope to do really well here. We're doing great, do really well here. We're doing great, do really well here.","We're doing great with evangelicals. We're doing great with - with evangelicals. We're doing great with - with evangelicals. We're doing great with the Tea Party and we're doing great, I the Tea Party and we're doing great, I - the Tea Party and we're doing great. I mean, I've been - I've been in Iowa so much mean I've been - I've been in Iowa so much mean I've been - I've been in Iowa so much and I'm going to be spending a lot of - and I'm going to be spending a lot of - and I'm going To be spending a lot of time here over the next week and a half time here over the next week and a half time here over the next week and a half and who would think it's coming up so and who would think it's coming up.","So and who would think it's coming up so soon February 1st, it's going to be a soon February 1st, it's going to be a soon February 1st. It's going to be a very exciting period of time, politically very exciting period of time, politically very exciting period of time politically, then we go on to New Hampshire.","We're then we go on to New Hampshire. We're then we go on to New Hampshire. We're going to South Carolina and Nevada and going to South Carolina and Nevada and going to South Carolina and Nevada and the SEC. It's - the whole thing is going to the SEC. It's - the whole thing is going to the SEC. It's the whole thing is going to be be be very exciting and although I will tell very exciting and although I will tell very exciting and although I will tell you is only gonna be excited by win, if I you is only gonna be excited By win, if I - you is only gonna be excited by win, if I don't win, I just wasted one hell of a don't win.","I just wasted one hell of a don't win. I just wasted one hell of a lot of time, yeah. But if I don't win, I'm lot of time, yeah, but if I don't win, I'm lot of time. Yeah, but if I don't win, I'm not going to be so excited I guess not going to be so excited, I guess not going to be so excited. I guess you're right, I'll be the opposite of - you're right, I'll be the opposite of - you're right, I'll be the opposite of excited.","But one of the things I'm doing excited, but one of the things I'm doing excited, but one of the things I'm doing is - and I think it's a big advantage in is - and I think it's a big advantage in is. And I think it's a big advantage in terms of people and popularity. I'm terms of people and popularity.","I'm terms of people and popularity. I'm self-funding my campaign, self-funding my campaign, self-funding my campaign. I'm not asking all of you, biofuel people. I'm not asking all of you. Biofuel people, I'm not asking all of you, biofuel people and UF than all people, I'm not saying and UF than all people I'm not saying and UF than all people.","I'm not saying please can I have money. Can I have money, please? Can I have money? Can I have money please? Can I have money? Can I have money? I don't want anything I do what's right. I don't want anything I do what's right. I don't want anything I do what's right. So when I want to go with ethanol, I can.","So when I want to go with ethanol, I can. So when I want to go with ethanol, I can go with ethanol. It's a big difference. Don't forget other candidates is - don't forget, other candidates is - don't forget, other candidates is supported by the oil industry. They're supported by the oil industry. They're supported by the oil industry.","They're supported by people totally in the oil, supported by people totally in the oil, supported by people totally in the oil industry and they have them totally industry and they have them totally industry and they have them totally wrapped up. And me, I'm gonna do what's wrapped up and me, I'm gonna do what's wrapped up and me, I'm gonna do what's right for the country.","I'm gonna do right for the country. I'm gonna do right for the country. I'm gonna do. What's right, nobody's gonna come to me, what's right? Nobody's gonna come to me. What's right? Nobody's gonna come to me and say Donald, I gave you five million and say Donald, I gave you five million and say Donald, I gave you five million dollars and I hope you're gonna remember dollars and I hope you're gonna remember dollars.","And I hope you're gonna remember that and I hope you're gonna do that and I hope you're gonna do that. And I hope you're gonna do something that maybe it's not so good, something that maybe it's not so good, something that maybe it's not so good for the country, but it's good for him or for the country, but it's good for him or for the country.","But it's good for him or her and it's not gonna happen that way her and it's not gonna happen that way her and it's not gonna happen that way. We're gonna do what's right. So I'm - we're gonna do what's right. So I'm - we're gonna do what's right. So I'm self-funding my campaign. I'm not taking self-funding my campaign.","I'm not taking self-funding my campaign. I'm not taking contributions. I tell you what I would contributions. I tell you what I would contributions. I tell you what I would have had the biggest, the biggest super have had the biggest, the biggest super have had the biggest, the biggest super PAC you have ever seen with the money PAC you have ever seen with the money PAC you have ever seen.","With the money I've turned down, where I tell people I - I've turned down where I tell people I - I've turned down where I tell people, I don't want it, I don't want it. I can't do, don't want it. I don't want it. I can't do. Don't want it, I don't want it, I can't do it and I'm turning down friends. I it - and I'm turning down friends.","I it and I'm turning down friends. I wouldn't even do anything for him. I'm wouldn't even do anything for him. I'm wouldn't even do anything for him, I'm gonna do what's right. Anyway, I was gonna do what's right. Anyway, I was gonna do what's right. Anyway, I was actually with a group in Iowa about two actually with a group in Iowa, about two actually with a group in Iowa about two months ago, big group probably 4,000 months ago, big group probably 4,000 months ago, big group, probably 4,000 people.","And I said, listen, I feel so people and I said, listen, I feel so people and I said, listen, I feel so foolish not taking all this money, that's foolish not taking all this money, that's foolish not taking all this money that's been you know when you're Number one been, you know when you're number one been, you know when you're number one, I've been number one practically from - I've been number one practically from - I've been number one practically from the time I announced and June 16 big day the time I announced and June 16 big day, the time I announced and June 16 big day, that's when I talked about illegal.","That's when I talked about illegal, that's when I talked about illegal immigration man, did I get hit? I talked immigration man, did I get hit? I talked immigration man, did I get hit? I talked about that and then people found out hey about that and then people found out hey about that. And then people found out, hey, he's right and we've been right about a - he's right and we've been right about a - he's right.","And we've been right about a lot of things. We've been right about a lot of things. We've been right about a lot of things. We've been right about a lot of things. We've been right about the lot of things. We've been right about the lot of things. We've been right about the military. We've been right about military.","We've been right about military. We've been right about terminating Obamacare and coming up with terminating Obamacare and coming up with terminating Obamacare and coming up with a much better solution and a lot less - a much better solution and a lot less - a much better solution and a lot less expense for the People - but we've been expense for the people, but we've been expense for the people, but we've been right and I will tell you that from the right and I will tell you that from the right and I will tell you that from the time I announced it Was - it has been a time I announced it was - it has been a time I announced it was - it has been a fabulous experience.","And when I was fabulous experience and when I was fabulous experience and when I was talking to these 4,000 people and they talking to these 4,000 people and they talking to these 4,000 people and they were great people, I said, look, let me were great people. I said, look, let me were great people. I said, look, let me take the money, take the money, take the money, I did my a poll much more accurately.","I did my a poll much more accurately. I did my a poll much more accurately than the - than the - than the guys can do pasta. I mean, I did - the guys can do pasta. I mean, I did - the guys can do pasta. I mean, I did the greatest poll, 4000 people from Iowa. I greatest poll 4000 people from Iowa. I greatest poll 4000 people from Iowa.","I said, let me take the money I feel so said, let me take the money. I feel so said, let me take the money. I feel so foolish not taking it. It's millions of foolish not taking it. It's millions of foolish not taking it. It's millions of dollars, millions. I would have made jeb dollars millions. I would have made jeb dollars millions.","I would have made, jeb Bush's to 125 men. Can you imagine he Bush's to 125 men, can you imagine he Bush's to 125 men? Can you imagine he spent 125, he's got a hundred and twenty spent 125, he's got a hundred and twenty spent 125, he's got a hundred and twenty five he's spent like 70 or 78 or 80 and five he's spent like 70 or 78 or 80 and five.","He's spent like 70 or 78 or 80, and he's like doing terribly - I'm in first, he's like doing terribly - I'm in first, he's like doing terribly - I'm in first place. I haven't spent anything place. I haven't spent anything place. I haven't spent anything practically now. I'm gonna spend two practically now I'm gonna spend two practically.","Now I'm gonna spend two reasons. Number one, I feel guilty number reasons. Number one, I feel guilty number reasons. Number one, I feel guilty. Number two, I don't want to take a chance. Does two, I don't want to take a chance, does two, I don't want to take a chance. Does that make sense? So I said to this group that make sense.","So I said to this group that make sense. So I said to this group four thousand people I said, so everybody, four thousand people I said, so everybody, four thousand people I said. So everybody ready. Can I take the money, I promise it ready. Can I take the money? I promise it ready. Can I take the money?","I promise it won't have any influence. They all stood, won't have any influence. They all stood, won't have any influence. They all stood up and they booed don't do. It don't do up and they booed don't do it, don't do up. And they booed don't do it, don't do it no, no, because they're smart because it - no - no, because they're smart because it - no - no, because they're smart because they're smart.","And then I said who in the - they're smart. And then I said who in the - they're smart. And then I said who in the room says it's okay for me to take the room says it's okay for me to take the room says it's okay for me to take the money. There was one person in the very money, there was one person in the very money, there was one person in the very back of the room actually looked like a back of the room actually looked like a back of the room actually looked like a very sleazy Character stood up and said very sleazy character stood up and said very sleazy character stood up and said you could take.","So I was amazed actually you could take. So I was amazed actually you could take. So I was amazed actually and and you know my people told me that and and you know my people told me that and and you know my people told me that would make - I've actually had some people would make, I've actually had some people would make.","I've actually had some people that if you're rich, that you can do that, that if you're rich, that you can do that, that if you're rich, that you can do that, that would be an amazing thing because that would be an amazing thing because that would be An amazing thing because it would be a big advantage.","I never knew it would be a big advantage. I never knew it would be a big advantage. I never knew it was going to be that big of an - it was going to be that big of an - it was going to be that big of an advantage, but a lot of people respect. Advantage, but a lot of people respect advantage, but a lot of people respect the fact that I'm self-funding my - the fact that I'm self-funding my - the fact that I'm self-funding my campaign because they know I'm gonna do campaign because they know I'm gonna do campaign Because they know I'm gonna do what's right, I often tell the story of what's right.","I often tell the story of what's right. I often tell the story of Ford moving into Mexico and they won't Ford moving into Mexico and they won't Ford moving into Mexico. And they won't do that. I mean, there's so many people do that. I mean there's so many people do that. I mean, there's so many people representing Ford that some politician representing Ford that some politician representing Ford that some politician that relies on money coming and Nabisco that relies on money coming and Nabisco that relies on money coming and Nabisco moving into Mexico.","Their big plan from moving into Mexico, their big plan from moving into Mexico, their big plan from Chicago, there's so many people, Chicago, there's so many people, Chicago, there's so many people representing companies like Nabisco and representing companies like Nabisco and representing companies like Nabisco and Ford That believe me, they have a Ford that believe me, they have a Ford that believe me, they have a tremendous power over the politicians, tremendous power over the politicians, tremendous power over the politicians you're like puppets.","Just like puppets, you're like puppets just like puppets, you're like puppets just like puppets. So I'm gonna do it a way that hasn't. So I'm gonna do it a way that hasn't. So I'm gonna do it a way that hasn't been done before maybe or maybe been done before maybe or maybe been done before maybe or maybe certainly hasn't.","I mean on either side certainly hasn't - I mean on either side certainly hasn't - I mean on either side, everybody is taking money from all these. Everybody is taking money from all these. Everybody is taking money from all these different groups, whether it's the oil different groups, whether it's the oil different groups, whether it's the oil people or whether it's any people that people or whether it's any people that people or whether it's any people that you talk about.","The retailers, every group you talk about the retailers, every group you talk about the retailers, every group is well covered and every one of these is well covered. And every one of these is well covered. And every one of these people is not going to necessarily do - people is not going to necessarily do people is not going to necessarily do the right thing for the people for the - the right thing for the people for the - the right thing for the people.","For the country, for the United States, they're country for the United States, they're country for the United States. They're gonna do the right thing for the company, gonna do the right thing for the company, gonna do the right thing for the company. They represent - or the company they own a - they represent or the company they own a - they represent or the company they own a piece of or own in its entirety piece of or own in its entirety piece of or own in its entirety.","So you're gonna get a really fair shake, so you're gonna get a really fair shake. So you're gonna get a really fair shake from me and you know, I just - I just tell from me and you know I just - I just tell from me and you know I just - I just tell you very strongly that's the way it is. You very strongly - that's the way it is you very strongly.","That's the way it is. One of the things we're going to do, I - one of the things we're going to do, I - one of the things we're going to do, I know the greatest business, people in the know the greatest business. People in the know the greatest business people in the world. They come from New York, Carl Icahn world.","They come from New York, Carl Icahn world. They come from New York. Carl Icahn is backing me, 100 %. Endorsing me is backing me 100 %. Endorsing me is backing me 100 % endorsing me. He's already endorsed me. But many of the - he's already endorsed me, but many of the - he's already endorsed me. But many of the other business people they want to other business people, they want to other business people.","They want to - nobody knows who they are. That's one of nobody knows who they are. That's one of. Nobody knows who they are. That's one of the problems. I mean, it's like, oh, I want the problems. I mean, it's like, oh, I want the problems. I mean, it's like - oh, I want to endorse you. I'd say nobody knows who to endorse you.","I'd say nobody knows who to endorse you. I'd say nobody knows who you are, but I know who they are. They're you are. But I know who they are, they're you are. But I know who they are, they're killers. But this is what we want killers, but this is what we want killers, but this is what we want negotiating for us.","We want these great negotiating for us. We want these great negotiating for us. We want these great negotiators, these great people negotiate negotiators, these great people negotiate negotiators these great people negotiate. We're losing 400 and been so ridiculous. We're losing 400 and been so ridiculous.","We're losing 400 and been so ridiculous. It's actually much more - it's actually - it's actually much more - it's actually - it's actually much more - it's actually now I believe had over 500 billion now, I believe had over 500 billion now I believe had over 500 billion dollars in a trade deficit with China dollars in a Trade deficit with China dollars in a trade deficit with China 500 billion dollars, we can't lose that 500 billion dollars.","We can't lose that 500 billion dollars. We can't lose that money. We're losing tremendous amounts of money. We're losing tremendous amounts of money. We're losing tremendous amounts of money with Japan. We're losing tremendous money with Japan. We're losing tremendous money with Japan. We're losing tremendous amounts with - with Mexico where we're amounts with, with Mexico where we're amounts with, with Mexico where we're gonna create a very strong border.","We are gonna create a very strong border. We are gonna create a very strong border. We are gonna build a wall and by the way Mexico gonna build a wall and by the way Mexico gonna build a wall. And by the way Mexico is going to pay for the world just in is going to pay for the world. Just in is going to pay for the world just in case you had any questions and the case you had any questions and the case you had any questions.","And the reason they're gonna pay for the was reason they're gonna pay for the - was reason they're gonna pay for the - was very simple. They make a fortune very simple. They make a fortune very simple, they make a fortune, they make so much money. Mexico on trade, they make so much money, Mexico on trade, they make so much money.","Mexico on trade deficits with us, they make so much money deficits with us. They make so much money deficits with us. They make so much money. The wall is peanuts, the politicians come the wall is peanuts, the politicians come the wall is peanuts, the politicians come up to me and make sure you can't build a up to me and make sure you can't build a up to me and make sure you can't Build a wall, can you of course you can the Great wall.","Can you of course you can the Great wall. Can you of course you can. The Great Wall of China was built 2,000 years ago. Wall of China was built 2,000 years ago. Wall of China was built 2,000 years ago, 13,000 miles here, we need a thousand 13,000 miles. Here we need a thousand 13,000 miles. Here we need a thousand less because we have natural barriers we less because we have natural barriers we less because we have natural barriers, we need a thousand miles which is nothing need a thousand miles, which is nothing need a thousand miles, which is nothing, it's nothing.","And the cost is nothing, it's nothing and the cost is nothing, it's nothing. And the cost is nothing compared to what we're losing people are compared to what we're losing people are compared to what we're losing. People are pouring through and I want people to pouring through. And I want people to pouring through and I want people to come into the country, but I want them to come into the country, but I want them to come into the country.","But I want them to come in legally. They have to come into come in legally. They have to come into come in legally. They have to come into the country legally the country legally the country legally. So I know this is a very specific group. So I know this is a very specific group. So I know this is a very specific group, but I don't want to keep you very long, but I don't want to keep you very long, but I don't want to keep you very long and we're gonna have some interesting and we're gonna have some Interesting and we're gonna have some interesting things to say today at another meeting, things to say today at another meeting, things to say today at another meeting.","But this was an important meeting and I - but this was an important meeting and I - but this was an important meeting and I wanted to let you know how I feel and wanted to let you know how I feel and wanted to let you know how I Feel and I've been that way for a long time and I've been that way for a long time and I've been that way for a long time and your representatives have been great.","Your representatives have been great, your representatives have been great because when I was here four weeks ago, I - because when I was here four weeks ago, I - because when I was here four weeks ago, I mean they took me into plants. I said mean they took me into plants, I said mean they took me into plants, I said enough already.","Okay. You've convinced me enough already. Okay, you've convinced me enough already. Okay, you've convinced me, I don't want to see any more plants. I - I don't want to see any more plants. I - I don't want to see any more plants. I don't need to see any more. I believe me, don't need to see any more. I believe me, don't need to see any more, I believe me.","But I think it's great actually it's - but I think it's great actually it's - but I think it's great actually it's amazing and incredible what you do and amazing and incredible what you do and amazing and incredible what you do and how you can do this. And the whole, how you can do this and the whole, how you can do this and the whole process of the plants and the creation process of the plants and the creation process of the plants and the creation of this field is fabulous.","So I'm with of this field is fabulous, so I'm with of this field is fabulous. So I'm with you 100 %, you 100 %, you 100 %. I wish you a lot of luck and I will come. I wish you a lot of luck and I will come. I wish you a lot of luck and I will come down and I think we're going to say down and I think we're going to say down and I think we're going to say hello to some of the people in the early hello to some of the People in the early hello to some of the people in the early rows and it's a great honor, a great rows and it's a great honor, a great rows and it's a great honor, a great honor and good luck and get out there honor and good luck.","And get out there honor and good luck and get out there and make plenty of fuel because we're - and make plenty of fuel because we're - and make plenty of fuel because we're gonna need it. Eventually we're going to gonna need it eventually. We're going to gonna need it eventually, we're going to really need it.","Thank you very much. Thank really need it. Thank you very much. Thank really need it. Thank you very much. Thank you. Thank you."],"text":" I was a very nice introduction. I - I was a very nice introduction. I - I was a very nice introduction. I appreciate it very much. It's so much fun, appreciate it very much. It's so much fun, appreciate it very much. It's so much fun and so interesting and I know the - and so interesting and I know the - and so interesting and I know the governor just made a very big statement, governor just made a very big statement. Governor just made a very big statement that was appreciated by many and that that was appreciated by many and that, that was appreciated by many. And that was amazing actually. And he's a - was amazing actually and he's a - was amazing actually and he's a respected man. And when he speaks people respected man and when he speaks people respected man and when he speaks people listen. So I thought that it just came, listen, so I thought that it just came. Listen, so I thought that it just came out over the news, his feelings about, one out over the news, his feelings about, one out over the news, his feelings about one of the other candidates that's strong of the other candidates that's strong of the other candidates. That's strong feelings, so that'll be very interested feelings. So that'll be very interested feelings. So that'll be very interested. I agree. I agree. And you know, he's been - I agree, I agree and you know he's been - I agree, I agree and you know he's been mixed on the subject. He goes wherever mixed on the subject. He goes wherever mixed on the subject. He goes wherever the votes are. So he all of a sudden went the votes are so he all of a sudden went the votes are so he all of a sudden went over here and then all of a sudden he over here and then all of a sudden he over here and then All of a sudden he got slapped, so it's very interesting to got slapped. So it's very interesting to got slapped. So it's very interesting to see, you know, I sat back and I actually see, you know, I sat back and I actually see, you know, I sat back and I actually wrote a few things down, wrote a few things down, wrote a few things down. Concerning ethanol, biofuel and and I concerning ethanol, biofuel and and I concerning ethanol, biofuel and - and I wanted to just read what I wrote because wanted to just read what I wrote because wanted to just read what I wrote because I think it's very important from the - I think it's very important from the - I think it's very important from the standpoint, certainly of this room standpoint, certainly of this room standpoint, certainly of this room, there's a little bit different. I'm going - there's a little bit different. I'm going - there's a little bit different. I'm going in a little while to do an introduction in a little while to do an introduction in a little while to do an introduction of a person who's so highly regarded and of a person who's so highly regarded and of a person who's so highly regarded. And - and a tremendous person, well, we're and a tremendous person, well, we're and a tremendous person, well, we're getting an endorsement, and that'll be getting an endorsement, and that'll be getting an endorsement, and that'll be exciting. So it's been an exciting and I exciting. So it's been an exciting and I exciting, so it's been an exciting and I just left the John Wayne Museum where just left the John Wayne Museum where just left the John Wayne Museum, where were we endorsed by the family and the - were we endorsed by the Family and the were we endorsed by the family and the daughter who was such an amazing woman daughter who was such an amazing woman daughter who was such an amazing woman. And so John, Wayne has endorsed Trump I and so John Wayne has endorsed Trump I and so John Wayne has endorsed Trump. I like that. That's what we need. We need a like that. That's what we need. We need a like that. That's what we need. We need a little more John Wayne around here in little more John Wayne around here in little more John Wayne around here in this world. I will tell you certainly in this world, I will tell you certainly in this world, I will tell you certainly in our country, maybe the rest of the world, our country, maybe the rest of the world, our country, maybe the rest of the world has a lot Of John Wayne, we don't have - it has a lot of John, Wayne, we don't have - it has a lot of John, Wayne, we don't have it. So it's very important, but I wrote this. So it's very important, but I wrote this. So it's very important. But I wrote this out and I thought I'd just read it a out and I thought I'd just read it a out and I thought I'd just read it a little bit of it to you and I think little bit of it to you. And I think little bit of it to you and I think you'll agree with me and if you don't, you'll agree with me. And if you don't, you'll agree with me. And if you don't, you'll let me know. That's one thing I - you'll let me know. That's one thing I - you'll let me know. That's one thing I know about you people - you're gonna let know about you people, you're gonna let know about you people, you're gonna, let me know the RFS which is renewable fuel me know the RFS, which is renewable fuel me know the RFS, which Is renewable fuel standard is an important tool in the standard is an important tool in the standard is an important tool in the mission to achieve energy independence mission to achieve energy independence mission to achieve energy independence for the United States. I will do all that for the United States. I will do all that for the United States. I will do all that is in my power as president to achieve is in my power as president to achieve is in my power as president to achieve that goal. So far you agree with me right as president, I will encourage Congress as president. I will encourage Congress as president. I will encourage Congress to be cautious in attempting to charge - to be cautious in attempting to charge - to be cautious in attempting to charge and change any part of the RFS. I mean, we - and change any part of the RFS. I mean, we - and change any part of the RFS. I mean, we have to do that. Any part of the RFS have to do that. Any part of the RFS have to do that. Any part of the RFS energy independence is a requirement of energy independence is a requirement of energy independence is a requirement of Americans to become great. Again, my theme Americans to become great. Again, my theme Americans to become great. Again, my theme is make America great again. It's an is make America great again, it's an is make America great again, it's an important part of it. The EPA should important part of it. The EPA should important part of it. The EPA should ensure that biofuel, RV, OHS or blend ensure that biofuel, RV, OHS or blend ensure that biofuel, RV, OHS or blend levels mats, a statutory level set by levels, mats, a statutory level set by levels, mats, a statutory level set by Congress under the RFS. The RFS and the Congress under the RFS, the RFS and the Congress under the RFS, the RFS and the associated RV OHS, which is very associated RV OHS, which is very associated RV OHS, which is very important or blend levels past the important or blend levels past The important or blend levels past the current 2022 cutoff must be part of a current 2022 cutoff must be part of a current 2022 cutoff must be part of a comprehensive energy program that comprehensive energy program, that comprehensive energy program that benefits all Americans and ensures again Benefits all Americans and ensures again benefits all Americans and ensures again that we are energy independent as president. I would encourage as president I would encourage as president. I would encourage regulators to end restrictions that keep regulators to end restrictions that keep regulators to end restrictions that keep higher blends of ethanol and biofuel, higher blends of ethanol and biofuel, higher blends of ethanol and biofuel from being sold. So we are with you folks from being sold. So we are with you folks from being sold. So we are with you folks and we've been with you from day one and - and we've been with you from day one and - and we've been with you from day one and I was over here about four weeks ago and I was over here about four weeks Ago and I was over here about four weeks ago and I actually toured some of the plants and I actually toured some of the plants and I actually toured some of the plants and metal out of the employees is amazing. Metal out of the employees is amazing. Metal out of the employees is amazing what's going on with ethanol, with what's going on with ethanol, with what's going on with ethanol, with biofuel, with the different elements, it's biofuel with the different elements. It's biofuel with the different elements. It's a different world and we're going to a different world and we're going to a different world and we're going to remain energy independent. We're going to remain energy independent. We're going to remain energy independent. We're going to be energy independent. We could have been be energy independent. We could have been be energy independent. We could have been there a long time ago if we would have there a long time ago, if we would have there a long time ago if we would have been allowed to be there. But it's very been allowed to be there. But it's very been allowed to be there, but it's very important and you do a fantastic service important and you do a fantastic service important and you do a fantastic service. I know not everybody's there, but I am - I know not everybody's there, but I am - I know not everybody's there, but I am there with you a hundred percent. So there with you a hundred percent so there with you a hundred percent. So that's the story and congratulations. That's the story and congratulations. That's the story and congratulations. We are in a very interesting period of - we are in a very interesting period of - we are in a very interesting period of time. It's - it's vicious, it's vicious, not time. It's - it's vicious, it's vicious, not time. It's - it's vicious, it's vicious, not since medieval times. Have you read about since medieval times, have you read about since medieval times, have you read about heads being chopped off, people being heads, being chopped off, people, being heads, being chopped off, people being murdered and killed to the extent that murdered and killed. To the extent that murdered and killed to the extent that they're being murdered and killed now, they're being murdered and killed. Now they're being murdered and killed. Now when I would go and read and study when I would go and read and study when I would go and read and study history, I always loved history for some history. I always loved history for some history. I always loved history for some reason and you'd read about medieval reason and you'd read about medieval reason and you'd read about medieval times. This is medieval times we're in times. This is medieval times. We're in times. This is medieval times. We're in mediaeval times in terms of the world mediaeval times in terms of the world mediaeval times in terms of the world and what's going on, you go to the Middle and what's going on, you go to the Middle and what's going on. You go to the Middle East and you look at Christians where East and you look at Christians where East and you look at Christians where their heads are chopped off because their heads are chopped off because their heads are chopped off because they're Christian. You look at others, they're Christian, you look at others, they're Christian. You look at others, same thing. I mean, they're drowning, same thing. I mean, they're drowning, same thing. I mean, they're drowning people in cages. There's never been a people in cages. There's never been a people in cages. There's never been a time like this. And I was against the war time like this. And I was against the war time like this and I was against the war in Iraq. I felt it was going to in Iraq. I felt it was going to in Iraq, I felt it was going to destabilize the Middle East has been destabilize. The Middle East has been destabilize. The Middle East has been tremendous coverage of that. My my - the tremendous coverage of that, my my - the tremendous coverage of that, my my - the fact that I was very strongly opposed to fact that I was very strongly opposed to fact that I was very strongly opposed to it. I just felt it would be totally a it. I just felt it would be totally a it. I just felt it would be totally a mess and it's turned out to be a bigger mess and it's turned out to be a bigger mess and it's turned out to be a bigger mess than anybody could have ever mess than anybody could have ever mess than Anybody could have ever believed and what's happened and what's believed and what's happened and what's believed and what's happened. And what's happened very strongly is that we went - happened very strongly is that we went - happened very strongly is that we went into the war into the war, into the war. We totally decapitated one of the two. We totally decapitated one of the two. We totally decapitated one of the two powers in terms of military might and I powers in terms of military might and I powers in terms of military might and I said the other one will take over and said the other one will take over and said the Other one will take over and that's exactly what's happened. Iran is that's exactly what's happened. Iran is that's exactly what's happened. Iran is taking over Iraq, the Iran deal is one of taking over Iraq. The Iran deal is one of taking over Iraq. The Iran deal is one of the worst deals I've ever seen. The worst deals I've ever seen, the worst deals I've ever seen negotiated, ever, ever, ever of, any kind negotiated, ever, ever, ever of any kind negotiated, ever, ever, ever of any kind, whether it's countries or whether it's whether it's countries or whether it's whether it's countries or Whether it's deals or whether it's just a simple deals or whether it's just a simple deals or whether it's just a simple contract contract contract, one of the most incompetently negotiated one of the most incompetently negotiated one of the most incompetently negotiated deals. All we had to do is increase the deals. All we had to do is increase the deals. All we had to do is increase the sanctions. We would have gotten the sanctions. We would have gotten the sanctions. We would have gotten the prisoners back three years ago. We would prisoners back three years ago, we would prisoners back three years ago. We would have had everything we wanted. We would have had everything we wanted. We would have had everything we wanted. We would have made a much better deal. We wouldn't have made a much better deal, we wouldn't have made a much better deal. We wouldn't giving them a hundred and fifty billion giving them a hundred and fifty billion giving them a hundred and fifty billion dollars. I mean to think of what happened dollars. I mean to think of what happened dollars, I mean to think of what happened and then on top of it right before the - and then on top of it right before the - and then on top of it right before the deal, they take our seven sailors. They deal, they take our seven sailors. They deal, they take our seven sailors. They make them drop to the begging position, make them drop to the begging position, make them drop to the begging position, hands up guns to their heads and hands up guns to their heads. And hands up guns to their heads and embarrass us and humiliate us as a embarrass us and humiliate us as a embarrass us and humiliate us as a country. And it's a disgrace, it's a country and it's a disgrace. It's a country and it's a disgrace. It's a disgrace and frankly, if we weren't disgrace and frankly if we weren't disgrace and frankly if we weren't giving them, I mean these are great giving them. I mean these are great giving them. I mean these are great negotiators. The Persians have always negotiators the Persians have always negotiators the Persians have always been great negotiators if we weren't been great negotiators. If we weren't been great negotiators, if we weren't giving them that money the following day giving them that money the following day giving them that money the following day or two days, they would have never given or two days. They would have never given or two days. They would have never given us those sailors back because they have us those sailors back because they have us those sailors back because they have no respect for our country. They have no - no respect for our country. They have no - no respect for our country. They have no respect for our leadership. They have no respect for our leadership. They have no respect for our leadership. They have no respect for us. They have no respect for respect for us. They have no respect for respect for us. They have no respect for any - any - any having to do with the United States they having to do with the United States they having to do with the United States. They will respect us again, believe me, believe will respect us again, believe me, believe will respect us again, believe me, believe me. So I saw what happened and I watched me. So I saw what happened and I watched me. So I saw what happened and I watched and I've been watching what's been going and I've been watching what's been going and I've been watching what's been going on with the country and how sad it is on with the country and how sad it is on with The country and how sad it is actually, if you look at so many - actually if you look at so many - actually if you look at so many different things we're losing with the different things we're losing with the different things we're losing with the military. Our military is being decimated, military, our military is being decimated. Military, our military is being decimated with cuts and - and problems and not with cuts and - and problems and not with cuts and - and problems and not having proper leadership. We can't beat having proper leadership. We can't beat having proper leadership. We can't beat Isis. You know there was a time we could Isis. You know, there was a time we could Isis. You know there was a time we could be Germany, we could be Japan, we could be Germany, we could be Japan, we could be Germany, we could be Japan, we could beat whoever was in front of us, but now beat whoever was in front of us. But now beat whoever was in front of us, but now we can't beat Isis, which is a group we can't beat Isis, which is a group we can't beat Isis, which is a group probably of 30,000 people. And they're probably of 30,000 people and they're probably of 30,000 people and they're dispersed in a certain way that dispersed in a certain way that dispersed in a certain way that shouldn't bother. I think General Patton shouldn't bother. I think General Patton shouldn't bother. I think General Patton would have figured it out. Do you agree, would have figured it out, do you agree would have figured it out? Do you agree very quickly? I think General Douglas very quickly, I think General Douglas very quickly, I think General Douglas MacArthur would have figured that out MacArthur would have figured that out. MacArthur would have figured that out very, very rapidly, very, very quickly. So very, very rapidly, very, very quickly. So very, very rapidly, very, very quickly. So we will get that figured out and we will - we will get that figured out and we will - we will get that figured out and we will knock the hell out of him because we knock the hell out of him because we knock the hell out of Him because we can't, you know, well, I didn't want to go, can't you know? Well, I didn't want to go, can't you know. Well, I didn't want to go in the way we got out was wrong. We got in the way we got out was wrong. We got in the way we got out was wrong, we got out and we announced a date and the out and we announced a date and the out and we announced a date and the enemy sat back and waited, they probably enemy sat back and waited. They probably enemy sat back and waited. They probably couldn't believe that we were announcing, couldn't believe that we were announcing, couldn't believe that we were announcing a date, but we announced a date and after a date, but we announced a date and after a date. But we announced a date and after that date was announced, the enemy pulls that date was announced. The enemy pulls that date was announced, the enemy pulls back. They waited, we got out and they've back, they waited, we got out and they've back, they waited. We got out and they've look what's happened now, look what's - look, what's happened now, look what's - look, what's happened now, look, what's happened now then you have the migration happened now then you have the migration happened. Now then you have the migration where we want to take in thousands and where we want to take in thousands and where we want to take in thousands and thousands and thousands of people. I thousands and thousands of people, I thousands and thousands of people. I think far greater than any numbers that think far greater than any numbers that think far greater than any numbers that you're hearing, frankly. And we have no - you're hearing frankly and we have no - you're hearing frankly and we have no idea who these people are. So we want to idea who these people are, so we want to idea who these people are. So we want to have strong borders. We want to have have strong borders, we want to have have strong borders, we want to have strong lines. You know, this all started strong lines, you know, this all started strong lines. You know this all started. One of the reasons I'm doing so well in one of the reasons I'm doing so well in one of the reasons I'm doing so well in the polls and I think I'm doing really the polls. And I think I'm doing really the polls. And I think I'm doing really well in Iowa. I think it's really, really well in Iowa. I think it's really, really well in Iowa. I think it's really, really been strong in Iowa. I think even been strong in Iowa, I think even been strong in Iowa. I think even stronger than the polls say and the stronger than the polls say and the stronger than the polls say and the polls have us pretty much in first place. Polls have us pretty much in first place. Polls have us pretty much in first place or at a minimum tied for first place CNN or at a minimum tied for first place CNN or at a minimum tied for first place. CNN had a poll recently 33 to 20 with me had a poll recently 33 to 20 with me had a poll recently 33 to 20 with me being 233, which is nice. But - but I think being 233, which is nice. But - but I think being 233, which is nice, but - but I think we're doing really well here. I hope to - we're doing really well here. I hope to - we're doing really well here. I hope to do really well here. We're doing great, do really well here. We're doing great, do really well here. We're doing great with evangelicals. We're doing great with - with evangelicals. We're doing great with - with evangelicals. We're doing great with the Tea Party and we're doing great, I the Tea Party and we're doing great, I - the Tea Party and we're doing great. I mean, I've been - I've been in Iowa so much mean I've been - I've been in Iowa so much mean I've been - I've been in Iowa so much and I'm going to be spending a lot of - and I'm going to be spending a lot of - and I'm going To be spending a lot of time here over the next week and a half time here over the next week and a half time here over the next week and a half and who would think it's coming up so and who would think it's coming up. So and who would think it's coming up so soon February 1st, it's going to be a soon February 1st, it's going to be a soon February 1st. It's going to be a very exciting period of time, politically very exciting period of time, politically very exciting period of time politically, then we go on to New Hampshire. We're then we go on to New Hampshire. We're then we go on to New Hampshire. We're going to South Carolina and Nevada and going to South Carolina and Nevada and going to South Carolina and Nevada and the SEC. It's - the whole thing is going to the SEC. It's - the whole thing is going to the SEC. It's the whole thing is going to be be be very exciting and although I will tell very exciting and although I will tell very exciting and although I will tell you is only gonna be excited by win, if I you is only gonna be excited By win, if I - you is only gonna be excited by win, if I don't win, I just wasted one hell of a don't win. I just wasted one hell of a don't win. I just wasted one hell of a lot of time, yeah. But if I don't win, I'm lot of time, yeah, but if I don't win, I'm lot of time. Yeah, but if I don't win, I'm not going to be so excited I guess not going to be so excited, I guess not going to be so excited. I guess you're right, I'll be the opposite of - you're right, I'll be the opposite of - you're right, I'll be the opposite of excited. But one of the things I'm doing excited, but one of the things I'm doing excited, but one of the things I'm doing is - and I think it's a big advantage in is - and I think it's a big advantage in is. And I think it's a big advantage in terms of people and popularity. I'm terms of people and popularity. I'm terms of people and popularity. I'm self-funding my campaign, self-funding my campaign, self-funding my campaign. I'm not asking all of you, biofuel people. I'm not asking all of you. Biofuel people, I'm not asking all of you, biofuel people and UF than all people, I'm not saying and UF than all people I'm not saying and UF than all people. I'm not saying please can I have money. Can I have money, please? Can I have money? Can I have money please? Can I have money? Can I have money? I don't want anything I do what's right. I don't want anything I do what's right. I don't want anything I do what's right. So when I want to go with ethanol, I can. So when I want to go with ethanol, I can. So when I want to go with ethanol, I can go with ethanol. It's a big difference. Don't forget other candidates is - don't forget, other candidates is - don't forget, other candidates is supported by the oil industry. They're supported by the oil industry. They're supported by the oil industry. They're supported by people totally in the oil, supported by people totally in the oil, supported by people totally in the oil industry and they have them totally industry and they have them totally industry and they have them totally wrapped up. And me, I'm gonna do what's wrapped up and me, I'm gonna do what's wrapped up and me, I'm gonna do what's right for the country. I'm gonna do right for the country. I'm gonna do right for the country. I'm gonna do. What's right, nobody's gonna come to me, what's right? Nobody's gonna come to me. What's right? Nobody's gonna come to me and say Donald, I gave you five million and say Donald, I gave you five million and say Donald, I gave you five million dollars and I hope you're gonna remember dollars and I hope you're gonna remember dollars. And I hope you're gonna remember that and I hope you're gonna do that and I hope you're gonna do that. And I hope you're gonna do something that maybe it's not so good, something that maybe it's not so good, something that maybe it's not so good for the country, but it's good for him or for the country, but it's good for him or for the country. But it's good for him or her and it's not gonna happen that way her and it's not gonna happen that way her and it's not gonna happen that way. We're gonna do what's right. So I'm - we're gonna do what's right. So I'm - we're gonna do what's right. So I'm self-funding my campaign. I'm not taking self-funding my campaign. I'm not taking self-funding my campaign. I'm not taking contributions. I tell you what I would contributions. I tell you what I would contributions. I tell you what I would have had the biggest, the biggest super have had the biggest, the biggest super have had the biggest, the biggest super PAC you have ever seen with the money PAC you have ever seen with the money PAC you have ever seen. With the money I've turned down, where I tell people I - I've turned down where I tell people I - I've turned down where I tell people, I don't want it, I don't want it. I can't do, don't want it. I don't want it. I can't do. Don't want it, I don't want it, I can't do it and I'm turning down friends. I it - and I'm turning down friends. I it and I'm turning down friends. I wouldn't even do anything for him. I'm wouldn't even do anything for him. I'm wouldn't even do anything for him, I'm gonna do what's right. Anyway, I was gonna do what's right. Anyway, I was gonna do what's right. Anyway, I was actually with a group in Iowa about two actually with a group in Iowa, about two actually with a group in Iowa about two months ago, big group probably 4,000 months ago, big group probably 4,000 months ago, big group, probably 4,000 people. And I said, listen, I feel so people and I said, listen, I feel so people and I said, listen, I feel so foolish not taking all this money, that's foolish not taking all this money, that's foolish not taking all this money that's been you know when you're Number one been, you know when you're number one been, you know when you're number one, I've been number one practically from - I've been number one practically from - I've been number one practically from the time I announced and June 16 big day the time I announced and June 16 big day, the time I announced and June 16 big day, that's when I talked about illegal. That's when I talked about illegal, that's when I talked about illegal immigration man, did I get hit? I talked immigration man, did I get hit? I talked immigration man, did I get hit? I talked about that and then people found out hey about that and then people found out hey about that. And then people found out, hey, he's right and we've been right about a - he's right and we've been right about a - he's right. And we've been right about a lot of things. We've been right about a lot of things. We've been right about a lot of things. We've been right about a lot of things. We've been right about the lot of things. We've been right about the lot of things. We've been right about the military. We've been right about military. We've been right about military. We've been right about terminating Obamacare and coming up with terminating Obamacare and coming up with terminating Obamacare and coming up with a much better solution and a lot less - a much better solution and a lot less - a much better solution and a lot less expense for the People - but we've been expense for the people, but we've been expense for the people, but we've been right and I will tell you that from the right and I will tell you that from the right and I will tell you that from the time I announced it Was - it has been a time I announced it was - it has been a time I announced it was - it has been a fabulous experience. And when I was fabulous experience and when I was fabulous experience and when I was talking to these 4,000 people and they talking to these 4,000 people and they talking to these 4,000 people and they were great people, I said, look, let me were great people. I said, look, let me were great people. I said, look, let me take the money, take the money, take the money, I did my a poll much more accurately. I did my a poll much more accurately. I did my a poll much more accurately than the - than the - than the guys can do pasta. I mean, I did - the guys can do pasta. I mean, I did - the guys can do pasta. I mean, I did the greatest poll, 4000 people from Iowa. I greatest poll 4000 people from Iowa. I greatest poll 4000 people from Iowa. I said, let me take the money I feel so said, let me take the money. I feel so said, let me take the money. I feel so foolish not taking it. It's millions of foolish not taking it. It's millions of foolish not taking it. It's millions of dollars, millions. I would have made jeb dollars millions. I would have made jeb dollars millions. I would have made, jeb Bush's to 125 men. Can you imagine he Bush's to 125 men, can you imagine he Bush's to 125 men? Can you imagine he spent 125, he's got a hundred and twenty spent 125, he's got a hundred and twenty spent 125, he's got a hundred and twenty five he's spent like 70 or 78 or 80 and five he's spent like 70 or 78 or 80 and five. He's spent like 70 or 78 or 80, and he's like doing terribly - I'm in first, he's like doing terribly - I'm in first, he's like doing terribly - I'm in first place. I haven't spent anything place. I haven't spent anything place. I haven't spent anything practically now. I'm gonna spend two practically now I'm gonna spend two practically. Now I'm gonna spend two reasons. Number one, I feel guilty number reasons. Number one, I feel guilty number reasons. Number one, I feel guilty. Number two, I don't want to take a chance. Does two, I don't want to take a chance, does two, I don't want to take a chance. Does that make sense? So I said to this group that make sense. So I said to this group that make sense. So I said to this group four thousand people I said, so everybody, four thousand people I said, so everybody, four thousand people I said. So everybody ready. Can I take the money, I promise it ready. Can I take the money? I promise it ready. Can I take the money? I promise it won't have any influence. They all stood, won't have any influence. They all stood, won't have any influence. They all stood up and they booed don't do. It don't do up and they booed don't do it, don't do up. And they booed don't do it, don't do it no, no, because they're smart because it - no - no, because they're smart because it - no - no, because they're smart because they're smart. And then I said who in the - they're smart. And then I said who in the - they're smart. And then I said who in the room says it's okay for me to take the room says it's okay for me to take the room says it's okay for me to take the money. There was one person in the very money, there was one person in the very money, there was one person in the very back of the room actually looked like a back of the room actually looked like a back of the room actually looked like a very sleazy Character stood up and said very sleazy character stood up and said very sleazy character stood up and said you could take. So I was amazed actually you could take. So I was amazed actually you could take. So I was amazed actually and and you know my people told me that and and you know my people told me that and and you know my people told me that would make - I've actually had some people would make, I've actually had some people would make. I've actually had some people that if you're rich, that you can do that, that if you're rich, that you can do that, that if you're rich, that you can do that, that would be an amazing thing because that would be an amazing thing because that would be An amazing thing because it would be a big advantage. I never knew it would be a big advantage. I never knew it would be a big advantage. I never knew it was going to be that big of an - it was going to be that big of an - it was going to be that big of an advantage, but a lot of people respect. Advantage, but a lot of people respect advantage, but a lot of people respect the fact that I'm self-funding my - the fact that I'm self-funding my - the fact that I'm self-funding my campaign because they know I'm gonna do campaign because they know I'm gonna do campaign Because they know I'm gonna do what's right, I often tell the story of what's right. I often tell the story of what's right. I often tell the story of Ford moving into Mexico and they won't Ford moving into Mexico and they won't Ford moving into Mexico. And they won't do that. I mean, there's so many people do that. I mean there's so many people do that. I mean, there's so many people representing Ford that some politician representing Ford that some politician representing Ford that some politician that relies on money coming and Nabisco that relies on money coming and Nabisco that relies on money coming and Nabisco moving into Mexico. Their big plan from moving into Mexico, their big plan from moving into Mexico, their big plan from Chicago, there's so many people, Chicago, there's so many people, Chicago, there's so many people representing companies like Nabisco and representing companies like Nabisco and representing companies like Nabisco and Ford That believe me, they have a Ford that believe me, they have a Ford that believe me, they have a tremendous power over the politicians, tremendous power over the politicians, tremendous power over the politicians you're like puppets. Just like puppets, you're like puppets just like puppets, you're like puppets just like puppets. So I'm gonna do it a way that hasn't. So I'm gonna do it a way that hasn't. So I'm gonna do it a way that hasn't been done before maybe or maybe been done before maybe or maybe been done before maybe or maybe certainly hasn't. I mean on either side certainly hasn't - I mean on either side certainly hasn't - I mean on either side, everybody is taking money from all these. Everybody is taking money from all these. Everybody is taking money from all these different groups, whether it's the oil different groups, whether it's the oil different groups, whether it's the oil people or whether it's any people that people or whether it's any people that people or whether it's any people that you talk about. The retailers, every group you talk about the retailers, every group you talk about the retailers, every group is well covered and every one of these is well covered. And every one of these is well covered. And every one of these people is not going to necessarily do - people is not going to necessarily do people is not going to necessarily do the right thing for the people for the - the right thing for the people for the - the right thing for the people. For the country, for the United States, they're country for the United States, they're country for the United States. They're gonna do the right thing for the company, gonna do the right thing for the company, gonna do the right thing for the company. They represent - or the company they own a - they represent or the company they own a - they represent or the company they own a piece of or own in its entirety piece of or own in its entirety piece of or own in its entirety. So you're gonna get a really fair shake, so you're gonna get a really fair shake. So you're gonna get a really fair shake from me and you know, I just - I just tell from me and you know I just - I just tell from me and you know I just - I just tell you very strongly that's the way it is. You very strongly - that's the way it is you very strongly. That's the way it is. One of the things we're going to do, I - one of the things we're going to do, I - one of the things we're going to do, I know the greatest business, people in the know the greatest business. People in the know the greatest business people in the world. They come from New York, Carl Icahn world. They come from New York, Carl Icahn world. They come from New York. Carl Icahn is backing me, 100 %. Endorsing me is backing me 100 %. Endorsing me is backing me 100 % endorsing me. He's already endorsed me. But many of the - he's already endorsed me, but many of the - he's already endorsed me. But many of the other business people they want to other business people, they want to other business people. They want to - nobody knows who they are. That's one of nobody knows who they are. That's one of. Nobody knows who they are. That's one of the problems. I mean, it's like, oh, I want the problems. I mean, it's like, oh, I want the problems. I mean, it's like - oh, I want to endorse you. I'd say nobody knows who to endorse you. I'd say nobody knows who to endorse you. I'd say nobody knows who you are, but I know who they are. They're you are. But I know who they are, they're you are. But I know who they are, they're killers. But this is what we want killers, but this is what we want killers, but this is what we want negotiating for us. We want these great negotiating for us. We want these great negotiating for us. We want these great negotiators, these great people negotiate negotiators, these great people negotiate negotiators these great people negotiate. We're losing 400 and been so ridiculous. We're losing 400 and been so ridiculous. We're losing 400 and been so ridiculous. It's actually much more - it's actually - it's actually much more - it's actually - it's actually much more - it's actually now I believe had over 500 billion now, I believe had over 500 billion now I believe had over 500 billion dollars in a trade deficit with China dollars in a Trade deficit with China dollars in a trade deficit with China 500 billion dollars, we can't lose that 500 billion dollars. We can't lose that 500 billion dollars. We can't lose that money. We're losing tremendous amounts of money. We're losing tremendous amounts of money. We're losing tremendous amounts of money with Japan. We're losing tremendous money with Japan. We're losing tremendous money with Japan. We're losing tremendous amounts with - with Mexico where we're amounts with, with Mexico where we're amounts with, with Mexico where we're gonna create a very strong border. We are gonna create a very strong border. We are gonna create a very strong border. We are gonna build a wall and by the way Mexico gonna build a wall and by the way Mexico gonna build a wall. And by the way Mexico is going to pay for the world just in is going to pay for the world. Just in is going to pay for the world just in case you had any questions and the case you had any questions and the case you had any questions. And the reason they're gonna pay for the was reason they're gonna pay for the - was reason they're gonna pay for the - was very simple. They make a fortune very simple. They make a fortune very simple, they make a fortune, they make so much money. Mexico on trade, they make so much money, Mexico on trade, they make so much money. Mexico on trade deficits with us, they make so much money deficits with us. They make so much money deficits with us. They make so much money. The wall is peanuts, the politicians come the wall is peanuts, the politicians come the wall is peanuts, the politicians come up to me and make sure you can't build a up to me and make sure you can't build a up to me and make sure you can't Build a wall, can you of course you can the Great wall. Can you of course you can the Great wall. Can you of course you can. The Great Wall of China was built 2,000 years ago. Wall of China was built 2,000 years ago. Wall of China was built 2,000 years ago, 13,000 miles here, we need a thousand 13,000 miles. Here we need a thousand 13,000 miles. Here we need a thousand less because we have natural barriers we less because we have natural barriers we less because we have natural barriers, we need a thousand miles which is nothing need a thousand miles, which is nothing need a thousand miles, which is nothing, it's nothing. And the cost is nothing, it's nothing and the cost is nothing, it's nothing. And the cost is nothing compared to what we're losing people are compared to what we're losing people are compared to what we're losing. People are pouring through and I want people to pouring through. And I want people to pouring through and I want people to come into the country, but I want them to come into the country, but I want them to come into the country. But I want them to come in legally. They have to come into come in legally. They have to come into come in legally. They have to come into the country legally the country legally the country legally. So I know this is a very specific group. So I know this is a very specific group. So I know this is a very specific group, but I don't want to keep you very long, but I don't want to keep you very long, but I don't want to keep you very long and we're gonna have some interesting and we're gonna have some Interesting and we're gonna have some interesting things to say today at another meeting, things to say today at another meeting, things to say today at another meeting. But this was an important meeting and I - but this was an important meeting and I - but this was an important meeting and I wanted to let you know how I feel and wanted to let you know how I feel and wanted to let you know how I Feel and I've been that way for a long time and I've been that way for a long time and I've been that way for a long time and your representatives have been great. Your representatives have been great, your representatives have been great because when I was here four weeks ago, I - because when I was here four weeks ago, I - because when I was here four weeks ago, I mean they took me into plants. I said mean they took me into plants, I said mean they took me into plants, I said enough already. Okay. You've convinced me enough already. Okay, you've convinced me enough already. Okay, you've convinced me, I don't want to see any more plants. I - I don't want to see any more plants. I - I don't want to see any more plants. I don't need to see any more. I believe me, don't need to see any more. I believe me, don't need to see any more, I believe me. But I think it's great actually it's - but I think it's great actually it's - but I think it's great actually it's amazing and incredible what you do and amazing and incredible what you do and amazing and incredible what you do and how you can do this. And the whole, how you can do this and the whole, how you can do this and the whole process of the plants and the creation process of the plants and the creation process of the plants and the creation of this field is fabulous. So I'm with of this field is fabulous, so I'm with of this field is fabulous. So I'm with you 100 %, you 100 %, you 100 %. I wish you a lot of luck and I will come. I wish you a lot of luck and I will come. I wish you a lot of luck and I will come down and I think we're going to say down and I think we're going to say down and I think we're going to say hello to some of the people in the early hello to some of the People in the early hello to some of the people in the early rows and it's a great honor, a great rows and it's a great honor, a great rows and it's a great honor, a great honor and good luck and get out there honor and good luck. And get out there honor and good luck and get out there and make plenty of fuel because we're - and make plenty of fuel because we're - and make plenty of fuel because we're gonna need it. Eventually we're going to gonna need it eventually. We're going to gonna need it eventually, we're going to really need it. Thank you very much. Thank really need it. Thank you very much. Thank really need it. Thank you very much. Thank you. Thank you."}