{"id":473,"author":"Donald Trump","title":"Speech: Donald Trump in Concord, NH","date":"2016-01-18","link":"https://factba.se/transcript/donald-trump-speech-concord-nh-january-18-2016","paragraphs":["I love the veterans, everybody. We love Al. Steve. Hi Steve. So I want to thank you all for being here. It's a -- It's been an amazing journey for me and for you and for all of us. We're taking our country back. The level of love the level of everything. Everything. When I go around to places it's always like this.","It's always for whether it's an arena or whether it's a basketball court whatever it is. It's always full and there's even more people pouring in right now as we speak. Should we wait 20 or 25 minutes? No. Right? So I just I really appreciate it. It's been -- it's been so incredible. So we had the debate the other night and the debate was good.","The debate was good. Who? Who watched the debate? Who? So this is a slightly political crowd. You know they always say the pundits who really don't know a damn thing about what they say, \"Well, do you think they'll vote for Trump?\" Now, some people we had a couple of cases in Lowell and different places they were -- Sit down everybody.","Sit down. Sit down. Very comfortable. It's more comfortable. I see they can't sit down. We need an extra space so we took chairs out of the room. But we had -- Thank you very much. Nice guy. So we have a lot of different places and it's -- it's just incredible. But we were in Lowell and the people waiting -- some people in the -- Remember the freezing day?","They're waiting five, six, and seven hours and then the pundits who say, \"Do you think they're going to vote?\". They stand up for seven hours outside in the cold. I think people are going to vote and I think you know there's actually -- there's actually a theory that, for me, you know, it works both ways.","But for me, and there's a big theory out there that the polls are fantastic but that we're going to do even better than the polls because people are, you know -- We're going to outperform the polls and I -- I actually think -- I actually think that's a the way it is. So we had to debate a lot of things were determined in the debate.","It was very interesting. You know I've never debated before. I do jobs, I create jobs. As politicians, it's all talk no action. It's all the same. But we -- we did a -- we had a great time and a lot of good things came out of the debate and we're going to talk about those things. When I told my people I said, \"Because this is sort of a very intimate group even though it's a lot of people.\" What we'll do is we'll ask some questions a little bit later on. Do we want to do that?","OK. I like it. I like it. I mean to me it's interesting. I don't have to just speak for an hour and then get off. I like when I get two questions and I learn from the questions. So it's one of those things. So I'm just going to go over a couple of things. New polls came out. Trump is killing and we just killing.","This is, I tell you the polls because I don't want you wasting your time. Because if we weren't it's like not as exciting, right? And everybody -- every one of my competitors say I shouldn't mention the polls but that's because I'm in first place. From the day we started virtually, we'd been in first place.","So anyway, Wall Street Journal, NBC, Trump has 33%. Second place is 19 or 20. The, CBS, New York Times, 35% second place -- I'll tell you what? You get down into the teens and low teens and we're in great shape. Ah, oh and, we have a 41 to 20. Forty one, that's a lot. I-- I take 41. I always say, I would take 41 even if we had three people.","But when you think we have 41 and we have like, I think when the poll was one week ago it's probably 14, 15 people. You know they're dropping out one by one by one. I love to see them drop out it's like, right? My carpenter. This is my carpenter over there. The Reuters poll. Great poll. Forty two. We've been traveling between 40 and 42 but 42 to 12. Wow, it's a big lead.","We got -- we got to go a long way to blow that kind of a lead. You know that's one of those heavy sportsmen the golfers they say, Johnny he's just looking for the clubhouse. I'm looking for the clubhouse. I wish the election were like today. I would I really do. I wish the election were today. Now in some countries you can do that.","You call the election. If I were president right now I'd be calling the election I want the election to be immediately. So anyway, so what's happened is we have and it's the day it's this is Martin Luther King Day, right? So we have we like that. We like that. So in South Carolina one other 35% to 15% and in Iowa CNN 33% to 20. I'm leading by the way.","You know you don't hear that. They never quote -- they never quote the CNN poll. They always like to quote other polls where they're are a lot closer or whatever but would do on. I think we're going to do very well I think I was going to be a tremendous success. We're up there all the time. I'm going there tomorrow.","I'm going there the next day I'm coming back here. You're going to be -- you're going to see me so much in New Hampshire you're going to be so tired of me, you're going to say. Keep that guy out. Keep him out of here. But we have to win. You know we have to win. I mean, it's sort of interesting because I look at the different candidates and I'm starting to spend money only because I feel guilty.","I honestly. You know you have a poll like that where you're 33 and 42 to 12. I see one 42 to 12. And yet somebody said, \"Why are you spending money?\" I have to spend because; number one, I don't want to take any chances, and number two, I do feel guilty a little bit. You look at Bush he spent $69 million.","Sixty nine. He's in favor of Common Core. I'm totally against Common Core, by the way. You got to be against it. A guy like him he's weak on immigration. So I say, \"How do you win when you favor Common Core?\" He wants your children to be educated through Washington, through the bureaucrats who are making lots of money, $250,000 dollars, that's not going to happen in New Hampshire.","It's not going to happen in Iowa. It's not going to happen in South Carolina but it just doesn't make sense. And then to top it off, every week, remember they come in as an act of love, right? They come across the borders as an act of love. You can't do that. So -- so doesn't work. So we'll see. But he spent 69 million and I've spent essentially nothing.","I mean almost nothing. And. That's what we need for our country we need as an example, right? That's the kind of -- Right? We need -- like as an example on education, all very important. Everybody here believes in education strongly. And we're No. 1 in the world in spending per pupil, by far.","Right? By far. We're so far ahead of everybody else in terms -- No. 2 isn't even close. OK. But we're No. 28 in terms of results. So we -- we're No. 28 in the world. As a country, No. 28 in the world but we're No. 1 in spending. So in the campaign I'm reversed. I'm No. 1, by far, and I've spent at least.","And they actually had a graph the other day in the Wall Street Journal which was interesting, it was a big circle and they had the money spent and the result. And they said, \"Trump is least the money spent.\" So I'm least here and best result. Isn't that great? Isn't that great? And I love telling that story because that's what we need.","But the problem is I'm going to start spending some money because you know I'm 37 million under budget. Can you believe that? I thought I'd have a stroke. And here's the other thing. And this is so important tell your friends, I'm spending my own money. I'm spending my own money. I'm not relying on the lobbyists and the special interests and all the guys that are going to tell you a local politician or whoever is running to do what I say to do. \"I gave you $5 million Hillary and I want you to do what I say to do.\" That's what happens.","That's what happens. Believe me, that's what happens. Hillary's raised a tremendous amount of money from special interests and from lobbyists. Jeff. Every one of them. Every one of them. Every one of them they've raised a lot of money and they're like puppets. Believe me, they're like puppets. You know I always tell the story about the Ford plant.","They'll never do the right thing because somebody will have given them money either an owner or a shareholder or a lobbyist or a special interest and they'll never do the right thing. I talk about Nabisco. They'll never do. Nabisco is moving to Mexico. Ford is moving a big plant to Mexico. All of these things.","Nabisco is taking their big plant out of Chicago. They're moving it into Mexico. So what are we going to do? We're not going to have any more Oreos, which is good, which is good. Which is very good. So just a couple of things before we answer questions but I just -- we have to get it off our minds. You look at this Iran deal where $150 billion we get our prisoners back.","But they get far more back than we do. They get 14 of Interpol which are serious people. These are seriously bad dudes on Interpol. You know these are serious bad. They get access to oil, they can sell oil, they get access to free, they get everything. We get nothing we get nothing. And this is what happens.","And then last week. What did we see last week? The sailors. Ten sailors. They get what happened now. How bad was that? What you think? Do you ever see it? So they're put in a begging position with their hands up guns to their head over nothing. Instead of let's fix your engine and get you out of here. A big deal.","They had a thug screaming orders to him. I guess you heard that. And we just can't let this. We can't let this stuff happen with our country. We're being scoffed at. We're being laughed at. Now you get back down to trade and you look at what's happening and how we're being sucked dry and the people of New Hampshire and the people frankly of New England.","Do we love Tom Brady, by the way? Do we love? Right? You see the greatest? You see the other game. It's so nice. You know and I have friends we own teams and Bob Kraft is a great owner and you have a great coach and Belichick. But you know, I just watched bing, bing, bing, bing, touchdown.","Boom, boom. Then I have other friends, they have quarterbacks. Ay yay, yay. Interception, problems, fumble. Brady, you're lucky to have -- Brady is my friend but you're lucky. So -- So we've got to do some things. You know one of the bad parts about the deal is you going to now have $150 billion for four people.","You're going to have a lot of things happening that bad. So this morning I understand they did three kidnappings in -- in Iraq. They're going to say, well give us billions. Give us billions. You know once you do this and once you allow this to happen it's a very, very bad thing going on. It's very bad. And when they see the weakness and the stupidity of our leaders it's not a good situation, folks.","We have to change and we can change fast. We can change gears like you wouldn't believe. We're going to make our military so strong so powerful. Nobody is going to ever mess with us again. We're going to work with the vets. You know the vets are taking -- and you have so many vets up here. The vets are going to be taking care of great as opposed to poorly.","Right now -- Stand up, Al. Stand up. This guy has been with me. Al has been with me from the beginning. I hope we went out because I'm never forgetting you man. Every time I make a speech and he's there really representing the vets and he's a powerful guy and they love him and I love him too but he -- Stand up, Al, just stand up by yourself.","Right. Stand up. Turn around, Al. See how handsome he is. We. Appreciate it, Al. He's just so many of my rallies just about all of them. And he's here not for me, he's here because he loves the vets and he really is a great representative and we should all have. We should all be so lucky, I will tell you that.","But we're going to take care of our military. We're going to take care of our vets. We're going to get rid of Obamacare. It's going to be gone. It's going to be terminated. And it's going to be replaced with much less expensive much better health care. We're going to get a much -- I don't know if you notice.","I mean, I'm sure you do but the premiums, right? Twenty-five percent up, 35% up, 45% percent up. Deductibles through the roof so you can never use it. I mean, unless you get hit by a total tractor, it's up, you can't use it. No the deductibles are so high. I get more complaints about the deductibles than I get about the the increase because you can't use it. There's nothing to use.","You got to be, I mean, literally you have to be dead. It's a -- it's a very bad thing. So Obamacare is going to be repealed and replaced. And that's going to be it. Amazing. We're going to have borders and the borders are going to be strong borders and people are going to come into the country legally. They're going to come in legally and we're going to build the wall, folks.","We're going to build a wall. And you know you have tremendous problems. You have tremendous problems with the drugs in this area. It's amazing to me when I come to New Hampshire I hear more about the drug problem and the addiction and all of the drugs pouring in. Than I do most other places. I don't even understand why.","But it's one of the most important things. And that wall is going to stop so much of it. And then we're going to help the people that are so addicted that they can't because I -- I speak with parents and their children are in bad shape and they're really addicted. It is really, really a big thing to get off.","It's hard. The easiest way to get off is to never start. So like me, I never smoke. I never smoke. If you don't smoke. It's easy not to smoke. If you do smoke, I have friends they -- they smoke, they would they're always giving up cigarettes. They always giving it up. For 25 years that guy's been giving up cigarettes.","But if you never start and we have to get the kids not to start and the people, generally. Not to start. The ones that are already hooked, we've got to get them help and we're going to do a lot of things to help them as much as we can and we'll try and get that all but I -- I know a lot of people in New Hampshire their children are hooked.","And we're going to work -- we're going to work like hell to get that -- to get them unhooked because we have to. And the best way the best thing we can do though. For the rest, we've got to keep him out of here. And one of the reasons we keep him out is strong, strong borders. OK. And you know I -- I say in all of a sudden the other day I heard somebody say, \"We're going to build a wall.\" I said, \"Where did that come from?","Nobody ever said that before but me.\" But they like the way it sounds they have no idea where to begin. They have no idea how to do it, whereas with me, it's easy. That's like easy when you build buildings like I build buildings believe me walls are easy. No windows, no nothing, pre-cast concrete gone very high.","Let's see about a little higher than that. It's pretty high ceiling in here. But we'll go a little higher than that. You ever see the walls they have now? They're this high. And they have ramps and the ramps and the jeep goes right over the top. Loaded up with drugs they go sell the drugs they come back with cash.","Not a good deal. It's not a good deal. We also have a problem with trade. I know the greatest dealers in the world the greatest absolute businessmen. Carl Icahn endorsed me many of the other ones want to endorse me. They will be very soon. We're actually getting a big endorsement on Tuesday it's going to be a lot of fun but we're getting a great endorsement on Tuesday.","Something big is going to happen but we're getting a lot of people that want to endorse you. It's amazing. All of a sudden they're saying, \"Oh, wait a minute. Trump is beating Hillary in the polls and Trump is looking pretty good.\" And all of a sudden everybody wants to endorse people that sort of didn't know you around.","You know they would go with the establishment stuff the establishment is not working, folks. You just have to take a look at what's happened to the country. Establishment is not working. Nobody knows the politicians better than I do. Believe me it's not going to work. It's not going to take us to the promised land that I can tell you.","So we are going to get some unbelievable endorsements over the next little while. And I've never been a huge fan of endorsements. I always think it's the person much more so the endorsements. But we have a couple of coming up that are really fantastic. One in particular which we love. So what are the things I want to talk just quickly about this trade and then we're going to questions.","Trade? China is making $500 billion a year. We have a deficit. Is that trade? That's not trade. That's being foolish. That's being stupid. That's robbery. I often say that, I often say. What China -- and I get along great with China the biggest bank in the world is attendant to one of my buildings from China.","I sell condos to China to Bank of America building in San Francisco one of the great buildings of the world. Got that through China. I mean I have a great relationship which I've made a lot of money with China. We can make money with China too but we don't have the right people representing us. We have the wrong people we have people that don't have a clue.","They don't have a clue. And China's good and Mexico's good, they're great. But their leaders are too smart for our leaders. Our leaders don't have any idea what's happening. And with China, somebody shot a robbery, robbery. Honestly, it's the greatest theft that has ever taken place in the history of the world.","What China has done to this country. Thousands and I mean, when you say thousands, millions of jobs have been lost. Millions, millions of jobs. Thousands and thousands of factories and manufacturing plants have closed because of what's going on. And then they make this stuff and they sell it in. And there's no tax no nothing.","But when you make your product in New Hampshire or anywhere else and you want it to go to China you can't get it in there. You can't get it in. They won't take it. And if they do take it they charge you a lot of tax. Believe me and I'm really aware of it. Nobody knows it better than you know what I'm talking about sir.","Is that right? Stand up, because you know because you've been there. Yeah. And -- and we make better products. That's right. Hey, do you remember somebody brought this up the other day? Do you remember? Some of you are too young for this stuff but some of us unfortunately are old enough that we remember it. It used to say proudly made in America or made in the U.S.A. Right?","You don't see it anymore. And then you'd have tags made in Japan. And that was the chiefs. That was the bad stuff. That was the cheap stuff. It would say Made in Japan and it was all made in Japan. But we used to have made in America made in the U.S.A. and that was an unbelievable tag. We don't have that.","Do they have that anymore? How do you receive any more? It doesn't say made. We're going to put made in the U.S.A. We're going to put made in America. We're going to have it back. So here's what's happened. Trust me the -- the trade is going to be so good. I'll take a car like and I'll take some of these guys that are the best in the world.","I'll say, check out China please trade agree. They will be sold. They don't want money. They just want to do something. You know believe it or not. These people love the country so different they're very rich. They don't want salaries they don't want anything. They want to help. And it's so easy for them it's like second nature.","They love it. For them it's a game and they love the country but it's a game and there won't be any more China making $500 billion. Think of it a trade deficit of $500 billion. What kind of a deal is that? Then you hear our president say, \"Our trade partner.\" What kind of a partner? I don't want a partner like that.","We got to get it to neutralize. Even I said, \"Maybe we can even make something if we're really smart. Watch. Watch what happens. OK. Because we have the best people in the world. Now. What happened is when Paris was so horribly hit, all of a sudden my poll numbers went up 11 points. Remember? Because everyone thinks that Trump is going to be tougher and sharper and all that and I believe me, I am, and trust me, I am. But all of a sudden my poll numbers went and that's when they went into the 40s and I didn't know I said, \"What happened?\" And they said, \"Paris.\" So what happened in Paris.","And it was a problem that I've been talking about. Radical Islamic terrorism. And you know what? We have a president that won't even mention the term. He won't talk about it and unless you talk -- Well, unless you talk about it unless. Now here's the problem with booing, the press will turn that around and say, \"Trump got booed at the event.\" . Because they are the most dishonest people on earth.","OK. See that booing, I love to hear that booing because that means you agree with me. But they'll turn around say, \"Do you know the Trump got booed today, oh, oh.\" And I'd say, \"I didn't got booed.\" It was -- Right? It was like a love fest. I said we have a love fest. But oh, they are dishonest. Thank you.","So nice. Thank you. So nice. Thank you. Thank you. So great. All right. Well now they'll have a hard time saying it but they'll figure a way to do it anyway. OK. These people they are bad people let me tell you. So a couple of things, we're going to solve trade. Trade is going to be great but it changed because I announced on June 16th and almost from the beginning we've been No. 1. We've been No. 1 in every poll.","Now we're No. 1 by far on virtually every poll. But almost from the beginning. But you know, when I announced I was talking about trade, I was talking about Obamacare, I was talking about all these different things that were going to do, but all of a sudden I started saying, you know we're going to start talking heavy into security not just the border.","We're going to be really talking about security and we're going to be talking about ISIS because we have to blow them off the face of the earth. No, we have to. We have to. And I was against the war. I tell you what. It's a -- you know, I say it because it's a, you know, I have to think in terms of vision when you vote for somebody.","But the truth is I was against the war said you're going to destabilize the Middle East at all. But then the way we left was so bad where Obama gets up and he announces the day that he's leaving. So the enemy says, really? They pull back. Wait till we leave. And now they go into town and we don't have Iraq.","Iran is taking over Iraq. I said you're going to destabilize. So Iran not only is getting the great deal with 150 billion plus. they'll be able to do whatever they want with the nukes they can buy the nukes they don't have to do anything with the kind of money they have. But they're taking over Yemen. Right?","They're going to take over Syria. They're taking over -- Most importantly in a sense they're taking over Iraq. Iraq has the second largest oil reserves in the world. So I used to say they made a great deal for the 150 billion. That's peanuts because they're taking over. They've been after Iraq forever. Forever.","They'd fight with Iraq. They were the same. Boom, boom, boom. They'd fight for years and then rest. Then they fight then they rest. They couldn't get 10 feet they'd go the other would go. That's the way it was. Now we think they -- they just walked in we decapitated him and we left. And the way we got out was so foolish.","And you can just imagine General George Patton or General MacArthur talking about this stuff and going on television shows and talking to announcers as generals and what we're doing and what are -- I mean, we want to be unpredictable folks. We have to be unpredictable. We're so predictable. We have people telling radio announcers what we're going to do. We have a president that says when we're leaving.","We have a president that sent about two months ago 50 soldiers over, our finest, send 50 soldiers over to Iraq and to Syria. And what did he do. He announced we're sending 50 soldiers now they have a target on their back. They have a target on their back. Why is he doing that. Why can't he just send them.","Frankly, it doesn't send. It doesn't sound good to say we're sending 50 anyway. It's not over. But why can't you just send them. Why does he have to say we are sending 50 soldiers. Now these guys these are not stupid people. Now they are looking for those 50 men and women. It's terrible. It's just terrible.","And we have to be unpredictable. We have to do what they think we're not going to do. We have to do that. When I said the oil. And you know I've been saying the oil for three years. Everyone say, \"Oh, you can't do the oil.\" So why can't you do the oil you're going to take the wealth away. Now I actually said take the oil when we leave before it is all destroyed.","Right? Everybody knows that. I was thinking of taking the oil and I don't mean just bombing it. I mean taking it. So then about four months, five months ago they would say, \"Well what are you going to do? Well, I don't want to tell you. I'm saying, \"I don't want to tell you.\" They said, \"Oh you don't know the answer.\" You know these wise guys you don't know the answer.","And by the way, did I win the debate or what? Did we? Right? But you know. The wise guys, they're saying, \"Well you don't know. Maybe you don't know the answer. Maybe you don't know.\" I say, \"I know the answer but I don't want to really tell you these answers because I have a real chance of getting elected and if I get elected I don't want the enemy to know all this stuff.\" Right?","But it got so bad. You know you still have to get there, you still have to get there. So about probably a year ago I said, \"Take the oil. Bomb the oil. Take the oil. Give some of the oil to the wounded warriors and to the parents of soldiers that are lost. Parents of soldiers that were killed in Iraq. Give them some.","It's peanuts compared to what the value is. Spread it around, take care of our wounded warriors, take care of our vets and take care of families that lost sons and daughters.\" And what do we end up with? Take care of them. Just take care of them. And you know. Just so sad to see it. And then they all said I remember Obama had some of the generals commenting on my plan.","Oh that won't work. Well as soon as Paris happened they started bombing the earth. They should have been done years ago but they want a bomb. I want to bomb, but I want to take. I want to bomb and I want to take and we'll do a little ring around, there will be just fine. I want to take the oil. OK? But you know.","The -- the sad part is that I have to tell everybody what it is you know because it's that's I guess the system in which we live. If I don't say that they'll say what Trump doesn't we have a plan. And I really said, \"I'll never forget.\" Probably six, seven months ago they would say, \"Well, what's your plan?\" \"I'd rather not tell you.\" That doesn't play well in a democracy.","Right? But I'd rather not tell you. \"Please tell us what it is, you must tell us. Oh, you don't have a plan.\" So finally I said, \"Look, you're going to bomb.\" and actually the guy -- I was telling it to the announcer. That's a good idea. I said, \"It's a good idea.\" Now you know Obama didn't want to go full scale in the deal and this I hear is true.","I don't know maybe it's hard to blame because he didn't want to create environmental pollution. You do know that he didn't want to bomb the oil because of pollution. Look at Al, he's laughing. It's hard to believe isn't it. It is hard to believe. You know it's a true story. He didn't want to bomb the oil because if you bomb the oil, pollution we'll go to the atmosphere where we'll be thrown away into the system in about two seconds.","But pollution will go up and it'll be it. Now I -- I don't know, Al. I don't know if it's 100% true but I have heard that. And I'm not surprised because that's the way we're running things. We don't know what we're doing. So take the oil. Be strong to all of these things and we're going to have a country that's going to be so great again.","We have to bomb the hell out of them. We have to bring our troops back home. We have to be paid -- All these countries you know we're protecting we have a budget that so many times higher than No. 2 because we're protecting Japan, we're protecting Germany, we're protecting South Korea against the maniac in North Korea we're protecting Saudi Arabia.","How wealthy is Saudi Arabia? We're protecting. They pay us peanuts. Peanuts. We can change this whole thing around fast. But you have to put a guy like me, believe me. You have to put a guy like me. And -- and just -- OK. Are you ready? Here's a quiz. Here's a quiz. You ready?","Who is going to pay for the wall? Mexico. Mexico is paying for the wall. Now the politicians come up to me during the debate. One of them came, \"Don, you know Mexico's not going to pay for the wall.\" I said, \"Of course they are. They're making a fortune. We have a trade deficit.","You wouldn't believe it. They're making a fortune. They took Ford, they took Nabisco they taking it all out. Of course they're going to pay. That's peanuts. And the wall is peanuts too. You know the wall is a thousand, basically, it's 2,000 miles across. But we only need a thousand miles of wall, OK. Even less.","But let's say a thousand, we went to super duper job. Right? We want one that absolutely we want no wrinkles. But we're going to do a wall. It's going to be a thousand miles. So China. Right? Great Wall of China. China, 2,000 years ago, built a wall that's 13,000 miles long, 13,000. And that wall is seriously big by the way.","You look at that sucker. You're not getting through that one easy. So what -- You know we have a little better material nowadays like a prefab. They didn't have prefab. They had -- they had stones over there. But China 20,00 years ago did this incredible job and they built a 13,000 mile wall.","We have a thousand miles. We could do it so fast so easy. But the guys the politicians have no idea. One of the reasons, you know, it was going to be built. But one of there is this another environmental story. One of the reasons it didn't get built. Now here's a wall for security for safety. One of the reasons it didn't get built is they couldn't get their environmental impact study approach.","Can you believe this? Meaning, a snake, a tortoise, a snail, something nobody knows more about environmental impact statements and make. Believe me. Can you get them through? You got to get it through. Sort of interesting. In the South China Sea. China's building islands, fortresses, they're building runways, military, and they have these massive excavators, massive.","In fact it's half the size of this room and they're scooping into the ocean. The South China Sea won't have any impact. Believe me. OK. They're digging and throwing and digging and building these massive islands in the middle of the sea. And we can't do a wall. It's crazy. And I said to a friend of mine from China.","I said, \"Let me ask you a question.\" And I was kidding. \"How long did it take them to get their environmental income, you know, income statement approved?\" But to get their environmental statements approved. \"How long did it take?\" And he looks at me says, \"Oh, we don't do that. We don't.\" Let me tell you.","They said, let's do it. You know when they started digging the following day with this country it's like let's go through 20 years of environmental research on a poisonous snake that we want to keep alive. OK. So we don't know what we're doing. So we're going to make our country great. It's going to be greater than ever before.","We're going to have a good time doing it. New Hampshire, I want to thank you because from day one everybody has said that you're with me and I love you. I love you. I love you. And we had a couple events like two weeks ago in New Hampshire where the weather was so bad. In fact my pilot said no Mr. Trump this is something you shouldn't do. What was that?","Is that a dog? Uh-oh, It's Hillary. Oh, only in New Hampshire. Right? That was a. First it was the screechy dog then it was a very serious dog. Right? Anyway, that's all right. Take good care of your dogs. But you know we had a case two weeks ago where the weather was so bad.","Two or three times up here. So tough, so -- that I shouldn't have that dick pilot said, \"Well you probably shouldn't do it.\" I said, \"How many people are there?\" Whatever it was. And he said, \"Where is it?\" I said, \"Corner of New Hampshire.\" I said, \"Those people have been so good to me. Really genius. Go get it. Go to it.\" And we landed we did our thing and we left.","We love New Hampshire and it's a great honor. Let's take a couple of questions. Go ahead. Where's the mics. Who's got the mics? We'll take some questions. Kevin, let's go. Who's got one right here. I know this lady. Good.","Hi.","Hi, Dee.","Right.","Right. I remember.","OK.","I know. And they want to go after people on Social Security. First of all, social security we're going to take back our jobs we are going to make our country rich again. We are going to save your Social Security. We will not going to do any cutting. OK. And I'm about the only one that says that. That's what going to happen.","Because you've been paying in you know you've been paying in to your Social Security so just rest assured and as far as Second Amendment what I love that question. We are going to protect. We are going to protect our Second Amendment. Nobody's going to touch it if I get elected. OK. Nobody's going to touch it. Thank you darling.","I appreciate it. One of the thing you know speaking to New Hampshire. You know they want to move you to the middle of the pack. Right. You know that right? For some reason. But there is a big move next time to move you to the middle of that. There's a great tradition and history to New Hampshire being right here.","Which really is the first voting stay. Then you have Iowa which is the great people with the caucus. But I will tell you that we are not moving you and we are not moving Iowa. You'll say I win. You're not moving. You're not moving. You know if you move all of a sudden you won't see anybody. That wouldn't be any fun.","Right? But you're not moving but there's a big move to move you back in to the middle of the pack. It's not going to happen. If I win it's not going to happen. Not going to happen. Zero chance. OK. OK. Let's go. Kevin go ahead. Give it to somebody.","Alex Jones he was a nice guy actually. You like him? I like you too. Alex was in Alex Jones nice guy. Go ahead.","How are you?","Hi, Haley.","Right.","Well many different people and they come from all over and the world, and they're all different. But one of the things and the one of the groups of people I talk about all the time and I know the greatest business people in the world. The greatest in the world. And we're going to use them for a trade deal now, folks.","We're not going to use a political hacks. So do we end up in these crazy deals. Where we lose our jobs, where we lose our money and we lose everything else. And the other thing is that administration with the V.A., we're going to get the greatest administration. We're going to put them in to the veterans administration.","We're going to take care of it. Military -- I'm going to find the right guys. We're going to find General MacArthur, We're going to find General Patton. Meaning, a young General Patton, A young General MacArthur. We're going to find great leaders in our military and then they're, you know, whether it's West Point or Annapolis or The Air Force Academy.","We have great people here, we don't use them. Maybe they're a little bit rough. Maybe they're one-time used, a bad word. So now he's not going to be a general even though he's 10 times better than anybody else. We're going to find our great people. And we'll going to use them. Maybe you'll be one of the those people someday.","And by the way, speaking of great people, I have my daughter Ivanka, come on. I have my daughter Ivanka here. Look at them they go crazy over Ivanka. Ivanka, that's crazier than they go over me. I don't like this. She wanted to come up to see new . Come on they want you to walk over, honey, come on. Come on. And Jerry come on up, come here Jerry, come here Jerry.","Jerry is a great Real Estate guy and Ivanka they're having a baby. Ivanka's eight months pregnant and she's wanted to come up.OK, come here, .","What a couple. Great couple. She's so great. Well, would you -- can you imagine if she actually going to put such something bad. That would be so exciting, I say, \" What the hell just happened?\" Well, So let's hear one more question, come on. Who has a good one. Whose got a good question. Who's got a really good question.","Whose got a really nice question. Go ahead, with the beautiful head of red hair. Oh, look at that hair.","Beautiful. Go ahead.","OK.","Good.","I know, I know.","Right, OK now, the most important thing is job because I must tell you. In -- in more than any other question, especially when I'm in certain areas like this, where it's rural. I get a question on schools. The kids are choking on debt. They're borrowing the money and what the colleges are doing is they're taking the federal money.","They don't view the kids. The kids are like a middleman. You understand that. So they get this loan and the colleges now all of a sudden is saying, \"Well, we're going to pay more to ourselves. We're going to -- .\" Do you see what's going on with cost of colleges? And the big loser on this is the children because the children have all of this debt and they're basically passing it on from the government to the college.","And the colleges make a fortune. The government is actually making money solely. The only thing the government makes on you. You know that. The most profitable thing, we're going to use something to get those course down but we're going to do two things. We're going to knock the hell out of the course because what they're doing in the college is really unfair, you understand what I mean.","It is raising it, raising it, it's going up like astronomically because they have all these money from the federal government thru the children. We're going to do something very, very profound. You're going to like me a lot, in about six months. Especially if I get in, you're going to really like me. OK, Thank you.","The other thing -- the other thing in this second part and -- and this is almost more important ultimately because you'll have kids maybe a daughter maybe a child, where they go out. They go to a college, they, you know put dead up to their neck, they can't breathe, they work hard, they get great marks, they're good students, they were -- And then they graduate.","They can't get a job. I'm taking our jobs back from China. I'm taking our jobs back. We're going to have so many jobs. I mean, you look at what NAFTA and with all those things. You look at what happened to New England, you look at what happened to New Hampshire. We're bringing our jobs back because ultimately, that's going to be the most important thing.","We're bringing --. We're not going to be the stupid people anymore. We're bringing our jobs back. OK. Thank you. Thank you everybody you are amazing people. I appreciate it. Thank you. Thank you. Love you."],"text":" I love the veterans, everybody. We love Al. Steve. Hi Steve. So I want to thank you all for being here. It's a -- It's been an amazing journey for me and for you and for all of us. We're taking our country back. The level of love the level of everything. Everything. When I go around to places it's always like this. It's always for whether it's an arena or whether it's a basketball court whatever it is. It's always full and there's even more people pouring in right now as we speak. Should we wait 20 or 25 minutes? No. Right? So I just I really appreciate it. It's been -- it's been so incredible. So we had the debate the other night and the debate was good. The debate was good. Who? Who watched the debate? Who? So this is a slightly political crowd. You know they always say the pundits who really don't know a damn thing about what they say, \"Well, do you think they'll vote for Trump?\" Now, some people we had a couple of cases in Lowell and different places they were -- Sit down everybody. Sit down. Sit down. Very comfortable. It's more comfortable. I see they can't sit down. We need an extra space so we took chairs out of the room. But we had -- Thank you very much. Nice guy. So we have a lot of different places and it's -- it's just incredible. But we were in Lowell and the people waiting -- some people in the -- Remember the freezing day? They're waiting five, six, and seven hours and then the pundits who say, \"Do you think they're going to vote?\". They stand up for seven hours outside in the cold. I think people are going to vote and I think you know there's actually -- there's actually a theory that, for me, you know, it works both ways. But for me, and there's a big theory out there that the polls are fantastic but that we're going to do even better than the polls because people are, you know -- We're going to outperform the polls and I -- I actually think -- I actually think that's a the way it is. So we had to debate a lot of things were determined in the debate. It was very interesting. You know I've never debated before. I do jobs, I create jobs. As politicians, it's all talk no action. It's all the same. But we -- we did a -- we had a great time and a lot of good things came out of the debate and we're going to talk about those things. When I told my people I said, \"Because this is sort of a very intimate group even though it's a lot of people.\" What we'll do is we'll ask some questions a little bit later on. Do we want to do that? OK. I like it. I like it. I mean to me it's interesting. I don't have to just speak for an hour and then get off. I like when I get two questions and I learn from the questions. So it's one of those things. So I'm just going to go over a couple of things. New polls came out. Trump is killing and we just killing. This is, I tell you the polls because I don't want you wasting your time. Because if we weren't it's like not as exciting, right? And everybody -- every one of my competitors say I shouldn't mention the polls but that's because I'm in first place. From the day we started virtually, we'd been in first place. So anyway, Wall Street Journal, NBC, Trump has 33%. Second place is 19 or 20. The, CBS, New York Times, 35% second place -- I'll tell you what? You get down into the teens and low teens and we're in great shape. Ah, oh and, we have a 41 to 20. Forty one, that's a lot. I-- I take 41. I always say, I would take 41 even if we had three people. But when you think we have 41 and we have like, I think when the poll was one week ago it's probably 14, 15 people. You know they're dropping out one by one by one. I love to see them drop out it's like, right? My carpenter. This is my carpenter over there. The Reuters poll. Great poll. Forty two. We've been traveling between 40 and 42 but 42 to 12. Wow, it's a big lead. We got -- we got to go a long way to blow that kind of a lead. You know that's one of those heavy sportsmen the golfers they say, Johnny he's just looking for the clubhouse. I'm looking for the clubhouse. I wish the election were like today. I would I really do. I wish the election were today. Now in some countries you can do that. You call the election. If I were president right now I'd be calling the election I want the election to be immediately. So anyway, so what's happened is we have and it's the day it's this is Martin Luther King Day, right? So we have we like that. We like that. So in South Carolina one other 35% to 15% and in Iowa CNN 33% to 20. I'm leading by the way. You know you don't hear that. They never quote -- they never quote the CNN poll. They always like to quote other polls where they're are a lot closer or whatever but would do on. I think we're going to do very well I think I was going to be a tremendous success. We're up there all the time. I'm going there tomorrow. I'm going there the next day I'm coming back here. You're going to be -- you're going to see me so much in New Hampshire you're going to be so tired of me, you're going to say. Keep that guy out. Keep him out of here. But we have to win. You know we have to win. I mean, it's sort of interesting because I look at the different candidates and I'm starting to spend money only because I feel guilty. I honestly. You know you have a poll like that where you're 33 and 42 to 12. I see one 42 to 12. And yet somebody said, \"Why are you spending money?\" I have to spend because; number one, I don't want to take any chances, and number two, I do feel guilty a little bit. You look at Bush he spent $69 million. Sixty nine. He's in favor of Common Core. I'm totally against Common Core, by the way. You got to be against it. A guy like him he's weak on immigration. So I say, \"How do you win when you favor Common Core?\" He wants your children to be educated through Washington, through the bureaucrats who are making lots of money, $250,000 dollars, that's not going to happen in New Hampshire. It's not going to happen in Iowa. It's not going to happen in South Carolina but it just doesn't make sense. And then to top it off, every week, remember they come in as an act of love, right? They come across the borders as an act of love. You can't do that. So -- so doesn't work. So we'll see. But he spent 69 million and I've spent essentially nothing. I mean almost nothing. And. That's what we need for our country we need as an example, right? That's the kind of -- Right? We need -- like as an example on education, all very important. Everybody here believes in education strongly. And we're No. 1 in the world in spending per pupil, by far. Right? By far. We're so far ahead of everybody else in terms -- No. 2 isn't even close. OK. But we're No. 28 in terms of results. So we -- we're No. 28 in the world. As a country, No. 28 in the world but we're No. 1 in spending. So in the campaign I'm reversed. I'm No. 1, by far, and I've spent at least. And they actually had a graph the other day in the Wall Street Journal which was interesting, it was a big circle and they had the money spent and the result. And they said, \"Trump is least the money spent.\" So I'm least here and best result. Isn't that great? Isn't that great? And I love telling that story because that's what we need. But the problem is I'm going to start spending some money because you know I'm 37 million under budget. Can you believe that? I thought I'd have a stroke. And here's the other thing. And this is so important tell your friends, I'm spending my own money. I'm spending my own money. I'm not relying on the lobbyists and the special interests and all the guys that are going to tell you a local politician or whoever is running to do what I say to do. \"I gave you $5 million Hillary and I want you to do what I say to do.\" That's what happens. That's what happens. Believe me, that's what happens. Hillary's raised a tremendous amount of money from special interests and from lobbyists. Jeff. Every one of them. Every one of them. Every one of them they've raised a lot of money and they're like puppets. Believe me, they're like puppets. You know I always tell the story about the Ford plant. They'll never do the right thing because somebody will have given them money either an owner or a shareholder or a lobbyist or a special interest and they'll never do the right thing. I talk about Nabisco. They'll never do. Nabisco is moving to Mexico. Ford is moving a big plant to Mexico. All of these things. Nabisco is taking their big plant out of Chicago. They're moving it into Mexico. So what are we going to do? We're not going to have any more Oreos, which is good, which is good. Which is very good. So just a couple of things before we answer questions but I just -- we have to get it off our minds. You look at this Iran deal where $150 billion we get our prisoners back. But they get far more back than we do. They get 14 of Interpol which are serious people. These are seriously bad dudes on Interpol. You know these are serious bad. They get access to oil, they can sell oil, they get access to free, they get everything. We get nothing we get nothing. And this is what happens. And then last week. What did we see last week? The sailors. Ten sailors. They get what happened now. How bad was that? What you think? Do you ever see it? So they're put in a begging position with their hands up guns to their head over nothing. Instead of let's fix your engine and get you out of here. A big deal. They had a thug screaming orders to him. I guess you heard that. And we just can't let this. We can't let this stuff happen with our country. We're being scoffed at. We're being laughed at. Now you get back down to trade and you look at what's happening and how we're being sucked dry and the people of New Hampshire and the people frankly of New England. Do we love Tom Brady, by the way? Do we love? Right? You see the greatest? You see the other game. It's so nice. You know and I have friends we own teams and Bob Kraft is a great owner and you have a great coach and Belichick. But you know, I just watched bing, bing, bing, bing, touchdown. Boom, boom. Then I have other friends, they have quarterbacks. Ay yay, yay. Interception, problems, fumble. Brady, you're lucky to have -- Brady is my friend but you're lucky. So -- So we've got to do some things. You know one of the bad parts about the deal is you going to now have $150 billion for four people. You're going to have a lot of things happening that bad. So this morning I understand they did three kidnappings in -- in Iraq. They're going to say, well give us billions. Give us billions. You know once you do this and once you allow this to happen it's a very, very bad thing going on. It's very bad. And when they see the weakness and the stupidity of our leaders it's not a good situation, folks. We have to change and we can change fast. We can change gears like you wouldn't believe. We're going to make our military so strong so powerful. Nobody is going to ever mess with us again. We're going to work with the vets. You know the vets are taking -- and you have so many vets up here. The vets are going to be taking care of great as opposed to poorly. Right now -- Stand up, Al. Stand up. This guy has been with me. Al has been with me from the beginning. I hope we went out because I'm never forgetting you man. Every time I make a speech and he's there really representing the vets and he's a powerful guy and they love him and I love him too but he -- Stand up, Al, just stand up by yourself. Right. Stand up. Turn around, Al. See how handsome he is. We. Appreciate it, Al. He's just so many of my rallies just about all of them. And he's here not for me, he's here because he loves the vets and he really is a great representative and we should all have. We should all be so lucky, I will tell you that. But we're going to take care of our military. We're going to take care of our vets. We're going to get rid of Obamacare. It's going to be gone. It's going to be terminated. And it's going to be replaced with much less expensive much better health care. We're going to get a much -- I don't know if you notice. I mean, I'm sure you do but the premiums, right? Twenty-five percent up, 35% up, 45% percent up. Deductibles through the roof so you can never use it. I mean, unless you get hit by a total tractor, it's up, you can't use it. No the deductibles are so high. I get more complaints about the deductibles than I get about the the increase because you can't use it. There's nothing to use. You got to be, I mean, literally you have to be dead. It's a -- it's a very bad thing. So Obamacare is going to be repealed and replaced. And that's going to be it. Amazing. We're going to have borders and the borders are going to be strong borders and people are going to come into the country legally. They're going to come in legally and we're going to build the wall, folks. We're going to build a wall. And you know you have tremendous problems. You have tremendous problems with the drugs in this area. It's amazing to me when I come to New Hampshire I hear more about the drug problem and the addiction and all of the drugs pouring in. Than I do most other places. I don't even understand why. But it's one of the most important things. And that wall is going to stop so much of it. And then we're going to help the people that are so addicted that they can't because I -- I speak with parents and their children are in bad shape and they're really addicted. It is really, really a big thing to get off. It's hard. The easiest way to get off is to never start. So like me, I never smoke. I never smoke. If you don't smoke. It's easy not to smoke. If you do smoke, I have friends they -- they smoke, they would they're always giving up cigarettes. They always giving it up. For 25 years that guy's been giving up cigarettes. But if you never start and we have to get the kids not to start and the people, generally. Not to start. The ones that are already hooked, we've got to get them help and we're going to do a lot of things to help them as much as we can and we'll try and get that all but I -- I know a lot of people in New Hampshire their children are hooked. And we're going to work -- we're going to work like hell to get that -- to get them unhooked because we have to. And the best way the best thing we can do though. For the rest, we've got to keep him out of here. And one of the reasons we keep him out is strong, strong borders. OK. And you know I -- I say in all of a sudden the other day I heard somebody say, \"We're going to build a wall.\" I said, \"Where did that come from? Nobody ever said that before but me.\" But they like the way it sounds they have no idea where to begin. They have no idea how to do it, whereas with me, it's easy. That's like easy when you build buildings like I build buildings believe me walls are easy. No windows, no nothing, pre-cast concrete gone very high. Let's see about a little higher than that. It's pretty high ceiling in here. But we'll go a little higher than that. You ever see the walls they have now? They're this high. And they have ramps and the ramps and the jeep goes right over the top. Loaded up with drugs they go sell the drugs they come back with cash. Not a good deal. It's not a good deal. We also have a problem with trade. I know the greatest dealers in the world the greatest absolute businessmen. Carl Icahn endorsed me many of the other ones want to endorse me. They will be very soon. We're actually getting a big endorsement on Tuesday it's going to be a lot of fun but we're getting a great endorsement on Tuesday. Something big is going to happen but we're getting a lot of people that want to endorse you. It's amazing. All of a sudden they're saying, \"Oh, wait a minute. Trump is beating Hillary in the polls and Trump is looking pretty good.\" And all of a sudden everybody wants to endorse people that sort of didn't know you around. You know they would go with the establishment stuff the establishment is not working, folks. You just have to take a look at what's happened to the country. Establishment is not working. Nobody knows the politicians better than I do. Believe me it's not going to work. It's not going to take us to the promised land that I can tell you. So we are going to get some unbelievable endorsements over the next little while. And I've never been a huge fan of endorsements. I always think it's the person much more so the endorsements. But we have a couple of coming up that are really fantastic. One in particular which we love. So what are the things I want to talk just quickly about this trade and then we're going to questions. Trade? China is making $500 billion a year. We have a deficit. Is that trade? That's not trade. That's being foolish. That's being stupid. That's robbery. I often say that, I often say. What China -- and I get along great with China the biggest bank in the world is attendant to one of my buildings from China. I sell condos to China to Bank of America building in San Francisco one of the great buildings of the world. Got that through China. I mean I have a great relationship which I've made a lot of money with China. We can make money with China too but we don't have the right people representing us. We have the wrong people we have people that don't have a clue. They don't have a clue. And China's good and Mexico's good, they're great. But their leaders are too smart for our leaders. Our leaders don't have any idea what's happening. And with China, somebody shot a robbery, robbery. Honestly, it's the greatest theft that has ever taken place in the history of the world. What China has done to this country. Thousands and I mean, when you say thousands, millions of jobs have been lost. Millions, millions of jobs. Thousands and thousands of factories and manufacturing plants have closed because of what's going on. And then they make this stuff and they sell it in. And there's no tax no nothing. But when you make your product in New Hampshire or anywhere else and you want it to go to China you can't get it in there. You can't get it in. They won't take it. And if they do take it they charge you a lot of tax. Believe me and I'm really aware of it. Nobody knows it better than you know what I'm talking about sir. Is that right? Stand up, because you know because you've been there. Yeah. And -- and we make better products. That's right. Hey, do you remember somebody brought this up the other day? Do you remember? Some of you are too young for this stuff but some of us unfortunately are old enough that we remember it. It used to say proudly made in America or made in the U.S.A. Right? You don't see it anymore. And then you'd have tags made in Japan. And that was the chiefs. That was the bad stuff. That was the cheap stuff. It would say Made in Japan and it was all made in Japan. But we used to have made in America made in the U.S.A. and that was an unbelievable tag. We don't have that. Do they have that anymore? How do you receive any more? It doesn't say made. We're going to put made in the U.S.A. We're going to put made in America. We're going to have it back. So here's what's happened. Trust me the -- the trade is going to be so good. I'll take a car like and I'll take some of these guys that are the best in the world. I'll say, check out China please trade agree. They will be sold. They don't want money. They just want to do something. You know believe it or not. These people love the country so different they're very rich. They don't want salaries they don't want anything. They want to help. And it's so easy for them it's like second nature. They love it. For them it's a game and they love the country but it's a game and there won't be any more China making $500 billion. Think of it a trade deficit of $500 billion. What kind of a deal is that? Then you hear our president say, \"Our trade partner.\" What kind of a partner? I don't want a partner like that. We got to get it to neutralize. Even I said, \"Maybe we can even make something if we're really smart. Watch. Watch what happens. OK. Because we have the best people in the world. Now. What happened is when Paris was so horribly hit, all of a sudden my poll numbers went up 11 points. Remember? Because everyone thinks that Trump is going to be tougher and sharper and all that and I believe me, I am, and trust me, I am. But all of a sudden my poll numbers went and that's when they went into the 40s and I didn't know I said, \"What happened?\" And they said, \"Paris.\" So what happened in Paris. And it was a problem that I've been talking about. Radical Islamic terrorism. And you know what? We have a president that won't even mention the term. He won't talk about it and unless you talk -- Well, unless you talk about it unless. Now here's the problem with booing, the press will turn that around and say, \"Trump got booed at the event.\" . Because they are the most dishonest people on earth. OK. See that booing, I love to hear that booing because that means you agree with me. But they'll turn around say, \"Do you know the Trump got booed today, oh, oh.\" And I'd say, \"I didn't got booed.\" It was -- Right? It was like a love fest. I said we have a love fest. But oh, they are dishonest. Thank you. So nice. Thank you. So nice. Thank you. Thank you. So great. All right. Well now they'll have a hard time saying it but they'll figure a way to do it anyway. OK. These people they are bad people let me tell you. So a couple of things, we're going to solve trade. Trade is going to be great but it changed because I announced on June 16th and almost from the beginning we've been No. 1. We've been No. 1 in every poll. Now we're No. 1 by far on virtually every poll. But almost from the beginning. But you know, when I announced I was talking about trade, I was talking about Obamacare, I was talking about all these different things that were going to do, but all of a sudden I started saying, you know we're going to start talking heavy into security not just the border. We're going to be really talking about security and we're going to be talking about ISIS because we have to blow them off the face of the earth. No, we have to. We have to. And I was against the war. I tell you what. It's a -- you know, I say it because it's a, you know, I have to think in terms of vision when you vote for somebody. But the truth is I was against the war said you're going to destabilize the Middle East at all. But then the way we left was so bad where Obama gets up and he announces the day that he's leaving. So the enemy says, really? They pull back. Wait till we leave. And now they go into town and we don't have Iraq. Iran is taking over Iraq. I said you're going to destabilize. So Iran not only is getting the great deal with 150 billion plus. they'll be able to do whatever they want with the nukes they can buy the nukes they don't have to do anything with the kind of money they have. But they're taking over Yemen. Right? They're going to take over Syria. They're taking over -- Most importantly in a sense they're taking over Iraq. Iraq has the second largest oil reserves in the world. So I used to say they made a great deal for the 150 billion. That's peanuts because they're taking over. They've been after Iraq forever. Forever. They'd fight with Iraq. They were the same. Boom, boom, boom. They'd fight for years and then rest. Then they fight then they rest. They couldn't get 10 feet they'd go the other would go. That's the way it was. Now we think they -- they just walked in we decapitated him and we left. And the way we got out was so foolish. And you can just imagine General George Patton or General MacArthur talking about this stuff and going on television shows and talking to announcers as generals and what we're doing and what are -- I mean, we want to be unpredictable folks. We have to be unpredictable. We're so predictable. We have people telling radio announcers what we're going to do. We have a president that says when we're leaving. We have a president that sent about two months ago 50 soldiers over, our finest, send 50 soldiers over to Iraq and to Syria. And what did he do. He announced we're sending 50 soldiers now they have a target on their back. They have a target on their back. Why is he doing that. Why can't he just send them. Frankly, it doesn't send. It doesn't sound good to say we're sending 50 anyway. It's not over. But why can't you just send them. Why does he have to say we are sending 50 soldiers. Now these guys these are not stupid people. Now they are looking for those 50 men and women. It's terrible. It's just terrible. And we have to be unpredictable. We have to do what they think we're not going to do. We have to do that. When I said the oil. And you know I've been saying the oil for three years. Everyone say, \"Oh, you can't do the oil.\" So why can't you do the oil you're going to take the wealth away. Now I actually said take the oil when we leave before it is all destroyed. Right? Everybody knows that. I was thinking of taking the oil and I don't mean just bombing it. I mean taking it. So then about four months, five months ago they would say, \"Well what are you going to do? Well, I don't want to tell you. I'm saying, \"I don't want to tell you.\" They said, \"Oh you don't know the answer.\" You know these wise guys you don't know the answer. And by the way, did I win the debate or what? Did we? Right? But you know. The wise guys, they're saying, \"Well you don't know. Maybe you don't know the answer. Maybe you don't know.\" I say, \"I know the answer but I don't want to really tell you these answers because I have a real chance of getting elected and if I get elected I don't want the enemy to know all this stuff.\" Right? But it got so bad. You know you still have to get there, you still have to get there. So about probably a year ago I said, \"Take the oil. Bomb the oil. Take the oil. Give some of the oil to the wounded warriors and to the parents of soldiers that are lost. Parents of soldiers that were killed in Iraq. Give them some. It's peanuts compared to what the value is. Spread it around, take care of our wounded warriors, take care of our vets and take care of families that lost sons and daughters.\" And what do we end up with? Take care of them. Just take care of them. And you know. Just so sad to see it. And then they all said I remember Obama had some of the generals commenting on my plan. Oh that won't work. Well as soon as Paris happened they started bombing the earth. They should have been done years ago but they want a bomb. I want to bomb, but I want to take. I want to bomb and I want to take and we'll do a little ring around, there will be just fine. I want to take the oil. OK? But you know. The -- the sad part is that I have to tell everybody what it is you know because it's that's I guess the system in which we live. If I don't say that they'll say what Trump doesn't we have a plan. And I really said, \"I'll never forget.\" Probably six, seven months ago they would say, \"Well, what's your plan?\" \"I'd rather not tell you.\" That doesn't play well in a democracy. Right? But I'd rather not tell you. \"Please tell us what it is, you must tell us. Oh, you don't have a plan.\" So finally I said, \"Look, you're going to bomb.\" and actually the guy -- I was telling it to the announcer. That's a good idea. I said, \"It's a good idea.\" Now you know Obama didn't want to go full scale in the deal and this I hear is true. I don't know maybe it's hard to blame because he didn't want to create environmental pollution. You do know that he didn't want to bomb the oil because of pollution. Look at Al, he's laughing. It's hard to believe isn't it. It is hard to believe. You know it's a true story. He didn't want to bomb the oil because if you bomb the oil, pollution we'll go to the atmosphere where we'll be thrown away into the system in about two seconds. But pollution will go up and it'll be it. Now I -- I don't know, Al. I don't know if it's 100% true but I have heard that. And I'm not surprised because that's the way we're running things. We don't know what we're doing. So take the oil. Be strong to all of these things and we're going to have a country that's going to be so great again. We have to bomb the hell out of them. We have to bring our troops back home. We have to be paid -- All these countries you know we're protecting we have a budget that so many times higher than No. 2 because we're protecting Japan, we're protecting Germany, we're protecting South Korea against the maniac in North Korea we're protecting Saudi Arabia. How wealthy is Saudi Arabia? We're protecting. They pay us peanuts. Peanuts. We can change this whole thing around fast. But you have to put a guy like me, believe me. You have to put a guy like me. And -- and just -- OK. Are you ready? Here's a quiz. Here's a quiz. You ready? Who is going to pay for the wall? Mexico. Mexico is paying for the wall. Now the politicians come up to me during the debate. One of them came, \"Don, you know Mexico's not going to pay for the wall.\" I said, \"Of course they are. They're making a fortune. We have a trade deficit. You wouldn't believe it. They're making a fortune. They took Ford, they took Nabisco they taking it all out. Of course they're going to pay. That's peanuts. And the wall is peanuts too. You know the wall is a thousand, basically, it's 2,000 miles across. But we only need a thousand miles of wall, OK. Even less. But let's say a thousand, we went to super duper job. Right? We want one that absolutely we want no wrinkles. But we're going to do a wall. It's going to be a thousand miles. So China. Right? Great Wall of China. China, 2,000 years ago, built a wall that's 13,000 miles long, 13,000. And that wall is seriously big by the way. You look at that sucker. You're not getting through that one easy. So what -- You know we have a little better material nowadays like a prefab. They didn't have prefab. They had -- they had stones over there. But China 20,00 years ago did this incredible job and they built a 13,000 mile wall. We have a thousand miles. We could do it so fast so easy. But the guys the politicians have no idea. One of the reasons, you know, it was going to be built. But one of there is this another environmental story. One of the reasons it didn't get built. Now here's a wall for security for safety. One of the reasons it didn't get built is they couldn't get their environmental impact study approach. Can you believe this? Meaning, a snake, a tortoise, a snail, something nobody knows more about environmental impact statements and make. Believe me. Can you get them through? You got to get it through. Sort of interesting. In the South China Sea. China's building islands, fortresses, they're building runways, military, and they have these massive excavators, massive. In fact it's half the size of this room and they're scooping into the ocean. The South China Sea won't have any impact. Believe me. OK. They're digging and throwing and digging and building these massive islands in the middle of the sea. And we can't do a wall. It's crazy. And I said to a friend of mine from China. I said, \"Let me ask you a question.\" And I was kidding. \"How long did it take them to get their environmental income, you know, income statement approved?\" But to get their environmental statements approved. \"How long did it take?\" And he looks at me says, \"Oh, we don't do that. We don't.\" Let me tell you. They said, let's do it. You know when they started digging the following day with this country it's like let's go through 20 years of environmental research on a poisonous snake that we want to keep alive. OK. So we don't know what we're doing. So we're going to make our country great. It's going to be greater than ever before. We're going to have a good time doing it. New Hampshire, I want to thank you because from day one everybody has said that you're with me and I love you. I love you. I love you. And we had a couple events like two weeks ago in New Hampshire where the weather was so bad. In fact my pilot said no Mr. Trump this is something you shouldn't do. What was that? Is that a dog? Uh-oh, It's Hillary. Oh, only in New Hampshire. Right? That was a. First it was the screechy dog then it was a very serious dog. Right? Anyway, that's all right. Take good care of your dogs. But you know we had a case two weeks ago where the weather was so bad. Two or three times up here. So tough, so -- that I shouldn't have that dick pilot said, \"Well you probably shouldn't do it.\" I said, \"How many people are there?\" Whatever it was. And he said, \"Where is it?\" I said, \"Corner of New Hampshire.\" I said, \"Those people have been so good to me. Really genius. Go get it. Go to it.\" And we landed we did our thing and we left. We love New Hampshire and it's a great honor. Let's take a couple of questions. Go ahead. Where's the mics. Who's got the mics? We'll take some questions. Kevin, let's go. Who's got one right here. I know this lady. Good. Hello, Mr. Trump. Hi. I'm Dee. Hi, Dee. We met in Right. Right. I remember. OK. I wanted to ask you. What you think about the Second amendment and what you think to do about it? And especially with some crazy like. on Social Security. I know. And they want to go after people on Social Security. First of all, social security we're going to take back our jobs we are going to make our country rich again. We are going to save your Social Security. We will not going to do any cutting. OK. And I'm about the only one that says that. That's what going to happen. Because you've been paying in you know you've been paying in to your Social Security so just rest assured and as far as Second Amendment what I love that question. We are going to protect. We are going to protect our Second Amendment. Nobody's going to touch it if I get elected. OK. Nobody's going to touch it. Thank you darling. I appreciate it. One of the thing you know speaking to New Hampshire. You know they want to move you to the middle of the pack. Right. You know that right? For some reason. But there is a big move next time to move you to the middle of that. There's a great tradition and history to New Hampshire being right here. Which really is the first voting stay. Then you have Iowa which is the great people with the caucus. But I will tell you that we are not moving you and we are not moving Iowa. You'll say I win. You're not moving. You're not moving. You know if you move all of a sudden you won't see anybody. That wouldn't be any fun. Right? But you're not moving but there's a big move to move you back in to the middle of the pack. It's not going to happen. If I win it's not going to happen. Not going to happen. Zero chance. OK. OK. Let's go. Kevin go ahead. Give it to somebody. Alex Jones. Alex Jones he was a nice guy actually. You like him? I like you too. Alex was in Alex Jones nice guy. Go ahead. Hi. How are you? My name is Haley. Hi, Haley. I'm 16 years old. And you always say you're going to hire the best people to work under your administration. Right. Who are the best people? Well many different people and they come from all over and the world, and they're all different. But one of the things and the one of the groups of people I talk about all the time and I know the greatest business people in the world. The greatest in the world. And we're going to use them for a trade deal now, folks. We're not going to use a political hacks. So do we end up in these crazy deals. Where we lose our jobs, where we lose our money and we lose everything else. And the other thing is that administration with the V.A., we're going to get the greatest administration. We're going to put them in to the veterans administration. We're going to take care of it. Military -- I'm going to find the right guys. We're going to find General MacArthur, We're going to find General Patton. Meaning, a young General Patton, A young General MacArthur. We're going to find great leaders in our military and then they're, you know, whether it's West Point or Annapolis or The Air Force Academy. We have great people here, we don't use them. Maybe they're a little bit rough. Maybe they're one-time used, a bad word. So now he's not going to be a general even though he's 10 times better than anybody else. We're going to find our great people. And we'll going to use them. Maybe you'll be one of the those people someday. And by the way, speaking of great people, I have my daughter Ivanka, come on. I have my daughter Ivanka here. Look at them they go crazy over Ivanka. Ivanka, that's crazier than they go over me. I don't like this. She wanted to come up to see new . Come on they want you to walk over, honey, come on. Come on. And Jerry come on up, come here Jerry, come here Jerry. Jerry is a great Real Estate guy and Ivanka they're having a baby. Ivanka's eight months pregnant and she's wanted to come up.OK, come here, . I'm so incredibly proud of my father it's so much fun for me to be here. To hear your enthusiasm, to share your enthusiasm and -- and I know this man will make America great again. So it is -- it is an honor. Thank you New Hampshire. What a couple. Great couple. She's so great. Well, would you -- can you imagine if she actually going to put such something bad. That would be so exciting, I say, \" What the hell just happened?\" Well, So let's hear one more question, come on. Who has a good one. Whose got a good question. Who's got a really good question. Whose got a really nice question. Go ahead, with the beautiful head of red hair. Oh, look at that hair. Thank you Beautiful. Go ahead. Thank you for coming. OK. My name is Paula. I work here in school . Good. And question that is a concern to a lot of us parents. Our children graduated with tremendous debts. I know, I know. And what do you going to be able to do to help get the debt down and find jobs? Right, OK now, the most important thing is job because I must tell you. In -- in more than any other question, especially when I'm in certain areas like this, where it's rural. I get a question on schools. The kids are choking on debt. They're borrowing the money and what the colleges are doing is they're taking the federal money. They don't view the kids. The kids are like a middleman. You understand that. So they get this loan and the colleges now all of a sudden is saying, \"Well, we're going to pay more to ourselves. We're going to -- .\" Do you see what's going on with cost of colleges? And the big loser on this is the children because the children have all of this debt and they're basically passing it on from the government to the college. And the colleges make a fortune. The government is actually making money solely. The only thing the government makes on you. You know that. The most profitable thing, we're going to use something to get those course down but we're going to do two things. We're going to knock the hell out of the course because what they're doing in the college is really unfair, you understand what I mean. It is raising it, raising it, it's going up like astronomically because they have all these money from the federal government thru the children. We're going to do something very, very profound. You're going to like me a lot, in about six months. Especially if I get in, you're going to really like me. OK, Thank you. The other thing -- the other thing in this second part and -- and this is almost more important ultimately because you'll have kids maybe a daughter maybe a child, where they go out. They go to a college, they, you know put dead up to their neck, they can't breathe, they work hard, they get great marks, they're good students, they were -- And then they graduate. They can't get a job. I'm taking our jobs back from China. I'm taking our jobs back. We're going to have so many jobs. I mean, you look at what NAFTA and with all those things. You look at what happened to New England, you look at what happened to New Hampshire. We're bringing our jobs back because ultimately, that's going to be the most important thing. We're bringing --. We're not going to be the stupid people anymore. We're bringing our jobs back. OK. Thank you. Thank you everybody you are amazing people. I appreciate it. Thank you. Thank you. Love you."}