{"id":474,"author":"Donald Trump","title":"Speech: Donald Trump in Portsmouth, NH","date":"2016-01-16","link":"https://factba.se/transcript/donald-trump-speech-portsmouth-nh-january-16-2016","paragraphs":["That's a lot of beautiful people. Now, the only thing I told Scott, you have to do me one favor. I'll do it, but if we have the biggest crowd you've ever had, even though we're in the middle of the worst snowstorm. I have -- we don't have snow like this in New York. But this is one beautiful -- I may not be out of here.","You know, I'm supposed to be lifting off. I don't think the plane is going to be lifting off very soon. But I said the one thing you have to do for me, you have to announce it's the biggest crowd you've ever had. So is it you said absolutely by far. Unidentified","So --","You might -- you may have to go. So now we know, it's the biggest crowd so I'm happy about that, OK? It's the biggest and look at all the people up there. Wow, that's, that's amazing. It's a great facility and a great owner. Thank you and thank you very much. Really nice. So I have -- first thing I have to do because he's a friend of mine.","He's an amazing guy, an amazing champion, and a really nice person, Tom Brady. Come on, Tom. You've got to win, Tom.","OK. You got to win. He's a great champ. He's a fantastic guy and I could tell you so many stories about him. But as good as he is as a player, he's that way as a person too, and he's a little bit injured. But him being injured, he's still better than anybody. And you have the best coach and you have the best owner, and you get really a special group.","So hopefully, good luck today. I was thinking about just to see if you're really Trump fans. I was going to keep you here beyond 4 o'clock. So well all, right? I was going to keep you like a little -- No, we'll be out of here very quick. In fact, we're going to make this very quick because if I don't make it quick, I'm definitely not going to be able to lift off.","All right, Scott. So this journey began in June and nobody had any idea that it was going to be like this. I've been now on the cover of Time Magazine so many times over the last few months. It's been incredible. And the last one, last week's Time cover, I loved Dory, I just thought the story was so well-written and so professionally written without any barbs, you know, normally and Scott knows this very well.","Even when we get the right stories, these people in the back they have to take a shot. It's always like, you know, you'll have two good paragraphs and then a kill. And then, three good ones and a kill. And in the end the story's lousy because the kills, you know, they're bigger than the good ones. But this Time Magazine story, it really describes what's happened with the campaign.","It's been an amazing thing. And the Wall Street Journal today has an incredible article about the debate, the debate and myself and the debate, and a lot of people have the articles, and a lot of people have put out really nice things as to what happened in the debate, and we're very happy with the end result.","And you know, I've been having somebody been following me along and being very nice no matter what I said, he was very, very nice and I kept saying, you know, I'm a professional, like this man's a professional, like this man's a profession. I'm a professional, I kept saying when's Ted Cruz going to say something bad.","Come on, Ted you've been saying -- come on, Ted say, but he kept saying good, good, good, and I'm just waiting and I'm saying because a lot of people do not like Ted to put it mildly. And I kept saying, am I the only person that thinks he's a nice guy? So as it turned out, you know, he finally went off the wagon a little bit, and went a little crazy.","And it's very, I mean, he's being a great hypocrite when you think that, you know, he talks about he's going to be Robin Hood. He's protecting then and finds out that on his person personal disclosure form, he didn't disclose that he's borrowing a lot of money from Goldman Sachs. He said, oh well, he forgot.","And then so that he forgot about Goldman Sachs. But then today, they have another story where he forgot another bank, Citibank and he forgot. Now, how do you control Citibank and how do you control? And write fairly, write fairly about Citibank, about Goldman Sachs, about these big powerful banks. You're a senator and yet you owe them money with a personal guarantee.","I don't think it works that way. So he obviously, didn't want the voters to know that he is totally controlled, lock, stock and barrel by Citibank and by Goldman Sachs. And I think that's very hypocritical. I'll be honest with you. I think it's very, very hypocritical. And then he spoke badly about the people of New York really because you know cities are cities, but they're basically people.","The brick and mortar and their people. And he spoke very disparagingly about the people of New York and I've been with the people of New York for a long time. But when the World Trade Center came down I watched these incredible people rebuild from the day it came down, literally, they were there when other buildings in the surrounding area they thought were going to fall.","And you had people working, trying to help the most horrific sights you've ever seen. Trying to help, do whatever they could. And I was there when we actually thought the U.S. steel building was coming down and I'll never forget that I was standing next to these two massive wonderful firemen and we heard a screech, like a screech, steel on steel and it was a couple of days after the buildings and I was down there with the -- we had a crew of people that, you know, to help.","I mean it's -- they needed a lot of help. I've never seen anything like I saw, and they heard a screech, and everybody thought that the U.S. steel building was coming down and it was not so far from us. And these two guys there were massive guys, two really big -- because I'm a big guy and they grabbed me. I must tell you honestly, I never knew I could run that fast.","I -- but they were running just as fast and they had my arms and they were and we were just running and these are incredible people. And when you think firemen coming in from Long Island and other parts of New York. You know, you're talking about insulting 20 million, 25 million people if you talk about the area where they drove in. They heard about it and firemen driving in that had nothing to do with it from Long Island and other parts.","And by the way, driving in and coming in from Iowa, and from all over the country. We had fire departments from Iowa coming in. It was so -- it was the one thing it was so incredible to see and to witness and people coming in from all over, but firemen coming in during the blaze. They knew that building was in serious trouble and they got there, they come through the tunnels and up and they stopped and they run, they run into the buildings and they're running up the stairs and they knew it could collapse.","Everybody knew it could collapse and the buildings are coming down first building, second building, and you have people running up the stairs as that's happening. And Ted Cruz criticizes New York and the people of New York is a disgrace. I think it's a total disgrace, a total disgrace. So I just, you know, I have to say, so I thought what he said was very, very, very sad.","And even during the debate, you know, he said well, the poll numbers I mean, I've been going up in the bar -- I've been going up since uh -- Scott will tell you, essentially, since I went out. Don't forget they kept using the word plateau. First, it came in at six and all of the pundits said well, he's plateaued.","He's got a six. Next week I hit 12. Then I had 14, then I hit 18 or whatever the numbers may have been. And the next week, I hit like 17 and then 20. And every week it was well, he plateaued. Then I got up to around 24, 25 and they said, yeah, this isn't good. And then last week a couple of polls had me at 42, 42%, 42. Pretty good, right?","Don't forget that's 42% and at that time I think they had like 15 people. Now they're rapidly dropping out and I think probably after Iowa or New Hampshire, there's going to be a lot of people leave. But you know when you have 42 and you have 14 or 15 people that they're talking about that's a tremendous percentage.","I'd take that if we had three, right? If they had three we'd take the 42, but we certainly take it where we have 15 people. So it's been an amazing, it's been an amazing run and I've really enjoyed it. People say to me you know, what have you learned? And one of the things I learned, Scott, and you probably learned this too, I hope you have because to me, it's been a great experience.","I've been written about very falsely and the public gets it. They really understand it. Some guy the other day on television said and they'll say things that are so unbelievable. I supported very heavily, John McCain. He lost. It's OK. I supported Mitt Romney. He lost. I thought John McCain's you know was a tough fight because the economy was not exactly too good.","And I think that would have been tough. I'm not sure that Abraham Lincoln could have won that one, right? But Mitt Romney and I would have thought that he could have won. We had a failing president and I think that's one that should have been won and for some reason it wasn't. But I supported these two guys, but I supported very heavily in '08. I supported John McCain, raised a lot of money for him.","I was on his committees, everything else and I had this guy, this really dopey guy, I was watching last night. Bill o'Reilly who's a great guy, but this dopey guy. No, I'm not talking about that. This dopey guy Glenn Beck, he looks like hell though. No, he's like a dope. And I -- you know I've watched him cry on television all the time.","He's doing very badly. His thing is falling apart, his company is falling apart. I see him on TV. I actually called Bill o'Reilly and said Bill what do you have a guy like that on television? Fox fired him and then he goes out does this thing. We heard he was doing well, he's not. But he's on and the thing that bothered me, he said Donald Trump voted for Barack Obama.","Me and here's the problem. The good thing about having a large microphone is that we can at least explain to people that these people lie, they lie so much. The reason he doesn't like me is because I didn't do his show. He asked me so many times, do my show. And I didn't do it because I don't respect him.","I did it because -- no, I'm so busy. I couldn't do a show. This was a quite a while ago. I couldn't do a show and just timewise and then, all of a sudden enough time goes by and I understand that. So he started hitting me and that was the end of that. But the guy goes on television last night with o'Reilly says that I voted for Barack Obama, and I'm on John McCain's committee raised a tremendous amount of money for John McCain had dinner with John McCain and his wife very, you know, right before the election.","And I got to listen to this idiot named Glenn Beck saying I was for Obama. And I say, you know, it's sort of interesting. Most people wouldn't bring it up. Most people don't even see it. But it's sort of a good thing to bring up if you can. If you can have the experience of talking to people because some people, see something like that and they believe it. There's nobody to refute them.","Do agree with it? You get it.","I like to bring it up because you know, he can say other things and you don't bother. You don't want to waste time. All you do is make him a little bit bigger but he's a failed guy. But you know, I like to bring it up because I like to let people know it's so dishonest out there with the media. It's so dishonest.","So we like to do that. The thing that I've learned more than anything else is how smart the public is, how caring the public is. And you know when I fill up stadiums, I fill up places it's incredible. Like today, I mean, look at all these people in this snowstorm. It's an amazing thing. They're doing it because you know my theme is Make America Great Again.","And what that's it. It's very simple. It's make America great. And it's very simple but very factual. That's what we're going to do. We're going to make it great. And I actually said because after, you know, I didn't say that in the beginning. But I go to Dallas, we have, Scott, 20,000 -- 21,000 people. Moby, Alabama had 35,000 people.","We had in Oklahoma 20,000 people. When I go to New Hampshire, I have you guys know, I have the biggest crowds by far. In Lowell, we filled out that arena. We had to send away 7,000 people which still I'm going to go back away to take care of those 7,000 people. I felt badly, but you know that big arena which people don't even use because you can't fill it up. We not only filled it up. We had to send away 7,000 people.","But whether it's New Hampshire or Iowa, South Carolina, we're doing so well and the reason is because people really want hope. There's no hope with these people that we have running for office, except for him of course, but the reason he's not in is because maybe they gave up on hope and here's a good man by the way.","This is -- I hope you're going to do it again. Are you going to do it again? I hope. We got to look some -- we got to get him back. We're losing our good ones. We're keeping the bad ones, we're losing our good ones and he'll get -- the right things are going to happen and we'll be behind him 100%. We have to re -- because he's vice president.","Hey, that sounds like a good -- Hey, hey, hey. What are you doing? Central, hey, you know what? and he's central casting. Look at that guy, he's central casting.","A great guy and a great -- beautiful great wife and family so, so important. So what I have seen is the level of enthusiasm and the brilliance of the people, the people as a unit. It's so -- the people are so smart. They really, really get it. And frankly, if they didn't get it, they wouldn't be they wouldn't be showing up in these massive numbers because I think you'd agree Scott, this is like a movement.","I got a call from one of the top writers and he's a liberal writer, but you know that's all right. We can get those calls every once in a while. We don't want to take too many of them. But he said to me and this was three months ago. The summer had, you know, sort of ended and we were doing really well, and they called it the summer of Trump, and he said can I ask you a question?","How does it feel? I said how does what feel? He said how does it feel? You've dominated everything. The whole conversation is about what you are and about what you're saying more importantly, how does it feel? I said it doesn't feel anything. To me, unless I win, what difference does it make? He said no, no, no, it matters because you've changed politics as we know it. I said no, no, you're wrong.","If I don't win, it doesn't matter. And when I say I don't win, I mean, at the top because otherwise all of these things, whether it's the strength of the border, whether it's any of the other things. The deals, the horrible deals that we made, the trade deals that we have, putting the right people in place, I mean, China is making 500 -- you look at -- we have a trade deficit this year with China.","$500 billion, not going to happen if I'm running things. Not going to happen. So, so essentially, I said and I respect him because the Summer of Trump, then he said, and it's the Autumn of Trump because I spoke to him recently. I said it still doesn't matter. It only matters if we win because I can -- you know, look at all these beautiful headlines and today the editorial of The Wall Street Journal, The Wall Street Journal was really nice today, and they talked about the debate and the different things and they were very nice.","But it all doesn't matter unless we win because unless we win, we can't put the right things into gear. And I deal with the politicians and they're all talk and no action. When I say build a wall, they don't even know what the hell I'm talking about. They don't know where to build. They don't, they really don't know.","They don't even have a clue. And when I say the different elements that I say it very strongly, they don't know. For instance, who's going to pay for the wall?","Mexico's going to pay for the wall. They're going to pay. Remember, remember I said they're going to pay for the wall. The politicians come up to me on the dais, a couple of them. Nice people. I get along actually with most of them and they say Mexico won't pay for the wall. I said Of course they will. Every business person in here knows what I'm talking about because they make so much money off the United States.","Do the business people get it? Did you guys know what I mean? The pilot -- I bet this guy does, right? I called, hey, if you're making many billions more than the cost of the wall, they're going to pay. They're going to pay. Nabisco is moving to Mexico. Ford moving to Mexico many, many companies moving to Mexico.","They're going to pay 100%. Not like 99-point, they're going to pay 100%. Now maybe in different forms. You know, you have to have flexibility because maybe they won't want to do it one way. They will do it the other way. If they don't want to do it, they'll do it and we'll get along with them better. We'll get along with them better than they get along with her right now because right now they take advantage of us. I know Mexico very well.","I have thousands of Mexico -- people from Mexican and Hispanic employees, tens of thousands over the years, tens of thousands. They're fantastic people. They're unbelievable people, but the leaders are too smart for our leaders and they're too cunning. It's an important word cunning. They're too cunning and what's happening at the border is a disgrace.","It's a disgrace. The whole thing is a total disgrace. You know in Mexico, it's probably the hardest, but one of the hardest is if Scott and his beautiful family want to become citizens of Mexico which is unlikely. I think you're very happy in New Hampshire. It will be impossible for that to happen, OK? Impossible.","Impossible. Here we have people go through and they you know, walk in and essentially, they might as well be citizens because the illegal immigrants are treated better than our vets, but they're treated better. I'm telling you. They're treated better than our vets. And Scott knows, I mean, I had a friend that went to Mexico and he was there and he was there for like a week, and he was there with his family and he was an extra day or two days because he had a problem with transportation.","And they get called by the guards. When are you leaving? Oh, why are we leaving? Well, you had a pass today, by the way they're right, it's not the wrong thing, with us it's what are you leaving? How about twenty 25 years I'm going to leave, OK? I'll leave when I want. We have our border patrol people who actually called me. They want to meet me and I met with them in Laredo, Texas.","These are incredible people. They want to do the job. They're saying stand back. They're told to stand back. They're told stand back. These are people that can do the job and they're told to stand back. So we are going to have an amazing country again. We have a great country, but we going to make it so much better.","We're going to make it so much sharper. We're not going to be the stupid anymore. We're not going to have leaders that are incompetent. They don't know what they have done. I guarantee you, I talked about so much the prisoners with the Iran deal where we give them $150 billion and then they treat those sailors like -- did anybody get sick at watching that scene?","Think of it, you I know you. You would have gotten totally sick. I wouldn't have wanted to call you then. Sick and angry with -- you know when people said somebody they would say that day, Trump is angry. Of course I'm angry. I want to be angry. Who's not angry? And you know they wanted me to say no, I'm really not angry.","I'm wound up so happy with the way the -- the country is a mess. I am angry. I am angry. I won't be angry for long because when I fix it, I'm going to be very happy. But right now -- thank you. But right now I am angry. But think of the scene. You have these 10 sailors. I don't know what happened. They went I guess it sounded like they took a little shortcut through a big body of water.","OK, big deal. And they get locked in and they drop to their knees in a begging position hands up guns to their heads. And this is supposed to be our ally and trust me, trust me, folks. In this -- one of the stupidest deals ever made which by the way won't do a thing in terms of nuclear, other than maybe proliferate, OK? You're going to have more because other people now are talking about getting it because this deal is so bad.","We've made a terror nation a very rich nation. More importantly, we've given them Iraq. We've handed to them -- they've been trying to get Iraq forever, as far back as you can go in time, they've wanted Iraq. And Iraq has by the way, people don't know, it's the second largest oil reserves in the world. So not only did Iran get this deal, but they got Iraq cur -- courtesy of the United States.","Now they've taken over Yemen and the reason they went Yemen is take a look at the border with Saudi Arabia. It is a long beautiful border right along Saudi Arabia because they want to go get that oil too. I mean, what Iran has done is incredible. But $150 billion, I have been mentioning this so much and I guarantee you the United States has been putting so much pressure.","Please give us our prisoners back please, please, please. This should have been done three four years ago when the deal was struck, before the deal was made. And this is the world's longest deal. They should have said we want our prisoners back. Now the reason and what's happening, the reason they let the boat, the sailors go is because in two days they were getting $150 billion.","And these are smart people, they're not going to say well, we're going to keep the same. They had to get the money so they let them go. I guarantee you, Scott that if that money weren't in play, they would've kept those sailors 100%. They would have kept them just like they kept the four people. Now I have to see what the deal is for the four people because somebody said we're getting -- they're getting seven people back.","So essentially, they get $150 billion plus seven and we get four. Nah, doesn't sound too good. Doesn't sound too good. But we have to see because this -- I just heard about this an hour ago, but -- and I'm happy they're coming back. But I will tell you, it's a disgrace that they've been there for so long.","It's a disgrace. Remember that. A total disgrace. So when we started, just finish and then Scott and I will talk for a couple of minutes. But when we started, it really worked. And very importantly, it really started off as trade and border and this. Then we had Paris and then all of a sudden it started looking like this whole situation was taking a very, very deep and dark.","It was becoming a very deep and dark picture. And all of a sudden CNN did the first poll and they're all back there. I want to give them any unnecessary credit because it's not like they treat me great, but they do these polls and the polls, I guess, they're legit with their polls because Trump is always winning in the polls, right?","So I like it. But they said you've seen this Scott. Who wins on security? Trump. Who wins at the border. Trump. Who wins on the economy. Trump by so much. And by the way, I don't mean Trump like Trump gets you know a point where Trump gets double, triple, quadruple, much more than anybody else. And then who wins on ISIS and who wins with a military?","Trump. Trump. Trump. So you know all of a sudden and this started happening, you know, pretty much since Paris, and then you had the horrible situation and in California with the couple. She comes in on a fiancee permanent and she's radicalized and the other guy's probably radicalized, but he became radicalized and they killed people.","They gave them a wedding reception. People gave them a wedding reception. I mean, something's going on. We have to figure it out, folks. Something is going on that even today I'm leaving, and I'm seeing what happened. Today, a hotel was blown up, many, many people dead. They don't even know how many people.","Just blown up. Just blown up. Innocent people, blown up and the World Trade Center, we're talking about World Trade Center. Flying airplanes into the World Trade Center, into the Pentagon, third plane who knows where it was going. Who knows? They say it was going at the White House but who knows where it was going.","Brave people on that plane by the way. Brave people but, but really brave people. But something's going on. And so it's changed very much and I have been talking much more about the military and they have much more confidence in me with the military than they have with these politicians that don't know anything.","And they don't believe me they don't. And everything is, you know the word unpredictable Scott, and so sometimes it's very tough for me because they'll say well, what do you do about this? What do you do about this? And I want to say, you know, I have a chance of winning. I don't want to really tell you what I'm going to do like on military.","Like I've been saying oil, take the oil, take the oil. I never wanted to say it. I wanted to surprise them, right? But it got to a point six months ago when I had to say it. I was saying to them, no, I don't want to tell you. I know what to do but I don't want to tell you. And they'd say, oh, he doesn't really know.","Finally, I had to do it. I mean, you have to win. I hated to tell them take the oil and then the government said you can't take the oil. You can't do that. You can't, can't do it. General MacArthur couldn't do. General George Patton they would have had the oil four years ago. They would add the oil. He would have had the oil before he stepped out of his airplane, right, to claim victory.","But it's one of those things. So a couple of weeks ago, a couple of, you know, right after Paris they started taking the oil. Finally, finally, but I said take the oil and keep the oil. They just take the oil. They just bombed the oil. I said take it. No, you keep the oil. Folks, you buy it, you keep it right?","And then you distribute it. You take some and you give some to the veterans and to the wounded warriors and to the families who lost people. And you give some to the families that have had death and horror in their lives and what have we got out of Iraq. We've gotten out of Iraq. I'll tell you, $2 trillion at cost, thousands of lives, wounded wars who we all love all over the place.","We get nothing and they won't even listen to us. And now Iran is taking Iraq. So I said keep the oil we give some to people that really were affect. I mean, you have families that lost sons and daughters they got nothing. They have nothing. So I just say that we're going to run a country properly. We're going to be respected again.","And it's great that you're here. And if I don't get the hell out of here soon I'm never going to be able to take off.","So he'll ask me a couple of quickies.","Thank you. Thank you.","Well, first of all, great question. The VA is one of the most corrupt enterprises in all of Washington and the country. It's so poorly run. It's so poorly run, and with that being said by the way, I've met some people that are really great doctors and some of the people are even saying some of the doctors are fantastic.","But the administration is largely corrupt and it's a disgrace. What's going on with the VA is a disgrace. So do you hear somebody scratching? I hear somebody scratching. Let me tell you, who the hell is back there? But the VA is absolutely disgraceful and we are going to run it professionally. Great. And one of the things we're going to do Scott, you know, one of the biggest problem, people are waiting six, seven days in a reception room trying to get a pill or a minor procedure.","And many people are dying while they're waiting and we're going to work this system and I put out a policy which I think most of you have seen. Certainly, the veterans have all seen it and it's been really praised. When you have six day waits and five day waits and the doctors can't see you etc. You're going to go to the local hospital, you're going to go to a local doctor, we're going to pay that bill, and you're going to get taken care of properly and quickly.","So that's the way it is. And you know in the end it's cheaper. In the end it's going to be a lot cheaper. So we're going to do that among other things, but the vets will be taken care of well.","Well, first of all we're going to repeal and replace Obamacare which we have to do. I've been -- premiums are going up 25%, 35%, 45%. Your deductibles, you'll never get to use it. You have to be hit by a tractor to use it. I mean, the deductibles are so high now that you'll never get to use it. So Obamacare is a disaster.","And honestly, it's going to fold by 17 anyway. It's you know it's folding because all the people that they didn't think we're going in are going in, and the people they did think, meaning the people that pay, they're not going in. So we are going to get rid of Obamacare and we're going to put it -- we're going have a great plan and it's going to be much less expensive plan, and it's going to be a plan that's much better for the people.","So much that when I look at -- I watch a guy like Jeb Bush who's totally in favor of Common Core and I say no wonder he's down at 2%. No, no, how -- can you imagine? Jeb Bush is in favor of Common Core. Totally against Common Core, me. Totally against, we're going to kill the Common Core. We're going to bring education back to the local communities where it should be. We're going to have great education.","Don't forget, with all of the money we spend, with all of the money, we spend so much on education, No. 1 in the world. So when No. 1 per pupil in the world by a factor of you have no idea by so far ahead. We're number 28 in education. We have third world countries that are ahead of us. So we're bringing education back.","We're getting rid of Common Core. While I'm on a subject, Second Amendment, we're going to cherish and protect our Second Amendment. It's under siege. It's under siege. And we're going to be cutting a lot of the fraud, abuse, waste as so much of it, and we're going to start chopping down that $19 trillion.","Hard to believe, $19 trillion, but we're going to start chopping it down, and we'll chop it down very significantly, quickly. And we're going to bring jobs back to this country. Believe me.","It's one of the biggest questions I get from young people because I go all over and its student debt. One of the big answers obviously, Scott is jobs. Because you know the biggest problem is they graduate, they don't mind the debt as much as they mind the fact that they go through four years or two years of college, and then they get out they can't get a job.","So we're going to create jobs. I always say I will be the greatest jobs president that God ever created. That's what I do have thousands of jobs. So we're going to create jobs. So important, but you know what's happened? Students are going out. I've been watching this process and I'm not even blaming the God, sort of natural.","It's a very bad system in a way. Students go out and they borrow money from the federal government. Now they have the money and the colleges keep going up, up, up much more than they should be going up because all they do is take all this money. Because essentially, they're borrowing it. They just have the students are like a middleman.","They're just taking from these students. So there's no incentive for the colleges to bring costs down and the college, the college costs running the college, they're going through the roof including salaries for the top people. I'm looking at salaries at some of these people are making and it looks like they're running General Motors or when General Motors runs properly.","But it looks like, it looks like they're running, you know, a major corporation. And it's really a problem because -- and I understand how the system works, and that's sort of the way the system works. But the way we have to do it is we have to go in and check it because what's happening in the colleges, they're taking this money and the next year they go up and the government gives more money to the school.","So the one that suffers, the people that suffer are students. I'm going to solve the problem, OK? Thank you. Good question.","OK. That's a very big question.","It's a great question. I hope the second part isn't quite as big. That could be a part five question. Look, we need a strong military. Right now we have a military that's under siege. When General Odierno left a few weeks ago he said that we are the least prepared that he's ever seen our military. And yet, we should be the most prepared because we have the world hates us. Obama and Hillary have the job.","I mean, the world is under flame. The world is, is burning and they hate us. And if you think about it, during the Obama administration, look what's happened. And our military has become absolutely, I'm in the real estate business, I get these listings for military bases all the time, military base. I see how many of these things are we giving up? You know we have military bases so many are closing.","We are going to have a military that's so strong and so powerful that nobody is going to mess with us. Believe me, OK? Nobody. And I have to add and I think you would agree. You know, it's very costly but that's cheaper than what we're doing now.","Come on Scott. Don't be a party pooper. Come on now. Lift her up, Kevin. Lift her over the railing.","Lift her up over there. Come on, Kevin.","I don't think Kevin -- be careful. I'm not strong enough. Be careful. Come on fellas, help her. The owner is going to help. He's a strong guy, he lifts cars all the time. Come on. That's it, darling. Come on.","Scotty's a party pooper. Come on.","Obviously, he's not running for office. If he was running, he would have said come on up.","I'm the one, you're talking to the converted. You're talking to the converted. I mean, forget it. We're going to have a border. You know if you don't ever, I just was interviewed by George Stephanopoulos. If you don't have a border, you don't have a country. You don't have a country. Where we have a country, we have a border that's like a piece of Swiss cheese.","We are going to have borders that are so strong. The wall will be built. It'll be a real wall. That'll be a wall. This will be a serious wall. But we're going to have a border. We're going to borders all over and we're going to stop the whole thing with the visas where people fly in, you know, because the borders' 50% of it. But we also have people coming in through so many different ways.","We're going to have a real strong country again. And we're going to want people to come in and we're going to want people to go through the process. We want people to come in to have to come in legally, OK?","OK. Well, I have to be honest with you. This has been going on for a long time. Stability to the region. We've been doing this for 15 years. We've become a debtor nation doing it. Our roads are falling down, our highways, our bridges, I mean, our bridges are in such bad shape, they're like 50% up and considered unsafe.","We have to rebuild the United States. We have to rebuild the United States. Now we got to get rid of ISIS. You know, I was very proud to say, and to you know, everyone says oh, Trump is this tough guy. He'll be fast. I'm slower on the trigger but I'm a tough guy. I'm the strongest guy militarily that you can ever have, OK? I am a -- I always say I am a militaristic person.","We're going to have such a strong military. But you know what? It's time, folks, for us. We're going to get rid of ISIS. We're going to get rid of it surgically and fast because you can't allow them to cut Christians heads off and everyone else's heads off. That's from medieval times. You know, Scott, I used to read about that and I said you know, this is no different.","We're living in medieval times. We're living in times that are just as bad as they ever were in the history of the world. They're cutting people's heads off. I used to read that when I was in history class. The viciousness, right? Medieval times, boom. We're doing the same thing right now probably more viciously.","We are living probably the most vicious time. We have people that are disgusting, disgusting animals and we're going to stop that. But you know what? We've got to get back to a country. We've got to bring our people back and we've got to let people know that if they mess around with us, they're going to be gone.","We're going to wipe them off the face of the earth. We're going to wipe them","donaldjtrump.com.","Donald J -- and then, in New Hampshire by the way, the polls are coming out. We're leading by like 20 points. We're doing great. But you know what? Please do me a favor. Go out and vote because if we don't vote, we're all wasting our time folks. It's never going to happen.","Thank you.","Well, I know you have a very tough situation and I think the best so that we don't keep everybody. I'm going to have somebody see you afterwards and let me see your situation. I mean, the truth is everybody's situation is different. But we'll see your situation, OK?","Where's Al? Is Al here?","I don't see you, you're behind the column. That's first time I've ever seen you in the second row, Al.","Yeah. Good reason. Good reason.","Take another one. Take another one.","Hi.","Well, we have to stop the illegals. We have to put our people to work. But there are visa programs where we can bring people in if you can't get people for jobs because we don't want to stop our economy. So we have as part of it, visa programs where you can put people to work because we don't want to affect the economy.","That's one thing I don't want to do. We want -- our economy is very weak. We have the slowest recovery in history. It's not even a recovery. And if you look again, you know, you hear these phony jobs numbers. People that were looking for jobs that gave up, Scott, they gave up looking. They now -- they're considered employed.","So you have 100 million people that would like to work and they can't work. So we will be able to take care of that situation beautifully. But we do want our people working. You understand, OK? Thank you."],"text":" That's a lot of beautiful people. Now, the only thing I told Scott, you have to do me one favor. I'll do it, but if we have the biggest crowd you've ever had, even though we're in the middle of the worst snowstorm. I have -- we don't have snow like this in New York. But this is one beautiful -- I may not be out of here. You know, I'm supposed to be lifting off. I don't think the plane is going to be lifting off very soon. But I said the one thing you have to do for me, you have to announce it's the biggest crowd you've ever had. So is it you said absolutely by far. Unidentified Absolutely, it is, Donald. And I think, they'll actually shovel your plane out for you to help you get off. So -- You might -- you may have to go. So now we know, it's the biggest crowd so I'm happy about that, OK? It's the biggest and look at all the people up there. Wow, that's, that's amazing. It's a great facility and a great owner. Thank you and thank you very much. Really nice. So I have -- first thing I have to do because he's a friend of mine. He's an amazing guy, an amazing champion, and a really nice person, Tom Brady. Come on, Tom. You've got to win, Tom. Yeah. OK. You got to win. He's a great champ. He's a fantastic guy and I could tell you so many stories about him. But as good as he is as a player, he's that way as a person too, and he's a little bit injured. But him being injured, he's still better than anybody. And you have the best coach and you have the best owner, and you get really a special group. So hopefully, good luck today. I was thinking about just to see if you're really Trump fans. I was going to keep you here beyond 4 o'clock. So well all, right? I was going to keep you like a little -- No, we'll be out of here very quick. In fact, we're going to make this very quick because if I don't make it quick, I'm definitely not going to be able to lift off. All right, Scott. So this journey began in June and nobody had any idea that it was going to be like this. I've been now on the cover of Time Magazine so many times over the last few months. It's been incredible. And the last one, last week's Time cover, I loved Dory, I just thought the story was so well-written and so professionally written without any barbs, you know, normally and Scott knows this very well. Even when we get the right stories, these people in the back they have to take a shot. It's always like, you know, you'll have two good paragraphs and then a kill. And then, three good ones and a kill. And in the end the story's lousy because the kills, you know, they're bigger than the good ones. But this Time Magazine story, it really describes what's happened with the campaign. It's been an amazing thing. And the Wall Street Journal today has an incredible article about the debate, the debate and myself and the debate, and a lot of people have the articles, and a lot of people have put out really nice things as to what happened in the debate, and we're very happy with the end result. And you know, I've been having somebody been following me along and being very nice no matter what I said, he was very, very nice and I kept saying, you know, I'm a professional, like this man's a professional, like this man's a profession. I'm a professional, I kept saying when's Ted Cruz going to say something bad. Come on, Ted you've been saying -- come on, Ted say, but he kept saying good, good, good, and I'm just waiting and I'm saying because a lot of people do not like Ted to put it mildly. And I kept saying, am I the only person that thinks he's a nice guy? So as it turned out, you know, he finally went off the wagon a little bit, and went a little crazy. And it's very, I mean, he's being a great hypocrite when you think that, you know, he talks about he's going to be Robin Hood. He's protecting then and finds out that on his person personal disclosure form, he didn't disclose that he's borrowing a lot of money from Goldman Sachs. He said, oh well, he forgot. And then so that he forgot about Goldman Sachs. But then today, they have another story where he forgot another bank, Citibank and he forgot. Now, how do you control Citibank and how do you control? And write fairly, write fairly about Citibank, about Goldman Sachs, about these big powerful banks. You're a senator and yet you owe them money with a personal guarantee. I don't think it works that way. So he obviously, didn't want the voters to know that he is totally controlled, lock, stock and barrel by Citibank and by Goldman Sachs. And I think that's very hypocritical. I'll be honest with you. I think it's very, very hypocritical. And then he spoke badly about the people of New York really because you know cities are cities, but they're basically people. The brick and mortar and their people. And he spoke very disparagingly about the people of New York and I've been with the people of New York for a long time. But when the World Trade Center came down I watched these incredible people rebuild from the day it came down, literally, they were there when other buildings in the surrounding area they thought were going to fall. And you had people working, trying to help the most horrific sights you've ever seen. Trying to help, do whatever they could. And I was there when we actually thought the U.S. steel building was coming down and I'll never forget that I was standing next to these two massive wonderful firemen and we heard a screech, like a screech, steel on steel and it was a couple of days after the buildings and I was down there with the -- we had a crew of people that, you know, to help. I mean it's -- they needed a lot of help. I've never seen anything like I saw, and they heard a screech, and everybody thought that the U.S. steel building was coming down and it was not so far from us. And these two guys there were massive guys, two really big -- because I'm a big guy and they grabbed me. I must tell you honestly, I never knew I could run that fast. I -- but they were running just as fast and they had my arms and they were and we were just running and these are incredible people. And when you think firemen coming in from Long Island and other parts of New York. You know, you're talking about insulting 20 million, 25 million people if you talk about the area where they drove in. They heard about it and firemen driving in that had nothing to do with it from Long Island and other parts. And by the way, driving in and coming in from Iowa, and from all over the country. We had fire departments from Iowa coming in. It was so -- it was the one thing it was so incredible to see and to witness and people coming in from all over, but firemen coming in during the blaze. They knew that building was in serious trouble and they got there, they come through the tunnels and up and they stopped and they run, they run into the buildings and they're running up the stairs and they knew it could collapse. Everybody knew it could collapse and the buildings are coming down first building, second building, and you have people running up the stairs as that's happening. And Ted Cruz criticizes New York and the people of New York is a disgrace. I think it's a total disgrace, a total disgrace. So I just, you know, I have to say, so I thought what he said was very, very, very sad. And even during the debate, you know, he said well, the poll numbers I mean, I've been going up in the bar -- I've been going up since uh -- Scott will tell you, essentially, since I went out. Don't forget they kept using the word plateau. First, it came in at six and all of the pundits said well, he's plateaued. He's got a six. Next week I hit 12. Then I had 14, then I hit 18 or whatever the numbers may have been. And the next week, I hit like 17 and then 20. And every week it was well, he plateaued. Then I got up to around 24, 25 and they said, yeah, this isn't good. And then last week a couple of polls had me at 42, 42%, 42. Pretty good, right? Don't forget that's 42% and at that time I think they had like 15 people. Now they're rapidly dropping out and I think probably after Iowa or New Hampshire, there's going to be a lot of people leave. But you know when you have 42 and you have 14 or 15 people that they're talking about that's a tremendous percentage. I'd take that if we had three, right? If they had three we'd take the 42, but we certainly take it where we have 15 people. So it's been an amazing, it's been an amazing run and I've really enjoyed it. People say to me you know, what have you learned? And one of the things I learned, Scott, and you probably learned this too, I hope you have because to me, it's been a great experience. I've been written about very falsely and the public gets it. They really understand it. Some guy the other day on television said and they'll say things that are so unbelievable. I supported very heavily, John McCain. He lost. It's OK. I supported Mitt Romney. He lost. I thought John McCain's you know was a tough fight because the economy was not exactly too good. And I think that would have been tough. I'm not sure that Abraham Lincoln could have won that one, right? But Mitt Romney and I would have thought that he could have won. We had a failing president and I think that's one that should have been won and for some reason it wasn't. But I supported these two guys, but I supported very heavily in '08. I supported John McCain, raised a lot of money for him. I was on his committees, everything else and I had this guy, this really dopey guy, I was watching last night. Bill o'Reilly who's a great guy, but this dopey guy. No, I'm not talking about that. This dopey guy Glenn Beck, he looks like hell though. No, he's like a dope. And I -- you know I've watched him cry on television all the time. He's doing very badly. His thing is falling apart, his company is falling apart. I see him on TV. I actually called Bill o'Reilly and said Bill what do you have a guy like that on television? Fox fired him and then he goes out does this thing. We heard he was doing well, he's not. But he's on and the thing that bothered me, he said Donald Trump voted for Barack Obama. Me and here's the problem. The good thing about having a large microphone is that we can at least explain to people that these people lie, they lie so much. The reason he doesn't like me is because I didn't do his show. He asked me so many times, do my show. And I didn't do it because I don't respect him. I did it because -- no, I'm so busy. I couldn't do a show. This was a quite a while ago. I couldn't do a show and just timewise and then, all of a sudden enough time goes by and I understand that. So he started hitting me and that was the end of that. But the guy goes on television last night with o'Reilly says that I voted for Barack Obama, and I'm on John McCain's committee raised a tremendous amount of money for John McCain had dinner with John McCain and his wife very, you know, right before the election. And I got to listen to this idiot named Glenn Beck saying I was for Obama. And I say, you know, it's sort of interesting. Most people wouldn't bring it up. Most people don't even see it. But it's sort of a good thing to bring up if you can. If you can have the experience of talking to people because some people, see something like that and they believe it. There's nobody to refute them. Do agree with it? You get it. I absolutely do. I like to bring it up because you know, he can say other things and you don't bother. You don't want to waste time. All you do is make him a little bit bigger but he's a failed guy. But you know, I like to bring it up because I like to let people know it's so dishonest out there with the media. It's so dishonest. So we like to do that. The thing that I've learned more than anything else is how smart the public is, how caring the public is. And you know when I fill up stadiums, I fill up places it's incredible. Like today, I mean, look at all these people in this snowstorm. It's an amazing thing. They're doing it because you know my theme is Make America Great Again. And what that's it. It's very simple. It's make America great. And it's very simple but very factual. That's what we're going to do. We're going to make it great. And I actually said because after, you know, I didn't say that in the beginning. But I go to Dallas, we have, Scott, 20,000 -- 21,000 people. Moby, Alabama had 35,000 people. We had in Oklahoma 20,000 people. When I go to New Hampshire, I have you guys know, I have the biggest crowds by far. In Lowell, we filled out that arena. We had to send away 7,000 people which still I'm going to go back away to take care of those 7,000 people. I felt badly, but you know that big arena which people don't even use because you can't fill it up. We not only filled it up. We had to send away 7,000 people. But whether it's New Hampshire or Iowa, South Carolina, we're doing so well and the reason is because people really want hope. There's no hope with these people that we have running for office, except for him of course, but the reason he's not in is because maybe they gave up on hope and here's a good man by the way. This is -- I hope you're going to do it again. Are you going to do it again? I hope. We got to look some -- we got to get him back. We're losing our good ones. We're keeping the bad ones, we're losing our good ones and he'll get -- the right things are going to happen and we'll be behind him 100%. We have to re -- because he's vice president. Hey, that sounds like a good -- Hey, hey, hey. What are you doing? Central, hey, you know what? and he's central casting. Look at that guy, he's central casting. Ah, he's great. A great guy and a great -- beautiful great wife and family so, so important. So what I have seen is the level of enthusiasm and the brilliance of the people, the people as a unit. It's so -- the people are so smart. They really, really get it. And frankly, if they didn't get it, they wouldn't be they wouldn't be showing up in these massive numbers because I think you'd agree Scott, this is like a movement. I got a call from one of the top writers and he's a liberal writer, but you know that's all right. We can get those calls every once in a while. We don't want to take too many of them. But he said to me and this was three months ago. The summer had, you know, sort of ended and we were doing really well, and they called it the summer of Trump, and he said can I ask you a question? How does it feel? I said how does what feel? He said how does it feel? You've dominated everything. The whole conversation is about what you are and about what you're saying more importantly, how does it feel? I said it doesn't feel anything. To me, unless I win, what difference does it make? He said no, no, no, it matters because you've changed politics as we know it. I said no, no, you're wrong. If I don't win, it doesn't matter. And when I say I don't win, I mean, at the top because otherwise all of these things, whether it's the strength of the border, whether it's any of the other things. The deals, the horrible deals that we made, the trade deals that we have, putting the right people in place, I mean, China is making 500 -- you look at -- we have a trade deficit this year with China. $500 billion, not going to happen if I'm running things. Not going to happen. So, so essentially, I said and I respect him because the Summer of Trump, then he said, and it's the Autumn of Trump because I spoke to him recently. I said it still doesn't matter. It only matters if we win because I can -- you know, look at all these beautiful headlines and today the editorial of The Wall Street Journal, The Wall Street Journal was really nice today, and they talked about the debate and the different things and they were very nice. But it all doesn't matter unless we win because unless we win, we can't put the right things into gear. And I deal with the politicians and they're all talk and no action. When I say build a wall, they don't even know what the hell I'm talking about. They don't know where to build. They don't, they really don't know. They don't even have a clue. And when I say the different elements that I say it very strongly, they don't know. For instance, who's going to pay for the wall? Mexico. Mexico's going to pay for the wall. They're going to pay. Remember, remember I said they're going to pay for the wall. The politicians come up to me on the dais, a couple of them. Nice people. I get along actually with most of them and they say Mexico won't pay for the wall. I said Of course they will. Every business person in here knows what I'm talking about because they make so much money off the United States. Do the business people get it? Did you guys know what I mean? The pilot -- I bet this guy does, right? I called, hey, if you're making many billions more than the cost of the wall, they're going to pay. They're going to pay. Nabisco is moving to Mexico. Ford moving to Mexico many, many companies moving to Mexico. They're going to pay 100%. Not like 99-point, they're going to pay 100%. Now maybe in different forms. You know, you have to have flexibility because maybe they won't want to do it one way. They will do it the other way. If they don't want to do it, they'll do it and we'll get along with them better. We'll get along with them better than they get along with her right now because right now they take advantage of us. I know Mexico very well. I have thousands of Mexico -- people from Mexican and Hispanic employees, tens of thousands over the years, tens of thousands. They're fantastic people. They're unbelievable people, but the leaders are too smart for our leaders and they're too cunning. It's an important word cunning. They're too cunning and what's happening at the border is a disgrace. It's a disgrace. The whole thing is a total disgrace. You know in Mexico, it's probably the hardest, but one of the hardest is if Scott and his beautiful family want to become citizens of Mexico which is unlikely. I think you're very happy in New Hampshire. It will be impossible for that to happen, OK? Impossible. Impossible. Here we have people go through and they you know, walk in and essentially, they might as well be citizens because the illegal immigrants are treated better than our vets, but they're treated better. I'm telling you. They're treated better than our vets. And Scott knows, I mean, I had a friend that went to Mexico and he was there and he was there for like a week, and he was there with his family and he was an extra day or two days because he had a problem with transportation. And they get called by the guards. When are you leaving? Oh, why are we leaving? Well, you had a pass today, by the way they're right, it's not the wrong thing, with us it's what are you leaving? How about twenty 25 years I'm going to leave, OK? I'll leave when I want. We have our border patrol people who actually called me. They want to meet me and I met with them in Laredo, Texas. These are incredible people. They want to do the job. They're saying stand back. They're told to stand back. They're told stand back. These are people that can do the job and they're told to stand back. So we are going to have an amazing country again. We have a great country, but we going to make it so much better. We're going to make it so much sharper. We're not going to be the stupid anymore. We're not going to have leaders that are incompetent. They don't know what they have done. I guarantee you, I talked about so much the prisoners with the Iran deal where we give them $150 billion and then they treat those sailors like -- did anybody get sick at watching that scene? Yes. Yes. Yeah. Think of it, you I know you. You would have gotten totally sick. I wouldn't have wanted to call you then. Sick and angry with -- you know when people said somebody they would say that day, Trump is angry. Of course I'm angry. I want to be angry. Who's not angry? And you know they wanted me to say no, I'm really not angry. I'm wound up so happy with the way the -- the country is a mess. I am angry. I am angry. I won't be angry for long because when I fix it, I'm going to be very happy. But right now -- thank you. But right now I am angry. But think of the scene. You have these 10 sailors. I don't know what happened. They went I guess it sounded like they took a little shortcut through a big body of water. OK, big deal. And they get locked in and they drop to their knees in a begging position hands up guns to their heads. And this is supposed to be our ally and trust me, trust me, folks. In this -- one of the stupidest deals ever made which by the way won't do a thing in terms of nuclear, other than maybe proliferate, OK? You're going to have more because other people now are talking about getting it because this deal is so bad. We've made a terror nation a very rich nation. More importantly, we've given them Iraq. We've handed to them -- they've been trying to get Iraq forever, as far back as you can go in time, they've wanted Iraq. And Iraq has by the way, people don't know, it's the second largest oil reserves in the world. So not only did Iran get this deal, but they got Iraq cur -- courtesy of the United States. Now they've taken over Yemen and the reason they went Yemen is take a look at the border with Saudi Arabia. It is a long beautiful border right along Saudi Arabia because they want to go get that oil too. I mean, what Iran has done is incredible. But $150 billion, I have been mentioning this so much and I guarantee you the United States has been putting so much pressure. Please give us our prisoners back please, please, please. This should have been done three four years ago when the deal was struck, before the deal was made. And this is the world's longest deal. They should have said we want our prisoners back. Now the reason and what's happening, the reason they let the boat, the sailors go is because in two days they were getting $150 billion. And these are smart people, they're not going to say well, we're going to keep the same. They had to get the money so they let them go. I guarantee you, Scott that if that money weren't in play, they would've kept those sailors 100%. They would have kept them just like they kept the four people. Now I have to see what the deal is for the four people because somebody said we're getting -- they're getting seven people back. So essentially, they get $150 billion plus seven and we get four. Nah, doesn't sound too good. Doesn't sound too good. But we have to see because this -- I just heard about this an hour ago, but -- and I'm happy they're coming back. But I will tell you, it's a disgrace that they've been there for so long. It's a disgrace. Remember that. A total disgrace. So when we started, just finish and then Scott and I will talk for a couple of minutes. But when we started, it really worked. And very importantly, it really started off as trade and border and this. Then we had Paris and then all of a sudden it started looking like this whole situation was taking a very, very deep and dark. It was becoming a very deep and dark picture. And all of a sudden CNN did the first poll and they're all back there. I want to give them any unnecessary credit because it's not like they treat me great, but they do these polls and the polls, I guess, they're legit with their polls because Trump is always winning in the polls, right? So I like it. But they said you've seen this Scott. Who wins on security? Trump. Who wins at the border. Trump. Who wins on the economy. Trump by so much. And by the way, I don't mean Trump like Trump gets you know a point where Trump gets double, triple, quadruple, much more than anybody else. And then who wins on ISIS and who wins with a military? Trump. Trump. Trump. So you know all of a sudden and this started happening, you know, pretty much since Paris, and then you had the horrible situation and in California with the couple. She comes in on a fiancee permanent and she's radicalized and the other guy's probably radicalized, but he became radicalized and they killed people. They gave them a wedding reception. People gave them a wedding reception. I mean, something's going on. We have to figure it out, folks. Something is going on that even today I'm leaving, and I'm seeing what happened. Today, a hotel was blown up, many, many people dead. They don't even know how many people. Just blown up. Just blown up. Innocent people, blown up and the World Trade Center, we're talking about World Trade Center. Flying airplanes into the World Trade Center, into the Pentagon, third plane who knows where it was going. Who knows? They say it was going at the White House but who knows where it was going. Brave people on that plane by the way. Brave people but, but really brave people. But something's going on. And so it's changed very much and I have been talking much more about the military and they have much more confidence in me with the military than they have with these politicians that don't know anything. And they don't believe me they don't. And everything is, you know the word unpredictable Scott, and so sometimes it's very tough for me because they'll say well, what do you do about this? What do you do about this? And I want to say, you know, I have a chance of winning. I don't want to really tell you what I'm going to do like on military. Like I've been saying oil, take the oil, take the oil. I never wanted to say it. I wanted to surprise them, right? But it got to a point six months ago when I had to say it. I was saying to them, no, I don't want to tell you. I know what to do but I don't want to tell you. And they'd say, oh, he doesn't really know. Finally, I had to do it. I mean, you have to win. I hated to tell them take the oil and then the government said you can't take the oil. You can't do that. You can't, can't do it. General MacArthur couldn't do. General George Patton they would have had the oil four years ago. They would add the oil. He would have had the oil before he stepped out of his airplane, right, to claim victory. But it's one of those things. So a couple of weeks ago, a couple of, you know, right after Paris they started taking the oil. Finally, finally, but I said take the oil and keep the oil. They just take the oil. They just bombed the oil. I said take it. No, you keep the oil. Folks, you buy it, you keep it right? And then you distribute it. You take some and you give some to the veterans and to the wounded warriors and to the families who lost people. And you give some to the families that have had death and horror in their lives and what have we got out of Iraq. We've gotten out of Iraq. I'll tell you, $2 trillion at cost, thousands of lives, wounded wars who we all love all over the place. We get nothing and they won't even listen to us. And now Iran is taking Iraq. So I said keep the oil we give some to people that really were affect. I mean, you have families that lost sons and daughters they got nothing. They have nothing. So I just say that we're going to run a country properly. We're going to be respected again. And it's great that you're here. And if I don't get the hell out of here soon I'm never going to be able to take off. All right, all right, all right. So he'll ask me a couple of quickies. Yup. First of all, thank you very much Donald. Thank you for that wonderful presentation. Thank you. Thank you. Let's hear it for Donald Trump everybody. So Donald, you already talked about I think at great length right now about the border and your position on that issue. I am somebody who served 35 years in the military. I was the rank of Colonel, last four in the Pentagon and I've had many people come up to me who are probably going to raise their hands. But I'll ask the questions for our veterans. You're right the VA is screwed up. You have people that are hurting, they're dying while waiting in line, and they pooh, pooh and they pass a bill after -- actually after people are dying and they still have not done anything. The question from the crowd is what will you do to have the backs of our veterans? Well, first of all, great question. The VA is one of the most corrupt enterprises in all of Washington and the country. It's so poorly run. It's so poorly run, and with that being said by the way, I've met some people that are really great doctors and some of the people are even saying some of the doctors are fantastic. But the administration is largely corrupt and it's a disgrace. What's going on with the VA is a disgrace. So do you hear somebody scratching? I hear somebody scratching. Let me tell you, who the hell is back there? But the VA is absolutely disgraceful and we are going to run it professionally. Great. And one of the things we're going to do Scott, you know, one of the biggest problem, people are waiting six, seven days in a reception room trying to get a pill or a minor procedure. And many people are dying while they're waiting and we're going to work this system and I put out a policy which I think most of you have seen. Certainly, the veterans have all seen it and it's been really praised. When you have six day waits and five day waits and the doctors can't see you etc. You're going to go to the local hospital, you're going to go to a local doctor, we're going to pay that bill, and you're going to get taken care of properly and quickly. So that's the way it is. And you know in the end it's cheaper. In the end it's going to be a lot cheaper. So we're going to do that among other things, but the vets will be taken care of well. Thank you very much for that question. Another question that's come up as I've been walking around, and by the way, this front monitors picking up something or you turn it down. A lot of folks are deeply concerned about the $19 trillion and rising national debt, our deficits the fact that we have the highest corporate tax rate in the industrialized, rules and regulations, including Obamacare and others that are just crushing businesses like this and others, people that are here, what is your plan to deal with the economic challenges, including our debt and deficit? Well, first of all we're going to repeal and replace Obamacare which we have to do. I've been -- premiums are going up 25%, 35%, 45%. Your deductibles, you'll never get to use it. You have to be hit by a tractor to use it. I mean, the deductibles are so high now that you'll never get to use it. So Obamacare is a disaster. And honestly, it's going to fold by 17 anyway. It's you know it's folding because all the people that they didn't think we're going in are going in, and the people they did think, meaning the people that pay, they're not going in. So we are going to get rid of Obamacare and we're going to put it -- we're going have a great plan and it's going to be much less expensive plan, and it's going to be a plan that's much better for the people. So much that when I look at -- I watch a guy like Jeb Bush who's totally in favor of Common Core and I say no wonder he's down at 2%. No, no, how -- can you imagine? Jeb Bush is in favor of Common Core. Totally against Common Core, me. Totally against, we're going to kill the Common Core. We're going to bring education back to the local communities where it should be. We're going to have great education. Don't forget, with all of the money we spend, with all of the money, we spend so much on education, No. 1 in the world. So when No. 1 per pupil in the world by a factor of you have no idea by so far ahead. We're number 28 in education. We have third world countries that are ahead of us. So we're bringing education back. We're getting rid of Common Core. While I'm on a subject, Second Amendment, we're going to cherish and protect our Second Amendment. It's under siege. It's under siege. And we're going to be cutting a lot of the fraud, abuse, waste as so much of it, and we're going to start chopping down that $19 trillion. Hard to believe, $19 trillion, but we're going to start chopping it down, and we'll chop it down very significantly, quickly. And we're going to bring jobs back to this country. Believe me. Thank you very much Donald. Just so you know when I was there it was $11.95 trillion and you see where it is today. Now we have a question right here. This young lady in the nines who have a question right there. Hi, I just want to ask. So college debt is a huge problem right now, and luckily, I go to university that I get to go for free because I'm under like an income gap. But student debt is a huge issue, and I wanted to know what you were going to do when you're president, Mr. Trump. It's one of the biggest questions I get from young people because I go all over and its student debt. One of the big answers obviously, Scott is jobs. Because you know the biggest problem is they graduate, they don't mind the debt as much as they mind the fact that they go through four years or two years of college, and then they get out they can't get a job. So we're going to create jobs. I always say I will be the greatest jobs president that God ever created. That's what I do have thousands of jobs. So we're going to create jobs. So important, but you know what's happened? Students are going out. I've been watching this process and I'm not even blaming the God, sort of natural. It's a very bad system in a way. Students go out and they borrow money from the federal government. Now they have the money and the colleges keep going up, up, up much more than they should be going up because all they do is take all this money. Because essentially, they're borrowing it. They just have the students are like a middleman. They're just taking from these students. So there's no incentive for the colleges to bring costs down and the college, the college costs running the college, they're going through the roof including salaries for the top people. I'm looking at salaries at some of these people are making and it looks like they're running General Motors or when General Motors runs properly. But it looks like, it looks like they're running, you know, a major corporation. And it's really a problem because -- and I understand how the system works, and that's sort of the way the system works. But the way we have to do it is we have to go in and check it because what's happening in the colleges, they're taking this money and the next year they go up and the government gives more money to the school. So the one that suffers, the people that suffer are students. I'm going to solve the problem, OK? Thank you. Good question. All right. We have a young lady right here. If you could hand the mic straight back to this young lady, right there. Raise your hand high young lady. Speak right into the microphone. So I have a -- I have a two-part question. How are you planning on keeping the country safe from international threats? OK. That's a very big question. Good question. Good question. It's a great question. I hope the second part isn't quite as big. That could be a part five question. Look, we need a strong military. Right now we have a military that's under siege. When General Odierno left a few weeks ago he said that we are the least prepared that he's ever seen our military. And yet, we should be the most prepared because we have the world hates us. Obama and Hillary have the job. I mean, the world is under flame. The world is, is burning and they hate us. And if you think about it, during the Obama administration, look what's happened. And our military has become absolutely, I'm in the real estate business, I get these listings for military bases all the time, military base. I see how many of these things are we giving up? You know we have military bases so many are closing. We are going to have a military that's so strong and so powerful that nobody is going to mess with us. Believe me, OK? Nobody. And I have to add and I think you would agree. You know, it's very costly but that's cheaper than what we're doing now. Absolutely. And your second part to your question? Can I take a selfie with you? We'll see you after. You come right down here. Come on Scott. Don't be a party pooper. Come on now. Lift her up, Kevin. Lift her over the railing. Wow, OK. Lift her up over there. Come on, Kevin. I have a bad back. I'm not lifting her. Here we go. I don't think Kevin -- be careful. I'm not strong enough. Be careful. Come on fellas, help her. The owner is going to help. He's a strong guy, he lifts cars all the time. Come on. That's it, darling. Come on. Great. Come on up here. Scotty's a party pooper. Come on. No, I'm not a party pooper. Obviously, he's not running for office. If he was running, he would have said come on up. I have instructions. All right, all right. Good job. Good job. Good job. Thank you very much. I have a -- the gentleman with the glasses right there with the green shirt. You're going to have to speak up, there's no mic. Oh, there's a microphone right there. Thank you. Donald, I think the border is paramount. Without getting the border and immigration, none of this -- the rest is irrelevant. We've got to get this border under control, the immigration. Are you going to make a commitment to seal that border? Close the immigration down for a couple of years until we figure out what to do next? I'm the one, you're talking to the converted. You're talking to the converted. I mean, forget it. We're going to have a border. You know if you don't ever, I just was interviewed by George Stephanopoulos. If you don't have a border, you don't have a country. You don't have a country. Where we have a country, we have a border that's like a piece of Swiss cheese. We are going to have borders that are so strong. The wall will be built. It'll be a real wall. That'll be a wall. This will be a serious wall. But we're going to have a border. We're going to borders all over and we're going to stop the whole thing with the visas where people fly in, you know, because the borders' 50% of it. But we also have people coming in through so many different ways. We're going to have a real strong country again. And we're going to want people to come in and we're going to want people to go through the process. We want people to come in to have to come in legally, OK? Thank you very much. There's a gentleman in the green shirt right there with his hand up. One of the main principles of your campaign is to annihilate ISIS. I'm sorry your -- hey, who cares? Guys, who cares? What's your question? One of the main principles of your campaign is to annihilate ISIS, after you do so besides taking the oil, what will you do to bring stability to the region and prevent some of the mistakes made in Iraq. OK. Well, I have to be honest with you. This has been going on for a long time. Stability to the region. We've been doing this for 15 years. We've become a debtor nation doing it. Our roads are falling down, our highways, our bridges, I mean, our bridges are in such bad shape, they're like 50% up and considered unsafe. We have to rebuild the United States. We have to rebuild the United States. Now we got to get rid of ISIS. You know, I was very proud to say, and to you know, everyone says oh, Trump is this tough guy. He'll be fast. I'm slower on the trigger but I'm a tough guy. I'm the strongest guy militarily that you can ever have, OK? I am a -- I always say I am a militaristic person. We're going to have such a strong military. But you know what? It's time, folks, for us. We're going to get rid of ISIS. We're going to get rid of it surgically and fast because you can't allow them to cut Christians heads off and everyone else's heads off. That's from medieval times. You know, Scott, I used to read about that and I said you know, this is no different. We're living in medieval times. We're living in times that are just as bad as they ever were in the history of the world. They're cutting people's heads off. I used to read that when I was in history class. The viciousness, right? Medieval times, boom. We're doing the same thing right now probably more viciously. We are living probably the most vicious time. We have people that are disgusting, disgusting animals and we're going to stop that. But you know what? We've got to get back to a country. We've got to bring our people back and we've got to let people know that if they mess around with us, they're going to be gone. We're going to wipe them off the face of the earth. We're going to wipe them All right we have -- we have one more question right there, Donald. And then, this will be the last question then, Donald. You're going to go down and you're going to go. And -- but before we ask that question, Donald, what is the web site that people can go to, to either volunteer or help out and spread the message? donaldjtrump.com. All right, there you go. Donald J -- and then, in New Hampshire by the way, the polls are coming out. We're leading by like 20 points. We're doing great. But you know what? Please do me a favor. Go out and vote because if we don't vote, we're all wasting our time folks. It's never going to happen. We have a question right here, ma'am. Thank you so much. Soon to be president, Donald Trump. Thank you. What are you going to do about -- I have tried to reach out to you a couple times. I am disabled in many ways. I am an NFL player and less than four years, nine concussions. I've not recovered from one to the next to the next. And as for my physical things, I'm not supposed to be standing here. I wasn't supposed just trudge through the snow. I was not supposed to do anything. I've been fighting for SSI or disability for three years. In 2008, I was in real estate as well, my love, which I can't do anymore because my brain does not function and filter anymore. So what's your question, ma'am? I lost everything in 2011, four nights ago, there's a place a mile down the road. I now live in a homeless shelter. How do I get disability and have this process move forward quicker? Well, I know you have a very tough situation and I think the best so that we don't keep everybody. I'm going to have somebody see you afterwards and let me see your situation. I mean, the truth is everybody's situation is different. But we'll see your situation, OK? Thank you and you're right down -- Are you right down a crossroads, ma'am? You're at the crossroads? OK. They go to a local state rep, you can see representative Baltazar as well and we'll tie that in together. Where's Al? Is Al here? Yeah. He's right there. I don't see you, you're behind the column. That's first time I've ever seen you in the second row, Al. Well, we put him in the -- we put him behind the column for a reason, Donald. Yeah. Good reason. Good reason. No, he's a good guy, working hard. Take one more or are we done? Take another one. Take another one. Take one more, take one more. Right here, ma'am, in the purple. Right there. Hi, Mr. Trump. Hi. My question is I manage property and I have a lot of friends that are small businesses, contractors landscapers. They have a hard time when they employ U.S. citizens, pay taxes. They have a hard time competing against businesses that I see a lot of them that employ illegals. They don't pay taxes; they pay them under the table. Do you have a plan to address that? Well, we have to stop the illegals. We have to put our people to work. But there are visa programs where we can bring people in if you can't get people for jobs because we don't want to stop our economy. So we have as part of it, visa programs where you can put people to work because we don't want to affect the economy. That's one thing I don't want to do. We want -- our economy is very weak. We have the slowest recovery in history. It's not even a recovery. And if you look again, you know, you hear these phony jobs numbers. People that were looking for jobs that gave up, Scott, they gave up looking. They now -- they're considered employed. So you have 100 million people that would like to work and they can't work. So we will be able to take care of that situation beautifully. But we do want our people working. You understand, OK? Thank you."}