{"id":476,"author":"Donald Trump","title":"Speech: Donald Trump in Myrtle Beach, SC","date":"2016-01-16","link":"https://factba.se/transcript/donald-trump-speech-myrtle-beach-sc-january-16-2016","paragraphs":["Maybe be against me and they were all for me and I felt much better. But they were all waiting and it's really great. How are you? Good, good. I just got in and I was in New Hampshire, where we're doing great. And we're doing great in Iowa. We're leading now in the polls in Iowa. Sit down. Everybody, sit down.","Go ahead. We had a great group. But we set the record on the groups. I love you too, darling. Who said that? Stand up. I love you. I love you. Thank you and I love that book. You know, I want to thank Joe Dugan, who has been fantastic. He is a good guy, really good guy. He puts his heart and his soul into this and nothing's easy in life, I can tell you, but Joe has been doing it for a long time, so he's a very special guy.","We have a couple of things to discuss. You know, the beautiful thing is that I don't use teleprompters because I speak from the heart, right? And the head but the heart. Perhaps, I go the head first and then the heart because maybe that's more important nowadays when you look at what's happening to the country.","But I like to be able to talk about current events and when you read the speeches, you know, a lot of the guys get up and they read a speech, bah bah bah. They leave in 15 minutes. Everybody goes, what happened? That's all there is? You know, like don't like the song, Is That All There Is. So we don't read the speeches and we don't do the teleprompter thing.","But a couple of things, I want to talk about the debate because I thought it was a great experience it's been a great experience for me. It's been for me, for me, it's been a great experience. You know, I've never -- I did. Yeah, I guess. Thank you. Who said that? Stand up. Let me see. That's very nice. Well, we've had some interesting debates and an interesting time and it is different.","You know, I've been a job producer. I've built a great business but it's been job producing and employed currently thousands of people and over the years, tens of thousands of people, many Hispanics. And I say, we're gonna do fantastically with Hispanics. I think we're going to do incredibly with the African-Americans, where I pol very well.","And somebody said there was a poll that came out at 20% or 25%, actually it was 25%. And they said, if Trump gets 25% of the African-American vote, the election is over. You win. I mean, you win. But we do poll great with that and we poll -- we've just polling -- I mean, no matter where I have a list. I'm not going to go over it very much and this group.","this is a very intimate friendly group. These are my friends but. And normally, I love to go over the polls because I'm number one in every poll, virtually. And I love, I love to go over them but here, I'm not going to bother other than to say, New Hampshire through the roof And we're going all over.","We are not playing games. We're not going to do what they did the last time. Because if you remember the last time, we should have beaten Barack Obama. We should have beaten him. Something happened. Something happened. And I'm not blaming Romney, but you got to work that last month. That last month was important and whether you like Obama or not, every time you turn to on television, he was on Jay Leno and Letterman and all these and our representative wasn't. And we got to work and we have to work hard and we're to win this thing because having four more years of Barack Obama -- but I think perhaps worse depending on what happens with Hillary.","I don't know. Maybe these guys -- but look at all those cameras back there. Well, that's very impressive. That is very very -- That is an impressive. I thought this is going to be a just a little quick stop over with my friends from the Tea Party and Jerry and Joe and all of my -- Look at that group of people.","I guarantee you they weren't here for the other groups. I guarantee. I know. I know. You know, it's always tough when they come in. I think every speech I've made in the last two or three months has been on live television, right? Say, can I have I have a speech which isn't on live television? You know, it would be nice.","No? No good? I like it. I would love to do one or two. Before this campaign, -- Well, actually that's not good because that means things are not going well. If they stopped turning on those televisions that means things. So we'll continue to go live, OK? But it really has been an interesting period of time for me because I've been a businessman and I've been a negotiator and a job, you know, employer, real estate person, done a lot of different deals.","But mostly, Brosseau real estate and I've had a great time. I love the real estate business. I love doing what we're doing. We're building all over the world and we're doing deals all over the world. We're doing a deal right on Pennsylvania Avenue, a big hotel that's going to be spectacular right by the White House.","It's sort of interesting because one way or the other, I'm getting to Pennsylvania Avenue. One way or the other. I'll either be here or I'll be here. Not so much difference. But -- So it's one way. But -- and it's sort of interesting, it's the post office. And everybody, so many companies wanted it. It's one of the most sought after projects in the history of the General Services Administration.","And it's an incredible building, the Old Post Office and we got it, which is amazing. We got it in the Obama administration. Can you believe that? Well, can you believe it? I was even surprised. I said, you know, I think we had the best plan. They wanted to make sure of everybody was very strong financially because they want to get it done.","It's very important economic and economic development. And we put our plan in and others put that in, you know, great companies, many many companies and great companies, the biggest hotel companies in the world. And we were giving it about two years ago, we started construction and we're about a year ahead of it. Can you imagine that?","A year ahead of schedule. We're under budget and ahead of schedule, which is what the country has to do. It's really what -- what do you think, right? It's what the country -- So we're under budget substantially and I will tell you, under budget and yet we're building even beyond because it's so good. We're going to make that.","We think it's going to be probably maybe the finest hotel in the United States. We're going beyond that but it's gonna be one of the finest hotels in the United States. I have one of them right now in Chicago. It's considered one of the great hotels of the world. I think this is going to be something. I don't want to say, top it. You don't wanna say top your own self.","But this is something that could conceivably top it. It's gonna be great. But the beauty is that when you hear those words, ahead of schedule and under budget, and I think that's so important because I mean I see these projects and I read about the projects. I read about one the other day where you know they're building an airplane and it's it's five times over budget and it's years and years late, sometimes decades late.","And by the time they get it, it's obsolete and they've spent, you know, billions and billions of dollars. And you look at what they do with the submarines and the nuclear submarines and all of the tremendous cost overruns that they have. And I just, you know, you build and you've got to build and you got to know what the hell you're doing and you got to get it done.","And you've got to fight with the contractors. And there's so many stories I can tell you about government. I mean, a little one just quickly is the Wollman Rink. Eight years and the city couldn't get the ice skating rink open in Central Park. And I got involved. This is when I was young, but there's nothing different.","I mean there's no difference. I just did one recently, which is almost the same thing in Ferry Point. They couldn't get this big golf course project open and it's been under construction. They think for 30 years, OK? Think of that. It was a landfill and just every -- they don't even know when it started.","But a long time ago and it would have -- I think it would have gone on for many many more year. And I got it done in a year. It's open now. It just got the best best new course in the United States from one of the big magazines and it's doing great. But it's not that big I mean although, they I tell you something, world's most expensive golf course, they spent over $200 million to build a golf course.","OK? Watch it, of course, maybe seven, you know? Bt they spent over $200 million to build a golf course and I think it's much more than that. Nobody even knows. Do they know? They have no idea. You know when you say, is it two? They say, we don't know. The money and here we're talking about local government.","Can you imagine what the federal government is wasting? And when you see the kind of waste, fraud, corruption, it's incredible. With the Wollman rinks, I had a, you know, an ice skating rink and I have a daughter, Ivanka, who everybody knows. She was a little girl now. And she said to me, Daddy, I'd like to go ice skate.","I said, honey, it's gonna be built next year. Don't worry about it. It would look down on the rink. And next year, she'd come, what about ice skating daddy? And I'd say, maybe. It's a mess. I mean, it's really. And then finally after about three, four years of her asking me, you know, it's an ice rink. It's not that simple, but it's an ice rink and it's massive.","It's one of the biggest and it's -- I mean to this day, I've been running it ever since but it does great. But I said, let's just see. So after about four years of her asking, I said, I gotta go look at this thing. And I went down and I looked and there were hundreds massive piece of concrete, you know, probably six, seven, eight times the size of this room.","And I said, man, look at all those workers. They're all workers and they were all sitting there and nobody's working. And this has been going on for years and years and years. And I went to the mayor of New York City, who at the time was Ed Koch. I said, Ed, this is ridiculous. I mean, forget about my daughter.","I'd like to get her ice skating, but the whole city. And it was like a big scandal. It was on the front page of the papers. They couldn't get an ice skating rink. So it wasn't that easy with him, believe me, because he didn't want to be stood up. He was a very paranoid guy, that I can tell you. And finally, I went to the newspapers.","I said, I want to build it. I want to get it open. I'll get it open in four months. And if I can't do it for $2 million, I will pay for the costs myself. And they had spent probably, you know, they don't say this another way. You never find out what these -- I think they spent over $20 million on it. But I said, I'll spent and most of the money that I was going to spend, a lot of it was demolition because you had to tear down everything that was built because it was built so badly.","Anyway, finally, he agreed to let me do it. I took it over and the ice wasn't melting. They couldn't get ice and the slab was poured and it was this far off. In other words, it was gonna be level. So the water is thin and nice and you create ice, right? Well, one part, the water was like a foot and a half high.","The other part, it was down here so they couldn't make the water. And I said, man, that thing is really off. So we had a rip out the entire slab. And then I saw the man, who was the freezing man. I said, where is your office located? He said in Miami Beach. I said, Miami Beach? He said, no, I've never done on ice.","We focus on air condition. I said, that makes sense. I like air conditioner but I don't. So I said, well, what's the problem? And I said, you know what, a friend of mine worked for the Montreal Canadians, the ice hockey team. I called him up, I said, Charles, could you do me a favor? Do you have a guy that does anything about like making ice?","Oh sure, we have a guy. He's great, in-house. He comes down, he looks at me, he sees it, he comes close me, 10 minutes out. He said, Mr. Trump, you're using freon. You want to use water with salt in it. I said, what do you mean? He said, you have freon they're pouring. You have to see this. They have tubes of copper and the tubes of copper are miles long because it goes from one side, they have to be three inches apart.","Goes back forth back forth and they put the copper and copper is very expensive and very valuable. So every night, they'd lay the copper. They come back the next day, it was all stolen. OK? So they lay it again, they lay it again and then finally, they went and hired a big security company that guards all around the rink.","And the other problem with this is this little pinhole, you got miles of this stuff because it's so long. And if there's a pinhole, the gas escapes and you don't make the ice, OK? It's just one of those things. So I said to them. what's going on? So they finally got security and they were great. They did for seven days.","And then the security took a day off, the entire rink was wiped out that -- this went on for years. Somebody made a fortune on copper, anyway. So I get this guy down. Nice guy from the Montreal Canadiens. Real real hockey people and ice people. And he said, Mr. Trump, what you want is a rubber hose. You put water in it and you put salt in the water and the salt means the water can't freeze.","I said, wow, that sounds good. He said, we call it brine and the machine and the machine takes it, mixes, puts it through. It's simple. And you need rubber hose, nobody steals it because it's rubber. Who the hell wants rubber? I guess, they steel rubber too, right? In New York, you know, maybe they'll steal, maybe they won't. Actually, New Yorkers have very high values, they won't steal anything.","Very very very high values. They don't steal. Nobody steals. Nobody steals in New York. Nobody steals. So we laid miles of it. We -- I took out all of the concrete. We laid miles of it of the rubber and we tested. There were no leaks, no nothing. There was no theft because nobody wants it. And we laid just beautiful.","It was all done. Then we called up the concrete guys, we have we had the most incredible pour because it's such a huge slab. And ideally, you want to pour it at one time. All things the city doesn't know. So we -- the construction people know. So we poured it one time, beautiful job. And the cement mixers were lined up, this is at 58 St., 59th St. The cement mixers were lined up to Harlem, all the way back.","That's so long. And they poured all day long. They poured for a day and a half and it was beautiful, perfectly leveled, done with lasers. Anyway, bottom line, turned it on, put the brine through it, the water and, woola, beautiful ice, to this day, it was so beautiful. And I did it for less than $2 million.","And they study it now in the business books. We can do the same thing with our government on a huge scale. I mean, it's the same thing. It's no different. It's no different. Really, it's no different. You know, it's very funny. I like I like Newt Gingrich. Actually, Newt Gingrich did very well over here, but I like Newt.","He's a great guy. And he called me up. He said, you know, I read the story about Wollman Rink. Would you please tell them the story of Wollman Rink. So that story, I haven't told that certain a long time but that story is honor of Newt. But he really thinks it's a great story because it's indicative of what can be done and it finished way ahead of schedule.","And to this day, it's probably the busiest ice skating rink in the world. I mean it's amazing. You should see that on a Saturday. They have lines that are four blocks long to get in and people are great and they're you know they're in love with the place. So if you have knowledge, like, you don't use people from Miami Beach to do a rink with you know.","And by the way, they do use -- you know, use freon for an aircon. That's what they use. But freon for an air conditioner is a little different than -- I wouldn't want to use brine for that right. But it's sort of you have to use people that know what they're doing. But Newt called me up, he said, you've got to tell that story because that's such a great story.","So it is a story and it's been, it's been a great thing and the city saved a lot of money and it's been, it's been really a great expense. And they actually study that. You go to a lot of the great business schools and they study that as to what you can do with free enterprise with private people, with private business compare that to government.","And there's something very true about that and they actually study it in the business books in a lot of the business schools. I think including the Wharton School of Finance, number one business school. So we have a lot of -- we have a lot of things have happened since we, since we made this journey. You know, I journeyed forth and it takes guts to run for pride.","I never done this before and it takes guts. And on June 16th, I said, look, you know, we're just going to do this and I'll never forget standing at the top of that now famous escalator. Because you've seen that picture with myself coming down with Melania and I'll never forget looking down into that vast basement, vast, we call it, the garden level.","And seeing all of these guys, I mean, what you have down there as much as you have down there now, times 10. And it look like the Academy Awards. I said, what are we doing? The Academy Awards? And we gave a speech and we talk about illegal immigration. Oh, wow. I would never say anything. Rush Limbaugh said, he has never seen incoming like he saw with me. Incoming means boom, trying to get you.","And then it turned out that you know you had the killing of Kate, who is an amazing woman in San Francisco, and you had Jameel in Los Angeles and you had so many other things happen. The veteran, 65 years old, a woman 65 years old, a veteran of the Army and she was raped, sodomized killed by the illegal immigrant.","And so much so much so much, you have no idea. And so we should have borders. We have strong strong strong borders. We've got to build a wall. We're gonna have a wall. We're gonna have a wall. And you go up, and you go up to New Hampshire, it's amazing because New Hampshire they're amazing people and they have a tremendous heroin problem.","They have a tremendous problem up there. You wouldn't think, you know, you don't equate that with New Hampshire. They have -- it's one of the first questions I get all the time and it pours in through the southern border. And we're gonna have a wall. Who's gonna pay for the wall? Does anybody know? Right?","Believe me. When I'm on stage with these guys, OK? And it's now guys because Carly is doing the other one, which is fine. Wut when I'm onstage with these guys, they come to me sometimes. They say, why do you say that Mexico is paying? Why do you say that? I said because they gonna pay it. But how can you get him to pay?","Because they're politicians, they're all talk, no action. They don't know what the hell they're doing. They're saying, so they're saying -- no, but it's true and I like some of the them. They're saying, but how can you do that? They -- they can't -- they don't even fathom it. Now other business people understand and here's why, Mexico makes a fortune of the United States.","The wall is peanuts. Peanuts. You know, they've been talking about building a wall for years. China build a wall that's 13,000 miles long, 2,000 years ago. And my ambition is to have ours be much higher. It's not going to be much bigger. You've ever see the width of that wall? It's like three times wider than this room.","We don't need the width. We need the height. But China built a wall 2,000 years ago that's 13,000. We essentially need a thousand miles. It's 2000 miles. But we really -- because you have natural borders, natural barriers that are very very substantial. So we're going to build a wall and Mexico is going to pay for the wall.","Now Mexico, I love Mexico, I love the people of Mexico. Many many Mexican people work for me. And I do business with them. But their leaders are too smart, too cunning, too sharp for our leaders. And we'll gonna have a wall and people can come into the country, but they're going to come in legally. They have to go through a process and they've got to come in legally.","And we're gonna have a country back because right now, if you don't have borders, you have a country. We're gonna have a country, OK? We don't have a country. And so we're gonna have a real wall. It's going to be a beautiful, it's going to be a big wall, it's going to see the ceiling. The ceiling is peanuts.","Believe me. This is not a wall. We're going to many many times and let's put it this way, if somebody ever gets up there, they're not gonna want to come down very fast, that I can tell. So we're gonna have a great wall and it's gonna do the trick. And you know you can ask about walls because just speak to Israel about walls.","Walls work when you have the right wall. Walls work. And when I see it the way we negotiate, for instance, I have been going wild for years about the prisoners. I call them the hostages, our four people. So let's start with the other day, we had 10 sailors, who innocently probably were in a little bit of water that was not perfect.","Instead of saying, hey, folks, you got to get out of here. You're a whole big deal. When I saw those young people on their knees in a begging position with their hands above their head and rifles pointing at their head and I heard the voice of the guy from Iran, I don't know if anybody heard it because they sort of downplayed it at the end.","But the first couple of days I heard this voice, this was not a nice character. This a character I'd like to be doing other things with. Bad guy. And I heard that and you know they're trying to downplay it as much as possible. And then finally, they released them, but they only released them for one person -- you know, one reason and the reason was very simple.","They're waiting for $150 billion, $150 billion. So I've been hitting them hard and I think I might have had something to do with it. You wanna know the truth. Who's using it's? It's a part of my staple thing. I mean, I go crazy when I when I hear about this. You go, you go absolutely wild because how is it possible, we have one who's in there who is a reporter for The Washington Post.","He didn't do anything wrong, by the way. He had something although a lot of the people that work for The Washington Post do, but we won't say. No, Washington Post is -- actually, they've been pretty nice lately. I must be honest with you. But but you have you have a person who's in there because he's a minister, he's a Christian minister.","He's a pastor and you have people that didn't deserve to be there. And then one of the worst prisons in the world and we had to do something. So always talk about. So today, I heard oh they're being of released. Like, it's this big. First of all, it should have taken place three and a half, four years ago whenever the hell they start.","Do you ever see an agreement take so long as this? How long has this thing been going on? Years and years. It should have been done right at the beginning. They should have said, listen, we got to have our prisoners back. They would say, no. You leave the room. They'll call you back. You double up the sanctions.","They'll call you back within 48 hours. 100%, OK? But we waited and waited away. So here's the deal. So I figured, wow, that's a long time. Then they're getting, you know, they get their money today or tomorrow. So the prisoners are going to be released when they get the money, $150 billion. But here's the other thing, we just heard about it 10 minutes ago because I said that's horrible.","It should've happened years before. But they're getting seven people that they've wanted, much more serious, real people, real people, meaning they committed real problems and they're getting, I guess, 14 or 15 other people that are on the watch list of terror and other. These are really bad dudes and they're being taken off the watch.","So they're getting essentially 22 people and $150 billion. So here's the deal. We give them, OK? We give them $150 billion. We give them essentially 22 people, 21, 22 people. But these are people that really did have problems and we're getting back 4 people that didn't do anything wrong. That's the way we negotiate.","That's the way we negotiate. It's so sad. It's so sad. And this has been going on forever. Bergdahl, we get Bergdahl, a dirty rotten traitor, right? We get Bergdahl, Sergeant Bergdahl, how did he ever get to be a sergeant. We get Bergdahl, we get Bergdahl and they get, what, five people, killers that are back on the battlefield.","The press thinks they're not back. They're back. Believe me, they're back. Five people that they most wanted. They're back in the battlefield or will be, top level people that they've wanted for nine years. So we get a dirty rotten traitor then I'd fly back -- I swear, I'd fly him back, I'd drop him right the hell right in the middle of that.","I would drop him. And don't forget, folks, you know, because I've seen the parents, five people at least and it could be six. But at least five people were killed looking for Bergdahl. You know, they went out looking for him. This is not friendly territory. And they went out looking for him. So at least five people were killed, were killed looking for Bergdahl.","And now Bergdahl is going to drown. And a lot of people say nothing's going to happen to him. Now in the old days when we were strong as a country, would have been shot. He would have been -- like fast trial, fair trial, fast trial, boom, if he's guilty, he's gone, right? That would have been 40, 50 years ago.","20 years ago, at least he'd be in prison for a long time. Ten years ago, he would have been in prison maybe for a short time. Now, they're talking about nothing. Six people, five people, I'm almost sure it's six because they say another one too. And I saw the parents and they think. But I'll tell you what, we have to change our ways.","We have to be smart. We have to be vigilant. We have to be tough. I turn on the television today. What do I see? Islamic, right? Right? Radical Islamic terrorism. That's what I see. Oh tell. Blown up, blown to pieces, hundreds of people horribly wounded and burning and running onto the streets. I mean, they say, 25 killed.","That was as of this morning when it happened so you know the number is going to be a tremendous number. Someone's We got to be careful. We can't just do this. We got to make sure the Syrian, the migration. We don't know where these people come from. We don't know where they come from. We don't know where they come from.","We have no idea. You know, the story of the Trojan horse. This could be the ultimate Trojan horse. But we have no idea where they come from. I have a big heart. I mean, I actually do. I'm the world's most militaristic person but that doesn't mean I want to use it. I want to have it because we need it and I'm the one that didn't want to go into Iraq.","And you've seen that and you've heard me say it. In 2003, 2004, they have headlines. Trump says, don't go into Iraq. You're going to destabilize the Middle East. That's good vision. Trump writes in his book in the year 2000 about Osama bin Laden. That's good vision. I talked about Osama bin Laden. Why didn't they kill him?","And I saw in my television and I read about him in the papers and I saw this guy is really a threatening guy. Let's take him out. Nobody took him out. They had a chance to take him out. Bill Clinton actually had a chance to take him out. They never pulled the trigger. You've heard that story. They had him and they decided not to pull the trigger.","Had they pulled the trigger, you'd probably wouldn't have had that destruction because he was really in charge of that whole world trade center horror show that took place. So you could have vision. So some people say, Oh Trump is very tough and mit. They're a littler afraid. Like Bush, this guy Bush, he's like low energy, right?","He lost another debate. Can you believe he lost? All he does is run for office. He loses debates. But he said, think of it, who won the debate? Did Trump won the debate? Right? I will say, this is the first time, you know, the polls all indicate from every virtually every debate. The polls all indicate, they do the polls.","Drudge is an amazing guy. He has a poll Time magazine Slate. All these plays -- you know, they all have these polls. It's like seven or eight of them. A lot of them. PBS, it's online polls. They have a poll for everything. I love polls. I love them. When you're number one. If I'm number two -- it's true.","If I'm number two, I wouldn't even -- you know, a lot of people would be happy being number two. Me, I'm not so happy. But I won every poll, every poll, the online polls. I come back, in fact, my daughter always call, Dad, you're leading in the polls, you're leading in the poll, you lead. Every time we have a debate and -- but sometimes the pundits aren't so good to me. In other words, I may be leading big.","One time I'm leading by 67%, you know, the second guys like nine. 67%, think of it. And then I watch these guys on television they say, well, I didn't like Donald Trump's performance. You know, they're very dishonest people. This is the first debate where they actually say everybody said I won. They said I won, finally, they're getting smart.","They're getting smart. But I enjoy it. I enjoy the process and you know we have fun with it. But we have really more fun in you know straightening out the country. It's not something I wanted to do. It's not something I wanted to to be doing. I love my life. I love what I'm doing. I have a wonderful family.","I have a fantastic company that I built. That is an amazing company. We put in plans. A lot of people say, he'll never run and then I ran, they said, oh, the pundits. Then they said, oh, he'll never sign Form A. It's a one page. It's basically, you sign your life away. I've signed it. They should. What's this?","They couldn't believe. They said, oh, he'll never put in his financials. Never put in because you know he's probably not as rich as everybody thinks. So I put in my financials, I probably -- a little secret, I would have filed them anyway I think because I would want to show everybody how good I've done because nobody -- it's true.","It's true. Because people don't, people don't even know. So I put it in the financials and you had to see these guys, see that group, all those people back there. They -- it made them look like peanuts, waiting in front of the federal election trying to find out. And everybody saw and these are all you know certified numbers, strong numbers by accounting firms and all.","And the funny thing is I had almost a hundred pages of financials and with tremendous numbers and I filed in time. Then they said, by the way, they said, oh, well, he's going to ask for extensions because you're automatically given a 45 day extension so you could extend. So he'll ask for extensions beyond the election.","Do you believe that? I said, fellas, I don't want any extensions. Whatever it is, it is. We file. The numbers are fantastic, very little debt, tremendous cash flow. It's some of the great assets, you know, Doral Country Club in Miami and so many assets, all along 40 Wall Street and Trump Tower and Bank of America, big chunk Bank of America building in San Francisco, 1290 Avenue, the Americas one of the biggest office buildings in New York and so many others.","And they said, what's this. Numbers are good. They were so devastated. And the only reason I tell you that is because that's the kind of thinking we need. I couldn't care about that. It's what we need to get our country. We owe $19 trillion. They just made this budget deal that's horrible. You know, they made it. They did it like in one day, right?","It was done in 1 day. I never saw and I'm actually more disappointed. I'm Republican, but I'm more disappointed with the Republicans because the concern -- you know, right? These guys we send them down there and they get down there and I don't know what happens to them. But if you think about it, we know where the Democrats are coming from, right?","I'm not -- I respect them. It's amazing. In fact, I've said the other day, Obama is the worst negotiator I've ever seen. Except when it comes to negotiating with the Republicans, then he's a great negotiator, right? Right? It's true. I mean I'm more just -- I'm much more disappointed with the Republicans and it went so quickly.","That thing took like a day. It was like, they said they're putting in a budget and you're talking about a budget that's going to raise up the debt from $19 trillion to $21 trillion very quickly. And it really -- it funds Obamacare,it funds the Syrians coming in, it funds people coming in through the border.","I don't know what these people are thinking about. You know, we all put -- in a tea party, we're tough, right, tough people. Then the Tea Party -- by the way, I have to tell you, OK? Because I'm getting great support from evangelicals, from sort of every group and the Tea Party. But I have to tell you, the Tea Party people are amazing people.","They're amazing. They want one thing, they want to make their country great again. They want to make the country great again. They're amazing, dedicated wonderful Americans and they want to see good things happen. That's what a Tea Party person is. I mean, it's so simple. They ask me, how do you define the Tea Party?","And sometimes, I say, maybe we should work on a public relations drive or something, OK? Because it's ridiculous. The Tea Party are among the greatest people and they want to see this country get strong again, be great again, pay less taxes, make the dollar stretch better, have strong borders, protect the Second Amendment, which we're going to do. Get rid of Common Core.","I mean, when guys like, when guys like Bush come down and then Lindsey Graham supports him, but I don't know Lindsey Graham even knows this, but Bush is in favor of Common Core. Nobody can win when you're in favor of Common Cause. It's disaster. And he's also weak on immigration. Remember, they come across the border as an act of love.","Do you remember that one? I heard those too. That Common Core are act of love and Lindsey Graham supporting it. I like Lindsey Graham actually, you know. I like him now that he's out. He gave up. He's a nice guy. I think he's a nice guy actually. He's fine. But he's supporting -- and I said, how can you support somebody that's in favor of Common Core and also that.","So you know it's one of those things but it doesn't make any difference because Lindsey is going to give him all of his people that voted for Lindsey. You know that is, 0, 0. Everybody that voted for Lindsey, right? Everybody that voted for Lindsey is going to vote. She'll say everybody that voted for Lindsey Graham is going to Bush and I'll say, huh, Bush went down.","I mean he actually, which is hard to do when you're at three. You know what I do like though and what I talk about. I only talk about this because you know he keeps taking ads about me. You know some aren't even bad. I look actually saw a handsome, I was younger than I look. But he keeps taking these ads, spending a fortune on ads against me and -- which I'd say, why is he doing it? He's got he's got a knock out about seven or eight guys before he gets to me. I would if -- if I were him, honestly, I'd take like the guy in front of them, a couple of guys, right?","Don't you think. Not the guy up here because he may do damage to me, which would be fine. But you know, he's not going to benefit. One of the other guys gonna benefit. So it's a little stupid, but this is the kind of thinking we have going on with this guy, you know. But think of it, and I use Jeb as a -- first of all, he's ashamed of his last name.","Why doesn't he call himself Jeb Bush. I'm telling you, I'm a good Brander. He's making a mistake. Jeb with the, you know, hyphen with the mark, with the exclamation point. Don't do that. Ball yourself Jeb Bush. It's OK. If it doesn't work, it can't be any worse than it is now, right? 2%, 2%. OK. But here's the thing.","Here's the thing. So Jeb has spent -- this is like the Wollman Skating Rink. This is like the hotel, right? Under budget ahead of schedule, me. So Jeb has $69 million so far. Wouldn't it be great if he could give that money to the wounded warriors so instead of wasting waste. It's wasted. You know, his campaign manager, these people are going out buying Ferraris and stuff I assume.","I mean I don't know but they're making a lot of money. I heard he took millions of dollars in Texas. They'll never get to Texas, he took -- You know why? Because if they don't spend the money, the guys in the campaign can't take their commission, OK? Does anyone know that? You know how vicious that is. I'm telling you.","Working in those campaigns is better than being a real estate broker in South Carolina, OK? It's terrible. But Jeb has spent $69 million and he's essentially at the bottom of the barrel, right? I spent like nothing, like nothing. And I'm way ahead. I'm way up by, what, 20 points or something. I mean 20 points ahead.","They'd like to have 20 points, 20 points ahead. And I say to him and by the way, just so you understand, I don't want to be like a cheap guy. I'm going to spend money. Somebody said, why? I said two reasons. Number one, I don't want to take a chance, OK? I don't want take a chance. I just, you know, I authorized -- we've spending actually quite a bit of money but I authorized a pretty big buy events in Iowa, New Hampshire and right here, in South Carolina.","But I said, I don't want to take a chance. Number one. Number two, I mean, if you look at it, I just feel guilty. I feel so guilty because I haven't spent anything and all these guys have all spent tremendous amounts of money and I feel a little bit guilty. And sometimes I say, why aren't you spending the money?","I say, because I have a 24 point lead. I mean, what do I have to spend money for? Seriously. Well, it's sort of crazy. They call it earned media and you know, like face the nation. The other day, I did face the nation two weeks ago and I get a note from the anchor. It was a very very nice guy. John Dickerson, high quality guy from CBS.","They had the highest rating. And by the way, you think I'd say this with like 12 cameras running. This is legit stuff, right? They had the highest rating in 15, 16 years since the fall of the World Trade Center. Think of it. They interviewed me. You know, the power that gives me? What do I get out of it? I get nothing.","They had the highest rating, 4.6 million to 4.7 million people. They do not big numbers. They have -- Meet the Press had its highest rating. George Stephanopoulos, the highest rating. So that gives you a certain power. You can get things across. But when you have that power, you don't have to advertise because they want you on the show.","When other people call, I'm not gonna to use names. But when other people call because they're nice to me then I'm taking ads against me meaning. But when other people call, they don't want him on the show because they don't get the ratings. They even don't care about poll numbers. They only care about ratings.","If you had terrible poll numbers, right, and got good ratings, which usually doesn't work. Usually, if -- they go hand in hand a little bit. But they don't care about poll number. They care about ratings. So when you have this, you have -- so I have a lot of earned media. So here I am. I spent no money, practically no money.","I mean most of it's the fuel for my jet. Then they say, he leases his jet from himself. I said, yeah I have to. There's a law. You have to lease it from -- I lease my jet from myself. You know, you have to figure market value and pay yourself back. It's the craziest thing. So the thing is, Trump is making money on this campaign.","He's paying himself money. You know, I own the jet. I'm paying myself. Would you believe it. We had one headline that Trump may be the first candidate in history to actually make money running for president. It's weird. It's weird. And we're selling and we are we're selling those Donald J. Trump dot com right.","We're selling the hats, the hats make America great again. The shirts we sell and the dot com. Look,how handsome that young guy. And we're doing great. But anyway I feel guilty and I really do. And I just want to do it and I don't want to take a chance. So we're spending money now. It's probably wasting.","But here's why I look at it. I'm $37.9 million under budget. In other words, I figured -- true, I figured by by January 1st, which is a couple of weeks ago, I would have spent $37.9 million. I think that was the number right around that number, $38 million. I spent nothing. So I'm so far under budget. So if you don't mind.","But I love telling the story that I spent nothing and I'm up here. Other guys spent tremendous amounts of money and they're down in the toilet right. I love telling the story Because if you could equate that to the country, think of this, in education, we're number one in the world in cost per student by a factor of many.","Number two is way way -- it doesn't even exist practically. We spend more per pupil than anybody else by far and yet, we're number 28 in terms of quality. So we spend more than anybody else. And to a large extent, that's common core, because you know these people are Washington, the bureaucrats are making a fortune.","They don't give a damn about your kids in South Carolina. Some of them do, in all fairness, but a lot of them don't. They want to know how much are they getting paid this week. And they do things and they write things and you're studying things that, you know, you don't want to be -- you're wasting your time.","So. But wouldn't it be nice if so we spend the most amount of money and we're, you know, doing horribly. We have third world nations that have better education than the United States and yet, we spend many times more than what anybody else spends, right? Wouldn't it be nice if you could take my campaign theory.","We spend the least and we have the best. We spend the least and we have the best. And one of these -- you know, I think, it's Norway, Sweden, China. You know some of these places have phenomenal educational systems. And one of the folks who tell me actually in Iowa they said, Mr. Trump, they're trying to get us to go Norway.","So we can do that so easy but they won't let us because the stuff that they have is so much. It's so bad. What they're sending us in from Washington it's so bad. And these are parents. These are people that really love the students. These are great people that love the students, love the teachers, want to have the right teachers.","There's no way of supervising it from Washington. But Norway, Sweden, China, these are places that have unbelievable areas of education and I think Norway and Sweden are like number one and two and they study it. But they can't implement it because Washington won't let up. So we're going to change that. We have to save money and we're going to go way up the list.","I want to watch because I'm a big believer in education to put it mildly. We're going to go way up the list. So just to cut it short. Here is the story. We're gonna have strong borders. We're going to have the wall. We're not gonna pay for the wall. We're gonna have the wall. It's gonna be a beautiful, gorgeous, big wall that they're going to name Trump someday.","That's why I'm going to make it. Someday, they'll call it the Trump Wall so I have to make it beautiful as opposed to we're going to make it beautiful and very effective. OK. We're gonna take care of our military. We're going to rebuild it. We're going to be so strong. We're going to be so powerful. And by the way, that's cheaper than what we're doing now.","What we're doing now is insanity. We're weak and they know we're weak. You know, when you hear we're not going here, we're not going there. I've been saying bomb the oil for how many years? You've been listening to me for three, four years. They just started doing it. ISIS became rich with the oil. Bomb the oil.","You know one of the reasons and now I can't believe it they actually said it's true. To me it's hard to believe it's true. One of the reasons they didn't want to bomb the oil, why? Environmental pollution. No no. It's true. Now they say the smoke and everything going into the atmosphere is bad for the environment.","No, it's true. Now, I don't know. Maybe they were kidding from the White House. Maybe they were kidding. I don't think it's anything to kid about. Environmental pollution. So how do you think General George Patton, who looked at people and they'd faint, right? How do you think General George Patton would feel about environmental pollution.","Those wells would have been bombed three years ago and if the president said, no way. He'd say, Oh I'm sorry President, we made a mistake. We bombed the hell out of them. I'd like to apologize. Or General Douglas MacArthur and we have General Douglas MacArthur and we have George Patton right now coming out of West Point, coming out of Annapolis, coming out of the Air Force Academy.","I mean, I went to a great school, but I know those schools and those are great schools. We have great people, but a lot of times our great and tough and smart but they can't go to the top because they're not politically correct. One of the guy is too tough. He's too smart. He uses bad language or she rough, tough.","We need smart tough people. We have to let our top people go to the top. When it comes to trade with China, we lose so much money with Japan and China, Vietnam is a new one, Mexico. All of them. Everybody beats us. I know the smartest business -- we have the greatest business people in the world. Nobody ever uses them.","Nobody ever calls Carl Icahn, who's great. One of the richest people. He doesn't care. He doesn't care about the money. Do you think he wants his $150,000. He wants to do something. If I took Carl. I said, Carl, do me a favor. We're getting killed with China on trade. And by the way, they come, they don't pay tax.","When we send, there's plenty of tax and you can't even get your product in there. OK, folks, don't ever think it's free trade. It's totally unfair trade. $500 million deficit -- $500 billion deficit deficit on a yearly basis. How can you have a country when you're losing that much? Then somebody says, oh, you're not a free trader.","That's a -- I mean, how long do you have to be a free trader to lose $500 billion a year, right? And you know, the funny thing, if we have ever toughened up, they'd come to the table fast because they would have a depression the likes of which nobody has ever seen. We have rebuilt China. What China has done to us is one of the greatest thefts in the history of the world.","We have rebuilt China and nobody and I mean beyond Obama, I'm not just blaming him. Obama has done nothing about it, but nobody nobody has done it. This has been going on for years and years and years and it's time we get smart. It's not going to go over with with Trump. So what I'm going to do is we're going to have a country with spirit.","We're going to have a country with . We're gonna have a country that works. We're going to use our smartest and our brightest people and I know who they are. I know so many. You know, I've I've been there. I've seen the greatest negotiators in the world. I know some that are overrated, some that are underrated, some you never heard of, but we're going to use real people.","We're going to use the people that know how to do it. They're using right now political hacks. They're using people that gave campaign contributions. I mean, you give them campaign contribution to Ted Cruz, you get whatever the hell you want, OK? Whatever you want. And he's a very nice guy. But you give him -- you have to get, right?","You have to get well. Excuse me. Excuse me. He didn't report his bank loans, excuse me, didn't report his bank loans. Say whatever you want. He didn't report bank loans. That's OK. He didn't report his bank loans. He's got bank loans from Goldman Sachs. He's got bank loans from Citibank, folks. And then and then and then he acts like Robin Hood, you know, say whatever you want, but doesn't work that way.","So we have to use our best people. We have to be smart. We have to be tough. We have to be vigilant and we can do it and we can make America greater than ever before. Thank you. Thank you, everybody. Thank you, everybody. Thank you."],"text":" Maybe be against me and they were all for me and I felt much better. But they were all waiting and it's really great. How are you? Good, good. I just got in and I was in New Hampshire, where we're doing great. And we're doing great in Iowa. We're leading now in the polls in Iowa. Sit down. Everybody, sit down. Go ahead. We had a great group. But we set the record on the groups. I love you too, darling. Who said that? Stand up. I love you. I love you. Thank you and I love that book. You know, I want to thank Joe Dugan, who has been fantastic. He is a good guy, really good guy. He puts his heart and his soul into this and nothing's easy in life, I can tell you, but Joe has been doing it for a long time, so he's a very special guy. We have a couple of things to discuss. You know, the beautiful thing is that I don't use teleprompters because I speak from the heart, right? And the head but the heart. Perhaps, I go the head first and then the heart because maybe that's more important nowadays when you look at what's happening to the country. But I like to be able to talk about current events and when you read the speeches, you know, a lot of the guys get up and they read a speech, bah bah bah. They leave in 15 minutes. Everybody goes, what happened? That's all there is? You know, like don't like the song, Is That All There Is. So we don't read the speeches and we don't do the teleprompter thing. But a couple of things, I want to talk about the debate because I thought it was a great experience it's been a great experience for me. It's been for me, for me, it's been a great experience. You know, I've never -- I did. Yeah, I guess. Thank you. Who said that? Stand up. Let me see. That's very nice. Well, we've had some interesting debates and an interesting time and it is different. You know, I've been a job producer. I've built a great business but it's been job producing and employed currently thousands of people and over the years, tens of thousands of people, many Hispanics. And I say, we're gonna do fantastically with Hispanics. I think we're going to do incredibly with the African-Americans, where I pol very well. And somebody said there was a poll that came out at 20% or 25%, actually it was 25%. And they said, if Trump gets 25% of the African-American vote, the election is over. You win. I mean, you win. But we do poll great with that and we poll -- we've just polling -- I mean, no matter where I have a list. I'm not going to go over it very much and this group. this is a very intimate friendly group. These are my friends but. And normally, I love to go over the polls because I'm number one in every poll, virtually. And I love, I love to go over them but here, I'm not going to bother other than to say, New Hampshire through the roof And we're going all over. We are not playing games. We're not going to do what they did the last time. Because if you remember the last time, we should have beaten Barack Obama. We should have beaten him. Something happened. Something happened. And I'm not blaming Romney, but you got to work that last month. That last month was important and whether you like Obama or not, every time you turn to on television, he was on Jay Leno and Letterman and all these and our representative wasn't. And we got to work and we have to work hard and we're to win this thing because having four more years of Barack Obama -- but I think perhaps worse depending on what happens with Hillary. I don't know. Maybe these guys -- but look at all those cameras back there. Well, that's very impressive. That is very very -- That is an impressive. I thought this is going to be a just a little quick stop over with my friends from the Tea Party and Jerry and Joe and all of my -- Look at that group of people. I guarantee you they weren't here for the other groups. I guarantee. I know. I know. You know, it's always tough when they come in. I think every speech I've made in the last two or three months has been on live television, right? Say, can I have I have a speech which isn't on live television? You know, it would be nice. No? No good? I like it. I would love to do one or two. Before this campaign, -- Well, actually that's not good because that means things are not going well. If they stopped turning on those televisions that means things. So we'll continue to go live, OK? But it really has been an interesting period of time for me because I've been a businessman and I've been a negotiator and a job, you know, employer, real estate person, done a lot of different deals. But mostly, Brosseau real estate and I've had a great time. I love the real estate business. I love doing what we're doing. We're building all over the world and we're doing deals all over the world. We're doing a deal right on Pennsylvania Avenue, a big hotel that's going to be spectacular right by the White House. It's sort of interesting because one way or the other, I'm getting to Pennsylvania Avenue. One way or the other. I'll either be here or I'll be here. Not so much difference. But -- So it's one way. But -- and it's sort of interesting, it's the post office. And everybody, so many companies wanted it. It's one of the most sought after projects in the history of the General Services Administration. And it's an incredible building, the Old Post Office and we got it, which is amazing. We got it in the Obama administration. Can you believe that? Well, can you believe it? I was even surprised. I said, you know, I think we had the best plan. They wanted to make sure of everybody was very strong financially because they want to get it done. It's very important economic and economic development. And we put our plan in and others put that in, you know, great companies, many many companies and great companies, the biggest hotel companies in the world. And we were giving it about two years ago, we started construction and we're about a year ahead of it. Can you imagine that? A year ahead of schedule. We're under budget and ahead of schedule, which is what the country has to do. It's really what -- what do you think, right? It's what the country -- So we're under budget substantially and I will tell you, under budget and yet we're building even beyond because it's so good. We're going to make that. We think it's going to be probably maybe the finest hotel in the United States. We're going beyond that but it's gonna be one of the finest hotels in the United States. I have one of them right now in Chicago. It's considered one of the great hotels of the world. I think this is going to be something. I don't want to say, top it. You don't wanna say top your own self. But this is something that could conceivably top it. It's gonna be great. But the beauty is that when you hear those words, ahead of schedule and under budget, and I think that's so important because I mean I see these projects and I read about the projects. I read about one the other day where you know they're building an airplane and it's it's five times over budget and it's years and years late, sometimes decades late. And by the time they get it, it's obsolete and they've spent, you know, billions and billions of dollars. And you look at what they do with the submarines and the nuclear submarines and all of the tremendous cost overruns that they have. And I just, you know, you build and you've got to build and you got to know what the hell you're doing and you got to get it done. And you've got to fight with the contractors. And there's so many stories I can tell you about government. I mean, a little one just quickly is the Wollman Rink. Eight years and the city couldn't get the ice skating rink open in Central Park. And I got involved. This is when I was young, but there's nothing different. I mean there's no difference. I just did one recently, which is almost the same thing in Ferry Point. They couldn't get this big golf course project open and it's been under construction. They think for 30 years, OK? Think of that. It was a landfill and just every -- they don't even know when it started. But a long time ago and it would have -- I think it would have gone on for many many more year. And I got it done in a year. It's open now. It just got the best best new course in the United States from one of the big magazines and it's doing great. But it's not that big I mean although, they I tell you something, world's most expensive golf course, they spent over $200 million to build a golf course. OK? Watch it, of course, maybe seven, you know? Bt they spent over $200 million to build a golf course and I think it's much more than that. Nobody even knows. Do they know? They have no idea. You know when you say, is it two? They say, we don't know. The money and here we're talking about local government. Can you imagine what the federal government is wasting? And when you see the kind of waste, fraud, corruption, it's incredible. With the Wollman rinks, I had a, you know, an ice skating rink and I have a daughter, Ivanka, who everybody knows. She was a little girl now. And she said to me, Daddy, I'd like to go ice skate. I said, honey, it's gonna be built next year. Don't worry about it. It would look down on the rink. And next year, she'd come, what about ice skating daddy? And I'd say, maybe. It's a mess. I mean, it's really. And then finally after about three, four years of her asking me, you know, it's an ice rink. It's not that simple, but it's an ice rink and it's massive. It's one of the biggest and it's -- I mean to this day, I've been running it ever since but it does great. But I said, let's just see. So after about four years of her asking, I said, I gotta go look at this thing. And I went down and I looked and there were hundreds massive piece of concrete, you know, probably six, seven, eight times the size of this room. And I said, man, look at all those workers. They're all workers and they were all sitting there and nobody's working. And this has been going on for years and years and years. And I went to the mayor of New York City, who at the time was Ed Koch. I said, Ed, this is ridiculous. I mean, forget about my daughter. I'd like to get her ice skating, but the whole city. And it was like a big scandal. It was on the front page of the papers. They couldn't get an ice skating rink. So it wasn't that easy with him, believe me, because he didn't want to be stood up. He was a very paranoid guy, that I can tell you. And finally, I went to the newspapers. I said, I want to build it. I want to get it open. I'll get it open in four months. And if I can't do it for $2 million, I will pay for the costs myself. And they had spent probably, you know, they don't say this another way. You never find out what these -- I think they spent over $20 million on it. But I said, I'll spent and most of the money that I was going to spend, a lot of it was demolition because you had to tear down everything that was built because it was built so badly. Anyway, finally, he agreed to let me do it. I took it over and the ice wasn't melting. They couldn't get ice and the slab was poured and it was this far off. In other words, it was gonna be level. So the water is thin and nice and you create ice, right? Well, one part, the water was like a foot and a half high. The other part, it was down here so they couldn't make the water. And I said, man, that thing is really off. So we had a rip out the entire slab. And then I saw the man, who was the freezing man. I said, where is your office located? He said in Miami Beach. I said, Miami Beach? He said, no, I've never done on ice. We focus on air condition. I said, that makes sense. I like air conditioner but I don't. So I said, well, what's the problem? And I said, you know what, a friend of mine worked for the Montreal Canadians, the ice hockey team. I called him up, I said, Charles, could you do me a favor? Do you have a guy that does anything about like making ice? Oh sure, we have a guy. He's great, in-house. He comes down, he looks at me, he sees it, he comes close me, 10 minutes out. He said, Mr. Trump, you're using freon. You want to use water with salt in it. I said, what do you mean? He said, you have freon they're pouring. You have to see this. They have tubes of copper and the tubes of copper are miles long because it goes from one side, they have to be three inches apart. Goes back forth back forth and they put the copper and copper is very expensive and very valuable. So every night, they'd lay the copper. They come back the next day, it was all stolen. OK? So they lay it again, they lay it again and then finally, they went and hired a big security company that guards all around the rink. And the other problem with this is this little pinhole, you got miles of this stuff because it's so long. And if there's a pinhole, the gas escapes and you don't make the ice, OK? It's just one of those things. So I said to them. what's going on? So they finally got security and they were great. They did for seven days. And then the security took a day off, the entire rink was wiped out that -- this went on for years. Somebody made a fortune on copper, anyway. So I get this guy down. Nice guy from the Montreal Canadiens. Real real hockey people and ice people. And he said, Mr. Trump, what you want is a rubber hose. You put water in it and you put salt in the water and the salt means the water can't freeze. I said, wow, that sounds good. He said, we call it brine and the machine and the machine takes it, mixes, puts it through. It's simple. And you need rubber hose, nobody steals it because it's rubber. Who the hell wants rubber? I guess, they steel rubber too, right? In New York, you know, maybe they'll steal, maybe they won't. Actually, New Yorkers have very high values, they won't steal anything. Very very very high values. They don't steal. Nobody steals. Nobody steals in New York. Nobody steals. So we laid miles of it. We -- I took out all of the concrete. We laid miles of it of the rubber and we tested. There were no leaks, no nothing. There was no theft because nobody wants it. And we laid just beautiful. It was all done. Then we called up the concrete guys, we have we had the most incredible pour because it's such a huge slab. And ideally, you want to pour it at one time. All things the city doesn't know. So we -- the construction people know. So we poured it one time, beautiful job. And the cement mixers were lined up, this is at 58 St., 59th St. The cement mixers were lined up to Harlem, all the way back. That's so long. And they poured all day long. They poured for a day and a half and it was beautiful, perfectly leveled, done with lasers. Anyway, bottom line, turned it on, put the brine through it, the water and, woola, beautiful ice, to this day, it was so beautiful. And I did it for less than $2 million. And they study it now in the business books. We can do the same thing with our government on a huge scale. I mean, it's the same thing. It's no different. It's no different. Really, it's no different. You know, it's very funny. I like I like Newt Gingrich. Actually, Newt Gingrich did very well over here, but I like Newt. He's a great guy. And he called me up. He said, you know, I read the story about Wollman Rink. Would you please tell them the story of Wollman Rink. So that story, I haven't told that certain a long time but that story is honor of Newt. But he really thinks it's a great story because it's indicative of what can be done and it finished way ahead of schedule. And to this day, it's probably the busiest ice skating rink in the world. I mean it's amazing. You should see that on a Saturday. They have lines that are four blocks long to get in and people are great and they're you know they're in love with the place. So if you have knowledge, like, you don't use people from Miami Beach to do a rink with you know. And by the way, they do use -- you know, use freon for an aircon. That's what they use. But freon for an air conditioner is a little different than -- I wouldn't want to use brine for that right. But it's sort of you have to use people that know what they're doing. But Newt called me up, he said, you've got to tell that story because that's such a great story. So it is a story and it's been, it's been a great thing and the city saved a lot of money and it's been, it's been really a great expense. And they actually study that. You go to a lot of the great business schools and they study that as to what you can do with free enterprise with private people, with private business compare that to government. And there's something very true about that and they actually study it in the business books in a lot of the business schools. I think including the Wharton School of Finance, number one business school. So we have a lot of -- we have a lot of things have happened since we, since we made this journey. You know, I journeyed forth and it takes guts to run for pride. I never done this before and it takes guts. And on June 16th, I said, look, you know, we're just going to do this and I'll never forget standing at the top of that now famous escalator. Because you've seen that picture with myself coming down with Melania and I'll never forget looking down into that vast basement, vast, we call it, the garden level. And seeing all of these guys, I mean, what you have down there as much as you have down there now, times 10. And it look like the Academy Awards. I said, what are we doing? The Academy Awards? And we gave a speech and we talk about illegal immigration. Oh, wow. I would never say anything. Rush Limbaugh said, he has never seen incoming like he saw with me. Incoming means boom, trying to get you. And then it turned out that you know you had the killing of Kate, who is an amazing woman in San Francisco, and you had Jameel in Los Angeles and you had so many other things happen. The veteran, 65 years old, a woman 65 years old, a veteran of the Army and she was raped, sodomized killed by the illegal immigrant. And so much so much so much, you have no idea. And so we should have borders. We have strong strong strong borders. We've got to build a wall. We're gonna have a wall. We're gonna have a wall. And you go up, and you go up to New Hampshire, it's amazing because New Hampshire they're amazing people and they have a tremendous heroin problem. They have a tremendous problem up there. You wouldn't think, you know, you don't equate that with New Hampshire. They have -- it's one of the first questions I get all the time and it pours in through the southern border. And we're gonna have a wall. Who's gonna pay for the wall? Does anybody know? Right? Believe me. When I'm on stage with these guys, OK? And it's now guys because Carly is doing the other one, which is fine. Wut when I'm onstage with these guys, they come to me sometimes. They say, why do you say that Mexico is paying? Why do you say that? I said because they gonna pay it. But how can you get him to pay? Because they're politicians, they're all talk, no action. They don't know what the hell they're doing. They're saying, so they're saying -- no, but it's true and I like some of the them. They're saying, but how can you do that? They -- they can't -- they don't even fathom it. Now other business people understand and here's why, Mexico makes a fortune of the United States. The wall is peanuts. Peanuts. You know, they've been talking about building a wall for years. China build a wall that's 13,000 miles long, 2,000 years ago. And my ambition is to have ours be much higher. It's not going to be much bigger. You've ever see the width of that wall? It's like three times wider than this room. We don't need the width. We need the height. But China built a wall 2,000 years ago that's 13,000. We essentially need a thousand miles. It's 2000 miles. But we really -- because you have natural borders, natural barriers that are very very substantial. So we're going to build a wall and Mexico is going to pay for the wall. Now Mexico, I love Mexico, I love the people of Mexico. Many many Mexican people work for me. And I do business with them. But their leaders are too smart, too cunning, too sharp for our leaders. And we'll gonna have a wall and people can come into the country, but they're going to come in legally. They have to go through a process and they've got to come in legally. And we're gonna have a country back because right now, if you don't have borders, you have a country. We're gonna have a country, OK? We don't have a country. And so we're gonna have a real wall. It's going to be a beautiful, it's going to be a big wall, it's going to see the ceiling. The ceiling is peanuts. Believe me. This is not a wall. We're going to many many times and let's put it this way, if somebody ever gets up there, they're not gonna want to come down very fast, that I can tell. So we're gonna have a great wall and it's gonna do the trick. And you know you can ask about walls because just speak to Israel about walls. Walls work when you have the right wall. Walls work. And when I see it the way we negotiate, for instance, I have been going wild for years about the prisoners. I call them the hostages, our four people. So let's start with the other day, we had 10 sailors, who innocently probably were in a little bit of water that was not perfect. Instead of saying, hey, folks, you got to get out of here. You're a whole big deal. When I saw those young people on their knees in a begging position with their hands above their head and rifles pointing at their head and I heard the voice of the guy from Iran, I don't know if anybody heard it because they sort of downplayed it at the end. But the first couple of days I heard this voice, this was not a nice character. This a character I'd like to be doing other things with. Bad guy. And I heard that and you know they're trying to downplay it as much as possible. And then finally, they released them, but they only released them for one person -- you know, one reason and the reason was very simple. They're waiting for $150 billion, $150 billion. So I've been hitting them hard and I think I might have had something to do with it. You wanna know the truth. Who's using it's? It's a part of my staple thing. I mean, I go crazy when I when I hear about this. You go, you go absolutely wild because how is it possible, we have one who's in there who is a reporter for The Washington Post. He didn't do anything wrong, by the way. He had something although a lot of the people that work for The Washington Post do, but we won't say. No, Washington Post is -- actually, they've been pretty nice lately. I must be honest with you. But but you have you have a person who's in there because he's a minister, he's a Christian minister. He's a pastor and you have people that didn't deserve to be there. And then one of the worst prisons in the world and we had to do something. So always talk about. So today, I heard oh they're being of released. Like, it's this big. First of all, it should have taken place three and a half, four years ago whenever the hell they start. Do you ever see an agreement take so long as this? How long has this thing been going on? Years and years. It should have been done right at the beginning. They should have said, listen, we got to have our prisoners back. They would say, no. You leave the room. They'll call you back. You double up the sanctions. They'll call you back within 48 hours. 100%, OK? But we waited and waited away. So here's the deal. So I figured, wow, that's a long time. Then they're getting, you know, they get their money today or tomorrow. So the prisoners are going to be released when they get the money, $150 billion. But here's the other thing, we just heard about it 10 minutes ago because I said that's horrible. It should've happened years before. But they're getting seven people that they've wanted, much more serious, real people, real people, meaning they committed real problems and they're getting, I guess, 14 or 15 other people that are on the watch list of terror and other. These are really bad dudes and they're being taken off the watch. So they're getting essentially 22 people and $150 billion. So here's the deal. We give them, OK? We give them $150 billion. We give them essentially 22 people, 21, 22 people. But these are people that really did have problems and we're getting back 4 people that didn't do anything wrong. That's the way we negotiate. That's the way we negotiate. It's so sad. It's so sad. And this has been going on forever. Bergdahl, we get Bergdahl, a dirty rotten traitor, right? We get Bergdahl, Sergeant Bergdahl, how did he ever get to be a sergeant. We get Bergdahl, we get Bergdahl and they get, what, five people, killers that are back on the battlefield. The press thinks they're not back. They're back. Believe me, they're back. Five people that they most wanted. They're back in the battlefield or will be, top level people that they've wanted for nine years. So we get a dirty rotten traitor then I'd fly back -- I swear, I'd fly him back, I'd drop him right the hell right in the middle of that. I would drop him. And don't forget, folks, you know, because I've seen the parents, five people at least and it could be six. But at least five people were killed looking for Bergdahl. You know, they went out looking for him. This is not friendly territory. And they went out looking for him. So at least five people were killed, were killed looking for Bergdahl. And now Bergdahl is going to drown. And a lot of people say nothing's going to happen to him. Now in the old days when we were strong as a country, would have been shot. He would have been -- like fast trial, fair trial, fast trial, boom, if he's guilty, he's gone, right? That would have been 40, 50 years ago. 20 years ago, at least he'd be in prison for a long time. Ten years ago, he would have been in prison maybe for a short time. Now, they're talking about nothing. Six people, five people, I'm almost sure it's six because they say another one too. And I saw the parents and they think. But I'll tell you what, we have to change our ways. We have to be smart. We have to be vigilant. We have to be tough. I turn on the television today. What do I see? Islamic, right? Right? Radical Islamic terrorism. That's what I see. Oh tell. Blown up, blown to pieces, hundreds of people horribly wounded and burning and running onto the streets. I mean, they say, 25 killed. That was as of this morning when it happened so you know the number is going to be a tremendous number. Someone's We got to be careful. We can't just do this. We got to make sure the Syrian, the migration. We don't know where these people come from. We don't know where they come from. We don't know where they come from. We have no idea. You know, the story of the Trojan horse. This could be the ultimate Trojan horse. But we have no idea where they come from. I have a big heart. I mean, I actually do. I'm the world's most militaristic person but that doesn't mean I want to use it. I want to have it because we need it and I'm the one that didn't want to go into Iraq. And you've seen that and you've heard me say it. In 2003, 2004, they have headlines. Trump says, don't go into Iraq. You're going to destabilize the Middle East. That's good vision. Trump writes in his book in the year 2000 about Osama bin Laden. That's good vision. I talked about Osama bin Laden. Why didn't they kill him? And I saw in my television and I read about him in the papers and I saw this guy is really a threatening guy. Let's take him out. Nobody took him out. They had a chance to take him out. Bill Clinton actually had a chance to take him out. They never pulled the trigger. You've heard that story. They had him and they decided not to pull the trigger. Had they pulled the trigger, you'd probably wouldn't have had that destruction because he was really in charge of that whole world trade center horror show that took place. So you could have vision. So some people say, Oh Trump is very tough and mit. They're a littler afraid. Like Bush, this guy Bush, he's like low energy, right? He lost another debate. Can you believe he lost? All he does is run for office. He loses debates. But he said, think of it, who won the debate? Did Trump won the debate? Right? I will say, this is the first time, you know, the polls all indicate from every virtually every debate. The polls all indicate, they do the polls. Drudge is an amazing guy. He has a poll Time magazine Slate. All these plays -- you know, they all have these polls. It's like seven or eight of them. A lot of them. PBS, it's online polls. They have a poll for everything. I love polls. I love them. When you're number one. If I'm number two -- it's true. If I'm number two, I wouldn't even -- you know, a lot of people would be happy being number two. Me, I'm not so happy. But I won every poll, every poll, the online polls. I come back, in fact, my daughter always call, Dad, you're leading in the polls, you're leading in the poll, you lead. Every time we have a debate and -- but sometimes the pundits aren't so good to me. In other words, I may be leading big. One time I'm leading by 67%, you know, the second guys like nine. 67%, think of it. And then I watch these guys on television they say, well, I didn't like Donald Trump's performance. You know, they're very dishonest people. This is the first debate where they actually say everybody said I won. They said I won, finally, they're getting smart. They're getting smart. But I enjoy it. I enjoy the process and you know we have fun with it. But we have really more fun in you know straightening out the country. It's not something I wanted to do. It's not something I wanted to to be doing. I love my life. I love what I'm doing. I have a wonderful family. I have a fantastic company that I built. That is an amazing company. We put in plans. A lot of people say, he'll never run and then I ran, they said, oh, the pundits. Then they said, oh, he'll never sign Form A. It's a one page. It's basically, you sign your life away. I've signed it. They should. What's this? They couldn't believe. They said, oh, he'll never put in his financials. Never put in because you know he's probably not as rich as everybody thinks. So I put in my financials, I probably -- a little secret, I would have filed them anyway I think because I would want to show everybody how good I've done because nobody -- it's true. It's true. Because people don't, people don't even know. So I put it in the financials and you had to see these guys, see that group, all those people back there. They -- it made them look like peanuts, waiting in front of the federal election trying to find out. And everybody saw and these are all you know certified numbers, strong numbers by accounting firms and all. And the funny thing is I had almost a hundred pages of financials and with tremendous numbers and I filed in time. Then they said, by the way, they said, oh, well, he's going to ask for extensions because you're automatically given a 45 day extension so you could extend. So he'll ask for extensions beyond the election. Do you believe that? I said, fellas, I don't want any extensions. Whatever it is, it is. We file. The numbers are fantastic, very little debt, tremendous cash flow. It's some of the great assets, you know, Doral Country Club in Miami and so many assets, all along 40 Wall Street and Trump Tower and Bank of America, big chunk Bank of America building in San Francisco, 1290 Avenue, the Americas one of the biggest office buildings in New York and so many others. And they said, what's this. Numbers are good. They were so devastated. And the only reason I tell you that is because that's the kind of thinking we need. I couldn't care about that. It's what we need to get our country. We owe $19 trillion. They just made this budget deal that's horrible. You know, they made it. They did it like in one day, right? It was done in 1 day. I never saw and I'm actually more disappointed. I'm Republican, but I'm more disappointed with the Republicans because the concern -- you know, right? These guys we send them down there and they get down there and I don't know what happens to them. But if you think about it, we know where the Democrats are coming from, right? I'm not -- I respect them. It's amazing. In fact, I've said the other day, Obama is the worst negotiator I've ever seen. Except when it comes to negotiating with the Republicans, then he's a great negotiator, right? Right? It's true. I mean I'm more just -- I'm much more disappointed with the Republicans and it went so quickly. That thing took like a day. It was like, they said they're putting in a budget and you're talking about a budget that's going to raise up the debt from $19 trillion to $21 trillion very quickly. And it really -- it funds Obamacare,it funds the Syrians coming in, it funds people coming in through the border. I don't know what these people are thinking about. You know, we all put -- in a tea party, we're tough, right, tough people. Then the Tea Party -- by the way, I have to tell you, OK? Because I'm getting great support from evangelicals, from sort of every group and the Tea Party. But I have to tell you, the Tea Party people are amazing people. They're amazing. They want one thing, they want to make their country great again. They want to make the country great again. They're amazing, dedicated wonderful Americans and they want to see good things happen. That's what a Tea Party person is. I mean, it's so simple. They ask me, how do you define the Tea Party? And sometimes, I say, maybe we should work on a public relations drive or something, OK? Because it's ridiculous. The Tea Party are among the greatest people and they want to see this country get strong again, be great again, pay less taxes, make the dollar stretch better, have strong borders, protect the Second Amendment, which we're going to do. Get rid of Common Core. I mean, when guys like, when guys like Bush come down and then Lindsey Graham supports him, but I don't know Lindsey Graham even knows this, but Bush is in favor of Common Core. Nobody can win when you're in favor of Common Cause. It's disaster. And he's also weak on immigration. Remember, they come across the border as an act of love. Do you remember that one? I heard those too. That Common Core are act of love and Lindsey Graham supporting it. I like Lindsey Graham actually, you know. I like him now that he's out. He gave up. He's a nice guy. I think he's a nice guy actually. He's fine. But he's supporting -- and I said, how can you support somebody that's in favor of Common Core and also that. So you know it's one of those things but it doesn't make any difference because Lindsey is going to give him all of his people that voted for Lindsey. You know that is, 0, 0. Everybody that voted for Lindsey, right? Everybody that voted for Lindsey is going to vote. She'll say everybody that voted for Lindsey Graham is going to Bush and I'll say, huh, Bush went down. I mean he actually, which is hard to do when you're at three. You know what I do like though and what I talk about. I only talk about this because you know he keeps taking ads about me. You know some aren't even bad. I look actually saw a handsome, I was younger than I look. But he keeps taking these ads, spending a fortune on ads against me and -- which I'd say, why is he doing it? He's got he's got a knock out about seven or eight guys before he gets to me. I would if -- if I were him, honestly, I'd take like the guy in front of them, a couple of guys, right? Don't you think. Not the guy up here because he may do damage to me, which would be fine. But you know, he's not going to benefit. One of the other guys gonna benefit. So it's a little stupid, but this is the kind of thinking we have going on with this guy, you know. But think of it, and I use Jeb as a -- first of all, he's ashamed of his last name. Why doesn't he call himself Jeb Bush. I'm telling you, I'm a good Brander. He's making a mistake. Jeb with the, you know, hyphen with the mark, with the exclamation point. Don't do that. Ball yourself Jeb Bush. It's OK. If it doesn't work, it can't be any worse than it is now, right? 2%, 2%. OK. But here's the thing. Here's the thing. So Jeb has spent -- this is like the Wollman Skating Rink. This is like the hotel, right? Under budget ahead of schedule, me. So Jeb has $69 million so far. Wouldn't it be great if he could give that money to the wounded warriors so instead of wasting waste. It's wasted. You know, his campaign manager, these people are going out buying Ferraris and stuff I assume. I mean I don't know but they're making a lot of money. I heard he took millions of dollars in Texas. They'll never get to Texas, he took -- You know why? Because if they don't spend the money, the guys in the campaign can't take their commission, OK? Does anyone know that? You know how vicious that is. I'm telling you. Working in those campaigns is better than being a real estate broker in South Carolina, OK? It's terrible. But Jeb has spent $69 million and he's essentially at the bottom of the barrel, right? I spent like nothing, like nothing. And I'm way ahead. I'm way up by, what, 20 points or something. I mean 20 points ahead. They'd like to have 20 points, 20 points ahead. And I say to him and by the way, just so you understand, I don't want to be like a cheap guy. I'm going to spend money. Somebody said, why? I said two reasons. Number one, I don't want to take a chance, OK? I don't want take a chance. I just, you know, I authorized -- we've spending actually quite a bit of money but I authorized a pretty big buy events in Iowa, New Hampshire and right here, in South Carolina. But I said, I don't want to take a chance. Number one. Number two, I mean, if you look at it, I just feel guilty. I feel so guilty because I haven't spent anything and all these guys have all spent tremendous amounts of money and I feel a little bit guilty. And sometimes I say, why aren't you spending the money? I say, because I have a 24 point lead. I mean, what do I have to spend money for? Seriously. Well, it's sort of crazy. They call it earned media and you know, like face the nation. The other day, I did face the nation two weeks ago and I get a note from the anchor. It was a very very nice guy. John Dickerson, high quality guy from CBS. They had the highest rating. And by the way, you think I'd say this with like 12 cameras running. This is legit stuff, right? They had the highest rating in 15, 16 years since the fall of the World Trade Center. Think of it. They interviewed me. You know, the power that gives me? What do I get out of it? I get nothing. They had the highest rating, 4.6 million to 4.7 million people. They do not big numbers. They have -- Meet the Press had its highest rating. George Stephanopoulos, the highest rating. So that gives you a certain power. You can get things across. But when you have that power, you don't have to advertise because they want you on the show. When other people call, I'm not gonna to use names. But when other people call because they're nice to me then I'm taking ads against me meaning. But when other people call, they don't want him on the show because they don't get the ratings. They even don't care about poll numbers. They only care about ratings. If you had terrible poll numbers, right, and got good ratings, which usually doesn't work. Usually, if -- they go hand in hand a little bit. But they don't care about poll number. They care about ratings. So when you have this, you have -- so I have a lot of earned media. So here I am. I spent no money, practically no money. I mean most of it's the fuel for my jet. Then they say, he leases his jet from himself. I said, yeah I have to. There's a law. You have to lease it from -- I lease my jet from myself. You know, you have to figure market value and pay yourself back. It's the craziest thing. So the thing is, Trump is making money on this campaign. He's paying himself money. You know, I own the jet. I'm paying myself. Would you believe it. We had one headline that Trump may be the first candidate in history to actually make money running for president. It's weird. It's weird. And we're selling and we are we're selling those Donald J. Trump dot com right. We're selling the hats, the hats make America great again. The shirts we sell and the dot com. Look,how handsome that young guy. And we're doing great. But anyway I feel guilty and I really do. And I just want to do it and I don't want to take a chance. So we're spending money now. It's probably wasting. But here's why I look at it. I'm $37.9 million under budget. In other words, I figured -- true, I figured by by January 1st, which is a couple of weeks ago, I would have spent $37.9 million. I think that was the number right around that number, $38 million. I spent nothing. So I'm so far under budget. So if you don't mind. But I love telling the story that I spent nothing and I'm up here. Other guys spent tremendous amounts of money and they're down in the toilet right. I love telling the story Because if you could equate that to the country, think of this, in education, we're number one in the world in cost per student by a factor of many. Number two is way way -- it doesn't even exist practically. We spend more per pupil than anybody else by far and yet, we're number 28 in terms of quality. So we spend more than anybody else. And to a large extent, that's common core, because you know these people are Washington, the bureaucrats are making a fortune. They don't give a damn about your kids in South Carolina. Some of them do, in all fairness, but a lot of them don't. They want to know how much are they getting paid this week. And they do things and they write things and you're studying things that, you know, you don't want to be -- you're wasting your time. So. But wouldn't it be nice if so we spend the most amount of money and we're, you know, doing horribly. We have third world nations that have better education than the United States and yet, we spend many times more than what anybody else spends, right? Wouldn't it be nice if you could take my campaign theory. We spend the least and we have the best. We spend the least and we have the best. And one of these -- you know, I think, it's Norway, Sweden, China. You know some of these places have phenomenal educational systems. And one of the folks who tell me actually in Iowa they said, Mr. Trump, they're trying to get us to go Norway. So we can do that so easy but they won't let us because the stuff that they have is so much. It's so bad. What they're sending us in from Washington it's so bad. And these are parents. These are people that really love the students. These are great people that love the students, love the teachers, want to have the right teachers. There's no way of supervising it from Washington. But Norway, Sweden, China, these are places that have unbelievable areas of education and I think Norway and Sweden are like number one and two and they study it. But they can't implement it because Washington won't let up. So we're going to change that. We have to save money and we're going to go way up the list. I want to watch because I'm a big believer in education to put it mildly. We're going to go way up the list. So just to cut it short. Here is the story. We're gonna have strong borders. We're going to have the wall. We're not gonna pay for the wall. We're gonna have the wall. It's gonna be a beautiful, gorgeous, big wall that they're going to name Trump someday. That's why I'm going to make it. Someday, they'll call it the Trump Wall so I have to make it beautiful as opposed to we're going to make it beautiful and very effective. OK. We're gonna take care of our military. We're going to rebuild it. We're going to be so strong. We're going to be so powerful. And by the way, that's cheaper than what we're doing now. What we're doing now is insanity. We're weak and they know we're weak. You know, when you hear we're not going here, we're not going there. I've been saying bomb the oil for how many years? You've been listening to me for three, four years. They just started doing it. ISIS became rich with the oil. Bomb the oil. You know one of the reasons and now I can't believe it they actually said it's true. To me it's hard to believe it's true. One of the reasons they didn't want to bomb the oil, why? Environmental pollution. No no. It's true. Now they say the smoke and everything going into the atmosphere is bad for the environment. No, it's true. Now, I don't know. Maybe they were kidding from the White House. Maybe they were kidding. I don't think it's anything to kid about. Environmental pollution. So how do you think General George Patton, who looked at people and they'd faint, right? How do you think General George Patton would feel about environmental pollution. Those wells would have been bombed three years ago and if the president said, no way. He'd say, Oh I'm sorry President, we made a mistake. We bombed the hell out of them. I'd like to apologize. Or General Douglas MacArthur and we have General Douglas MacArthur and we have George Patton right now coming out of West Point, coming out of Annapolis, coming out of the Air Force Academy. I mean, I went to a great school, but I know those schools and those are great schools. We have great people, but a lot of times our great and tough and smart but they can't go to the top because they're not politically correct. One of the guy is too tough. He's too smart. He uses bad language or she rough, tough. We need smart tough people. We have to let our top people go to the top. When it comes to trade with China, we lose so much money with Japan and China, Vietnam is a new one, Mexico. All of them. Everybody beats us. I know the smartest business -- we have the greatest business people in the world. Nobody ever uses them. Nobody ever calls Carl Icahn, who's great. One of the richest people. He doesn't care. He doesn't care about the money. Do you think he wants his $150,000. He wants to do something. If I took Carl. I said, Carl, do me a favor. We're getting killed with China on trade. And by the way, they come, they don't pay tax. When we send, there's plenty of tax and you can't even get your product in there. OK, folks, don't ever think it's free trade. It's totally unfair trade. $500 million deficit -- $500 billion deficit deficit on a yearly basis. How can you have a country when you're losing that much? Then somebody says, oh, you're not a free trader. That's a -- I mean, how long do you have to be a free trader to lose $500 billion a year, right? And you know, the funny thing, if we have ever toughened up, they'd come to the table fast because they would have a depression the likes of which nobody has ever seen. We have rebuilt China. What China has done to us is one of the greatest thefts in the history of the world. We have rebuilt China and nobody and I mean beyond Obama, I'm not just blaming him. Obama has done nothing about it, but nobody nobody has done it. This has been going on for years and years and years and it's time we get smart. It's not going to go over with with Trump. So what I'm going to do is we're going to have a country with spirit. We're going to have a country with . We're gonna have a country that works. We're going to use our smartest and our brightest people and I know who they are. I know so many. You know, I've I've been there. I've seen the greatest negotiators in the world. I know some that are overrated, some that are underrated, some you never heard of, but we're going to use real people. We're going to use the people that know how to do it. They're using right now political hacks. They're using people that gave campaign contributions. I mean, you give them campaign contribution to Ted Cruz, you get whatever the hell you want, OK? Whatever you want. And he's a very nice guy. But you give him -- you have to get, right? You have to get well. Excuse me. Excuse me. He didn't report his bank loans, excuse me, didn't report his bank loans. Say whatever you want. He didn't report bank loans. That's OK. He didn't report his bank loans. He's got bank loans from Goldman Sachs. He's got bank loans from Citibank, folks. And then and then and then he acts like Robin Hood, you know, say whatever you want, but doesn't work that way. So we have to use our best people. We have to be smart. We have to be tough. We have to be vigilant and we can do it and we can make America greater than ever before. Thank you. Thank you, everybody. Thank you, everybody. Thank you."}