{"id":477,"author":"Donald Trump","title":"Speech: Donald Trump in Urbandale, IA","date":"2016-01-15","link":"https://factba.se/transcript/donald-trump-speech-urbandale-ia-january-15-2016","paragraphs":["Well, what great people. What great people. And Sean is a special friend of mine because he's going through a little difficulty and he wants to vote for Trump and we love Sean, right? OK. We love Sean and nice to meet you. We spoke about two, three weeks ago, and I think you're doing much better. So it's great to have you, man.","OK? We'll see you in a little while. We'll go up and say a couple of words. Unless you don't want me to speak. I won't speak. Sean, maybe I can get out of speaking that would be even better, right? Come on over. Come on over. Hello, everybody. Great to be here. You know this was supposed to be just a small little gathering.","They said maybe 30, 40 people that are friends of ours. And look what happens all the time. I said are we making this speech? What are we doing? But it's so good to see Sean and it's so good to see the rest of you. And we have to caucus before we forget. We have to caucus. We have to get out. Otherwise, it all doesn't mean anything.","So last night we had the debate. Did everybody see the debate? I think so, yeah. We've been really treated nicely. Even the pundits last night were treating me nicely. You know I've won every poll in every debate but the pundits sometimes don't go along with the poll. Now, the pundits are sort of getting it and they're getting it because we have such incredible receptivity.","If you look at what's going on with the people. I call it a movement, it's a movement, like, even this was supposed to be 25 to 40 people. And look I don't even know who the hell some of these people are. I'm trying to figure it out. But, but it's just been incredible. And no matter what subject we talk about whether it's illegal immigration, we'll take care of that situation, we're going to make it tough, you just can't come in, whether it's our vets who are treated so badly.","Frankly, the illegal immigrants are treated in many cases, better than our veterans. It's true. You go to some places like California with the driver's licenses, under this, under that, our vets don't get treated as well. And we're going to change so many things, so many things. We're going to make our country great again.","And I actually start saying over the last couple of weeks, we're going to make our country greater, potentially, greater than ever before. We have such potential. We have such incredible potential. And so last night, we'll talk -- and I may take a few questions. Who would do a few questions today? That's what I think.","Can I do that? I think I can do that, right? We'll just shout them out. But last night was very interesting. We went up and you never know what's going to happen. You know it's a lot of people, a lot of live television stuff. And I thought it was really interesting. I thought a couple of folks did well. I think a couple of them did very poorly, actually, a couple did very, very poorly.","But a couple did really nicely and I really enjoyed -- You know I've never done the debating stuff before, these politicians are all talk and no action. They talk and talk and talk and nothing ever happens. They say we're going to fix the VA. Look there's a guy. We're going to fix the VA and they've talked for years.","I've been hearing we're going to fix the VA, nothing ever happens. It's a disaster. In fact, it came out two weeks ago. It's worse than ever before because that's a politician. Where do you see what I do? Remember the Wollman Rink in Central Park. You know they couldn't -- when years and years they couldn't do it. I knocked it up in four months and to this day that must have been 30 years ago and nothing changes.","And that's what I do and we fix things. We make things better. We make things better. And our country has to be made better. I mean, our country is -- we're losing on trade. We're losing with the military. I mean, we can't beat ISIS. Can you imagine General Douglas MacArthur or General George Patton saying, oh, we're having a hard time with ISIS.","They'd wipe that -- they'd wipe that thing clean in two days. And I watched one of the Generals on television. You know we have all these Generals that go on television. My Generals aren't going to be on television because you know what the enemy learns from them. You know you say one little thing and they say, oh, he said that now we're prepared.","I just imagine George Patton sitting down being interviewed by a reporter saying exactly what he's going to do. Yes, we're going to attack them. Remember Obama a few weeks or so saying we're sending 50 men and 50 people. So now the enemy is waiting for those 50 people. There, there, there's a target on their back.","Instead of keeping your mouth shut and just doing it properly, right? You know, no, it's, it's unbelievable. Or how about we shouldn't have been in Iraq. It was a mistake. I was against it many years ago and I was strongly against it, headlines, Trump was -- I don't even know why they quoted me but I had headlines, Trump, because you're going to destabilize the Middle East.","OK, so they made the mistake. It was a terrible mistake. Now, what happens, you have to get out, Obama and he gives the date that we're leaving. He says, we're going to be gone and what was that 18 months gives an exact date. So the enemy said, wow, this is great. They pull back. I couldn't believe it. I thought might be camouflage of some form.","We pull back, right? And the enemy goes back, doesn't work too hard. Why they don't want to be killed even though you hear they want to be killed. Believe me. They don't want to be killed. So they pull back. We leave and it's a mess. It's a mess. So you got to keep your little ideas to yourself and we will do something so special with the military.","When CNN did a recent poll and it was a big one. Now don't forget about the fact that I'm winning every poll. We're winning now every single poll and we're winning in Iowa. We're winning in Iowa. And I really want to win Iowa. You know people say, oh well, just say you want to do well in Iowa. Just say you want to do well.","That way at the end, if you come in second or third or fourth, you know you can say -- I said I want to win Iowa. I've really hit. We, we have a great relationship with the Evangelicals like fantastic and with the Tea Party and with everybody in Iowa. And I really want to win it. I mean to me this is going to be fun.","I'm going to be here a lot. I'm going to be here so much in the next two weeks you're going to be sick of me. You're going to say I can't stand him. I don't want to see him anymore. Look at those beautiful hats. I don't Make America Great Again. There Make America Great Again hats, hottest thing. There's a man and that's a real one.","That's one made in the -- that's one made in the USA. I know the difference. Those are made in the USA. They're not mine. They have the right slogan. You know the problem. These hats have become so hot. That's why I immediately love this guy. They had to become so hot that the New York Times did a story.","It's one of the hottest accessories for women. You believe it? They go to fancy balls wearing the hat but it's -- it really has been -- it has been a great thing. So we are going to do things that are going to be so exciting and so good. But I want to win Iowa. We have to get out. You have to get out to the caucuses.","And you know the theory because we always get the biggest crowds. We go -- no matter where we go we get the biggest crowds and the only thing the pundits can say is well, maybe, maybe they don't want to show up. And the other day, you heard we had a tremendous -- we had 15,000 people and 7,000 people were sent -- we couldn't get them into the arena, and the pundits are saying, well, but maybe they won't show up to vote.","I don't know. Maybe they won't show up to vote. I don't know maybe they won't but it seems crazy because some of those people were waiting on line for seven hours in the cold. I don't even know how you do it but seven hours in the cold and they wait and wait and wait and it just seems hard to believe that you wait seven hours in the cold.","And then they'd like me more after the event and then they don't show up to vote or caucus or whatever they want to do. Whatever it is but I think you know in the case of New Hampshire, the vote and I think they're going to show up. I think actually, I have a feeling we're leading in all the polls. I have a feeling we're going to actually do better than the polls are saying because there is -- there's a movement.","This is actually a movement and there is a feeling out there that's so strong, so powerful. I'll give you a little example, zero sleep, I mean zero. I left. I mean, you're probably saying what's he doing here? How about I was on one of the programs, a nice program this morning at 6:30 in the morning, OK? So they said, oh, you got here early.","Yeah, we got here. We got to do what you have to do but zero sleep. There's a movement and you're the same. I mean, we're workers. There's a movement going on that's amazing. It's this movement. And you know in the old days we're called the silent majority. It's not the silent majority. It's a noisy majority.","We're tired of stupidity. We're tired of losing $500 billion a year to China. We have a trade deficit with China of $500 billion a year. That's not going to happen with me. I love China. I do great with China. They rent buildings of mine. They have the biggest bank in the world. There's a Chinese bank. They pay me rent.","They have -- they're in my building in New York one of my buildings, and frankly, it's all great. I sell condos to the people of China. They can't believe what they get away with, OK? They tell me, they're friends of mine. They say we can't believe it. We can't believe it. In other words, they can't believe how stupid our leaders are.","I don't -- I don't hold that against China. I think they're great. I mean, if our leaders -- if we could have a $500 billion surplus with China I'd love that. That would be great but that wouldn't happen because if that ever happened if it started getting a little out of control, boom, they'd slice it off.","We do this on a yearly basis. For years we lose hundreds and hundreds of billions of dollars. I'm not talking about millions. Talking about billions. We can't do it. So we're going to change it around. And I have the greatest business -- you know we have the greatest businesspeople in the world. Carl Icahn, many others have endorsed me and I'll get him involved.","I'll say, Carl. Do you ever hear of Carl Icahn? Great business -- Carl watch over China trade. He'll do it. He doesn't want money. He'll do it because he loves the country and because it's fun for him, OK? Believe me. Just go and do your thing. We're going to come out just fine. That's what happens. I mean, we use political hacks to negotiate some of the biggest deals in the world.","Political hacks. Look at the deal with Iran. It's a disgrace. It's a disgrace. $150 billion we're giving them. Then they capture these sailors, these wonderful, young sailors. I don't blame them but they captured these kids and they have them on their knees in the begging position, hands up, guns to their heads, and humiliation for our country, and then they released the pictures, and then they have one of the guys saying I apologize, I apologize.","And he didn't know that -- you know I mean, they might have asked him to say, they might have told him to say it. Nobody even knows that. It's too early to tell but it's humiliation. The only reason they even let him back was because they're not stupid people. They're very smart people and they're great negotiators.","And in two days they get a check for $150 billion, OK? They didn't want to take a chance -- see the difference is if they did that with me, I'd say you're not getting your money back. You're in default for what you did. No, you're in default. The only thing I don't like -- here's the only thing I don't like is that if I win I will go and I will say the money is gone, folks, because that $150 billion is gone, and I can't get it back once it's gone.","Well, maybe you can but there's a different work but, but it's gone, it's gone. And what a shame, what a shame. I actually said to people based on what they did with the humil -- because I call that -- does everyone agree? You know some people said, well, they let them out. I thought that was humiliating for the United States to have these people on their knees with their hands up and guns in their head.","And then we have Kerry saying wasn't it wonderful that they let them go? I think it was disgraceful. Remember this, if we weren't giving them a check, in two, three days for $150 billion, they would have never let them go. They would have kept them. And just don't forget this also, they have four hostages, OK? And we have right now what -- we have a minister, a pastor, we have a writer from The Washington Post, we have a lot of people right now that you know, and nobody even mentions them.","And we're now talking about the sailors, they gave them back. I thought it was horrible. I thought the whole scene was horrible and I think that the pictures taken released by Iran. I thought it was horrible. It was a slap in the face and then our people don't even know it was bad but they had four other people that should have come back as part of that deal as bad as that deal was.","But they should have said hey before we give you anything, you have to let our prisoners back. And if they said no, you take a walk, and they'll call back in two minutes, and they're going to come back and you'll -- they'll give you the prisoner. We never asked. We didn't ask because they said they didn't want to complicate the deal.","This is the kind of people we have. So we're not going to do that. We don't want to be the stupid people anymore. We're not going to be the stupid people anymore because right now we're the stupid people. We have the dumbest people leading our nation. They're leading us. They are leading us into the worst positions.","And you just look at what's happening. So our military is weak. I'm in the real estate business. All the time I get listings for, you know, for bases, army bases, army but I say how many do we have? They're closing up bases all over the place. We have to have a really strong military. And I'm going to make our military so strong and so powerful and so big in the sense -- a big but positive big that nobody is going to mess with us again.","Nobody is going to mess with us. And you know in a lot of ways, it's the cheapest thing we can do because right now nobody has any faith in us. They don't have any -- our allies don't you know -- our allies, our allies -- First of all, we don't have too many allies. The allies we have take advantage of us, OK? For the most part.","But let's talk one other thing while -- and then we'll take a couple of questions. So we spend all this money and we're wasting tremendous money and you saw the budget and that's going to add another two, at least another two, I would say another $2 trillion based on everything that we can say. But when you look at the fact that we protect nations that are making a fortune.","South Korea they're wonderful people. I have partnerships. I have all sorts of deals with them. They're great but they're rich. They're very rich. They make the ships. They make all of your television sets. I order 4,000 televisions. I order them from South Korea, unfortunately, we don't make television sets.","Do you remember we used have Zenith and we used to have GE and we used to have all these -- we don't have any -- it's all made in South Korea except for Sony which is made in Japan and they've lost their way a little bit. It's not as good. But frankly, Sony, I don't know what happened to Sony. We'll have to figure that out.","But in all fairness, Japan is doing great. You look at Komatsu tractors they're really doing a big job on the Caterpillar. And to a certain extent John Deere. You know, I'm one of John Deere's biggest customers. I've spent millions and millions of dollars to John Deere and it's a great company but it's hard when they are competing against phony devaluations of currency.","And that's what's happening and our politicians do nothing to stop it. So in the end, we're going to change it all. We're going to make it so smart. We're going to get rid of the deficits. We're going to make -- when we protect somebody it's OK but if we're protecting Saudi Arabia -- they were making $1 billion now it's less because the oil's down but they're still making plenty.","They were making $1 billion a day. We protect these people for peanuts, for nothing, for nothing. We end up leasing land. We pay for the lease to have a base. We pay and we're protecting them. Those days are over. Those days are over. We'll help the good people but they have to help us too. We're like a debtor nation.","When we owe $19 trillion now it's going to be $21 trillion because of the deal that was just made by the Republicans. It's almost like, you know we know where the Democrats are coming from but the people we send to go and fight Obamacare and all, right? They let us down. I don't know what happens. They go to Washington all of a sudden their hand goes up, I approve it. It's amazing.","I don't know they get down there something happens to him. It's a different water or something. But some -- you know you send them down there ready to go. They're tough. They're going to stop. Then all of a sudden what happened? And I guess, they don't want to leave. Maybe they feel they're going to say better but something happens.","It won't happen with me. That's why I'm not taking funds from anybody. Nobody is giving me money, self-funding, self-funding. So when I have to do something I don't have to worry about a lobbyist. I don't have to worry about special interests. I do what's right for the people. So that's what's going to happen.","Any questions? Go ahead. Go ahead.","Wow, that's terrible.","Are you from Iowa?","OK. Well, you know they have a tremendous problem in New Hampshire with the heroin. Unbelievable. It's always the first question I get and they have a problem all over and it comes through the border. We're going to build a wall, number one, we're going to build a wall. It's going to be a real wall because that stuff is pouring across and we're going to have a real wall.","And people are going to come into the country but they're going to come in legally. And we're going to stop that drug traffic because the heroin is really tough because they say once you get hooked it's really tough. In all fairness to your son, it's a tough thing. Some very, very strong people have not been able to get off it. So we have to work with people to get off it. And the biggest thing we can do, in honor of your son, actually, and the people that did have problems, big problems.","We have to be able to stop it because once they -- you just relax, OK? Yeah. It's a tough deal. Come on. It's a tough deal. Well, what we have to do is we have to make sure that they don't get hooked because it's a tough thing and I know what you went through and he's a great father. I can see it. And your son is proud of you.","Your son is proud of you. It's tough stuff. It's tough stuff and it could be stopped. And the best way, you know the best way to stop it is upfront. Before it happens. Because once, once they start taking it, it's, it's they say it's brutal. Yes, sir.","Well, it's something that a lot of people want and we're going to probably look at that, but a lot of people want that. Look, we're looking at a lot of things. We're going to run things right.","Yeah. You're -- we're going to look at -- we're going to look at a lot of things. You're right. A lot of people are talking about that. Yes, sir.","Well. I think one of the reasons that I'm doing so well. You know poll just came out I'm at 42%. Can you believe it? Remember? So we had -- we had polls why -- You know I started and I started at six and we went to 12, we went to 18, went to 20. And every time I go up, the pundits will say, well, that's his cap.","He's reached his cap. That's about it. He will -- and you know now we had 142. That's with like 14 people and that's a lot. I think that one of the reasons that I'm doing well is it's not that I want to be -- hey, I went to an Ivy League School. I went to the Wharton School of Finance. I could do the best with the best of them, OK? With society at the highest level.","I do that. But political correctness is hurting us. It's taking too long. It takes too long. It's like everything has to be worded a certain way and nobody's offended. It's taking too long. It is actually hurting us and it almost shows a sign of weakness. I think one of the reasons I'm doing well is because people understand.","I'll give you an example. I came here, I was in Iowa a couple of weeks ago. You go to the stores. There's no Merry Christmas anymore. We're going to start saying Merry Christmas again, folks. OK? We're going to start -- it's true. We're going to start saying Merry Christmas again. And it's ridiculous. You go out to the stores in New York City.","You go to the store. You don't even have a sign up everything's red. They paint the red. They put everything but they don't have a sign. It's going to be Christmastime again. Go ahead.","Well, I've always gotten along with politicians. I've always worked with politicians. I built my -- and you know, I got along with Democrats and Liberals and Republicans and Conservatives and you know somebody said, he's a world-class businessman in one of the articles. It was very nice. I said to myself I am. I built a great company and in fact, when they went and saw it was much bigger and better to power -- it's a tremendous company.","And that's why I want to put that I'm not saying that as a bragging thing. I want to put that to work with this country so that we make great deals, so that we do it properly et cetera. I had my kids run it with executives and that said, I won't even care about my company anymore. This is so important. This is so inspiring.","Getting a chance to do this and turn our country around because our country's going so bad, it's so bad. You know I was talking about South Korea. So we have 28,000 soldiers on the line. We get nothing. We get peanuts and you have the maniac on the other side. We're protecting, we're protecting Japan. We're protecting Germany.","We're protecting all these countries, the hell do we get out of it, OK? And these are behemoths. These aren't like poor countries. You know when you want to help people and you want to stop whatever. These are rich countries and what we do and we get nothing. You know we get very little. Let me put it that way.","So all of that will change. And you know what? They'll have more respect for us than they did before. Yes? Yeah.","Did you like the answer I gave? Yeah. That's cool. Yeah, they used the word angry. Same thing. Close enough, right?","Mad might mean crazy or you know mad might be good. But you know what. It's a great thing. And Nikki who's a very good person she said there's an angry segment. And I was supposed to say I guess and Obama said it in his speech. He was talking about me that there are people that are angry. And rather than, oh, I'm not angry.","I'm not. I am angry. I am angry. I'm angry at stupidity. I'm angry at incompetence. I'm angry when China's making $500 billion a year and sucking our jobs and sucking our money out of our country. And we don't do anything about it. I'm not angry at China. I'm angry at our politicians. I'm angry. I'm angry when people pour across the border and they are told let them come in. I'm angry when somebody has a baby and we're supposed to take care of the baby for 85 years because that baby happened to -- you know the anchor baby thing.","I'm angry about a lot of things and I won't be angry for long because once we straighten it out I'm a very happy person, OK?","Well, you have to be a little bit careful. But I'll tell you what I do favor. You know ISIS and these bad dudes are using the Internet better than we use it. And we're the ones that really came up with it, right? We invented the Internet. ISIS is using the Internet and they're radicalizing kids. They're taking kids and with the Internet that -- they're bringing people over.","Number one, those people are never coming back. I don't care how they got there but they're never coming back. Right now they come back. We put them in. Eventually, they'll say what do we have to go over there and fight. Let's fight in the United States against us. But I am for absolutely, in some form, using the Internet to knock the hell out of ISIS and our enemies, OK? And some people would say, oh, freedom of speech.","Forget it. This is people that cut off heads, OK? They cut off heads. As the expression goes, trust me. We'll do fine. We're going to do fine with the Internet. Yes, sir.","Well, it's true and Social Security is really being hit by some people where they want to cut it. And you've been paying in there for a long time, right? And when we bring back our jobs -- you know my tax policy where your taxes are going down by tremendous numbers. Both business and personal. We're the highest-taxed nation in the world and the taxes are going down, big league.","And we're going to create an economy that's going to be vibrant again. And we're going to save our Social Security. And we're not going to do the cuts. I think I'm the only one that's talking about not cutting. And Mike Huckabee is also talking about it. But, but you know most of them are saying we're going to raise the age.","We're going to do this. We're going to do a lot of cutting. Now, there's tremendous waste, fraud, and abuse that we can take care of, right? But we're not going to be cutting it. We're going to make our country strong again, rich again, and we're going to be able to afford it. Because you know that was a contract we entered into.","People -- you've been paying for that. It's not like you're not paying. You're not getting it for nothing. So we're not going to be changing it, OK? Uh, yes, ma'am.","It's such an -- I get that question more. I can't believe it took so many questions before I got it. The college debt. It's an incredible problem. What happens is they borrow money from the government, now the colleges sort of raise, raise, raise because the colleges see all this money. I'm telling you and I'm not even blaming.","It's almost like a natural business instinct. So what happens is they have all these students they're, they're you know borrowing money. They get the money fairly easy but they had to pay it back. But the colleges now start all of a sudden raising, raising, raising. I'm going to look into it very seriously because you look at the way that's going up and what happens is they're basically getting money from the government to increase everything and the cost of the -- of running these colleges has gotten out of control.","They've gone up so much proportionately. So we're going to be working on that very hard. We're going to be working on it. A lot of people ask me. I get so many questions from students. They -- and the biggest problem is you get out and we don't have a job because the jobs, you know, the jobs are all crummy jobs.","I don't know if you saw the phony job report that came out the other day. So it's around five. But what they don't say is the jobs are bad. You know they're bad jobs. You look at all the part-time stuff and all but they're bad jobs. They're not good jobs because our good jobs are fleeing. And the other thing is people that look for a job, that give up looking, and you stop looking for the job.","Now you go back -- they are statistically, they consider you employed because and I'll tell you something, when I have 35,000 people coming to a rally and 20 and all of these thousands and thousands of -- honestly, if there was a real 5% or 4% unemployment, I wouldn't have these crowds. There's a lot of -- there are people who want jobs.","And the worst are the college kids. They come in, they work hard, they borrow money, they get out of college, they can't get a job. Are you going to be able to get a job?","Well, you better. If you don't you'll see my people, OK? If you don't -- you and Sean, OK? You and Sean are going to work for Trump. OK, Sean? Soon as he gets better he's going to be with me. OK. Question. Go ahead.","OK. So there are things we can do. Number one, Department of Education. We're getting rid of Common Core. You know, we're getting, I mean this guy Jeb Bush is still on Common Core. You have -- how does anybody want Common Core. I've seen it, locally, we want local education, the parents, the people, you'll control it, less expensive much better.","The bureaucrats in Washington, gone. We'll be able to cut -- EPA so bad, so bad what's happening there. You know they're making the farmers. I have friends that are farmers and these farmers in Iowa, in different places, but in Iowa, they're complaining. I mean they can't -- they can't take care of their land anymore.","Everything they do is a big deal. Used to be a farm. Today it's like you got to read. You got to certify. You got to do all this stuff. They tell me things it's like a horror story. We're going to go back 15 years. We're going to go back so many years. So what happened is so incredible. So we'll take care of things and we will -- we have a lot of cutting to do. There's tremendous cutting to do. You know when you have budgets and you're dealing in trillions and if you put the right people in charge of these massive agencies and you say cut 5%, you know these people are talking about balancing budgets and 35 years from now.","We can do it. Believe me, much quicker. We can do it. We can do it quickly, quickly but there's a lot of waste, fraud and abuse. Yes, sir. Go ahead.","Well, Hillary is going to have a problem. And don't forget if a new administration goes in that's a whole -- that's a very easy question. But Hillary does have -- I mean for the first time, she's under such -- look what she did is so wrong. What she did is so bad. I don't see how she makes it. You look at Petraeus.","You look at other people. They did a tiny fraction of what she did and they've been destroyed. So I don't know how she makes it. I mean I don't know. I would love to run against her. I just don't know how she makes it into the starting gate with all that's going on. Now with that being said, the Democrats are protecting her or she wouldn't be as far as she is right now.","But we'll see what happens. But the answer is absolutely. Uh, yes. Go ahead, sir.","But that's what I do. I know. That's what I do. We'll -- you get them in a room and you say do it. Obama doesn't get anybody in a room. He tried I think for a little while and it failed. And I won't go into it, OK? But he doesn't get it done. So he signs Executive Orders and then everybody sues and you're not supposed to be doing that.","So we'll get it done. It's called get them in a room, right? Cajole, cajole. Let's go, folks. We've got to cut, right? OK. Yes, ma'am. Go ahead.","The Judicial Emergency meaning more judges?","Ah well, that's easy. I hope he doesn't appoint too many actually because I'd rather appoint mine. You know we have some judges that are -- we -- well and one of them that was appointed by Bush, as you know, Justice Roberts, approved Obamacare twice. We could have had Obamacare knocked out twice and by every standard, what he did was wrong.","And one of the other judges practically won't even speak to him again. It's very interesting. Whatever, what he did was wrong. And we have Obamacare. So I'd almost rather have not too many judges appointed. Let's wait. We can wait for another year. Let's appoint some really good judges. Yes, sir in the back.","Repeal it and replace it with something great. We are going to get rid of Obamacare. We'll even have to get rid of the $5 billion website that still doesn't work. Can you imagine that? A website costs $5 billion and to this day it's no good. I have kids, I have young kids, they do websites, like, they do -- I'm not saying websites like that but they're big complicated websites.","They do it for peanuts. They do it. They sit. Bing, bing, bing, sir, we've just created another website. I got them all over the place. I got a website set they're pouring out of my ears. They cost nothing. $5 billion for website, for a website that doesn't work. OK. Go ahead. Go ahead.","Yeah. Mental health is a big thing because we're going to save the Second Amendment. The Second Amendment cannot be touched. And frankly, mental health is such a big thing because it is a mental health thing. Go ahead.","Are you a veteran? Are you a veteran?","OK. It's good that you say that that is nice. Because the veterans need help with it and we are going to be investing big with the veterans also on mental health because the veterans are going through -- I'm telling you. I go to New Hampshire. I go to different places. The veterans are suffering in this country.","And I actually think it's not a money thing. I think it's bureaucratic. I think it's theft and I think it's incompetence but because they throw the money, I mean the money, you know because the politicians are so afraid. But we have people that are very dishonest. If you look at what's going on Phoenix. I don't know if you guys have been seeing the Phoenix place.","The Phoenix VA, it's a disaster. But there's a lot of corruption and there's a lot of incompetence, and we're going to take care of that with great management. I mean, we need great managers and we're going to take care of it. One of the things we're doing with the veterans you know, they have to wait a long period of time.","Some of them wait for six, seven days in a waiting room to see a doctor. If they do, we're going to work out a system where they go and can go to the local hospital. They can go to the local doctors. They'll get taken care of. It's going to be much cheaper. You know many people die? Do you know many veterans are dying, waiting to go in, and see for a simple procedure or maybe even a pill, and they end up dying because they can't get to see a doctor.","So we're going to let them go and see a doctor at a private hospital or a public hospital that's in the area who by the way aren't doing very well. They're not even doing well. And we're going to work a system for those people because the VA is not working. And we don't want people dying because they can't get to see -- there was one case where they waited six days after they got there, the doctor said we can't see you because we're going on vacation now.","Think of it. Can you imagine yourselves? And most of you are not in that position, waiting in a reception room for four, five, six days to see a doctor for something maybe to get a prescription or get a pill or have a simple procedure. And people are dying there and they're veterans and we can't do that.","So I mean, the veterans groups have been so great to me. The endorsements and everything else have been great but I'm going to be great to them. OK. Maybe we'll do two more. Yes, ma'am. Go ahead.","Well, we have to be careful. Look there's something going on, the Muslims, and there's something going on, OK? There's something going on. We've got to figure out what it is. And I proposed that, yes, and on a temporary basis. But when you have the killings in California, you have all this stuff, your planes flying into the World Trade Center, you have the killings in Paris where they walk in and they just shoot all these innocent people, who by the way, Paris has the toughest gun laws probably in the world.","You can't have a gun unless you're a crook, in which case you're a criminal, you can have a gun. You just walk in with a gun. But when you have the toughest gun laws and you have these people walk into these different places and just kill 130 people with more to follow because there's some that are so badly hurt.","But we had a smaller version of that in California, 14 people. So the gun laws have to be taken care of in terms of we have to protect the Second Amendment. Think of this, if we had in Paris let's say or in California or on the military base where we have a military -- we have a gun-free zone and a military base that we have all -- we have these five guys that are great soldiers and a guy walks in and kills them.","Because when you see a gun-free zone that means it's like candy to a maniac. You know to these whack jobs, right? And we have to call them that because that's what they are. We can't call them the leaders and the this. You know the way the press, these guys build them up so big, but they're like, they're like bad.","The mastermind, right? In Paris, they called the mastermind. What's the mastermind? These are -- I call him the guy with the dirty hat. So what we're going to do is we're going to be smart. We're going to be vigilant. We have to watch. We have to see what's happening. So important. We have to see what's happening.","And there's something going on. In California, they had pipe bombs, they had all sorts of stuff all over the apartment. People knew it. Nobody reported them. In other words, that was a disaster waiting to happen. People knew it was waiting to happen. Why didn't they call the local police? So there's something going on. We got to get to the bottom of it. And as far as -- as far as Syria is concerned, they're not coming in because we have no idea.","We have no idea where these people came from, who they are. You look at the migration, and I have a bigger heart than anybody, but you look at this migration, and you don't see what do you? You don't see a lot of women. You don't see a lot of children. You see young, strong people. You say what's going on? That's the strangest looking migration.","It looks like an army is marching and this could be the all-time great Trojan Horse. It's probably not but we can't take a chance. The people are totally undocumented. We have no idea. They say we're from Syria they could be from any place and there's no way of telling. They have no documents whatsoever.","We have enough problems. Our country has enough problems. So that's it. Well, folks, I love you all. Get out and caucus. Go with Trump. You'll be very happy. And thank you very much. I love you. I love you. Thank you. You take care of yourself. Take care of yourself, OK? It's very cool. I bet he was a great boy. Thank you, man."],"text":" Well, what great people. What great people. And Sean is a special friend of mine because he's going through a little difficulty and he wants to vote for Trump and we love Sean, right? OK. We love Sean and nice to meet you. We spoke about two, three weeks ago, and I think you're doing much better. So it's great to have you, man. OK? We'll see you in a little while. We'll go up and say a couple of words. Unless you don't want me to speak. I won't speak. Sean, maybe I can get out of speaking that would be even better, right? Come on over. Come on over. Hello, everybody. Great to be here. You know this was supposed to be just a small little gathering. They said maybe 30, 40 people that are friends of ours. And look what happens all the time. I said are we making this speech? What are we doing? But it's so good to see Sean and it's so good to see the rest of you. And we have to caucus before we forget. We have to caucus. We have to get out. Otherwise, it all doesn't mean anything. So last night we had the debate. Did everybody see the debate? I think so, yeah. We've been really treated nicely. Even the pundits last night were treating me nicely. You know I've won every poll in every debate but the pundits sometimes don't go along with the poll. Now, the pundits are sort of getting it and they're getting it because we have such incredible receptivity. If you look at what's going on with the people. I call it a movement, it's a movement, like, even this was supposed to be 25 to 40 people. And look I don't even know who the hell some of these people are. I'm trying to figure it out. But, but it's just been incredible. And no matter what subject we talk about whether it's illegal immigration, we'll take care of that situation, we're going to make it tough, you just can't come in, whether it's our vets who are treated so badly. Frankly, the illegal immigrants are treated in many cases, better than our veterans. It's true. You go to some places like California with the driver's licenses, under this, under that, our vets don't get treated as well. And we're going to change so many things, so many things. We're going to make our country great again. And I actually start saying over the last couple of weeks, we're going to make our country greater, potentially, greater than ever before. We have such potential. We have such incredible potential. And so last night, we'll talk -- and I may take a few questions. Who would do a few questions today? That's what I think. Can I do that? I think I can do that, right? We'll just shout them out. But last night was very interesting. We went up and you never know what's going to happen. You know it's a lot of people, a lot of live television stuff. And I thought it was really interesting. I thought a couple of folks did well. I think a couple of them did very poorly, actually, a couple did very, very poorly. But a couple did really nicely and I really enjoyed -- You know I've never done the debating stuff before, these politicians are all talk and no action. They talk and talk and talk and nothing ever happens. They say we're going to fix the VA. Look there's a guy. We're going to fix the VA and they've talked for years. I've been hearing we're going to fix the VA, nothing ever happens. It's a disaster. In fact, it came out two weeks ago. It's worse than ever before because that's a politician. Where do you see what I do? Remember the Wollman Rink in Central Park. You know they couldn't -- when years and years they couldn't do it. I knocked it up in four months and to this day that must have been 30 years ago and nothing changes. And that's what I do and we fix things. We make things better. We make things better. And our country has to be made better. I mean, our country is -- we're losing on trade. We're losing with the military. I mean, we can't beat ISIS. Can you imagine General Douglas MacArthur or General George Patton saying, oh, we're having a hard time with ISIS. They'd wipe that -- they'd wipe that thing clean in two days. And I watched one of the Generals on television. You know we have all these Generals that go on television. My Generals aren't going to be on television because you know what the enemy learns from them. You know you say one little thing and they say, oh, he said that now we're prepared. I just imagine George Patton sitting down being interviewed by a reporter saying exactly what he's going to do. Yes, we're going to attack them. Remember Obama a few weeks or so saying we're sending 50 men and 50 people. So now the enemy is waiting for those 50 people. There, there, there's a target on their back. Instead of keeping your mouth shut and just doing it properly, right? You know, no, it's, it's unbelievable. Or how about we shouldn't have been in Iraq. It was a mistake. I was against it many years ago and I was strongly against it, headlines, Trump was -- I don't even know why they quoted me but I had headlines, Trump, because you're going to destabilize the Middle East. OK, so they made the mistake. It was a terrible mistake. Now, what happens, you have to get out, Obama and he gives the date that we're leaving. He says, we're going to be gone and what was that 18 months gives an exact date. So the enemy said, wow, this is great. They pull back. I couldn't believe it. I thought might be camouflage of some form. We pull back, right? And the enemy goes back, doesn't work too hard. Why they don't want to be killed even though you hear they want to be killed. Believe me. They don't want to be killed. So they pull back. We leave and it's a mess. It's a mess. So you got to keep your little ideas to yourself and we will do something so special with the military. When CNN did a recent poll and it was a big one. Now don't forget about the fact that I'm winning every poll. We're winning now every single poll and we're winning in Iowa. We're winning in Iowa. And I really want to win Iowa. You know people say, oh well, just say you want to do well in Iowa. Just say you want to do well. That way at the end, if you come in second or third or fourth, you know you can say -- I said I want to win Iowa. I've really hit. We, we have a great relationship with the Evangelicals like fantastic and with the Tea Party and with everybody in Iowa. And I really want to win it. I mean to me this is going to be fun. I'm going to be here a lot. I'm going to be here so much in the next two weeks you're going to be sick of me. You're going to say I can't stand him. I don't want to see him anymore. Look at those beautiful hats. I don't Make America Great Again. There Make America Great Again hats, hottest thing. There's a man and that's a real one. That's one made in the -- that's one made in the USA. I know the difference. Those are made in the USA. They're not mine. They have the right slogan. You know the problem. These hats have become so hot. That's why I immediately love this guy. They had to become so hot that the New York Times did a story. It's one of the hottest accessories for women. You believe it? They go to fancy balls wearing the hat but it's -- it really has been -- it has been a great thing. So we are going to do things that are going to be so exciting and so good. But I want to win Iowa. We have to get out. You have to get out to the caucuses. And you know the theory because we always get the biggest crowds. We go -- no matter where we go we get the biggest crowds and the only thing the pundits can say is well, maybe, maybe they don't want to show up. And the other day, you heard we had a tremendous -- we had 15,000 people and 7,000 people were sent -- we couldn't get them into the arena, and the pundits are saying, well, but maybe they won't show up to vote. I don't know. Maybe they won't show up to vote. I don't know maybe they won't but it seems crazy because some of those people were waiting on line for seven hours in the cold. I don't even know how you do it but seven hours in the cold and they wait and wait and wait and it just seems hard to believe that you wait seven hours in the cold. And then they'd like me more after the event and then they don't show up to vote or caucus or whatever they want to do. Whatever it is but I think you know in the case of New Hampshire, the vote and I think they're going to show up. I think actually, I have a feeling we're leading in all the polls. I have a feeling we're going to actually do better than the polls are saying because there is -- there's a movement. This is actually a movement and there is a feeling out there that's so strong, so powerful. I'll give you a little example, zero sleep, I mean zero. I left. I mean, you're probably saying what's he doing here? How about I was on one of the programs, a nice program this morning at 6:30 in the morning, OK? So they said, oh, you got here early. Yeah, we got here. We got to do what you have to do but zero sleep. There's a movement and you're the same. I mean, we're workers. There's a movement going on that's amazing. It's this movement. And you know in the old days we're called the silent majority. It's not the silent majority. It's a noisy majority. We're tired of stupidity. We're tired of losing $500 billion a year to China. We have a trade deficit with China of $500 billion a year. That's not going to happen with me. I love China. I do great with China. They rent buildings of mine. They have the biggest bank in the world. There's a Chinese bank. They pay me rent. They have -- they're in my building in New York one of my buildings, and frankly, it's all great. I sell condos to the people of China. They can't believe what they get away with, OK? They tell me, they're friends of mine. They say we can't believe it. We can't believe it. In other words, they can't believe how stupid our leaders are. I don't -- I don't hold that against China. I think they're great. I mean, if our leaders -- if we could have a $500 billion surplus with China I'd love that. That would be great but that wouldn't happen because if that ever happened if it started getting a little out of control, boom, they'd slice it off. We do this on a yearly basis. For years we lose hundreds and hundreds of billions of dollars. I'm not talking about millions. Talking about billions. We can't do it. So we're going to change it around. And I have the greatest business -- you know we have the greatest businesspeople in the world. Carl Icahn, many others have endorsed me and I'll get him involved. I'll say, Carl. Do you ever hear of Carl Icahn? Great business -- Carl watch over China trade. He'll do it. He doesn't want money. He'll do it because he loves the country and because it's fun for him, OK? Believe me. Just go and do your thing. We're going to come out just fine. That's what happens. I mean, we use political hacks to negotiate some of the biggest deals in the world. Political hacks. Look at the deal with Iran. It's a disgrace. It's a disgrace. $150 billion we're giving them. Then they capture these sailors, these wonderful, young sailors. I don't blame them but they captured these kids and they have them on their knees in the begging position, hands up, guns to their heads, and humiliation for our country, and then they released the pictures, and then they have one of the guys saying I apologize, I apologize. And he didn't know that -- you know I mean, they might have asked him to say, they might have told him to say it. Nobody even knows that. It's too early to tell but it's humiliation. The only reason they even let him back was because they're not stupid people. They're very smart people and they're great negotiators. And in two days they get a check for $150 billion, OK? They didn't want to take a chance -- see the difference is if they did that with me, I'd say you're not getting your money back. You're in default for what you did. No, you're in default. The only thing I don't like -- here's the only thing I don't like is that if I win I will go and I will say the money is gone, folks, because that $150 billion is gone, and I can't get it back once it's gone. Well, maybe you can but there's a different work but, but it's gone, it's gone. And what a shame, what a shame. I actually said to people based on what they did with the humil -- because I call that -- does everyone agree? You know some people said, well, they let them out. I thought that was humiliating for the United States to have these people on their knees with their hands up and guns in their head. And then we have Kerry saying wasn't it wonderful that they let them go? I think it was disgraceful. Remember this, if we weren't giving them a check, in two, three days for $150 billion, they would have never let them go. They would have kept them. And just don't forget this also, they have four hostages, OK? And we have right now what -- we have a minister, a pastor, we have a writer from The Washington Post, we have a lot of people right now that you know, and nobody even mentions them. And we're now talking about the sailors, they gave them back. I thought it was horrible. I thought the whole scene was horrible and I think that the pictures taken released by Iran. I thought it was horrible. It was a slap in the face and then our people don't even know it was bad but they had four other people that should have come back as part of that deal as bad as that deal was. But they should have said hey before we give you anything, you have to let our prisoners back. And if they said no, you take a walk, and they'll call back in two minutes, and they're going to come back and you'll -- they'll give you the prisoner. We never asked. We didn't ask because they said they didn't want to complicate the deal. This is the kind of people we have. So we're not going to do that. We don't want to be the stupid people anymore. We're not going to be the stupid people anymore because right now we're the stupid people. We have the dumbest people leading our nation. They're leading us. They are leading us into the worst positions. And you just look at what's happening. So our military is weak. I'm in the real estate business. All the time I get listings for, you know, for bases, army bases, army but I say how many do we have? They're closing up bases all over the place. We have to have a really strong military. And I'm going to make our military so strong and so powerful and so big in the sense -- a big but positive big that nobody is going to mess with us again. Nobody is going to mess with us. And you know in a lot of ways, it's the cheapest thing we can do because right now nobody has any faith in us. They don't have any -- our allies don't you know -- our allies, our allies -- First of all, we don't have too many allies. The allies we have take advantage of us, OK? For the most part. But let's talk one other thing while -- and then we'll take a couple of questions. So we spend all this money and we're wasting tremendous money and you saw the budget and that's going to add another two, at least another two, I would say another $2 trillion based on everything that we can say. But when you look at the fact that we protect nations that are making a fortune. South Korea they're wonderful people. I have partnerships. I have all sorts of deals with them. They're great but they're rich. They're very rich. They make the ships. They make all of your television sets. I order 4,000 televisions. I order them from South Korea, unfortunately, we don't make television sets. Do you remember we used have Zenith and we used to have GE and we used to have all these -- we don't have any -- it's all made in South Korea except for Sony which is made in Japan and they've lost their way a little bit. It's not as good. But frankly, Sony, I don't know what happened to Sony. We'll have to figure that out. But in all fairness, Japan is doing great. You look at Komatsu tractors they're really doing a big job on the Caterpillar. And to a certain extent John Deere. You know, I'm one of John Deere's biggest customers. I've spent millions and millions of dollars to John Deere and it's a great company but it's hard when they are competing against phony devaluations of currency. And that's what's happening and our politicians do nothing to stop it. So in the end, we're going to change it all. We're going to make it so smart. We're going to get rid of the deficits. We're going to make -- when we protect somebody it's OK but if we're protecting Saudi Arabia -- they were making $1 billion now it's less because the oil's down but they're still making plenty. They were making $1 billion a day. We protect these people for peanuts, for nothing, for nothing. We end up leasing land. We pay for the lease to have a base. We pay and we're protecting them. Those days are over. Those days are over. We'll help the good people but they have to help us too. We're like a debtor nation. When we owe $19 trillion now it's going to be $21 trillion because of the deal that was just made by the Republicans. It's almost like, you know we know where the Democrats are coming from but the people we send to go and fight Obamacare and all, right? They let us down. I don't know what happens. They go to Washington all of a sudden their hand goes up, I approve it. It's amazing. I don't know they get down there something happens to him. It's a different water or something. But some -- you know you send them down there ready to go. They're tough. They're going to stop. Then all of a sudden what happened? And I guess, they don't want to leave. Maybe they feel they're going to say better but something happens. It won't happen with me. That's why I'm not taking funds from anybody. Nobody is giving me money, self-funding, self-funding. So when I have to do something I don't have to worry about a lobbyist. I don't have to worry about special interests. I do what's right for the people. So that's what's going to happen. Any questions? Go ahead. Go ahead. I lost my son two years ago to a heroin overdose. Wow, that's terrible. I know, he was 24 years old. And I wanted to know if you're elected President, what can you put in place to tackle the ongoing heroin -- Are you from Iowa? I'm from Oswego, New York -- OK. Well, you know they have a tremendous problem in New Hampshire with the heroin. Unbelievable. It's always the first question I get and they have a problem all over and it comes through the border. We're going to build a wall, number one, we're going to build a wall. It's going to be a real wall because that stuff is pouring across and we're going to have a real wall. And people are going to come into the country but they're going to come in legally. And we're going to stop that drug traffic because the heroin is really tough because they say once you get hooked it's really tough. In all fairness to your son, it's a tough thing. Some very, very strong people have not been able to get off it. So we have to work with people to get off it. And the biggest thing we can do, in honor of your son, actually, and the people that did have problems, big problems. We have to be able to stop it because once they -- you just relax, OK? Yeah. It's a tough deal. Come on. It's a tough deal. Well, what we have to do is we have to make sure that they don't get hooked because it's a tough thing and I know what you went through and he's a great father. I can see it. And your son is proud of you. Your son is proud of you. It's tough stuff. It's tough stuff and it could be stopped. And the best way, you know the best way to stop it is upfront. Before it happens. Because once, once they start taking it, it's, it's they say it's brutal. Yes, sir. I have a question for people getting Well, it's something that a lot of people want and we're going to probably look at that, but a lot of people want that. Look, we're looking at a lot of things. We're going to run things right. It's going to cost 50% -- Yeah. You're -- we're going to look at -- we're going to look at a lot of things. You're right. A lot of people are talking about that. Yes, sir. I was wondering what you might do with the American economy Well. I think one of the reasons that I'm doing so well. You know poll just came out I'm at 42%. Can you believe it? Remember? So we had -- we had polls why -- You know I started and I started at six and we went to 12, we went to 18, went to 20. And every time I go up, the pundits will say, well, that's his cap. He's reached his cap. That's about it. He will -- and you know now we had 142. That's with like 14 people and that's a lot. I think that one of the reasons that I'm doing well is it's not that I want to be -- hey, I went to an Ivy League School. I went to the Wharton School of Finance. I could do the best with the best of them, OK? With society at the highest level. I do that. But political correctness is hurting us. It's taking too long. It takes too long. It's like everything has to be worded a certain way and nobody's offended. It's taking too long. It is actually hurting us and it almost shows a sign of weakness. I think one of the reasons I'm doing well is because people understand. I'll give you an example. I came here, I was in Iowa a couple of weeks ago. You go to the stores. There's no Merry Christmas anymore. We're going to start saying Merry Christmas again, folks. OK? We're going to start -- it's true. We're going to start saying Merry Christmas again. And it's ridiculous. You go out to the stores in New York City. You go to the store. You don't even have a sign up everything's red. They paint the red. They put everything but they don't have a sign. It's going to be Christmastime again. Go ahead. Mr. Trump, how do you work with a divided Congress when you're elected? How do you plan to work with -- Well, I've always gotten along with politicians. I've always worked with politicians. I built my -- and you know, I got along with Democrats and Liberals and Republicans and Conservatives and you know somebody said, he's a world-class businessman in one of the articles. It was very nice. I said to myself I am. I built a great company and in fact, when they went and saw it was much bigger and better to power -- it's a tremendous company. And that's why I want to put that I'm not saying that as a bragging thing. I want to put that to work with this country so that we make great deals, so that we do it properly et cetera. I had my kids run it with executives and that said, I won't even care about my company anymore. This is so important. This is so inspiring. Getting a chance to do this and turn our country around because our country's going so bad, it's so bad. You know I was talking about South Korea. So we have 28,000 soldiers on the line. We get nothing. We get peanuts and you have the maniac on the other side. We're protecting, we're protecting Japan. We're protecting Germany. We're protecting all these countries, the hell do we get out of it, OK? And these are behemoths. These aren't like poor countries. You know when you want to help people and you want to stop whatever. These are rich countries and what we do and we get nothing. You know we get very little. Let me put it that way. So all of that will change. And you know what? They'll have more respect for us than they did before. Yes? Yeah. you know Americans really Did you like the answer I gave? Yeah. That's cool. Yeah, they used the word angry. Same thing. Close enough, right? But what about Mad might mean crazy or you know mad might be good. But you know what. It's a great thing. And Nikki who's a very good person she said there's an angry segment. And I was supposed to say I guess and Obama said it in his speech. He was talking about me that there are people that are angry. And rather than, oh, I'm not angry. I'm not. I am angry. I am angry. I'm angry at stupidity. I'm angry at incompetence. I'm angry when China's making $500 billion a year and sucking our jobs and sucking our money out of our country. And we don't do anything about it. I'm not angry at China. I'm angry at our politicians. I'm angry. I'm angry when people pour across the border and they are told let them come in. I'm angry when somebody has a baby and we're supposed to take care of the baby for 85 years because that baby happened to -- you know the anchor baby thing. I'm angry about a lot of things and I won't be angry for long because once we straighten it out I'm a very happy person, OK? Will you have more or less restrictions on the Internet regulations? Well, you have to be a little bit careful. But I'll tell you what I do favor. You know ISIS and these bad dudes are using the Internet better than we use it. And we're the ones that really came up with it, right? We invented the Internet. ISIS is using the Internet and they're radicalizing kids. They're taking kids and with the Internet that -- they're bringing people over. Number one, those people are never coming back. I don't care how they got there but they're never coming back. Right now they come back. We put them in. Eventually, they'll say what do we have to go over there and fight. Let's fight in the United States against us. But I am for absolutely, in some form, using the Internet to knock the hell out of ISIS and our enemies, OK? And some people would say, oh, freedom of speech. Forget it. This is people that cut off heads, OK? They cut off heads. As the expression goes, trust me. We'll do fine. We're going to do fine with the Internet. Yes, sir. Change topic a little bit with the -- why did my Social Security become useful right now? Well, it's true and Social Security is really being hit by some people where they want to cut it. And you've been paying in there for a long time, right? And when we bring back our jobs -- you know my tax policy where your taxes are going down by tremendous numbers. Both business and personal. We're the highest-taxed nation in the world and the taxes are going down, big league. And we're going to create an economy that's going to be vibrant again. And we're going to save our Social Security. And we're not going to do the cuts. I think I'm the only one that's talking about not cutting. And Mike Huckabee is also talking about it. But, but you know most of them are saying we're going to raise the age. We're going to do this. We're going to do a lot of cutting. Now, there's tremendous waste, fraud, and abuse that we can take care of, right? But we're not going to be cutting it. We're going to make our country strong again, rich again, and we're going to be able to afford it. Because you know that was a contract we entered into. People -- you've been paying for that. It's not like you're not paying. You're not getting it for nothing. So we're not going to be changing it, OK? Uh, yes, ma'am. How can you help students swimming in debt from college loans? It's such an -- I get that question more. I can't believe it took so many questions before I got it. The college debt. It's an incredible problem. What happens is they borrow money from the government, now the colleges sort of raise, raise, raise because the colleges see all this money. I'm telling you and I'm not even blaming. It's almost like a natural business instinct. So what happens is they have all these students they're, they're you know borrowing money. They get the money fairly easy but they had to pay it back. But the colleges now start all of a sudden raising, raising, raising. I'm going to look into it very seriously because you look at the way that's going up and what happens is they're basically getting money from the government to increase everything and the cost of the -- of running these colleges has gotten out of control. They've gone up so much proportionately. So we're going to be working on that very hard. We're going to be working on it. A lot of people ask me. I get so many questions from students. They -- and the biggest problem is you get out and we don't have a job because the jobs, you know, the jobs are all crummy jobs. I don't know if you saw the phony job report that came out the other day. So it's around five. But what they don't say is the jobs are bad. You know they're bad jobs. You look at all the part-time stuff and all but they're bad jobs. They're not good jobs because our good jobs are fleeing. And the other thing is people that look for a job, that give up looking, and you stop looking for the job. Now you go back -- they are statistically, they consider you employed because and I'll tell you something, when I have 35,000 people coming to a rally and 20 and all of these thousands and thousands of -- honestly, if there was a real 5% or 4% unemployment, I wouldn't have these crowds. There's a lot of -- there are people who want jobs. And the worst are the college kids. They come in, they work hard, they borrow money, they get out of college, they can't get a job. Are you going to be able to get a job? I hope so. Well, you better. If you don't you'll see my people, OK? If you don't -- you and Sean, OK? You and Sean are going to work for Trump. OK, Sean? Soon as he gets better he's going to be with me. OK. Question. Go ahead. OK. So there are things we can do. Number one, Department of Education. We're getting rid of Common Core. You know, we're getting, I mean this guy Jeb Bush is still on Common Core. You have -- how does anybody want Common Core. I've seen it, locally, we want local education, the parents, the people, you'll control it, less expensive much better. The bureaucrats in Washington, gone. We'll be able to cut -- EPA so bad, so bad what's happening there. You know they're making the farmers. I have friends that are farmers and these farmers in Iowa, in different places, but in Iowa, they're complaining. I mean they can't -- they can't take care of their land anymore. Everything they do is a big deal. Used to be a farm. Today it's like you got to read. You got to certify. You got to do all this stuff. They tell me things it's like a horror story. We're going to go back 15 years. We're going to go back so many years. So what happened is so incredible. So we'll take care of things and we will -- we have a lot of cutting to do. There's tremendous cutting to do. You know when you have budgets and you're dealing in trillions and if you put the right people in charge of these massive agencies and you say cut 5%, you know these people are talking about balancing budgets and 35 years from now. We can do it. Believe me, much quicker. We can do it. We can do it quickly, quickly but there's a lot of waste, fraud and abuse. Yes, sir. Go ahead. I think everybody's here because we feel like we need a hammer. You are the hammer. Two questions. Number one, why do we send any money to other countries when we're broke. Number two, are you going after the people who are politicians who are criminals like Obama and Hillary breaking the law everyday? Well, Hillary is going to have a problem. And don't forget if a new administration goes in that's a whole -- that's a very easy question. But Hillary does have -- I mean for the first time, she's under such -- look what she did is so wrong. What she did is so bad. I don't see how she makes it. You look at Petraeus. You look at other people. They did a tiny fraction of what she did and they've been destroyed. So I don't know how she makes it. I mean I don't know. I would love to run against her. I just don't know how she makes it into the starting gate with all that's going on. Now with that being said, the Democrats are protecting her or she wouldn't be as far as she is right now. But we'll see what happens. But the answer is absolutely. Uh, yes. Go ahead, sir. What are you going to do it when Congress gives you a 2000-page budget and overspending $800 million. That's -- But that's what I do. I know. That's what I do. We'll -- you get them in a room and you say do it. Obama doesn't get anybody in a room. He tried I think for a little while and it failed. And I won't go into it, OK? But he doesn't get it done. So he signs Executive Orders and then everybody sues and you're not supposed to be doing that. So we'll get it done. It's called get them in a room, right? Cajole, cajole. Let's go, folks. We've got to cut, right? OK. Yes, ma'am. Go ahead. At present what would you do to help alleviate the Federal Judicial Emergency? The Judicial Emergency meaning more judges? Yes. Ah well, that's easy. I hope he doesn't appoint too many actually because I'd rather appoint mine. You know we have some judges that are -- we -- well and one of them that was appointed by Bush, as you know, Justice Roberts, approved Obamacare twice. We could have had Obamacare knocked out twice and by every standard, what he did was wrong. And one of the other judges practically won't even speak to him again. It's very interesting. Whatever, what he did was wrong. And we have Obamacare. So I'd almost rather have not too many judges appointed. Let's wait. We can wait for another year. Let's appoint some really good judges. Yes, sir in the back. What are you going to do about Obamacare? Repeal it and replace it with something great. We are going to get rid of Obamacare. We'll even have to get rid of the $5 billion website that still doesn't work. Can you imagine that? A website costs $5 billion and to this day it's no good. I have kids, I have young kids, they do websites, like, they do -- I'm not saying websites like that but they're big complicated websites. They do it for peanuts. They do it. They sit. Bing, bing, bing, sir, we've just created another website. I got them all over the place. I got a website set they're pouring out of my ears. They cost nothing. $5 billion for website, for a website that doesn't work. OK. Go ahead. Go ahead. I want to know about did you mention mental health? Yeah. Mental health is a big thing because we're going to save the Second Amendment. The Second Amendment cannot be touched. And frankly, mental health is such a big thing because it is a mental health thing. Go ahead. You mentioned in your policy about Iowa, I know Iowa has big issues but I want to know if veterans will get help, individual disabilities will help? You know, I'm trying to really know. Are you a veteran? Are you a veteran? No, I'm not a veteran -- OK. It's good that you say that that is nice. Because the veterans need help with it and we are going to be investing big with the veterans also on mental health because the veterans are going through -- I'm telling you. I go to New Hampshire. I go to different places. The veterans are suffering in this country. And I actually think it's not a money thing. I think it's bureaucratic. I think it's theft and I think it's incompetence but because they throw the money, I mean the money, you know because the politicians are so afraid. But we have people that are very dishonest. If you look at what's going on Phoenix. I don't know if you guys have been seeing the Phoenix place. The Phoenix VA, it's a disaster. But there's a lot of corruption and there's a lot of incompetence, and we're going to take care of that with great management. I mean, we need great managers and we're going to take care of it. One of the things we're doing with the veterans you know, they have to wait a long period of time. Some of them wait for six, seven days in a waiting room to see a doctor. If they do, we're going to work out a system where they go and can go to the local hospital. They can go to the local doctors. They'll get taken care of. It's going to be much cheaper. You know many people die? Do you know many veterans are dying, waiting to go in, and see for a simple procedure or maybe even a pill, and they end up dying because they can't get to see a doctor. So we're going to let them go and see a doctor at a private hospital or a public hospital that's in the area who by the way aren't doing very well. They're not even doing well. And we're going to work a system for those people because the VA is not working. And we don't want people dying because they can't get to see -- there was one case where they waited six days after they got there, the doctor said we can't see you because we're going on vacation now. Think of it. Can you imagine yourselves? And most of you are not in that position, waiting in a reception room for four, five, six days to see a doctor for something maybe to get a prescription or get a pill or have a simple procedure. And people are dying there and they're veterans and we can't do that. So I mean, the veterans groups have been so great to me. The endorsements and everything else have been great but I'm going to be great to them. OK. Maybe we'll do two more. Yes, ma'am. Go ahead. You said that a ban on Muslims from areas Well, we have to be careful. Look there's something going on, the Muslims, and there's something going on, OK? There's something going on. We've got to figure out what it is. And I proposed that, yes, and on a temporary basis. But when you have the killings in California, you have all this stuff, your planes flying into the World Trade Center, you have the killings in Paris where they walk in and they just shoot all these innocent people, who by the way, Paris has the toughest gun laws probably in the world. You can't have a gun unless you're a crook, in which case you're a criminal, you can have a gun. You just walk in with a gun. But when you have the toughest gun laws and you have these people walk into these different places and just kill 130 people with more to follow because there's some that are so badly hurt. But we had a smaller version of that in California, 14 people. So the gun laws have to be taken care of in terms of we have to protect the Second Amendment. Think of this, if we had in Paris let's say or in California or on the military base where we have a military -- we have a gun-free zone and a military base that we have all -- we have these five guys that are great soldiers and a guy walks in and kills them. Because when you see a gun-free zone that means it's like candy to a maniac. You know to these whack jobs, right? And we have to call them that because that's what they are. We can't call them the leaders and the this. You know the way the press, these guys build them up so big, but they're like, they're like bad. The mastermind, right? In Paris, they called the mastermind. What's the mastermind? These are -- I call him the guy with the dirty hat. So what we're going to do is we're going to be smart. We're going to be vigilant. We have to watch. We have to see what's happening. So important. We have to see what's happening. And there's something going on. In California, they had pipe bombs, they had all sorts of stuff all over the apartment. People knew it. Nobody reported them. In other words, that was a disaster waiting to happen. People knew it was waiting to happen. Why didn't they call the local police? So there's something going on. We got to get to the bottom of it. And as far as -- as far as Syria is concerned, they're not coming in because we have no idea. We have no idea where these people came from, who they are. You look at the migration, and I have a bigger heart than anybody, but you look at this migration, and you don't see what do you? You don't see a lot of women. You don't see a lot of children. You see young, strong people. You say what's going on? That's the strangest looking migration. It looks like an army is marching and this could be the all-time great Trojan Horse. It's probably not but we can't take a chance. The people are totally undocumented. We have no idea. They say we're from Syria they could be from any place and there's no way of telling. They have no documents whatsoever. We have enough problems. Our country has enough problems. So that's it. Well, folks, I love you all. Get out and caucus. Go with Trump. You'll be very happy. And thank you very much. I love you. I love you. Thank you. You take care of yourself. Take care of yourself, OK? It's very cool. I bet he was a great boy. Thank you, man."}