{"id":478,"author":"Donald Trump","title":"Speech: Donald Trump in Cedar Falls, IA","date":"2016-01-12","link":"https://factba.se/transcript/donald-trump-speech-cedar-falls-ia-january-12-2016","paragraphs":["We love you. So many great wrestlers in here. I just met some fantastic looking people. They are tough cookies. They are tough cookies. How's your team doing? Your wrestling team doing, good? Huh? Good? Where are they? That's a rough looking group of it. I love it, we need more of that stuff. So you know what happens right?","You heard what happened. Iran took over two of our boats. They said they're gonna release them. Oh, isn't that nice? They're gonna release them. This isn't the same country when I hear that, just happened, just happened. It literally just happened and I think it's not so good, it's just -- it's just an indication of where the hell we're going.","I mean, hopefully they get released and fast but it seems to be an indication of where we're going that Iran deal is the dumbest deal I think I've ever seen. I don't think I've ever seen anything like it.","So you got to go out, buy Time Magazine, one of the few great stories, I mean, I love Time magazine can you believe it? So I was on about three times in the last couple of months but this one, this writer happens to be very talented, How Trump Won. Now, you know, let's hope. Hey, let's hope, right? 'Cause we're gonna turn it around we're gonna make our country great again.","It says now he just need the votes. We have the -- we have the people and essentially it's a story that talks about if the people that come to these rallies and even this one. You know I -- I have to tell you, so the fire marshals, te people came they said, \"Mr. Trump, we're putting them all over the place but the floor we don't want it to collapse.\"","Don't get scared. So they have to keep that section of the floor and they're sending away hundreds of people because they can't -- now would you rather take your chance and let the floor collapse? Yes, all right, let them come in. Well my first, you know, I'm very good at construction so my first question is, \"How deep is it?\" and it's only a well.","I said, \"How deep is it?\" They said it's a drop of three feet. I said, \"Three feet, I don't mind if it collapses OK?\" You know, three feet's a pipe chaser under there but anyway, we still don't want it to collapse. So we've had an amazing time and it's been an amazing journey for all of us.","People are turning out for what we're doing the quiet majority call it the noisy majority it's really not quiet, I was saying quiet majority and, you know, that's an old term that used to be used but the truth is this is a very very upset this is a very very angry in many respects majority. We're talking about a majority we have people in Dallas we had 20,000 people, Mobile Alabama 35,000, Oklahoma 20,000, wherever I go. In Iowa, you know, the crowds are always packed.","The only thing that holds as in is weak floors or walls that don't go out far enough and you know here and and in New Hampshire we're doing incredibly well in New Hampshire, South Carolina, everywhere we go.","We're gonna be in Pensacola very soon. In Pensacola we're gonna have 20,000 people, at least. In fact, the problem is the place holds 15 that's always a problem, right? But we have 20,000 people already signed up and it took about three days to do that. The Gravis poll just came out. I love to talk about polls.","You know I'm a poll maven. I became like the all-time expert on polls and people said, \"Why does he always talk about polls?\" But these are the people that are No. 12, No. 9. Even the other candidates one of them was No. 13. Why do you always talk about polls? I said, \"Because I'm not number 13.\"","I mean, if I were Jeb Bush, hey, true. If I were Jeb Bush I wouldn't be talking about polls. I don't talk about polls. I'd say let's talk about the weather. Is the weather good? I mean, think of it. He spent $69 million just to show you a waste of money. We could distribute that $69 million to these people in the room and do very well or give it to the wounded vets or give it to the -- you know, give it to the wounded warriors.","Give it to our great veterans. Give it to somebody that would -- $69 million and he's nowhere, not gonna happen, not gonna happen and it's sad actually or another truth, and I spent nothing in them at the top, is that good?","You know that's the way the country should be, our country should be that way. I mean, wouldn't it be nice, if you know, an education. We're ranked No. 29 or 28 in the world and yet with No. 1 in terms of spending common core, by the way, we're taking it out its gone. Ok, common core. We're gonna use local folks for that.","Second amendment while we're at it a hundred percent so that's up and common core is down. Second amendment, oh, we're gonna take care, we believe in the second -- you know, we had a couple of guns in Paris, if they had, or in Los Angeles or in California where, they had the the 14 people killed with these two radicalized horror shows and if the bullets were firing in two directions instead of one it would have been a whole different story folks, would have been a whole different story it's terrible, terrible.","We gotta get tough, we gotta get smart we got to get vigilant we got to know who the hell is coming into our country, OK. We got to get vigilant and when people see other people doing bad things like these two they had pipe bombs all over the floor of their apartment. People saw those bombs nobody calls the police, nobody tells, nobody wants to talk.","To me those are just as guilty as the people that did it and we gotta get smart 'cause a lot of people know what's going on. A lot of people know what's going on and the families know what going on. Every family. I'll tell you what. You don't think the wife or the husband talks? They talked, they talked and they know what's happening and when the World Trade Center came down you don't think that their families knew what was happening where those planes, where going?","And it's disgraceful, it's disgraceful.","We're gonna get things change around a lot in this country because right now right now we're a laughingstock, OK. So the Gravis poll came out, 41, 40 -- now think of it, 41%, 41%. What do they have 15 people when they took this. We're rapidly losing people. Sad isn't it? Nah. Is it sad we're losing people?","No, I don't think so. Forty-one percent for Trump, Cruz is second with the less than half, Rubio at 11 then NBC just came out 38, 38 that's a lot. I mean I'd almost take 41 and 42 if you had three people but we have like 14. Fox news came out just way, way ahead 35% in Fox news. Time magazine you're gonna go out to buy it. I put that down.","Pensacola, you're gonna watch on Florida to hell with that that's all I need from that sheet. Now, in Iowa, let's talk about Iowa, because I gotta win Iowa, OK? Look at that. Iowa, I love Iowa. We've really hit a note with evangelicals, we've hit a note with the Tea Party and with just a people of Iowa. I'm all over the place.","I like it, I love it. Maybe I'll just bo -- I think I'm gonna buy a farm and settle down over here, all right? No, I think I will. A medium-sized farm 'cause I don't know if I want to work that hard, right? But a nice farm it's -- it's an incredible place, Iowa. CNN, so CNN came out a little while ago. Thirty three for Trump, 20 for Chris, that's good.","Quinnipiac just came out yesterday 31% for Trump 29 for Chris, a little too close for comfort folks. PPP just came out, 28 for Trump 26 --","By the way, I hate to tell you Iowa, this is the only place that I'm like doing, let's say it's even. I'm not exactly thrilled. I go to New Hampshire we have this massive lead. They're all playing for second place, supposedly, I hope that turns out to be right because I don't care who's in the second place.","Then you go over to South Carolina next and I have a massive lead, you know, like I'm at 39 and somebody's at 11 and there you have some at one and two I think they have a long side. They want to get out fast because when you're 39 and somebody else is at one actually we have one 39 or somebody's at zero I would say they're wasting their time.","Don't we agree?","I would say, by the way, the fire marshall, I want to thank all the people because they're letting those people come back in and that's great instead of sending them home. That's really great. But this is a good wrestling arena. I guess that's what it is, right? Does Dan Gable did he -- I'll tell you. Is Dan Gable a good man, by the way?","Huh? I love Dan Gable. That guy was a serious wrestler. So with PPP were up with Mammoth, in New Hampshire we're at 32 to 18. NBC just came out in New Hampshire we're at 30 to 14, that's what I like better, Iowa, do you understand? That's New Hampshire, so come on Iowa will you get with it please?","I'm a little upset I won't buy that farm here I'll go someplace else. NBC News Iowa, Trump 26, Cruz 24, it's too close ,I don't like it, so we have to change it, OK? I cannot stand -- Here's something just came out. You know the nice thing about not using teleprompters like our president and -- and half of these politicians, and their other half, read their speeches they go like this, \"Ladies and gentlemen, thank you very much -- \" it's like -- and they're out of here in 15 minutes.","I'll speak to you for like an hour but we speak about current events like, as an example, the boats got captured now maybe by the time we get out we get them back but maybe not because the Iranians like to taunt us because they don't have like respect for our leaders, right? But this just came out, website, Trump website traffic, 2.5 million views per month, listen to this one, 1.6 billion requests, 1.6 billion.","Do you know what that is?","I didn't even know I said is that good or bad I think it's good, right ? The person that does this stuff the professional that reviews this, he said it's like unheard of, so there's a lot of good stuff coming out and it's sort of amazing. So with the polls, I want to win in Iowa. I want to really win. I don't want to come in second I want to win in Iowa.","Now, smart would be to say, \"I want to do well.\" that way if I come in second everyone's gonna say oh he did well I don't want to do that I want to win. Right? See she's saying yes, so I want to win now the press is good to say, \"Oh, isn't that crazy, he said he wants to win.\" I think we're gonna win, I think a lot of people are gonna come out that, you know, haven't been caucusing before and then haven't done it before, and I think a lot of people are gonna come out.","You know the theory is that they'll wait for five hours in a line -- hello, darling. Look at you. They wait for five hours in a line in the cold weather but they won't caucus, OK. I think they're gonna -- but let's see what happens. I mean, I hope they will because I want to have a mandate, I want to take back trade.","I want to do something we're losing billions and billions and billions of dollars a year with China with these ridiculous deals that were made by people that don't have a clue. I'm self-funding my campaign, I'm not having people give me checks for millions of dollars. These guys are all controlled, including Ted.","He's got millions of dollars from these three or four characters that I don't even know. I mean, they're wealthy guys, they give him millions of dollars. Do you think they're doing it for their health? I don't think so.","And by the way, Ted is totally against ethanol, please remember that. And I'm for ethanol, so I think it's an important fact. OK? So better remember that. I toured with your ethanol representatives and the industry. I toured some of the plants I think it's fantastic and anything we do to create fuel is good because we want to stay away from the Middle East.","We've learn that lesson the hard way, OK? So it's very important to develop for me a mandate. I want to mandate, I want to go in big, and if we went to Iowa, the reason I was important is that I honestly think if we were in Iowa, and you guys haven't picked a winner in a long time, I hate to tell you this, I don't want to be a wise guy.","You'll say, \"Get the hell out of this wrestling place.\" and then I'll have to take on your wrestling team. But if -- and your wrestling team likes Trump. Do you like Trump? OK I could see it. But -- but honestly, I wanna do -- I want to have a mandate. If we win Iowa I think we're gonna run the table. These guys don't know, they have no idea.","They didn't even think I was gonna run. The press is the most dishonest people I've ever seen in my life, they are disgusting. No, they're terrible. They're terrible. They're -- I mean, not all of them, 25% of them are fine, 10% are great but most of them are absolute the worst. I mean, they are so dishonest, they are so totally dishonest.","So it's one of those things. But if we win Iowa, I think we run the table, I really do. Because you go out to -- you go to New Hampshire, big lead.","You know, if you know Iowa when I was something up at but remember you haven't picked the winner and so long now, it's been so long, you need a winner. I'm gonna win, nobody else is gonna win. I'm gonna win. One of the things that just came out, CNBC did and other people are doing. If I run now, let's assume it's Hillary, even though she probably should be in prison in all fairness.","No, probably. Well I -- I dream -- I dream of running against Bernie, you know, ladies and gentlemen, my Bernie Sanders I'm gonna raise your taxes to 90%. Oh, really, you're gonna raise my taxes? I don't think so. No I love -- I would love to run against a socialist. I would love -- or communist, I don't know what he is.","He might be a communist, I think he's sort of tipped over the ledge. But -- but it'll be very interesting to see. You know those last emails that Hillary has is that have been that whole thing with her instructions about how to do it, let's hide it this way, I mean, that shows a level of sophistication that we weren't supposed to be seeing, folks.","So it'll be interesting to see what happens with Hillary but I think she's gonna be protected by the Democrats probably she's gonna run. Many, many people have been destroyed because of doing 5% of what she did. Their lives have been ruined, their lives have been destroyed. We'll have to see what happens but whether it's Hillary or Bernie or somebody else gets in I just look forward to winning here and winning and doing something spectacular because there's so much we can do.","I have the greatest businessman in the world lined up to take over like areas of trade, guys like Carl Icahn, who endorsed me, a great businessman and many others. And I say as an example, \"Carl, check out China 500 trade deficit, $500 billion. Check it out.\" he doesn't know about that stuff. You know, he doesn't know about losing that kind of money.","We rebuilt China. China, honestly, China has been one of the greatest thefts in the history of the world, what they've done to our country. Now with that being said, I love China, I love the people of China. Their leaders are just too smart for our leaders. Our -- our leaders are dummies, they don't know what they'll they're doing.","I love China. Now, I have people, they'd give me tens of millions of dollars for apartments. They just closed one the other day, what I am supposed to dislike, the Chinese? I like the Chinese. I like -- I love the Mexicans, and Mexicans, I have thousands -- I have tens of thousands of Hispanics over the years that have worked for me. Thousands of Mexicans, they're great.","The country is wonderful but they've taken advantage of us at the border and we will build the wall, by the way, and Mexico will pay for the wall. They will pay. So we're gonna build a wall, they've gonna pay for the wall. And the reason they're gonna pay, no politicians gonna get them to pay for the wall because a politician, all talk, no action.","They've even asked me, \"Now how can you possibly suggest that they pay?\" You know how? Because they make billions of dollars a year ripping us off, billions. Look at the deficit we have with Mexico. And the wall is peanuts by comparison you're not talking about that much money relatively speaking and we need a wall and we want people to come in but they have to come in legally.","They can come in to the country but they have to come in legally. They have to be vetted. So I'm running against different people and Ted's been nice to me and I've been nice to him but he's got a problem and you know he's got a problem and it's going to be very interesting to see what happens because natural-born citizen and you see here, articles all over the place","And this started not with me, just so you understand. This started, the Washington Post was interviewing me and they're asking me a lot of different questions on different things and then they said, \"What about Ted Cruz? Do you think he has -- Is he allowed to run for president? If he wins, is he allowed to do it?\" I said, \"I really don't know because he was born in Canada.","He was actually a citizen of Canada until 15 months ago, which a lot of people don't understand and that's a big problem. That's a real problem.\" And then Lawrence Tribe, who's the one of the top constitutional lawyers from Harvard. He wrote a big article saying that this is an unsettled area of the law, a very strong article right here and it's an unsettled area of the law then today the Washington Post comes out with a big story and Ted Cruz is not eligible to be President.","Now, I don't know. What do I know? But I can tell you this. The democrats are gonna bring a suit and you can't run unless you're going to be -- what -- How can you run like that? You don't even know, because a lot of people -- a lot of people think -- a lot of people think that it's going to be a very, very difficult thing to win their case.","We'll have to find out but -- and I'm doing it for the party, I'm doing it for the Ted. You go -- you go and you ask for declaratory judgment and you ask the court for a ruling and then you can run but you know you have to be careful. It would be terrible if you go down all the way down the line then you find out because of the fact that you were born in Canada.","You know a lot of people say that natural born means you have to be born to the land. And you know on the -- on the land, in this country, so we'll have to see, we're gonna have to see. But it is certainly a complicating factor and I -- I hope it works out. I mean, I -- I do. I wanna win and I think I'm gonna win it anyway but I want to win it very much on the merits and I don't want to win it on technicalities but that's more than a technicality, that is a big, big factor so we'll see what happens on that.","Just one other things, so we have a debate coming up. Has anybody -- Is anybody gonna watch it or are you gonna watch wrestling that night?","You have a wrestling match that night, fellas? Huh? Thursday night, you wrestling? I'd rather watch you wrestling, friend. But you know, the debates have been amazing and I've never debated before. I create jobs, I created a great, great company had a lot of success in everything I've done and I've a lot of fun and frankly, I didn't know about this, they even have polls on debates.","So they polled all of the debates and every single poll I've won but Hugh Drudge is a fantastic guy. Trump, last debate 46%. Time magazine. I like it now because they finally wrote a great about me, 49%. Slate, 51%. U.S. News and World Reports, 69%, said I won. No, think of it. I mean, I don't know them.","I don't own it. PBS, Public Broadcasting, 69%. Here. See the small name up there?","Sixty-nine percent. All of these things. Washington Times, 62%. CBS Philadelphia, 59%. These are people calling in. Fox News, 50 -- 62%. These are people calling in, \"Who won the debate?\" and I think it's fantastic. I mean, they say now we have another one coming up and I enjoy it. I mean, I didn't know if I was gonna like to debate but I enjoy it and all I'm doing is trying to get idea across that we have to be strong we have to be powerful we have to rebuild our military and hopefully never use it. You know its like these guys, if the stronger, the tougher you, the better you are, people aren't gonna be picking on you the same way, right?","We're like, right now, we're being picked on. We're big picked on.","General Oriana just left and he said that the readiness of the army is the worst that it's been that he's ever seen and the worst that most people have seen for many, many generations. I mean, we have to have the strongest this has to be the strongest now. And you don't think the enemy hears him say. I -- frankly, he shouldn't even be saying it, you know, he's leaving but I wish you wouldn't say a statement like that.","How come our generals are always on television? They're always on television talking to these people. Their own -- I don't want our generals on television. I want our generals to be like generals. Do you think that George Patton did sit down with anchors and said, \"Here's the way we're gonna do the war. \"We're gonna attack from behind and then we're gonna do -- \". This is crazy.","I promise you my generals will never be on television, OK.","So they're not gonna be. What's a little like Obama. Obama should have never been in Iraq and I came out in 2003, 2004 said don't go in Iraq, and I'm the most militaristic person this room. I said, \"Don't go into Iraq because you're gonna destabilize because Iran and Iraq would fight.\" It's like two guys, fight, fight, fight.","They were equal military and they'd go ten feet this way, ten feet that way, ten feet then they rest. Then Saddam Hussein were dropped some gas and everybody would complain and that and they go back and forth and they go back. After years, you know, they take two years of rest then they start fighting again.","What the hell are we doing? And I said, \"If you knock out one or the other of those two powers, which were capable of doing quickly, if you knock it out the other ones gonna take over.\"","In this case, we knockout Iraq, big mistake, we destabilize the entire Middle East. But now Obama has it and instead of staying there with a small force he said we're leaving and we're leaving on a certain date and he gave the date and he said exactly why we're leaving. So now the enemy, I couldn't believe it. I would say you know I'm a strategist I'm the one that wrote Osama bin Laden in my book before the World Trade Center came down.","Everyone said how did you know that, because I saw him, I was watching him and reading about him making horrible statements about us.","And I said to myself, I hope we're gonna take this guy out. We didn't take him out and actually, Bill Clinton had their sights on him and for some reason they didn't pull the trigger. If they pulled the trigger you'd probably have the World Trade Center the way it used to be, OK. And by the way, most importantly, with all the thousands of lives that have been lost and affected so gravely.","So we have to be smart. And here's what I just read, and I read this and I somehow related it and it was sort of an amazing thing and I'm gonna read it to you. Al Wilson, the late great. Does anyone know Al Wilson? Singer. He wrote this little thing about the snake, right, the snake.","So we have a little situation that could be a Trojan horse. You looked at what's happening in Germany, in Cologne, Cologne have had a problem, Cologne, Germany, OK? Everything's fine, everything's nice, clean, beautiful, no problem. Now they're having riots, they're having rapes, they're having -- they never -- The New Years Eve has -- Have you heard about the New Year's Eve?","It was like a disaster. And the German people are gonna riot, the German people are gonna end up overthrowing this woman. I don't know what the hell she's thinking but they have millions of people pouring into Germany and now they're not stopping them. Now I guess, they're gonna have to stop because the German people aren't gonna put up. And we want to have a cor -- Our leaders wanna have -- I don't think you want to have, people coming in from the migration from Syria.","And when you look at that migration, it's very unusual. When I look at it I say I see so many men and they're young. They look like they should be on the wrestling team and they're young and they're strong and you don't see that many women, you don't see that many children, sort of a weird deal. It's the migration but you see all these young, strong people and they're mostly men and I say, \"What's going on?\" I noticed that in all fairness.","this is like old news now. I noticed that three four months ago, you know, when it all started and I said, \"What's going on?\" And who knows what it is. You know the famous Trojan horse, I mean, it's this a Trojan horse? And I doubt it but it could very well be and they don't have paperwork they have no documentation whatsoever.","They have no documentation and then we're bringing them into this country. We don't know who they are and you look at what happens in California, and you look at some of the things that happen -- including, by the way, flying airplanes into the World Trade Center. Why are we doing this? Build a safe zone in Syria, get the Gulf states, who have a tremendous amount of money.","I mean, Saudi Arabia was making a billion dollars a day before the Euro went down so now they're making half, OK. They're making a lot. Get them to pay. They're not paying, the other ones aren't paying. We're paying we always pay. We're the sucker, we're the sucker.","We're like the stupid sucker. We're not gonna pay anymore for all this stuff and anybody that comes in, if I win, they're going back out. We're gonna do it. You're mainly and everything but they're going back out. We don't know where they are we don't know who they are, where they come from. And we already had some.","You saw the couple that came in from Iraq, where they were already planning different things. One in California, one in Houston, I believe, and they're planning things now. We don't need it, we had enough problems, folks. We got enough problems. We got enough problems. So I -- I read this the other day and I said, \"Wow, that's really amazing.","That's really incredible.\"","And it's -- the snake lyric: On her way to work one morning. Down the path along the lake. A tender hearted woman saw a poor half frozen snake. Interesting. His pretty colored skin had been all frosted with the dew. \" Oh, well.\" she cried, \"I'll take you in and I'll take care of you\". \"Take me in, tender woman.","Take me in, for heaven's sake. Take me in, tender woman, \" sighed the vicious snake","She wrapped him up all cozy in a comforter of silk. And laid him by her fireside with some honey and some milk. Now she hurried home from work and that night and soon as she arrived, she found that pretty snake she'd taken to and revived. \"Take me in, tender woman. Take me in, for heaven's sake. Take me in, oh tender woman, \" sighed the vicious snake.","Now she clutched him to her bosom, \"You're so beautiful, \" she cried. \"But if I hadn't brought you in, by now you might have died\" She stroked his pretty skin again and kissed and held him tight but instead of saying thanks, the snake gave her a vicious bite. \"Take me in, tender woman. Take me in, for heaven's sake. Take me in, oh tender woman, \" sighed the vicious snake.","I saved you, cried the woman. \"And you've bit me, heavens, why? You know your bite is poisonous and now I'm going to die\" \"Oh shut up, silly woman, \" said the reptile with a grin \"You knew damn well I was a snake before you took me in. Does that makes sense to anybody? Does that make any sense? Does that make sense, I mean, you know, and hopefully that's not gonna be the case but it's pretty.","I read it and I just sort of put it together. We have no idea what we're doing. We have no idea who we're taking in, and we better be careful. OK. So, here's the story.","We're not winning anymore We don't win a trade we don't win a war we can't beat ISIS we can't beat anybody. We don't win. A boat's take -- taken a little while ago, right? I mean, you know, again I imagine they're giving them back. I mean, we just gave them a hundred and fifty billion dollars. They'll probably say, \"How much you gonna give us if we give you back?\" I guess there are like ten sailors or more but that's the way we do it. We give $150 billion we got nothing, we got nothing.","They still have our prisoners. Instead of saying we want our prisoners before we start negotiating and double up the sanctions you would have the prisoners in about two minutes but we don't do that because we're led by people that don't have a clue.","We're led by people that don't have a clue and we don't have victories anymore, we don't have victories anymore. When did you see us having when did we beat China in trade? When do we beat Japan in trade? When do we beat ISIS? You ever hear a good story? We are winning with ISIS. We are winning. You don't hear that.","We don't win. We don't win. We don't win ever. What was the last time we had a victory? We don't have victories anymore. We lose on trade, we lose on healthcare. Obamacare is a disaster. We lose on every single aspect of our life with these politicians","Other countries have people that are much smarter and much more sophisticated and frankly, it's a word that's an important word. They're much cunning than our politicians. You look at Mexico, what they're doing on the border and you don't think they're sending people over. What do we have to take care of them for?","Let the stupid United States, they call us stupid. OK? Kate gets killed shot in the back in San Francisco. Man was over here five times. Who do you think send her back? You think he just kept coming back for herself? He came back. Probably that in one. I don't know, maybe not, maybe. But what do they want to happen in jail for the rest of his life for take care and we'll send them to the United States.","Jamiel this wonderful young man, the father's a friend of mine.","Jamil Shaw, just an amazing guy, the father's an amazing guy. His son shot in the face as he's walking into his house. Loved his father and father loved the family, loved this kid beyond. I mean, they can never be -- they can never ever come back from that. It's vicious. Shot right in the face purposely.Stood there, boom, boom, boom, three bullets.","And the father heard the sound then he said, \"Oh, my god.\" 'Cause he just spoke to his son he said, \"I'll be home right away.\" and he heard the bullets right outside the house. And the woman killed recently. A veteran, 65 year old veteran. Raped, sodomized, and killed by an illegal immigrant. And we treat illegal immigrants better than we treat our vets, remember that.","Our vets are not treated properly. Our vest are our greatest people. Our wounded warriors and our vets and we don't even treat them well but the illegal immigrants you see what's going on. I mean, in California they want to take over the City Council. They want to now run for office. They were illegal immigrants.","I don't know what the hell's gonna happen but the concept of it even. I mean, what's going on is absolutely insane and we're gonna change it so we don't want anymore but we're going to start winning and we're gonna start winning big league. We're gonna make our country rich again. A woman came up to me I said that recently in a big rally I'm still gonna make our country rich again.","She said, \"Mr. Trump, I'm such a fan of yours, I'm voting for you. It doesn't matter but that doesn't sound nice when you say would make us rich again.\"","I said, \"You know, ma'am, we owe $19 trillion. We just made one of the dumbest budget deals that I've ever seen. I don't even know. Do the Republicans have anybody negotiating? OK, you know what I'm talking about two weeks ago. I mean, Obama got everything. You know Obama is a lousy negotiator except when it comes to negotiating with the Republicans, right?","He's a good negotiator with the Republicans every country kicks our ass but with the Republicans he's like a great negotiation. It's so -- \"Oh, it won't happen. Well in my case there won't be Obama we can do it right from the top.\"","Because it all starts, remember this, it all starts from the top down. It all starts from the top down. So so we're going to have a country that you're gonna be so proud of. I mean, there are so many different things. When you look at those phony employment numbers where they say we're down to 5.2 and 5.3 and 5.1, it's all nonsense.","If you're looking for a job and you give up because you can't find one statistically, you are you're considered employed. We have millions and millions of people out there that want jobs the other thing about the recent numbers phony numbers, who is put that was developed that system for the benefit of politicians to make them look better because it bears no relationship to the fact.","Do you think I'd have this crowd and do you think I'd had this kind of support and be getting 42 and 45 and 39, and all these high percentages against all of these people if things were good. And frankly, I wish things were good 'cause I love my life. I mean, I love company, I love my family. I don't need to do this.","This is a hard thing. You know I'm going all over. I love Iowa but, you know, I could be home watching something tonight, right? I won't be watching the speech, but these are minor details, won't watching the press -- Actually, I probably will. No, I probably will. Probably. We gotta watch, you gotta watch.","You got to see what the hell's going on because he doesn't know so somebody has to.","So if you look at an example, radical Islamic terrorism, we have a president that refuses to say the words and I don't know. Is he stubborn? What's the -- what's wrong? When people kill people and they they announce that that's what they're doing it for and it goes on and on and on and it's run or not us all over the world and at some point you would think that he would say, \"OK, we have a problem let's -- let's get to the bottom of it.\" And you can't get to the bottom of a problem unless you are willing to address the problem and he is not willing to address the problem.","And he's never gonna get there and we'll address the problem and I have friends I have muslim friends or incredible people.","And I'll tell you what, a couple of a very, very high level. Very rich, very good people, even though they're rich, but very, very good people. And some that are rich and they've said to me, \"You've done a tremendous service by doing this because we do have a problem. This tremendous hatred for whatever reason.\" I mean when you see somebody willing to walk into a room and start shooting -- now of course, you know, they always walk into rooms where there are no guns, you ever notice that?","Like the military base, they walk in gun-free zone on a military base. We have five great soldiers one of whom is a world-class expert on marksmanship, one of the great shots, one of the great marksman. They've told to put down their guns a hundred yards away it's a gun-free zone.","Now when a sicko here's gun-free zone, when there's sick people here gun -- that's like candy. That's like I want a piece of apple pie. They walk in. We have five unbelievable brave great soldiers that are dead now because they look for gun-free zones. So we have to be careful with it. We have to be careful.","Now these guys had the guns. Number one, they wouldn't have been there, he wouldn't have been there. Number two, if he was he was going to get blown away, which would have been fine. The other thing I tell the press all the time I mean they make people like, you know, they make them like -- they make them -- they glamorize it. They call this thug in Paris, the mastermind did you hear him all say?","The mastermind.","That's the master -- he's a guy with a very low IQ, I guarantee. I call him the guy with the dirty hat because he had this horrible disgusting filthy hat on and I said to the press and they don't use the term anymore. I think if I did one thing they're not use -- because our children are being radicalized in many cases by Isis and others.","They're using the internet better than us and we're the ones that invented it and they're rattled, I mean, they're talking kids and they're fighting for Isis and then we allow people back. How about this? They go, they fight for Isis and then we let them come back and somebody said well there's no law that allows us to keep them.","Are you crazy? Are you crazy? So they fight for us.","Someday they won't go,they'll just fight here. They don't want to go. Why should they go over to Syria? Why should they go over to Iraq and fight when they can stay right here and fight? So why do we allow people? We know they're Isis and we they come right in and we let him come back, it's insane. So I just want to tell you that it's a special place, I love Iowa, we're gonna do so great.","We're gonna win and we're gonna start winning. We're gonna win so much that you people are gonna get sick and tired of winning you are gonna say, \"Please, I can't take it anymore. I can't take it anymore, no.\"","We're gonna win with the military and we're gonna win with healthcare, and we're gonna win against all these countries that have been ripping us off for years. We're gonna win with FED. We're gonna have the smartest people. Right now we have political hacks, they're political hacks then nothing. I know a lot of these guys they can't find their way through their own front door, they're political hacks and they got the jobs because they gave campaign contributions to these politicians that I'm running against, including and I'm talking on both sides.","So we're gonna start winning. It's gonna be a beautiful thing to see. We're gonna make America great again. You're gonna be so proud of this country and you're gonna be so proud of your president and I love you. I love you all. I want to thank you. I love you all. Thank you. thank you very much. Thank you.","Thank you. Thank you, everybody."],"text":" We love you. So many great wrestlers in here. I just met some fantastic looking people. They are tough cookies. They are tough cookies. How's your team doing? Your wrestling team doing, good? Huh? Good? Where are they? That's a rough looking group of it. I love it, we need more of that stuff. So you know what happens right? You heard what happened. Iran took over two of our boats. They said they're gonna release them. Oh, isn't that nice? They're gonna release them. This isn't the same country when I hear that, just happened, just happened. It literally just happened and I think it's not so good, it's just -- it's just an indication of where the hell we're going. I mean, hopefully they get released and fast but it seems to be an indication of where we're going that Iran deal is the dumbest deal I think I've ever seen. I don't think I've ever seen anything like it. So you got to go out, buy Time Magazine, one of the few great stories, I mean, I love Time magazine can you believe it? So I was on about three times in the last couple of months but this one, this writer happens to be very talented, How Trump Won. Now, you know, let's hope. Hey, let's hope, right? 'Cause we're gonna turn it around we're gonna make our country great again. It says now he just need the votes. We have the -- we have the people and essentially it's a story that talks about if the people that come to these rallies and even this one. You know I -- I have to tell you, so the fire marshals, te people came they said, \"Mr. Trump, we're putting them all over the place but the floor we don't want it to collapse.\" Don't get scared. So they have to keep that section of the floor and they're sending away hundreds of people because they can't -- now would you rather take your chance and let the floor collapse? Yes, all right, let them come in. Well my first, you know, I'm very good at construction so my first question is, \"How deep is it?\" and it's only a well. I said, \"How deep is it?\" They said it's a drop of three feet. I said, \"Three feet, I don't mind if it collapses OK?\" You know, three feet's a pipe chaser under there but anyway, we still don't want it to collapse. So we've had an amazing time and it's been an amazing journey for all of us. People are turning out for what we're doing the quiet majority call it the noisy majority it's really not quiet, I was saying quiet majority and, you know, that's an old term that used to be used but the truth is this is a very very upset this is a very very angry in many respects majority. We're talking about a majority we have people in Dallas we had 20,000 people, Mobile Alabama 35,000, Oklahoma 20,000, wherever I go. In Iowa, you know, the crowds are always packed. The only thing that holds as in is weak floors or walls that don't go out far enough and you know here and and in New Hampshire we're doing incredibly well in New Hampshire, South Carolina, everywhere we go. We're gonna be in Pensacola very soon. In Pensacola we're gonna have 20,000 people, at least. In fact, the problem is the place holds 15 that's always a problem, right? But we have 20,000 people already signed up and it took about three days to do that. The Gravis poll just came out. I love to talk about polls. You know I'm a poll maven. I became like the all-time expert on polls and people said, \"Why does he always talk about polls?\" But these are the people that are No. 12, No. 9. Even the other candidates one of them was No. 13. Why do you always talk about polls? I said, \"Because I'm not number 13.\" I mean, if I were Jeb Bush, hey, true. If I were Jeb Bush I wouldn't be talking about polls. I don't talk about polls. I'd say let's talk about the weather. Is the weather good? I mean, think of it. He spent $69 million just to show you a waste of money. We could distribute that $69 million to these people in the room and do very well or give it to the wounded vets or give it to the -- you know, give it to the wounded warriors. Give it to our great veterans. Give it to somebody that would -- $69 million and he's nowhere, not gonna happen, not gonna happen and it's sad actually or another truth, and I spent nothing in them at the top, is that good? You know that's the way the country should be, our country should be that way. I mean, wouldn't it be nice, if you know, an education. We're ranked No. 29 or 28 in the world and yet with No. 1 in terms of spending common core, by the way, we're taking it out its gone. Ok, common core. We're gonna use local folks for that. Second amendment while we're at it a hundred percent so that's up and common core is down. Second amendment, oh, we're gonna take care, we believe in the second -- you know, we had a couple of guns in Paris, if they had, or in Los Angeles or in California where, they had the the 14 people killed with these two radicalized horror shows and if the bullets were firing in two directions instead of one it would have been a whole different story folks, would have been a whole different story it's terrible, terrible. We gotta get tough, we gotta get smart we got to get vigilant we got to know who the hell is coming into our country, OK. We got to get vigilant and when people see other people doing bad things like these two they had pipe bombs all over the floor of their apartment. People saw those bombs nobody calls the police, nobody tells, nobody wants to talk. To me those are just as guilty as the people that did it and we gotta get smart 'cause a lot of people know what's going on. A lot of people know what's going on and the families know what going on. Every family. I'll tell you what. You don't think the wife or the husband talks? They talked, they talked and they know what's happening and when the World Trade Center came down you don't think that their families knew what was happening where those planes, where going? And it's disgraceful, it's disgraceful. We're gonna get things change around a lot in this country because right now right now we're a laughingstock, OK. So the Gravis poll came out, 41, 40 -- now think of it, 41%, 41%. What do they have 15 people when they took this. We're rapidly losing people. Sad isn't it? Nah. Is it sad we're losing people? No, I don't think so. Forty-one percent for Trump, Cruz is second with the less than half, Rubio at 11 then NBC just came out 38, 38 that's a lot. I mean I'd almost take 41 and 42 if you had three people but we have like 14. Fox news came out just way, way ahead 35% in Fox news. Time magazine you're gonna go out to buy it. I put that down. Pensacola, you're gonna watch on Florida to hell with that that's all I need from that sheet. Now, in Iowa, let's talk about Iowa, because I gotta win Iowa, OK? Look at that. Iowa, I love Iowa. We've really hit a note with evangelicals, we've hit a note with the Tea Party and with just a people of Iowa. I'm all over the place. I like it, I love it. Maybe I'll just bo -- I think I'm gonna buy a farm and settle down over here, all right? No, I think I will. A medium-sized farm 'cause I don't know if I want to work that hard, right? But a nice farm it's -- it's an incredible place, Iowa. CNN, so CNN came out a little while ago. Thirty three for Trump, 20 for Chris, that's good. Quinnipiac just came out yesterday 31% for Trump 29 for Chris, a little too close for comfort folks. PPP just came out, 28 for Trump 26 -- By the way, I hate to tell you Iowa, this is the only place that I'm like doing, let's say it's even. I'm not exactly thrilled. I go to New Hampshire we have this massive lead. They're all playing for second place, supposedly, I hope that turns out to be right because I don't care who's in the second place. Then you go over to South Carolina next and I have a massive lead, you know, like I'm at 39 and somebody's at 11 and there you have some at one and two I think they have a long side. They want to get out fast because when you're 39 and somebody else is at one actually we have one 39 or somebody's at zero I would say they're wasting their time. Don't we agree? I would say, by the way, the fire marshall, I want to thank all the people because they're letting those people come back in and that's great instead of sending them home. That's really great. But this is a good wrestling arena. I guess that's what it is, right? Does Dan Gable did he -- I'll tell you. Is Dan Gable a good man, by the way? Huh? I love Dan Gable. That guy was a serious wrestler. So with PPP were up with Mammoth, in New Hampshire we're at 32 to 18. NBC just came out in New Hampshire we're at 30 to 14, that's what I like better, Iowa, do you understand? That's New Hampshire, so come on Iowa will you get with it please? I'm a little upset I won't buy that farm here I'll go someplace else. NBC News Iowa, Trump 26, Cruz 24, it's too close ,I don't like it, so we have to change it, OK? I cannot stand -- Here's something just came out. You know the nice thing about not using teleprompters like our president and -- and half of these politicians, and their other half, read their speeches they go like this, \"Ladies and gentlemen, thank you very much -- \" it's like -- and they're out of here in 15 minutes. I'll speak to you for like an hour but we speak about current events like, as an example, the boats got captured now maybe by the time we get out we get them back but maybe not because the Iranians like to taunt us because they don't have like respect for our leaders, right? But this just came out, website, Trump website traffic, 2.5 million views per month, listen to this one, 1.6 billion requests, 1.6 billion. Do you know what that is? I didn't even know I said is that good or bad I think it's good, right ? The person that does this stuff the professional that reviews this, he said it's like unheard of, so there's a lot of good stuff coming out and it's sort of amazing. So with the polls, I want to win in Iowa. I want to really win. I don't want to come in second I want to win in Iowa. Now, smart would be to say, \"I want to do well.\" that way if I come in second everyone's gonna say oh he did well I don't want to do that I want to win. Right? See she's saying yes, so I want to win now the press is good to say, \"Oh, isn't that crazy, he said he wants to win.\" I think we're gonna win, I think a lot of people are gonna come out that, you know, haven't been caucusing before and then haven't done it before, and I think a lot of people are gonna come out. You know the theory is that they'll wait for five hours in a line -- hello, darling. Look at you. They wait for five hours in a line in the cold weather but they won't caucus, OK. I think they're gonna -- but let's see what happens. I mean, I hope they will because I want to have a mandate, I want to take back trade. I want to do something we're losing billions and billions and billions of dollars a year with China with these ridiculous deals that were made by people that don't have a clue. I'm self-funding my campaign, I'm not having people give me checks for millions of dollars. These guys are all controlled, including Ted. He's got millions of dollars from these three or four characters that I don't even know. I mean, they're wealthy guys, they give him millions of dollars. Do you think they're doing it for their health? I don't think so. And by the way, Ted is totally against ethanol, please remember that. And I'm for ethanol, so I think it's an important fact. OK? So better remember that. I toured with your ethanol representatives and the industry. I toured some of the plants I think it's fantastic and anything we do to create fuel is good because we want to stay away from the Middle East. We've learn that lesson the hard way, OK? So it's very important to develop for me a mandate. I want to mandate, I want to go in big, and if we went to Iowa, the reason I was important is that I honestly think if we were in Iowa, and you guys haven't picked a winner in a long time, I hate to tell you this, I don't want to be a wise guy. You'll say, \"Get the hell out of this wrestling place.\" and then I'll have to take on your wrestling team. But if -- and your wrestling team likes Trump. Do you like Trump? OK I could see it. But -- but honestly, I wanna do -- I want to have a mandate. If we win Iowa I think we're gonna run the table. These guys don't know, they have no idea. They didn't even think I was gonna run. The press is the most dishonest people I've ever seen in my life, they are disgusting. No, they're terrible. They're terrible. They're -- I mean, not all of them, 25% of them are fine, 10% are great but most of them are absolute the worst. I mean, they are so dishonest, they are so totally dishonest. So it's one of those things. But if we win Iowa, I think we run the table, I really do. Because you go out to -- you go to New Hampshire, big lead. You know, if you know Iowa when I was something up at but remember you haven't picked the winner and so long now, it's been so long, you need a winner. I'm gonna win, nobody else is gonna win. I'm gonna win. One of the things that just came out, CNBC did and other people are doing. If I run now, let's assume it's Hillary, even though she probably should be in prison in all fairness. No, probably. Well I -- I dream -- I dream of running against Bernie, you know, ladies and gentlemen, my Bernie Sanders I'm gonna raise your taxes to 90%. Oh, really, you're gonna raise my taxes? I don't think so. No I love -- I would love to run against a socialist. I would love -- or communist, I don't know what he is. He might be a communist, I think he's sort of tipped over the ledge. But -- but it'll be very interesting to see. You know those last emails that Hillary has is that have been that whole thing with her instructions about how to do it, let's hide it this way, I mean, that shows a level of sophistication that we weren't supposed to be seeing, folks. So it'll be interesting to see what happens with Hillary but I think she's gonna be protected by the Democrats probably she's gonna run. Many, many people have been destroyed because of doing 5% of what she did. Their lives have been ruined, their lives have been destroyed. We'll have to see what happens but whether it's Hillary or Bernie or somebody else gets in I just look forward to winning here and winning and doing something spectacular because there's so much we can do. I have the greatest businessman in the world lined up to take over like areas of trade, guys like Carl Icahn, who endorsed me, a great businessman and many others. And I say as an example, \"Carl, check out China 500 trade deficit, $500 billion. Check it out.\" he doesn't know about that stuff. You know, he doesn't know about losing that kind of money. We rebuilt China. China, honestly, China has been one of the greatest thefts in the history of the world, what they've done to our country. Now with that being said, I love China, I love the people of China. Their leaders are just too smart for our leaders. Our -- our leaders are dummies, they don't know what they'll they're doing. I love China. Now, I have people, they'd give me tens of millions of dollars for apartments. They just closed one the other day, what I am supposed to dislike, the Chinese? I like the Chinese. I like -- I love the Mexicans, and Mexicans, I have thousands -- I have tens of thousands of Hispanics over the years that have worked for me. Thousands of Mexicans, they're great. The country is wonderful but they've taken advantage of us at the border and we will build the wall, by the way, and Mexico will pay for the wall. They will pay. So we're gonna build a wall, they've gonna pay for the wall. And the reason they're gonna pay, no politicians gonna get them to pay for the wall because a politician, all talk, no action. They've even asked me, \"Now how can you possibly suggest that they pay?\" You know how? Because they make billions of dollars a year ripping us off, billions. Look at the deficit we have with Mexico. And the wall is peanuts by comparison you're not talking about that much money relatively speaking and we need a wall and we want people to come in but they have to come in legally. They can come in to the country but they have to come in legally. They have to be vetted. So I'm running against different people and Ted's been nice to me and I've been nice to him but he's got a problem and you know he's got a problem and it's going to be very interesting to see what happens because natural-born citizen and you see here, articles all over the place And this started not with me, just so you understand. This started, the Washington Post was interviewing me and they're asking me a lot of different questions on different things and then they said, \"What about Ted Cruz? Do you think he has -- Is he allowed to run for president? If he wins, is he allowed to do it?\" I said, \"I really don't know because he was born in Canada. He was actually a citizen of Canada until 15 months ago, which a lot of people don't understand and that's a big problem. That's a real problem.\" And then Lawrence Tribe, who's the one of the top constitutional lawyers from Harvard. He wrote a big article saying that this is an unsettled area of the law, a very strong article right here and it's an unsettled area of the law then today the Washington Post comes out with a big story and Ted Cruz is not eligible to be President. Now, I don't know. What do I know? But I can tell you this. The democrats are gonna bring a suit and you can't run unless you're going to be -- what -- How can you run like that? You don't even know, because a lot of people -- a lot of people think -- a lot of people think that it's going to be a very, very difficult thing to win their case. We'll have to find out but -- and I'm doing it for the party, I'm doing it for the Ted. You go -- you go and you ask for declaratory judgment and you ask the court for a ruling and then you can run but you know you have to be careful. It would be terrible if you go down all the way down the line then you find out because of the fact that you were born in Canada. You know a lot of people say that natural born means you have to be born to the land. And you know on the -- on the land, in this country, so we'll have to see, we're gonna have to see. But it is certainly a complicating factor and I -- I hope it works out. I mean, I -- I do. I wanna win and I think I'm gonna win it anyway but I want to win it very much on the merits and I don't want to win it on technicalities but that's more than a technicality, that is a big, big factor so we'll see what happens on that. Just one other things, so we have a debate coming up. Has anybody -- Is anybody gonna watch it or are you gonna watch wrestling that night? You have a wrestling match that night, fellas? Huh? Thursday night, you wrestling? I'd rather watch you wrestling, friend. But you know, the debates have been amazing and I've never debated before. I create jobs, I created a great, great company had a lot of success in everything I've done and I've a lot of fun and frankly, I didn't know about this, they even have polls on debates. So they polled all of the debates and every single poll I've won but Hugh Drudge is a fantastic guy. Trump, last debate 46%. Time magazine. I like it now because they finally wrote a great about me, 49%. Slate, 51%. U.S. News and World Reports, 69%, said I won. No, think of it. I mean, I don't know them. I don't own it. PBS, Public Broadcasting, 69%. Here. See the small name up there? Sixty-nine percent. All of these things. Washington Times, 62%. CBS Philadelphia, 59%. These are people calling in. Fox News, 50 -- 62%. These are people calling in, \"Who won the debate?\" and I think it's fantastic. I mean, they say now we have another one coming up and I enjoy it. I mean, I didn't know if I was gonna like to debate but I enjoy it and all I'm doing is trying to get idea across that we have to be strong we have to be powerful we have to rebuild our military and hopefully never use it. You know its like these guys, if the stronger, the tougher you, the better you are, people aren't gonna be picking on you the same way, right? We're like, right now, we're being picked on. We're big picked on. General Oriana just left and he said that the readiness of the army is the worst that it's been that he's ever seen and the worst that most people have seen for many, many generations. I mean, we have to have the strongest this has to be the strongest now. And you don't think the enemy hears him say. I -- frankly, he shouldn't even be saying it, you know, he's leaving but I wish you wouldn't say a statement like that. How come our generals are always on television? They're always on television talking to these people. Their own -- I don't want our generals on television. I want our generals to be like generals. Do you think that George Patton did sit down with anchors and said, \"Here's the way we're gonna do the war. \"We're gonna attack from behind and then we're gonna do -- \". This is crazy. I promise you my generals will never be on television, OK. So they're not gonna be. What's a little like Obama. Obama should have never been in Iraq and I came out in 2003, 2004 said don't go in Iraq, and I'm the most militaristic person this room. I said, \"Don't go into Iraq because you're gonna destabilize because Iran and Iraq would fight.\" It's like two guys, fight, fight, fight. They were equal military and they'd go ten feet this way, ten feet that way, ten feet then they rest. Then Saddam Hussein were dropped some gas and everybody would complain and that and they go back and forth and they go back. After years, you know, they take two years of rest then they start fighting again. What the hell are we doing? And I said, \"If you knock out one or the other of those two powers, which were capable of doing quickly, if you knock it out the other ones gonna take over.\" In this case, we knockout Iraq, big mistake, we destabilize the entire Middle East. But now Obama has it and instead of staying there with a small force he said we're leaving and we're leaving on a certain date and he gave the date and he said exactly why we're leaving. So now the enemy, I couldn't believe it. I would say you know I'm a strategist I'm the one that wrote Osama bin Laden in my book before the World Trade Center came down. Everyone said how did you know that, because I saw him, I was watching him and reading about him making horrible statements about us. And I said to myself, I hope we're gonna take this guy out. We didn't take him out and actually, Bill Clinton had their sights on him and for some reason they didn't pull the trigger. If they pulled the trigger you'd probably have the World Trade Center the way it used to be, OK. And by the way, most importantly, with all the thousands of lives that have been lost and affected so gravely. So we have to be smart. And here's what I just read, and I read this and I somehow related it and it was sort of an amazing thing and I'm gonna read it to you. Al Wilson, the late great. Does anyone know Al Wilson? Singer. He wrote this little thing about the snake, right, the snake. So we have a little situation that could be a Trojan horse. You looked at what's happening in Germany, in Cologne, Cologne have had a problem, Cologne, Germany, OK? Everything's fine, everything's nice, clean, beautiful, no problem. Now they're having riots, they're having rapes, they're having -- they never -- The New Years Eve has -- Have you heard about the New Year's Eve? It was like a disaster. And the German people are gonna riot, the German people are gonna end up overthrowing this woman. I don't know what the hell she's thinking but they have millions of people pouring into Germany and now they're not stopping them. Now I guess, they're gonna have to stop because the German people aren't gonna put up. And we want to have a cor -- Our leaders wanna have -- I don't think you want to have, people coming in from the migration from Syria. And when you look at that migration, it's very unusual. When I look at it I say I see so many men and they're young. They look like they should be on the wrestling team and they're young and they're strong and you don't see that many women, you don't see that many children, sort of a weird deal. It's the migration but you see all these young, strong people and they're mostly men and I say, \"What's going on?\" I noticed that in all fairness. this is like old news now. I noticed that three four months ago, you know, when it all started and I said, \"What's going on?\" And who knows what it is. You know the famous Trojan horse, I mean, it's this a Trojan horse? And I doubt it but it could very well be and they don't have paperwork they have no documentation whatsoever. They have no documentation and then we're bringing them into this country. We don't know who they are and you look at what happens in California, and you look at some of the things that happen -- including, by the way, flying airplanes into the World Trade Center. Why are we doing this? Build a safe zone in Syria, get the Gulf states, who have a tremendous amount of money. I mean, Saudi Arabia was making a billion dollars a day before the Euro went down so now they're making half, OK. They're making a lot. Get them to pay. They're not paying, the other ones aren't paying. We're paying we always pay. We're the sucker, we're the sucker. We're like the stupid sucker. We're not gonna pay anymore for all this stuff and anybody that comes in, if I win, they're going back out. We're gonna do it. You're mainly and everything but they're going back out. We don't know where they are we don't know who they are, where they come from. And we already had some. You saw the couple that came in from Iraq, where they were already planning different things. One in California, one in Houston, I believe, and they're planning things now. We don't need it, we had enough problems, folks. We got enough problems. We got enough problems. So I -- I read this the other day and I said, \"Wow, that's really amazing. That's really incredible.\" And it's -- the snake lyric: On her way to work one morning. Down the path along the lake. A tender hearted woman saw a poor half frozen snake. Interesting. His pretty colored skin had been all frosted with the dew. \" Oh, well.\" she cried, \"I'll take you in and I'll take care of you\". \"Take me in, tender woman. Take me in, for heaven's sake. Take me in, tender woman, \" sighed the vicious snake She wrapped him up all cozy in a comforter of silk. And laid him by her fireside with some honey and some milk. Now she hurried home from work and that night and soon as she arrived, she found that pretty snake she'd taken to and revived. \"Take me in, tender woman. Take me in, for heaven's sake. Take me in, oh tender woman, \" sighed the vicious snake. Now she clutched him to her bosom, \"You're so beautiful, \" she cried. \"But if I hadn't brought you in, by now you might have died\" She stroked his pretty skin again and kissed and held him tight but instead of saying thanks, the snake gave her a vicious bite. \"Take me in, tender woman. Take me in, for heaven's sake. Take me in, oh tender woman, \" sighed the vicious snake. I saved you, cried the woman. \"And you've bit me, heavens, why? You know your bite is poisonous and now I'm going to die\" \"Oh shut up, silly woman, \" said the reptile with a grin \"You knew damn well I was a snake before you took me in. Does that makes sense to anybody? Does that make any sense? Does that make sense, I mean, you know, and hopefully that's not gonna be the case but it's pretty. I read it and I just sort of put it together. We have no idea what we're doing. We have no idea who we're taking in, and we better be careful. OK. So, here's the story. We're not winning anymore We don't win a trade we don't win a war we can't beat ISIS we can't beat anybody. We don't win. A boat's take -- taken a little while ago, right? I mean, you know, again I imagine they're giving them back. I mean, we just gave them a hundred and fifty billion dollars. They'll probably say, \"How much you gonna give us if we give you back?\" I guess there are like ten sailors or more but that's the way we do it. We give $150 billion we got nothing, we got nothing. They still have our prisoners. Instead of saying we want our prisoners before we start negotiating and double up the sanctions you would have the prisoners in about two minutes but we don't do that because we're led by people that don't have a clue. We're led by people that don't have a clue and we don't have victories anymore, we don't have victories anymore. When did you see us having when did we beat China in trade? When do we beat Japan in trade? When do we beat ISIS? You ever hear a good story? We are winning with ISIS. We are winning. You don't hear that. We don't win. We don't win. We don't win ever. What was the last time we had a victory? We don't have victories anymore. We lose on trade, we lose on healthcare. Obamacare is a disaster. We lose on every single aspect of our life with these politicians Other countries have people that are much smarter and much more sophisticated and frankly, it's a word that's an important word. They're much cunning than our politicians. You look at Mexico, what they're doing on the border and you don't think they're sending people over. What do we have to take care of them for? Let the stupid United States, they call us stupid. OK? Kate gets killed shot in the back in San Francisco. Man was over here five times. Who do you think send her back? You think he just kept coming back for herself? He came back. Probably that in one. I don't know, maybe not, maybe. But what do they want to happen in jail for the rest of his life for take care and we'll send them to the United States. Jamiel this wonderful young man, the father's a friend of mine. Jamil Shaw, just an amazing guy, the father's an amazing guy. His son shot in the face as he's walking into his house. Loved his father and father loved the family, loved this kid beyond. I mean, they can never be -- they can never ever come back from that. It's vicious. Shot right in the face purposely.Stood there, boom, boom, boom, three bullets. And the father heard the sound then he said, \"Oh, my god.\" 'Cause he just spoke to his son he said, \"I'll be home right away.\" and he heard the bullets right outside the house. And the woman killed recently. A veteran, 65 year old veteran. Raped, sodomized, and killed by an illegal immigrant. And we treat illegal immigrants better than we treat our vets, remember that. Our vets are not treated properly. Our vest are our greatest people. Our wounded warriors and our vets and we don't even treat them well but the illegal immigrants you see what's going on. I mean, in California they want to take over the City Council. They want to now run for office. They were illegal immigrants. I don't know what the hell's gonna happen but the concept of it even. I mean, what's going on is absolutely insane and we're gonna change it so we don't want anymore but we're going to start winning and we're gonna start winning big league. We're gonna make our country rich again. A woman came up to me I said that recently in a big rally I'm still gonna make our country rich again. She said, \"Mr. Trump, I'm such a fan of yours, I'm voting for you. It doesn't matter but that doesn't sound nice when you say would make us rich again.\" I said, \"You know, ma'am, we owe $19 trillion. We just made one of the dumbest budget deals that I've ever seen. I don't even know. Do the Republicans have anybody negotiating? OK, you know what I'm talking about two weeks ago. I mean, Obama got everything. You know Obama is a lousy negotiator except when it comes to negotiating with the Republicans, right? He's a good negotiator with the Republicans every country kicks our ass but with the Republicans he's like a great negotiation. It's so -- \"Oh, it won't happen. Well in my case there won't be Obama we can do it right from the top.\" Because it all starts, remember this, it all starts from the top down. It all starts from the top down. So so we're going to have a country that you're gonna be so proud of. I mean, there are so many different things. When you look at those phony employment numbers where they say we're down to 5.2 and 5.3 and 5.1, it's all nonsense. If you're looking for a job and you give up because you can't find one statistically, you are you're considered employed. We have millions and millions of people out there that want jobs the other thing about the recent numbers phony numbers, who is put that was developed that system for the benefit of politicians to make them look better because it bears no relationship to the fact. Do you think I'd have this crowd and do you think I'd had this kind of support and be getting 42 and 45 and 39, and all these high percentages against all of these people if things were good. And frankly, I wish things were good 'cause I love my life. I mean, I love company, I love my family. I don't need to do this. This is a hard thing. You know I'm going all over. I love Iowa but, you know, I could be home watching something tonight, right? I won't be watching the speech, but these are minor details, won't watching the press -- Actually, I probably will. No, I probably will. Probably. We gotta watch, you gotta watch. You got to see what the hell's going on because he doesn't know so somebody has to. So if you look at an example, radical Islamic terrorism, we have a president that refuses to say the words and I don't know. Is he stubborn? What's the -- what's wrong? When people kill people and they they announce that that's what they're doing it for and it goes on and on and on and it's run or not us all over the world and at some point you would think that he would say, \"OK, we have a problem let's -- let's get to the bottom of it.\" And you can't get to the bottom of a problem unless you are willing to address the problem and he is not willing to address the problem. And he's never gonna get there and we'll address the problem and I have friends I have muslim friends or incredible people. And I'll tell you what, a couple of a very, very high level. Very rich, very good people, even though they're rich, but very, very good people. And some that are rich and they've said to me, \"You've done a tremendous service by doing this because we do have a problem. This tremendous hatred for whatever reason.\" I mean when you see somebody willing to walk into a room and start shooting -- now of course, you know, they always walk into rooms where there are no guns, you ever notice that? Like the military base, they walk in gun-free zone on a military base. We have five great soldiers one of whom is a world-class expert on marksmanship, one of the great shots, one of the great marksman. They've told to put down their guns a hundred yards away it's a gun-free zone. Now when a sicko here's gun-free zone, when there's sick people here gun -- that's like candy. That's like I want a piece of apple pie. They walk in. We have five unbelievable brave great soldiers that are dead now because they look for gun-free zones. So we have to be careful with it. We have to be careful. Now these guys had the guns. Number one, they wouldn't have been there, he wouldn't have been there. Number two, if he was he was going to get blown away, which would have been fine. The other thing I tell the press all the time I mean they make people like, you know, they make them like -- they make them -- they glamorize it. They call this thug in Paris, the mastermind did you hear him all say? The mastermind. That's the master -- he's a guy with a very low IQ, I guarantee. I call him the guy with the dirty hat because he had this horrible disgusting filthy hat on and I said to the press and they don't use the term anymore. I think if I did one thing they're not use -- because our children are being radicalized in many cases by Isis and others. They're using the internet better than us and we're the ones that invented it and they're rattled, I mean, they're talking kids and they're fighting for Isis and then we allow people back. How about this? They go, they fight for Isis and then we let them come back and somebody said well there's no law that allows us to keep them. Are you crazy? Are you crazy? So they fight for us. Someday they won't go,they'll just fight here. They don't want to go. Why should they go over to Syria? Why should they go over to Iraq and fight when they can stay right here and fight? So why do we allow people? We know they're Isis and we they come right in and we let him come back, it's insane. So I just want to tell you that it's a special place, I love Iowa, we're gonna do so great. We're gonna win and we're gonna start winning. We're gonna win so much that you people are gonna get sick and tired of winning you are gonna say, \"Please, I can't take it anymore. I can't take it anymore, no.\" We're gonna win with the military and we're gonna win with healthcare, and we're gonna win against all these countries that have been ripping us off for years. We're gonna win with FED. We're gonna have the smartest people. Right now we have political hacks, they're political hacks then nothing. I know a lot of these guys they can't find their way through their own front door, they're political hacks and they got the jobs because they gave campaign contributions to these politicians that I'm running against, including and I'm talking on both sides. So we're gonna start winning. It's gonna be a beautiful thing to see. We're gonna make America great again. You're gonna be so proud of this country and you're gonna be so proud of your president and I love you. I love you all. I want to thank you. I love you all. Thank you. thank you very much. Thank you. Thank you. Thank you, everybody."}