{"id":479,"author":"Donald Trump","title":"Speech: Donald Trump in Windham, NH","date":"2016-01-11","link":"https://factba.se/transcript/donald-trump-speech-windham-nh-january-11-2016","paragraphs":["Thank you. It's so nice. Well, we have a lot of things to talk about, so many things. Some good, some bad, the country doesn't have a lot of good news, you know that. Ah, you made your shirt for me. That's actually not bad. Thank you, Darling.","Thank you. So on a Monday morning, and it's cold and windy and unbelievable, and you're packed and it's like that all over, packed houses all over. No matter where we go because there's a movement going on. It's an amazing movement and it's something that's special. I left, I watched some of the programs it came out with new polls.","I love polls when I'm winning. I love them. Believe me, if I wasn't I would not be -- if I was in second place even, let alone, some of these guys are in ninth place. I wouldn't even know -- I don't even know if I'd come here in ninth place, don't you sort of say, let's cut down on the trips, it's not going to happen at this stage, right?","But NBC just announced this morning a brand new poll and Trump is leading -- oh, that's beautiful. Trump is leading in Iowa, wow, 26, Cruz, 24; Rubio, 13 and the rest are on keen road. But let's get to, let's get to New Hampshire. Actually, I want to -- CNN has a 33 to 20, Trump is leading. Then I had one that was less but it's not terrible that I don't believe it really because it was Des Moines registered, and I believe nothing they say.","Almost as bad as your uncle who looks bad for you. When we discuss that makes that worse, run by people who don't know what they're doing but we won't talk about it. But here's what we're doing up here. So, just out, Trump, 30; Rubio, oh, that's interesting 14; then the rest of them are very bad. They're not making it. But here's one that I love, New Hampshire one, right?","And now I'll put that's very accurate, 32 to 11, 32 to 11. OK. That's big 32 to 11. I love New Hampshire one. And CNN, I told you about South Carolina, that's a great one. That's a win, fantastic like this. That's been so strong from the beginning in CBS, 38 to 23 segment. And then let's go nationals for a second because they just came out.","Reuters, 42, I've got to say it's like 15 people, right? 15 people. Of course, it's going down fast. I'd love to imagine there's a run for the door right after New Hampshire, maybe after Iowa. There's going to be a big run for the door. Some of those zeroes are going to be -- what are they doing? I mean, Bush, what is Bush doing?","The guy has spent, think of it, the guy has spent $69 million. He just took $25 million in donor money. You know it's all donor money because these people have control over the candidates and they all take it. I'm the only one that's self-funding. Just remember that, the only one. I'm the only one, and I guess, well, we just took some buys, some pretty big buys, they said why'd you do it? You're winning by so much, why would you want to spend your money?","I said because I don't want to take a chance. Number one, no one will want to take a chance. I don't want to be cute. And number two, I sort of feel guilty. All these guys are spending all this money and I haven't spent any. And I mean, literally, I didn't spend anything, practically, and I felt very guilty.","So I'm spending money out of guilt, OK? Believe me. I did too. I see all this -- you see Bush, $69 million, Trump like nothing. Trump 42, Bush like nothing. I don't know. It's time, sometimes it's time for a guy like that to just go home, relax, take it easy, be with your family. He's got a nice family. Be with your family.","Relax. So Trump 41, Cruz 16, it's actually now 42, 42, Cruz 16, Carson 12, oh boy, Bush, wing, a lot of people ahead of him. OK. On -- I do it with Bush because he spends so much time advertising. He advertise -- this guy's spending millions and millions of dollars on negative ads. It -- I turn off his ads I wouldn't hit him.","I mean, the guy, he spends so much money advertising Trump, Trump, Trump. At least he uses good pictures of me. No, I look good. He had some, where I'm so young I said, man, I was really handsome. Look at those pictures. They're from so long ago. He's young. Awww, Fox News, Trump 35, 20, 30, I mean, oh, here's a good one, just came out, against Clinton, Hillary Clinton.","I don't know. She could have big problems. Release Hillary from prison -- Trump 47, Clinton 44, we're winning by a lot. So that was that and have you read about this little truck stop with the famous paper, right? You know, you read it on paper the union leader. No, it's really on this paper though. It's terrible.","So this got to rag. It's just, I guess, I mean, they have like 75,000 readers not so long ago when we had Mr. Ludlow running it. It was amazing. And now they're down to what? Around 10,000 and it's a -- I don't think they'll be -- personally, I don't think they're going to be the business much longer. What a useless leader, that's right.","I read this stuff. I guess, look, I don't mind not getting an endorsement. They endorse somebody who doesn't have a chance, OK? He's a friend of mine but he's not going to win. But I don't want him to get in. But you don't do that and then ask Trump all these things. I mean, this guy drove me wild, Joe McQuay.","He took -- we have, we're having, writes me letters. We're having a forum, meaning a debate of some kind. The day before the Fox debate. Now, who wants to do that? Everybody in the world was talking about the Fox debate. I'm supposed to show up with Vince Laura and I said I'm not going to do it because I'm not going to do it. So I was the only one that didn't show up. He was very upset about it. It bombed, very few people in the room, empty seats all over the place.","The ratings were terrible, all right. Then he calls me up and he wants ads. So I give him some ads but I -- what am wasting my money for? You know you're rich for a reason. Even if you're rich you don't want to waste money. So we're looking to stacks of his paper, the paper, you know, not too good to put in mine.","So we gave a couple but we didn't -- he wouldn't like that much long. So he says would you like to have lunch at my club? He has a club, nice club. I stood taking pictures for so long with all the people in there, with him. I had hamburger. It was excellent. But I'm standing there shaking hands with club members, nice people, great people, probably some here today.","Anybody -- does anybody here from that club? It was very nice. Anybody here? Because I took so many pictures of that. So I did that and I did it as a favor and other things. He asked me if I would come up and make a speech on behalf of James Foley, I'd do that anytime. I think that was good. And then I made a contribution, a very big contribution to James Foley.","And I think that's fine and I think that's fine but I came up by making a speech. I did a lot of things. Then we said, although it's strange, you know @realDonaldTrump. So I have millions and millions of followers especially when we have Facebook. It's like 5.5 million, 5.6 million for Twitter, over 5 million for Facebook, Instagram, I mean it's like 11 million, 12 million people.","And then he said would you do me a favor? This was a few weeks ago, Chris Christie did not make the main stage. I would like you to do me a favor and tweet, tweet that Chris Christie should be on the main stage. I said but Joe, I mean, he didn't make it because he didn't make it, right? You know have to go through you have to have a certain number of points on the polls.","Well, he didn't make it and he should be there, it's not fair would you do it for me? I said I'll tweet so I put out a tweet. What do we get Christie, what am I going to say? What do I do? I think I'm being nice but I knew immediately I was going to endorse Christie. Can you imagine a guy calling me up, knowing he's going to endorse a guy, asking me to use my Twitter to put an ad. And other than that -- I mean, the guy is bad news, OK? He's not a talented guy.","Then I get a letter. You're not going to believe this, I had to take the glasses out because this is worthwhile to read. I get a letter from one of his top people. I just got it recently. It's from Amanda, person in charge for Robin Wilson, the union leader. Hope all is well, I thought they made a wonderful holiday season.","Happy New Year, Amanda. I'm emailing today because I wanted to let you know about the special edition that we'll be doing just before the New Hampshire primary, it's called voters first. I have attached a letter that explains what will be included in the addition on the rate card, a rate card. They want advertising.","This guy wants advertising. We just got a letter and it's a personal letter, sent out letter from a computer. It's a perfect edition for you. I really hope that you'll consider running an ad. Please let me know as soon as possible. Robin Wilson, Advertising Manager. OK. I'm saying I don't believe them, the girl walked up she said, Mr. Trump, what's going on around here?","My girl was even surprised. She didn't even know about it. The -- this next page just -- letters to next page after that. I'm -- think of this. This guy is running the newspaper into the ground. I mean, you had a guy, the world is about this legendary guy. Look, two-page spread, $7,500. The back cover for only $3,500. Does anybody want the back cover of the newspaper that lost all credibility, huh?","I'll take it. I'll give you $500. Inside that -- the union leader, OK? It's not the way you do business. I mean, the guy is out of control, thinks he's hot stuff. He's not hot stuff. So anyway, so I just had to bring this up. It shows the dishonesty with the media. It really does. The media is very dishonest.","Although I have to tell you, Time Magazine did a cover story of me this week. It's one of the best stories I've ever read about myself but it's really not about myself. It's really about you. It's about a movement that's going on and I tell you what, I've been on the cover now of Time a number of times in the last three months.","And then obviously, I should have been picked as the person of the year, right? I think the reason, the reason -- yeah, maybe next year. Hey, next year would be even better because if we go through then we could do things. But they didn't and they picked Angela Merkel who is -- do you see what's going on? And we talk about immigration.","We talk about borders. Do you see what she's done to Germany? Just coming over, just before this morning, I'm watching television, the raids, the rallies, what -- what's happening is unbelievable. It's unbelievable. Unthinkable and they've been there for two weeks and the place is going to hell, and she got personally invited.","I came in, I guess, I came in second. So they felt guilty so they gave me another coffee. But I have to tell you, you have to go out and get Time Magazine because it's talking about a movement of great people and it's a movement like they haven't seen. Many people are saying there's never been anything like this in this country, what's taking place, with us, not me. I'm a messenger, it's with us. Like an amazing, amazing thing and I'm very proud of that story because, you know, that was -- so usually is I'll get the story it'll be good but they always put a shot at it. You know, like they'll have three good paragraphs and then one total killer and then they'll have five good paragraphs and end in just a total killer.","So you tell people don't read it. We don't want to read it because the killers make up. They have to do it because you know they have to do it and they're dishonest. But the Time Magazine piece and especially you know, Time is known as a pretty liberal deal going on there. This Time Magazine cover story is amazing and it talks about what we've done and when we've done.","So OK, so let's talk a little bit about what we're doing in terms of the competition and then we'll talk about the problems of the country and how to fix our problems. And then basically, to have to fix the problems elect Trump as President, OK? Let me tell you a story. Do you know what we can do? That'ss right.","President Obama, you're fired. That is an easy one. So -- thank you. Got to hurry too just to ask the question. So Ted Cruz has a problem. I mean, he's got a problem. If you know, coward Cruz will now brace them said he's going to bring a major suit and the suit is going to say that he wasn't born in this country.","So whether you like it or not, Ted has to figure it out because you can't be having a nominee if they're after that -- I think I'm going to win very solidly to tell you the truth. But if you get the nomination, you can't have the person who gets the nomination be sued like Hillary might be sued, it's a different kind of she released the e-mails.","But with the e-mails, she should not be running. Oh, I'd love to run against Ernie. I tell you. I would love -- I mean, can you imagine? when they took -- remember they took the microphone away? Get off the stage. They told him. This is our President, he goes like this, oh, excuse me. And everyone out there is saying get off the mic we want to hear him.","He looked up like a little puppy. This is going to be our President. I would love -- please, FBI, please go after Hillary. I want to run against Bernie. Oh, that's a great number for this guy. He would make something as a 90% tax everybody. Does anybody mind paying 90% tax? You see with Bernie, you're going to have yourself a nice 90% tax.","He wants to take it all away from you. You know he sort off dampening a little bit. He wants to keep it a little bit low-key. He wants a big fat beautiful tax, OK? And I don't think the people here are going to go for that very easily. But I want to run against Bernie. That's my dream. That's my dream. That's the one.","That's the one I really want. But Hillary will be fine. And you know, the poll just said we beat Hillary, Fox poll just down with the other one. You know honestly, we'll take anybody. I think we're going to beat this. With the people we have, with the movement we have and we have by far the largest audiences.","And in all fairness, Bernie is second but way down by comparison to the audiences that we get. We're going to Pensacola next week. They don't even know if they can happen it in the area. I mean, they -- the number of people showing up at Pensacola is unbelievable. But we had 20,000 people recently, 21,000; 35,000 in Mobile, Alabama; 20,000 in Dallas, Texas, the Maverick Arena filled up. I mean, it's unbelievable the crowds we get and it's only determined by the size of the space.","And I want to thank the Fire Marshall because he allowed a lot of people in here today. There are people standing indoors. Nothing's going to happen but people standing indoors. But the Fire Marshalls, the Fire Marshalls are the most important people to me because they let us get more people in the rooms.","And they -- every one of them, they'd be great. So I appreciate that. But Ted Cruz has a problem because the question is, is he a natural-born citizen? And the question was asked in a Meet The Press who was asked to be by Chris Wallace this weekend. And I said I don't know. I mean, nobody knows. And Laurence Tribe of Harvard who's a constitutional expert, one of the best in the country, said and I wrote it down, this is not a settled matter.","It's wrong to say it is a settled matter because it's absolutely not. It's not a settled matter. That means that -- you know, a lot of people think that you have to be born here. You have to be born around in this land. Now, John McCain, Laurence Tribe represented John McCain, he was born outside of the United States but he was born on a military base to two people that were in the military.","That's different. I would never question that. But in the case of Ted, he has to figure it out. Now I think he can go with some kind of a Judiciary proceeding and he has -- look, it doesn't matter what he does. You can't have a nominee who's going to be subject to be thrown out of as a nominee. You just can't do it. So if you're going to make that decision, folks.","I mean, it's one of those little decisions -- I'm sure Ted is thrilled that I'm helping him out but I am. I mean, I am. I mean, he's got to go and he's got to fix it. Now one thing I'd just say, just to finish with Ted. So I have a very strong immigration policy. When I brought up immigration, I mean, it was brought up strongly in my speech, in my opening remarks and I said walls and all sorts of things, right?","That's good. Well, you know, a low-key and his Admiral hit me. No, no low-key -- OK, ready? We will build a wall. Who's going to pay for the wall? Who? OK. So you people know what I'm saying. Because I've been saying this for a long time. So yesterday or two days ago, they showed me a catch plan and it said, said this, it begins by building a wall.","It's amazing how far people have come. Then took up the number of Border Patrol officers. That's me too. Implement E-verify. That's me too. It's amazing and all these people. And by the way, Ted happens to be a very good guy. They're all good people but they all like -- you know when I was taking what Rush Limbaugh said, nobody hs ever received more incoming, OK? And it's true.","When I announced, I said, boy, the two weeks I said is it going to be like this always? I mean, it was brutal. And then, all of a sudden, a lot of things started happening. Crime statistics started being looked at. Kate was killed in San Francisco, beautiful Kate, by an illegal immigrant, shot in the back.","You had Jamiel in California who I -- I think his father's one of the greatest people. I got to know his father over this. And Jamiel Shaw he was a young man getting ready to go to college, a good football player, a good student and he was killed shot in the face three or four times by an illegal immigrant.","Just walking down the sidewalk going back home to his father. You have the one woman in Los Angeles who is a veteran, 65 years old, rapped, sodomized, and killed by a person that should not have been in this country, an illegal immigrant. And all of a sudden, everybody's coming my way. They were all saying, wow, you know he's right.","I don't have any -- I mean, do you remember how crazy it was? Macy's were totally -- we cannot have -- we're a member of inclusion. We have -- we consider ourselves a very inclusive and end up, they got fined $650,000 for all sorts of discrimination and they're always like being looked at. But as soon as I am -- not a big deal for suits and ties, who cares?","I didn't like the ties that much anyway, they were made in China. No, but not ass disloyal as Macy's. I tell people don't shop there anymore and their stock is tube. Did you see what happened to their stock? Can I take credit for the fact that they don't sell my shirts and ties there? The company went to hell.","It's unbelievable. Where they talked about inclusion but they have a fine for $650,000 because they weren't inclusive. OK, so you figure that one out. I love those I love it when something happens where like an enemy, right? They become enemies to me. It's just sort of, you know, very clear. But Macy's did a number on me and this -- their company crashed and that's from what?","What were they? $75 down to like in the low-30s. That's not crash. And it happened that way with a lot of people that we're fighting. Do you remember? The Governor of Texas, Perry. He was doing fine, right? Yeah, and it happened with Bush. Look at the way he crashed. But they were fine and then they attacked me and then they all went down.","Lindsey Graham was doing fine then said I need more points and he attacked me and he went down? Remember the phone number, right? Oh, all of them. I mean, Governor Walker, a really nice guy, Governor Walker. But he attacked me, I was his friend. I mean, he came to my office giving me a plaque before the election of course, not recently.","And now they're taking me with them. Wouldn't it be nice if we had that in our country where somebody does something bad to us and they go down? That's what happens. So Macy's, Macy's went down and these people that attacked me they got that and that's a good thing and that's a good thing. Because you want to have wins.","We don't have wins anymore in this country. We don't win. We don't win at anything. And I mean this guy named John H. Sinunu, who wrote an article in this only paper and they were so bad. I don't even know the guy and yet he's pushy but John H. Sinunu has been known -- he's been fired by Bush. I mean he was fired, right?","Yeah. And he was fired like a dog. He was fired viciously and he's such a dumb guy that he doesn't even know he was fired. He go and -- he go and shows. It was interesting. He go and shows and he say the worst things and I'd watch him say these things, it's terrible but eventually, they had to fire him. Then he writes an editorial about him and it's nasty.","You know the Kool Aid editorial, right? Thinkin' it'd go away. My life has been about success. It's been about building a great company. I even did the filing. Everybody was shocked because the company's far bigger, far better. I have some of the greatest assets in the world. Tremendous cash, tremendous cash flow, it's very little debt and I say that not to brag about the company.","And I had to file this, you know, a private company, so everyone was, oh, maybe he'll not file because he'll never do that. First, they said he wouldn't run. Then they said, oh man, he ran. With the pundits, guys like Karl Rove total -- I mean, this guy's a stiff. They mention he knew Trump he starts shaking.","I don't know why. I don't even know him. Karl Rove, George Will, take away your little glasses, do you know what I mean? Take away his glasses, he's got this little, tiny spectacles. Take away those glasses and he looks like a non-intelligent person but he's not intelligent. You know he was big into the war.","Let's go win. Let's go win. And I was against the war, 2004 I came out strongly. Headlines, Reuters, I came out strongly but that vision could end the war in 2003. I wrote about Osama Bin Laden in 2000, in the year 2000 in my book. That Osama Bin Laden, bad guy. I saw it on television. I saw it on the papers.","He was very threatening. I said they better take this guy out and he knocked down the World Trade Center two years later. And the one with the lotteries, Joe Scarborough said but wait a minute, you mean Trump talked about Osama Bin Laden before they were knocked out? And they said yeah, he did. And it's not even my main business.","I said I'm a builder, I'm a developer, I'm a business person. That's not my main business but I talked about it. Why didn't the politicians know about it? If I knew about it why didn't they? But it has to build on a vision. I said don't attack Iraq because if you attack Iraq and I'm the most militaristic person in this room except for maybe Al. I think Al has me beat.","You -- he has everybody beat, right? Huh? Am I good with the veterans Al? OK. I thank you. I am, I love the veterans. But other than that I'm the most militaristic person in this room but you had too know. I mean, I'm going to build our military so big and so strong and so powerful. It's the cheapest thing we can do by the way.","Just so you know. It's the cheapest thing. General Odierno when he left he said that the Army is the least prepared that it's been and I think he meant from its inception. That's a long time. But essentially, he's saying the Army is a mess. So our military's in trouble. All the time in the real estate business I get listings on military bases for sale, another military.","I get all these listings with these military property. How many are we closing up? What are we doing? We're closing bases? And we should have the most updated, greatest military. We protect all these other nations. We don't get paid anything, in many cases, if we get paid a little comparison to what it cost.","For instance, we protect -- I love South Korea. We do a lot of business. I buy televisions, thousands of televisions from South Korea for projects. Thousands, they're all from South Korea. Then they make a fortune. Then they build the big ships. They build the big tankers. We protect them for peanuts. We have 28,000 soldiers right in the line, 28,000 all right and we have all these soldiers up and down the line.","Why aren't they giving us a lot of money for this? I mean -- and then the bad man is over there talking about nuclear, nuclear, nuclear. We're protecting all these people and we get nothing. Don't we wonder why the country is in debt? We wonder why we have $19 trillion to which now we got a horrible budget that was just passed.","That horrible, horrible budget where everthing happens, Obamacare is funded. All of these things. The Syrians coming in. The Syrian migration. No, no, think of this. The Syrian migration is funded. All of these things we can't do it. We can't do -- we can't afford it. We're not going to afford it anymore.","We're protecting Saudi Arabia. Saudi Arabia, well, it was before the oil problem now they're making half but they're still making a fortune. But they're making $1 billion a day, $1 billion a day. We protect them they pay us peanuts. They wouldn't be there except for us and I say it's fine but we got to get paid.","We've got to get our money back. Why are we doing this? Why do we protect -- you don't hear this from anybody else. You don't her this from these politicians. They don't even know about it. They have no clue and you know what? If they pay and reimburse us for the kind of billions and billions and billions that we're spending to protect other people that are in different parts in the world, if they paid us, we'll have a whole different balance sheet.","You can have yourself Social Security without all these cuts want to have. You can even have your Medicare. We're spending so much money on such foolish things and if we had the right messenger you'd be able to get the money and be friends and be friends. You know, as an example, at the Iran deal. We're giving them $150 billion, $150 billion, we don't even get the prisoners back.","We get nothing. We lost every single coin. We'd say we'd like to have the following and they'd say no. And they say, oh, OK. This is what happened. It took years to negotiate that deal. One of the worst deals ever. And think of it we don't get the prisoners. Now I would have done something different you know it's called the art of the deal.","But it's not -- I mean, 90% of this audience, 90%, not 100%, maybe 80%. That's OK it's not insulting. I could have done a better deal than Kerry on that deal. I would say actually could be 100%, right? Who the hell in the audience -- who in the audience wouldn't have done a better deal? We gave them everything we get nothing.","We gave them everything. I mean, we get nothing. Now when you think of it, we've made Iran a power but what else have we done for them? For years they've been fighting and fighting and fighting with Iraq. Iraq has the second-largest oil reserves in the world. We gave them Iraq. That's even better than the $150 billion.","The $150 billion deal is peanuts. We gave them Iraq. For years they had the same power. Right now maybe they have the same base principles, huh? Well, the House says we got to trade. We gave them, OK? We took Bergdahl, a dirty, rotten traitor five people killed looking for them and they went out looking for him, killed.","Five young incredible people. I've watched the parents so sad. So we've got a dirty, rotten traitor. They get the five most people that they wanted for nine years, OK? And those guys are back fighting. They're all back fighting, all right. Don't believe the news because they'll say, well, they're not back fighting they're resting.","They're fighting. That's what they want to do. They want to fight. They want to fight. So it's just very sad. That's why I said I have to do it. I continue to stand -- I couldn't stand watching what's happening in our country. So many bad decisions. So much stupidity. And that's why I said I'm going to run.","Think of this. If on the Iran deal just one deal you go in and you say to the other side, great negotiators, the Persians are great, have always been known as great negotiators. You say on the other side before we start we have to have our prisoners back. That way you have your message in a sense. We got to have our prisoners back.","Got to do it, otherwise, no way. They're going to say no. And we're going to say got to have them back. They're going to say no. We're going to say bye-bye. Go. Double up the sanctions. Within 48 hours they will call you as sure as you're standing there, 100%, not 99%. They're desperate. They need money.","They have no money. We just made them powerful and rich they're going to have nuclear weapons now by the way. We're going to have nuclear proliferation because of that deal all over the place. These people that do these stuff are incompetent. So now, they'll call us and then they'll say you can have your prisoners.","Now we have the prisoners. Now you go back and can say second statement. First statement in business you don't want to break them up at the same time. Second statement, we're not going to give you your money. We're not giving you any money. We don't have it. We're a debtor nation. We owe $19 trillion. We don't have your money.","We want to be nice. It's always nice. My father used to say take the lumps out. So you take the lumps out. Do you know what the lumps are? We want to be nice. We don't have to put it -- just say we don't have it. We don't have the money. Sorry, We wanted to give it to you. I'd like to give you your pork.","We don't have it. They'll go crazy. Everything in-house. Don't worry. They won't get the money. I'd guarantee. If I were President they won't get $0.10 of that money, not $0.10. Then we'll get the best. And then these make it and wouldn't agree to the 24-hour, you know, how about the 24-day inspection, OK? They'll have 24 days and that doesn't start because I see the man shaking his head.","You know that good-looking guy down there shake his head. He shakes his head because it's impossible to believe, right? And the clock doesn't start ticking for, it could be for months. So that thinking ought to -- but the best is they have certain sections where they self-inspect. So Iran's going to self-inspect.","And when we say I hear there's some activity going on. Well, we will check and we will tap you. Next thing, no, we didn't notice any nuclear weapons being made. We are being led by the world's dumbest people. Now a lot of the people think that there's something -- you know, something secret's going on. I don't happen to believe that, OK? A lot of people think they can't be that stupid.","I don't have to -- I think they just incompetent people. I think they don't know what they're doing. I mean, look at what they've done for his show, his show this is -- the deal for this show is the worst. OK? The worst. So we're giving our country away step-by-step. Now we have the migration. I mean, look at the migration.","Now one of the reasons that CNN are taking all those cameras going back there and so I have to be extremely careful with what I say but CNN does these polls. You know I don't have pollsters. I say what I say. Whatever the reason I say it. I'm a smart guy. I mean, we're smart people. I say what I say. I don't want pollsters.","These people will never have ever said that we have radical Islamic terrorism. We have to find them. We have to do something. These politicians, I mean, they don't talk about it. Obama refuses just to even say what the problem is. You can't solve the problem. You can't solve the problem unless you're willing to talk about it and open up a dialogue.","So now, well now, so it's coming at me, I'm looking at Germany, hundreds and hundreds of rapes on New Year's Eve. This is Germany. It's Germany. They have a problem. She went off the -- I don't know what happened to them. She was doing well. Maybe she had power-hungry. Maybe she thought she was invincible.","They're taking in people. The crime is astronomical. It's not working. They're heavily riots now in the streets. And the Germany people are saying we've had it. We've had it. We can't let that happen to us. Obama wants to take thousands and I think that the 10,000 -- don't forget they say 10,000, it's just the beginning.","Because if you remember in the debate, in the Democratic debate, recently, the last one they were talking about 55,000 or 65,000 and now all of a sudden Obama is talking about 10,000. Believe me, even at 55,000 or 65,000 I have heard that they want to take 200,000 that's what I heard. But whatever the number is I don't care if it's 10,000 or 2,000. And I have a big heart than everybody and anybody and you can do a beautiful area in Syria you call it a free zone.","You hear the words you call it an area of where we'll protect, where we'll make possible for people to live until they hopefully, someday go back to their homes. So it's very important. It's very important. Hey, get him, get him out of here.","We're in a meeting. Get out of here. Go ahead. He must have been a funny guy because he only wants jokes. There's nothing funny about this. This is so serious. Out, out, out, out. Get out of here. He's got a lot of -- yeah, he says he loves it. Out. I can see he's got a different -- he's got a very serious problem.","Take his scope. I saw that when he came in. I love you, I love you. You're the greatest. I love you. Yeah, we got to get the right in this. It's time to leave us. Time to leave us. We've got so many problems. We've got so many problems. And we got to get them solved. And if we don't get them solved, we're going to be in a very serious trouble.","So you build the zone, you take care of it. But if I get elected, I will tell you, everybody has to leave. They have to leave. They go out. They have to do it because if we can't help the problems that they have. I mean, when you look at the world, you look at what's happening. It's incredible. So when the journey started, I came down the escalator, I talked about illegal immigration.","We talked about it. We talked about it very, very strongly. And it's all part of the whole plan. When they knew the calls, they come out and they come out strongly and they say, for immigration, for terrorists, for military, for ISIS, Trump is way ahead of everybody else because it's sort of all on that same ballpark.","We've got to protect the borders. We do have to build the wall. We're going to build the wall. It's going to be a great wall. People aren't going to come in unless they come in legally. People can't come in illegally. You have a tremendous heroin problem here. It's an amazing thing. Every time I come up to New Hampshire, which is a lot, I talk to people and one of the first things they mention as people on the outside don't think of this.","But you have a tremendous heroin problem here like it's incredible. And I don't really understand it. And a lot of people don't understand it but you know where it's coming from. And it's spreading far beyond this area. And it's such a serious problem. And young people and older people too are becoming totally addicted.","We're going to stop it and there we're going to work in helping the people that are getting addicted. We have people that are fully addicted. And we have to work because they're not doing enough work to help these people. We have to work on it. So I'm going to tell you few questions before we start but I just want to mention just a few more things.","So Obamacare, better to repeal it and then revise. They have to happen. Thank you. We're going to repeal it. We're going to replace it. We're going to replace it with something that is far less costly for you and far less costly for the country. Your premiums are on a 25%, 35%, 45%, your deductibles are through the roof you won't even be able to use it. Obamacare is a failure and it's going to fail in '17 anyway.","We know that it's going to fail in '17. So Obamacare is out. Common Core, Jeb Bush wants Common Core. How the hell did he want Common Core? Not that we tap. Two things that I remember most of that Jeb from Durham because people thought he might win. Then they found out he doesn't know too much. Common Core, we should favor the country for another 212, children educated from Washington instead of the local groups that do such an incredible job -- and I have seen them all over the country.","10 times better. And on top of that, if you look, we are the 20th in the world in education and yet we are number one for people in progress, OK? So how's Common Core? So Common Core is out. And the other thing he said is they come across the borders, an act of love. And I said wow. Tell the people that have had tremendous problems and crime to their family, tell them they come as an act of love.","So they don't come as an act of love, believe me. So we're going to solve those problems. I want to take it, and maybe I'm going to start with Al because Al has been so great. But we're going to take a few questions and you can just shout them out. I don't know if they get the mic, it's too hard to get them back.","But, Al, do you have a question? Right. Right. Right. Yeah, I know. Well, a lot of people have said the Marco Rubio has signed the Bill but he hasn't seem to go to Washington to get it passed. And he's using it as leverage at this point. So that takes a lot of -- one thing I'll say, an I think Al will tell you this, I didn't know the veterans' side in two years.","I have seen what's going on with the VA. If you take a look at the clinics and you take a look at some of these places and you see the corruption the desire to stay. But I will take -- I think you have good confidence that I will take care of things. They're not -- the politicians are not going to bring it that way.","Yeah, we are confident we're going to get it done. We're going to get the right thing, that we put it -- yes, ma'am, go ahead. You have one? Go ahead.","How are you?","We're going to get it terminated. Look, I'm a big Second Amendment guy. You know, I'm the best example there is on the Second Amendment. If you look at Paris, if you look at California recently where 14 people were killed, if you look at Paris where 330 people are more to follow this assault, so many there were so badly wounded.","If there were guns on the other side with the bullets firing in the opposite direction, you're not -- you'll have -- people killed like you're not going to have 130 people. They said to these people Paris has the toughest gun laws in the world. France has the toughest gun law just about in the world. Canada, unless you're a bad guy, then you can just carry a gun.","These people were told, get over here, boom, boom, boom, boom. Went on for so long they were so defenseless. The military, how about the military base a year ago, right? We had five soldiers, a couple of them were world-class soldiers, great people with the guns and the rifles like the top of the line. It was a gun-free zone.","This whack job walked in, looked at these five soldiers and just boom, boom, boom, they couldn't do -- these are the top people. On the military base, I would end that immediately. I would end that immediately. I mean, immediately. And you know we never lose. Gun-free zones, that's why it can't be. When these sickos see a gun-free zone, their eyes light out.","So that's who I am. All they are going to need is take little chunks out of the Second Amendment but the truth is they've got plenty of ammunition already but the Federal government does a very, very poor job of watching what they already have. They want to keep taking away, away, away and all of a sudden, the bullets I heard a rumor the other day, they want a nab but they can't do the guns, so they want to start taking away the bullets.","They want to make the magazine where it holds less than one bullet, OK? You know, I mean they want to make everything impossible but the end result is, you take a look, and I could debate this a lot with you people. I'll talk about Paris. I'll talk about California. And they can't win the debate. They always lose.","And then our problem next is they'll say if you agree with me, well, no, no. You know we need protection. We need protection. The Second Amendment -- and you need Trump here. The Second Amendment, the Second Amendment will be the way it is. We are absolutely going to protect the Second Amendment. OK, where's he at? Go ahead, go ahead.","Oh, you've voted for me already. I love you too, Terry. All right. That's enormous. Thank you. Thank you very much. I wish -- I hope the military can go out. Al, maybe you can lead a group and maybe you can bring that gentleman. What's your name?","Thank you, Dennis. See, he already voted. I love that.","Oh, can't hold it. Who cares, hold on, Carol. Carol, I like you more than Dennis now.","Thank you, Dennis. Thank you, Carol. He wants the military, I'm sure a few of you got some extra added access. If you can get in right now and if you vote, you could see our people and you could see Al. But if you could get in and vote, it would really be helpful. Yes, sir. Go ahead, go ahead.","Well, Bill joined Hillary. So far, it's not working and you might know it as well. So far, it's not. Hey, look, I wish him the best. I wish him the best but it has not been working out very well. He had some major issues. Yes, go ahead.","It's a great question. You know we have things right now that everybody in liaison versus this $2.5 trillion at least outside of this country wanting to come in. That's owned by business. It's business money. And the businesses -- everybody agrees, Democrats, Republicans, we should do it. So in years now they can't agree.","They agree but they can't get it done. What that is is the lack of leadership. One other thing, I thought that Barack Obama -- one thing, would be a great unifier. He has turned out to be a great divider. I'm a unifier. People don't understand that about me. I get along, in fact, before I was a politician, I get along with the Democrats, with the Republicans, with the Liberals, with the Conservatives.","I get along with everybody. People say, oh, he get along with them. Of course I did, I'm a businessman, I get along with everybody. I'm a unifier. We have amazing people in this country. We were very, very divided. We will unify this country and we're going to have spirit in this country. We have a great country.","We're going to the , we're here. We're going to do what's proper. And we're not going to be laughed at for being stupid. We're not going to be laughed at for doing the wrong thing. We're going to be strong. We're going to be really something special. We can be -- I'll actually say -- you'll not say Make America Great Again.","And sometimes I'll say, I actually believe we can make it greater than ever before with proper leadership. My other side of that. We can't go, however, for another four years of essentially Barack Obama because that's what Hillary would be. And I think Bernie Sanders would be the same thing. I mean this guy is totally advocate.","So we just can't do that, otherwise, you'll not going to have a country left. OK. Yes, sir, go ahead. Yeah.","What she wants us to declassify because she wants to see get out of the trunk. She's got them selling them out she's got them in such a beat. Look we have to, I mean, she seems intelligent. But I also have something that is incredible, something that's smart as Hillary and they said what she did is -- there is no answer to what she did.","You know what is amazing is that other than greed, there is no -- what is she doing? You just use what you're supposed to use, and you assume people listening. Who the hell cares? And you do what you have to do. All of this or what? It's greed. It's really just greed in some way. All she had to do is just do what you're supposed to do. It would have been so easy.","So you know, I could imagine. I think that's a really bad idea, declassify everything. OK. yes, sir. Go ahead.","So what we're going to do is we're going to bring jobs back into the country. I'm giving everybody a tremendous tax cut. We're going to make our country really vibrant again. My tax cut has been received so well by so many people. Some of the top, Larry Kudlow, some of the great people that really understand what's happening.","We're cutting business taxes, we're cutting middle-income taxes. The middle income has been driven out of this country. It's been so unfair to the middle income. We will bring our jobs back from China. We will bring our jobs back from Japan and from Mexico and from Vietnam, it's a big place. And we'll get to see what's going on in the Vietnam.","And they do it with devaluation. They devalue their currency and our people don't know what's happening. They don't get it. They don't know about business emergence. They don't know about corporate convergence, they don't know what's happening. Our leaders don't know what's happening. The U.S. corporations now legal in the United States are taking all of these jobs and dropping them and move them out of the country.","You know like we used to move to Florida or we'll move to some place, they don't -- they think about leaving United States now. We're going to make it strong again and we're going to save the social security. And nobody else knows how to do it but me. Well, that's what I do. Yes, sir. Go ahead.","Well, the truth is this, yes. I say this, very important decision for me. They will be gone, they will be out of Iran before I take office. If they're not, if they're not, Iran will have vow to pay. I can tell you that. OK? Iran will have a vow to pay. They will meet the four most prisoners in history.","That I can tell you, OK? We got to let them out. You know just to even make that standard and now they'll probably do that anyway. So they're going to have the prisoners released here. But Iran announced just recently that they are now willing to talk about the prisoners. But we want a lot, we want a lot.","Can you believe it? It's so sad. And all you have to do is say we want our prisoners and they can walk through, 10 minutes, and you will get back your prisoners. But now they want -- now they're willing to talk. And they say it like we're so stupid. We are willing to talk but we want a lot. Can you believe that?","So that's very sad. I mean, honestly, there's so many sad things. We all have a good time but the truth is we have a very negative topic because there's not a lot of good things happening. One of the point, middle-income people, and people -- people on the labor force essentially had not had a raise in 10 years.","You know that, right? They haven't had a raise essentially in 10 years. That's just not a beautiful statistic that just came out. OK. At the back, go ahead.","North Korea possessing the bomb, they don't know if it's hydrogen bomb yet but it actually a bomb and they said, you know, he's a wild man, he's a maniac in probably most ways. We have China, at the onsets, that's taking away tremendous amount of wealth from the United States. We have rebuilt China. It's been one of the greatest robberies in the history of our world.","What China has done, they have taken our jobs, they have taken our base, they have taken our money, they have taken so much. And I get along great with China and I get along great with the people. They buy your apartments. They give you tens of millions of dollars for apartments in New York. I like the China just like I can get along well with Mexico, but the Mexican and China and almost every country, they're leaders are too smart for the people that we have.","Carl Icahn endorsed me, great businessmen. The business overall love that. I mean, the ones that don't are giving money to these other candidates so they can totally control them. Because I can't take any money and I don't take any money. I just -- I have turned down so much. I would make Jeb Bush 100 -- can you imagine just having $125 million?","You just want $25 million worth of ads and he said $2 million or $3 million or something. Can you believe this guy? I would make his $125 million look like small potatoes like $2 million. I would have the biggest fund in probably everything. These guys can offer any amount of money and I'll say, I don't want it. I don't want it. I'm going to do this right because once you take that money, you're controlled.","You know, even if it's not, from a legal stand, when you are mentally solo flight, you all failed. And then what you do is you start doing things for them, not for the country. We're going to do things for the first time, maybe ever, we're going to do things for the country, we're going to do things for you.","We're going to get it right. OK? A couple of more. Go ahead, darling.","Well, we have to get the President. You know, the President talks about the environment, as you probably have noticed. More so, if you remember, global warming is far more important than ISIS and all of the enemies we're having the one who brought this on which is rather incredible, in all fairness, special.","So when we talk about the carbon footprint, OK, and how important the carbon footprint is, I'm not supposed to use air spray in my hair because it affects the ozone. Now it fits in an apartment that is totally sealed but it goes up and it affects the ozone. I don't think so, personally. But you know, this affects us. There's a lot of money being laid on this in that sense, OK? So what happens is the purpose of this the carbon footprint, and then it gets into East Coast, released into an old Boeing 747, Air Force One, with the old engine that just spew out more stuff than you've ever seen.","And it flies towards his family to Hawaii, to a yacht, and then he flies back. And the old 747 spewing out in the air and then he gives a speech on the environment and on the carbon footprint. Give me a break. So you know what I want, and I had to say because I actually received many environmental awards because I have developed so much of that but I have received a lot of environmental awards but what I think I want really crystal-clear, beautiful, healthy water and I want really clean air.","That's what I want. That's what I want. That's what I want. OK. How about -- this guy has really nice question, really good. I like this guy. Did you give me the Bible? Did you give me the Bible? The man gave me a Bible, what, you asked me this killer question. Go ahead. Go ahead.","You tell me. Go ahead, you tell me.","Right.","Right.","And there's another one.","Yeah.","Good. Thank you. How did you know so much about ranking?","Good. That's good. Do you have them in general or do one of them?","Yes, ma'am. Go ahead. Go ahead.","So let me ask you, what did Ronald Reagan say?","OK. And did she ever get there?","Did she get there?","Wait a minute, did he remember that?","No, no. But did she actually go?","All right. Then I will give you the exact same answer that Ronald Reagan gave. That's a very, very expensive , very very expensive. So I want one more. One more. Go ahead.","Actually, he wrote that very well for me.","OK. We'll take another question. It's fine. We got to end with a better question. OK, who's got a good one? Do you have a nice question? Go ahead. We have to end -- at least we have to end with a nice question. And nothing wrong, in all fairness, but in Ethiopia, we don't want to place our whole world in Ethiopia.","I'm sure it's a wonderful place. OK.","I love it. I'm going to leave it at that. I mean how can't I feel excited about that, right? That's right. I appreciate that. And he's a tough cookie. I look at him and say he's a tough cookie. Look, we are going to Make America Great Again. We're going to win. We're going to start winning. We don't win anymore.","We're going to win so much. We're going to make our country great. We're going to win with the economy. We're going to win with health care. We're going to win with our military. We're going to win and you'll going to be so proud. And I'm going to do a great job. And I'm working, I'm not taking anybody's money.","I'm not influenced by the lobbyists, by the special interests like every single other candidate because I'm the only one who's spending my own money. We are going to win together. Go out and get Time Magazine, you'll understand it even better because you're a part of it.","This is a movement that's going on. It's a beautiful, beautiful thing. I love you all. Thank you very much. Thank you very much. Thank you all. Thank you, everybody."],"text":" Thank you. It's so nice. Well, we have a lot of things to talk about, so many things. Some good, some bad, the country doesn't have a lot of good news, you know that. Ah, you made your shirt for me. That's actually not bad. Thank you, Darling. Thank you. So on a Monday morning, and it's cold and windy and unbelievable, and you're packed and it's like that all over, packed houses all over. No matter where we go because there's a movement going on. It's an amazing movement and it's something that's special. I left, I watched some of the programs it came out with new polls. I love polls when I'm winning. I love them. Believe me, if I wasn't I would not be -- if I was in second place even, let alone, some of these guys are in ninth place. I wouldn't even know -- I don't even know if I'd come here in ninth place, don't you sort of say, let's cut down on the trips, it's not going to happen at this stage, right? But NBC just announced this morning a brand new poll and Trump is leading -- oh, that's beautiful. Trump is leading in Iowa, wow, 26, Cruz, 24; Rubio, 13 and the rest are on keen road. But let's get to, let's get to New Hampshire. Actually, I want to -- CNN has a 33 to 20, Trump is leading. Then I had one that was less but it's not terrible that I don't believe it really because it was Des Moines registered, and I believe nothing they say. Almost as bad as your uncle who looks bad for you. When we discuss that makes that worse, run by people who don't know what they're doing but we won't talk about it. But here's what we're doing up here. So, just out, Trump, 30; Rubio, oh, that's interesting 14; then the rest of them are very bad. They're not making it. But here's one that I love, New Hampshire one, right? And now I'll put that's very accurate, 32 to 11, 32 to 11. OK. That's big 32 to 11. I love New Hampshire one. And CNN, I told you about South Carolina, that's a great one. That's a win, fantastic like this. That's been so strong from the beginning in CBS, 38 to 23 segment. And then let's go nationals for a second because they just came out. Reuters, 42, I've got to say it's like 15 people, right? 15 people. Of course, it's going down fast. I'd love to imagine there's a run for the door right after New Hampshire, maybe after Iowa. There's going to be a big run for the door. Some of those zeroes are going to be -- what are they doing? I mean, Bush, what is Bush doing? The guy has spent, think of it, the guy has spent $69 million. He just took $25 million in donor money. You know it's all donor money because these people have control over the candidates and they all take it. I'm the only one that's self-funding. Just remember that, the only one. I'm the only one, and I guess, well, we just took some buys, some pretty big buys, they said why'd you do it? You're winning by so much, why would you want to spend your money? I said because I don't want to take a chance. Number one, no one will want to take a chance. I don't want to be cute. And number two, I sort of feel guilty. All these guys are spending all this money and I haven't spent any. And I mean, literally, I didn't spend anything, practically, and I felt very guilty. So I'm spending money out of guilt, OK? Believe me. I did too. I see all this -- you see Bush, $69 million, Trump like nothing. Trump 42, Bush like nothing. I don't know. It's time, sometimes it's time for a guy like that to just go home, relax, take it easy, be with your family. He's got a nice family. Be with your family. Relax. So Trump 41, Cruz 16, it's actually now 42, 42, Cruz 16, Carson 12, oh boy, Bush, wing, a lot of people ahead of him. OK. On -- I do it with Bush because he spends so much time advertising. He advertise -- this guy's spending millions and millions of dollars on negative ads. It -- I turn off his ads I wouldn't hit him. I mean, the guy, he spends so much money advertising Trump, Trump, Trump. At least he uses good pictures of me. No, I look good. He had some, where I'm so young I said, man, I was really handsome. Look at those pictures. They're from so long ago. He's young. Awww, Fox News, Trump 35, 20, 30, I mean, oh, here's a good one, just came out, against Clinton, Hillary Clinton. I don't know. She could have big problems. Release Hillary from prison -- Trump 47, Clinton 44, we're winning by a lot. So that was that and have you read about this little truck stop with the famous paper, right? You know, you read it on paper the union leader. No, it's really on this paper though. It's terrible. So this got to rag. It's just, I guess, I mean, they have like 75,000 readers not so long ago when we had Mr. Ludlow running it. It was amazing. And now they're down to what? Around 10,000 and it's a -- I don't think they'll be -- personally, I don't think they're going to be the business much longer. What a useless leader, that's right. I read this stuff. I guess, look, I don't mind not getting an endorsement. They endorse somebody who doesn't have a chance, OK? He's a friend of mine but he's not going to win. But I don't want him to get in. But you don't do that and then ask Trump all these things. I mean, this guy drove me wild, Joe McQuay. He took -- we have, we're having, writes me letters. We're having a forum, meaning a debate of some kind. The day before the Fox debate. Now, who wants to do that? Everybody in the world was talking about the Fox debate. I'm supposed to show up with Vince Laura and I said I'm not going to do it because I'm not going to do it. So I was the only one that didn't show up. He was very upset about it. It bombed, very few people in the room, empty seats all over the place. The ratings were terrible, all right. Then he calls me up and he wants ads. So I give him some ads but I -- what am wasting my money for? You know you're rich for a reason. Even if you're rich you don't want to waste money. So we're looking to stacks of his paper, the paper, you know, not too good to put in mine. So we gave a couple but we didn't -- he wouldn't like that much long. So he says would you like to have lunch at my club? He has a club, nice club. I stood taking pictures for so long with all the people in there, with him. I had hamburger. It was excellent. But I'm standing there shaking hands with club members, nice people, great people, probably some here today. Anybody -- does anybody here from that club? It was very nice. Anybody here? Because I took so many pictures of that. So I did that and I did it as a favor and other things. He asked me if I would come up and make a speech on behalf of James Foley, I'd do that anytime. I think that was good. And then I made a contribution, a very big contribution to James Foley. And I think that's fine and I think that's fine but I came up by making a speech. I did a lot of things. Then we said, although it's strange, you know @realDonaldTrump. So I have millions and millions of followers especially when we have Facebook. It's like 5.5 million, 5.6 million for Twitter, over 5 million for Facebook, Instagram, I mean it's like 11 million, 12 million people. And then he said would you do me a favor? This was a few weeks ago, Chris Christie did not make the main stage. I would like you to do me a favor and tweet, tweet that Chris Christie should be on the main stage. I said but Joe, I mean, he didn't make it because he didn't make it, right? You know have to go through you have to have a certain number of points on the polls. Well, he didn't make it and he should be there, it's not fair would you do it for me? I said I'll tweet so I put out a tweet. What do we get Christie, what am I going to say? What do I do? I think I'm being nice but I knew immediately I was going to endorse Christie. Can you imagine a guy calling me up, knowing he's going to endorse a guy, asking me to use my Twitter to put an ad. And other than that -- I mean, the guy is bad news, OK? He's not a talented guy. Then I get a letter. You're not going to believe this, I had to take the glasses out because this is worthwhile to read. I get a letter from one of his top people. I just got it recently. It's from Amanda, person in charge for Robin Wilson, the union leader. Hope all is well, I thought they made a wonderful holiday season. Happy New Year, Amanda. I'm emailing today because I wanted to let you know about the special edition that we'll be doing just before the New Hampshire primary, it's called voters first. I have attached a letter that explains what will be included in the addition on the rate card, a rate card. They want advertising. This guy wants advertising. We just got a letter and it's a personal letter, sent out letter from a computer. It's a perfect edition for you. I really hope that you'll consider running an ad. Please let me know as soon as possible. Robin Wilson, Advertising Manager. OK. I'm saying I don't believe them, the girl walked up she said, Mr. Trump, what's going on around here? My girl was even surprised. She didn't even know about it. The -- this next page just -- letters to next page after that. I'm -- think of this. This guy is running the newspaper into the ground. I mean, you had a guy, the world is about this legendary guy. Look, two-page spread, $7,500. The back cover for only $3,500. Does anybody want the back cover of the newspaper that lost all credibility, huh? I'll take it. I'll give you $500. Inside that -- the union leader, OK? It's not the way you do business. I mean, the guy is out of control, thinks he's hot stuff. He's not hot stuff. So anyway, so I just had to bring this up. It shows the dishonesty with the media. It really does. The media is very dishonest. Although I have to tell you, Time Magazine did a cover story of me this week. It's one of the best stories I've ever read about myself but it's really not about myself. It's really about you. It's about a movement that's going on and I tell you what, I've been on the cover now of Time a number of times in the last three months. And then obviously, I should have been picked as the person of the year, right? I think the reason, the reason -- yeah, maybe next year. Hey, next year would be even better because if we go through then we could do things. But they didn't and they picked Angela Merkel who is -- do you see what's going on? And we talk about immigration. We talk about borders. Do you see what she's done to Germany? Just coming over, just before this morning, I'm watching television, the raids, the rallies, what -- what's happening is unbelievable. It's unbelievable. Unthinkable and they've been there for two weeks and the place is going to hell, and she got personally invited. I came in, I guess, I came in second. So they felt guilty so they gave me another coffee. But I have to tell you, you have to go out and get Time Magazine because it's talking about a movement of great people and it's a movement like they haven't seen. Many people are saying there's never been anything like this in this country, what's taking place, with us, not me. I'm a messenger, it's with us. Like an amazing, amazing thing and I'm very proud of that story because, you know, that was -- so usually is I'll get the story it'll be good but they always put a shot at it. You know, like they'll have three good paragraphs and then one total killer and then they'll have five good paragraphs and end in just a total killer. So you tell people don't read it. We don't want to read it because the killers make up. They have to do it because you know they have to do it and they're dishonest. But the Time Magazine piece and especially you know, Time is known as a pretty liberal deal going on there. This Time Magazine cover story is amazing and it talks about what we've done and when we've done. So OK, so let's talk a little bit about what we're doing in terms of the competition and then we'll talk about the problems of the country and how to fix our problems. And then basically, to have to fix the problems elect Trump as President, OK? Let me tell you a story. Do you know what we can do? That'ss right. President Obama, you're fired. That is an easy one. So -- thank you. Got to hurry too just to ask the question. So Ted Cruz has a problem. I mean, he's got a problem. If you know, coward Cruz will now brace them said he's going to bring a major suit and the suit is going to say that he wasn't born in this country. So whether you like it or not, Ted has to figure it out because you can't be having a nominee if they're after that -- I think I'm going to win very solidly to tell you the truth. But if you get the nomination, you can't have the person who gets the nomination be sued like Hillary might be sued, it's a different kind of she released the e-mails. But with the e-mails, she should not be running. Oh, I'd love to run against Ernie. I tell you. I would love -- I mean, can you imagine? when they took -- remember they took the microphone away? Get off the stage. They told him. This is our President, he goes like this, oh, excuse me. And everyone out there is saying get off the mic we want to hear him. He looked up like a little puppy. This is going to be our President. I would love -- please, FBI, please go after Hillary. I want to run against Bernie. Oh, that's a great number for this guy. He would make something as a 90% tax everybody. Does anybody mind paying 90% tax? You see with Bernie, you're going to have yourself a nice 90% tax. He wants to take it all away from you. You know he sort off dampening a little bit. He wants to keep it a little bit low-key. He wants a big fat beautiful tax, OK? And I don't think the people here are going to go for that very easily. But I want to run against Bernie. That's my dream. That's my dream. That's the one. That's the one I really want. But Hillary will be fine. And you know, the poll just said we beat Hillary, Fox poll just down with the other one. You know honestly, we'll take anybody. I think we're going to beat this. With the people we have, with the movement we have and we have by far the largest audiences. And in all fairness, Bernie is second but way down by comparison to the audiences that we get. We're going to Pensacola next week. They don't even know if they can happen it in the area. I mean, they -- the number of people showing up at Pensacola is unbelievable. But we had 20,000 people recently, 21,000; 35,000 in Mobile, Alabama; 20,000 in Dallas, Texas, the Maverick Arena filled up. I mean, it's unbelievable the crowds we get and it's only determined by the size of the space. And I want to thank the Fire Marshall because he allowed a lot of people in here today. There are people standing indoors. Nothing's going to happen but people standing indoors. But the Fire Marshalls, the Fire Marshalls are the most important people to me because they let us get more people in the rooms. And they -- every one of them, they'd be great. So I appreciate that. But Ted Cruz has a problem because the question is, is he a natural-born citizen? And the question was asked in a Meet The Press who was asked to be by Chris Wallace this weekend. And I said I don't know. I mean, nobody knows. And Laurence Tribe of Harvard who's a constitutional expert, one of the best in the country, said and I wrote it down, this is not a settled matter. It's wrong to say it is a settled matter because it's absolutely not. It's not a settled matter. That means that -- you know, a lot of people think that you have to be born here. You have to be born around in this land. Now, John McCain, Laurence Tribe represented John McCain, he was born outside of the United States but he was born on a military base to two people that were in the military. That's different. I would never question that. But in the case of Ted, he has to figure it out. Now I think he can go with some kind of a Judiciary proceeding and he has -- look, it doesn't matter what he does. You can't have a nominee who's going to be subject to be thrown out of as a nominee. You just can't do it. So if you're going to make that decision, folks. I mean, it's one of those little decisions -- I'm sure Ted is thrilled that I'm helping him out but I am. I mean, I am. I mean, he's got to go and he's got to fix it. Now one thing I'd just say, just to finish with Ted. So I have a very strong immigration policy. When I brought up immigration, I mean, it was brought up strongly in my speech, in my opening remarks and I said walls and all sorts of things, right? That's good. Well, you know, a low-key and his Admiral hit me. No, no low-key -- OK, ready? We will build a wall. Who's going to pay for the wall? Who? OK. So you people know what I'm saying. Because I've been saying this for a long time. So yesterday or two days ago, they showed me a catch plan and it said, said this, it begins by building a wall. It's amazing how far people have come. Then took up the number of Border Patrol officers. That's me too. Implement E-verify. That's me too. It's amazing and all these people. And by the way, Ted happens to be a very good guy. They're all good people but they all like -- you know when I was taking what Rush Limbaugh said, nobody hs ever received more incoming, OK? And it's true. When I announced, I said, boy, the two weeks I said is it going to be like this always? I mean, it was brutal. And then, all of a sudden, a lot of things started happening. Crime statistics started being looked at. Kate was killed in San Francisco, beautiful Kate, by an illegal immigrant, shot in the back. You had Jamiel in California who I -- I think his father's one of the greatest people. I got to know his father over this. And Jamiel Shaw he was a young man getting ready to go to college, a good football player, a good student and he was killed shot in the face three or four times by an illegal immigrant. Just walking down the sidewalk going back home to his father. You have the one woman in Los Angeles who is a veteran, 65 years old, rapped, sodomized, and killed by a person that should not have been in this country, an illegal immigrant. And all of a sudden, everybody's coming my way. They were all saying, wow, you know he's right. I don't have any -- I mean, do you remember how crazy it was? Macy's were totally -- we cannot have -- we're a member of inclusion. We have -- we consider ourselves a very inclusive and end up, they got fined $650,000 for all sorts of discrimination and they're always like being looked at. But as soon as I am -- not a big deal for suits and ties, who cares? I didn't like the ties that much anyway, they were made in China. No, but not ass disloyal as Macy's. I tell people don't shop there anymore and their stock is tube. Did you see what happened to their stock? Can I take credit for the fact that they don't sell my shirts and ties there? The company went to hell. It's unbelievable. Where they talked about inclusion but they have a fine for $650,000 because they weren't inclusive. OK, so you figure that one out. I love those I love it when something happens where like an enemy, right? They become enemies to me. It's just sort of, you know, very clear. But Macy's did a number on me and this -- their company crashed and that's from what? What were they? $75 down to like in the low-30s. That's not crash. And it happened that way with a lot of people that we're fighting. Do you remember? The Governor of Texas, Perry. He was doing fine, right? Yeah, and it happened with Bush. Look at the way he crashed. But they were fine and then they attacked me and then they all went down. Lindsey Graham was doing fine then said I need more points and he attacked me and he went down? Remember the phone number, right? Oh, all of them. I mean, Governor Walker, a really nice guy, Governor Walker. But he attacked me, I was his friend. I mean, he came to my office giving me a plaque before the election of course, not recently. And now they're taking me with them. Wouldn't it be nice if we had that in our country where somebody does something bad to us and they go down? That's what happens. So Macy's, Macy's went down and these people that attacked me they got that and that's a good thing and that's a good thing. Because you want to have wins. We don't have wins anymore in this country. We don't win. We don't win at anything. And I mean this guy named John H. Sinunu, who wrote an article in this only paper and they were so bad. I don't even know the guy and yet he's pushy but John H. Sinunu has been known -- he's been fired by Bush. I mean he was fired, right? Yeah. And he was fired like a dog. He was fired viciously and he's such a dumb guy that he doesn't even know he was fired. He go and -- he go and shows. It was interesting. He go and shows and he say the worst things and I'd watch him say these things, it's terrible but eventually, they had to fire him. Then he writes an editorial about him and it's nasty. You know the Kool Aid editorial, right? Thinkin' it'd go away. My life has been about success. It's been about building a great company. I even did the filing. Everybody was shocked because the company's far bigger, far better. I have some of the greatest assets in the world. Tremendous cash, tremendous cash flow, it's very little debt and I say that not to brag about the company. And I had to file this, you know, a private company, so everyone was, oh, maybe he'll not file because he'll never do that. First, they said he wouldn't run. Then they said, oh man, he ran. With the pundits, guys like Karl Rove total -- I mean, this guy's a stiff. They mention he knew Trump he starts shaking. I don't know why. I don't even know him. Karl Rove, George Will, take away your little glasses, do you know what I mean? Take away his glasses, he's got this little, tiny spectacles. Take away those glasses and he looks like a non-intelligent person but he's not intelligent. You know he was big into the war. Let's go win. Let's go win. And I was against the war, 2004 I came out strongly. Headlines, Reuters, I came out strongly but that vision could end the war in 2003. I wrote about Osama Bin Laden in 2000, in the year 2000 in my book. That Osama Bin Laden, bad guy. I saw it on television. I saw it on the papers. He was very threatening. I said they better take this guy out and he knocked down the World Trade Center two years later. And the one with the lotteries, Joe Scarborough said but wait a minute, you mean Trump talked about Osama Bin Laden before they were knocked out? And they said yeah, he did. And it's not even my main business. I said I'm a builder, I'm a developer, I'm a business person. That's not my main business but I talked about it. Why didn't the politicians know about it? If I knew about it why didn't they? But it has to build on a vision. I said don't attack Iraq because if you attack Iraq and I'm the most militaristic person in this room except for maybe Al. I think Al has me beat. You -- he has everybody beat, right? Huh? Am I good with the veterans Al? OK. I thank you. I am, I love the veterans. But other than that I'm the most militaristic person in this room but you had too know. I mean, I'm going to build our military so big and so strong and so powerful. It's the cheapest thing we can do by the way. Just so you know. It's the cheapest thing. General Odierno when he left he said that the Army is the least prepared that it's been and I think he meant from its inception. That's a long time. But essentially, he's saying the Army is a mess. So our military's in trouble. All the time in the real estate business I get listings on military bases for sale, another military. I get all these listings with these military property. How many are we closing up? What are we doing? We're closing bases? And we should have the most updated, greatest military. We protect all these other nations. We don't get paid anything, in many cases, if we get paid a little comparison to what it cost. For instance, we protect -- I love South Korea. We do a lot of business. I buy televisions, thousands of televisions from South Korea for projects. Thousands, they're all from South Korea. Then they make a fortune. Then they build the big ships. They build the big tankers. We protect them for peanuts. We have 28,000 soldiers right in the line, 28,000 all right and we have all these soldiers up and down the line. Why aren't they giving us a lot of money for this? I mean -- and then the bad man is over there talking about nuclear, nuclear, nuclear. We're protecting all these people and we get nothing. Don't we wonder why the country is in debt? We wonder why we have $19 trillion to which now we got a horrible budget that was just passed. That horrible, horrible budget where everthing happens, Obamacare is funded. All of these things. The Syrians coming in. The Syrian migration. No, no, think of this. The Syrian migration is funded. All of these things we can't do it. We can't do -- we can't afford it. We're not going to afford it anymore. We're protecting Saudi Arabia. Saudi Arabia, well, it was before the oil problem now they're making half but they're still making a fortune. But they're making $1 billion a day, $1 billion a day. We protect them they pay us peanuts. They wouldn't be there except for us and I say it's fine but we got to get paid. We've got to get our money back. Why are we doing this? Why do we protect -- you don't hear this from anybody else. You don't her this from these politicians. They don't even know about it. They have no clue and you know what? If they pay and reimburse us for the kind of billions and billions and billions that we're spending to protect other people that are in different parts in the world, if they paid us, we'll have a whole different balance sheet. You can have yourself Social Security without all these cuts want to have. You can even have your Medicare. We're spending so much money on such foolish things and if we had the right messenger you'd be able to get the money and be friends and be friends. You know, as an example, at the Iran deal. We're giving them $150 billion, $150 billion, we don't even get the prisoners back. We get nothing. We lost every single coin. We'd say we'd like to have the following and they'd say no. And they say, oh, OK. This is what happened. It took years to negotiate that deal. One of the worst deals ever. And think of it we don't get the prisoners. Now I would have done something different you know it's called the art of the deal. But it's not -- I mean, 90% of this audience, 90%, not 100%, maybe 80%. That's OK it's not insulting. I could have done a better deal than Kerry on that deal. I would say actually could be 100%, right? Who the hell in the audience -- who in the audience wouldn't have done a better deal? We gave them everything we get nothing. We gave them everything. I mean, we get nothing. Now when you think of it, we've made Iran a power but what else have we done for them? For years they've been fighting and fighting and fighting with Iraq. Iraq has the second-largest oil reserves in the world. We gave them Iraq. That's even better than the $150 billion. The $150 billion deal is peanuts. We gave them Iraq. For years they had the same power. Right now maybe they have the same base principles, huh? Well, the House says we got to trade. We gave them, OK? We took Bergdahl, a dirty, rotten traitor five people killed looking for them and they went out looking for him, killed. Five young incredible people. I've watched the parents so sad. So we've got a dirty, rotten traitor. They get the five most people that they wanted for nine years, OK? And those guys are back fighting. They're all back fighting, all right. Don't believe the news because they'll say, well, they're not back fighting they're resting. They're fighting. That's what they want to do. They want to fight. They want to fight. So it's just very sad. That's why I said I have to do it. I continue to stand -- I couldn't stand watching what's happening in our country. So many bad decisions. So much stupidity. And that's why I said I'm going to run. Think of this. If on the Iran deal just one deal you go in and you say to the other side, great negotiators, the Persians are great, have always been known as great negotiators. You say on the other side before we start we have to have our prisoners back. That way you have your message in a sense. We got to have our prisoners back. Got to do it, otherwise, no way. They're going to say no. And we're going to say got to have them back. They're going to say no. We're going to say bye-bye. Go. Double up the sanctions. Within 48 hours they will call you as sure as you're standing there, 100%, not 99%. They're desperate. They need money. They have no money. We just made them powerful and rich they're going to have nuclear weapons now by the way. We're going to have nuclear proliferation because of that deal all over the place. These people that do these stuff are incompetent. So now, they'll call us and then they'll say you can have your prisoners. Now we have the prisoners. Now you go back and can say second statement. First statement in business you don't want to break them up at the same time. Second statement, we're not going to give you your money. We're not giving you any money. We don't have it. We're a debtor nation. We owe $19 trillion. We don't have your money. We want to be nice. It's always nice. My father used to say take the lumps out. So you take the lumps out. Do you know what the lumps are? We want to be nice. We don't have to put it -- just say we don't have it. We don't have the money. Sorry, We wanted to give it to you. I'd like to give you your pork. We don't have it. They'll go crazy. Everything in-house. Don't worry. They won't get the money. I'd guarantee. If I were President they won't get $0.10 of that money, not $0.10. Then we'll get the best. And then these make it and wouldn't agree to the 24-hour, you know, how about the 24-day inspection, OK? They'll have 24 days and that doesn't start because I see the man shaking his head. You know that good-looking guy down there shake his head. He shakes his head because it's impossible to believe, right? And the clock doesn't start ticking for, it could be for months. So that thinking ought to -- but the best is they have certain sections where they self-inspect. So Iran's going to self-inspect. And when we say I hear there's some activity going on. Well, we will check and we will tap you. Next thing, no, we didn't notice any nuclear weapons being made. We are being led by the world's dumbest people. Now a lot of the people think that there's something -- you know, something secret's going on. I don't happen to believe that, OK? A lot of people think they can't be that stupid. I don't have to -- I think they just incompetent people. I think they don't know what they're doing. I mean, look at what they've done for his show, his show this is -- the deal for this show is the worst. OK? The worst. So we're giving our country away step-by-step. Now we have the migration. I mean, look at the migration. Now one of the reasons that CNN are taking all those cameras going back there and so I have to be extremely careful with what I say but CNN does these polls. You know I don't have pollsters. I say what I say. Whatever the reason I say it. I'm a smart guy. I mean, we're smart people. I say what I say. I don't want pollsters. These people will never have ever said that we have radical Islamic terrorism. We have to find them. We have to do something. These politicians, I mean, they don't talk about it. Obama refuses just to even say what the problem is. You can't solve the problem. You can't solve the problem unless you're willing to talk about it and open up a dialogue. So now, well now, so it's coming at me, I'm looking at Germany, hundreds and hundreds of rapes on New Year's Eve. This is Germany. It's Germany. They have a problem. She went off the -- I don't know what happened to them. She was doing well. Maybe she had power-hungry. Maybe she thought she was invincible. They're taking in people. The crime is astronomical. It's not working. They're heavily riots now in the streets. And the Germany people are saying we've had it. We've had it. We can't let that happen to us. Obama wants to take thousands and I think that the 10,000 -- don't forget they say 10,000, it's just the beginning. Because if you remember in the debate, in the Democratic debate, recently, the last one they were talking about 55,000 or 65,000 and now all of a sudden Obama is talking about 10,000. Believe me, even at 55,000 or 65,000 I have heard that they want to take 200,000 that's what I heard. But whatever the number is I don't care if it's 10,000 or 2,000. And I have a big heart than everybody and anybody and you can do a beautiful area in Syria you call it a free zone. You hear the words you call it an area of where we'll protect, where we'll make possible for people to live until they hopefully, someday go back to their homes. So it's very important. It's very important. Hey, get him, get him out of here. We're in a meeting. Get out of here. Go ahead. He must have been a funny guy because he only wants jokes. There's nothing funny about this. This is so serious. Out, out, out, out. Get out of here. He's got a lot of -- yeah, he says he loves it. Out. I can see he's got a different -- he's got a very serious problem. Take his scope. I saw that when he came in. I love you, I love you. You're the greatest. I love you. Yeah, we got to get the right in this. It's time to leave us. Time to leave us. We've got so many problems. We've got so many problems. And we got to get them solved. And if we don't get them solved, we're going to be in a very serious trouble. So you build the zone, you take care of it. But if I get elected, I will tell you, everybody has to leave. They have to leave. They go out. They have to do it because if we can't help the problems that they have. I mean, when you look at the world, you look at what's happening. It's incredible. So when the journey started, I came down the escalator, I talked about illegal immigration. We talked about it. We talked about it very, very strongly. And it's all part of the whole plan. When they knew the calls, they come out and they come out strongly and they say, for immigration, for terrorists, for military, for ISIS, Trump is way ahead of everybody else because it's sort of all on that same ballpark. We've got to protect the borders. We do have to build the wall. We're going to build the wall. It's going to be a great wall. People aren't going to come in unless they come in legally. People can't come in illegally. You have a tremendous heroin problem here. It's an amazing thing. Every time I come up to New Hampshire, which is a lot, I talk to people and one of the first things they mention as people on the outside don't think of this. But you have a tremendous heroin problem here like it's incredible. And I don't really understand it. And a lot of people don't understand it but you know where it's coming from. And it's spreading far beyond this area. And it's such a serious problem. And young people and older people too are becoming totally addicted. We're going to stop it and there we're going to work in helping the people that are getting addicted. We have people that are fully addicted. And we have to work because they're not doing enough work to help these people. We have to work on it. So I'm going to tell you few questions before we start but I just want to mention just a few more things. So Obamacare, better to repeal it and then revise. They have to happen. Thank you. We're going to repeal it. We're going to replace it. We're going to replace it with something that is far less costly for you and far less costly for the country. Your premiums are on a 25%, 35%, 45%, your deductibles are through the roof you won't even be able to use it. Obamacare is a failure and it's going to fail in '17 anyway. We know that it's going to fail in '17. So Obamacare is out. Common Core, Jeb Bush wants Common Core. How the hell did he want Common Core? Not that we tap. Two things that I remember most of that Jeb from Durham because people thought he might win. Then they found out he doesn't know too much. Common Core, we should favor the country for another 212, children educated from Washington instead of the local groups that do such an incredible job -- and I have seen them all over the country. 10 times better. And on top of that, if you look, we are the 20th in the world in education and yet we are number one for people in progress, OK? So how's Common Core? So Common Core is out. And the other thing he said is they come across the borders, an act of love. And I said wow. Tell the people that have had tremendous problems and crime to their family, tell them they come as an act of love. So they don't come as an act of love, believe me. So we're going to solve those problems. I want to take it, and maybe I'm going to start with Al because Al has been so great. But we're going to take a few questions and you can just shout them out. I don't know if they get the mic, it's too hard to get them back. But, Al, do you have a question? Right. Right. Right. Yeah, I know. Well, a lot of people have said the Marco Rubio has signed the Bill but he hasn't seem to go to Washington to get it passed. And he's using it as leverage at this point. So that takes a lot of -- one thing I'll say, an I think Al will tell you this, I didn't know the veterans' side in two years. I have seen what's going on with the VA. If you take a look at the clinics and you take a look at some of these places and you see the corruption the desire to stay. But I will take -- I think you have good confidence that I will take care of things. They're not -- the politicians are not going to bring it that way. Yeah, we are confident we're going to get it done. We're going to get the right thing, that we put it -- yes, ma'am, go ahead. You have one? Go ahead. Hi. Amy. How are you? Great. Thank you. I was wondering what you are going to do if elected as far as regarding Obama's Executive Order on gun control. We're going to get it terminated. Look, I'm a big Second Amendment guy. You know, I'm the best example there is on the Second Amendment. If you look at Paris, if you look at California recently where 14 people were killed, if you look at Paris where 330 people are more to follow this assault, so many there were so badly wounded. If there were guns on the other side with the bullets firing in the opposite direction, you're not -- you'll have -- people killed like you're not going to have 130 people. They said to these people Paris has the toughest gun laws in the world. France has the toughest gun law just about in the world. Canada, unless you're a bad guy, then you can just carry a gun. These people were told, get over here, boom, boom, boom, boom. Went on for so long they were so defenseless. The military, how about the military base a year ago, right? We had five soldiers, a couple of them were world-class soldiers, great people with the guns and the rifles like the top of the line. It was a gun-free zone. This whack job walked in, looked at these five soldiers and just boom, boom, boom, they couldn't do -- these are the top people. On the military base, I would end that immediately. I would end that immediately. I mean, immediately. And you know we never lose. Gun-free zones, that's why it can't be. When these sickos see a gun-free zone, their eyes light out. So that's who I am. All they are going to need is take little chunks out of the Second Amendment but the truth is they've got plenty of ammunition already but the Federal government does a very, very poor job of watching what they already have. They want to keep taking away, away, away and all of a sudden, the bullets I heard a rumor the other day, they want a nab but they can't do the guns, so they want to start taking away the bullets. They want to make the magazine where it holds less than one bullet, OK? You know, I mean they want to make everything impossible but the end result is, you take a look, and I could debate this a lot with you people. I'll talk about Paris. I'll talk about California. And they can't win the debate. They always lose. And then our problem next is they'll say if you agree with me, well, no, no. You know we need protection. We need protection. The Second Amendment -- and you need Trump here. The Second Amendment, the Second Amendment will be the way it is. We are absolutely going to protect the Second Amendment. OK, where's he at? Go ahead, go ahead. Thank you. I want to carry a large voter for you today, but I should be back. Oh, you've voted for me already. I love you too, Terry. All right. That's enormous. Thank you. Thank you very much. I wish -- I hope the military can go out. Al, maybe you can lead a group and maybe you can bring that gentleman. What's your name? Dennis O'Shea. Thank you, Dennis. See, he already voted. I love that. No, I didn't vote. Oh, can't hold it. Who cares, hold on, Carol. Carol, I like you more than Dennis now. I hope you're in New Hampshire at the time of the voting. So I wanted to make sure I got my vote in for you. Thank you, Dennis. Thank you, Carol. He wants the military, I'm sure a few of you got some extra added access. If you can get in right now and if you vote, you could see our people and you could see Al. But if you could get in and vote, it would really be helpful. Yes, sir. Go ahead, go ahead. Do you think now Bill joined Hillary? Well, Bill joined Hillary. So far, it's not working and you might know it as well. So far, it's not. Hey, look, I wish him the best. I wish him the best but it has not been working out very well. He had some major issues. Yes, go ahead. I'm frustrated with inefficiency and lack of cooperation in the government and there's a lot of people working on both sides. How are you going to encourage bi-partisan cooperation in the government? It's a great question. You know we have things right now that everybody in liaison versus this $2.5 trillion at least outside of this country wanting to come in. That's owned by business. It's business money. And the businesses -- everybody agrees, Democrats, Republicans, we should do it. So in years now they can't agree. They agree but they can't get it done. What that is is the lack of leadership. One other thing, I thought that Barack Obama -- one thing, would be a great unifier. He has turned out to be a great divider. I'm a unifier. People don't understand that about me. I get along, in fact, before I was a politician, I get along with the Democrats, with the Republicans, with the Liberals, with the Conservatives. I get along with everybody. People say, oh, he get along with them. Of course I did, I'm a businessman, I get along with everybody. I'm a unifier. We have amazing people in this country. We were very, very divided. We will unify this country and we're going to have spirit in this country. We have a great country. We're going to the , we're here. We're going to do what's proper. And we're not going to be laughed at for being stupid. We're not going to be laughed at for doing the wrong thing. We're going to be strong. We're going to be really something special. We can be -- I'll actually say -- you'll not say Make America Great Again. And sometimes I'll say, I actually believe we can make it greater than ever before with proper leadership. My other side of that. We can't go, however, for another four years of essentially Barack Obama because that's what Hillary would be. And I think Bernie Sanders would be the same thing. I mean this guy is totally advocate. So we just can't do that, otherwise, you'll not going to have a country left. OK. Yes, sir, go ahead. Yeah. Hillary said she wants to declassify, a very freaking line, military secrets. Do you have anything to say about that? What she wants us to declassify because she wants to see get out of the trunk. She's got them selling them out she's got them in such a beat. Look we have to, I mean, she seems intelligent. But I also have something that is incredible, something that's smart as Hillary and they said what she did is -- there is no answer to what she did. You know what is amazing is that other than greed, there is no -- what is she doing? You just use what you're supposed to use, and you assume people listening. Who the hell cares? And you do what you have to do. All of this or what? It's greed. It's really just greed in some way. All she had to do is just do what you're supposed to do. It would have been so easy. So you know, I could imagine. I think that's a really bad idea, declassify everything. OK. yes, sir. Go ahead. All of us, senior citizens, are on social security checks and we didn't get a raise or any kind of call or issue and our Medicare costs went up. What will you do with those personally? So what we're going to do is we're going to bring jobs back into the country. I'm giving everybody a tremendous tax cut. We're going to make our country really vibrant again. My tax cut has been received so well by so many people. Some of the top, Larry Kudlow, some of the great people that really understand what's happening. We're cutting business taxes, we're cutting middle-income taxes. The middle income has been driven out of this country. It's been so unfair to the middle income. We will bring our jobs back from China. We will bring our jobs back from Japan and from Mexico and from Vietnam, it's a big place. And we'll get to see what's going on in the Vietnam. And they do it with devaluation. They devalue their currency and our people don't know what's happening. They don't get it. They don't know about business emergence. They don't know about corporate convergence, they don't know what's happening. Our leaders don't know what's happening. The U.S. corporations now legal in the United States are taking all of these jobs and dropping them and move them out of the country. You know like we used to move to Florida or we'll move to some place, they don't -- they think about leaving United States now. We're going to make it strong again and we're going to save the social security. And nobody else knows how to do it but me. Well, that's what I do. Yes, sir. Go ahead. Ronald Reagan was able to get out, prisoners released the day before he was inaugurated. Can you do that for us, too? Well, the truth is this, yes. I say this, very important decision for me. They will be gone, they will be out of Iran before I take office. If they're not, if they're not, Iran will have vow to pay. I can tell you that. OK? Iran will have a vow to pay. They will meet the four most prisoners in history. That I can tell you, OK? We got to let them out. You know just to even make that standard and now they'll probably do that anyway. So they're going to have the prisoners released here. But Iran announced just recently that they are now willing to talk about the prisoners. But we want a lot, we want a lot. Can you believe it? It's so sad. And all you have to do is say we want our prisoners and they can walk through, 10 minutes, and you will get back your prisoners. But now they want -- now they're willing to talk. And they say it like we're so stupid. We are willing to talk but we want a lot. Can you believe that? So that's very sad. I mean, honestly, there's so many sad things. We all have a good time but the truth is we have a very negative topic because there's not a lot of good things happening. One of the point, middle-income people, and people -- people on the labor force essentially had not had a raise in 10 years. You know that, right? They haven't had a raise essentially in 10 years. That's just not a beautiful statistic that just came out. OK. At the back, go ahead. What's your opinion on North Korea possession of a hydrogen bomb? North Korea possessing the bomb, they don't know if it's hydrogen bomb yet but it actually a bomb and they said, you know, he's a wild man, he's a maniac in probably most ways. We have China, at the onsets, that's taking away tremendous amount of wealth from the United States. We have rebuilt China. It's been one of the greatest robberies in the history of our world. What China has done, they have taken our jobs, they have taken our base, they have taken our money, they have taken so much. And I get along great with China and I get along great with the people. They buy your apartments. They give you tens of millions of dollars for apartments in New York. I like the China just like I can get along well with Mexico, but the Mexican and China and almost every country, they're leaders are too smart for the people that we have. Carl Icahn endorsed me, great businessmen. The business overall love that. I mean, the ones that don't are giving money to these other candidates so they can totally control them. Because I can't take any money and I don't take any money. I just -- I have turned down so much. I would make Jeb Bush 100 -- can you imagine just having $125 million? You just want $25 million worth of ads and he said $2 million or $3 million or something. Can you believe this guy? I would make his $125 million look like small potatoes like $2 million. I would have the biggest fund in probably everything. These guys can offer any amount of money and I'll say, I don't want it. I don't want it. I'm going to do this right because once you take that money, you're controlled. You know, even if it's not, from a legal stand, when you are mentally solo flight, you all failed. And then what you do is you start doing things for them, not for the country. We're going to do things for the first time, maybe ever, we're going to do things for the country, we're going to do things for you. We're going to get it right. OK? A couple of more. Go ahead, darling. Mr. Trump, I want to know what role in protecting the environment and pursuing a safe energy will play in making America great again? Well, we have to get the President. You know, the President talks about the environment, as you probably have noticed. More so, if you remember, global warming is far more important than ISIS and all of the enemies we're having the one who brought this on which is rather incredible, in all fairness, special. So when we talk about the carbon footprint, OK, and how important the carbon footprint is, I'm not supposed to use air spray in my hair because it affects the ozone. Now it fits in an apartment that is totally sealed but it goes up and it affects the ozone. I don't think so, personally. But you know, this affects us. There's a lot of money being laid on this in that sense, OK? So what happens is the purpose of this the carbon footprint, and then it gets into East Coast, released into an old Boeing 747, Air Force One, with the old engine that just spew out more stuff than you've ever seen. And it flies towards his family to Hawaii, to a yacht, and then he flies back. And the old 747 spewing out in the air and then he gives a speech on the environment and on the carbon footprint. Give me a break. So you know what I want, and I had to say because I actually received many environmental awards because I have developed so much of that but I have received a lot of environmental awards but what I think I want really crystal-clear, beautiful, healthy water and I want really clean air. That's what I want. That's what I want. That's what I want. OK. How about -- this guy has really nice question, really good. I like this guy. Did you give me the Bible? Did you give me the Bible? The man gave me a Bible, what, you asked me this killer question. Go ahead. Go ahead. It's going to be unbelievable you might even want to know the answer. So can you tell us the three countries on the face of the planet that is not in the Romantic system? I'll tell you if you didn't know. You tell me. Go ahead, you tell me. North Korea. Right. Iran. Right. And Cuba. And there's another one. Is there? Yeah. I thought there were three. Good. Thank you. How did you know so much about ranking? I study law in Good. That's good. Do you have them in general or do one of them? No, actually Yes, ma'am. Go ahead. Go ahead. I'm going to ask you the question my sister asked in 1984 Ronald Reagan. The question was when you win the election, can I go to the inauguration? So let me ask you, what did Ronald Reagan say? But of course. Give your personal information to the guy over there. OK. And did she ever get there? She did. Did she get there? She did. She let them there. Wait a minute, did he remember that? Well, they obviously did because -- No, no. But did she actually go? Yes. All right. Then I will give you the exact same answer that Ronald Reagan gave. That's a very, very expensive , very very expensive. So I want one more. One more. Go ahead. What the environmentalist leader Bill McKibben says that to save the planet America needs to stop growing the economy and live more like Ethiopia. And -- Actually, he wrote that very well for me. And limit their family to only one child. What do you think about McKibben? OK. We'll take another question. It's fine. We got to end with a better question. OK, who's got a good one? Do you have a nice question? Go ahead. We have to end -- at least we have to end with a nice question. And nothing wrong, in all fairness, but in Ethiopia, we don't want to place our whole world in Ethiopia. I'm sure it's a wonderful place. OK. It's really just a comment and that is based on what you said for the lady over there about the inauguration. You are a really nice guy. I love it. I'm going to leave it at that. I mean how can't I feel excited about that, right? That's right. I appreciate that. And he's a tough cookie. I look at him and say he's a tough cookie. Look, we are going to Make America Great Again. We're going to win. We're going to start winning. We don't win anymore. We're going to win so much. We're going to make our country great. We're going to win with the economy. We're going to win with health care. We're going to win with our military. We're going to win and you'll going to be so proud. And I'm going to do a great job. And I'm working, I'm not taking anybody's money. I'm not influenced by the lobbyists, by the special interests like every single other candidate because I'm the only one who's spending my own money. We are going to win together. Go out and get Time Magazine, you'll understand it even better because you're a part of it. This is a movement that's going on. It's a beautiful, beautiful thing. I love you all. Thank you very much. Thank you very much. Thank you all. Thank you, everybody."}