{"id":480,"author":"Donald Trump","title":"Speech: Donald Trump in Ottumwa, IA","date":"2016-01-09","link":"https://factba.se/transcript/donald-trump-speech-ottumwa-ia-january-9-2016","paragraphs":["Clobbered and all of a sudden he said, \"Oh I'm for ethanol.\" You can't do that, you can't do that with you know, three weeks ago you're not allowed to do that. So nobody really believes it. But you know I've been there. The folks, the ethanol folks love Trump. They've been very, very supportive of me and I love them and I think it's very important that they carry it out.","And I'm not a guy that just said it today and I'll say you know because that's a big change in my opinion. That's a very, very big change. OK, very important. So let me go over some of the numbers because I think they are important and I really want you to understand that and who was going to last longer.","Go out. I think you know when you see the cover of Time I've been on the cover of Time now. Sort of like three times because I was on the year-end review. I was on and I should have been on the fourth. They picked Chancellor Merkel. Poor Germany, they're rioting right now in the streets of Cologne, rioting.","What's gone on is unbelievable with the crime, with the rape, with what's going on in Germany is unthinkable. There was a country that didn't have these problems, but they didn't know about these problems. And I don't know what went on. Millions of people coming in and what's happening in Germany is unbelievable.","What's happening in Paris is unbelievable and I'm not talking about the attack. I'm talking very simply about Paris is not the same place. It's not the same place. And we better get smart. We allowed two people -- we allowed, right? We better get smart now. We got to get smart about and you know I've taken the attack.","First of all when I announced I came very, very strongly against illegal immigration. Did I take Heat, Rush Limbaugh, everybody said never has anybody received so much incoming and I understood. Believe me, I didn't I said is it going to be like this for six months. That's a lot for six months. Within two weeks all of a sudden people are saying, \"Well you know he's got a point.\" But then they had beautiful cake in San Francisco and she was killed.","Shot in the back by somebody who came in five or six or seven -- they have no idea. At times I wonder whether or not he was pushed in because they didn't want him. And they're smarter, you know, their leaders Mexico, China, all over the leaders are smarter, more cunning than our leaders and they do things to us that we don't even know is happening.","But all of a sudden Kate, she's killed. Jamil in Los Angeles was killed, a veteran, a woman, 66 years old, raped, sodomized and killed a few weeks ago in Los Angeles by an illegal immigrant. And this is three instances all over. All over. Not even to mention the jobs and the economy and all of the other things that are happening.","So we have to get smart. And what happened there is all of a sudden people are saying, \"You know, Trump might be right.\" He might be right. Now they're all saying, \"Trump is right\". Now illegal immigration, what's true? If I didn't bring up illegal immigration you wouldn't have me talking about it today folks.","I brought it up. I took a lot of heat and then it's people are realizing what a big problem it is now. We're going to have a border. It's going to be a very strong border. We're going to have a wall because walls do work when they're real walls. We're going to build a wall. Mexico's going to pay for the wall because they make a fortune.","Mexico's making a fortune. I respect Mexico. I have thousands of Hispanics that work for me. Over the years, I have tens of thousands of people working for me but I have thousands of Hispanics, thousands in Nevada. Just recently I won the poll. Hispanics are voting for Trump and I said that was going to happen.","The people that are here legally, the Hispanics that are here, let alone the Hispanics that are here legally, they're voting for me. And I've been saying this and then all of a sudden they announce it. \"I can't believe this. This is really surprising.\" I easily won in Nevada with the Hispanics and I'm going to win a lot of places with Hispanics.","African-Americans are with Trump. They're going to be with Trump. The relationship I have with the African-Americans is great. And actually one poll came out at 25% and the amount this is for the Republican Party which is a very unusual number because usually it's 5%, 4%, 6% maybe 7%. They say, \"Wait a minute, if Trump gets 25% of the African-American vote, the election's over.","He wins! he wins! You know, he wins\" because they're smart. They know I'm bringing jobs back from China. I'm going to bring jobs from Mexico. I'm going to take our jobs back. We're going to start making things. you know Newton. I was very much involved with Newton, a number of years ago is on 60 Minutes.","And I so I was happy you know that right. And I helped a lot of people in Newton and I just thought I was watching 60 Minutes, I felt so badly where people are moving to Mexico for the most part. Companies are moving out and Newton was treated very unfairly. And that's one community. But we have communities all over the country that are being treated unfairly and frankly you know we have corporate inversions where companies are now going to move out of the United States are going to leave the jobs behind.","They're going to other places all over the world. Pfizer's moving to -- Can you believe it? They're moving to Ireland. They're going to leave thousands and thousands of jobs. Two and a half trillion dollars right now is offshore. It's outside of the United States. I think the number is actually much bigger than that.","You know when the government gives you a number they don't know what the hell they're talking about. They don't know. It's true. They don't know what they're talking about. I think it's actually, you know, you can't get the money back in so they have money sitting outside -- outside of this country. Everybody agrees.","Democrats and Republicans, Senate should come back in and use it for jobs and things in this country. They can't bring it back in. They can't agree. So they agree but they can't sit down around the table and get it done. Everybody agrees it should come back in. They can't do it because we have lack of leadership.","We have a president that's not a leader. So now what's happening? Not a leader so, so now what's happening is companies are moving out of the country to get their money and to get lower taxes and other things. My tax plan by the way was put in. Got great reviews. We're lowering the hell out of the taxes for businesses and for the middle class.","We're going to lower it. We are and we're also simplifying the system. You're not going to need H in our block anymore and give them half of the money you have. We're going to simplify the system. It's going to be so simple. But your taxes are going way, way down and the middle class has been forgotten about in this country, has been totally forgotten about.","The farmers have been forgotten about. If you think about it. No, I mean, I know, I know farmers I have some great friends at a farm, you know when somebody dies in the family when they die they can't pass things on because they're sort of rich but not necessarily in cash and they have to pay so much estate tax that they have to sell the farm in order to survive.","And if they hit the wrong cycle or the wrong timing they can't sell the farm. They end up losing everything. So we're going to change that. We're going to change the whole estate tax thing. It's not fair and farmers in particular. It's not fair so and one thing, I have to also say, \"Look ,I know a lot of people on Wall Street.","I'm self-funding my campaign. I don't need any of their money so I couldn't care less, OK. I couldn't care, I couldn't care less. And I will tell you every single other candidate other than me is getting tremendous -- you see the money they taking in? Now I'll tell you I'm good at that. You know I've always taken in money.","I like money. I'm very greedy, I'm a greedy person. I shouldn't tell you that I'm greedy. I've always been greedy. I love money, right? I take it a lot. I made a lot of money. I'm worth it. If you would have told me what I was at the Wharton School of Finance that I would have done, what I've been able to do, I wouldn't have believed it but I built an unbelievable company, very, very little debt, tremendous some of the greatest assets in the world, tremendous cash flow, tremendous cash sitting there.","I filed my papers with the Federal Elections. Everyone said, \"Well maybe he's not as rich as we think so maybe he'll never file.\" But I filed. In fact I would've filed if I didn't run because I want to brag. I love to brag. All right. But the truth is in business and there is OK in business. You want to be a little bit greedy, some greedy.","I want to give all that up. I don't care. You know my kid Ivanka. Good kid. They're all good kids. They'll run it. I have great executives. They'll run it. It's easy. It's gonna be easy. But you know what? I want to be greedy for a country. I want to be greedy, I want to be so greedy. I want to be greedy for our country.","I want to take back money. I want-- you know where we are right now? Japan, $1.5 trillion dollars. They have our debt. China, $1.7 trillion dollars. You know what? It is trillion. Think of it. Japan comes in. They sell us cars. They make a fortune. Millions of cars. They devalued the hell out of their currency over the last couple of years, by the way, just so you know, it's very hard to compete with them.","You would just have to ask Caterpillar tractor about that. Caterpillar tractors have been having a very hard time competing with the yen because they devalue the yen. The dollar goes up, the yen goes down. They can't compete. They can't compete. Look what's happening to Caterpillar. Look at John Deere. I love John Deere.","You know I'm one of the larger customers of John Deere. You don't even know that I buy millions of dollars of stuff. I buy millions. I would say over the years, I mean, I think the number is even lower but way over $10 million dollars' worth of John who knows that about Trump, right? But I buy a lot of stuff.","Tractors all over the place and the product is great but it's tough when an American company has to compete with other countries that manipulate their currency like Japan, like China like other places. OK, Vietnam, watch Vietnam. They are doing a number but these countries are totally, they couldn't care less about us. You know we want to do something that's good for the world, that global warming good for the world.","Watch Obama talking about the carbon footprint? And then he flies over to Hawaii in an old 747 with the old engine spewing the hell out of it and then he gives a speech about global warming and the carbon footprint. Now think of it. Think of it. And he's played a lot of golf. He's played more than most PGA touring professionals play.","Seriously. He's played a lot of golf but he was over there for a long time. But think of it gets into Air Force One which is a very old Boeing 747 with the old really big engines. And if you're a believer in carbon footprint you don't like this, right? I mean how many people believe in the carbon footprint?","Huh! I'm shocked. I'm shocked. I was just given a bill. I flew my plane into a certain location. They sent me a bill for $2,200, a carbon tax they said. What a scam. What kind of a scam is this? And my plane's a good plane and it's efficient. But think of it flies a 747 to Hawaii and back and then he gets up and gives a speech about global warming.","You know, give me a break. I mean there's not one person in the whole room that talks about carbon. OK , look we're going to protect you. Nobody's going to attack you. Seriously, who believes in the carbon footprint? One. Oh, Al Gore. And you know where he is now, right? Do you believe in it, too? OK. So two people out of seventeen hundred.","I'm with -- I'm with the seventeen hundred. OK. I thought it would be more than that. I mean I thought it would be more than that but I think you know if you're going to play the game you're got to play the game. OK. So and you can't you can't be doing what he's doing. So anyway, so on some of these numbers.","So Reuters, Trump: 41.1, Cruz :16 figure that Carson:12. Oh poor Jeb. He's way down. Wow! He spent $68 million dollars on his campaign. I won't even tell you what his number is. It's so ridiculous. OK. Think of this, FOX last night came out with a poll, a nationwide poll, Trump: 35, Cruz: 20, Rubio: 13. And the rest are all quite low.","That's good. But here's one that I loved. Trump versus Hillary Clinton. Has anyone heard of Hillary Clinton? Has anyone heard of Hillary Clinton? Oh it's so terrible, what Mr. Trump is saying. I don't like his tone. We have people, their heads are being chopped off all over the Middle East. She -- She's worried about tone.","We need tone. Believe me, we need tone. We're tired of these politicians is weak, I'll tell you what I'm doing this. I didn't need to do this politically. I had such a nice life. It was good. The company was good. The family's nice, everyone's good. I love everybody. I had to do it because I'm so tired of these weak, disgusting, corrupt politicians that we have running our country.","That's what it is. They're corrupt. They're corrupt. And remember this. A lot of deals like the Iran deal but a lot of deals. There -- you think that they're stupid. The politicians and many of them are -- but many of them are just corrupt. They take their PACs guys. Put five million, seven million, two million, one million into Bush's PAC and Hillary's back and Marco's PAC and all of these PACs and frankly, Ted Cruz has you know, two guys that have given them a fortune.","One is oil and one is something else. Remember ethanol, you're not protected. I guarantee you that. I guarantee you that. But Ted has guys. They're all but every one of them. They are people that put up millions and millions of dollars. Those people control those candidates. OK, so if it comes to a vote and they need to put up their hand, that's good for the country and these people don't want him to do it. They're not doing it, folks because they want them to be there for the next election.","What a politician is really good at is getting re-elected and continuously to get to the right source. Remember this, seven months ago I was a big donor. I gave 350,000 to the Republican Governors Association I gave. I mean it was like crazy I give to everybody. I even give, I give to Democrats, I give -- I give to everybody.","You know why? Because when I want to call somebody when I need help I'm not, I'm a business man really successful I go. Everybody likes me. And it's the way the system is. And I don't say it's a good system and I'm not saying that's even a bad system. I'm only telling you. I'm not taking anything and I can't be, I have to do what's right for you.","Remember that I have to do what's right for you. You're the only one I'm working for. And you know I've always been told that a very successful person can't run for president. I've been told that and I understand, I've done hundreds of deals, hundreds and hundreds and hundreds of them. That's what I do. My whole life is deals coming out of my ears that come in all over.","I mean I did hundreds of deals and they've been for the most part, great. And when they were bad in fact, a couple of guys wrote about a recent deal when they were bad. I made them good. That's a sign of a good business, guy. Sometimes you know they're bad because the economy changes like Atlantic City.","You read about Atlantic City. I made a lot of money in Atlantic City. I mean I made a lot of money. One of the very smart guys said Atlantic City cop walked away with a fortune. I made a lot of money now. I used every single trick in the book and this and that. But you know if you're on my side you want to be on my side because the economy went bad.","The politicians destroyed Atlantic City. Lots of bad things. And yet I made. I came out great. The sign of a good businessman is when you take -- or woman is when you take something that shouldn't work and make it good. And I've taken deals. You know it's very important. I've taken deals where I'd have things in the middle of a depression.","All of a sudden you know, you have a building has gone up. Things are great. Then all of a sudden, being the politicians or something happens, where the world collapses and you go from having strong times to bad times and you're in the middle of a project when you can take those jobs and make them good. That's the sign of somebody that you want on your side.","And that's what I do. I make things good. So and Atlantic City is a story like they did a story recently in the front page of The Wall Street Journal was actually a good story. It said Trump made a lot of money in Atlantic City. And you know people say, \"Oh I know you did great but you didn't do great in Atlantic.\" I did great in Atlantic.","I made a lot of money but it was always a fight because it was always behind the eight ball. The politicians were always making stupid decisions. They didn't fix the airport like they were supposed to. They wasted tens of millions of dollars doing the wrong thing. They built that convention center in the wrong location.","I said, \"Don't build it there. Build it on the boardwalk. Expand the existing. You'll spend one third the money and it'll be three times the size.\" They didn't listen to me. Probably somebody had a deal over in the other area where they owned some land or whatever crooked politicians all the time. And you know they built in the wrong location and they destroyed it. Atlantic City suffered but I said when I saw the stupid moves being made.","I did a lot of thing. And plus I got out seven and half eight years ago which was great timing actually the smart people give me a lot of credit. I only tell you these stories because you're about to pick somebody. We're a country that has $19 trillion in debt. We're in trouble. There's a bubble. You see the stock market is starting to you know, see what's going on, right?","Some of these people are shaking their heads like this. You know that because they're in the stock market. But it's starting to have some very bad weeks and some very bad numbers. I tell you because I'm really good at that stuff. I know Wall Street. I know the people on Wall Street. We're going to have the greatest negotiators in the world but at the same time I'm not going to let Wall Street get away with murder.","Wall Street has caused tremendous problems for us. We're going to tax Wall Street. We're going to get rid of certain things that they should have. You know they -- you know I've been talking about it very strongly. Certain things that they want and they want them badly. And it's not fair to give it to them.","And I'm going to because I don't care about the Wall Street guys but you know why? Because I'm not taking any of their money. I have had so many calls from the richest people from the richest guys. You know they see you a number of one in every single place except Iowa where I'm tied and you're going to change that on February 1st. We're going to check everywhere else, everywhere else.","Number one, everywhere else but you're going to change that. I have very little doubt, very little. But you know they come to me and they say, \"Donald would like to give you some money. Where do we send it?\" and I said, \"You can't send it. So I went and I feel sort of like foolish.\" And the last time, the last time I really did this was in Iowa two months ago.","We had 4,000 people and I was in an audience and I said, I feel for us because you know all of these guys. Some are friends, some are enemies, even my enemies are offering me money that they want. They want to give me anything because once you take money, you have a psychological barrier. You know you have to sort of help, right.","So I'm with this group in Iowa. And it was Iowa and it was an amazing evening. We had a great evening. And then I said to them. Listen I feel a little guilty all of my life I've made a lot of money. I've really been good at it and I take money. That's what I do. I accumulate wealth and money and I'm offered massive amounts of money by all these guys because I was Number one then two and I'm offered all this money and I'd like to take it because I feel stupid not taking it, to be honest.","OK. I feel like President Obama feels, OK I don't feel good. I don't feel good. I don't feel good about myself not taking it. They're offering me this tens of millions of dollars. By the way Bush had 128 million. I'd blow him away in one day. I'm telling you if I took money, I would blow him away. I would have a PAC that would have so much money that it would be like one of the great PACs of all time in history.","It would set records right. So I'm saying to the group in Iowa say, so here's the deal I'd like to do. I feel guilty not taking it. It's not my life. My whole life has been doing it. Now I'm saying no. I don't want it. I promise you. Let me take it and I will be 100% fair. I won't do anything for the people giving me the money.","I will be totally loyal to you 100%. Could I have your vote? Oh listen to this. Oh. Oh. The other group was much tougher than you. They stood up and they started booing. Look at that I have some people that said I could take it. Whoa, I didn't know that this group stood up and they would say, \"No don't take it. Don't take it. Don't take it.\" How do you feel about that?","Take it or don't take it? OK ready. Take it, take it! Let's go take it and then we'll go. \"No, take it.\" Ready. So tens of millions. Take it to have one person. Who's out is a beautiful lady in the front row and there's a guy with number 25, who's number 25 that you like. Who is it? Huh. That's good. I take it so far I have two people out of seventeen hundred to be there any more than say take it way.","And here's my promise. I'll take the money and I'll be totally loyal to you. I won't be influenced right anybody else I have two people. So, so far I have two people on the carbon footprint and I have two people on taking the money. OK. Who says I should not take the money? I say. I'm leaving Iowa. I'm not taking them.","And you know it's funny. It was little bit of awakening because my people said and other people from other campaigns said that really it was interesting. They said if you actually have the ability to do that that's an amazing selling point. And it's an amazing point. I said I have the ability it's peanuts compared to what we're talking about.","I mean it's a bigger money is the fact that I am not doing any deals I'm turning away things that I could have made. I'll give you an example. The head of this is small time compared to some of them. I turned down a deal in Asia yesterday because they said I can't go to Asia. How would you feel if I went over to Asia to do groundbreaking.","I don't think so. It doesn't works well when you're running for president, do you agree? Ladies in general going to build a beautiful building in China. Here's a shovel and let's do it. And the people of Iowa are going to say, \"What the hell is he doing in China, right?\" Now, but I'm turning down deals. The head of Comcast who's a great guy, Steve Burke his name is, he's a fantastic guy.","And one of the great executives of the country came to see me just before I announced he's a Donald we want to renew The Apprentice. You know we had great years. I mean the Apprentice has been one of the great stories and one of the most successful shows and he said we'd like to renew it and please and we'd like to do it came up with the head of NBC and I said, \"Steve I just -- you know, I'm going to run for president.\" He said, \"No, no don't do it.\" I said, \"No I'm going to run for president.\" So you know nobody believed I was going to do it. Sort of interesting.","My wife said, \"If you run, you will win.\" She's my best pollster, right. She said, \"If you run.\" She would say it. She said, \"But you have to actually announce because nobody believes you're going to run.\" And Steve Burke didn't believe I was going to run. He said, \"No, no, no we want to do -- and they actually announced The Apprentice which was a little confusing because they announced The Apprentice is going and I said I'm not because nobody thought I was going to run and then I have a big chunk of that show as you know and with Mark Burnett and Arnold Schwarzenegger is going to do and I hope he does a good job.","How do you think Arnold's going to do, Huh? I think so. OK, ready. Will he do as well as Trump? Honestly I agree with you here. But he'll do -- he'll do nicely. I hope he does nicely if he doesn't. I'll say, \"Arnold you're fired.\" I think he'll do fine. I hope he does fine but whatever, whatever it is I'm on to something else and what we're on to is doing this.","But I give up a lot. You know when you are a politician you run and you run and you keep running and you win some and you lose some and you raise money and you do whatever it is. You have to do and you just keep going. With me it takes courage to run for president. I've never done this before and you know I stood on the Trump Tower and I looked down into the atrium and I saw the largest crowd of press.","All these guys back here. I saw the largest number of cameras I think I've ever. It looked like the Academy Awards. And I said to my wife we really have to do it because there are so many mistakes that are being made in this country that are simple mistakes that are mistakes that are made out of either incompetence, stupidity or because of the fact that other people are controlling the process and they want certain things done for their good, not for the good of the country.","I said we have to do it and a large portion of part believe me, a large portion is exactly that third item. A large, large portion and I said we have to do it so we have now the famous escalator scene where we're coming down the escalator and I stood there and we talked about all of the problems many of the problems of the country and I'm very, very proud.","I mean that's why I want you to see Time magazine. I'm very, very proud of what we've been able to do in terms of changing the dialogue in terms of bringing people in. So they are looking at things that they would have never looked at like the illegal immigration and then as you know last -- two weeks ago I was very, very strong about solving a very deep seated problem that we have in this country and throughout the world.","And that's Radical Islamic terrorism. It's a huge problem. It's a huge problem. And I took a lot of heat. I mean that was a lot of heat that I took. It was incredible. I mean all over the world I've been -- I've taken heat and now they're all saying you know I'll tell you something the -- what you've done is amazing because the whole world is talking about the problem now and they weren't talking about it. They were accepting things the way they were.","And now they're talking about the problem. And I want to get the problem solved. We have to solve that problem. That's an unbelievable problem. There is an there is tremendous hatred and anger there. And you know if we don't solve that problem we're not going to be able to live as a country anymore. You're going to have people.","You saw what happened last night with Philadelphia with the gun shooting. I mean whoever heard of things like this. It's so many things happening. And we're going to solve the problem. And but you can't solve a problem unless you're willing to talk about it and address it. Is that right? I mean you're not allowed.","And we have a president that doesn't even want to say what the problem is. He will not issue the words Radical Islamic terrorism. He will not talk about it. He won't talk about and I don't even understand why he's not doing anything wrong by saying it. Look at what happened in Germany with the tremendous crime with New Year's Eve and the rapes and all of the carnage that took place in Germany -- Germany and now the German people are rioting in the streets saying , \"What the hell are you doing to us?\" We have to solve a problem and hopefully we can solve it in a really rational smart way.","And I know Muslim people and they're wonderful people. And one of them at a very, very high level called me and said You've done us a big favor Donald because it's a problem that has to be addressed. The hatred is so incredible. It's so incredible. And the danger, I mean when we have people willing to fly airplanes into the World Trade Center and many other things we got to solve it. We've got to -- we have to get to the bottom of it. Airplanes blowing up. You look at what's happened over just the last little while ,just last night, you look at what's happening.","So we are going to work together with lots of other people I will say this the community that community has to be more open toward us because the two people where she came over on a fiance permit or some nonsense. I never -- did anybody ever hear this? And she was very radicalized already and a lot of people said she then came over and radicalized the guy but people knew what was going on. It wasn't just that they had pipe bombs all over the floor of their apartment.","They had pipe bombs all over the place. They had different things all over the place. It wasn't like a normal situation. Other people saw it and they didn't want to report it. We need help. We have to have people report. And the greatest people are police. Our police are under siege. They're under siege.","Our police are not being treated properly. And you have to call your local police and say, \"You know I see 24 pipe bomb sitting on the floor of this guy's apartment. That's not normal is it? I know they're not going to go farming in Iowa, right?\" So, they have to get out. And they have to or they're just not against.","I mean they're just not with us. OK. If they're not reporting something like that, but many people knew. I mean beyond the mother the mother knew she'd walked in the apartment all the time. She sees all this stuff, she doesn't report. Well she's a mother. But the mother has to report. They have to report.","They have to report -- your president is what? Well look. He's got to get smart. He's got to get tough. We've got to knock the hell out of ISIS. We got to get rid of them. You know I was very much against the war in Iraq for a long period of time since 2003-2004 in fact they did headlines because I said if you knock out Iraq you had Iran and Iraq and they were sort of like equals and militarily.","And I said if you knock out one or the other in this case if you knock out Iraq you're going to destabilize the whole Middle East because Iran is going to come in and take. Now think of what Iran's done how brilliant it is if you own stock in Iran you'd be very, very wealthy. OK what happens is this. Iran makes this deal because they're much better negotiators Kerry is an incompetent negotiator.","We don't even have our prisoners back. We don't have anything. So he takes this deal and he makes this deal and it's one of the worst deals I think I've ever seen of any kind we give him a $150 billion. A hundred and fifty billion! We get nothing, right? So he makes his deal and I've been saying over the last period of time.","And first of all I would have gone in and this would have three years ago. Can you imagine this is the longest running deal I've ever seen. I would have gone and said we want our prisoners back before we start negotiating and they would have said no and I would have lifted up I would have walked out of the room I would have said, \"Bye-bye see you sometime.","Call me when you're ready.\" I would have left the room. I would have increased the sanctions as they were dying with the sanctions. I would have doubled maybe even tripled up on the sanctions and I guarantee you within 48 hours we would have a phone call in Washington D.C., \"Please come. We want to immediately give you back your prisoners.","We haven't delivered, right?\" That would have been number one. I would have been number one. I would have never in a million years told them about the money upfront because I wouldn't give them back. So now we have our prisoners go home enjoy your lives, right? Cost nothing. Now I would go back and say, \"Listen before we start I want to say we're not giving you back any money.","We're a debtor nation. We owe $19 trillion so we don't have it. We don't have it. We're not giving you back your money. So let's start negotiating now. So now we have our prisoners, we keep the money. Would that be nice? And we'll make a good deal. We'll make a good deal. All right? So they made one of the greatest.","And you know what? For two years I've been talking about this deal. How stupid it is and how our people are so incompetent and the way we were treated even during negotiations where they're dancing in the streets in Iran. They're dancing and saying how stupid our negotiators are. We haven't made the deal yet.","If I ever made a deal and the other side's talking about, \"Stop it! I'll making a terror.\" I don't care how good a deal I'm not making it right. I mean the abuse we took during the deal and now I don't know if you heard that. One of the saddest things, they now want to negotiate. They want to start a brand new negotiation for our prisoners.","Do you believe this? They want to negotiate now ahead of the deal. They now want to start brand new and now we don't have sanctions anymore. You're not going to be able to get any of these countries because remember this. Russia and Putin likes me. Putin says, \"Trump is brilliant.\" I love that when he says I'm brilliant.","But Putin said Trump is brilliant. He's the real leader Blah blah blah . Now I don't know if he means that if he doesn't mean it. I don't care. I like it, OK. And he's these characters I'm running against. They think I should disavow his statement. So he calls me brilliant. He says I'm the real leader. I'm the best leader and sort of is interesting because we were on 60 Minutes together.","I was on separately meet him. I was here. He was here and we got great ratings that night. So CBS likes us right. Boy, great read it. But he made these nice segments and then you have the people I'm running against saying disavow the statement. I said why I'm going to disavow? He calls me these nice things.","I'm not going to disavow anything. Who the hell knows if he means or not? But if he does or not I still like it, right? But you know what. We have to be able to get along with the world. So here's what's happening. They now say that they want to start negotiating for our prisoners but we want a lot. Now the Persians are great negotiators.","So now. We're starting a negotiation to get our prisoners back. And Kerry said he didn't want to bring up the prisoners. It wasn't like we negotiated and lost the point. Secretary Kerry and President Obama said we didn't want to negotiate for our prisoners because we didn't want to complicate the word they used: the negotiations.","Who the hell? What's complicated? We want our prisoners back. That's complicated, right? You go in. \"We've got to have our prisoners back. Bad for you, bad for everybody. You don't care. You people don't care. They don't even know you have them. We need them. We'll make a better deal because our people won't be so angry, meaning the United States.","Give us up here.\" That's what you say. And I'm telling you they'll say no and then you'll do and then you'll go get it. OK. But now they want to start a brand new negotiation and they say we want a lot. I can't believe it. I get so angry when I see it. I get so angry when I see it. They should have been out three years ago, four years ago.","Frankly they should've never been there. One's there because he's a Christian minister. He's a pastor. They should have never ever been there. So I've been saying. But think of this. I've been saying that that's one of the really great deals ever made. And then I said him as of two weeks. You know what that's not the greatest deal.","They also made the greatest deal. They took over Iraq for nothing. Iraq has the second largest oil reserves in the world. We lost $2 trillion. Incredible, beautiful young soldiers, male and female, young beautiful soldiers, wounded warriors all over the place. I see them all over. I love them. They're stronger than all of us that the energy, the field that they have.","That the life that they have, the smiles. They're always smiling and they're amazing people , wounded warriors, no legs, no arms, no I -- just the worst. I mean they've been just so badly battered and we had nothing. We have nothing. Remember I said, \"Keep the oil.\" I said keep the oil if you're going out there.","Shouldn't have been there in the first place. You're going out. Keep the oil. We have a president that gave me an exact date when we're leaving. So now the enemy says, \"Oh that's good. Let's pull back for a little while we'll go in after they leave.\" Right? That's what happened. And you form ISIS and now ISIS is tough but not I mean tough for our people, not tough for General MacArthur not tough for General Patton.","I mean we don't have the right people. We don't have the right people. So now they end up taking over the oil. They end up -- you know Iran has second and third largest oil reserves and there are a lot of people who don't know that Iraq has actually the second and third largest oil reserves in the world and massive oil reserves.","We just gave it to Iran. They've been after it for forever. They've been fighting ever since the oldest person in this room was born. They've been fighting, right? Fighting ,fighting. They keep fighting, fighting. We just knocked out one. The other one walks and takes it over and says, \"Thank you very much.\" and also by the way closed the door on the way out and we're negotiating and Russia by the way is now making their missiles.","Everybody that was doing the sanctions, you know is now participating and taking a lot of the money that we gave. Russia's doing armaments and missiles. Other countries are doing other things. Everybody but us. They won't deal with us. We are run by the stupidest people. It is so hard to believe what's going on with our country.","So the Iran deal is a disaster. Syria is a disaster. You look at what's gone on with Libya. You look at what happened there. The migration started because of Hillary Clinton and because of -- and by the way I forgot to tell you very big. I love this Trump: 47, it's last night. Clinton: 44. Trump each time.","That's good. That's good. That's good. Iowa before we start. OK, CNN Trump: 33, Cruz: 20. That's good. I like that one. Then we have. That's good. That's good. Oh I won't read you the one from one paper here. The Des Moines. I don't like that paper. It's dishonest but I mean what did they do like take 300 to 400 votes and I don't think I'm sure they'd never take three or four of them or 10 of them and put them in their pocket.","I'm sure they would never have but that one and I'm not even down by much. I'm down by and then I'm winning and another one winning and another one. The other one came out last night and that's pretty even. It's like statistically tied. So we've got we've got to win, Iowa. We've got to win, OK. So we're going to win, OK. Otherwise I'll tell you what.","Unless otherwise we're wasting our time, folks. We're wasting our time. I'm going to be a nice footnote because they're all saying even the Time magazine, he said, \"What an incredible job makes no difference if he wins or loses makes so what an incredible job.\" I don't want to be. We either win or we lose.","There's nothing else dismal like he did a great job. It's like in baseball he did really good but they lost the game. One day nothing, OK. What difference is it makes no -- nobody, nobody. Oh I think she's found that very funny. So we have a couple of you know one of the things that I like about speaking randomly and off the cuff is that we can talk about things that happened 15 minutes ago and there's no teleprompter, right?","We don't have teleprompters and we don't have speeches. We don't have speeches. I'd love to read a speech. It would be so easy, ladies and gentlemen. Thank you very much for being here. I love Iowa very much. It's great pa pa pa pa pa, right? We don't do that. We speak from the heart and we speak from the brain.","You know I've -- I'm fortunate, I'm fortunate to have a very good memory so I can do this. But -- but you know and I do get certain credit for it. But the beauty is that we can speak about current events because if you have to go to a speechwriter and a pollster and then have them write four or five extra paragraphs, that's no good.","So you look at North Korea. So we talk about Iran and that's a disaster but they don't have nukes yet. They will have them by the way unless I get to be president, if I get to be president promise you folks. They won't have them and Israel is the biggest target and they'll be very happy. They'll be very happy because Obama totally sold Israel out.","He totally sold Israel out. But if you look at, if you look at North Korea this guy, this may -- I mean he's like a maniac, OK. And you got to give him credit. How many young guys? He was like 26 or 25 when his father died. He take over these tough generals and all of a sudden you know it's pretty amazing when you think of it, how does he do that even though it is a culture and it's a cultural thing.","He goes in, he takes over. He's the boss. It's incredible. He wiped out the uncle. He wiped out this one, that one. I mean this guy doesn't play games and we can't play games with him because he really does have missiles and he really does have nukes. And here's what we do. We tell China, who -- we rebuilt China.","They have taken so much of our money with trade. They have taken everything. They've taken our jobs, our money, they've taken our base. They've taken so much and literally it's one of the great thefts in the history of the world. What they've done to our country because we've had people that don't have any idea.","By the way, go ahead you can clap. You know one of the one of the magazines said, \"Trump's a great speaker but he has one problem. He speaks through his applause.\" meaning I'll say something like that. I'll get applause but I -- you know why. Because I'm so excited about what we're all doing together and the future of the country that I don't want to hear your applause.","I just want to give you the next because I know exactly what I'm going to say. Forget the applause but I really mean it. It's such an exciting thing that we're doing together and whether I go to Dallas where we had 21,000 people in the arena and the Mavericks arena. Mark Cuban was great to us whether we go to Mobile, Alabama.","No matter where we go, Oklahoma we had 20,000. We had more. I think much more than that with as huge field. We had a big convention center. And after about two hours we realized that wasn't gonna work. They formed in a huge field thousands and thousands of people. We're all the same. You know we're all the same.","We all want the same thing. It's amazing what's going on in the country. It really is. It's amazing. It's amazing. And you know you could call it a silent majority. You know they say, \"Oh you shouldn't use that word.\" because I don't know I guess it had connotations for many years ago with Nixon and this and that.","But I don't even use the word. I say it's a noisy majority. It's no longer silent. We're fed up with what we're seeing and we've become a noisy, we're really a noisy majority. And believe me, we are a majority. If you get out and vote, if you don't get out and vote like last time, Obama should have lost.","He was a failed president, doing a terrible job. And in all fairness, Mitt, I don't know what the hell happened. I said Why aren't you on television? why are you doing Jay Leno? Why aren't you doing David Letterman? Why are you doing these shows? Because say what? You want about Obama. He was on every show.","He was on everything. And I say this. We're going to win. One of the reasons we're going to win is I think Hillary will probably look, she shouldn't be allowed to run, OK. Oh would I love to run against Ben. And some really bad stuff came out last night. I don't know if you saw it but basically last night she admitted that she's totally aware of what the hell's going on and she knows how to play the game pretty well but she shouldn't be allowed.","Look, she shouldn't be allowed to run but on the assumption that they say because they're Democrats right now. That let's just close our eyes, close our eyes even though they destroyed General Petraeus and many other people who did far less than she did on the assumption that she runs. I don't think she has the strength or the stamina.","She comes in and you need a president whether it's a nice thing or not to say we can't play games anymore. She'll come in to see Iowa. She'll come into Iowa and she'll see people hung around the little plastic table. A few people that have been vetted by 400 people and they'll get these kids. \"Miss Clint, what do you have for breakfast.","Oh do you like oatmeal? Yes I did. Oh great.\" And then she'll leave and she'll wave and then she goes away for a week. You don't see her. One thing with me. \"Hey I'll be leaving here I'm going to another place. We're going to do the same thing all over again, OK?\" Oh, strength, stamina! We need strength and stamina.","Look it's like I said about Jeb Bush. Guy's got no energy. We need energy. We need energy. He's a low-key individual. But we need energy because we've got ISIS. We've got borders that are a mess. We've got Obamacare that -- it's everything's a mess. We don't have victories anymore we don't win anymore we're going to start winning.","We're going to win so much that you're going to sick and tired you're going to say, \"Please, please Mr. President, we're sick and tired of winning. Please let us have at least one loss. It's no longer exciting to win.\" and I'm going to say, \"No way, we're going to keep winning and I don't care if you like it or not.\" We have to win.","We're going to win. I've been. I like to win. I like to win. So I just want to leave you with this. You do have a problem and you have a big round with North Korea. And we're going to talk to China. We're gonna get along great with China. And I love China because they buy my apartments they spend me you know, fortunes in Manhattan.","They give me millions and millions of dollars for these apartments and they're great. The biggest bank in the world is a tenant of mine and one of my building's biggest bank by far. I mean when I talk about big, we're talking about seriously big. Citibank is like a little subsidiary compared to this bank and they make a tremendous amount of money with the United States as we've been talking about.","We're going to go. They're willing to say you got to take care of that Korea problem. You got to take care of it. Everything comes through China and they tell our people because our people are novices but they say, \"Well, we don't have that much control. They have total control. They wouldn't eat. They wouldn't live without China.\" And China's massive.","Everyone's afraid over there of China. China can't handle the problem. I want them to handle it. We don't have to handle everything. We handle everything. We don't have to. I will get China to handle the problem if they don't handle problem we'll have to take it up on trade. You know we're going to -- it's going to be very costly for them if they don't handle the problem.","But I wouldn't say that because I would never want to threaten anybody, OK. Never under any circumstances I never want to threaten so I won't threaten them. I'm just telling you that they will do it and they should do it. And frankly they have a bigger problem than we do because they're right next door. And Japan has to help us out because they are really, I mean you know they're very suspect -- they would be. Look at what's going on over there.","They're already sending planes to find out what's got -- what's happening. And South Korea has to help us out because we're defending South Korea. We're defending all these people. We need help. We need help. We're powerful. But I want to make our military very much more powerful. I want to make it so powerful, so tough, so strong that nobody's ever going to mess with us, folks.","It's the cheapest thing we can do. It's the cheapest thing we can do. And I'll tell you this. I know all the politicians. Many of the people that I'm running against, I've contributed to. I've had notes and letters from some of these people. \"Thank you so much for the money you sent.\" Many of the people, it's embarrassing on the stage.","I almost -- most of them, I've contributed to. I said this and you know. \"That one, yes that one, yes that one.\" It's like almost all of them in some form. And I said to myself It's not ridiculous. I'm running against these people. I have contributed to all of them. I understand politicians better than anybody.","They're never going to get you to the promised land, folks. They're never going to take you there. They're never going to solve the problem at the border. They're never going to get you the wall. Now they're starting to say, \"Well we should build a wall.\" Remember this. Every time somebody says, \"We should build a wall.\" Please think about me, OK. Just think about me and they won't build it. And by the way, by the way, they will build it because they wouldn't know where to start.","They're not going to build a wall but they've got to talk it because they're seeing that there's been a fever for Trump and for the wall and for the border. And when CNN did their recent poll who is the best on ISIS? Trump, by a vast majority. Not I'm talking about by close to 50% and you have 14 or 15 people.","I'm getting 50%. Who's best on ISIS? who's best on terrorism? Trump by a vast majority. Close to 50%. Who's best on the economy? That's what I would expect. I'm way, way up. Way over 50%. I think over 60%. Well it's true. Who's best on jobs? Trump. I will be the greatest jobs president that God ever created.","That I can tell you. That I can tell you. And we're going to be a resp --. we are going to be so important. We're going to be a respected country again. We're not going to be left out. We're not going to be smirked at. People aren't going to think of our leaders as being stupid people. We're going to be respected again.","Mexico's going to respect us and we're going to respect them too. And we're going to get along with them just fine. But they can't keep taking Ford and Nabisco and so many of the companies that you have even in Iowa and New England was wiped out. You take a look at New England, what's happened there? Can't work that way.","You know these deals have to be a double-sided deal. I'm a free trader. But I also want smart trade. It's got to be smart. And that doesn't mean we have to take advantage of others but it's got to be at least fair. So these things are going to happen. Carl Icahn, one of the great businessmen and so many others have called me. They'd like to get involved.","If I took a Carl Icahn and if I took some of the others, all of whom you've heard of. These are the greatest in the -- where we have the greatest in the world. And I say, \"Carl take a look at China trade. With China I want to make it fair because they stuff -- they bring things over to us. No tax, no, nothing.","You want to do business over there. It's almost impossible. And by the way they tax the hell out of you when you send your product. Not supposed to be that way. It's not supposed to be that way. It's supposed to be a fair deal but it's not a fair deal. I could tell you 100 stories. It's not a fair deal.","So when I take somebody like Carl and other of the great business people, they don't want money. They don't want a salary. They're rich. They made a lot of money because they're smart, because they have that ability to negotiate and make deals. When I take Carl I'll say, \"Do me a favor, you watch over our trade with China.\" In a very short period of time you people are going to be very happy because that's the way it works because we're really good at what we do. And honestly I play with these people.","There's no every single debate. I'm not a debater. I've won every debate according to the polls. I mean, I've won every debate. The last debate. No -- and you don't hear that from these crooked. You don't hear that from these crooked guys like Karl Rove is a totally dishonest guy. You don't hear that. They don't talk about that.","And you know Krauthammer and others although Krauthammer is getting better. I must say he's coming a long way. He's doing much better. But -- but this Karl Rove, I mean some of these people are. So George will take his little spectacles away. He's a stupid person. I'm telling you without. No, no, no. Remember the war.","You must go in and attack immediately. Now what you -- what do we have in Iraq, OK? Attack immediately. Take a look at his record. It's a horrible record. And I really mean it. Take those little spectacles away. And he doesn't look like a smart person. With the spectacles he looks smart. But every debate -- so when I came out I said, \"Let's see a debate.\" They said, \"How do you think you'll do on the first debate?\" I said, \"I've never done it before.","What do I know? I've never done it before.\" And then Drudge who's a fantastic man by the way, but Drudge and you have slate and you have CBS and you have all these polls come down. I mean all great polls. Time magazine has a poll, online poll right now. I've won every single poll of every single company for every single debate.","And I'm not a professional debater and I have hundreds of thousands of people. But I tell it like it is. I tell the truth I tell it like it is and I know how to fix our country. And you know what? If I don't make it, I'm going to love you folks just as much. And honestly if I don't win on February 1st, if you people don't do what you should do because I'm telling you I'm going to make America great again.","But if you don't do it I will still love the folks in Iowa. Maybe no -- as I will still love the people in Iowa because I've developed so many friendships but I just think, so important going to make America great again. On February 1st you have to get to that caucus. You have to go out to a job and we're going to bring your friends.","You know, don't sit home. Don't sit home. Get out there. It's so important. I think it's one of the most important elections we've ever had because our country is going to hell and we're going to turn it around and we're going to make it so great again and we're going to make it.","In my opinion, we have a chance to make it greater and better than ever before. Thank you very much everybody. Thank you. Thank you very much. Thank you very much."],"text":" Clobbered and all of a sudden he said, \"Oh I'm for ethanol.\" You can't do that, you can't do that with you know, three weeks ago you're not allowed to do that. So nobody really believes it. But you know I've been there. The folks, the ethanol folks love Trump. They've been very, very supportive of me and I love them and I think it's very important that they carry it out. And I'm not a guy that just said it today and I'll say you know because that's a big change in my opinion. That's a very, very big change. OK, very important. So let me go over some of the numbers because I think they are important and I really want you to understand that and who was going to last longer. Go out. I think you know when you see the cover of Time I've been on the cover of Time now. Sort of like three times because I was on the year-end review. I was on and I should have been on the fourth. They picked Chancellor Merkel. Poor Germany, they're rioting right now in the streets of Cologne, rioting. What's gone on is unbelievable with the crime, with the rape, with what's going on in Germany is unthinkable. There was a country that didn't have these problems, but they didn't know about these problems. And I don't know what went on. Millions of people coming in and what's happening in Germany is unbelievable. What's happening in Paris is unbelievable and I'm not talking about the attack. I'm talking very simply about Paris is not the same place. It's not the same place. And we better get smart. We allowed two people -- we allowed, right? We better get smart now. We got to get smart about and you know I've taken the attack. First of all when I announced I came very, very strongly against illegal immigration. Did I take Heat, Rush Limbaugh, everybody said never has anybody received so much incoming and I understood. Believe me, I didn't I said is it going to be like this for six months. That's a lot for six months. Within two weeks all of a sudden people are saying, \"Well you know he's got a point.\" But then they had beautiful cake in San Francisco and she was killed. Shot in the back by somebody who came in five or six or seven -- they have no idea. At times I wonder whether or not he was pushed in because they didn't want him. And they're smarter, you know, their leaders Mexico, China, all over the leaders are smarter, more cunning than our leaders and they do things to us that we don't even know is happening. But all of a sudden Kate, she's killed. Jamil in Los Angeles was killed, a veteran, a woman, 66 years old, raped, sodomized and killed a few weeks ago in Los Angeles by an illegal immigrant. And this is three instances all over. All over. Not even to mention the jobs and the economy and all of the other things that are happening. So we have to get smart. And what happened there is all of a sudden people are saying, \"You know, Trump might be right.\" He might be right. Now they're all saying, \"Trump is right\". Now illegal immigration, what's true? If I didn't bring up illegal immigration you wouldn't have me talking about it today folks. I brought it up. I took a lot of heat and then it's people are realizing what a big problem it is now. We're going to have a border. It's going to be a very strong border. We're going to have a wall because walls do work when they're real walls. We're going to build a wall. Mexico's going to pay for the wall because they make a fortune. Mexico's making a fortune. I respect Mexico. I have thousands of Hispanics that work for me. Over the years, I have tens of thousands of people working for me but I have thousands of Hispanics, thousands in Nevada. Just recently I won the poll. Hispanics are voting for Trump and I said that was going to happen. The people that are here legally, the Hispanics that are here, let alone the Hispanics that are here legally, they're voting for me. And I've been saying this and then all of a sudden they announce it. \"I can't believe this. This is really surprising.\" I easily won in Nevada with the Hispanics and I'm going to win a lot of places with Hispanics. African-Americans are with Trump. They're going to be with Trump. The relationship I have with the African-Americans is great. And actually one poll came out at 25% and the amount this is for the Republican Party which is a very unusual number because usually it's 5%, 4%, 6% maybe 7%. They say, \"Wait a minute, if Trump gets 25% of the African-American vote, the election's over. He wins! he wins! You know, he wins\" because they're smart. They know I'm bringing jobs back from China. I'm going to bring jobs from Mexico. I'm going to take our jobs back. We're going to start making things. you know Newton. I was very much involved with Newton, a number of years ago is on 60 Minutes. And I so I was happy you know that right. And I helped a lot of people in Newton and I just thought I was watching 60 Minutes, I felt so badly where people are moving to Mexico for the most part. Companies are moving out and Newton was treated very unfairly. And that's one community. But we have communities all over the country that are being treated unfairly and frankly you know we have corporate inversions where companies are now going to move out of the United States are going to leave the jobs behind. They're going to other places all over the world. Pfizer's moving to -- Can you believe it? They're moving to Ireland. They're going to leave thousands and thousands of jobs. Two and a half trillion dollars right now is offshore. It's outside of the United States. I think the number is actually much bigger than that. You know when the government gives you a number they don't know what the hell they're talking about. They don't know. It's true. They don't know what they're talking about. I think it's actually, you know, you can't get the money back in so they have money sitting outside -- outside of this country. Everybody agrees. Democrats and Republicans, Senate should come back in and use it for jobs and things in this country. They can't bring it back in. They can't agree. So they agree but they can't sit down around the table and get it done. Everybody agrees it should come back in. They can't do it because we have lack of leadership. We have a president that's not a leader. So now what's happening? Not a leader so, so now what's happening is companies are moving out of the country to get their money and to get lower taxes and other things. My tax plan by the way was put in. Got great reviews. We're lowering the hell out of the taxes for businesses and for the middle class. We're going to lower it. We are and we're also simplifying the system. You're not going to need H in our block anymore and give them half of the money you have. We're going to simplify the system. It's going to be so simple. But your taxes are going way, way down and the middle class has been forgotten about in this country, has been totally forgotten about. The farmers have been forgotten about. If you think about it. No, I mean, I know, I know farmers I have some great friends at a farm, you know when somebody dies in the family when they die they can't pass things on because they're sort of rich but not necessarily in cash and they have to pay so much estate tax that they have to sell the farm in order to survive. And if they hit the wrong cycle or the wrong timing they can't sell the farm. They end up losing everything. So we're going to change that. We're going to change the whole estate tax thing. It's not fair and farmers in particular. It's not fair so and one thing, I have to also say, \"Look ,I know a lot of people on Wall Street. I'm self-funding my campaign. I don't need any of their money so I couldn't care less, OK. I couldn't care, I couldn't care less. And I will tell you every single other candidate other than me is getting tremendous -- you see the money they taking in? Now I'll tell you I'm good at that. You know I've always taken in money. I like money. I'm very greedy, I'm a greedy person. I shouldn't tell you that I'm greedy. I've always been greedy. I love money, right? I take it a lot. I made a lot of money. I'm worth it. If you would have told me what I was at the Wharton School of Finance that I would have done, what I've been able to do, I wouldn't have believed it but I built an unbelievable company, very, very little debt, tremendous some of the greatest assets in the world, tremendous cash flow, tremendous cash sitting there. I filed my papers with the Federal Elections. Everyone said, \"Well maybe he's not as rich as we think so maybe he'll never file.\" But I filed. In fact I would've filed if I didn't run because I want to brag. I love to brag. All right. But the truth is in business and there is OK in business. You want to be a little bit greedy, some greedy. I want to give all that up. I don't care. You know my kid Ivanka. Good kid. They're all good kids. They'll run it. I have great executives. They'll run it. It's easy. It's gonna be easy. But you know what? I want to be greedy for a country. I want to be greedy, I want to be so greedy. I want to be greedy for our country. I want to take back money. I want-- you know where we are right now? Japan, $1.5 trillion dollars. They have our debt. China, $1.7 trillion dollars. You know what? It is trillion. Think of it. Japan comes in. They sell us cars. They make a fortune. Millions of cars. They devalued the hell out of their currency over the last couple of years, by the way, just so you know, it's very hard to compete with them. You would just have to ask Caterpillar tractor about that. Caterpillar tractors have been having a very hard time competing with the yen because they devalue the yen. The dollar goes up, the yen goes down. They can't compete. They can't compete. Look what's happening to Caterpillar. Look at John Deere. I love John Deere. You know I'm one of the larger customers of John Deere. You don't even know that I buy millions of dollars of stuff. I buy millions. I would say over the years, I mean, I think the number is even lower but way over $10 million dollars' worth of John who knows that about Trump, right? But I buy a lot of stuff. Tractors all over the place and the product is great but it's tough when an American company has to compete with other countries that manipulate their currency like Japan, like China like other places. OK, Vietnam, watch Vietnam. They are doing a number but these countries are totally, they couldn't care less about us. You know we want to do something that's good for the world, that global warming good for the world. Watch Obama talking about the carbon footprint? And then he flies over to Hawaii in an old 747 with the old engine spewing the hell out of it and then he gives a speech about global warming and the carbon footprint. Now think of it. Think of it. And he's played a lot of golf. He's played more than most PGA touring professionals play. Seriously. He's played a lot of golf but he was over there for a long time. But think of it gets into Air Force One which is a very old Boeing 747 with the old really big engines. And if you're a believer in carbon footprint you don't like this, right? I mean how many people believe in the carbon footprint? Huh! I'm shocked. I'm shocked. I was just given a bill. I flew my plane into a certain location. They sent me a bill for $2,200, a carbon tax they said. What a scam. What kind of a scam is this? And my plane's a good plane and it's efficient. But think of it flies a 747 to Hawaii and back and then he gets up and gives a speech about global warming. You know, give me a break. I mean there's not one person in the whole room that talks about carbon. OK , look we're going to protect you. Nobody's going to attack you. Seriously, who believes in the carbon footprint? One. Oh, Al Gore. And you know where he is now, right? Do you believe in it, too? OK. So two people out of seventeen hundred. I'm with -- I'm with the seventeen hundred. OK. I thought it would be more than that. I mean I thought it would be more than that but I think you know if you're going to play the game you're got to play the game. OK. So and you can't you can't be doing what he's doing. So anyway, so on some of these numbers. So Reuters, Trump: 41.1, Cruz :16 figure that Carson:12. Oh poor Jeb. He's way down. Wow! He spent $68 million dollars on his campaign. I won't even tell you what his number is. It's so ridiculous. OK. Think of this, FOX last night came out with a poll, a nationwide poll, Trump: 35, Cruz: 20, Rubio: 13. And the rest are all quite low. That's good. But here's one that I loved. Trump versus Hillary Clinton. Has anyone heard of Hillary Clinton? Has anyone heard of Hillary Clinton? Oh it's so terrible, what Mr. Trump is saying. I don't like his tone. We have people, their heads are being chopped off all over the Middle East. She -- She's worried about tone. We need tone. Believe me, we need tone. We're tired of these politicians is weak, I'll tell you what I'm doing this. I didn't need to do this politically. I had such a nice life. It was good. The company was good. The family's nice, everyone's good. I love everybody. I had to do it because I'm so tired of these weak, disgusting, corrupt politicians that we have running our country. That's what it is. They're corrupt. They're corrupt. And remember this. A lot of deals like the Iran deal but a lot of deals. There -- you think that they're stupid. The politicians and many of them are -- but many of them are just corrupt. They take their PACs guys. Put five million, seven million, two million, one million into Bush's PAC and Hillary's back and Marco's PAC and all of these PACs and frankly, Ted Cruz has you know, two guys that have given them a fortune. One is oil and one is something else. Remember ethanol, you're not protected. I guarantee you that. I guarantee you that. But Ted has guys. They're all but every one of them. They are people that put up millions and millions of dollars. Those people control those candidates. OK, so if it comes to a vote and they need to put up their hand, that's good for the country and these people don't want him to do it. They're not doing it, folks because they want them to be there for the next election. What a politician is really good at is getting re-elected and continuously to get to the right source. Remember this, seven months ago I was a big donor. I gave 350,000 to the Republican Governors Association I gave. I mean it was like crazy I give to everybody. I even give, I give to Democrats, I give -- I give to everybody. You know why? Because when I want to call somebody when I need help I'm not, I'm a business man really successful I go. Everybody likes me. And it's the way the system is. And I don't say it's a good system and I'm not saying that's even a bad system. I'm only telling you. I'm not taking anything and I can't be, I have to do what's right for you. Remember that I have to do what's right for you. You're the only one I'm working for. And you know I've always been told that a very successful person can't run for president. I've been told that and I understand, I've done hundreds of deals, hundreds and hundreds and hundreds of them. That's what I do. My whole life is deals coming out of my ears that come in all over. I mean I did hundreds of deals and they've been for the most part, great. And when they were bad in fact, a couple of guys wrote about a recent deal when they were bad. I made them good. That's a sign of a good business, guy. Sometimes you know they're bad because the economy changes like Atlantic City. You read about Atlantic City. I made a lot of money in Atlantic City. I mean I made a lot of money. One of the very smart guys said Atlantic City cop walked away with a fortune. I made a lot of money now. I used every single trick in the book and this and that. But you know if you're on my side you want to be on my side because the economy went bad. The politicians destroyed Atlantic City. Lots of bad things. And yet I made. I came out great. The sign of a good businessman is when you take -- or woman is when you take something that shouldn't work and make it good. And I've taken deals. You know it's very important. I've taken deals where I'd have things in the middle of a depression. All of a sudden you know, you have a building has gone up. Things are great. Then all of a sudden, being the politicians or something happens, where the world collapses and you go from having strong times to bad times and you're in the middle of a project when you can take those jobs and make them good. That's the sign of somebody that you want on your side. And that's what I do. I make things good. So and Atlantic City is a story like they did a story recently in the front page of The Wall Street Journal was actually a good story. It said Trump made a lot of money in Atlantic City. And you know people say, \"Oh I know you did great but you didn't do great in Atlantic.\" I did great in Atlantic. I made a lot of money but it was always a fight because it was always behind the eight ball. The politicians were always making stupid decisions. They didn't fix the airport like they were supposed to. They wasted tens of millions of dollars doing the wrong thing. They built that convention center in the wrong location. I said, \"Don't build it there. Build it on the boardwalk. Expand the existing. You'll spend one third the money and it'll be three times the size.\" They didn't listen to me. Probably somebody had a deal over in the other area where they owned some land or whatever crooked politicians all the time. And you know they built in the wrong location and they destroyed it. Atlantic City suffered but I said when I saw the stupid moves being made. I did a lot of thing. And plus I got out seven and half eight years ago which was great timing actually the smart people give me a lot of credit. I only tell you these stories because you're about to pick somebody. We're a country that has $19 trillion in debt. We're in trouble. There's a bubble. You see the stock market is starting to you know, see what's going on, right? Some of these people are shaking their heads like this. You know that because they're in the stock market. But it's starting to have some very bad weeks and some very bad numbers. I tell you because I'm really good at that stuff. I know Wall Street. I know the people on Wall Street. We're going to have the greatest negotiators in the world but at the same time I'm not going to let Wall Street get away with murder. Wall Street has caused tremendous problems for us. We're going to tax Wall Street. We're going to get rid of certain things that they should have. You know they -- you know I've been talking about it very strongly. Certain things that they want and they want them badly. And it's not fair to give it to them. And I'm going to because I don't care about the Wall Street guys but you know why? Because I'm not taking any of their money. I have had so many calls from the richest people from the richest guys. You know they see you a number of one in every single place except Iowa where I'm tied and you're going to change that on February 1st. We're going to check everywhere else, everywhere else. Number one, everywhere else but you're going to change that. I have very little doubt, very little. But you know they come to me and they say, \"Donald would like to give you some money. Where do we send it?\" and I said, \"You can't send it. So I went and I feel sort of like foolish.\" And the last time, the last time I really did this was in Iowa two months ago. We had 4,000 people and I was in an audience and I said, I feel for us because you know all of these guys. Some are friends, some are enemies, even my enemies are offering me money that they want. They want to give me anything because once you take money, you have a psychological barrier. You know you have to sort of help, right. So I'm with this group in Iowa. And it was Iowa and it was an amazing evening. We had a great evening. And then I said to them. Listen I feel a little guilty all of my life I've made a lot of money. I've really been good at it and I take money. That's what I do. I accumulate wealth and money and I'm offered massive amounts of money by all these guys because I was Number one then two and I'm offered all this money and I'd like to take it because I feel stupid not taking it, to be honest. OK. I feel like President Obama feels, OK I don't feel good. I don't feel good. I don't feel good about myself not taking it. They're offering me this tens of millions of dollars. By the way Bush had 128 million. I'd blow him away in one day. I'm telling you if I took money, I would blow him away. I would have a PAC that would have so much money that it would be like one of the great PACs of all time in history. It would set records right. So I'm saying to the group in Iowa say, so here's the deal I'd like to do. I feel guilty not taking it. It's not my life. My whole life has been doing it. Now I'm saying no. I don't want it. I promise you. Let me take it and I will be 100% fair. I won't do anything for the people giving me the money. I will be totally loyal to you 100%. Could I have your vote? Oh listen to this. Oh. Oh. The other group was much tougher than you. They stood up and they started booing. Look at that I have some people that said I could take it. Whoa, I didn't know that this group stood up and they would say, \"No don't take it. Don't take it. Don't take it.\" How do you feel about that? Take it or don't take it? OK ready. Take it, take it! Let's go take it and then we'll go. \"No, take it.\" Ready. So tens of millions. Take it to have one person. Who's out is a beautiful lady in the front row and there's a guy with number 25, who's number 25 that you like. Who is it? Huh. That's good. I take it so far I have two people out of seventeen hundred to be there any more than say take it way. And here's my promise. I'll take the money and I'll be totally loyal to you. I won't be influenced right anybody else I have two people. So, so far I have two people on the carbon footprint and I have two people on taking the money. OK. Who says I should not take the money? I say. I'm leaving Iowa. I'm not taking them. And you know it's funny. It was little bit of awakening because my people said and other people from other campaigns said that really it was interesting. They said if you actually have the ability to do that that's an amazing selling point. And it's an amazing point. I said I have the ability it's peanuts compared to what we're talking about. I mean it's a bigger money is the fact that I am not doing any deals I'm turning away things that I could have made. I'll give you an example. The head of this is small time compared to some of them. I turned down a deal in Asia yesterday because they said I can't go to Asia. How would you feel if I went over to Asia to do groundbreaking. I don't think so. It doesn't works well when you're running for president, do you agree? Ladies in general going to build a beautiful building in China. Here's a shovel and let's do it. And the people of Iowa are going to say, \"What the hell is he doing in China, right?\" Now, but I'm turning down deals. The head of Comcast who's a great guy, Steve Burke his name is, he's a fantastic guy. And one of the great executives of the country came to see me just before I announced he's a Donald we want to renew The Apprentice. You know we had great years. I mean the Apprentice has been one of the great stories and one of the most successful shows and he said we'd like to renew it and please and we'd like to do it came up with the head of NBC and I said, \"Steve I just -- you know, I'm going to run for president.\" He said, \"No, no don't do it.\" I said, \"No I'm going to run for president.\" So you know nobody believed I was going to do it. Sort of interesting. My wife said, \"If you run, you will win.\" She's my best pollster, right. She said, \"If you run.\" She would say it. She said, \"But you have to actually announce because nobody believes you're going to run.\" And Steve Burke didn't believe I was going to run. He said, \"No, no, no we want to do -- and they actually announced The Apprentice which was a little confusing because they announced The Apprentice is going and I said I'm not because nobody thought I was going to run and then I have a big chunk of that show as you know and with Mark Burnett and Arnold Schwarzenegger is going to do and I hope he does a good job. How do you think Arnold's going to do, Huh? I think so. OK, ready. Will he do as well as Trump? Honestly I agree with you here. But he'll do -- he'll do nicely. I hope he does nicely if he doesn't. I'll say, \"Arnold you're fired.\" I think he'll do fine. I hope he does fine but whatever, whatever it is I'm on to something else and what we're on to is doing this. But I give up a lot. You know when you are a politician you run and you run and you keep running and you win some and you lose some and you raise money and you do whatever it is. You have to do and you just keep going. With me it takes courage to run for president. I've never done this before and you know I stood on the Trump Tower and I looked down into the atrium and I saw the largest crowd of press. All these guys back here. I saw the largest number of cameras I think I've ever. It looked like the Academy Awards. And I said to my wife we really have to do it because there are so many mistakes that are being made in this country that are simple mistakes that are mistakes that are made out of either incompetence, stupidity or because of the fact that other people are controlling the process and they want certain things done for their good, not for the good of the country. I said we have to do it and a large portion of part believe me, a large portion is exactly that third item. A large, large portion and I said we have to do it so we have now the famous escalator scene where we're coming down the escalator and I stood there and we talked about all of the problems many of the problems of the country and I'm very, very proud. I mean that's why I want you to see Time magazine. I'm very, very proud of what we've been able to do in terms of changing the dialogue in terms of bringing people in. So they are looking at things that they would have never looked at like the illegal immigration and then as you know last -- two weeks ago I was very, very strong about solving a very deep seated problem that we have in this country and throughout the world. And that's Radical Islamic terrorism. It's a huge problem. It's a huge problem. And I took a lot of heat. I mean that was a lot of heat that I took. It was incredible. I mean all over the world I've been -- I've taken heat and now they're all saying you know I'll tell you something the -- what you've done is amazing because the whole world is talking about the problem now and they weren't talking about it. They were accepting things the way they were. And now they're talking about the problem. And I want to get the problem solved. We have to solve that problem. That's an unbelievable problem. There is an there is tremendous hatred and anger there. And you know if we don't solve that problem we're not going to be able to live as a country anymore. You're going to have people. You saw what happened last night with Philadelphia with the gun shooting. I mean whoever heard of things like this. It's so many things happening. And we're going to solve the problem. And but you can't solve a problem unless you're willing to talk about it and address it. Is that right? I mean you're not allowed. And we have a president that doesn't even want to say what the problem is. He will not issue the words Radical Islamic terrorism. He will not talk about it. He won't talk about and I don't even understand why he's not doing anything wrong by saying it. Look at what happened in Germany with the tremendous crime with New Year's Eve and the rapes and all of the carnage that took place in Germany -- Germany and now the German people are rioting in the streets saying , \"What the hell are you doing to us?\" We have to solve a problem and hopefully we can solve it in a really rational smart way. And I know Muslim people and they're wonderful people. And one of them at a very, very high level called me and said You've done us a big favor Donald because it's a problem that has to be addressed. The hatred is so incredible. It's so incredible. And the danger, I mean when we have people willing to fly airplanes into the World Trade Center and many other things we got to solve it. We've got to -- we have to get to the bottom of it. Airplanes blowing up. You look at what's happened over just the last little while ,just last night, you look at what's happening. So we are going to work together with lots of other people I will say this the community that community has to be more open toward us because the two people where she came over on a fiance permit or some nonsense. I never -- did anybody ever hear this? And she was very radicalized already and a lot of people said she then came over and radicalized the guy but people knew what was going on. It wasn't just that they had pipe bombs all over the floor of their apartment. They had pipe bombs all over the place. They had different things all over the place. It wasn't like a normal situation. Other people saw it and they didn't want to report it. We need help. We have to have people report. And the greatest people are police. Our police are under siege. They're under siege. Our police are not being treated properly. And you have to call your local police and say, \"You know I see 24 pipe bomb sitting on the floor of this guy's apartment. That's not normal is it? I know they're not going to go farming in Iowa, right?\" So, they have to get out. And they have to or they're just not against. I mean they're just not with us. OK. If they're not reporting something like that, but many people knew. I mean beyond the mother the mother knew she'd walked in the apartment all the time. She sees all this stuff, she doesn't report. Well she's a mother. But the mother has to report. They have to report. They have to report -- your president is what? Well look. He's got to get smart. He's got to get tough. We've got to knock the hell out of ISIS. We got to get rid of them. You know I was very much against the war in Iraq for a long period of time since 2003-2004 in fact they did headlines because I said if you knock out Iraq you had Iran and Iraq and they were sort of like equals and militarily. And I said if you knock out one or the other in this case if you knock out Iraq you're going to destabilize the whole Middle East because Iran is going to come in and take. Now think of what Iran's done how brilliant it is if you own stock in Iran you'd be very, very wealthy. OK what happens is this. Iran makes this deal because they're much better negotiators Kerry is an incompetent negotiator. We don't even have our prisoners back. We don't have anything. So he takes this deal and he makes this deal and it's one of the worst deals I think I've ever seen of any kind we give him a $150 billion. A hundred and fifty billion! We get nothing, right? So he makes his deal and I've been saying over the last period of time. And first of all I would have gone in and this would have three years ago. Can you imagine this is the longest running deal I've ever seen. I would have gone and said we want our prisoners back before we start negotiating and they would have said no and I would have lifted up I would have walked out of the room I would have said, \"Bye-bye see you sometime. Call me when you're ready.\" I would have left the room. I would have increased the sanctions as they were dying with the sanctions. I would have doubled maybe even tripled up on the sanctions and I guarantee you within 48 hours we would have a phone call in Washington D.C., \"Please come. We want to immediately give you back your prisoners. We haven't delivered, right?\" That would have been number one. I would have been number one. I would have never in a million years told them about the money upfront because I wouldn't give them back. So now we have our prisoners go home enjoy your lives, right? Cost nothing. Now I would go back and say, \"Listen before we start I want to say we're not giving you back any money. We're a debtor nation. We owe $19 trillion so we don't have it. We don't have it. We're not giving you back your money. So let's start negotiating now. So now we have our prisoners, we keep the money. Would that be nice? And we'll make a good deal. We'll make a good deal. All right? So they made one of the greatest. And you know what? For two years I've been talking about this deal. How stupid it is and how our people are so incompetent and the way we were treated even during negotiations where they're dancing in the streets in Iran. They're dancing and saying how stupid our negotiators are. We haven't made the deal yet. If I ever made a deal and the other side's talking about, \"Stop it! I'll making a terror.\" I don't care how good a deal I'm not making it right. I mean the abuse we took during the deal and now I don't know if you heard that. One of the saddest things, they now want to negotiate. They want to start a brand new negotiation for our prisoners. Do you believe this? They want to negotiate now ahead of the deal. They now want to start brand new and now we don't have sanctions anymore. You're not going to be able to get any of these countries because remember this. Russia and Putin likes me. Putin says, \"Trump is brilliant.\" I love that when he says I'm brilliant. But Putin said Trump is brilliant. He's the real leader Blah blah blah . Now I don't know if he means that if he doesn't mean it. I don't care. I like it, OK. And he's these characters I'm running against. They think I should disavow his statement. So he calls me brilliant. He says I'm the real leader. I'm the best leader and sort of is interesting because we were on 60 Minutes together. I was on separately meet him. I was here. He was here and we got great ratings that night. So CBS likes us right. Boy, great read it. But he made these nice segments and then you have the people I'm running against saying disavow the statement. I said why I'm going to disavow? He calls me these nice things. I'm not going to disavow anything. Who the hell knows if he means or not? But if he does or not I still like it, right? But you know what. We have to be able to get along with the world. So here's what's happening. They now say that they want to start negotiating for our prisoners but we want a lot. Now the Persians are great negotiators. So now. We're starting a negotiation to get our prisoners back. And Kerry said he didn't want to bring up the prisoners. It wasn't like we negotiated and lost the point. Secretary Kerry and President Obama said we didn't want to negotiate for our prisoners because we didn't want to complicate the word they used: the negotiations. Who the hell? What's complicated? We want our prisoners back. That's complicated, right? You go in. \"We've got to have our prisoners back. Bad for you, bad for everybody. You don't care. You people don't care. They don't even know you have them. We need them. We'll make a better deal because our people won't be so angry, meaning the United States. Give us up here.\" That's what you say. And I'm telling you they'll say no and then you'll do and then you'll go get it. OK. But now they want to start a brand new negotiation and they say we want a lot. I can't believe it. I get so angry when I see it. I get so angry when I see it. They should have been out three years ago, four years ago. Frankly they should've never been there. One's there because he's a Christian minister. He's a pastor. They should have never ever been there. So I've been saying. But think of this. I've been saying that that's one of the really great deals ever made. And then I said him as of two weeks. You know what that's not the greatest deal. They also made the greatest deal. They took over Iraq for nothing. Iraq has the second largest oil reserves in the world. We lost $2 trillion. Incredible, beautiful young soldiers, male and female, young beautiful soldiers, wounded warriors all over the place. I see them all over. I love them. They're stronger than all of us that the energy, the field that they have. That the life that they have, the smiles. They're always smiling and they're amazing people , wounded warriors, no legs, no arms, no I -- just the worst. I mean they've been just so badly battered and we had nothing. We have nothing. Remember I said, \"Keep the oil.\" I said keep the oil if you're going out there. Shouldn't have been there in the first place. You're going out. Keep the oil. We have a president that gave me an exact date when we're leaving. So now the enemy says, \"Oh that's good. Let's pull back for a little while we'll go in after they leave.\" Right? That's what happened. And you form ISIS and now ISIS is tough but not I mean tough for our people, not tough for General MacArthur not tough for General Patton. I mean we don't have the right people. We don't have the right people. So now they end up taking over the oil. They end up -- you know Iran has second and third largest oil reserves and there are a lot of people who don't know that Iraq has actually the second and third largest oil reserves in the world and massive oil reserves. We just gave it to Iran. They've been after it for forever. They've been fighting ever since the oldest person in this room was born. They've been fighting, right? Fighting ,fighting. They keep fighting, fighting. We just knocked out one. The other one walks and takes it over and says, \"Thank you very much.\" and also by the way closed the door on the way out and we're negotiating and Russia by the way is now making their missiles. Everybody that was doing the sanctions, you know is now participating and taking a lot of the money that we gave. Russia's doing armaments and missiles. Other countries are doing other things. Everybody but us. They won't deal with us. We are run by the stupidest people. It is so hard to believe what's going on with our country. So the Iran deal is a disaster. Syria is a disaster. You look at what's gone on with Libya. You look at what happened there. The migration started because of Hillary Clinton and because of -- and by the way I forgot to tell you very big. I love this Trump: 47, it's last night. Clinton: 44. Trump each time. That's good. That's good. That's good. Iowa before we start. OK, CNN Trump: 33, Cruz: 20. That's good. I like that one. Then we have. That's good. That's good. Oh I won't read you the one from one paper here. The Des Moines. I don't like that paper. It's dishonest but I mean what did they do like take 300 to 400 votes and I don't think I'm sure they'd never take three or four of them or 10 of them and put them in their pocket. I'm sure they would never have but that one and I'm not even down by much. I'm down by and then I'm winning and another one winning and another one. The other one came out last night and that's pretty even. It's like statistically tied. So we've got we've got to win, Iowa. We've got to win, OK. So we're going to win, OK. Otherwise I'll tell you what. Unless otherwise we're wasting our time, folks. We're wasting our time. I'm going to be a nice footnote because they're all saying even the Time magazine, he said, \"What an incredible job makes no difference if he wins or loses makes so what an incredible job.\" I don't want to be. We either win or we lose. There's nothing else dismal like he did a great job. It's like in baseball he did really good but they lost the game. One day nothing, OK. What difference is it makes no -- nobody, nobody. Oh I think she's found that very funny. So we have a couple of you know one of the things that I like about speaking randomly and off the cuff is that we can talk about things that happened 15 minutes ago and there's no teleprompter, right? We don't have teleprompters and we don't have speeches. We don't have speeches. I'd love to read a speech. It would be so easy, ladies and gentlemen. Thank you very much for being here. I love Iowa very much. It's great pa pa pa pa pa, right? We don't do that. We speak from the heart and we speak from the brain. You know I've -- I'm fortunate, I'm fortunate to have a very good memory so I can do this. But -- but you know and I do get certain credit for it. But the beauty is that we can speak about current events because if you have to go to a speechwriter and a pollster and then have them write four or five extra paragraphs, that's no good. So you look at North Korea. So we talk about Iran and that's a disaster but they don't have nukes yet. They will have them by the way unless I get to be president, if I get to be president promise you folks. They won't have them and Israel is the biggest target and they'll be very happy. They'll be very happy because Obama totally sold Israel out. He totally sold Israel out. But if you look at, if you look at North Korea this guy, this may -- I mean he's like a maniac, OK. And you got to give him credit. How many young guys? He was like 26 or 25 when his father died. He take over these tough generals and all of a sudden you know it's pretty amazing when you think of it, how does he do that even though it is a culture and it's a cultural thing. He goes in, he takes over. He's the boss. It's incredible. He wiped out the uncle. He wiped out this one, that one. I mean this guy doesn't play games and we can't play games with him because he really does have missiles and he really does have nukes. And here's what we do. We tell China, who -- we rebuilt China. They have taken so much of our money with trade. They have taken everything. They've taken our jobs, our money, they've taken our base. They've taken so much and literally it's one of the great thefts in the history of the world. What they've done to our country because we've had people that don't have any idea. By the way, go ahead you can clap. You know one of the one of the magazines said, \"Trump's a great speaker but he has one problem. He speaks through his applause.\" meaning I'll say something like that. I'll get applause but I -- you know why. Because I'm so excited about what we're all doing together and the future of the country that I don't want to hear your applause. I just want to give you the next because I know exactly what I'm going to say. Forget the applause but I really mean it. It's such an exciting thing that we're doing together and whether I go to Dallas where we had 21,000 people in the arena and the Mavericks arena. Mark Cuban was great to us whether we go to Mobile, Alabama. No matter where we go, Oklahoma we had 20,000. We had more. I think much more than that with as huge field. We had a big convention center. And after about two hours we realized that wasn't gonna work. They formed in a huge field thousands and thousands of people. We're all the same. You know we're all the same. We all want the same thing. It's amazing what's going on in the country. It really is. It's amazing. It's amazing. And you know you could call it a silent majority. You know they say, \"Oh you shouldn't use that word.\" because I don't know I guess it had connotations for many years ago with Nixon and this and that. But I don't even use the word. I say it's a noisy majority. It's no longer silent. We're fed up with what we're seeing and we've become a noisy, we're really a noisy majority. And believe me, we are a majority. If you get out and vote, if you don't get out and vote like last time, Obama should have lost. He was a failed president, doing a terrible job. And in all fairness, Mitt, I don't know what the hell happened. I said Why aren't you on television? why are you doing Jay Leno? Why aren't you doing David Letterman? Why are you doing these shows? Because say what? You want about Obama. He was on every show. He was on everything. And I say this. We're going to win. One of the reasons we're going to win is I think Hillary will probably look, she shouldn't be allowed to run, OK. Oh would I love to run against Ben. And some really bad stuff came out last night. I don't know if you saw it but basically last night she admitted that she's totally aware of what the hell's going on and she knows how to play the game pretty well but she shouldn't be allowed. Look, she shouldn't be allowed to run but on the assumption that they say because they're Democrats right now. That let's just close our eyes, close our eyes even though they destroyed General Petraeus and many other people who did far less than she did on the assumption that she runs. I don't think she has the strength or the stamina. She comes in and you need a president whether it's a nice thing or not to say we can't play games anymore. She'll come in to see Iowa. She'll come into Iowa and she'll see people hung around the little plastic table. A few people that have been vetted by 400 people and they'll get these kids. \"Miss Clint, what do you have for breakfast. Oh do you like oatmeal? Yes I did. Oh great.\" And then she'll leave and she'll wave and then she goes away for a week. You don't see her. One thing with me. \"Hey I'll be leaving here I'm going to another place. We're going to do the same thing all over again, OK?\" Oh, strength, stamina! We need strength and stamina. Look it's like I said about Jeb Bush. Guy's got no energy. We need energy. We need energy. He's a low-key individual. But we need energy because we've got ISIS. We've got borders that are a mess. We've got Obamacare that -- it's everything's a mess. We don't have victories anymore we don't win anymore we're going to start winning. We're going to win so much that you're going to sick and tired you're going to say, \"Please, please Mr. President, we're sick and tired of winning. Please let us have at least one loss. It's no longer exciting to win.\" and I'm going to say, \"No way, we're going to keep winning and I don't care if you like it or not.\" We have to win. We're going to win. I've been. I like to win. I like to win. So I just want to leave you with this. You do have a problem and you have a big round with North Korea. And we're going to talk to China. We're gonna get along great with China. And I love China because they buy my apartments they spend me you know, fortunes in Manhattan. They give me millions and millions of dollars for these apartments and they're great. The biggest bank in the world is a tenant of mine and one of my building's biggest bank by far. I mean when I talk about big, we're talking about seriously big. Citibank is like a little subsidiary compared to this bank and they make a tremendous amount of money with the United States as we've been talking about. We're going to go. They're willing to say you got to take care of that Korea problem. You got to take care of it. Everything comes through China and they tell our people because our people are novices but they say, \"Well, we don't have that much control. They have total control. They wouldn't eat. They wouldn't live without China.\" And China's massive. Everyone's afraid over there of China. China can't handle the problem. I want them to handle it. We don't have to handle everything. We handle everything. We don't have to. I will get China to handle the problem if they don't handle problem we'll have to take it up on trade. You know we're going to -- it's going to be very costly for them if they don't handle the problem. But I wouldn't say that because I would never want to threaten anybody, OK. Never under any circumstances I never want to threaten so I won't threaten them. I'm just telling you that they will do it and they should do it. And frankly they have a bigger problem than we do because they're right next door. And Japan has to help us out because they are really, I mean you know they're very suspect -- they would be. Look at what's going on over there. They're already sending planes to find out what's got -- what's happening. And South Korea has to help us out because we're defending South Korea. We're defending all these people. We need help. We need help. We're powerful. But I want to make our military very much more powerful. I want to make it so powerful, so tough, so strong that nobody's ever going to mess with us, folks. It's the cheapest thing we can do. It's the cheapest thing we can do. And I'll tell you this. I know all the politicians. Many of the people that I'm running against, I've contributed to. I've had notes and letters from some of these people. \"Thank you so much for the money you sent.\" Many of the people, it's embarrassing on the stage. I almost -- most of them, I've contributed to. I said this and you know. \"That one, yes that one, yes that one.\" It's like almost all of them in some form. And I said to myself It's not ridiculous. I'm running against these people. I have contributed to all of them. I understand politicians better than anybody. They're never going to get you to the promised land, folks. They're never going to take you there. They're never going to solve the problem at the border. They're never going to get you the wall. Now they're starting to say, \"Well we should build a wall.\" Remember this. Every time somebody says, \"We should build a wall.\" Please think about me, OK. Just think about me and they won't build it. And by the way, by the way, they will build it because they wouldn't know where to start. They're not going to build a wall but they've got to talk it because they're seeing that there's been a fever for Trump and for the wall and for the border. And when CNN did their recent poll who is the best on ISIS? Trump, by a vast majority. Not I'm talking about by close to 50% and you have 14 or 15 people. I'm getting 50%. Who's best on ISIS? who's best on terrorism? Trump by a vast majority. Close to 50%. Who's best on the economy? That's what I would expect. I'm way, way up. Way over 50%. I think over 60%. Well it's true. Who's best on jobs? Trump. I will be the greatest jobs president that God ever created. That I can tell you. That I can tell you. And we're going to be a resp --. we are going to be so important. We're going to be a respected country again. We're not going to be left out. We're not going to be smirked at. People aren't going to think of our leaders as being stupid people. We're going to be respected again. Mexico's going to respect us and we're going to respect them too. And we're going to get along with them just fine. But they can't keep taking Ford and Nabisco and so many of the companies that you have even in Iowa and New England was wiped out. You take a look at New England, what's happened there? Can't work that way. You know these deals have to be a double-sided deal. I'm a free trader. But I also want smart trade. It's got to be smart. And that doesn't mean we have to take advantage of others but it's got to be at least fair. So these things are going to happen. Carl Icahn, one of the great businessmen and so many others have called me. They'd like to get involved. If I took a Carl Icahn and if I took some of the others, all of whom you've heard of. These are the greatest in the -- where we have the greatest in the world. And I say, \"Carl take a look at China trade. With China I want to make it fair because they stuff -- they bring things over to us. No tax, no, nothing. You want to do business over there. It's almost impossible. And by the way they tax the hell out of you when you send your product. Not supposed to be that way. It's not supposed to be that way. It's supposed to be a fair deal but it's not a fair deal. I could tell you 100 stories. It's not a fair deal. So when I take somebody like Carl and other of the great business people, they don't want money. They don't want a salary. They're rich. They made a lot of money because they're smart, because they have that ability to negotiate and make deals. When I take Carl I'll say, \"Do me a favor, you watch over our trade with China.\" In a very short period of time you people are going to be very happy because that's the way it works because we're really good at what we do. And honestly I play with these people. There's no every single debate. I'm not a debater. I've won every debate according to the polls. I mean, I've won every debate. The last debate. No -- and you don't hear that from these crooked. You don't hear that from these crooked guys like Karl Rove is a totally dishonest guy. You don't hear that. They don't talk about that. And you know Krauthammer and others although Krauthammer is getting better. I must say he's coming a long way. He's doing much better. But -- but this Karl Rove, I mean some of these people are. So George will take his little spectacles away. He's a stupid person. I'm telling you without. No, no, no. Remember the war. You must go in and attack immediately. Now what you -- what do we have in Iraq, OK? Attack immediately. Take a look at his record. It's a horrible record. And I really mean it. Take those little spectacles away. And he doesn't look like a smart person. With the spectacles he looks smart. But every debate -- so when I came out I said, \"Let's see a debate.\" They said, \"How do you think you'll do on the first debate?\" I said, \"I've never done it before. What do I know? I've never done it before.\" And then Drudge who's a fantastic man by the way, but Drudge and you have slate and you have CBS and you have all these polls come down. I mean all great polls. Time magazine has a poll, online poll right now. I've won every single poll of every single company for every single debate. And I'm not a professional debater and I have hundreds of thousands of people. But I tell it like it is. I tell the truth I tell it like it is and I know how to fix our country. And you know what? If I don't make it, I'm going to love you folks just as much. And honestly if I don't win on February 1st, if you people don't do what you should do because I'm telling you I'm going to make America great again. But if you don't do it I will still love the folks in Iowa. Maybe no -- as I will still love the people in Iowa because I've developed so many friendships but I just think, so important going to make America great again. On February 1st you have to get to that caucus. You have to go out to a job and we're going to bring your friends. You know, don't sit home. Don't sit home. Get out there. It's so important. I think it's one of the most important elections we've ever had because our country is going to hell and we're going to turn it around and we're going to make it so great again and we're going to make it. In my opinion, we have a chance to make it greater and better than ever before. Thank you very much everybody. Thank you. Thank you very much. Thank you very much."}