{"id":481,"author":"Donald Trump","title":"Speech: Donald Trump in Clear Lake, IA","date":"2016-01-09","link":"https://factba.se/transcript/donald-trump-speech-clear-lake-ia-january-9-2016","paragraphs":["Wow. Beautiful. Thank you very much. This is -- what a beautiful part of the world, a little bit old out. But we'll take it, right? Beautiful. Thank you, everybody. We've had so much fun and I love Iowa. We've done really well here. The polls have just said we're even. You're the only one where I'm even.","We're winning every single national poll. We're winning every single state poll. We're even here. That's not going to happen, right? We don't want to even. Even's no good. Even's no good. I have a feeling we're going to surprise a lot of people on February 1st. A lot of people are going to be surprised. I have very little doubt about it actually.","And I just want to thank you all for being here. I know it's cold and I know you have a record crowd. They just told me the owners just said this is a record. We had big crowds but usually, people are sitting. They got rid of all the seats because we get a lot more people in. So I want to thank you. Our country is in trouble.","Very, very serious trouble. No matter what aspect of our country you look at whether it's the military which is not prepared -- you know, General Odierno just recently, when he left he said in terms of preparedness, we're the worst that we've been. Think of this, the worst that we've been, and I think he said since inception.","But let's take it back to World War II or World War I. We can't do that. We need strength in our military. And I'm going to build our military bigger and better and stronger than ever before, bigger and better and stronger. And hopefully, nobody's going to mess with us, and hopefully, by doing that, you know in many ways, that's the cheapest thing you can do. You know instead of ending up in these protracted wars.","I see the Generals so often. They're always being interviewed on television. Do you think General MacArthur was a big interviewer on television? Do you think that General Patton, George Patton went on television and they get interviewed. They say what we're going to do. How we're going to do it. I saw one of the Generals recently.","Nice guy, nice guy. And he's saying how tough ISIS is. Oh, they're very tough. Well, how are we going to do? I don't know. They're very tough. Can you imagine the enemies watching this and they're saying is this what we're fighting? Not going to happen anymore folks. We're going to have the toughest, smartest people.","We're going to have security, real security in our country. And by the way, while I'm on, I never mentioned the military without mentioning the fact that our vets are going to be treated great. They're going to be treated great. They're not treated right. We have illegal immigrants that are treated better, in many cases, than our vets.","It's not going to happen anymore. The Veterans Administration is a mess. It's corrupt. It's run poorly. Our vets are going to be treated well. So just put it down and guarantee it. It's going to happen, all right? One -- one other thing I have to say, you know, there's been a lot of talk that Iowa is going to go next cycle in the back of the pack, not going to happen, not going to happen.","This has been a great tradition. You know a lot of people are talking about putting Iowa now, this incredible tradition, and then you won't see me as much. It would be terrible, right? And I won't see you because it's not the same thing. Iowa's going to remain right where it is. It's going to remain right exactly where it is. So you can bank on it, folks.","You can bank on it. So the polls came out last night. Fox came out with a big poll and we did great. But we've been doing good from some -- from the beginning. My wife said, you know if you run you're going to win. Nice to have a wife that feels that, right? You know, a lot of wives would say, you know, if you run you don't have a chance.","Do me a favor darling, don't do it. She said if you run you're going to win. So from the beginning, we announced on June 16th, and almost right from that week, we have been like a rocket ship. And these characters back here. These press, some of the most dishonest people in the world, right there. Look, wave to them.","Some of the most dishonest. Honestly, some of the most seriously dishonest people in the world. I've never seen anything like it. No matter what you do it doesn't matter and it's just really sad now. I have to say 25% are good, and actually, the number is getting up. Time Magazine wrote a cover story in May, right?","You saw it. You got to go out and buy Time Magazine. I don't say this often. They wrote a cover story. You know I got a couple of covers. First of all, they said I should have won person of the year, right? They gave it -- They gave it to Chancellor Merkel who's got a serious problem. That was not a good move that was made in Germany, I want to tell you.","But everybody said, all the pundits were saying, yes, Trump is going to win. Trump is gone and everybody said you're going to win. I said, no, I won't because I'm not Establishment. They don't have the guts to give it to me. And I was right. I was right. So that's OK. But they wrote a story a few weeks before that I was the cover and that was OK. But this story is so well written.","I don't know. I never spoke to the writer. He just took the campaign which is all of us, folks. It's not me. It's all of us. Because no matter where I go, we go to Dallas 21,000 in Dallas at the Mavericks arena, packed. We go to Alabama 35,000 people, Mobile, Alabama. We go to Oklahoma, we had over 20,000 people standing in a field.","We had a convention center, it held 10,000 people. After about a day, we said, this isn't working. We just took a field and it was very, very windy. So I put a hat on, a Make America Great Again hat. But, but no matter where we go. And then in Iowa, we always have the biggest crowds. They were saying at our last venue, you know, I just left another place, right?","You know where I left. Where did I leave? Correct. And one of our top competitors, maybe our top competitor was there, had one fifth the crowd that we had. Same thing here. No matter who you get. And it's really a movement. What we're doing is a movement. It's called Make America Great. And we're going to make it greater than ever before.","We have a chance, I think with what we have going, with how great the people of this country are. We have a chance to make it maybe greater than ever before. And I mean it. And I mean it. I mean it 100%. It's exciting. It's really exciting to see what's happening and the crowds and the love, and you know, I tell the story, a friend of mine very, very one of the most successful people and he said, you're speaking tonight in front a different area about three weeks ago.","You're speaking in front of 20,000 people, and by the way, you saw Lowell, Massachusetts the other day. We had like 14, 50 -- Is somebody from Lowell? You're from Lowell, Massachusetts. She followed us here. Wow, that's amazing. But you know, we did something -- it's never been done like that. I mean, they don't even want to use that arena because it's too big.","It was packed and they sent away 5,000 or 6,000 people. It's like this, and my friend said to me, let me ask you, how do you do that? You have all those people and I insist on not using a teleprompter. I'd love to. Honestly, it would be so easy, right? Like our President, he reads. Ladies and gentlemen, thank you very much for being here.","Could you run it a little faster, please. . Thank you very much. It is wonderful to be in Iowa today. It's really great, big. OK. And goodbye everybody and that's the end. And everyone says, oh, that was fun. I would love -- I would love to do it. Or I'd love to read a speech where you take a speech and you read it and then you leave, right?","But I told this person, I said when you do that, number one, after a little while -- you know word of mouth on Broadway. I don't know. Anybody knows Broadway? The biggest thing on Broadway as great as a review would be in the New York Times in particular or whatever. The biggest thing on Broadway, always, history.","Word of mouth, right? The word of mouth and the word of mouth for us has been amazing. And it's me. But it's you. The word of mouth on these rallies has been incredible and they've just grown and grown and grown, and now, the only thing that stops them including today is the size of the arena or the place or the room with a ballroom or whatever we are.","And it's been incredible when you look at what's going on. Every time, we're packed. We haven't had a non packed house almost at all. I mean, it's just incredible. And it's a movement. And I think actually when it comes time I think, we're going to actually over perform. I have a feeling that far more people are going to vote than they even think.","And I think we're going to set a record in Iowa. And I have to tell you, Chuck and Sam and Stephanie, the whole group, they've done such an incredible job. But I really tell you that Chuck on February 2nd, OK? I'm not going to talk about -- because February that's what it's all about. And I was called by a great writer, a writer that is on the other side of the table from most of us, but a great writer.","And he said, I'd like to ask you one question, Mr. Trump, how does it feel? And I said I don't know what you're talking about. He said how does it feel what you've done? This is two months ago, three months ago, and the summer had just been ending. He said it's the summer of Trump. The entire summer, it's the summer of Trump.","Nothing like this has ever happened in American politics. You've changed the whole dialogue. You've changed everything about running a campaign. You've spent no money. You know you look at a guy like Jeb Bush, he's in for $68 million. He's down on the bottom of the barrel and he likes Common Core. Can you believe it he wants Common Core?","Educate your children by a bureaucrat in Washington, that's not going to happen, OK. But -- and by the way, by the way, and remember with the border they come over as an act of love. Remember that one? As soon as I heard that I said, he's gone. But he's spent $69 million, $68 million, $69 million, and I spent nothing.","I almost feel guilty. So what happened, he said to me, how does it feel? I said it doesn't feel anything. I haven't won. He said, no, even if you don't win, even if you got out today. What you've done has never been done before in American politics. I said let me tell you something, if I don't win, I will consider this a great big fat waste of time because we're not going to be able to make our borders strong.","Politicians can't do it. They're all talk and no action. They don't do it. All they care about is running for office and winning, and I said to him, I really mean that by the way. And they may say, oh, great job. You know, I mean, some of these guys did not do their Governors, their Senators. They're big people, they do a great job at their state.","They run, they get 1%, they leave they get nothing. They leave, they stay too long. They should get out quickly but they don't do that. And you know, we've done an amazing job. I mean, we've done an amazing job. But I really mean it. If we don't win, I will consider it a success because we have to go all the way.","Number one, I really want to win Iowa. It's so much easier if I said you know what, so much easier if I said very simply, no, I want to do well in Iowa. Because in New Hampshire, we're leading by a lot, a lot of people have already conceded that one. Well, I don't concede anything. South Carolina, we're leading by like 24 or 25 points.","In Nevada, next, we're leading by a lot and I'm leading with Hispanics by a lot and I said that to everybody. We're going to get the Hispanic vote because I'm going to take our jobs back from China, from everywhere. We're going to bring them back and people know that. So well, we're leading by a lot in Nevada and we're leading by a lot in the SEC.","The SEC has got Georgia, I mean, we have places that are unbelievable. Then, we go to Florida and I'm at 32 and a sitting Senator Rubio, nice guy. He's at 14 and Jeb Bush is down, I mean, as Governor, and he's down the bottom of the tubes. I mean, what's going on with this guy? And he's getting killed. And so you know, you say to yourself, well in fact, when I first heard, I said well, Florida is very important.","I love Florida. It's like a second home to me. I love Florida and I have a great relationship with the people in Florida also. And I said, you know, that's going to be tough though because you have a Senator even though he doesn't show up to vote very much. And I wouldn't be very happy about that. But you have a Senator a, sitting Senator and you have a Governor who is there for eight years and I'm saying to myself, well, that's going to be tough.","And the first poll came out and right from the beginning, I was clobbering everybody in Florida. So that's been -- that's great. And then of course, you know, you look at Massachusetts, I had won 52%, 52%. Well, that's because Tom Brady loves me though and I love Tom Brady. Tom Brady said great things about me, winner, winner.","Great winner. So Tom Brady and Tom Brady is a great winner. I don't know if you people like him too much around here but I'll tell you he's a great -- so that I think he helped me a little bit in Massachusetts. But -- so we're doing well everywhere. And I just feel, to me, that this would get the ball rolling.","If we win Iowa, such a big event for me. And I'm telling you, I should be -- so even my people they say, well, why don't you just say, we want to do well here. Meaning second, third, fourth, you know, I don't want to say that. I know it's safe because I know I say if I want to win and if for some reason we don't because you're too lazy to get out in caucus, OK? But I want to say, if we want to win, I just -- I want -- I know what they're going to do. They're going to say, he wanted to win.","It is a miserable upset for Trump. This is a horrible evening and they show every speech, I say, I want to win but you know what, folks? I don't care what they do. I want to win Iowa. I want to win. So I want to win Iowa. So here's the story. So you got to go out get Time Magazine because it was really great and the writer was fantastic.","And I haven't promoted a magazine like that in a long time but I want to tell you that guy got it. He has our understanding. He knows about the movement. He knows about -- they used to call it the silent majority. I'm calling it the noisy majority because we are angry and we are angry, we're angry at stupid people.","We're angry at people that don't know what they're doing. You know, it's funny I was saying last night, we were in South Carolina, it was an amazing -- they turned away 5,000 people. We had an arena that was packed and they turned away a five -- more than 5,000 people. And I was saying last night, it was very interesting that we are all angry at what's going on but we want to get it fixed and we're going to get it fixed and it's going to be so good.","And it's going to be so much fun and it is fun. I mean, I like doing this. Here it is a Saturday. I go Friday night, Saturday, all the time. I mean, I'm in Iowa and I'm going to see you, by the way, next couple of weeks. I'm going to be seeing you so much that you are going to be so sick of me. In fact, I said to Chuck and the people, I said do you think it's too much?","Maybe it's too much. Maybe they're going to get sick and tired. So and you know, we have a lot of energy. We're the opposite of Jeb. We have super energy but you know, we want, we want to -- I don't want to waste any time. We're on the cusp of something that's so great because listen to this, Reuters, I love Reuters.","Reuters, Trump, 42%, 42%. By the way, this is with like 15 people. That's a lot of people. I take 42% or 43%, I'd settle right now, 42% or 43%. Do you notice all the time? They -- I started off with like 4%. Then I go to 8%, then I go to 12%, then I go to 16%, then I go to 18%, then I went to 26%, 26%, and I held a 26% for two weeks and they were saying he's reached his plateau.","I just plateau and then I went to 28%, then I went to 30%, 32%. Now, we have Reuters, 42%, Cruz at 16%, Carson at 12%, Bush is so low. Let's, oh, wow. What's going on with that guy? $69 million. It shows you, you can't buy elections anymore. It's really true. I don't think, I think people are too smart for it. They're too smart.","You know, sort of interesting. I looked at it and I view it as something that you should all think about. So Jeb, who's a nice person. He is a nice person. He says he's lowered. That was a very badly described candidate. No, he's a little low energy but that's so -- we don't need low energy do we agree?","We need high energy Higher, do you think ISIS wants to know about low energy? You got to knock the hell out of them. Boom, boom, boom, you need a lot of energy. We need a lot of energy. China, ISIS. You know China, what they're doing to us in trade is unbelievable. I love China. The people are friends of mine, the richest people in China.","I mean, the biggest bank in the world is from China. They're tenants of mine. They buy my apartments. I have a lot of respect. Their leaders are too smart for our leaders. It's very simple. They're killing us. It's one of the great robberies of all time. So maybe the greatest theft in the history of the world.","The money and the jobs and everything that China has taken out of the United -- we have rebuilt China. They've taken it out of our country, out of the United States. We've rebuilt China. And you know what? We don't even know -- our people, the head of China comes here, they give him a state dinner. Hello, darling.","That's so cute. They give him a state dinner. I said don't give state dinners. Be nice, be respectful, but you've got to get to work. We will have the greatest negotiators anyway. You know we have the best businesspeople in the world. I have Carl Icahn endorse me. I have many others that interests me, the greatest business leaders.","They're going to represent us now, folks, they don't want any money. They're going to represent us believe me. We lost $505 billion, our trade deficit last year with China, $505 billion, and I think of it, $505 billion with just one country. With Japan, the cars, they pour in millions of cars. They pour in off the biggest boats.","You've never seen ships like this. You go to Los Angeles. These ships pull up, the cars pull up like it's a long island expressway. They go to like 40 miles an hour off the ship ditches one after another. You know, we give them practically nothing. Look at the trade deficit with Japan. We have the power over these countries where we can do right where we can come out ahead.","This shouldn't be happening but we have incompetent people negotiating. We have donors. We have people. We have political hacks. We're not using our best. You know, if you go to places like China, Vietnam is another one, hot as a pistol. They're doing great. Vietnam is taking business now from China, OK? Vietnam is China's big headache, not us, didn't worry about us because our people don't know what they're doing.","But Vietnam is doing a number on China and Mexico is going to be the new China because what they're doing to us is unbelievable, although, they did catch El Chapo. Good? Good? They did catch El Chapo. That's good. I mean, I don't know. He'd better not escape a third time. You know he's -- those tunnels, bing, boom, right under the toilet, bing, boom, right up. It's pretty amazing when you think about it, right?","But anyway, I have an idea. Put them on the fourth floor this time, right? No more. No more first floors. Anyway, but Mexico, I have a great relationship with Mexico. I have a great relationship with the Mexican people. I have thousands and thousands of people, Hispanics that work for me. Thousands of Mexicans over the years of work.","They're incredible people. They've worked for me. But you know what? Their leaders are too smart. What's happening is we don't have a border between the anchor babies, which by the way, and the press will say, you can't say that, I can say it. I was right on the anchor babies. I was right. We don't need a constitutional amendment to stop this craziness.","You have a woman, she's pregnant, she walks over, she has the baby, and now we're supposed to take care of the baby for 85 years or whatever it is. It doesn't say that folks. And the best lawyers in the world agree with me. And when I first made the statement, it just didn't make sense. But if you read the fine language, if you read the fine print, they came in, they're here illegally, they have a baby.","They don't leave the baby. The baby he isn't an anchor baby. We don't take care of that particular baby a person for 85 years. It doesn't read that way. And we don't need, by the way, we don't need a constitutional amendment. We don't need it, it's there. We need perhaps a vote of Congress and people are thinking that maybe, we don't even need that, and we should be able to get that frankly.","But we probably don't even need that. OK. Fox News, so Fox News comes out last night, 35% for Trump National, Cruz at 20%, Rubio at 13%, I'm winning by a lot, and they say, winning by a lot. OK, here's one that I really love. They didn't even cover it. They don't cover, you know, they don't want to cover these great numbers, right?","Donald Trump, against, did anybody ever hear of a person named Hillary Clinton? So this was just last night. Trump 47%, Clinton 44%, and I haven't even started yet. Look, I haven't even started yet. Although some people would say, a couple of days ago started, but believe me, that's not even starting.","That's just a warm-up. So here's what happened a couple of the commentators, I won't mention their names, but the Hillary Clinton people said, oh yes, we'd love to run against Donald Trump. Now, I called a couple up, and I said, folks the reason they say that is that they don't want to run against me, OK? They don't want to. The last thing she wants to be doing and Bill wants to be doing is running against Trump.","They would love to have somebody else who's a little more mild-mannered you know. Who won't bring up the truth, OK? I just tell the truth. They would like to have, OK? The last -- believe me. And I know Clinton. Hey, I've been friendly. When I was a business -- you know, they had -- can you believe I say when -- when I was a businessman, my whole life I've been a businessman, and now I say when -- Can I say that I'm still a businessman but I'm running for office because I hate to say I'm a politician.","Oh, these politicians are so bad. All talk, no action. That's these politicians. Nothing ever gets done. You're not going to make it. I'm telling you, you're not going to make it if you put some politician in there and I know them all. You know it's interesting. I was looking at the ones I'm running against.","I've contributed to most of them. Do you believe it? I've contributed to most of them. And one of them said, no, I don't think you've contributed to me. They found out I did. I contribute to every -- I've given the Democrats. I've given the Hillary. I've given to -- I've given it to everybody because that was my job.","I got to give to them because when I want something, I get it. When I call they, kiss my ass. It's true. They kiss my ass. True. True. But think of that. So here's a Trump 47%, Hillary Clinton 44%. I love it. Now in Iowa, CNN poll which is a couple of weeks old. But that's OK. I actually think it's the most accurate Trump 33%, Cruz 20%, that's good.","Now the one that came out last night has this pretty much, I guess, statistically even. And they'll be up and one came up where I'm up by a little bit but it's close. I don't want it to be close. We have to have a mandate. We have to get out and we have to have a mandate. I want to win by so much. Now I have to tell you, oh, by the way, New Hampshire.","Well, we're doing so good there. Well, look at this. Oh, look at this score, we're up 21 points, 21. I don't mean I have 21. I mean we're up 21. Here's one in South Carolina, Trump, CBS. Trump 38%, Cruz is second at 23%. Do you know what that is? I mean that's a massive difference. So we're doing good. We're doing good and we're going to do good here too.","We're going to win. We're going to come in first place. But let me tell you, Ted. So Ted's a nice guy and I like him and he likes me. A lot of other people don't like him by the way. I must tell you that. But I like him. Why do I like him? Because he's been very nice to me, all right? But here's the problem he's talking about natural-born citizen, right?","Now if he ever got the nomination, you know, the Democrats are going to bring a major suit. He was born in Canada. Whether we like it, don't like it, he lived there. He was there. He was born in Canada. I guess his parents voted in Canada. A lot of things. I mean a lot of things happen here. So if you're born in Canada, it's immediately a little bit of a problem.","Now gave up -- his gave up his citizenship like what, 16, 18 months ago, joint citizenship. Did he have a joint citizenship, right? But here's the problem. Laurence Tribe is from Harvard University Law School, very great lawyer and a constitutional expert. So he's on television last night and he said about natural-born citizen that this matter is not a settled matter.","It is wrong to say, this is an exact quote. It is a settled matter because it is not. Now just say you understand, that means there's a question. It's not a settled matter. He was born in Canada and I say to Ted, and as a Republican, I say it, because I think it's very important. You got to get it straightened out.","Now you can go for what's called a declaratory judgment, where you go to the courts and you say, there is a problem, where there's a problem of interpretation and you put a lot of papers in and you get a ruling from a judge because you cannot put somebody there, folks. That's going to go in and he's going to be immediately sued by the Democrats because they're saying he was born in Canada.","He's not allowed to run for President. And if there's that doubt, don't forget these lawsuits. Who knows more about these lawsuits than I do? I'm the king, I'm the king. These lawsuits take 2, 3, 4 years. So you can't have somebody running. You cannot have somebody running and have a lawsuit and people have already said they're going to bring the lawsuit.","They say if he gets the nomination, we're bringing a lawsuit as to natural-born citizenship. And honestly, I don't know because some people say you have to be born on the land, OK? You have to be born on the land. That's what I always thought before. You have to be born on the land. So he was born in Canada.","Now John McCain had the same problem. The difference is his two parents were both in the military. They were both in the military. And he was born in a military base, OK? I understand that. I mean it's a military base, OK? What are you going to do? Say, you know, Mom and Dad, you should have taken me back home to be born.","I can't run for President. He was born on a military base and I understand that. And by the way, Laurence Tribe represented John McCain on that, and he said, he was troubled by it. They won but he was always troubled by it. It bothered him. But he also understood it. But with Cruz he said it's a problem.","Now, if it's a problem they got to work it out because you can't give somebody a nominee -- I think we're going to win. Just so you understand, I don't want to be it like a negative person and I don't want to win this way. I don't want to win this way. I want to win fair and square and based on all the polls it looks like I'm doing awfully well.","But you can't have a person running for office, even though Ted is very glib, but he goes out and he says, oh well, I'm a natural-born citizen. It's the problem -- the point is you're not. I mean, you got to get a declaratory judgment. You have to have the courts come up with a ruling or you have a candidate who just cannot run because the other side will immediately bring suit and you've got that cloud on your head.","And you can't have that cloud on your head. You know, the Republicans have a structural disadvantage to start off with. Speaking of that, I think, I'm going to do great in New York. I think that -- they don't even talk about. Do you ever notice where they say you have to win Florida. I think I will. You have to win Ohio.","Now in Ohio is interesting because I do great in Ohio. I'm killing Kasich in Ohio. Everyone said, maybe you should make him your running mate and you'll win Ohio. I said yeah there's only one problem. I'm killing them in the polls. All right. You know it's the same thing like in Florida, where you're beating them and they say, why didn't you pick one of them?","So it's sort of interesting. Pennsylvania, we're going to do great. What they've done to the industries in Pennsylvania, like the coal industry, I guarantee I'm going to do great in Pennsylvania. But I think I'm going to do great in states that are not considered in play. I think New York. You know, they came out with a poll the other day, you probably saw it, upstate New York loves Trump.","And I think I do well in Manhattan too, I live there. But it's on a little liberal side. That's OK. You know what, that truth is whether it's liberal or not liberal, whether it's Democrat or whatever, people want safety. They want our country to be great again. They want lower taxes. So I think that I'm going to win states that these people up there, back there, with all of the cameras, they don't even talk about.","I think we're going to win states that aren't even talked about because the other people aren't going to win any of those states. I mean, there's not a chance. You know, Ted and Marco, and all these people are not going to win New York, and they're not going to have a chance of winning New York. I have a good chance of winning.","They like me. I mean, sometimes they think I'm a little wild but that's OK. But they like me in New York. I've, you know, I have employed thousands and thousands of people. I've built great, great projects in New York from the Wollman Rink, the little one to the biggest buildings. That's what I've done thousands, tens of thousands of people.","They like me in New York. So a place like New York, which isn't even thought of, hasn't been one in decades. All of a sudden, this time to say, you know, Trump would have a chance because upstate New York which is very sad what they've done with that. It's in serious trouble. Isn't -- because it's in such trouble, they think that I have a great chance of winning New York.","By the way, nobody else does. The other thing is, it just came out in one of the magazines and newspapers, that if Trump gets the nomination, they think he's going to take 20% of the Democrat vote. And I think so too. Do you remember the old -- the old little group of people that's so great. I love those people.","Some of them are still around. It was called Democrats for who? Reagan. Remember how many people voted for Ronald Reagan? We're going to have the same thing. And then our polling that stuff. We're going to have the same thing. Then, I'm going to do great with the -- I'm going to do great with Hispanics and I told you about Nevada where I won the poll in Nevada with Hispanics because I'm going to create jobs.","I'm going to do great with African-Americans because they know I'm bringing the jobs back from China and Japan and Mexico. I'm going to do great with African-Americans. So there was a poll that showed that I had 25% with African-American and 25%. Now, a Republican gets like 5%, 6%, 7%, like tops. So this poll came out said 25% for Trump.","The commentators were talking about it. They said let me tell you something if Trump gets 25% of the African-American vote this election is over. He wins. This is over. Now, I don't know if I'm going to get 25% but I have a great relationship to the African-Americans. They loved me. I love them. We're going to do great with -- we're going to do great.","We're going to do great I think with every group. I think we're going to do great with every single group. And it's just a very exciting period of time and it's very exciting to see what's happening. That I can tell you. Now, when I first announced, it was amazing. I have never seen so many cameras. It looked like the Academy Awards in Trump Tower and I said to my wife, you know, it takes guts to run for President.","I'm not a politician and it takes guts and I've always heard from day one. I've heard you can't run. If you're a very successful person you can't run for President. Maybe so, maybe it's not, but I said, it doesn't matter. Too many stupid things are happening. Too many people. They don't know what they're doing.","They're either corrupt, incompetent, maybe worse than incompetent or they have another agenda. I don't even know maybe there's another agenda. I don't really think so but maybe there's another agenda out there, folks, that we don't even know about. But there's something going on because there's so many things that are so simple like the Iran deal.","How do you give $150 billion? We get nothing in that deal. Nothing. Think of it. We don't even get our prisoners back. Now, we don't even get our prisoners back. And now Iran wants to start negotiating for the prisoners. Do you believe this? But they said we want very, very much. Oh man, you just get sick when you see it. So they're getting $150 billion and what we should have done, first of all, nobody even knows when there's still so -- it's been going on forever.","But what we should have done is right at the beginning, right smack in the middle, right at the beginning of this thing, you go and say, we want our prisoners back, right? You want our prisoners back. They never asked for the prisoners. You know that Kerry, who's just the worst negotiator, and by the way, the Persians are great negotiators, OK? And the guy that negotiated against him.","I've watched him. He's a master negotiator. So Kerry said he never wanted to do that. He never wanted to ask about the prisoners because he didn't want to complicate the deal. Can you believe it? No, no, that's what he said. He didn't want to complicate the deal. So there's still there for years. One of them's there because he's a Christian pastor.","He's a pastor. He's a Christian. He's there. Washington Post has one of their reporters there. None of these people should be there. They're hostages really, I mean, call them prisons but they're actually hostages. So what happens is you go in, you need the right messenger, and you say to them, we're going to have our prisoners back.","This is three years ago, four years, whenever it started. We want our prisoners back. Got to have them back before we start to negotiate. They'll say no. And what we say is bye-bye. Enjoy yourself. We're leaving, bye, and wave goodbye. Get up leave. Leave. They should've left that negotiation four or five times by the way.","Instead of sitting there. So you get up and you leave. Now what you do is you ratchet up the sanctions and you bring them up a couple of steps. You double or triple them, I don't care, quadruple them, give them nothing. But you bring them up and you bring them up, you know, double them. I guarantee you within 48 hours they will be calling, saying, three years ago, saying, we're giving you your prisoners.","When can we start negotiating, OK? Now, you wait until the prisoners are on the plane. You wait until they're over American soil. You wait maybe until they're landing, and you have your next meeting, right? Now you tell them you're not giving them the $150 billion because we don't have it. The country is bust.","We don't have it. We don't have it. We want to give it but we don't have it. We can't give you the money. We don't have it. I'm sorry, folks. So let's, number one, put that in your head. So they'll be angry as hell but don't worry about it. They'll get over it. And then, you make a deal and you make a good deal.","And you have your prisoners and you didn't give them the money. The hardest thing for me to do, if I win, I'm going to go in, and I'm not going to have that $150 billion, it'll make -- it'll drive me nuts. I just hate the concept of giving away that much money so stupidly. And now they call and they say, we are now prepared to negotiate for the prisoners but we want a lot.","Can you believe the stupidity of these people? Now, I used to say this is one of the greatest deals of all time but I'm wrong. Do you know the greatest deal of all time? And I just sort of figured this out two weeks ago. What did they get? In addition to this great deal with the money and how about this, 24 days for inspection.","So we say, oh, we hear they're building nuclear. Oh, please let us know. Now before they get to the 24 days before the clock starts ticking, they have to go through a whole process, right? It could be forever, but even worse, they have certain areas where they have self inspection. Think of Iran with self inspection.","We hear you're building nuclear. Oh well, let us go and inspect. We will inspect and we will call you back tomorrow. Mr. President, I promise we're not building nuclear there. This is madness, OK? How we could have agreed to this is just insane. And it will lead to nuclear proliferation as sure as you're sitting there.","You already see what's happening with Saudi Arabia. And if you think that Iraq and if you think that, you know, you look at what's going on, because the greatest deal they've ever made is Iraq. They're getting Iraq for nothing. They've been fighting for Iraq forever. Since I was born. They've been fighting -- they've been fighting, right?","They have two equal countries in terms of militarily. They go this, they fight, they fight, 10 feet this way, 10 feet that way, this goes on forever. Then they rest for a couple of years. Then they go back and fight, right? Then Saddam Hussein with the gas, then the other one with gas, then they say we'll take a truce.","They rest. They go back to fight. What the hell? How did we ever get -- we should have never been there in the first place. And I said that. I said that. I said it. We have to rebuild our country. We have to rebuild our infrastructure, our roads, our schools, our bridges are falling down, and we're pouring money.","We don't know what the hell we're doing. And I said it in '04 and even '03 it came out, Trump opposed to the war. I was totally opposed to the war and a more militarist -- I tell you what, I am more militaristic than anybody in this room, anybody. I want that strong military. I want it so bad because we're not going to have to use it. Were probably not going to have to but you know what, we have to have it. We have to build it up. I'm in the real estate business.","It seems like all the time, I'm getting these listings, army base for sale, naval base for sale, air force for sale, air force base for sale. I mean, I say how many places do they have? We're always selling these bases all the time. They're being sold. We need a strong military. We need a powerful military, OK? And we don't have it. We just don't have it. So we're going to change things in this country.","We're going to use our heads. We're going to be so smart. We're going to be so cunning. I just said in the other room, we're going to win so much. We're going to win on militarily. We're going to knock the shit out of ISIS. We're going to -- we're going to win with healthcare. You know, if you look at Obamacare, Obamacare, the premiums up 25%, 35%, 45%. It's a disaster.","It's going to col -- look, you know, it's going to collapse in '17, OK? In '17 it has to collapse. It's not going to make it. But we're going to terminate it and we're going to replace it with something so much better, cheaper for you, cheaper for the country. The country can't afford it. It's no good. And by the way, do you see your deductibles?","You have to be dying for years before you get any money. You have to be so, so bad, you're not going to get any money. The deductibles are through the roof and the premiums are going up so fast that it's a disaster for everybody. So we need healthcare. We need so many different things. And what else do we need?","We need a strong border. And what do we need? We need the wall. We're going to build a wall. We're going to build a wall. I mean, look do you remember? So when I came down in the atrium of Trump Tower with my wife, she's going down and she was very elegant, and I'm waving and I'm saying what the hell am I doing?","Why am I doing this, right? And I'm going down in front of all of these people and all of these killers that are back there. Just accept like -- oh, they have a lot of people back there. But I mean, you never saw -- this look. I'm telling you it looked like the Academy Awards and I went up and I mentioned -- I talked about illegal immigration and I took heat like nobody has ever taken heat and I always said, Rush Limbaugh said, that Donald Trump has taken more incoming than any human being I've ever seen, right?","And I took a lot of heat. And then about two weeks later, it started dying down and then you had the killing of Kate, who is such an amazing person, and you had the killing of Jamiel in Los Angeles. Jamiel Shaw who is an amazing young man getting ready to go to college, football player, good student, great father is a friend of mine and just an amazing guy, shot in the face by an illegal immigrant who is over here.","Should have never been here. Should have never been allowed to be here. You had the woman killed recently in California, a beautiful, wonderful, 66-year old veteran. She was raped, sodomized, and killed by a person that should have never ever been allowed to be here and many, many more. This is just many, many, many more and people started saying, you know, he's right.","He's right. And now that's not even controversial. And now, the other day, I'm watching Ted Cruz and he's saying, yes, and we will build the wall. I said where the hell did that come from? It's true. And my wife said to me, darling, you have to hear this. And if it wasn't for TiVo, I wouldn't have been able to hear it myself.","It's great. This TiVo was fantas -- I run it back. She said, somebody just said, he's going to build a wall. That's the first time I've ever -- she's really into this. She watches it all the time. Everybody is, every -- I could tell you names. People that you wouldn't bel -- they watch it. They love it. We had 24 million people at the debate.","The biggest in the history of cable television. Not debate, I mean, show, 24 million. CNN had 23 million people watch the biggest audience in the history of CNN. This isn't me talking. This is CNN putting out a release. The biggest audience. Now, let's say Trump isn't involved, OK? Let's say it's Rand Paul, ey, Jeb Bush, uh, I don't want to mention everybody because some people I like so much.","But so -- I'm not going -- but let's say it's OK, the cast of characters, right? Those debates used to draw flies. They didn't draw anybody. Nobody went to watch the debates. In fact, the networks didn't even want them. I think they had to take them as part of their license. You're not going to get a license unless -- they didn't even want them.","Now, they say can we make them three hours? Can we make it 10 hours? I mean, they want -- it's crazy what's going on. The debates. And everybody knows why variety does a story. The Trump debates, right? All of the different places do a story. The Hollywood Reporter. Good, good magazine. They do a story, beautiful story to me but they call the Trump debates.","It's great. And the beauty is that if I run against Hillary, they say it's going to be the largest voter turnout in the history of the United States and I believe that. And they also said and CNBC said it and other people said it. They said that not only it's going to be the largest voter turnout but many of those people that come in, they're sick and tired of these phony, corrupt politicians like Hillary.","They're sick and tired and they're going to vote for Trump and we're going to have a big victory. We're going to have a big victory. We're going to have a big one. We're going to have it big. So when I started, I came down, beautiful escalator, wonderful building, Trump Tower. Go check it out sometime. You got to check it out.","Got to buy Time Magazine first and then check out Trump Tower and then log on and then come on to @realDonaldTrump. You know it's great. This stuff is great. This Twitter, it's so incredible. I have like between Twitter and Facebook and Instagram, I have like, 11 million or 12 million followers, 11 million.","That's like, it's sort of like owning the New York Times without the losses. Can you believe that? No, it's like incredible. It's incredible. I just I did something the other day I did a tweet on something and I'm watching -- I'm home taking it easy. I'm reading the papers. I did a tweet and CNN breaks, we have breaking news.","Donald Trump has just announced some little thing about somebody, not doing a good job, someplace, right? Donald Trump has just announced that Jeb Bush is low energy. Breaking news. No, it's like crazy. It's the most incredible form. It's so quick. It's so incredible and they watch it. You know, if you're a certain person, they watch every tweet, they put out.","You got to be careful a little bit. You know, if you make a spelling mistake, they'd kill you. If you make a typo. I got to be so careful. If I do a typo, you know, a little typo. It's like, it's like death. They just go, they go wild. They put her on look at this man, look at this man. This is horrible, this is a horrible typo but it does give you a tremendous amount of power.","So @realDonaldTrump everybody go on, not that it matters it's such a -- I mean, adding a few thousand people doesn't mean anything, right? When you have millions but there are people from Iowa and you have tremendous power because you're going to really be setting the agenda. It's so important what you're doing.","So, so when I began, when I began, it started off and I was talking about the border, I was talking about trade, I was talking about China, and I was talking about all of these countries that have been ripping us off and taking our money and just destroying us and leaving us poor and leaving us without jobs and all of the things that have happened, all of the things that are true.","Newton, Iowa, I'm a big fan of Newton because there were on 60 Minutes, just like I was, Newton -- Are you from Newton? Oh, she's not but she knows. And they took businesses out of Newton and they moved into Mexico and they had a big piece on 60 Minutes and I talked about Newton. I helped the people in Newton.","I felt badly. These were great people where a daughter was unable to go any further in college and things and I helped them out and I feel really good. I didn't know I'd be doing this. That was years ago. The people of Newton, let's put it this way, they like Donald Trump, but it was very unfair. I mean jobs were taken, companies were taken, it was ridiculous but that's happening all over the country.","So when I first came down, I said, it was about trade and it was about the border and it was about Obamacare, repealing and replacing Obamacare. It was about different things. And then we had Paris and then we saw hatred, hatred like we've been watching. Don't forget, the World Trade Center was hatred. And in my book that I wrote two years before, The America We Deserve, I talked about Osama bin Laden.","And Joe Scarborough who's a great guy, said, no, wait a minute. When did he talk about this? Well, a couple of years before the World Trade Center came down he mentioned Osama bin Laden. No way. There's no way. Show it to me and they looked and they found out. I talked about Osama bin Laden, school vision folks, in all fairness.","I said don't go into Iraq. I said Osama bin Laden and you got to take these guys out. The reason I talked about them was I saw him on television and I saw him in the papers and I said, this guy's a bad guy. Well, a couple of years later, he knocked down the World Trade. So they should have taken him out.","And Bill Clinton had a chance to take him out and he didn't do it by the way. Bill Clinton had a chance to take him out and he didn't do it. If he did it, you would have the World Trade Center probably standing right now. So I said, you know, amazing. And people said that's amazing, he was talking about Osama bin Laden before the World Trade Center.","So you do need the vision. But I was talking about these different things and then what happens is you have a very horrible thing and we know what that is, Paris was terrible. Then you had recently California, which was horrible, 14 people just killed by people that threw wedding receptions for them, and threw anniversary, everything, they were friends of theirs and they walked in and killed them.","There's something going on there's something wrong here. And then Paris, and fortunately, the press, you know, they were calling him a mastermind, right? This guy, I call him the guy with a dirty hat. The dumb guy with a dirty hat. You have to demean these people because what's happening is they, ISIS and others, are using the Internet to take our children's minds and to radicalize our children and we won't even know about it and they're going to places and they show up at the places.","I mean, it's -- they become -- they join ISIS and they join al-Qaeda and they join other -- it's disgusting what's going on, right? And so I said, we have to get to the bottom of all of this. And I said it very strongly and very vividly. And I told the anchors, please don't call the leaders masterminds, call them people with very low IQs that a -- no good.","And I called the white, you know, with the white hat, I call him the guy with the dirty white cap, right? He had the white ski thing on. And he -- what is he a mastermind? Why is he a mastermind? He sends guys in, you go there, you go there. Now think of this because I'm big for the Second Amendment. We got to save our Second Amendment, folks.","We've got to save it. We've got to save. So, so if you go in, if you go in and you have Paris. We have a number of places and they put these thugs in there with guns. The toughest gun laws in the world, they say, is France and Paris, the toughest in the world. You can't have a gun. Unless you're a bad guy, you have a gun.","You walk around with a gun, right? But if you're a person that's a law-abiding person, you're not allowed to have a gun. So in Paris, these thugs, these dirty, rotten, very stupid, demented people, walk in, and they say, get over boom, get over boom, not one gun in the room except for the bad guys, right?","Get over. They kill 130 with more to come because you have some really badly wounded people in the hospitals that many of whom won't make it. So you have 130 people at a hospital load of horrible, horrible injuries. For what? I guarantee you if that guy right there had a gun on his ankle and if that guy right there had a gun in his waist and have this one over here, the tall one with the glasses or even the short one or the woman, she looks tougher than all of them.","But if there were some guns on the other side where you'd have bullets going in both directions, it wouldn't be that way. It wouldn't be that way. Same thing in California with these two horrible people, right? These two horrible people that knew everybody in the room. They were sort of friends I guess but they knew everybody in the room.","And if you had a gun on the other side, it would have been a fight, and you wouldn't have the kind of carnage and the horror show that you had. We have to protect our Second Amendment. Remember that. And with me, again, it's going to be protected. And just one other thing you have gun-free zones. That is like bait to a bad guy.","This is a gun-free zone. Now, we had the five military people killed not so long ago, right? On a military base, signs all over the place, this is a gun-free zone. One of the five was one of the all time great soldiers has every record. He was a great marksman, not allowed to have a gun. He can't have a gun.","So they have gun-free zones. The guy seizes a gun-free zone, OK? Seizes a gun-free zone, walks in, kills these five people. If they have guns, believe me, it doesn't turn out that way. Turns out to be a much -- they were standing there. There was nothing they could have done. He walks in fully loaded. They had their guns 200 yards away, locked up. The first thing I'd do, one of the first things is, so many things to do, but we get rid of those gun-free zones, especially on military bases, it's ridiculous.","It's ridiculous. So just a finish. There's so many things that our country can do. It's common sense. It's smart. We have to be so vigilant. We have to watch. We have to see what's happening. And when I brought up a certain subject about radical Islamic terrorism a couple of weeks ago, I was met with unbelievable, similar to what I talked about illegal immigration.","And by the way, when CNN came out with their poll two weeks ago, I lead with ISIS by a lot. I lead with everything. I lead with immigration. I lead with ISIS. I lead with terrorism and I don't mean by little. I'm over 50% with most of them. I lead with the economy that we sort of expect because I will be the greatest jobs President that God ever created.","That I could tell you. The greatest. I'll be the best. But when I brought up, when I brought up radical Islamic terrorism, a word -- words the President of the United States refuses to say. Now, if you don't say the problem, and if you don't know what the problem is, you're never going to solve the problem.","You're never going to solve it. There's nothing wrong with him saying we have a problem. I mean, the World Trade Center got knocked down. People are being killed all over the place. By the way, when I left today, Cologne, Germany, which is one of the most peaceful places, they're having riots in the street.","People have been just beat to hell. Women have been raped. What's going on in Germany is unbelievable and we have to be smart. We can't take these people from the line that we have no idea who they are. You know, we all have heart and the migration is a terrible thing, caused to a large extent, by Obama and Hillary Clinton with their policies that was so stupid.","So, so totally and grossly incompetent because really by them. So what happened -- and others, but really by them more than anything else, you look at what they've done with Libya with Syria. The whole thing, everybody. They -- I don't think they've done one right thing. Even a few things, look, 50 soldiers, we're going to send 50 soldiers, OK? A couple of -- two months ago.","So Obama gets up, he announces, we're going to send 50 people. First of all, he thinks it's wonderful, 50 doesn't sound -- these are elite soldiers. These are great people. These are unbelievable men, women. These are the finest. What the hell does he have to say it for? Because now they have a target in the back and the enemy is looking for those 50 people.","If he would have just kept his mouth shut he could -- and you know what? For the purpose of PR, when you say 50, people say 50, it's actually bad. It's not even good. But why does he have to say? Why does he have to say we're getting out? We should have never been in Iraq, folks, but we shouldn't have gotten out the way we got out.","We shouldn't have gotten out the way we got out. I mean, I would -- I hated what they did. I hated what they did with Iraq. But we shouldn't have gotten out, and he goes out and he announces, he announces the date that we're leaving. And I said, oh, that's smart because I think it is camouflage, right? I figured he'd never leave.","He leaves that date. So the bad guys and don't kid yourself, they don't want to die. You read all about, you know, they want to die. Bullshit. They don't want to die, OK? They don't want to die. And let me just tell you another thing, their families know everything that they're doing. Just like your families know everything that you're doing.","Their families know everything. And they care more about their families than they care about themselves. They don't want to die but they care more about their families than they care about themselves and their wives know and their children know. And they knew everything about the World Trade Center and they knew what was going on. And those people in California, they had pipe bombs all over their place, all over their apartment and there were numerous people that knew and they could have reported them to the police.","And you wouldn't have had the problem but they didn't want to do it. So something bad is going on. And before we do anything and before this country goes totally to hell, we better get smart. We better get away from these stupid politicians that don't have it. And we better do it right because we're not going to have much of a chance.","We're not going to have much of a chance. So, so it's become largely, and even at the rallies, everybody has great confidence in me with China and with all these places, and don't worry about it. We'll take great care of that whole situation and we'll get along great with them. It'll be fine. We're going to be -- do great.","We're going to do great but we're going to strengthen our borders and we're going to get along great with Mexico. They're going to respect us more. They don't like us now. They take advantage and they don't even like us. I mean, Ford is building a $2.5 billion plant there. And Nabisco, moving their factory there from Chicago.","They're closing the factory in Chicago, moving it to Mexico. That doesn't help us, folks. That -- I went to the greatest schools. I went to the Wharton School of Finance and went to Ivy League college. You know what that doesn't help. You don't have to go to college too, right. That doesn't help us. It does nothing for us. We're going to have respect.","We are going to be respected by other countries now. We're not respected. It's funny, we're like the big fat bully that gets his ass kicked all the time. Nobody, nobody respects it. That's what we are. We don't win anymore. And what I said before is this. We are going to win so much that you people are going to get so tired of it. You're going to beg me, please, please, no more victories, Mr. President, no more victories.","We can't take it anymore. Give us at least one or two failures and I'm going to say no way we're going to have failures. We're going to win all the time and we are going to Make America Great Again. I love you. Thank you. February 1st, get out and vote."],"text":" Wow. Beautiful. Thank you very much. This is -- what a beautiful part of the world, a little bit old out. But we'll take it, right? Beautiful. Thank you, everybody. We've had so much fun and I love Iowa. We've done really well here. The polls have just said we're even. You're the only one where I'm even. We're winning every single national poll. We're winning every single state poll. We're even here. That's not going to happen, right? We don't want to even. Even's no good. Even's no good. I have a feeling we're going to surprise a lot of people on February 1st. A lot of people are going to be surprised. I have very little doubt about it actually. And I just want to thank you all for being here. I know it's cold and I know you have a record crowd. They just told me the owners just said this is a record. We had big crowds but usually, people are sitting. They got rid of all the seats because we get a lot more people in. So I want to thank you. Our country is in trouble. Very, very serious trouble. No matter what aspect of our country you look at whether it's the military which is not prepared -- you know, General Odierno just recently, when he left he said in terms of preparedness, we're the worst that we've been. Think of this, the worst that we've been, and I think he said since inception. But let's take it back to World War II or World War I. We can't do that. We need strength in our military. And I'm going to build our military bigger and better and stronger than ever before, bigger and better and stronger. And hopefully, nobody's going to mess with us, and hopefully, by doing that, you know in many ways, that's the cheapest thing you can do. You know instead of ending up in these protracted wars. I see the Generals so often. They're always being interviewed on television. Do you think General MacArthur was a big interviewer on television? Do you think that General Patton, George Patton went on television and they get interviewed. They say what we're going to do. How we're going to do it. I saw one of the Generals recently. Nice guy, nice guy. And he's saying how tough ISIS is. Oh, they're very tough. Well, how are we going to do? I don't know. They're very tough. Can you imagine the enemies watching this and they're saying is this what we're fighting? Not going to happen anymore folks. We're going to have the toughest, smartest people. We're going to have security, real security in our country. And by the way, while I'm on, I never mentioned the military without mentioning the fact that our vets are going to be treated great. They're going to be treated great. They're not treated right. We have illegal immigrants that are treated better, in many cases, than our vets. It's not going to happen anymore. The Veterans Administration is a mess. It's corrupt. It's run poorly. Our vets are going to be treated well. So just put it down and guarantee it. It's going to happen, all right? One -- one other thing I have to say, you know, there's been a lot of talk that Iowa is going to go next cycle in the back of the pack, not going to happen, not going to happen. This has been a great tradition. You know a lot of people are talking about putting Iowa now, this incredible tradition, and then you won't see me as much. It would be terrible, right? And I won't see you because it's not the same thing. Iowa's going to remain right where it is. It's going to remain right exactly where it is. So you can bank on it, folks. You can bank on it. So the polls came out last night. Fox came out with a big poll and we did great. But we've been doing good from some -- from the beginning. My wife said, you know if you run you're going to win. Nice to have a wife that feels that, right? You know, a lot of wives would say, you know, if you run you don't have a chance. Do me a favor darling, don't do it. She said if you run you're going to win. So from the beginning, we announced on June 16th, and almost right from that week, we have been like a rocket ship. And these characters back here. These press, some of the most dishonest people in the world, right there. Look, wave to them. Some of the most dishonest. Honestly, some of the most seriously dishonest people in the world. I've never seen anything like it. No matter what you do it doesn't matter and it's just really sad now. I have to say 25% are good, and actually, the number is getting up. Time Magazine wrote a cover story in May, right? You saw it. You got to go out and buy Time Magazine. I don't say this often. They wrote a cover story. You know I got a couple of covers. First of all, they said I should have won person of the year, right? They gave it -- They gave it to Chancellor Merkel who's got a serious problem. That was not a good move that was made in Germany, I want to tell you. But everybody said, all the pundits were saying, yes, Trump is going to win. Trump is gone and everybody said you're going to win. I said, no, I won't because I'm not Establishment. They don't have the guts to give it to me. And I was right. I was right. So that's OK. But they wrote a story a few weeks before that I was the cover and that was OK. But this story is so well written. I don't know. I never spoke to the writer. He just took the campaign which is all of us, folks. It's not me. It's all of us. Because no matter where I go, we go to Dallas 21,000 in Dallas at the Mavericks arena, packed. We go to Alabama 35,000 people, Mobile, Alabama. We go to Oklahoma, we had over 20,000 people standing in a field. We had a convention center, it held 10,000 people. After about a day, we said, this isn't working. We just took a field and it was very, very windy. So I put a hat on, a Make America Great Again hat. But, but no matter where we go. And then in Iowa, we always have the biggest crowds. They were saying at our last venue, you know, I just left another place, right? You know where I left. Where did I leave? Correct. And one of our top competitors, maybe our top competitor was there, had one fifth the crowd that we had. Same thing here. No matter who you get. And it's really a movement. What we're doing is a movement. It's called Make America Great. And we're going to make it greater than ever before. We have a chance, I think with what we have going, with how great the people of this country are. We have a chance to make it maybe greater than ever before. And I mean it. And I mean it. I mean it 100%. It's exciting. It's really exciting to see what's happening and the crowds and the love, and you know, I tell the story, a friend of mine very, very one of the most successful people and he said, you're speaking tonight in front a different area about three weeks ago. You're speaking in front of 20,000 people, and by the way, you saw Lowell, Massachusetts the other day. We had like 14, 50 -- Is somebody from Lowell? You're from Lowell, Massachusetts. She followed us here. Wow, that's amazing. But you know, we did something -- it's never been done like that. I mean, they don't even want to use that arena because it's too big. It was packed and they sent away 5,000 or 6,000 people. It's like this, and my friend said to me, let me ask you, how do you do that? You have all those people and I insist on not using a teleprompter. I'd love to. Honestly, it would be so easy, right? Like our President, he reads. Ladies and gentlemen, thank you very much for being here. Could you run it a little faster, please. . Thank you very much. It is wonderful to be in Iowa today. It's really great, big. OK. And goodbye everybody and that's the end. And everyone says, oh, that was fun. I would love -- I would love to do it. Or I'd love to read a speech where you take a speech and you read it and then you leave, right? But I told this person, I said when you do that, number one, after a little while -- you know word of mouth on Broadway. I don't know. Anybody knows Broadway? The biggest thing on Broadway as great as a review would be in the New York Times in particular or whatever. The biggest thing on Broadway, always, history. Word of mouth, right? The word of mouth and the word of mouth for us has been amazing. And it's me. But it's you. The word of mouth on these rallies has been incredible and they've just grown and grown and grown, and now, the only thing that stops them including today is the size of the arena or the place or the room with a ballroom or whatever we are. And it's been incredible when you look at what's going on. Every time, we're packed. We haven't had a non packed house almost at all. I mean, it's just incredible. And it's a movement. And I think actually when it comes time I think, we're going to actually over perform. I have a feeling that far more people are going to vote than they even think. And I think we're going to set a record in Iowa. And I have to tell you, Chuck and Sam and Stephanie, the whole group, they've done such an incredible job. But I really tell you that Chuck on February 2nd, OK? I'm not going to talk about -- because February that's what it's all about. And I was called by a great writer, a writer that is on the other side of the table from most of us, but a great writer. And he said, I'd like to ask you one question, Mr. Trump, how does it feel? And I said I don't know what you're talking about. He said how does it feel what you've done? This is two months ago, three months ago, and the summer had just been ending. He said it's the summer of Trump. The entire summer, it's the summer of Trump. Nothing like this has ever happened in American politics. You've changed the whole dialogue. You've changed everything about running a campaign. You've spent no money. You know you look at a guy like Jeb Bush, he's in for $68 million. He's down on the bottom of the barrel and he likes Common Core. Can you believe it he wants Common Core? Educate your children by a bureaucrat in Washington, that's not going to happen, OK. But -- and by the way, by the way, and remember with the border they come over as an act of love. Remember that one? As soon as I heard that I said, he's gone. But he's spent $69 million, $68 million, $69 million, and I spent nothing. I almost feel guilty. So what happened, he said to me, how does it feel? I said it doesn't feel anything. I haven't won. He said, no, even if you don't win, even if you got out today. What you've done has never been done before in American politics. I said let me tell you something, if I don't win, I will consider this a great big fat waste of time because we're not going to be able to make our borders strong. Politicians can't do it. They're all talk and no action. They don't do it. All they care about is running for office and winning, and I said to him, I really mean that by the way. And they may say, oh, great job. You know, I mean, some of these guys did not do their Governors, their Senators. They're big people, they do a great job at their state. They run, they get 1%, they leave they get nothing. They leave, they stay too long. They should get out quickly but they don't do that. And you know, we've done an amazing job. I mean, we've done an amazing job. But I really mean it. If we don't win, I will consider it a success because we have to go all the way. Number one, I really want to win Iowa. It's so much easier if I said you know what, so much easier if I said very simply, no, I want to do well in Iowa. Because in New Hampshire, we're leading by a lot, a lot of people have already conceded that one. Well, I don't concede anything. South Carolina, we're leading by like 24 or 25 points. In Nevada, next, we're leading by a lot and I'm leading with Hispanics by a lot and I said that to everybody. We're going to get the Hispanic vote because I'm going to take our jobs back from China, from everywhere. We're going to bring them back and people know that. So well, we're leading by a lot in Nevada and we're leading by a lot in the SEC. The SEC has got Georgia, I mean, we have places that are unbelievable. Then, we go to Florida and I'm at 32 and a sitting Senator Rubio, nice guy. He's at 14 and Jeb Bush is down, I mean, as Governor, and he's down the bottom of the tubes. I mean, what's going on with this guy? And he's getting killed. And so you know, you say to yourself, well in fact, when I first heard, I said well, Florida is very important. I love Florida. It's like a second home to me. I love Florida and I have a great relationship with the people in Florida also. And I said, you know, that's going to be tough though because you have a Senator even though he doesn't show up to vote very much. And I wouldn't be very happy about that. But you have a Senator a, sitting Senator and you have a Governor who is there for eight years and I'm saying to myself, well, that's going to be tough. And the first poll came out and right from the beginning, I was clobbering everybody in Florida. So that's been -- that's great. And then of course, you know, you look at Massachusetts, I had won 52%, 52%. Well, that's because Tom Brady loves me though and I love Tom Brady. Tom Brady said great things about me, winner, winner. Great winner. So Tom Brady and Tom Brady is a great winner. I don't know if you people like him too much around here but I'll tell you he's a great -- so that I think he helped me a little bit in Massachusetts. But -- so we're doing well everywhere. And I just feel, to me, that this would get the ball rolling. If we win Iowa, such a big event for me. And I'm telling you, I should be -- so even my people they say, well, why don't you just say, we want to do well here. Meaning second, third, fourth, you know, I don't want to say that. I know it's safe because I know I say if I want to win and if for some reason we don't because you're too lazy to get out in caucus, OK? But I want to say, if we want to win, I just -- I want -- I know what they're going to do. They're going to say, he wanted to win. It is a miserable upset for Trump. This is a horrible evening and they show every speech, I say, I want to win but you know what, folks? I don't care what they do. I want to win Iowa. I want to win. So I want to win Iowa. So here's the story. So you got to go out get Time Magazine because it was really great and the writer was fantastic. And I haven't promoted a magazine like that in a long time but I want to tell you that guy got it. He has our understanding. He knows about the movement. He knows about -- they used to call it the silent majority. I'm calling it the noisy majority because we are angry and we are angry, we're angry at stupid people. We're angry at people that don't know what they're doing. You know, it's funny I was saying last night, we were in South Carolina, it was an amazing -- they turned away 5,000 people. We had an arena that was packed and they turned away a five -- more than 5,000 people. And I was saying last night, it was very interesting that we are all angry at what's going on but we want to get it fixed and we're going to get it fixed and it's going to be so good. And it's going to be so much fun and it is fun. I mean, I like doing this. Here it is a Saturday. I go Friday night, Saturday, all the time. I mean, I'm in Iowa and I'm going to see you, by the way, next couple of weeks. I'm going to be seeing you so much that you are going to be so sick of me. In fact, I said to Chuck and the people, I said do you think it's too much? Maybe it's too much. Maybe they're going to get sick and tired. So and you know, we have a lot of energy. We're the opposite of Jeb. We have super energy but you know, we want, we want to -- I don't want to waste any time. We're on the cusp of something that's so great because listen to this, Reuters, I love Reuters. Reuters, Trump, 42%, 42%. By the way, this is with like 15 people. That's a lot of people. I take 42% or 43%, I'd settle right now, 42% or 43%. Do you notice all the time? They -- I started off with like 4%. Then I go to 8%, then I go to 12%, then I go to 16%, then I go to 18%, then I went to 26%, 26%, and I held a 26% for two weeks and they were saying he's reached his plateau. I just plateau and then I went to 28%, then I went to 30%, 32%. Now, we have Reuters, 42%, Cruz at 16%, Carson at 12%, Bush is so low. Let's, oh, wow. What's going on with that guy? $69 million. It shows you, you can't buy elections anymore. It's really true. I don't think, I think people are too smart for it. They're too smart. You know, sort of interesting. I looked at it and I view it as something that you should all think about. So Jeb, who's a nice person. He is a nice person. He says he's lowered. That was a very badly described candidate. No, he's a little low energy but that's so -- we don't need low energy do we agree? We need high energy Higher, do you think ISIS wants to know about low energy? You got to knock the hell out of them. Boom, boom, boom, you need a lot of energy. We need a lot of energy. China, ISIS. You know China, what they're doing to us in trade is unbelievable. I love China. The people are friends of mine, the richest people in China. I mean, the biggest bank in the world is from China. They're tenants of mine. They buy my apartments. I have a lot of respect. Their leaders are too smart for our leaders. It's very simple. They're killing us. It's one of the great robberies of all time. So maybe the greatest theft in the history of the world. The money and the jobs and everything that China has taken out of the United -- we have rebuilt China. They've taken it out of our country, out of the United States. We've rebuilt China. And you know what? We don't even know -- our people, the head of China comes here, they give him a state dinner. Hello, darling. That's so cute. They give him a state dinner. I said don't give state dinners. Be nice, be respectful, but you've got to get to work. We will have the greatest negotiators anyway. You know we have the best businesspeople in the world. I have Carl Icahn endorse me. I have many others that interests me, the greatest business leaders. They're going to represent us now, folks, they don't want any money. They're going to represent us believe me. We lost $505 billion, our trade deficit last year with China, $505 billion, and I think of it, $505 billion with just one country. With Japan, the cars, they pour in millions of cars. They pour in off the biggest boats. You've never seen ships like this. You go to Los Angeles. These ships pull up, the cars pull up like it's a long island expressway. They go to like 40 miles an hour off the ship ditches one after another. You know, we give them practically nothing. Look at the trade deficit with Japan. We have the power over these countries where we can do right where we can come out ahead. This shouldn't be happening but we have incompetent people negotiating. We have donors. We have people. We have political hacks. We're not using our best. You know, if you go to places like China, Vietnam is another one, hot as a pistol. They're doing great. Vietnam is taking business now from China, OK? Vietnam is China's big headache, not us, didn't worry about us because our people don't know what they're doing. But Vietnam is doing a number on China and Mexico is going to be the new China because what they're doing to us is unbelievable, although, they did catch El Chapo. Good? Good? They did catch El Chapo. That's good. I mean, I don't know. He'd better not escape a third time. You know he's -- those tunnels, bing, boom, right under the toilet, bing, boom, right up. It's pretty amazing when you think about it, right? But anyway, I have an idea. Put them on the fourth floor this time, right? No more. No more first floors. Anyway, but Mexico, I have a great relationship with Mexico. I have a great relationship with the Mexican people. I have thousands and thousands of people, Hispanics that work for me. Thousands of Mexicans over the years of work. They're incredible people. They've worked for me. But you know what? Their leaders are too smart. What's happening is we don't have a border between the anchor babies, which by the way, and the press will say, you can't say that, I can say it. I was right on the anchor babies. I was right. We don't need a constitutional amendment to stop this craziness. You have a woman, she's pregnant, she walks over, she has the baby, and now we're supposed to take care of the baby for 85 years or whatever it is. It doesn't say that folks. And the best lawyers in the world agree with me. And when I first made the statement, it just didn't make sense. But if you read the fine language, if you read the fine print, they came in, they're here illegally, they have a baby. They don't leave the baby. The baby he isn't an anchor baby. We don't take care of that particular baby a person for 85 years. It doesn't read that way. And we don't need, by the way, we don't need a constitutional amendment. We don't need it, it's there. We need perhaps a vote of Congress and people are thinking that maybe, we don't even need that, and we should be able to get that frankly. But we probably don't even need that. OK. Fox News, so Fox News comes out last night, 35% for Trump National, Cruz at 20%, Rubio at 13%, I'm winning by a lot, and they say, winning by a lot. OK, here's one that I really love. They didn't even cover it. They don't cover, you know, they don't want to cover these great numbers, right? Donald Trump, against, did anybody ever hear of a person named Hillary Clinton? So this was just last night. Trump 47%, Clinton 44%, and I haven't even started yet. Look, I haven't even started yet. Although some people would say, a couple of days ago started, but believe me, that's not even starting. That's just a warm-up. So here's what happened a couple of the commentators, I won't mention their names, but the Hillary Clinton people said, oh yes, we'd love to run against Donald Trump. Now, I called a couple up, and I said, folks the reason they say that is that they don't want to run against me, OK? They don't want to. The last thing she wants to be doing and Bill wants to be doing is running against Trump. They would love to have somebody else who's a little more mild-mannered you know. Who won't bring up the truth, OK? I just tell the truth. They would like to have, OK? The last -- believe me. And I know Clinton. Hey, I've been friendly. When I was a business -- you know, they had -- can you believe I say when -- when I was a businessman, my whole life I've been a businessman, and now I say when -- Can I say that I'm still a businessman but I'm running for office because I hate to say I'm a politician. Oh, these politicians are so bad. All talk, no action. That's these politicians. Nothing ever gets done. You're not going to make it. I'm telling you, you're not going to make it if you put some politician in there and I know them all. You know it's interesting. I was looking at the ones I'm running against. I've contributed to most of them. Do you believe it? I've contributed to most of them. And one of them said, no, I don't think you've contributed to me. They found out I did. I contribute to every -- I've given the Democrats. I've given the Hillary. I've given to -- I've given it to everybody because that was my job. I got to give to them because when I want something, I get it. When I call they, kiss my ass. It's true. They kiss my ass. True. True. But think of that. So here's a Trump 47%, Hillary Clinton 44%. I love it. Now in Iowa, CNN poll which is a couple of weeks old. But that's OK. I actually think it's the most accurate Trump 33%, Cruz 20%, that's good. Now the one that came out last night has this pretty much, I guess, statistically even. And they'll be up and one came up where I'm up by a little bit but it's close. I don't want it to be close. We have to have a mandate. We have to get out and we have to have a mandate. I want to win by so much. Now I have to tell you, oh, by the way, New Hampshire. Well, we're doing so good there. Well, look at this. Oh, look at this score, we're up 21 points, 21. I don't mean I have 21. I mean we're up 21. Here's one in South Carolina, Trump, CBS. Trump 38%, Cruz is second at 23%. Do you know what that is? I mean that's a massive difference. So we're doing good. We're doing good and we're going to do good here too. We're going to win. We're going to come in first place. But let me tell you, Ted. So Ted's a nice guy and I like him and he likes me. A lot of other people don't like him by the way. I must tell you that. But I like him. Why do I like him? Because he's been very nice to me, all right? But here's the problem he's talking about natural-born citizen, right? Now if he ever got the nomination, you know, the Democrats are going to bring a major suit. He was born in Canada. Whether we like it, don't like it, he lived there. He was there. He was born in Canada. I guess his parents voted in Canada. A lot of things. I mean a lot of things happen here. So if you're born in Canada, it's immediately a little bit of a problem. Now gave up -- his gave up his citizenship like what, 16, 18 months ago, joint citizenship. Did he have a joint citizenship, right? But here's the problem. Laurence Tribe is from Harvard University Law School, very great lawyer and a constitutional expert. So he's on television last night and he said about natural-born citizen that this matter is not a settled matter. It is wrong to say, this is an exact quote. It is a settled matter because it is not. Now just say you understand, that means there's a question. It's not a settled matter. He was born in Canada and I say to Ted, and as a Republican, I say it, because I think it's very important. You got to get it straightened out. Now you can go for what's called a declaratory judgment, where you go to the courts and you say, there is a problem, where there's a problem of interpretation and you put a lot of papers in and you get a ruling from a judge because you cannot put somebody there, folks. That's going to go in and he's going to be immediately sued by the Democrats because they're saying he was born in Canada. He's not allowed to run for President. And if there's that doubt, don't forget these lawsuits. Who knows more about these lawsuits than I do? I'm the king, I'm the king. These lawsuits take 2, 3, 4 years. So you can't have somebody running. You cannot have somebody running and have a lawsuit and people have already said they're going to bring the lawsuit. They say if he gets the nomination, we're bringing a lawsuit as to natural-born citizenship. And honestly, I don't know because some people say you have to be born on the land, OK? You have to be born on the land. That's what I always thought before. You have to be born on the land. So he was born in Canada. Now John McCain had the same problem. The difference is his two parents were both in the military. They were both in the military. And he was born in a military base, OK? I understand that. I mean it's a military base, OK? What are you going to do? Say, you know, Mom and Dad, you should have taken me back home to be born. I can't run for President. He was born on a military base and I understand that. And by the way, Laurence Tribe represented John McCain on that, and he said, he was troubled by it. They won but he was always troubled by it. It bothered him. But he also understood it. But with Cruz he said it's a problem. Now, if it's a problem they got to work it out because you can't give somebody a nominee -- I think we're going to win. Just so you understand, I don't want to be it like a negative person and I don't want to win this way. I don't want to win this way. I want to win fair and square and based on all the polls it looks like I'm doing awfully well. But you can't have a person running for office, even though Ted is very glib, but he goes out and he says, oh well, I'm a natural-born citizen. It's the problem -- the point is you're not. I mean, you got to get a declaratory judgment. You have to have the courts come up with a ruling or you have a candidate who just cannot run because the other side will immediately bring suit and you've got that cloud on your head. And you can't have that cloud on your head. You know, the Republicans have a structural disadvantage to start off with. Speaking of that, I think, I'm going to do great in New York. I think that -- they don't even talk about. Do you ever notice where they say you have to win Florida. I think I will. You have to win Ohio. Now in Ohio is interesting because I do great in Ohio. I'm killing Kasich in Ohio. Everyone said, maybe you should make him your running mate and you'll win Ohio. I said yeah there's only one problem. I'm killing them in the polls. All right. You know it's the same thing like in Florida, where you're beating them and they say, why didn't you pick one of them? So it's sort of interesting. Pennsylvania, we're going to do great. What they've done to the industries in Pennsylvania, like the coal industry, I guarantee I'm going to do great in Pennsylvania. But I think I'm going to do great in states that are not considered in play. I think New York. You know, they came out with a poll the other day, you probably saw it, upstate New York loves Trump. And I think I do well in Manhattan too, I live there. But it's on a little liberal side. That's OK. You know what, that truth is whether it's liberal or not liberal, whether it's Democrat or whatever, people want safety. They want our country to be great again. They want lower taxes. So I think that I'm going to win states that these people up there, back there, with all of the cameras, they don't even talk about. I think we're going to win states that aren't even talked about because the other people aren't going to win any of those states. I mean, there's not a chance. You know, Ted and Marco, and all these people are not going to win New York, and they're not going to have a chance of winning New York. I have a good chance of winning. They like me. I mean, sometimes they think I'm a little wild but that's OK. But they like me in New York. I've, you know, I have employed thousands and thousands of people. I've built great, great projects in New York from the Wollman Rink, the little one to the biggest buildings. That's what I've done thousands, tens of thousands of people. They like me in New York. So a place like New York, which isn't even thought of, hasn't been one in decades. All of a sudden, this time to say, you know, Trump would have a chance because upstate New York which is very sad what they've done with that. It's in serious trouble. Isn't -- because it's in such trouble, they think that I have a great chance of winning New York. By the way, nobody else does. The other thing is, it just came out in one of the magazines and newspapers, that if Trump gets the nomination, they think he's going to take 20% of the Democrat vote. And I think so too. Do you remember the old -- the old little group of people that's so great. I love those people. Some of them are still around. It was called Democrats for who? Reagan. Remember how many people voted for Ronald Reagan? We're going to have the same thing. And then our polling that stuff. We're going to have the same thing. Then, I'm going to do great with the -- I'm going to do great with Hispanics and I told you about Nevada where I won the poll in Nevada with Hispanics because I'm going to create jobs. I'm going to do great with African-Americans because they know I'm bringing the jobs back from China and Japan and Mexico. I'm going to do great with African-Americans. So there was a poll that showed that I had 25% with African-American and 25%. Now, a Republican gets like 5%, 6%, 7%, like tops. So this poll came out said 25% for Trump. The commentators were talking about it. They said let me tell you something if Trump gets 25% of the African-American vote this election is over. He wins. This is over. Now, I don't know if I'm going to get 25% but I have a great relationship to the African-Americans. They loved me. I love them. We're going to do great with -- we're going to do great. We're going to do great I think with every group. I think we're going to do great with every single group. And it's just a very exciting period of time and it's very exciting to see what's happening. That I can tell you. Now, when I first announced, it was amazing. I have never seen so many cameras. It looked like the Academy Awards in Trump Tower and I said to my wife, you know, it takes guts to run for President. I'm not a politician and it takes guts and I've always heard from day one. I've heard you can't run. If you're a very successful person you can't run for President. Maybe so, maybe it's not, but I said, it doesn't matter. Too many stupid things are happening. Too many people. They don't know what they're doing. They're either corrupt, incompetent, maybe worse than incompetent or they have another agenda. I don't even know maybe there's another agenda. I don't really think so but maybe there's another agenda out there, folks, that we don't even know about. But there's something going on because there's so many things that are so simple like the Iran deal. How do you give $150 billion? We get nothing in that deal. Nothing. Think of it. We don't even get our prisoners back. Now, we don't even get our prisoners back. And now Iran wants to start negotiating for the prisoners. Do you believe this? But they said we want very, very much. Oh man, you just get sick when you see it. So they're getting $150 billion and what we should have done, first of all, nobody even knows when there's still so -- it's been going on forever. But what we should have done is right at the beginning, right smack in the middle, right at the beginning of this thing, you go and say, we want our prisoners back, right? You want our prisoners back. They never asked for the prisoners. You know that Kerry, who's just the worst negotiator, and by the way, the Persians are great negotiators, OK? And the guy that negotiated against him. I've watched him. He's a master negotiator. So Kerry said he never wanted to do that. He never wanted to ask about the prisoners because he didn't want to complicate the deal. Can you believe it? No, no, that's what he said. He didn't want to complicate the deal. So there's still there for years. One of them's there because he's a Christian pastor. He's a pastor. He's a Christian. He's there. Washington Post has one of their reporters there. None of these people should be there. They're hostages really, I mean, call them prisons but they're actually hostages. So what happens is you go in, you need the right messenger, and you say to them, we're going to have our prisoners back. This is three years ago, four years, whenever it started. We want our prisoners back. Got to have them back before we start to negotiate. They'll say no. And what we say is bye-bye. Enjoy yourself. We're leaving, bye, and wave goodbye. Get up leave. Leave. They should've left that negotiation four or five times by the way. Instead of sitting there. So you get up and you leave. Now what you do is you ratchet up the sanctions and you bring them up a couple of steps. You double or triple them, I don't care, quadruple them, give them nothing. But you bring them up and you bring them up, you know, double them. I guarantee you within 48 hours they will be calling, saying, three years ago, saying, we're giving you your prisoners. When can we start negotiating, OK? Now, you wait until the prisoners are on the plane. You wait until they're over American soil. You wait maybe until they're landing, and you have your next meeting, right? Now you tell them you're not giving them the $150 billion because we don't have it. The country is bust. We don't have it. We don't have it. We want to give it but we don't have it. We can't give you the money. We don't have it. I'm sorry, folks. So let's, number one, put that in your head. So they'll be angry as hell but don't worry about it. They'll get over it. And then, you make a deal and you make a good deal. And you have your prisoners and you didn't give them the money. The hardest thing for me to do, if I win, I'm going to go in, and I'm not going to have that $150 billion, it'll make -- it'll drive me nuts. I just hate the concept of giving away that much money so stupidly. And now they call and they say, we are now prepared to negotiate for the prisoners but we want a lot. Can you believe the stupidity of these people? Now, I used to say this is one of the greatest deals of all time but I'm wrong. Do you know the greatest deal of all time? And I just sort of figured this out two weeks ago. What did they get? In addition to this great deal with the money and how about this, 24 days for inspection. So we say, oh, we hear they're building nuclear. Oh, please let us know. Now before they get to the 24 days before the clock starts ticking, they have to go through a whole process, right? It could be forever, but even worse, they have certain areas where they have self inspection. Think of Iran with self inspection. We hear you're building nuclear. Oh well, let us go and inspect. We will inspect and we will call you back tomorrow. Mr. President, I promise we're not building nuclear there. This is madness, OK? How we could have agreed to this is just insane. And it will lead to nuclear proliferation as sure as you're sitting there. You already see what's happening with Saudi Arabia. And if you think that Iraq and if you think that, you know, you look at what's going on, because the greatest deal they've ever made is Iraq. They're getting Iraq for nothing. They've been fighting for Iraq forever. Since I was born. They've been fighting -- they've been fighting, right? They have two equal countries in terms of militarily. They go this, they fight, they fight, 10 feet this way, 10 feet that way, this goes on forever. Then they rest for a couple of years. Then they go back and fight, right? Then Saddam Hussein with the gas, then the other one with gas, then they say we'll take a truce. They rest. They go back to fight. What the hell? How did we ever get -- we should have never been there in the first place. And I said that. I said that. I said it. We have to rebuild our country. We have to rebuild our infrastructure, our roads, our schools, our bridges are falling down, and we're pouring money. We don't know what the hell we're doing. And I said it in '04 and even '03 it came out, Trump opposed to the war. I was totally opposed to the war and a more militarist -- I tell you what, I am more militaristic than anybody in this room, anybody. I want that strong military. I want it so bad because we're not going to have to use it. Were probably not going to have to but you know what, we have to have it. We have to build it up. I'm in the real estate business. It seems like all the time, I'm getting these listings, army base for sale, naval base for sale, air force for sale, air force base for sale. I mean, I say how many places do they have? We're always selling these bases all the time. They're being sold. We need a strong military. We need a powerful military, OK? And we don't have it. We just don't have it. So we're going to change things in this country. We're going to use our heads. We're going to be so smart. We're going to be so cunning. I just said in the other room, we're going to win so much. We're going to win on militarily. We're going to knock the shit out of ISIS. We're going to -- we're going to win with healthcare. You know, if you look at Obamacare, Obamacare, the premiums up 25%, 35%, 45%. It's a disaster. It's going to col -- look, you know, it's going to collapse in '17, OK? In '17 it has to collapse. It's not going to make it. But we're going to terminate it and we're going to replace it with something so much better, cheaper for you, cheaper for the country. The country can't afford it. It's no good. And by the way, do you see your deductibles? You have to be dying for years before you get any money. You have to be so, so bad, you're not going to get any money. The deductibles are through the roof and the premiums are going up so fast that it's a disaster for everybody. So we need healthcare. We need so many different things. And what else do we need? We need a strong border. And what do we need? We need the wall. We're going to build a wall. We're going to build a wall. I mean, look do you remember? So when I came down in the atrium of Trump Tower with my wife, she's going down and she was very elegant, and I'm waving and I'm saying what the hell am I doing? Why am I doing this, right? And I'm going down in front of all of these people and all of these killers that are back there. Just accept like -- oh, they have a lot of people back there. But I mean, you never saw -- this look. I'm telling you it looked like the Academy Awards and I went up and I mentioned -- I talked about illegal immigration and I took heat like nobody has ever taken heat and I always said, Rush Limbaugh said, that Donald Trump has taken more incoming than any human being I've ever seen, right? And I took a lot of heat. And then about two weeks later, it started dying down and then you had the killing of Kate, who is such an amazing person, and you had the killing of Jamiel in Los Angeles. Jamiel Shaw who is an amazing young man getting ready to go to college, football player, good student, great father is a friend of mine and just an amazing guy, shot in the face by an illegal immigrant who is over here. Should have never been here. Should have never been allowed to be here. You had the woman killed recently in California, a beautiful, wonderful, 66-year old veteran. She was raped, sodomized, and killed by a person that should have never ever been allowed to be here and many, many more. This is just many, many, many more and people started saying, you know, he's right. He's right. And now that's not even controversial. And now, the other day, I'm watching Ted Cruz and he's saying, yes, and we will build the wall. I said where the hell did that come from? It's true. And my wife said to me, darling, you have to hear this. And if it wasn't for TiVo, I wouldn't have been able to hear it myself. It's great. This TiVo was fantas -- I run it back. She said, somebody just said, he's going to build a wall. That's the first time I've ever -- she's really into this. She watches it all the time. Everybody is, every -- I could tell you names. People that you wouldn't bel -- they watch it. They love it. We had 24 million people at the debate. The biggest in the history of cable television. Not debate, I mean, show, 24 million. CNN had 23 million people watch the biggest audience in the history of CNN. This isn't me talking. This is CNN putting out a release. The biggest audience. Now, let's say Trump isn't involved, OK? Let's say it's Rand Paul, ey, Jeb Bush, uh, I don't want to mention everybody because some people I like so much. But so -- I'm not going -- but let's say it's OK, the cast of characters, right? Those debates used to draw flies. They didn't draw anybody. Nobody went to watch the debates. In fact, the networks didn't even want them. I think they had to take them as part of their license. You're not going to get a license unless -- they didn't even want them. Now, they say can we make them three hours? Can we make it 10 hours? I mean, they want -- it's crazy what's going on. The debates. And everybody knows why variety does a story. The Trump debates, right? All of the different places do a story. The Hollywood Reporter. Good, good magazine. They do a story, beautiful story to me but they call the Trump debates. It's great. And the beauty is that if I run against Hillary, they say it's going to be the largest voter turnout in the history of the United States and I believe that. And they also said and CNBC said it and other people said it. They said that not only it's going to be the largest voter turnout but many of those people that come in, they're sick and tired of these phony, corrupt politicians like Hillary. They're sick and tired and they're going to vote for Trump and we're going to have a big victory. We're going to have a big victory. We're going to have a big one. We're going to have it big. So when I started, I came down, beautiful escalator, wonderful building, Trump Tower. Go check it out sometime. You got to check it out. Got to buy Time Magazine first and then check out Trump Tower and then log on and then come on to @realDonaldTrump. You know it's great. This stuff is great. This Twitter, it's so incredible. I have like between Twitter and Facebook and Instagram, I have like, 11 million or 12 million followers, 11 million. That's like, it's sort of like owning the New York Times without the losses. Can you believe that? No, it's like incredible. It's incredible. I just I did something the other day I did a tweet on something and I'm watching -- I'm home taking it easy. I'm reading the papers. I did a tweet and CNN breaks, we have breaking news. Donald Trump has just announced some little thing about somebody, not doing a good job, someplace, right? Donald Trump has just announced that Jeb Bush is low energy. Breaking news. No, it's like crazy. It's the most incredible form. It's so quick. It's so incredible and they watch it. You know, if you're a certain person, they watch every tweet, they put out. You got to be careful a little bit. You know, if you make a spelling mistake, they'd kill you. If you make a typo. I got to be so careful. If I do a typo, you know, a little typo. It's like, it's like death. They just go, they go wild. They put her on look at this man, look at this man. This is horrible, this is a horrible typo but it does give you a tremendous amount of power. So @realDonaldTrump everybody go on, not that it matters it's such a -- I mean, adding a few thousand people doesn't mean anything, right? When you have millions but there are people from Iowa and you have tremendous power because you're going to really be setting the agenda. It's so important what you're doing. So, so when I began, when I began, it started off and I was talking about the border, I was talking about trade, I was talking about China, and I was talking about all of these countries that have been ripping us off and taking our money and just destroying us and leaving us poor and leaving us without jobs and all of the things that have happened, all of the things that are true. Newton, Iowa, I'm a big fan of Newton because there were on 60 Minutes, just like I was, Newton -- Are you from Newton? Oh, she's not but she knows. And they took businesses out of Newton and they moved into Mexico and they had a big piece on 60 Minutes and I talked about Newton. I helped the people in Newton. I felt badly. These were great people where a daughter was unable to go any further in college and things and I helped them out and I feel really good. I didn't know I'd be doing this. That was years ago. The people of Newton, let's put it this way, they like Donald Trump, but it was very unfair. I mean jobs were taken, companies were taken, it was ridiculous but that's happening all over the country. So when I first came down, I said, it was about trade and it was about the border and it was about Obamacare, repealing and replacing Obamacare. It was about different things. And then we had Paris and then we saw hatred, hatred like we've been watching. Don't forget, the World Trade Center was hatred. And in my book that I wrote two years before, The America We Deserve, I talked about Osama bin Laden. And Joe Scarborough who's a great guy, said, no, wait a minute. When did he talk about this? Well, a couple of years before the World Trade Center came down he mentioned Osama bin Laden. No way. There's no way. Show it to me and they looked and they found out. I talked about Osama bin Laden, school vision folks, in all fairness. I said don't go into Iraq. I said Osama bin Laden and you got to take these guys out. The reason I talked about them was I saw him on television and I saw him in the papers and I said, this guy's a bad guy. Well, a couple of years later, he knocked down the World Trade. So they should have taken him out. And Bill Clinton had a chance to take him out and he didn't do it by the way. Bill Clinton had a chance to take him out and he didn't do it. If he did it, you would have the World Trade Center probably standing right now. So I said, you know, amazing. And people said that's amazing, he was talking about Osama bin Laden before the World Trade Center. So you do need the vision. But I was talking about these different things and then what happens is you have a very horrible thing and we know what that is, Paris was terrible. Then you had recently California, which was horrible, 14 people just killed by people that threw wedding receptions for them, and threw anniversary, everything, they were friends of theirs and they walked in and killed them. There's something going on there's something wrong here. And then Paris, and fortunately, the press, you know, they were calling him a mastermind, right? This guy, I call him the guy with a dirty hat. The dumb guy with a dirty hat. You have to demean these people because what's happening is they, ISIS and others, are using the Internet to take our children's minds and to radicalize our children and we won't even know about it and they're going to places and they show up at the places. I mean, it's -- they become -- they join ISIS and they join al-Qaeda and they join other -- it's disgusting what's going on, right? And so I said, we have to get to the bottom of all of this. And I said it very strongly and very vividly. And I told the anchors, please don't call the leaders masterminds, call them people with very low IQs that a -- no good. And I called the white, you know, with the white hat, I call him the guy with the dirty white cap, right? He had the white ski thing on. And he -- what is he a mastermind? Why is he a mastermind? He sends guys in, you go there, you go there. Now think of this because I'm big for the Second Amendment. We got to save our Second Amendment, folks. We've got to save it. We've got to save. So, so if you go in, if you go in and you have Paris. We have a number of places and they put these thugs in there with guns. The toughest gun laws in the world, they say, is France and Paris, the toughest in the world. You can't have a gun. Unless you're a bad guy, you have a gun. You walk around with a gun, right? But if you're a person that's a law-abiding person, you're not allowed to have a gun. So in Paris, these thugs, these dirty, rotten, very stupid, demented people, walk in, and they say, get over boom, get over boom, not one gun in the room except for the bad guys, right? Get over. They kill 130 with more to come because you have some really badly wounded people in the hospitals that many of whom won't make it. So you have 130 people at a hospital load of horrible, horrible injuries. For what? I guarantee you if that guy right there had a gun on his ankle and if that guy right there had a gun in his waist and have this one over here, the tall one with the glasses or even the short one or the woman, she looks tougher than all of them. But if there were some guns on the other side where you'd have bullets going in both directions, it wouldn't be that way. It wouldn't be that way. Same thing in California with these two horrible people, right? These two horrible people that knew everybody in the room. They were sort of friends I guess but they knew everybody in the room. And if you had a gun on the other side, it would have been a fight, and you wouldn't have the kind of carnage and the horror show that you had. We have to protect our Second Amendment. Remember that. And with me, again, it's going to be protected. And just one other thing you have gun-free zones. That is like bait to a bad guy. This is a gun-free zone. Now, we had the five military people killed not so long ago, right? On a military base, signs all over the place, this is a gun-free zone. One of the five was one of the all time great soldiers has every record. He was a great marksman, not allowed to have a gun. He can't have a gun. So they have gun-free zones. The guy seizes a gun-free zone, OK? Seizes a gun-free zone, walks in, kills these five people. If they have guns, believe me, it doesn't turn out that way. Turns out to be a much -- they were standing there. There was nothing they could have done. He walks in fully loaded. They had their guns 200 yards away, locked up. The first thing I'd do, one of the first things is, so many things to do, but we get rid of those gun-free zones, especially on military bases, it's ridiculous. It's ridiculous. So just a finish. There's so many things that our country can do. It's common sense. It's smart. We have to be so vigilant. We have to watch. We have to see what's happening. And when I brought up a certain subject about radical Islamic terrorism a couple of weeks ago, I was met with unbelievable, similar to what I talked about illegal immigration. And by the way, when CNN came out with their poll two weeks ago, I lead with ISIS by a lot. I lead with everything. I lead with immigration. I lead with ISIS. I lead with terrorism and I don't mean by little. I'm over 50% with most of them. I lead with the economy that we sort of expect because I will be the greatest jobs President that God ever created. That I could tell you. The greatest. I'll be the best. But when I brought up, when I brought up radical Islamic terrorism, a word -- words the President of the United States refuses to say. Now, if you don't say the problem, and if you don't know what the problem is, you're never going to solve the problem. You're never going to solve it. There's nothing wrong with him saying we have a problem. I mean, the World Trade Center got knocked down. People are being killed all over the place. By the way, when I left today, Cologne, Germany, which is one of the most peaceful places, they're having riots in the street. People have been just beat to hell. Women have been raped. What's going on in Germany is unbelievable and we have to be smart. We can't take these people from the line that we have no idea who they are. You know, we all have heart and the migration is a terrible thing, caused to a large extent, by Obama and Hillary Clinton with their policies that was so stupid. So, so totally and grossly incompetent because really by them. So what happened -- and others, but really by them more than anything else, you look at what they've done with Libya with Syria. The whole thing, everybody. They -- I don't think they've done one right thing. Even a few things, look, 50 soldiers, we're going to send 50 soldiers, OK? A couple of -- two months ago. So Obama gets up, he announces, we're going to send 50 people. First of all, he thinks it's wonderful, 50 doesn't sound -- these are elite soldiers. These are great people. These are unbelievable men, women. These are the finest. What the hell does he have to say it for? Because now they have a target in the back and the enemy is looking for those 50 people. If he would have just kept his mouth shut he could -- and you know what? For the purpose of PR, when you say 50, people say 50, it's actually bad. It's not even good. But why does he have to say? Why does he have to say we're getting out? We should have never been in Iraq, folks, but we shouldn't have gotten out the way we got out. We shouldn't have gotten out the way we got out. I mean, I would -- I hated what they did. I hated what they did with Iraq. But we shouldn't have gotten out, and he goes out and he announces, he announces the date that we're leaving. And I said, oh, that's smart because I think it is camouflage, right? I figured he'd never leave. He leaves that date. So the bad guys and don't kid yourself, they don't want to die. You read all about, you know, they want to die. Bullshit. They don't want to die, OK? They don't want to die. And let me just tell you another thing, their families know everything that they're doing. Just like your families know everything that you're doing. Their families know everything. And they care more about their families than they care about themselves. They don't want to die but they care more about their families than they care about themselves and their wives know and their children know. And they knew everything about the World Trade Center and they knew what was going on. And those people in California, they had pipe bombs all over their place, all over their apartment and there were numerous people that knew and they could have reported them to the police. And you wouldn't have had the problem but they didn't want to do it. So something bad is going on. And before we do anything and before this country goes totally to hell, we better get smart. We better get away from these stupid politicians that don't have it. And we better do it right because we're not going to have much of a chance. We're not going to have much of a chance. So, so it's become largely, and even at the rallies, everybody has great confidence in me with China and with all these places, and don't worry about it. We'll take great care of that whole situation and we'll get along great with them. It'll be fine. We're going to be -- do great. We're going to do great but we're going to strengthen our borders and we're going to get along great with Mexico. They're going to respect us more. They don't like us now. They take advantage and they don't even like us. I mean, Ford is building a $2.5 billion plant there. And Nabisco, moving their factory there from Chicago. They're closing the factory in Chicago, moving it to Mexico. That doesn't help us, folks. That -- I went to the greatest schools. I went to the Wharton School of Finance and went to Ivy League college. You know what that doesn't help. You don't have to go to college too, right. That doesn't help us. It does nothing for us. We're going to have respect. We are going to be respected by other countries now. We're not respected. It's funny, we're like the big fat bully that gets his ass kicked all the time. Nobody, nobody respects it. That's what we are. We don't win anymore. And what I said before is this. We are going to win so much that you people are going to get so tired of it. You're going to beg me, please, please, no more victories, Mr. President, no more victories. We can't take it anymore. Give us at least one or two failures and I'm going to say no way we're going to have failures. We're going to win all the time and we are going to Make America Great Again. I love you. Thank you. February 1st, get out and vote."}