{"id":482,"author":"Donald Trump","title":"Speech: Donald Trump Delivers a Speech in Burlington, VT","date":"2016-01-07","link":"https://factba.se/transcript/donald-trump-speech-burlington-vt-january-7-2016","paragraphs":["You know you're standing. I think they got rid of the seats. They got rid of seats. They got -- they took some seats out so we could get more people. Yeah, go down sit down. Sit down be comfortable. Thank you, man. Ah, be comfortable. Be comfortable. Great people up here. It's amazing, right? No, it's amazing.","But -- so you know, I announced I was going to run. I couldn't stand watching it anymore. We used to have victories. We don't have victories. We're going to have so many victories that you're going to be bored of winning. You're going to get so tired of it. You're going to get so tired of it. So I always like to start only if it's good news but we've had good news since June 16th. You know, I announced on June 16th and a lot of the pundits, you know, these are very dishonest people, many of them.","I mean some of these guys -- some of these guys are just brutal and terrible. Oh, look at all the people of there to, wow. What a nice group. But they all said, oh, he's never going to run. He's just doing this for fun. He's not going to do it. He -- you know, he's done it before. I did -- I almost ran four years ago.","I wish I did it. I really wish because that was, honestly, that was an election that could have been won and should have been won. But hey, so we delay it. Maybe this is better, OK? Who knows? We've gone deeper into the abyss that I can tell you. But I think, you know, I'm very happy because in Vermont, OK? You know what these are, I love ratings.","I get so -- I mean these other candidates. Why do you always talk about ratings? Because I'm number one. If I were number two -- it's true. If we're number two, we don't talk about the ratings, right? We don't talk about the ratings. But in Vermont, I'm number one by a lot, 32% beating everybody. Very important.","Very important. NBC did a big poll, 35% by far number one, killing everybody. I won't even say -- should I say who's number two or not even bother this so -- they say no. I mean, they're so far behind and I hope it doesn't matter. Today, Reuters, listen to this one, 43%, 43%, and do you ever notice at the beginning, I'd come out I started -- you know we start off, we start with nothing.","Jeb Bush was actually leading and then we found out he had no energy and he went down the tubes. No, we need energy, folks. We need energy. We need energy. You know you had Jeb Bush you. You had Rand Paul. He's like gone. In fact, he won't make the stage. He said if I don't make the main stage -- I think he's quitting or something if he doesn't make the main stage.","So it looks like he's not going to make the main stage. So I guess that means -- I'll tell you what, Kentucky's a great state. I can't imagine somebody's not going to challenge him after that horrible job he's done with this, right? If I were in Kentucky, I would challenge him. I would run in the primary and you would win but that's his problem.","That's not my problem. We probably won't see him too much longer. But we've had a total now of 17, we started off with 17. One by one by one they disappear. And everybody so far that's disappeared has taken on Trump. And you remember Governor Perry, he was brutal. Gone, right? Lindsey Graham, gone. Go ahead.","Governor Walker, nice guy. Gone. These were all guys, you know, I feel guilty. Actually, I feel guilty and plenty of others. How about Pataki? He had zero. Pataki, he had zero, zero, zero. As I said at which point, you know, when do you leave when you have all zeroes, right?","They actually had him down once with a zero and the arrow to the left which meant less than nothing. And I -- I said I think it's a typo. How do you have less than nothing? So we've lost a lot of very fine people, really fine people. Pretty fine. And it's been an experience because you know when I, when I first came out, I was watching the pundits say this is the finest field of talent the Republicans have put on since World War 2. They said World War 2, and I said, wow, Charles Krauthammer said it's the finest group of talent they've had in decades.","And I said man that's bad. I'm running against all this talent. And then I said after like a couple of months, I said rerun that, I want to see. Does he really mean that? But -- because we're going to do things that nobody else can do, folks. We're going to fix this country. We're going to make it so great.","We're going to do things that nobody else can do. And by the way, I have to say you know these are Republicans and some of them I really like and some of them I really respect. You don't respect everybody. You can't res -- we are going to build a wall. Don't worry about it. And eight wait -- and wait a minute.","And who's going to pay for the wall? Who's going to pay for the wall? Who's going to pay for the wall? I've never done that before. That's actually cute. I've never done -- I swear. I've never done that before. That's very funny.","I've never done it before. And that was pretty cool. We're going to have to use that and I'll always be thinking of Vermont when I've used it. I'll tell you. Who's not going to pay for the wall Vermont? Right. So it was interesting because when we said we're going to come up here a lot of people said why?","And most of the guys are not coming up, you know. They're afraid to come up here because it has a tendency to be a little bit liberal. Pretty rough, OK? No, don't and if you look at the candidates that are coming here. I think I'm the only one. I'm the only one. And I said no I think, I think.","And all over the networks tonight. You know what? All over the networks. All over the place. This turned out to be different. I thought it would have a -- be a nice soft evening. We'll have 500, 600 people. We'll sit around a little fireside. We'll talk. We'll have some fun. And then I hear CNN all day long.","This line is massive -- this line -- and you know the line is so -- So it turned out to be good. But I'm here for a different reason. I'm here because you people are great and everybody said it. And I have -- I have a friend who's in my campaign, who's very much in tune to Vermont, loves Vermont. He said you got to do it. I said I want to do it. Let's do it. And now, I find out I'm the guy and I think people are going to remember that when it comes time to pull that little lever, OK? They're going to remember.","They're going to remember. So on the poll -- so we're winning with Vermont, we're winning with Reuters, winning with NBC, winning with Washington Post ABC, winning with everything. I mean honestly, we're winning with everything. We're winning in Iowa, CNN 33 to 20 new poll, and very importantly, they have these polls.","You know it's interesting these politicians they go out and they hire pollsters. They pay him hundreds of thousands of dollars a month. No, you wouldn't believe the money and I didn't do it. By the way, I'm self-funding my own campaign, nobody's giving me money. Nobody. Nobody. No. It's amazing and -- that people really like that.","You know people really like it because I know the system, who knows the system better than me? I gave very recently, you know, before I did this, $350,000 to the RGA. That's the Republican Governors Association. And over the years, I've given millions and millions of dollars to candidates, and I understand what it means, and I'm not saying right, wrong.","But you know what? When you give and let's say you have a company, and you want something for that company or a country you're representing as a lobbyist or a special interests, and you want something for that country because they pay you a fortune. What happens, you gave millions of dollars like Jeb, took a fortune and took in $128 million.","He's a stiff. How do you get that kind of money? Although, actually he said some very nice things about me today, and I couldn't believe it actually. He spent like $10 million on ads against me but he said I'm -- I'm a gifted politician. I said, maybe that's not good being a gift -- I wish he'd just said I was gifted left the politician out.","No, I thought it was nice. He said I'm a very gifted politician. I'm very successful this and that. See now, here's the thing. I would never say that about my opponent. I would say, my opponent has nothing going. My opponent is horrible, terrible. My opponent is a loser. We always say loser, right? You know there are some words but actually, Jeb was very nice to me today.","So I appreciated that but, but there are some words that -- I went to an Ivy League school. I went to the Wharton School of Finance and a lot of people say, it's wonderful, some of the pundits they say, he's plain-spoken, plain-spoken. You know I don't know, is that nice? Is that good or bad? I don't like it act.","Plain spoken. I guarantee you I have a vocabulary better than all of them. Certainly, most have, I know I have an I.Q. better than all of them. I know that. But they say he's plain spoken and then I was saying the other night, you know, I was trying to describe the stupidity that goes on. And I -- I always used the word like they're incompetent, they don't know what they're doing.","But then you go back to the same word, stupidity. You say, what is a better word to describe what's happened to our country. What's a better word than the word stupid, stupid. It's a stupid -- it's -- we're being led by stupid people. I mean think of it. Think of it. I mean, sometimes the words they just come out.","They're the right words. They're the better words. You look at what's happened and take a look at this. We have a deal that we just made with Iran. One of the dumbest -- no, no think of it. One of the dumbest transactions I've ever seen. Now, between countries unbelievable but I'm talking about any.","We did the art of the deal. Everybody here probably read the art of the deal, right? Did most of you read it? Who read it? Who read it? Yeah, almost everybody. So they do a deal. They give Iran $150 billion, billion dollars. They have so much it's so rich. If Iran were stuck by it, OK? By the way, speaking of stock, you see the bubble, a bubble.","It's starting to go a little bad. Some bad numbers coming out. Some really bad things and you better be careful. Be careful. Be very conservative because it could be very rough out there. And who can fix things better than me? That's what I do. I fix things. That's what I do. That's what I do. But you look at the Iran deal and you look at what happened and the way it was made, and the points we gave up, and constantly, and we don't get our prisoners back, $150 billion, we don't get our prisoners back.","We have four prisoners over there. We should get them back. And we should have had them back, right? No, but we should have had them back, three, four years ago. This deal is, first of all, a deal that goes that long. I mean, it's taken them -- how many years that they've been negotiating like three, three and a half years, and we walk in, yes, we'd like this.","They go, no. Oh, OK. You win. This went on for years, right? We got nothing. 24-day periods for inspection. I love the one self-inspect. They have the right to self -- certain areas are really hot. In other words, that's probably where they make those suckers, right? So they have the right to self-inspect.","So they're going to self -- so we call up. We understand that you're doing nuclear at this location. OK, we'll inspect it, we'll call you back tomorrow. No, we're not doing it. This is the dumbest deal that I've ever seen. We didn't get anything. So here's what happens. We have $150 billion that we gave them.","They are going to now -- and they just said, we would like to start negotiating for the prisoners. Now, think of this. The prisoners should have been out three years ago. What you do, you need the right messenger, right? I could take 85% of the audience and you could have done a good job. It's true, 10% no good, 5% mixed.","No, it's true, not everybody. Look, we have Kerry in there. He's one of the 5%, OK? No, he shouldn't be doing this. You go in the first day, you say, listen we need our prison -- don't talk about the $150 billion yet because you don't want to give them that either. You go in, you want to get the prisoners out, and you say we want to get our prisoners out.","You have to let them out. They don't help you. They do help us. Set a nice tone, a very nice tone. That's a word that Hillary uses a lot. She said, she doesn't like my tone, my tone. By the way, they're chopping off heads of everybody in the Middle East, especially if you happen to be Christian. They're chopping off your heads.","She doesn't like my tone. If you can believe this. I don't like their tone. I don't like her tone. Crazy. So you go in and you say, we got to have our prisoners back before we start. They going to say no. Because the Persians, you know, they're great negotiators. The Iranians, Persians are great negotiators.","So they're going to say no, absolutely not. We're going to say, bye-bye. Now, you leave, you leave the room. We never leave the room. How many times did we all think Obama was going to leave the room? Meaning get his people to come out. They go back to Iran. They tell everybody that we're stupid. They're winning.","And this is before the deal's even done. Everyone's saying it was stupid. When somebody says you're stupid, you don't do the deal. But they're marching in the streets and celebrating a deal that hasn't even been done. But I say, we won't operate. We say no, they say no. And they're going to say no. Now, you leave, you double up the sanctions.","You sit back and wait for the phone call, right? They'll call you up within 48 hours guaranteed. And they'll say, we'll give you the principals, right? No, no this is the way it works. This is the way it works. So they give you the prisoners, so now you have -- you got to get the prisoners and not at the end, you get them out the beginning.","You get him out before it starts and all you had to do is just say, and you will never get them in the first session. They'll say no, 100%. I mean, 95%, might be they give them but I doubt it. But you leave and you double up or triple up, and they say and that's it, OK. Now, we have our prisons back. Now you go back in, next statement, we're ready to start negotiating, we want to be very fair, but we will not give you the $150 billion.","We're not going to give you any money. We've got enough problems. We owe $19 trillion bucks. We owe $19 trillion and we're giving them $150 billion and we just tell them this. Not good, right? Hey, what could Vermont do with a $150 billion? No, we've made we've made Iran a real power.","So what you do is you say -- you've got to get the prisoners out first. You don't mention the money because, you know, when you mention the money that -- now it gets tougher. So now they say, no, we have to have that money. We say you're not going to have it. I mean, you're just not going to have it. We don't have it. Claim poverty.","We're a poor nation. We owe $19 trillion, the stupid budget that was approved two weeks ago. This stupid budget. Now how about that? Did you ever see a budget approved so fast? And that's where $2billion, that's where $2 trillion. So now, we're going to be at $21 trillion. Here's the budget, I don't get it. You know, the only one -- because I think Obama's one of the worst negotiators, perhaps in the history of the world, OK? Except with the Republicans, with the Republicans, he's a great negotiator.","With the Republicans he does great. He gets a budget approved. I don't understand. He's got the money for Planned Parenthood. He's got the money -- think of it. He's got the money to fund Obamacare, which we're going to, by the way, which we're going to terminate. We're going to repeal it and we're going to replace it with something much better.","You see your premiums? Do you see what's going on? Your premiums are going up 25%, 34%. And I see one going up 48%, 48%, a friend of mine calls me up. How's it doing? Oh, this Obamacare is good, 48%. Your deductibles are through the -- you'll never get to use it. You have to die to use it. You have to die.","You need massive opera -- you need like 40 operations on your brain and maybe you could get something. No, the deductibles are through the roof. They're through the roof. Obamacare is a dead duck anyway because in '17 it fell just by luck. If I win, I get Obamacare. It's going to fail during my -- and then they'll blame me. Can you believe it? They'll blame me. They'll say, oh, Trump did a lousy job, Obamacare failed.","If we had Obama it wouldn't have failed. Well, it's failing of its own weight. And numerous stories came out recently whereby '17, which is in two years, it's dead. It can't survive. Of course, the Republicans will probably find a way to keep it going. I'm so upset and angry with the Republicans. We know -- we know what we're getting with the Democrats but the Republicans, they for -- here, we finally have majority so we have majority, majority and we have the wrong President, right?","And -- but the second majority doesn't -- it's like we're doing worse now than ever before. And now Obama, he's got so little respect for the Republican leaders that he just goes along and signs Executive Orders for everything. No, no it's all Executive Orders because that's easy to do. I'll tell you the one good thing about an Executive Order is that the new President comes, and with just a signature.","They're all gone, OK? That's good. That's good. And they're gone. They're gone. So when you look at a deal like that, when you see what's happening with our country, and you see that we're going to change that. Now, as far as Iran is concerned, I saw what happened over the last few days with the Embassy in Iran, the Saudi embassy.","Folks, they want to take over Saudi Arabia. Now, they're taking over Iraq because we handed them that on a platter. I was against going in. I am the most -- and I say it all the time, I'm the most militaristic person in this room except for that guy with the hat. Stand up with a beautiful beard. Stand up. He's the only one.","He's the only one. You're my guy. Thank you, and you're my guy. I can tell. I know them. Do I know my people? And I've never met him before. He just looks good to me. He -- no, I said he's the only person more militaristic than I am, OK? And you are. You know what I'm talking about. No, but I'm the most and we're going to make our military so strong, so powerful, so big, so good, so good.","And that nobody is going to mess with us, folks. But I'm the one that didn't want to go into Iraq. And in 2004, 2003, you'll see stories, Trump said don't go into Iraq, you're going to destabilize the Middle East, OK? I mean, say what we want. We spent $2 trillion, right? $2 trillion, $2 trillion, wounded warriors who I love, all over the place, I see them so many, some of them so badly injured, and they have a better attitude than I have, and they have a better attitude than half of the people in the room have.","I mean, these are amazing people, men and women, that -- what they've gone through and their attitude and what I said is we take the oil, remember? How long have I been saying it? Take the oil. For years, I'd been saying -- and they'd been saying. That doesn't make sense. You can't -- now, they're taking the oil but then I take it, if they're bombing it. Although, Obama doesn't want to really bomb it because he thinks it's going to create air pollution and be bad for the atmosphere.","And this is a true story. What do you think of General Douglas MacArthur if they said, you can't really bomb the oil because it's bad for the environment. You think he might say, I don't give a damn. Bomb. Now, we need, we need Douglas MacArthur. We need General Patton. We need people. We need people. These are great people.","These were incredible people. These were people that won. They know how to win. We didn't -- we don't have people that know how to win. We need people. And you know what? In the service, we have -- I know a lot about West Point and Annapolis and the Air Force Academy et cetera. We have great people. We have great people.","We let one of our best Generals go because he had foul language. You talk to -- you know he had a lot. You know I'm talking about. He had foul language and we let him go. And yet, the people loved him. His soldiers, his guys, they -- and women, they absolutely loved this guy. They went to fight for the guy but he, he was very fouled mouth.","Who the hell cares? We got to start winning. We have and I say this, we have an amazing situation because I see these Generals they're on television all the time. Generals on television. I don't want Generals on television. I don't want them. And they're just saying what we're going to do. What are you going to do? We're going to do here and then we're going to attack here and then we're attacking here and I figure it's camouflage, right?","I figure it's camouflage, right? They're giving false -- turns out to be true. Or Obama two months ago, right? We sent 50 people over. He thinks it's good. See, I think it's bad to say 50 people because 50 people. What the hell are we doing? But we're sending 50 people. So he announces we're sending 50 people.","Now, these are really our finest. These are 50 incredible guys and I assume women. These are our finest and they're going off, all right? Why do we have to say that they're going there? Because now they have a target on their back. No, no seriously. They have now a target and the enemy is looking for them.","Unbelievable. Unbelievable. Unbelievable. That was a very mild protestor, I would say. You know what I love about the protesters and I'll tell you. What is that? Is that a camera? Is that a camera? Are you on my side or somebody else? He's holding something up and I hope it's a camera.","He's on my side. I can see. He's, he's one of our guys. He's, he's one of the good guys. But you know like these protesters, they come in, and the only thing I like about them is that the -- look at all those cameras back there. Look at all of them. Everybody's on television but they never show the crowd.","They never want to show the crowd. And the good thing about the protest -- they won't turn them. In fact, I used to think that like their fixed, it's a modern camera, right? So they're fixed and you can't turn them. It's always on my face, right? And you've heard me say this before. They never turn them.","And what happens is when you have a protester, the only time people learn how big these crowds are, because we've got 20,000 in Dallas, 35,000 in Mobile, in Iowa, in New Hampshire, we have the biggest crowds. South Carolina, we're packed. We're going to be in Pensacola, Florida next week. We're going to have 20,000 people.","We have the -- and nobody ever knows. I go home to my wife, she said, oh, you did well tonight. How was your speech? Did you have many people? I said many people, the place was packed they had thousands. I had 15,000 people in Lowell, Massachusetts the other night. You saw that. We set a record in the history of the arena.","And she'll say, did you have many people? And I say why do you ask? Because they never show the crowd. That's why I love protesters because whenever there's a protester -- you know I think they can't move the cameras, right? That they're fixed. They turn into pretzels. They can move them. If there's a protester behind and under the camera, it'll do a somersault.","It's unbelievable. So -- it's true. It's true. That's true. We had a good time. We have a good time. Thank you. We have a good time. You know we have a good time with a bad subject because we don't have much going, right? We don't have much going in terms of -- and I always say, I tweeted out today, @realDonaldTrump, @realDonaldTrump, it's great.","Five and a half million people or I have more than five on Face -- I have like all this. It's sort of like owning the New York Times without the losses. It's unbelievable. You -- no, it's true. You tweet out, you have millions and millions of people. I mean, friends of mine they do a book. Would you do me a favor?","What? Could you tweet out that I'm doing a book? So if I liked the guy or the woman, and they're doing a book, I tweeted and all of a sudden they become a best seller, and then they don't talk to me anymore. They give me no credit. They give me no credit but it's -- it is a powerful instrument. You know we're dealing in social media and we're getting a lot of credit for doing a good job with social media and a lot of the voters.","That's true. A lot of the voters, a lot of the voters are going to be coming out, and it's you know, it's been, it's been really amazing. So just to finish you off with Iran, so what we do is we negotiate properly. And I have the greatest negotiators in the world who want to come with me. And Carl Icahn, one of the great businessmen endorsed me and many others.","You know Carl. And they don't want money. They don't want money. They want to help. They want to do something. You know they've made billions and billions of dollars. They don't need to be paid, you know, a salary. Now, we have negotiating against China. We have people that are political hacks. We have people that gave money and they want to be in, you know, in government, and I want to pick the finest people.","Some of them, get prepared, are not nice. They're bad personalities but they're brutal, brutal genius killers. I want them, right? Don't we -- I mean, we lose, we lose so much money on trade and all of these other things. So you're right. So here's what's, what's happened, and over the last short period of time, I'd been talking about the deal with Iran, and I've been saying it's one of the worst deals but then I thought, it's even worse than I thought, because I thought $150 billion that they got and all of the other things that they got.","And they'll have nuclear proliferation all over the place because of that deal, and that deal is horrible for Israel by the way. Horrible. It's really horrible for the Middle East but it's horrible for Israel. And Netanyahu, I don't know, he was having an awfully hard time. I think Barack Obama is the single worst thing that's ever happened to Israel.","I really do. And then I said to myself, OK. So they made this great deal. They made this great deal. And then I said you know, it's one of the greatest deals, I started thinking, no, it's not. The greatest deal they also made. They made the two great deals. It's like a movie company like you know, you take Marvel, where they have these great successes, right?","They've got like five of the top 10 movies ever. Well, this is the same thing. Think of it. So they make this great deal. What else do they get? They got, they got Iraq. Get him out. Get him out. Get him out. Get him out. Yeah, take them out, please. It's fun, right?","Get him out. You know, it's sort of fun isn't this more exciting? You know, you go to a Hillary thing and it's like boring. You go to a Jeb thing and you fall asleep. We had -- we had in New Hampshire, we had 4,500 in one of the events. We had 4,500 people. Jeb had 101. His -- Are there any remnants?","Any remnants up there? Them -- there may be a remnant. Oh, no, it's only the same people coming down the stairs. Now, there's a remnant. Yeah, he's right there. OK. Yeah. Throw them out. Throw them out into the cold. You know, don't give him that coat. No coats. No coats. Confiscate their coat. You know you can't win -- by the way just to finish.","I just -- I have one word left Iraq. And nobody heard it because these characters. So they not only got a great deal but they also take over Iraq with the second-largest oil reserves in the world. They have it, sure as you're sitting there, they have Iraq. So we spent trillions, we spent all -- and who's taking over.","Iran is taking over the oil. They've taken over Iraq. I mean, what we are doing is so incredible. There's nothing like what we've done. We're destroying ourselves. We're losing our jobs. We're losing our base. We're losing everything. And it's not going to happen anymore. It's not going to happen anymore.","It's not going to -- we're not going to let it happen any more. Not happening. Now, I will and I will tell you something about the protesters and I respect what they're doing. But I really believe unless they have a substance abuse problem which is probably there, he does. He definitely does. No, I really think I could take them into a room, talk to them for 20 minutes.","What are we doing? We want a strong military. We want good healthcare. We want a great country. We want low taxes. I've cut the taxes way down. Especially for the middle class and business, and you know, I actually said, I said I could take these kids, most of them are kids. Oh, are they talking back? I don't even hear.","Their voices are so weak, I don't even hear them. Is this -- OK, you can get him out. Yeah, get him out. Thank you, darling. I love my people. They say my people are the most loyal of anybody. I can do anything. They say that that -- did you say -- they say we have the most, right. I'll tell you what, I have the smartest people.","They were trying to say, well, our people are -- let me tell you. We have the smartest people. I'm really smart. My uncle was one of the top people at M.I.T., for years he was a private -- we have good stuff. We have great genes in this room. We have smart people. They get it. They get it. They really do get it. It's been an amazing, it's been an amazing journey for me. Somebody shouting back there?","O,h I love you. Oh, that's good. But, but isn't this more exciting though than these other ra -- with nobody. They have no protesters, nobody cares, nobody cares. They go in everybody falls asleep. They say, can I go home now, darling? And everyone leaves and the guy standing there, please vote for me. How about this guy O'Malley?","I mean here's a guy. No, think of it. His number one credential is that he was the Mayor of Baltimore. Can you believe it? And he, OK, so now he holds a rally and one man showed up. Did you see that? It was one of the great -- and he's sitting there talking the guy for an hour. Just the two people.","Then, the guy gets up and he leaves and the press as well. Are you going to vote for him? No, actually I'm not. Spends a -- I mean, he -- it's time for him to get out. It's time, time for O'Malley to get out. He is really bad news. At least Bernie is getting some action. He gets much smaller crowds than me but at least Bernie gets some action, right?","Oh, would I love to run against Bernie. I would love -- I would, oh. That would be a dream come true. But actually, I must say, I have my mindset on Hillary. I do have my mindset. I have my mindset on Hillary. I mean, it's just, it's just going to be -- what? We'll take it. What does that mean? That's not us. I got in such trouble.","I got -- how about last week, did I get in trouble? What did I say? What did I say? I said nothing. But they -- I did get -- I did get in trouble. The crowd there was incredible too. Do you know what happens? We have amazing people. We have like these crowds and they're all like interchangeable. We have great people.","You go to the South, you go to the North, you go to the West. The people have one thing in common, the enthusiasm, the love of their country. They love their country. It's unbelievable. And let me tell you, let me tell you something. It's going to be very interesting. I don't think we can be beaten.","There's a momentum that we have. There's a momentum that we have that is so unbelievable. I thought I heard a little voice over there. All right, get him out. Take him out. Get him out of here. Don't give him his coat. Don't give him his coat. Keep his coat. Confiscate his coat. You know, it's about 10 degrees below zero outside.","No, you can keep his coat. Tell him we'll send it to him in a couple of weeks. All right. It's amazing. No, it's amazing. It's amazing. But you know what? Sometimes we have -- sometimes you go into 20,000, you have none of that. I knew I was going to have some in Vermont, in all fairness. If we didn't have that it wouldn't be Vermont, right?","I mean it wouldn't be. Hey, why do you think the other Republicans are not coming up here, folks, OK? I'm the only one. Why do you think? But it is -- it's a funny story. So the first time it happened was a couple of months ago and I was really nasty. Because now, you know, look. I'm not getting out there with a fight.","But I'll tell you one thing, we all like Bernie, do we like Bernie? Well, if you want to pay a 90% tax, I mean, he wants to tax you at 90%. OK. So you don't like him. I wasn't sure, I had to feel that out. But how about when the two young women took over his microphone?","They came up screaming at him and he retreated. He went like and they made the speech for the rest of the -- that won't happen with me I promise. I promise. I promise. That was a terrible -- I tell you what it was so embarrassing to watch that. You know because he's a politician. He's from this country. When they took over that microphone that night, screaming at him, he was petrified.","He walks to the back of the stage with that tall guy. The goofiest guy. He stands there and they're both watching these two girls speaking, and the crowd is saying give them back the mic. Give them back and Bernie said, I lost so much respect for Bernie. That was terrible. We can't let anybody take over our mic.","We can't let it happen. Can't let it happen. So when I started this journey and that's what it was on June 16th in New York. I said to my wife, you know, we've got to do it. And I looked down in that building, at Trump Tower, 57th and 5th Avenue, and I looked down and I saw more of those cameras than I've ever seen at one place.","I have never seen any -- the entire lower level of Trump Tower was cameras, cameras, cameras. Outside on the streets, they would close their trucks. You know, the trucks, the equipment, NBC, ABC, CBS, FOX, everything. Networks I never even heard of. I never saw so many networks I said oh, they're that many now.","Every -- it was like the Academy Awards. It was. It was like the Academy Awards. You all remembered. And everybody said he's not going to run. So you know they were all waiting. But I just said look, we got to do it. And I took a deep breath and I said, let's go. Because it takes guts to run for president.","It really does. No, it really does. I mean, it's not something I had in mind. Steve Burke who's a great guy, the head of Comcast, he came to my office just before, he wanted me to renew for a lot of episodes of The Apprentice, and you know, it sounds a little trivial. We love The Apprentice. It sounds trivial, it's not, it's a lot of money.","And then the deals I lose and all that -- plus I love my lifestyle. And you know now, I'm driving around in an armored vehicle. I drive around in a vehicle. I say, how good are those windows? Sir, they can take 28 AK47 bullets before they degenerate. I said that's a hell of a window, right? And then I say, how about the doors?","The doors are unlimited sir. They can take in the bottom or the top. You know, I'm driving around in an army tank. I'll never see a Rolls-Royce again. No, think of it. I may never see a car that I want to be in again. And they always put me in so fast. I'm going in. You know it's a -- whatever the hell they call them.","And I, boom, get in. Boom, the door closes. And when that door closes, I mean we're talking about -- the only thing good if you ever get hit. Nothing's going to happen I'll tell you that. But it's been, it's been a really amazing experience. I mean, the best part of the experience are the people that I've met.","The people in this country are so competent. I mean, They're so incredible and they're so enthusiastic and I mean that. I love the people. I love the people. But I said to my wife, I said come on, we have to do it. We got to do it. And I literally didn't know until that escalator. We've all seen the famous escalator ride down, right?","Melania in a beautiful white suit and me waving. Hi, I didn't even know who the hell I was waving to. And I came down and we made a speech and we talked about illegal immigration, right? Did I take heat? Did I take? Rush Limbaugh said he has never seen so much in coming to one person. It's true. I took -- I've never had anything like it. And then two weeks later, it started dying down, dying down.","Now, people are saying he's right. It's turned out to be right. It's now, I'm like, I'm like, all these guys are trying to catch me and Ted Cruz who I like, but three nights ago, he was being interviewed and he said, and we will build the wall. He never said that. My wife said that gentleman just said we're going to build a wall.","He's going to build a wall. I said he never said that before. So they're all coming to me and they're all -- but nobody can do it like -- first of all nobody can build a wall like me that's for sure, OK? I'll build it bigger, better, stronger, more beautiful, and for less money. I love it. Get him out of here.","Get him out. Come on. Security move faster. We need security that moves fast. Come on move faster. Come on security go faster. Get him out of here. Come on. Get him out. We got to get the security moving a little bit faster here. Come on fellas. They've got to move faster. We're not dealing with tough hombres.","You know, I'll tell you what has happened though. The first night, the first night that I had these characters. The first night, I -- you know, I figured it's all, it's all like, you know, a little bit theatrical. I said because I don't want anybody to get hurt. No, I don't want anybody. Maybe. But I was rough.","I said get him out of here now. Get him out. Get him out. I want him out now. And the guy was a rough guy. He was swinging and the other guys were swinging. And my audience starts swinging. You had guys I don't think they were ever to fight before. And you see them and they go in like this. And I say oh, move that guy out.","He's going to get killed. But you had him all over. But this was a rough guy. Very, very loud and I -- you know, I figured I'd be rougher and boom, so I'm screaming Get him out of here. Get them. OK. I was criticized so badly. It was terrible. He was so mean and rough and terrible. I was killed. Do you remember that?","I was killed and all I'm doing is screaming, get him out of here. So the next time it happened a week later, and we had protesters, and I said gently, please remove them, please, be very gentle. Don't hurt them. Don't hurt them. You guys throwing fists and fighting and my poor guys, I'm saying don't hurt them.","You know my guy -- one guy took a big shot to the face because I'm saying don't hurt them. Then in meantime the guy's got a black eye like you wouldn't believe. So I say easy. Don't hurt him. Easy. I got killed the next day. They should trump is weak. He's weak. So you're too tough and too mean or you're too weak.","You can't win with these people. They're so bad. Oh, I hate them. I hate them. I hate them. I hate them. So when I started, we talked about illegal immigration. I talked about it in front of all of these cameras and we were very, very strong on it and it worked out. And it turned out I was right. Then as you know, I did something recently because we get problems, folks.","We got problems. You take a look at Paris, you take a look at Brussels, you look at what happened in California, you look at what's happening all over the world, you look at what's happening in Germany. Now, I got -- I'm on the cover of Time Magazine this week. Can you believe it? I don't know. Can you believe it? No, no think of it. I was on the cover like five, six weeks ago and I was honored.","You know, it's still -- look, we can act cool. It's still the Time Magazine and you're on the cover. It's pretty cool, right? You come from Brooklyn. You live in Queens. You work in Brooklyn, all of a sudden you're on the cover of Time Magazine every couple of months. That's pretty cool, right? Pretty cool.","But -- so I was on a few like two months ago, and then today, I didn't even know. I mean, this is when you're really cool, right? I'm on the cover of Time Magazine and they put it on my desk. It comes out tomorrow. Go buy it. The story's good. So go buy it. But if the story wasn't good I wouldn't even be talking about it. They put it on my desk.","I say what's that? Time Magazine. Oh, I think it, you know, somebody's doing a joke. How could I be on the cover -- I didn't even know they were doing a story. So they did a story. It's a great story. And it talked about winning and it talked about the tremendous crowds we're getting and it talked about the tremendous enthusiasm.","And it really talks about the fact there's never been anything. There's never been anything like this. But the amazing thing, think of this. I didn't even know. Normally a reporter would call you. Give me a couple of like, you know, this is what I think. Nobody ever even called me. I'm the cover of the magazine.","But what happened is when it came to the person of the year, used to be called The Man of the year, what sounds better? The Person of the Year -- for the women, only the women. What sounds better Person of the Year or Man of the Year? They're saying -- I'm telling you. Man of the Year. That -- the women are saying, the women are saying Man of the Year.","Is this the weirdest thing? We have to be politically correct. So we're going to go Person of the Year. So they have Person of the Year. No, I mean, oh, there's so much of this stuff, you have no idea. There's so much. No, I mean you just heard it. A lot of women and they're all saying Man of the Year. And I actually think it should be personal.","It just doesn't sound good. But -- so they come up, their year-end issue Person of the Year. Everybody said Trump is getting it except me because I said I'm too controversial. I'm not Establishment. Thank goodness. I'm not Establishment. We're going to do something with your staff. You know, The Establishment?","These idiots like Karl Rove and all these characters they spend -- they don't know what they're doing. He was actually on the other day, I think I had like a 42 or something. And he said, well, that doesn't mean he's going to win. And even the announcer goes, really? Tell me why not?","You know, it's -- he's sure as hell got a good start. No, the hatred is incredible. So I said there's no way that they make me and I think I came in second or something, second or third, and they chose Angela Merkel. Why? Because she allowed millions of people to come into Germany.","And Germany is now, Germany is now in deep, deep trouble. You look at what's going on in Germany. They have got problems like you wouldn't believe. And you look at Brussels and you look at all. So I said we have to do something. We have to figure out what the problem is. We have to figure it out. Now, we have a President that doesn't want to talk about it, right?","Radical Islamic terrorism. He doesn't want to talk about it. He doesn't want to mention the term. He doesn't want to use the term. By the way, I have many friends. I have many friends, they're Muslims, they're fantastic people. But we have a problem. We have a problem. We have to find out and we have to get to the bottom of the problem.","We have to be able to solve the problem. We can't have people flying airplanes into the World Trade Center. We can't have people doing what they did in Paris. We can't have people doing what they did recently in California. We have to find out and we have to get back to the basics and we have to find out.","We have to find out. We have to -- we have to solve this problem. And it's a very deep-seated problem and there's a level of hate that's so incredible. We have to get to the bottom of it. Now, these two people, these two people that killed 14 people, plus, plus because you have people laying in the hospital very badly injured.","But these two people they had an apartment. They had pipe bombs all over the apartment. Other people knew they had pipe bombs. Why weren't they reported? People knew what was going on. They had numerous people that knew. One of them didn't want to say it because they didn't want to be accused of racial profiling.","Do you believe it? Now, I know what that was, that was a lawyer saying, listen, they know you knew. So what you'll do is you'll use racial profiling as an excuse. They didn't want him to say -- they -- he actually said or we didn't want to call the police because we didn't want to be accused of racial profiling.","That's called politically correct. That's called give me a break. Give me a break. So we got to get to the bottom of our problems. We've got to, we've got to you know, we'd become like -- Get out of here. OK, security move a little faster, please. Thank you, security. Yeah, get him out of here.","Get him out of here. Please, go ahead. Yeah, get him out, please. Get him out of here. Honestly, they're very rude but it makes for more fun of -- isn't it more fun this way? I find it to be more fun. The other, the other gets boring. Here, we have no boredom whatsoever.","Nobody's falling asleep, right? Look at that guy with a beautiful woman. Nobody's falling asleep, right? All right, thank you. So, folks, we have to take care of people and we have to have a big heart. Are they out security? Are they gone? Are they gone? Thank you. They're so rude, they're so rude. You see today, we have security people that are, you know, it's hard.","Ten years ago, they would have been on their ass, those people. They really were about -- 10 years ago, it would have been much tougher. This is what happens. And this is why we lose control of our country, folks. This is why we lose control of our country because everybody's afraid to do anything. The police who, who are these phenomenal people that are totally mistreated, by the way, totally mistreated.","And they really are, they're afraid they're going to lose their job over stuff. You got him out of here? Get him out. We'll get more and more angry as we go along. Is that OK? And by the end, I'll say get them the hell out of here. And then by the way by that time, the security will be so tough and so nasty.","And you know what's going to happen when that happens? You're not going to have any more problems. You're not going to have any more problems. Did you notice the first group? The security guys are going? They're not my guys but the first group they're going, oh, please come with us, and they're screaming and they're just going please come.","All right. Second group there -- look now the last time they're starting to get nasty. Pretty soon they're going to get so nasty that we're not going to have any more protesting. You know that right? So we have to solve our problems. We have tremendous crime problems. We have tremendous problems at the border.","We have to solve our problems and we're going to make this country so strong and so great. We're going to take care of our veterans. Our veterans are just absolutely treated so badly. Our veterans are treated so badly. You look at the Veterans Administration, one of the most corrupt groups of people anywhere in this country.","Our veterans are going to -- they -- it is what's happening to our veterans. These are our great people. They are being treated terribly and we're going to change that and we're going to get it changed. And we're going to get it changed quickly and fast. Thank you, everybody. So when I started this it was about trade with China.","China's ripping us. It was about trade with Japan and Mexico. They've taken our businesses. They've taken our companies. Nabisco is leaving Chicago, going to Mexico. No more Oreos for anybody in this group, no more. I don't want any Oreos anymore. Nabisco leaving Chicago, building a big plant in Mexico, closing up. What -- how does that help us? How does it help us, folks?","How does it -- then they make and they send the product no tax, no nothing, boom. How does it help us? Ford, $2.5 billion-plant in Mexico. So they're going to make cars, trucks, and parts. They're going to bring them over the border. They'll probably be driven over the border by illegal immigrants because it's very inexpensive.","No, it's true, it's true. They'll be driven over. They come in the border, nobody's going to check them. You know, we don't have anybody to check them. Nobody cares. And our country's going to hell. Our country's going to hell and it's going to stop. And I tell people, I tell people like using Ford as an example.","You take Ford as an example. They go and build a wall but they go in, think of it. They build this massive -- you know what a $2.5 billion plant? We're talking a one-story building, $2.5 billion. Now, how many places close up in Michigan and other places to get that done? And I tell people, let's say, uh, this is impossible to imagine.","Low energy Jeb Bush becomes President. Hello, I'm Jeb. No, he's afraid to use his last name. Can you believe it? I'm Jeb with an exclamation point. I said to him use your last name, I think you'll do better. Actually, I think you'll do better. But look, but he understands what's going on, and he'll say, and they'll say this is bad.","And he'll say, well, you know, let's do it. Then what happens. The people that gave him the $128 million, can you have -- what he's using a lot of it on negative ads on me. So far, it's had no impact which is, actually, I went up in the polls. I don't know what they are -- somebody's doing a bad job. But those people that gave him those millions and millions and millions of dollars, they know the people at Ford, and they know other people, and they get hired because they're lobbyists and their special interests.","They make a lot of money and they'll go to Jeb or Hillary or Marco or any of them because every single one of them is borrowing and taking money. They're taking money. Again, I'm the only one that's not. So they're going to go in and they're going to say you can't do that because they know it's no good. We're losing factories.","We're losing our jobs. They're going to have jobs but the jobs are good for Mexico, not for our country, right? So they're going to go and they're going to say like, well, let's say Hillary said it's not good, we're going to end it. She will be met with such resistance from the people that gave her the money, all this money to run.","And one of them will say you can't do that. These people supported you. They gave you $5 million. You have to let that factory go through. You have to let them build that plant. Nabisco has to build, Ford has to build, they all have to build. With me, it's different, OK? With me, it's different. With me, it's different.","With me, they're going to come in. And they're going to say, President Trump, sir, -- no, well, thank you. They're going to say, Mr. President, it's really a good thing for our country. Now, you know why? Because we're losing jobs and closing factories that's good for our country? Not good for our country.","Nobody's going to come -- you can go -- you don't have to go through high school to know that. It's bad for our country. They going to say it's really good Mr. President. OK, so after about like two minutes, I'll cut that one-off. And they're going to say we were -- I said no, no, no, no. We want the plant to be built in the United States.","I don't care where. I don't care where. We want that plant to be built in the United States and we want the jobs to be from the United States. And we don't want cars built in other countries like in Japan that are pouring into our country like millions and millions of vehicles, pouring into our country. Coming off in the case of Japan, the biggest ships I've ever seen.","You go to Los Angeles the cars are pouring off by the millions and we get -- what do we get out of it? What do we get out of it? No tax, no tax, no nothing. So the head of Ford would call me, Mr. President, we'd like to do it. We think it's very good for the country. Oh, really? OK, the answer is no. He'll then call me back and I'll say, I want you to build the plant but I want you to build it in the United States.","I guarantee you. I don't need anybody for this. This is too easy. I guarantee you within 48 hours I get a phone call saying Mr. President, we're going to build the plant in the United States. And you know why? Because I will have told him that if you build that plant, you're going to have a 35% tax for every single vehicle that comes across the border, every single vehicle.","You're going to pay tax and I'm a free trader by the way. I am a free trader, I believe. But you have to be smart. We need smart people to make these deals. We have such trade deficits with Mexico, with all of these companies. I told you before with China. Now, when we do business with China, they make product and they sell it over here like forget it. No anything.","Just come on in, no tax, no nothing. They take Apple. They build up -- and my dream is to have Apple and companies like Apple to build their factories here, instead of building them in China, and Vietnam, and all these other places. That's what I want. And we have the people that can do it. Yes, speaking of that though, when you think.","Remember when we were -- some of you are a little bit older and some are very young because we actually have a young audience. We have a very young -- but some -- so they won't remember. But do you remember when we used to have the stickers made in America, right? You don't see that anymore. You don't see it anymore.","Made in the USA, less so you see it. But it was made in America. And when it said Made in Japan that was a bad thing. That was like a cheaper product, right? Made in America. Many of us remember that. We don't have that anymore. We're going to go back and we're going to have that again. And you know what else we're going to have?","You know, what else we're going to have? When it's Christmas time, we're going to all say, Merry Christmas. It's true. It's true. We're going to say Merry Christmas and we go into those stores, and we go into those big department stores, and we go into Macy's where the stock has just crashed, which I love because they were so disloyal.","I mean, you know they were so disloyal. I love watching that stock go down from what? from 75 to 35 or 34. I love it. I love it. No, so disloyal. Why? Over illegal immigration. I mean, you know, they have -- it's just horrible. But you go in there you don't see Merry Christmas. We're going to see Merry Christmas again.","And we're going to have happy holidays. And we have to take care of everybody. But we're going to see Merry Christmas again, folks. We're going to see it. So with China, what happens is they bring stuff in here, no tax. We try and get stuff there. I have friends that are in the manufacturing business. It is brutal.","They say dealing with China is impossible. Now, I love China. I love the Chinese people. I sell apartments for millions and millions of dollars at the largest bank in the world, largest bank in the world, Chinese bank in one of my buildings, pay me rent. The rent is good, that I can tell you. I don't have to worry about the rent but China is great.","The problem with Mexico and Mexico's great, thousands of people work for me. They're great. Their leaders are too smart for our leaders. When the people are pouring across the border, Mexico is in there, oh, isn't that too bad. And you know what? When Kate, beautiful Kate got killed in San Francisco by somebody that came over five times, OK? And when Jamiel was killed in Los Angeles, this young and credible African-American boy, whose father is a friend of mine, a great guy.","The father is like this great guy. This son was the apple of his eye. Young boy walking down the street, right in front of his house, going home to see his father, and he gets shot in the face three times by an illegal immigrant that wasn't supposed to be here. Or the woman or the woman in Los Angeles who got raped, sodomized, she's a 65-year old veteran, raped, sodomized, and killed.","We got us -- and that's pean -- that's just the beginning. Now, I'll tell you what, we have, we have something else going. You have a woman up in New Hampshire who actually said I'm going to vote for Mr. Trump. Now, you know the woman I'm talking about? Where she shot the guy that was attacking her. She carried a pistol.","I love this woman. I love this woman. So she's -- feels somebody's behind her because we're going to protect the Second Amendment, folks. We have to protect it. We have to protect it. So you know, Howie Carr, he told me about this And then I read it and then I saw it. Howie's a great guy. He's a fantastic guy, really good.","And I did his show and he told me about it -- I went. I got the stuff I said that's incredible. And yeah, she's for Trump. I love that. I love smart, tough, great people being for Trump. I don't want a lot of people. Some people I don't want. Somebody said, oh, so-and-so is not going to do it. I don't want his endorsement.","I don't want it. This woman, those are the people I love. But she's followed and she feels there's something wrong. Never used it. She has a permit to carry a gun. And the guy breaks in, she opens the door, breaks in. He's coming at her and she shoots him. It doesn't kill him, doesn't kill him, which is good actually.","Doesn't kill him but she shoots him and he goes to the hospital. I said that's so beautiful. That's such a beautiful story, OK? Such a beautiful story. We need our guns. We need the guns. I mean, whether we like it or not, we need our guns. You know, if in California, and I tell this all the time, if in California or in Paris, you know, Paris is the toughest place in the world to get a gun.","The strictest laws, you cannot have a gun, unless of course, you're a bad guy, a bad guy, no problem. You know, you just walk in with a gun, right? No problem. But in Paris, the toughest laws anywhere in the world they say. France generally, so what happens? 130 people killed. Now, think of it this way. They walk in, I call them the bad guys, I call him the guy with the dirty head.","These people were saying the mastermind. They called him a mastermind. And I'd been talking for two weeks after that incident and didn't call him mastermind anymore. They say, the mastermind of the Paris attack, the mastermind. He's a slob. He probably has about a 70 IQ, he's a dope. And you know what? Let me -- a dope.","I saw him with a white hat that was filthy, dirty. The press is calling him a mastermind. Then, they wonder why our kids are radicalized over the Internet. The Internet, they're calling these people masterminds. What did he do? He put a couple of people in these different places and they start killing people.","That's not a mastermind. That's a sick puppy, folks. That's a sick puppy. And we can't call him. We can't call him a mastermind anymore. But think of it. So you have these guys they walk into a number of places in France and they say, get over, boom, get over, boom, get over, boom. Nobody had a gun on the other side.","Now, if I took you or if I took you or if I took a couple of the people in this room, and you had a gun strapped to your ankle or strapped to your waist. I'll tell you, it's a whole different outcome, right? It's a whole different outcome. It's a whole different deal. You don't have 130 people. You don't have 130 people.","And you have bad stuff happening but at least we're shooting back, and we're going down shooting. And you know what? And nobody can dispute that. And when I have debates with these people, and by the way they say, I won all of the debates. Can you believe it, I won? I never did it before. All of the online, Paul Drudge, Time Magazine, Slate, all of them, PBS, they all say, Trump won the debates.","Can you believe it? Then, I go home and I watch how did I do? Well, you did, OK. Not so great. He did OK. Can you believe -- and then my numbers go up. I went up last time 11 points right after the debate. I went up 11 points. Can you believe this? And I didn't know when I'd be able to debate. Who the hell knows?","I got these politicians, all they do is talk, I create jobs. All they do is talk all day long and they're not very good debaters, are they? Really, they're not too good. Anyway, so when you look at it and if you, if you had people with some protection, even if you had four or five people in there, it would be a whole different story.","And people cannot beat you at that. I -- I deal -- you know coming from New York and they want to get rid of the guns and they always want to get rid of the guns. And I talk to them and I have these debates in front of people. And I went after like two minutes, it's over. They can't beat you in that debate.","They can't. And then I call them the next day. I said so do you agree with me? No, I don't. No, I don't. Look, if we would have had guns on the good guys in California, if they would have had them in Paris, if they would have had -- about on the military base with five great soldiers, two of them were world-class soldiers.","Two of them and one, in particular, was one of the -- I mean he was a triple A. This guy was one of the greatest soldiers and they were on the base and they have a gun-free zone on the base. Whoever heard? Gun -- you're in a military base. They have a gun-free zone. Now, you know what a gun free-zone is to a sicko?","That's bait. That's like gun-free zone and then they walk in with whatever the hell they're carrying, and these five great soldiers, and I'm telling you, one of them was one of the most highly awarded when -- he was super shot. I mean, he's not allowed to have a gun. All five were killed instantaneously and you have other cases.","I will get rid of gun-free zones on schools and you have to. And on military bases, my first day it gets signed, OK? My first day. There's no more gun-free zone. I mean, think of it, a gun-free zone. A gun free-zone on a military base with some of the best soldiers we have sitting there relaxing, watching television, no gun, guy walks in, kills all of them, OK? That ends immediately.","We're going back to sanity in this country. We're going back to strengthen this country. We're going back to intelligence and we're going back to common sense. We are going to Make America Great Again, greater than ever before. I love you. I love you. Thank you. Thank you. Thank you, everybody. Thank you, everybody. Thank you."],"text":" You know you're standing. I think they got rid of the seats. They got rid of seats. They got -- they took some seats out so we could get more people. Yeah, go down sit down. Sit down be comfortable. Thank you, man. Ah, be comfortable. Be comfortable. Great people up here. It's amazing, right? No, it's amazing. But -- so you know, I announced I was going to run. I couldn't stand watching it anymore. We used to have victories. We don't have victories. We're going to have so many victories that you're going to be bored of winning. You're going to get so tired of it. You're going to get so tired of it. So I always like to start only if it's good news but we've had good news since June 16th. You know, I announced on June 16th and a lot of the pundits, you know, these are very dishonest people, many of them. I mean some of these guys -- some of these guys are just brutal and terrible. Oh, look at all the people of there to, wow. What a nice group. But they all said, oh, he's never going to run. He's just doing this for fun. He's not going to do it. He -- you know, he's done it before. I did -- I almost ran four years ago. I wish I did it. I really wish because that was, honestly, that was an election that could have been won and should have been won. But hey, so we delay it. Maybe this is better, OK? Who knows? We've gone deeper into the abyss that I can tell you. But I think, you know, I'm very happy because in Vermont, OK? You know what these are, I love ratings. I get so -- I mean these other candidates. Why do you always talk about ratings? Because I'm number one. If I were number two -- it's true. If we're number two, we don't talk about the ratings, right? We don't talk about the ratings. But in Vermont, I'm number one by a lot, 32% beating everybody. Very important. Very important. NBC did a big poll, 35% by far number one, killing everybody. I won't even say -- should I say who's number two or not even bother this so -- they say no. I mean, they're so far behind and I hope it doesn't matter. Today, Reuters, listen to this one, 43%, 43%, and do you ever notice at the beginning, I'd come out I started -- you know we start off, we start with nothing. Jeb Bush was actually leading and then we found out he had no energy and he went down the tubes. No, we need energy, folks. We need energy. We need energy. You know you had Jeb Bush you. You had Rand Paul. He's like gone. In fact, he won't make the stage. He said if I don't make the main stage -- I think he's quitting or something if he doesn't make the main stage. So it looks like he's not going to make the main stage. So I guess that means -- I'll tell you what, Kentucky's a great state. I can't imagine somebody's not going to challenge him after that horrible job he's done with this, right? If I were in Kentucky, I would challenge him. I would run in the primary and you would win but that's his problem. That's not my problem. We probably won't see him too much longer. But we've had a total now of 17, we started off with 17. One by one by one they disappear. And everybody so far that's disappeared has taken on Trump. And you remember Governor Perry, he was brutal. Gone, right? Lindsey Graham, gone. Go ahead. Governor Walker, nice guy. Gone. These were all guys, you know, I feel guilty. Actually, I feel guilty and plenty of others. How about Pataki? He had zero. Pataki, he had zero, zero, zero. As I said at which point, you know, when do you leave when you have all zeroes, right? They actually had him down once with a zero and the arrow to the left which meant less than nothing. And I -- I said I think it's a typo. How do you have less than nothing? So we've lost a lot of very fine people, really fine people. Pretty fine. And it's been an experience because you know when I, when I first came out, I was watching the pundits say this is the finest field of talent the Republicans have put on since World War 2. They said World War 2, and I said, wow, Charles Krauthammer said it's the finest group of talent they've had in decades. And I said man that's bad. I'm running against all this talent. And then I said after like a couple of months, I said rerun that, I want to see. Does he really mean that? But -- because we're going to do things that nobody else can do, folks. We're going to fix this country. We're going to make it so great. We're going to do things that nobody else can do. And by the way, I have to say you know these are Republicans and some of them I really like and some of them I really respect. You don't respect everybody. You can't res -- we are going to build a wall. Don't worry about it. And eight wait -- and wait a minute. And who's going to pay for the wall? Who's going to pay for the wall? Who's going to pay for the wall? I've never done that before. That's actually cute. I've never done -- I swear. I've never done that before. That's very funny. I've never done it before. And that was pretty cool. We're going to have to use that and I'll always be thinking of Vermont when I've used it. I'll tell you. Who's not going to pay for the wall Vermont? Right. So it was interesting because when we said we're going to come up here a lot of people said why? And most of the guys are not coming up, you know. They're afraid to come up here because it has a tendency to be a little bit liberal. Pretty rough, OK? No, don't and if you look at the candidates that are coming here. I think I'm the only one. I'm the only one. And I said no I think, I think. And all over the networks tonight. You know what? All over the networks. All over the place. This turned out to be different. I thought it would have a -- be a nice soft evening. We'll have 500, 600 people. We'll sit around a little fireside. We'll talk. We'll have some fun. And then I hear CNN all day long. This line is massive -- this line -- and you know the line is so -- So it turned out to be good. But I'm here for a different reason. I'm here because you people are great and everybody said it. And I have -- I have a friend who's in my campaign, who's very much in tune to Vermont, loves Vermont. He said you got to do it. I said I want to do it. Let's do it. And now, I find out I'm the guy and I think people are going to remember that when it comes time to pull that little lever, OK? They're going to remember. They're going to remember. So on the poll -- so we're winning with Vermont, we're winning with Reuters, winning with NBC, winning with Washington Post ABC, winning with everything. I mean honestly, we're winning with everything. We're winning in Iowa, CNN 33 to 20 new poll, and very importantly, they have these polls. You know it's interesting these politicians they go out and they hire pollsters. They pay him hundreds of thousands of dollars a month. No, you wouldn't believe the money and I didn't do it. By the way, I'm self-funding my own campaign, nobody's giving me money. Nobody. Nobody. No. It's amazing and -- that people really like that. You know people really like it because I know the system, who knows the system better than me? I gave very recently, you know, before I did this, $350,000 to the RGA. That's the Republican Governors Association. And over the years, I've given millions and millions of dollars to candidates, and I understand what it means, and I'm not saying right, wrong. But you know what? When you give and let's say you have a company, and you want something for that company or a country you're representing as a lobbyist or a special interests, and you want something for that country because they pay you a fortune. What happens, you gave millions of dollars like Jeb, took a fortune and took in $128 million. He's a stiff. How do you get that kind of money? Although, actually he said some very nice things about me today, and I couldn't believe it actually. He spent like $10 million on ads against me but he said I'm -- I'm a gifted politician. I said, maybe that's not good being a gift -- I wish he'd just said I was gifted left the politician out. No, I thought it was nice. He said I'm a very gifted politician. I'm very successful this and that. See now, here's the thing. I would never say that about my opponent. I would say, my opponent has nothing going. My opponent is horrible, terrible. My opponent is a loser. We always say loser, right? You know there are some words but actually, Jeb was very nice to me today. So I appreciated that but, but there are some words that -- I went to an Ivy League school. I went to the Wharton School of Finance and a lot of people say, it's wonderful, some of the pundits they say, he's plain-spoken, plain-spoken. You know I don't know, is that nice? Is that good or bad? I don't like it act. Plain spoken. I guarantee you I have a vocabulary better than all of them. Certainly, most have, I know I have an I.Q. better than all of them. I know that. But they say he's plain spoken and then I was saying the other night, you know, I was trying to describe the stupidity that goes on. And I -- I always used the word like they're incompetent, they don't know what they're doing. But then you go back to the same word, stupidity. You say, what is a better word to describe what's happened to our country. What's a better word than the word stupid, stupid. It's a stupid -- it's -- we're being led by stupid people. I mean think of it. Think of it. I mean, sometimes the words they just come out. They're the right words. They're the better words. You look at what's happened and take a look at this. We have a deal that we just made with Iran. One of the dumbest -- no, no think of it. One of the dumbest transactions I've ever seen. Now, between countries unbelievable but I'm talking about any. We did the art of the deal. Everybody here probably read the art of the deal, right? Did most of you read it? Who read it? Who read it? Yeah, almost everybody. So they do a deal. They give Iran $150 billion, billion dollars. They have so much it's so rich. If Iran were stuck by it, OK? By the way, speaking of stock, you see the bubble, a bubble. It's starting to go a little bad. Some bad numbers coming out. Some really bad things and you better be careful. Be careful. Be very conservative because it could be very rough out there. And who can fix things better than me? That's what I do. I fix things. That's what I do. That's what I do. But you look at the Iran deal and you look at what happened and the way it was made, and the points we gave up, and constantly, and we don't get our prisoners back, $150 billion, we don't get our prisoners back. We have four prisoners over there. We should get them back. And we should have had them back, right? No, but we should have had them back, three, four years ago. This deal is, first of all, a deal that goes that long. I mean, it's taken them -- how many years that they've been negotiating like three, three and a half years, and we walk in, yes, we'd like this. They go, no. Oh, OK. You win. This went on for years, right? We got nothing. 24-day periods for inspection. I love the one self-inspect. They have the right to self -- certain areas are really hot. In other words, that's probably where they make those suckers, right? So they have the right to self-inspect. So they're going to self -- so we call up. We understand that you're doing nuclear at this location. OK, we'll inspect it, we'll call you back tomorrow. No, we're not doing it. This is the dumbest deal that I've ever seen. We didn't get anything. So here's what happens. We have $150 billion that we gave them. They are going to now -- and they just said, we would like to start negotiating for the prisoners. Now, think of this. The prisoners should have been out three years ago. What you do, you need the right messenger, right? I could take 85% of the audience and you could have done a good job. It's true, 10% no good, 5% mixed. No, it's true, not everybody. Look, we have Kerry in there. He's one of the 5%, OK? No, he shouldn't be doing this. You go in the first day, you say, listen we need our prison -- don't talk about the $150 billion yet because you don't want to give them that either. You go in, you want to get the prisoners out, and you say we want to get our prisoners out. You have to let them out. They don't help you. They do help us. Set a nice tone, a very nice tone. That's a word that Hillary uses a lot. She said, she doesn't like my tone, my tone. By the way, they're chopping off heads of everybody in the Middle East, especially if you happen to be Christian. They're chopping off your heads. She doesn't like my tone. If you can believe this. I don't like their tone. I don't like her tone. Crazy. So you go in and you say, we got to have our prisoners back before we start. They going to say no. Because the Persians, you know, they're great negotiators. The Iranians, Persians are great negotiators. So they're going to say no, absolutely not. We're going to say, bye-bye. Now, you leave, you leave the room. We never leave the room. How many times did we all think Obama was going to leave the room? Meaning get his people to come out. They go back to Iran. They tell everybody that we're stupid. They're winning. And this is before the deal's even done. Everyone's saying it was stupid. When somebody says you're stupid, you don't do the deal. But they're marching in the streets and celebrating a deal that hasn't even been done. But I say, we won't operate. We say no, they say no. And they're going to say no. Now, you leave, you double up the sanctions. You sit back and wait for the phone call, right? They'll call you up within 48 hours guaranteed. And they'll say, we'll give you the principals, right? No, no this is the way it works. This is the way it works. So they give you the prisoners, so now you have -- you got to get the prisoners and not at the end, you get them out the beginning. You get him out before it starts and all you had to do is just say, and you will never get them in the first session. They'll say no, 100%. I mean, 95%, might be they give them but I doubt it. But you leave and you double up or triple up, and they say and that's it, OK. Now, we have our prisons back. Now you go back in, next statement, we're ready to start negotiating, we want to be very fair, but we will not give you the $150 billion. We're not going to give you any money. We've got enough problems. We owe $19 trillion bucks. We owe $19 trillion and we're giving them $150 billion and we just tell them this. Not good, right? Hey, what could Vermont do with a $150 billion? No, we've made we've made Iran a real power. So what you do is you say -- you've got to get the prisoners out first. You don't mention the money because, you know, when you mention the money that -- now it gets tougher. So now they say, no, we have to have that money. We say you're not going to have it. I mean, you're just not going to have it. We don't have it. Claim poverty. We're a poor nation. We owe $19 trillion, the stupid budget that was approved two weeks ago. This stupid budget. Now how about that? Did you ever see a budget approved so fast? And that's where $2billion, that's where $2 trillion. So now, we're going to be at $21 trillion. Here's the budget, I don't get it. You know, the only one -- because I think Obama's one of the worst negotiators, perhaps in the history of the world, OK? Except with the Republicans, with the Republicans, he's a great negotiator. With the Republicans he does great. He gets a budget approved. I don't understand. He's got the money for Planned Parenthood. He's got the money -- think of it. He's got the money to fund Obamacare, which we're going to, by the way, which we're going to terminate. We're going to repeal it and we're going to replace it with something much better. You see your premiums? Do you see what's going on? Your premiums are going up 25%, 34%. And I see one going up 48%, 48%, a friend of mine calls me up. How's it doing? Oh, this Obamacare is good, 48%. Your deductibles are through the -- you'll never get to use it. You have to die to use it. You have to die. You need massive opera -- you need like 40 operations on your brain and maybe you could get something. No, the deductibles are through the roof. They're through the roof. Obamacare is a dead duck anyway because in '17 it fell just by luck. If I win, I get Obamacare. It's going to fail during my -- and then they'll blame me. Can you believe it? They'll blame me. They'll say, oh, Trump did a lousy job, Obamacare failed. If we had Obama it wouldn't have failed. Well, it's failing of its own weight. And numerous stories came out recently whereby '17, which is in two years, it's dead. It can't survive. Of course, the Republicans will probably find a way to keep it going. I'm so upset and angry with the Republicans. We know -- we know what we're getting with the Democrats but the Republicans, they for -- here, we finally have majority so we have majority, majority and we have the wrong President, right? And -- but the second majority doesn't -- it's like we're doing worse now than ever before. And now Obama, he's got so little respect for the Republican leaders that he just goes along and signs Executive Orders for everything. No, no it's all Executive Orders because that's easy to do. I'll tell you the one good thing about an Executive Order is that the new President comes, and with just a signature. They're all gone, OK? That's good. That's good. And they're gone. They're gone. So when you look at a deal like that, when you see what's happening with our country, and you see that we're going to change that. Now, as far as Iran is concerned, I saw what happened over the last few days with the Embassy in Iran, the Saudi embassy. Folks, they want to take over Saudi Arabia. Now, they're taking over Iraq because we handed them that on a platter. I was against going in. I am the most -- and I say it all the time, I'm the most militaristic person in this room except for that guy with the hat. Stand up with a beautiful beard. Stand up. He's the only one. He's the only one. You're my guy. Thank you, and you're my guy. I can tell. I know them. Do I know my people? And I've never met him before. He just looks good to me. He -- no, I said he's the only person more militaristic than I am, OK? And you are. You know what I'm talking about. No, but I'm the most and we're going to make our military so strong, so powerful, so big, so good, so good. And that nobody is going to mess with us, folks. But I'm the one that didn't want to go into Iraq. And in 2004, 2003, you'll see stories, Trump said don't go into Iraq, you're going to destabilize the Middle East, OK? I mean, say what we want. We spent $2 trillion, right? $2 trillion, $2 trillion, wounded warriors who I love, all over the place, I see them so many, some of them so badly injured, and they have a better attitude than I have, and they have a better attitude than half of the people in the room have. I mean, these are amazing people, men and women, that -- what they've gone through and their attitude and what I said is we take the oil, remember? How long have I been saying it? Take the oil. For years, I'd been saying -- and they'd been saying. That doesn't make sense. You can't -- now, they're taking the oil but then I take it, if they're bombing it. Although, Obama doesn't want to really bomb it because he thinks it's going to create air pollution and be bad for the atmosphere. And this is a true story. What do you think of General Douglas MacArthur if they said, you can't really bomb the oil because it's bad for the environment. You think he might say, I don't give a damn. Bomb. Now, we need, we need Douglas MacArthur. We need General Patton. We need people. We need people. These are great people. These were incredible people. These were people that won. They know how to win. We didn't -- we don't have people that know how to win. We need people. And you know what? In the service, we have -- I know a lot about West Point and Annapolis and the Air Force Academy et cetera. We have great people. We have great people. We let one of our best Generals go because he had foul language. You talk to -- you know he had a lot. You know I'm talking about. He had foul language and we let him go. And yet, the people loved him. His soldiers, his guys, they -- and women, they absolutely loved this guy. They went to fight for the guy but he, he was very fouled mouth. Who the hell cares? We got to start winning. We have and I say this, we have an amazing situation because I see these Generals they're on television all the time. Generals on television. I don't want Generals on television. I don't want them. And they're just saying what we're going to do. What are you going to do? We're going to do here and then we're going to attack here and then we're attacking here and I figure it's camouflage, right? I figure it's camouflage, right? They're giving false -- turns out to be true. Or Obama two months ago, right? We sent 50 people over. He thinks it's good. See, I think it's bad to say 50 people because 50 people. What the hell are we doing? But we're sending 50 people. So he announces we're sending 50 people. Now, these are really our finest. These are 50 incredible guys and I assume women. These are our finest and they're going off, all right? Why do we have to say that they're going there? Because now they have a target on their back. No, no seriously. They have now a target and the enemy is looking for them. Unbelievable. Unbelievable. Unbelievable. That was a very mild protestor, I would say. You know what I love about the protesters and I'll tell you. What is that? Is that a camera? Is that a camera? Are you on my side or somebody else? He's holding something up and I hope it's a camera. He's on my side. I can see. He's, he's one of our guys. He's, he's one of the good guys. But you know like these protesters, they come in, and the only thing I like about them is that the -- look at all those cameras back there. Look at all of them. Everybody's on television but they never show the crowd. They never want to show the crowd. And the good thing about the protest -- they won't turn them. In fact, I used to think that like their fixed, it's a modern camera, right? So they're fixed and you can't turn them. It's always on my face, right? And you've heard me say this before. They never turn them. And what happens is when you have a protester, the only time people learn how big these crowds are, because we've got 20,000 in Dallas, 35,000 in Mobile, in Iowa, in New Hampshire, we have the biggest crowds. South Carolina, we're packed. We're going to be in Pensacola, Florida next week. We're going to have 20,000 people. We have the -- and nobody ever knows. I go home to my wife, she said, oh, you did well tonight. How was your speech? Did you have many people? I said many people, the place was packed they had thousands. I had 15,000 people in Lowell, Massachusetts the other night. You saw that. We set a record in the history of the arena. And she'll say, did you have many people? And I say why do you ask? Because they never show the crowd. That's why I love protesters because whenever there's a protester -- you know I think they can't move the cameras, right? That they're fixed. They turn into pretzels. They can move them. If there's a protester behind and under the camera, it'll do a somersault. It's unbelievable. So -- it's true. It's true. That's true. We had a good time. We have a good time. Thank you. We have a good time. You know we have a good time with a bad subject because we don't have much going, right? We don't have much going in terms of -- and I always say, I tweeted out today, @realDonaldTrump, @realDonaldTrump, it's great. Five and a half million people or I have more than five on Face -- I have like all this. It's sort of like owning the New York Times without the losses. It's unbelievable. You -- no, it's true. You tweet out, you have millions and millions of people. I mean, friends of mine they do a book. Would you do me a favor? What? Could you tweet out that I'm doing a book? So if I liked the guy or the woman, and they're doing a book, I tweeted and all of a sudden they become a best seller, and then they don't talk to me anymore. They give me no credit. They give me no credit but it's -- it is a powerful instrument. You know we're dealing in social media and we're getting a lot of credit for doing a good job with social media and a lot of the voters. That's true. A lot of the voters, a lot of the voters are going to be coming out, and it's you know, it's been, it's been really amazing. So just to finish you off with Iran, so what we do is we negotiate properly. And I have the greatest negotiators in the world who want to come with me. And Carl Icahn, one of the great businessmen endorsed me and many others. You know Carl. And they don't want money. They don't want money. They want to help. They want to do something. You know they've made billions and billions of dollars. They don't need to be paid, you know, a salary. Now, we have negotiating against China. We have people that are political hacks. We have people that gave money and they want to be in, you know, in government, and I want to pick the finest people. Some of them, get prepared, are not nice. They're bad personalities but they're brutal, brutal genius killers. I want them, right? Don't we -- I mean, we lose, we lose so much money on trade and all of these other things. So you're right. So here's what's, what's happened, and over the last short period of time, I'd been talking about the deal with Iran, and I've been saying it's one of the worst deals but then I thought, it's even worse than I thought, because I thought $150 billion that they got and all of the other things that they got. And they'll have nuclear proliferation all over the place because of that deal, and that deal is horrible for Israel by the way. Horrible. It's really horrible for the Middle East but it's horrible for Israel. And Netanyahu, I don't know, he was having an awfully hard time. I think Barack Obama is the single worst thing that's ever happened to Israel. I really do. And then I said to myself, OK. So they made this great deal. They made this great deal. And then I said you know, it's one of the greatest deals, I started thinking, no, it's not. The greatest deal they also made. They made the two great deals. It's like a movie company like you know, you take Marvel, where they have these great successes, right? They've got like five of the top 10 movies ever. Well, this is the same thing. Think of it. So they make this great deal. What else do they get? They got, they got Iraq. Get him out. Get him out. Get him out. Get him out. Yeah, take them out, please. It's fun, right? Get him out. You know, it's sort of fun isn't this more exciting? You know, you go to a Hillary thing and it's like boring. You go to a Jeb thing and you fall asleep. We had -- we had in New Hampshire, we had 4,500 in one of the events. We had 4,500 people. Jeb had 101. His -- Are there any remnants? Any remnants up there? Them -- there may be a remnant. Oh, no, it's only the same people coming down the stairs. Now, there's a remnant. Yeah, he's right there. OK. Yeah. Throw them out. Throw them out into the cold. You know, don't give him that coat. No coats. No coats. Confiscate their coat. You know you can't win -- by the way just to finish. I just -- I have one word left Iraq. And nobody heard it because these characters. So they not only got a great deal but they also take over Iraq with the second-largest oil reserves in the world. They have it, sure as you're sitting there, they have Iraq. So we spent trillions, we spent all -- and who's taking over. Iran is taking over the oil. They've taken over Iraq. I mean, what we are doing is so incredible. There's nothing like what we've done. We're destroying ourselves. We're losing our jobs. We're losing our base. We're losing everything. And it's not going to happen anymore. It's not going to happen anymore. It's not going to -- we're not going to let it happen any more. Not happening. Now, I will and I will tell you something about the protesters and I respect what they're doing. But I really believe unless they have a substance abuse problem which is probably there, he does. He definitely does. No, I really think I could take them into a room, talk to them for 20 minutes. What are we doing? We want a strong military. We want good healthcare. We want a great country. We want low taxes. I've cut the taxes way down. Especially for the middle class and business, and you know, I actually said, I said I could take these kids, most of them are kids. Oh, are they talking back? I don't even hear. Their voices are so weak, I don't even hear them. Is this -- OK, you can get him out. Yeah, get him out. Thank you, darling. I love my people. They say my people are the most loyal of anybody. I can do anything. They say that that -- did you say -- they say we have the most, right. I'll tell you what, I have the smartest people. They were trying to say, well, our people are -- let me tell you. We have the smartest people. I'm really smart. My uncle was one of the top people at M.I.T., for years he was a private -- we have good stuff. We have great genes in this room. We have smart people. They get it. They get it. They really do get it. It's been an amazing, it's been an amazing journey for me. Somebody shouting back there? O,h I love you. Oh, that's good. But, but isn't this more exciting though than these other ra -- with nobody. They have no protesters, nobody cares, nobody cares. They go in everybody falls asleep. They say, can I go home now, darling? And everyone leaves and the guy standing there, please vote for me. How about this guy O'Malley? I mean here's a guy. No, think of it. His number one credential is that he was the Mayor of Baltimore. Can you believe it? And he, OK, so now he holds a rally and one man showed up. Did you see that? It was one of the great -- and he's sitting there talking the guy for an hour. Just the two people. Then, the guy gets up and he leaves and the press as well. Are you going to vote for him? No, actually I'm not. Spends a -- I mean, he -- it's time for him to get out. It's time, time for O'Malley to get out. He is really bad news. At least Bernie is getting some action. He gets much smaller crowds than me but at least Bernie gets some action, right? Oh, would I love to run against Bernie. I would love -- I would, oh. That would be a dream come true. But actually, I must say, I have my mindset on Hillary. I do have my mindset. I have my mindset on Hillary. I mean, it's just, it's just going to be -- what? We'll take it. What does that mean? That's not us. I got in such trouble. I got -- how about last week, did I get in trouble? What did I say? What did I say? I said nothing. But they -- I did get -- I did get in trouble. The crowd there was incredible too. Do you know what happens? We have amazing people. We have like these crowds and they're all like interchangeable. We have great people. You go to the South, you go to the North, you go to the West. The people have one thing in common, the enthusiasm, the love of their country. They love their country. It's unbelievable. And let me tell you, let me tell you something. It's going to be very interesting. I don't think we can be beaten. There's a momentum that we have. There's a momentum that we have that is so unbelievable. I thought I heard a little voice over there. All right, get him out. Take him out. Get him out of here. Don't give him his coat. Don't give him his coat. Keep his coat. Confiscate his coat. You know, it's about 10 degrees below zero outside. No, you can keep his coat. Tell him we'll send it to him in a couple of weeks. All right. It's amazing. No, it's amazing. It's amazing. But you know what? Sometimes we have -- sometimes you go into 20,000, you have none of that. I knew I was going to have some in Vermont, in all fairness. If we didn't have that it wouldn't be Vermont, right? I mean it wouldn't be. Hey, why do you think the other Republicans are not coming up here, folks, OK? I'm the only one. Why do you think? But it is -- it's a funny story. So the first time it happened was a couple of months ago and I was really nasty. Because now, you know, look. I'm not getting out there with a fight. But I'll tell you one thing, we all like Bernie, do we like Bernie? Well, if you want to pay a 90% tax, I mean, he wants to tax you at 90%. OK. So you don't like him. I wasn't sure, I had to feel that out. But how about when the two young women took over his microphone? They came up screaming at him and he retreated. He went like and they made the speech for the rest of the -- that won't happen with me I promise. I promise. I promise. That was a terrible -- I tell you what it was so embarrassing to watch that. You know because he's a politician. He's from this country. When they took over that microphone that night, screaming at him, he was petrified. He walks to the back of the stage with that tall guy. The goofiest guy. He stands there and they're both watching these two girls speaking, and the crowd is saying give them back the mic. Give them back and Bernie said, I lost so much respect for Bernie. That was terrible. We can't let anybody take over our mic. We can't let it happen. Can't let it happen. So when I started this journey and that's what it was on June 16th in New York. I said to my wife, you know, we've got to do it. And I looked down in that building, at Trump Tower, 57th and 5th Avenue, and I looked down and I saw more of those cameras than I've ever seen at one place. I have never seen any -- the entire lower level of Trump Tower was cameras, cameras, cameras. Outside on the streets, they would close their trucks. You know, the trucks, the equipment, NBC, ABC, CBS, FOX, everything. Networks I never even heard of. I never saw so many networks I said oh, they're that many now. Every -- it was like the Academy Awards. It was. It was like the Academy Awards. You all remembered. And everybody said he's not going to run. So you know they were all waiting. But I just said look, we got to do it. And I took a deep breath and I said, let's go. Because it takes guts to run for president. It really does. No, it really does. I mean, it's not something I had in mind. Steve Burke who's a great guy, the head of Comcast, he came to my office just before, he wanted me to renew for a lot of episodes of The Apprentice, and you know, it sounds a little trivial. We love The Apprentice. It sounds trivial, it's not, it's a lot of money. And then the deals I lose and all that -- plus I love my lifestyle. And you know now, I'm driving around in an armored vehicle. I drive around in a vehicle. I say, how good are those windows? Sir, they can take 28 AK47 bullets before they degenerate. I said that's a hell of a window, right? And then I say, how about the doors? The doors are unlimited sir. They can take in the bottom or the top. You know, I'm driving around in an army tank. I'll never see a Rolls-Royce again. No, think of it. I may never see a car that I want to be in again. And they always put me in so fast. I'm going in. You know it's a -- whatever the hell they call them. And I, boom, get in. Boom, the door closes. And when that door closes, I mean we're talking about -- the only thing good if you ever get hit. Nothing's going to happen I'll tell you that. But it's been, it's been a really amazing experience. I mean, the best part of the experience are the people that I've met. The people in this country are so competent. I mean, They're so incredible and they're so enthusiastic and I mean that. I love the people. I love the people. But I said to my wife, I said come on, we have to do it. We got to do it. And I literally didn't know until that escalator. We've all seen the famous escalator ride down, right? Melania in a beautiful white suit and me waving. Hi, I didn't even know who the hell I was waving to. And I came down and we made a speech and we talked about illegal immigration, right? Did I take heat? Did I take? Rush Limbaugh said he has never seen so much in coming to one person. It's true. I took -- I've never had anything like it. And then two weeks later, it started dying down, dying down. Now, people are saying he's right. It's turned out to be right. It's now, I'm like, I'm like, all these guys are trying to catch me and Ted Cruz who I like, but three nights ago, he was being interviewed and he said, and we will build the wall. He never said that. My wife said that gentleman just said we're going to build a wall. He's going to build a wall. I said he never said that before. So they're all coming to me and they're all -- but nobody can do it like -- first of all nobody can build a wall like me that's for sure, OK? I'll build it bigger, better, stronger, more beautiful, and for less money. I love it. Get him out of here. Get him out. Come on. Security move faster. We need security that moves fast. Come on move faster. Come on security go faster. Get him out of here. Come on. Get him out. We got to get the security moving a little bit faster here. Come on fellas. They've got to move faster. We're not dealing with tough hombres. You know, I'll tell you what has happened though. The first night, the first night that I had these characters. The first night, I -- you know, I figured it's all, it's all like, you know, a little bit theatrical. I said because I don't want anybody to get hurt. No, I don't want anybody. Maybe. But I was rough. I said get him out of here now. Get him out. Get him out. I want him out now. And the guy was a rough guy. He was swinging and the other guys were swinging. And my audience starts swinging. You had guys I don't think they were ever to fight before. And you see them and they go in like this. And I say oh, move that guy out. He's going to get killed. But you had him all over. But this was a rough guy. Very, very loud and I -- you know, I figured I'd be rougher and boom, so I'm screaming Get him out of here. Get them. OK. I was criticized so badly. It was terrible. He was so mean and rough and terrible. I was killed. Do you remember that? I was killed and all I'm doing is screaming, get him out of here. So the next time it happened a week later, and we had protesters, and I said gently, please remove them, please, be very gentle. Don't hurt them. Don't hurt them. You guys throwing fists and fighting and my poor guys, I'm saying don't hurt them. You know my guy -- one guy took a big shot to the face because I'm saying don't hurt them. Then in meantime the guy's got a black eye like you wouldn't believe. So I say easy. Don't hurt him. Easy. I got killed the next day. They should trump is weak. He's weak. So you're too tough and too mean or you're too weak. You can't win with these people. They're so bad. Oh, I hate them. I hate them. I hate them. I hate them. So when I started, we talked about illegal immigration. I talked about it in front of all of these cameras and we were very, very strong on it and it worked out. And it turned out I was right. Then as you know, I did something recently because we get problems, folks. We got problems. You take a look at Paris, you take a look at Brussels, you look at what happened in California, you look at what's happening all over the world, you look at what's happening in Germany. Now, I got -- I'm on the cover of Time Magazine this week. Can you believe it? I don't know. Can you believe it? No, no think of it. I was on the cover like five, six weeks ago and I was honored. You know, it's still -- look, we can act cool. It's still the Time Magazine and you're on the cover. It's pretty cool, right? You come from Brooklyn. You live in Queens. You work in Brooklyn, all of a sudden you're on the cover of Time Magazine every couple of months. That's pretty cool, right? Pretty cool. But -- so I was on a few like two months ago, and then today, I didn't even know. I mean, this is when you're really cool, right? I'm on the cover of Time Magazine and they put it on my desk. It comes out tomorrow. Go buy it. The story's good. So go buy it. But if the story wasn't good I wouldn't even be talking about it. They put it on my desk. I say what's that? Time Magazine. Oh, I think it, you know, somebody's doing a joke. How could I be on the cover -- I didn't even know they were doing a story. So they did a story. It's a great story. And it talked about winning and it talked about the tremendous crowds we're getting and it talked about the tremendous enthusiasm. And it really talks about the fact there's never been anything. There's never been anything like this. But the amazing thing, think of this. I didn't even know. Normally a reporter would call you. Give me a couple of like, you know, this is what I think. Nobody ever even called me. I'm the cover of the magazine. But what happened is when it came to the person of the year, used to be called The Man of the year, what sounds better? The Person of the Year -- for the women, only the women. What sounds better Person of the Year or Man of the Year? They're saying -- I'm telling you. Man of the Year. That -- the women are saying, the women are saying Man of the Year. Is this the weirdest thing? We have to be politically correct. So we're going to go Person of the Year. So they have Person of the Year. No, I mean, oh, there's so much of this stuff, you have no idea. There's so much. No, I mean you just heard it. A lot of women and they're all saying Man of the Year. And I actually think it should be personal. It just doesn't sound good. But -- so they come up, their year-end issue Person of the Year. Everybody said Trump is getting it except me because I said I'm too controversial. I'm not Establishment. Thank goodness. I'm not Establishment. We're going to do something with your staff. You know, The Establishment? These idiots like Karl Rove and all these characters they spend -- they don't know what they're doing. He was actually on the other day, I think I had like a 42 or something. And he said, well, that doesn't mean he's going to win. And even the announcer goes, really? Tell me why not? You know, it's -- he's sure as hell got a good start. No, the hatred is incredible. So I said there's no way that they make me and I think I came in second or something, second or third, and they chose Angela Merkel. Why? Because she allowed millions of people to come into Germany. And Germany is now, Germany is now in deep, deep trouble. You look at what's going on in Germany. They have got problems like you wouldn't believe. And you look at Brussels and you look at all. So I said we have to do something. We have to figure out what the problem is. We have to figure it out. Now, we have a President that doesn't want to talk about it, right? Radical Islamic terrorism. He doesn't want to talk about it. He doesn't want to mention the term. He doesn't want to use the term. By the way, I have many friends. I have many friends, they're Muslims, they're fantastic people. But we have a problem. We have a problem. We have to find out and we have to get to the bottom of the problem. We have to be able to solve the problem. We can't have people flying airplanes into the World Trade Center. We can't have people doing what they did in Paris. We can't have people doing what they did recently in California. We have to find out and we have to get back to the basics and we have to find out. We have to find out. We have to -- we have to solve this problem. And it's a very deep-seated problem and there's a level of hate that's so incredible. We have to get to the bottom of it. Now, these two people, these two people that killed 14 people, plus, plus because you have people laying in the hospital very badly injured. But these two people they had an apartment. They had pipe bombs all over the apartment. Other people knew they had pipe bombs. Why weren't they reported? People knew what was going on. They had numerous people that knew. One of them didn't want to say it because they didn't want to be accused of racial profiling. Do you believe it? Now, I know what that was, that was a lawyer saying, listen, they know you knew. So what you'll do is you'll use racial profiling as an excuse. They didn't want him to say -- they -- he actually said or we didn't want to call the police because we didn't want to be accused of racial profiling. That's called politically correct. That's called give me a break. Give me a break. So we got to get to the bottom of our problems. We've got to, we've got to you know, we'd become like -- Get out of here. OK, security move a little faster, please. Thank you, security. Yeah, get him out of here. Get him out of here. Please, go ahead. Yeah, get him out, please. Get him out of here. Honestly, they're very rude but it makes for more fun of -- isn't it more fun this way? I find it to be more fun. The other, the other gets boring. Here, we have no boredom whatsoever. Nobody's falling asleep, right? Look at that guy with a beautiful woman. Nobody's falling asleep, right? All right, thank you. So, folks, we have to take care of people and we have to have a big heart. Are they out security? Are they gone? Are they gone? Thank you. They're so rude, they're so rude. You see today, we have security people that are, you know, it's hard. Ten years ago, they would have been on their ass, those people. They really were about -- 10 years ago, it would have been much tougher. This is what happens. And this is why we lose control of our country, folks. This is why we lose control of our country because everybody's afraid to do anything. The police who, who are these phenomenal people that are totally mistreated, by the way, totally mistreated. And they really are, they're afraid they're going to lose their job over stuff. You got him out of here? Get him out. We'll get more and more angry as we go along. Is that OK? And by the end, I'll say get them the hell out of here. And then by the way by that time, the security will be so tough and so nasty. And you know what's going to happen when that happens? You're not going to have any more problems. You're not going to have any more problems. Did you notice the first group? The security guys are going? They're not my guys but the first group they're going, oh, please come with us, and they're screaming and they're just going please come. All right. Second group there -- look now the last time they're starting to get nasty. Pretty soon they're going to get so nasty that we're not going to have any more protesting. You know that right? So we have to solve our problems. We have tremendous crime problems. We have tremendous problems at the border. We have to solve our problems and we're going to make this country so strong and so great. We're going to take care of our veterans. Our veterans are just absolutely treated so badly. Our veterans are treated so badly. You look at the Veterans Administration, one of the most corrupt groups of people anywhere in this country. Our veterans are going to -- they -- it is what's happening to our veterans. These are our great people. They are being treated terribly and we're going to change that and we're going to get it changed. And we're going to get it changed quickly and fast. Thank you, everybody. So when I started this it was about trade with China. China's ripping us. It was about trade with Japan and Mexico. They've taken our businesses. They've taken our companies. Nabisco is leaving Chicago, going to Mexico. No more Oreos for anybody in this group, no more. I don't want any Oreos anymore. Nabisco leaving Chicago, building a big plant in Mexico, closing up. What -- how does that help us? How does it help us, folks? How does it -- then they make and they send the product no tax, no nothing, boom. How does it help us? Ford, $2.5 billion-plant in Mexico. So they're going to make cars, trucks, and parts. They're going to bring them over the border. They'll probably be driven over the border by illegal immigrants because it's very inexpensive. No, it's true, it's true. They'll be driven over. They come in the border, nobody's going to check them. You know, we don't have anybody to check them. Nobody cares. And our country's going to hell. Our country's going to hell and it's going to stop. And I tell people, I tell people like using Ford as an example. You take Ford as an example. They go and build a wall but they go in, think of it. They build this massive -- you know what a $2.5 billion plant? We're talking a one-story building, $2.5 billion. Now, how many places close up in Michigan and other places to get that done? And I tell people, let's say, uh, this is impossible to imagine. Low energy Jeb Bush becomes President. Hello, I'm Jeb. No, he's afraid to use his last name. Can you believe it? I'm Jeb with an exclamation point. I said to him use your last name, I think you'll do better. Actually, I think you'll do better. But look, but he understands what's going on, and he'll say, and they'll say this is bad. And he'll say, well, you know, let's do it. Then what happens. The people that gave him the $128 million, can you have -- what he's using a lot of it on negative ads on me. So far, it's had no impact which is, actually, I went up in the polls. I don't know what they are -- somebody's doing a bad job. But those people that gave him those millions and millions and millions of dollars, they know the people at Ford, and they know other people, and they get hired because they're lobbyists and their special interests. They make a lot of money and they'll go to Jeb or Hillary or Marco or any of them because every single one of them is borrowing and taking money. They're taking money. Again, I'm the only one that's not. So they're going to go in and they're going to say you can't do that because they know it's no good. We're losing factories. We're losing our jobs. They're going to have jobs but the jobs are good for Mexico, not for our country, right? So they're going to go and they're going to say like, well, let's say Hillary said it's not good, we're going to end it. She will be met with such resistance from the people that gave her the money, all this money to run. And one of them will say you can't do that. These people supported you. They gave you $5 million. You have to let that factory go through. You have to let them build that plant. Nabisco has to build, Ford has to build, they all have to build. With me, it's different, OK? With me, it's different. With me, it's different. With me, they're going to come in. And they're going to say, President Trump, sir, -- no, well, thank you. They're going to say, Mr. President, it's really a good thing for our country. Now, you know why? Because we're losing jobs and closing factories that's good for our country? Not good for our country. Nobody's going to come -- you can go -- you don't have to go through high school to know that. It's bad for our country. They going to say it's really good Mr. President. OK, so after about like two minutes, I'll cut that one-off. And they're going to say we were -- I said no, no, no, no. We want the plant to be built in the United States. I don't care where. I don't care where. We want that plant to be built in the United States and we want the jobs to be from the United States. And we don't want cars built in other countries like in Japan that are pouring into our country like millions and millions of vehicles, pouring into our country. Coming off in the case of Japan, the biggest ships I've ever seen. You go to Los Angeles the cars are pouring off by the millions and we get -- what do we get out of it? What do we get out of it? No tax, no tax, no nothing. So the head of Ford would call me, Mr. President, we'd like to do it. We think it's very good for the country. Oh, really? OK, the answer is no. He'll then call me back and I'll say, I want you to build the plant but I want you to build it in the United States. I guarantee you. I don't need anybody for this. This is too easy. I guarantee you within 48 hours I get a phone call saying Mr. President, we're going to build the plant in the United States. And you know why? Because I will have told him that if you build that plant, you're going to have a 35% tax for every single vehicle that comes across the border, every single vehicle. You're going to pay tax and I'm a free trader by the way. I am a free trader, I believe. But you have to be smart. We need smart people to make these deals. We have such trade deficits with Mexico, with all of these companies. I told you before with China. Now, when we do business with China, they make product and they sell it over here like forget it. No anything. Just come on in, no tax, no nothing. They take Apple. They build up -- and my dream is to have Apple and companies like Apple to build their factories here, instead of building them in China, and Vietnam, and all these other places. That's what I want. And we have the people that can do it. Yes, speaking of that though, when you think. Remember when we were -- some of you are a little bit older and some are very young because we actually have a young audience. We have a very young -- but some -- so they won't remember. But do you remember when we used to have the stickers made in America, right? You don't see that anymore. You don't see it anymore. Made in the USA, less so you see it. But it was made in America. And when it said Made in Japan that was a bad thing. That was like a cheaper product, right? Made in America. Many of us remember that. We don't have that anymore. We're going to go back and we're going to have that again. And you know what else we're going to have? You know, what else we're going to have? When it's Christmas time, we're going to all say, Merry Christmas. It's true. It's true. We're going to say Merry Christmas and we go into those stores, and we go into those big department stores, and we go into Macy's where the stock has just crashed, which I love because they were so disloyal. I mean, you know they were so disloyal. I love watching that stock go down from what? from 75 to 35 or 34. I love it. I love it. No, so disloyal. Why? Over illegal immigration. I mean, you know, they have -- it's just horrible. But you go in there you don't see Merry Christmas. We're going to see Merry Christmas again. And we're going to have happy holidays. And we have to take care of everybody. But we're going to see Merry Christmas again, folks. We're going to see it. So with China, what happens is they bring stuff in here, no tax. We try and get stuff there. I have friends that are in the manufacturing business. It is brutal. They say dealing with China is impossible. Now, I love China. I love the Chinese people. I sell apartments for millions and millions of dollars at the largest bank in the world, largest bank in the world, Chinese bank in one of my buildings, pay me rent. The rent is good, that I can tell you. I don't have to worry about the rent but China is great. The problem with Mexico and Mexico's great, thousands of people work for me. They're great. Their leaders are too smart for our leaders. When the people are pouring across the border, Mexico is in there, oh, isn't that too bad. And you know what? When Kate, beautiful Kate got killed in San Francisco by somebody that came over five times, OK? And when Jamiel was killed in Los Angeles, this young and credible African-American boy, whose father is a friend of mine, a great guy. The father is like this great guy. This son was the apple of his eye. Young boy walking down the street, right in front of his house, going home to see his father, and he gets shot in the face three times by an illegal immigrant that wasn't supposed to be here. Or the woman or the woman in Los Angeles who got raped, sodomized, she's a 65-year old veteran, raped, sodomized, and killed. We got us -- and that's pean -- that's just the beginning. Now, I'll tell you what, we have, we have something else going. You have a woman up in New Hampshire who actually said I'm going to vote for Mr. Trump. Now, you know the woman I'm talking about? Where she shot the guy that was attacking her. She carried a pistol. I love this woman. I love this woman. So she's -- feels somebody's behind her because we're going to protect the Second Amendment, folks. We have to protect it. We have to protect it. So you know, Howie Carr, he told me about this And then I read it and then I saw it. Howie's a great guy. He's a fantastic guy, really good. And I did his show and he told me about it -- I went. I got the stuff I said that's incredible. And yeah, she's for Trump. I love that. I love smart, tough, great people being for Trump. I don't want a lot of people. Some people I don't want. Somebody said, oh, so-and-so is not going to do it. I don't want his endorsement. I don't want it. This woman, those are the people I love. But she's followed and she feels there's something wrong. Never used it. She has a permit to carry a gun. And the guy breaks in, she opens the door, breaks in. He's coming at her and she shoots him. It doesn't kill him, doesn't kill him, which is good actually. Doesn't kill him but she shoots him and he goes to the hospital. I said that's so beautiful. That's such a beautiful story, OK? Such a beautiful story. We need our guns. We need the guns. I mean, whether we like it or not, we need our guns. You know, if in California, and I tell this all the time, if in California or in Paris, you know, Paris is the toughest place in the world to get a gun. The strictest laws, you cannot have a gun, unless of course, you're a bad guy, a bad guy, no problem. You know, you just walk in with a gun, right? No problem. But in Paris, the toughest laws anywhere in the world they say. France generally, so what happens? 130 people killed. Now, think of it this way. They walk in, I call them the bad guys, I call him the guy with the dirty head. These people were saying the mastermind. They called him a mastermind. And I'd been talking for two weeks after that incident and didn't call him mastermind anymore. They say, the mastermind of the Paris attack, the mastermind. He's a slob. He probably has about a 70 IQ, he's a dope. And you know what? Let me -- a dope. I saw him with a white hat that was filthy, dirty. The press is calling him a mastermind. Then, they wonder why our kids are radicalized over the Internet. The Internet, they're calling these people masterminds. What did he do? He put a couple of people in these different places and they start killing people. That's not a mastermind. That's a sick puppy, folks. That's a sick puppy. And we can't call him. We can't call him a mastermind anymore. But think of it. So you have these guys they walk into a number of places in France and they say, get over, boom, get over, boom, get over, boom. Nobody had a gun on the other side. Now, if I took you or if I took you or if I took a couple of the people in this room, and you had a gun strapped to your ankle or strapped to your waist. I'll tell you, it's a whole different outcome, right? It's a whole different outcome. It's a whole different deal. You don't have 130 people. You don't have 130 people. And you have bad stuff happening but at least we're shooting back, and we're going down shooting. And you know what? And nobody can dispute that. And when I have debates with these people, and by the way they say, I won all of the debates. Can you believe it, I won? I never did it before. All of the online, Paul Drudge, Time Magazine, Slate, all of them, PBS, they all say, Trump won the debates. Can you believe it? Then, I go home and I watch how did I do? Well, you did, OK. Not so great. He did OK. Can you believe -- and then my numbers go up. I went up last time 11 points right after the debate. I went up 11 points. Can you believe this? And I didn't know when I'd be able to debate. Who the hell knows? I got these politicians, all they do is talk, I create jobs. All they do is talk all day long and they're not very good debaters, are they? Really, they're not too good. Anyway, so when you look at it and if you, if you had people with some protection, even if you had four or five people in there, it would be a whole different story. And people cannot beat you at that. I -- I deal -- you know coming from New York and they want to get rid of the guns and they always want to get rid of the guns. And I talk to them and I have these debates in front of people. And I went after like two minutes, it's over. They can't beat you in that debate. They can't. And then I call them the next day. I said so do you agree with me? No, I don't. No, I don't. Look, if we would have had guns on the good guys in California, if they would have had them in Paris, if they would have had -- about on the military base with five great soldiers, two of them were world-class soldiers. Two of them and one, in particular, was one of the -- I mean he was a triple A. This guy was one of the greatest soldiers and they were on the base and they have a gun-free zone on the base. Whoever heard? Gun -- you're in a military base. They have a gun-free zone. Now, you know what a gun free-zone is to a sicko? That's bait. That's like gun-free zone and then they walk in with whatever the hell they're carrying, and these five great soldiers, and I'm telling you, one of them was one of the most highly awarded when -- he was super shot. I mean, he's not allowed to have a gun. All five were killed instantaneously and you have other cases. I will get rid of gun-free zones on schools and you have to. And on military bases, my first day it gets signed, OK? My first day. There's no more gun-free zone. I mean, think of it, a gun-free zone. A gun free-zone on a military base with some of the best soldiers we have sitting there relaxing, watching television, no gun, guy walks in, kills all of them, OK? That ends immediately. We're going back to sanity in this country. We're going back to strengthen this country. We're going back to intelligence and we're going back to common sense. We are going to Make America Great Again, greater than ever before. I love you. I love you. Thank you. Thank you. Thank you, everybody. Thank you, everybody. Thank you."}