{"id":483,"author":"Donald Trump","title":"Speech: Donald Trump Holds a Campaign Rally in Hilton Head, SC","date":"2015-12-30","link":"https://factba.se/transcript/donald-trump-speech-campaign-rally-hilton-head-sc-december-30-2015","paragraphs":["So incredible. We have had, no matter where we go. You know, it's a movement folks. This is a movement. This is a movement.","No matter where we go -- it's amazing. We go to Dallas, we go to Oklahoma, we go all over. We went to the other night Iowa, packed every place, New Hampshire packed, every place we go to, it's like this. It's amazing and just great, great people. And they actually had to tell over 3,000 people, go home, we'll come back, we'll do another one but they had to go home.","Would you like to leave and we'll let them come in? No?","I don't think so. But we -- they turned away a lot of people and which is too bad actually. So maybe next time, I don't know, I think this is the largest room. I know it's a record for the room.","You know it has to be a record because every inch of the room is taken with people in this standing and that setting. So that's great. I love. We love setting records. We want the country to set records right. So you know it has to be a record because every inch of the room is taken with people and they're standing.","They're not sitting, so taht's great. We love setting records. We want the country to set records, right?","So I do this and I love to do it and I talk about our success because that's ultimately what it's all about. I think we're going to do fantastically well in Iowa. I really think we're going to do great there. And I could say, oh gee, if we came into top four or five, I'm not. I'm looking to win everything.","We want to run the table. We want to run it because that sends a signal. And you know, we've been a little bit -- we had to respond to Hillary. She came out with that...","No. She came out -- remember, she wrote -- she said he's got a -- he's demonstrated a pension -- I demonstrated a pension for sexism. Can you believe it? Me. Nobody respects women more than Donald Trump. That I No doubt, no doubt. And you know when she said that, I had no choice because I didn't start it. I had no choice.","And I did have to mention her husband situation, OK? And that is now the biggest story on television by a factor of 10. So we have to do it. You can't let people push you around. You can't let people tell lies. You can't do it.","You know, it's interesting. One of the polls came out from CNBC and they said that if it's Trump against Hillary in the election, it will be the greatest voter turnout in the history of this country. I can see that. I can see that. I can see it. And they said all of these people that are going to come in new that never vote, they never vote, they don't care.","They're going to mostly -- I tell you what, they're going to vote for Trump. That's why they're coming in because they're so fed up with this system. This corrupt horrible system. They're fed up with it and they're fed up with those guys back there, the media. They are the worst. They are the worst. They're fed up.","They're fed up with the media. I mean I've got and you know, not all bad but there's so much dishonesty in the media. And I like to call it out. And one of the things that's really been amazing to me and such it's been so beautiful to watch, the level of genius in the public. They get it. You know they really get it. They want to marginalize us. They want to do all of this and they want to make everybody look like, oh gee.","The level of genius they fully understand. They know they're crooked. They know they're dishonest and they really -- otherwise, who gets worst publicity than me?","And yet I see a poll at 42%. And you know you're talking about 15, 16 people started with 17. How were you? Started with 17 people. And you know, I'd be happy with 42, if we had three, OK? Not thrilled. I'd like to be that over that 50 mark, but I think we're doing really well. And you know it's interesting -- but the debates.","OK, so the debates. Thank you. I love you too, darling. I love you. I do. I love you. I love everybody. You know what, the rooms, no matter where, whether it's stadiums or big ballrooms like this one, it's amazing. And there's love in the room and I told the other night, I said, a friend of mine, very, very successful guy, who I would love to have negotiating against China.","That's what we need, not these hacks that we have. No, no. I have guys.","Carl Icahn endorsed me. A great businessman. We have -- I have great great business people that want to be involved and we're going to use -- we have the best, we have the best and we don't use them. We use political hacks, we use special interests people that really don't care about the country. They care about their deals.","This is going to change so fast. You know, last year, $500 billion-trade deficit with China. Thank you. You know what $500 billion is? You do $100 bills, you'd fill the room to the ceiling. $500 billion deficit, trade deficit with China.","What are we? Are we -- yeah, I guess, the answer is certainly, let's not blame us. Our leaders are stupid and/or, you have to say and/or, they have deals. Because what's happened is all of this money is being given to them by special interests, by all of these people, including lobbyists and these lobbyists make our leaders do -- our leaders, can you believe our leaders?","This is worse. But they make the leaders of our country do things that they don't even want to do because they've given them tens and tens and tens of millions of dollars.","When I look at this guy, Jeb Bush, he spent $59 million on his campaign and he's down in the grave. He's nowhere. No, no, think of it. It's got to be much more than that. It was actually $59 million a while ago. Every time I turn on an ad, I see an ad about Trump. I mean, it's not that bad an ad either. It's like, you know, you're going to do an ad, do an ad. But look, he's a low-energy person.","Let's face it. We don't need low energy. We need lots of energy. But he spent, think of it, think of it, he spent $59 million. I spent nothing, right? Nothing.","Now I'm going to be spending. You probably saw, I'm going to spend now. We're going to start spending a lot of money because I don't want to take any chances. You know, I love getting up and for the last couple of months, I've been leading from practically the time I announce, right? And for the last -- I'm leading a lot.","I'm going to go over that because I go over polls. I love polls. I love polls. Now when they -- if they turn negative, I don't like them.","And I promise if they turn negative, I'm not going to be talking about it. In fact, I get criticized all the time. You're always talking about your polls. One of these guys has got two. He's a two. I'm at 42. And one of these guys who's at two said, he always talks about his polls. And I don't and I wouldn't do either if I had to, I swear I wouldn't. I wouldn't. I wouldn't do it at all.","But you know, I love to tell the story where I've spent nothing and Bush has spent $59 million, but much higher than that. That's just you know -- because I see since then I mean just you can't turn on this television without these commercials at Fox, every two minutes, it's a commercial on Trump. You know, what he did, it's false advertising.","So I killed him in the debate. According to Reuters, according to everybody, Drudge, who's an amazing guy, by the way, if you don't know Drudge, Matt Drudge.","Great. He's a great guy. But Drudge, 46%. 46%, you have 15 people. Now have you noticed, a couple have dropped out, a couple more. But 15, 16 people, 46%. Time magazine, 49%. Think of it. Slate, 51%. U.S. News and World Report, 69% said I won the debate. I won that debate, right? PBS, Public Broadcasting System, 69% said Trump won.","No, you know, it's amazing. We have Washington Times at 62%; CBS, 59%; Fox, 62%; Fox Las Vegas, 62%. So they all say. Then I go back home after the debate, I like to see how did I do. Did I look good? Looking good is very important, right? Sometimes it's not as much like what you say, it's how did you look.","I look good. It didn't sound too good but that's OK. You wonder is that a good trait.","But I go home I watch and the pundits will say, I mean, they can't totally kill me because I know what's happening. We know what's that. Well, Mr. Trump was OK tonight. He was -- I won every, every single online poll I won. And then here's Bush. So Bush does an ad and he takes me and he was talking about you know something, and he made a statement and and then I killed him.","I mean he -- by the way, I'm at 69%. He's at 1% he got. He came in last. He takes the ad -- and I shouldn't even talk about it. He's down to two or three, but I -- it bothers me when I see a guy spending $60 million on ads against me, a lot of it, right?","I say, why is he doing this. Does he have something better? He should go home. Just relax. No honestly, he should go home and relax. He shouldn't be wasting his time, but it does. I say, why is this guy spending all this money, now he's spending it actually against a couple of other guys. Theye were also very weak.","But here's my ad. So he made a statement and after that, his spin people said, oh, he was great. He took on Trump. He took on Trump. I'm standing here. He's over here, took on Trump, he made a statement that was written by his pollster. You know, sweet memory. He said, Mr. Trump, why don't you this, so OK, then I gave him an answer.","I said, Jeb, I'm at 42, you're at two, right? It's a simple answer.","You started off here right next to me, and then you were there, then you were there. By the next time, you're going to be off the stage, right? No, no. And then and that was it. So I responded. So he asked me a question. Question was fine. You know, professionally written. So he asked me a question. Good.","I give an answer. I blow him away, right? Everybody says, Trump won the debate. Everybody. And that's it. So the ad is him asking the question and I'm standing here like this because I haven't -- in fact, you see in one of my -- I'm just about ready to open my mouth, but he doesn't let me respond. That's almost false advertising, isn't it? You know.","So I mentioned that Hillary is a disaster.","I mean Hillary. Hillary's controlled by her money, so is Jeb, so is -- by the way, I'm the only one self funding my campaign. I'm self funding. You know, one of the things that makes me happy, I heard one of the commentators this morning said, you know, I'd been watching this stuff for 50 years. I've never seen anything like what's happened with Trump.","One of them actually said, one of them -- I'm special. You're special. I like you.","I'm special. Isn't that nice? That's a very -- every once in a while somebody can say something that hits you. Where are you? Who said that? Wow so nice. Thank you. That's a nice one, right? That's like, you know, every once in a while, there's a statement that's either nice or brutal. I think low energy was a brutal statement, right?","And by the way, low energy can be applied to Hillary. I just don't like to use the same thing twice on one of my enemies, right, because I consider them enemies. We view this as war. Don't we view this as war? It's war. It's war.","And so you don't like to use it. I hate to give it up. What? We're going to help your daughter. We're going to help the country. That's called helping the daughter. We're going to help your country. So here's the story. So we are in a situation where we have incompetent leadership, where our trade deals are killing us. Our military is not prepared.","General Odierno when he left, just recently, he said, we are less prepared now than at any time that he can remember. And I think he went back to the beginning. But let's say second world war, OK? That's enough. Now we should be very prepared now because the world hates us. She has done a terrible job as secretary of state.","I mean, just think of it, Putin comes out, he said, Donald Trump is brilliant. He's doing an amazing job and he's leading the pack.","OK, that's nice. And she and my opponents always feel terrible that Putin said, wouldn't it be nice if we could get along with the world? Wouldn't it be seriously? No, no, wouldn't it be nice? I mean they want me to refute his statement. How dare you say I'm brilliant. How dare -- that's a -- who's going to do that?","And by the way, if he said it about any one of them, they would have been very happy. But the point is, we have to get along. The world has blown up around Barack Obama. Now I don't know if you saw his recent release. They were talking about the Department of State, State Department and they said very strongly, you know, the things that they've done.","Well they couldn't find it because what have they done that's good. And they said, bringing peace to Syria. Did you see that? So instead of saying they made a mistake, call it a typo. They made a mistake. They're trying to justify. Well, we meant we're working on it. Can you believe bringing peace to Syria.","The world is blowing up the migration is Syria.","They say, one of their achievements for the year is bringing peace to Syria and the whole world is talking about it. It's the level of stupidity is incredible. I'm telling you. I used to use the word incompetent. Now I'll just call them stupid. I went to an Ivy League school. I'm very highly educated. I know words.","I had the best words. I have the -- but there's no better word than stupid, right? There is none. There is none. There's no word like that.","So we are going to turn things around but -- and if we have Hillary, I got to tell you, I just saw where for the last week she's been hitting me really hard with the women card, OK? Really hard. And I had to say, OK, that's enough, that's enough. And we did a strong number. She's not going to win. And by the way I love the concept.","I love love love having a woman president. It can't be her. She's horrible. She's horrible.","And you know who really don't -- I'll tell you who does not like -- yeah, we'll get Ivanka. Good. Let's do Ivanka. Let's go. But I'll tell you who does not like Hillary, our women. Women don't like Hillary. I see it all the time.","And always so theatrical. Mr. Trump said this and that and this. Oh and you just -- I actually -- I shouldn't do it. I just have to turn off the television so many times. She just gives me a headache. But you know, although I think last night, I gave her a big headache. I can imagine. I can imagine those discussions.","But you have to hit back hard and you can't let them push you around. And today, she gave a speech and she never even mentioned my name. You know, in the debate, I was mentioned nine times. I mean, everything to all of them but her. I was mentioned nine times, none of the other candidates were mentioned.","And then she came out with the sexism, which is so nonsense and -- but she's playing that card and then I had to hit her back, so I hit her back and I talked about her husband and the abuse of women and the tremendous abuse. No, it's tremendous abuse.","I mean you look at it, it's tremendous abuse. And I talked about that. And now today the television is going crazy and she gets up, makes a speech that does even mention anything about me with sexism or anything else. I wonder why? I wonder why? And remember this, it's really important.","A poll just came out where we're tied. Another one came out a couple of weeks ago, Fox where I'm leading by four or five points against her, individually. We're doing great. I haven't even focused on her yet. Look at the people I focused on, I don't want to really knock them. I don't want to mention their names, but you know, of those people that are all gone, they were all people that attacked me. Wouldn't it be nice if our country could have that same thing.","You attack and they are, boom, gone.And if we could do it verbally -- you know, if we could do it verbally, that's even better, right? You know, who wants to use our military?","By the way, we are going to build the strongest, the best, the most powerful military ever ever ever. And we're going to take care of our vets. We're going to take care of our vets because they are being treated horribly. But we're going to build the strongest most powerful military ever and let me just tell you.","Let me just tell you a little secret. It's the cheapest thing we can do. We never gonna have to use it. I don't think we're gonna have to use it. Don't forget, they talked about my tone. I remember when Jeb and Hillary the same day, Mr Trump's tone is not nice. They're chopping off Christian's heads in Syria and other places and they want me to have a nice tone.","I'm supposed to be always isn't life wonderful, OK? Look, we've got to be tough. We've got to be smart. We've got to have heart too. We've got to have heart. We've got to take care of people. We've got to fix our health care program. This Obamacare is a disaster. You people know, you people know, Obamacare is a total catastrophe.","It's gonna be repealed and replace. It will die in '17 anyway. I don't know if you heard what's happening but it's so bad. All the people that they didn't think were signing up are signing up and the other people that are really paying for it, aren't signing up. And your rates are going up 25, 35, 45%. Your deductibles are so high that unless you get hit by a tractor, you're never gonna be able to use your deductible.","You're never going to be able to use it. So Obamacare is a disaster. We're going to repeal it. We're going to replace it. There are so many great things we can do on health care. So many great things.","And it'll cost you much less money and it'll be great. It will be great. I mean you're signing in to programs on things that you'll never ever use. You know that and you're paying for it and you'll never ever use them. So we'll get that straight now. We're going to straighten out a lot of things. We have to straighten out common core.","Common core is dead. It's gonna be dead. It's going to be dead.","When I look at parents and I see local parents in Iowa and New Hampshire and South Carolina, I went to a school and I saw the parents, they love their children. They want that. They want educate -- they love. They don't care about money, they don't care about anything. They love their children. And it's local and they get together and they do wonderful programs as smart people as opposed to getting it done by bureaucrats and getting big fat checks in Washington.","I mean, we have such talent in this country and we don't use it. So Obamacare, dead; Common Core, gone. We're going to get rid of it. Department of Education, we're going to get rid of it. We're bringing education to a local level.","One thing on education. So in the world, we are ranked number 28. There are third-world countries that are ranked better than us in education and many other things. And yet, per pupil, we are number one by far. There's nobody close. Number two isn't even close. So we spend more money per pupil than any country in the world and we're ranked number 28, which is way down.","Way down the bottom, essentially. I mean it's it's -- can you imagine we're ranked number 28 and we're number one. And that's what I do like saying about my campaign, I spent less money than anybody else and I have the best result. I'm number one by a lot. And I spent no money. I mean my plane cost me some money.","But I spent no ads. Took a little radio ad in Iowa, but I didn't do that. I think the station is so lovely if you want to know the truth.","But I spent essentially no money. And then you have all these other guys spending vast and they're like the way the United States is run. Now why would we put a guy, like Jeb, like some of the others. It's not only Jeb Bush. They spend money. I see Rubio at the ads all day long. You know the black background.","He's got like a black thing. Should have put something like that behind him, right? Right there, the flag. No no. And I like him. I think he's a nice guy.","But I see these ads you know with the with the backdrop and perfect. And it's just somber, it's not good. I think it's good. So think of it. I spent no money and I'm number one. Other spent. They will have spent hundreds of millions of dollars and they're not even in the race. That's what we need for our country.","What?","OK. I got 15,000, I know what that limit but that's OK. So but I think he's a fan. I don't think he's a pro. Are you a protester? No? OK. No he likes Trump. OK. He's not a protester. I love you. You know the only time -- don't worry about it.","The only time the cameras focused on the crowd is when we have a protest. Because I always have like look at this ballroom packed. I always have the biggest crowds and I go home and my wife said, were there many people? I watched you on television tonight. I said when I had 20,000 people. The whole -- she said, they didn't show it. They have -- right on your face.","So I have 20,000 people. I have 20,000 in Oklahoma, 35,000 in Mobile, Alabama. Nobody knows because those cameras they run in your face. And I think they can't move. You know, I think there may be fixed because modern cameras maybe. Except every time there's a guy that stands up protesting, you know, they're on drugs or something because some of these guys they said, they don't even know what the hell they're doing there.","All of a sudden the cameras swerve and they perfect shots.","And I like it because then it shows how big the crowds are. So you know. Sometime I think I'm going to put in some false protesters. I'll put in some friendly protesters. It's it's the only way I'm going to be able to get them.","So when we started, I talked about trade, I talked about the border. I talked about a lot of things and I started on June 16th and in Trump Tower or the famous escalator, right? And it takes guts to run for president. You know it's like I never did this before. And then they tell you're on a debate, we had the largest debate with the largest audience in the history of cable television.","Then CNN a couple of weeks later, had 23 million; Fox had 24 million; CNN had 23 million. The largest audience in the history of CNN.","Now they're there and the cameras on live right now. I mean, you know, it's largest audience in the history. And now the debates used to be -- if you go back four years or eight years, you know whenever the cycles came up, nobody even wanted. They didn't want the debates. I think they were forced to take them for licensing.","Nobody wanted the debates, so it drew nothing.","But now they're drawing 24 million. Now they want have more debates. Can we have more? Can we have more? Can they go three hours? Remember, when they had the one go three hours, I said, no, I'm not doing three hours. It's too long. Who wants -- I could stand up if here for 50 hours. But who the hell wants to sit home watching three hours of this stuff, right?","Mr. Trump you have 30 seconds. What would you do about ISIS?","Oh great. And by the way, that question, I hate those questions, you know why? Because I want to be unpredictable. I don't want to tell ISIS what I'm going to do to knock the hell out of them. I hate it. I hate it.","Remember, I said very strongly, keep the oil for what, four years. You've been watching. I mean, four years, I've been get the oil, get the oil, get the oil because who is going to get the oil? Iran is taking over Iraq. We made a deal for Iran done by some of the dumbest people on earth on our side. We gave them everything they wanted.","We don't even get our prisoners back. And now Iran wants to start negotiating separately for them. Can you believe it. I go crazy. We would have gotten them back. All you have to do is say, we want our prisoners back. They would have said no.","I would have said, I want them back. You don't understand me. I want them back. They would have said, no, we won't do that. I would have said, bye bye and I would've left. Then I would have doubled up the sanctions. And I guarantee you, I guarantee you that within 24 hours they would have call back and they'll say, you've got your prisoners.","Can we talk? And I would have never given them $150 billion. I wouldn't never given them the money/ I would have never give. They used -- then I have to make nuclear. They can buy it. Why are they going to make it?","Then we have the nuclear where they have self inspection. How about the area, you know, they're big area. They don't want us there. Oh I wonder why they don't want us there. So they self inspect, OK? Then they have the 24-day inspection. But the self inspection is the beauty. We think you're making nuclear weapons here.","Well, let us go check Mr. President and we'll check. No sir, we're not making nuclear weapons. Nobody know. No we're not. We would never do a thing like that. These are people that have deceived us, they've lied to us. They're a terrorist state. But -- and I used to say it's the worst deal that I've ever seen negotiated and by the way, just to finish prisoners, so they come back, we get our prisoners.","But then when I hear the other day that now this deal is done. It's all done.","And now I hear they want to negotiate to get and what did they say. They said very strongly. They said, we are going to want a lot of, or the prisoners. That's our -- we're starting off. We're gonna want a lot. Now we've already taken off the sanctions. They're already rich as hell. What's going on there?","That's why I say, I mean, some people say, it's worse than stupidity.","There's something going on that we don't know about. I mean honestly. And you almost think -- I'm not saying that and I'm not a conspiracy person. She said, we are. We're saying it. I have the people in this room is saying and I'm trying to be like you know -- I'm just hoping they're just stupid people, OK, which they are.","Or there's something going on. Because it's inconceivable. You know, did you ever see where some things are so bad that it can't be -- that nobody can do what they did, right? Nobody.","So Iran now wants to negotiate separately for it. But that deal is done. Now we want to start all the deal and they want a lot. We want a lot and I just -- I want to just shoot the television, you know, because they would have had it, just for saying. And you know when they asked Kerry and Obama, the deal was made, everybody knows it's a horrible deal.","It's going to lead to -- it's going to lead to tremendous nuclear proliferation and they're so rich now. You know they became $150 billion, that's -- they became so rich and many other things that you don't even know about.","Most people don't even know what the agreement says. But I'll tell you what. When you look at what we're doing, we're not going to have -- if we keep going like this folks, we're not going to have a country left. We're not going to have a country. We're not going to have a country and we're like a dumping ground for the world.","We're a dumping ground. They want to take these -- the migrants you know and I feel terrible about the migration caused by Hillary Clinton and Barack Obama.","They're the ones that caused it. They go into Libya. They knocked the hell out of Gadhafi. OK. So Gadhafi, they back rebels who end up killing the ambassador and the other young people. You know that the ambassador was riding in a Jeep. One of our Jeeps, of course, a military jeep holding the Libyan flag and you know, freedom freedom freedom and then he gets killed by the same people.","So we backed people that turned out to be far worse than Gadhafi. Look what we did in Iraq. Look what we did in Iraq. I mean what the hell do we get? We spent $2 trillion and that was as a year and a half ago. I keep saying $2 trillion, it's a lot more than that. We spent $2 trillion. We have thousands of deaths and I'm not even talking other side.","You're talking about other side, you're talking about hundreds of thousands, maybe millions. You have thousands of deaths. We have wounded warriors who I love. All of -- these guys are the toughest. These are the greatest people. Now these are the greatest people.","And then what happens? We leave and we have a president that announces the date of when we're leaving. So I said, man, if I'm the enemy, I'm just going to go away for 18 months, right? He gave a date. We are leaving Iraq. We won't be gone by such and such a time. I said, I'm just sitting there watching and I'm saying, man, that's really stupid.","Because believe me, the enemy doesn't want to be killed. You know, you hear so much all they want to go with the virgins up to wherever they go, right? They don't. They want to live. They want to live and they want to take care of their families, always their families remember that because their families know what's going on. OK? You think their wives don't know what they're planning.","You think their kids don't know exactly what daddy is doing when daddy is gonna fly into the world trade center. You think they don't know? They know exactly what's going on. Remember that. And frankly, I think they have more love for their families live than they do for their own life, OK? But they still want to live.","So here's Obama gives an exact date, he gives an exact date. So they pull back and everyone says, oh, we're doing so well. Look, we're doing so well. The enemy. Why should they fight when they know in 18 months, they go on and take the place. So what happens? So we have ISIS taking a lot of oil. I said, take the oil.","Remember when we left, I was opposed to going in because I said you're going to destabilize the Middle East because you had Iraq and you had Iran. And I said, they'll fight. They are always fighting for decades and decades for generations. They fight. That's what they do. They fight. How we ever got involved in this mess is hard to believe.","They fight. And they were equal, militarily. They go this way, 10 feet. They go this way, 10 feet then they rest. A couple of years, then they start fighting again. Then Saddam Hussein throws a little gas. Everyone goes crazy always using gas. They go back forth. It's the same.","And they were stabilized. And I said, if you go after one or the other, in this case, Iraq, you're going to destabilize the Middle East, that's what's going to happen. You're going to destabilize the Middle East. And that's exactly what happened. We totally destabilized the Middle East. We have now migrations largely because of what's happened afterwards.","You know Iraq was horrible.","It was stupid to go in. We should have never gone in. But we shouldn't have gone out the way we went out and we shouldn't be given dates. I mean, I would probably say we're gonna stay forever and they would've said, Oh man, and then keep going, keep going. Eventually, they would get tired. They say, this guy is crazy.","I mean, he's never going to leave and you'll make a deal. But when you announce you're leaving in 18 months or whatever the hell he said, they just pulled back and then as soon as we left, they come in. OK? so they have the oil. You know the biggest beneficiary of the oil is, right? China.","China always China. I love China. I love Mexico. Their leaders are too smart for us. We have no border. We will build a wall. Mexico will pay for the wall, by the way. They're building a wall. We're gonna have a border. And people are going to come into our country, but they're going to come in through a legal process.","They're not coming in the way they're coming in now just walking in like nothing. They're going to come in but they're going to come through a legal process.","So with Iraq, wo we give them a date and they take over. We didn't take the oil. So for four years I've been talking about it, then because of Paris, all of a sudden, they start bombing the oil. But I didn't want to just bomb the oil, I want to take the oil. They're bombing. You know, we're bombing, right?","What's going to happen after that? So we're bombing and you know, we're not really bombing it because they're still selling it. I say, how could they keep this up. Obama doesn't want to hit him too hard because he's afraid he's going to pollute the atmosphere. No, this is serious.","Now think of it. He talks about the carbon footprint and yet he'll fly a very old Air Force One, an old Boeing 747 with the old engines and you know spewing stuff. So he's got a problem with the carbon footprint. You can't use hairspray because hairspray is going to affect the ozone. I'm trying to figure out.","Let's see, I'm in my room in New York City and I want to put a little spray so that I can, right?","But I hear, well, they don't want me to use hairspray. They want me to use the pump because the other one, which I really like better than going bing, bing, bing. And then it comes out in big globs, right? And it's stuck in your hair and you say, Oh my God, I gotta take a shower again. My hair is all screwed up, right?","I want to use hairspray. They say don't use hairspray. It's bad for the ozone. So I'm sitting at this concealed apartment. This concealed -- you know, I really do live in a very nice apartment, right? But it's sealed.","It's beautiful. I don't think anything gets out. And I'm not supposed to be using hairspray. But think of it, so Obama's always talking about the global warming, that global warming is our biggest and most dangerous problem, OK? No, no, think of it.","I mean even if you're a believer in global warming, ISIS is a big problem. Russia is a problem. China is a problem. We get a lot of problems. By the way, the maniac in North Korea is a problem. He actually has nuclear weapons, right? That's a problem. We get a lot of problems. We got a lot of problems. That's right.","We don't win anymore. He said, we want to win. We don't win anymore. We're gonna win a lot. If I get elected, we're gonna win a lot. We're gonna win so much. We're going to win a lot. We're going to win so much you're all going to get sick and tired of winning years. You'll say, oh no, not again. I'm only kidding.","You never get tired of winning, right? Never.","But think of it. So Obama is talking about all of this with the global warming and that and a lot of it's a hoax. It's a hoax. I mean it's a moneymaking industry. OK? It's a hoax. A lot of it. Look, I want clean air and want clean water. That's my global -- I want clean clean crystal water and I want clean air and we can do that, but we don't have to destroy our businesses.","We don't have to destroy it, OK? And by the way, China isn't abiding by anything. They're buying all of our coal. We can't use coal anymore, essentially. They're buying our coal and they're using it.","Now when you talk about the planet, it's so big out there. We're here, they're there. It's like they're our next door neighbor, right, in terms of the universe. Miss Universe, by the way, made a great deal when I sold. Oh did I get rich. That was a great deal huh. You know they broke my choppers on that.","They said, he talks about illegal immigration. We're not going to put him on television. First of all, that Univision is being sued like crazy. You wouldn't believe it. And NBC made a great deal with them, just like an amazing deal. Far more than I would have ever gotten. I mean, I made an unbelievable deal far more than I ever would have gotten if I said, I think I'm going to sell it if times were normal, right?","Isn't it amazing the way this is gonna work out. But I love Miss Universe and I love the universe. But think of it, so China is spewing up all this stuff and we're holding back. And with China, you know, we signed these agreements where we have to do it now, they have to do it within 30 or 35 years. I don't think they're going to be doing it. It's like Japan.","If somebody attacks Japan, we have to immediately go and start World War 3, OK? If we get attacked, Japan doesn't have to help us. Somehow that doesn't sound so fair. Does that sound good? So South Korea, I order televisions, I order thousands of televisions a year. I ordered televisions because I have a lot of stuff.","I like nice branded. They're all made in South Korea. Most other than Sony and Sony in all fairness has lost its way. But a lot of Samsung, all of them. I mean they're all pretty much -- all of them, right? I think just about. But I order thousands of televisions, they're all from South Korea.","So we have 28,000 people on the border, separating South Korea from this maniac in North Korea. We get nothing. What, we get nothing. Nothing. They're making a fortune. It's an economic behemoth. A lot of you don't know, we protect Germany. Germany. Mercedes Benz. How many people have a Mercedes Benz? We protect Germany.","It's an economic behemoth. We protect Saudi Arabia. They were during the good old days. Now it's probably half, which is fine. But during the good, they were making a billion. Listen to this, a billion dollars a day. And we protect them, our military. They pay us peanuts like nothing.","And then if we want to buy, if we want to move to another location, well, that's more expensive if we do that. We want to -- they charge us rent. I mean, look, we are run by people that are so bad. They're so out of their league. And I see it. I see it on the stage. You know there are a lot of them are nice people.","You know a lot of people think I don't like this, but I do like them. But they don't have business sense, they don't have business ability. They don't have common sense. They're all politicians. They're all talk and no action.","When I say, folks, when I say, we're going to build a wall, most of them say, you can't build a wall. We'll build a wall. In China, 2,000 years ago, they built the Great Wall of China, which is bigger than any wall we're thinking about, OK? The Great Wall of China goes 18,000 miles. We have 2,000 miles, of which we really only need 1,000 miles because you have a lot of natural barriers, right?","That extremely tough to get across. We have a thousand miles. So China has 18,000 or 13,000 miles and we have 1,000 miles. We have modern cranes. We have Caterpillar tractors. I want to use Caterpillar. I don't want to use Komatsu. Made in America.","Even my hats, they're made in America. Wasn't easy to find the guy could do those hats. You know what I'm talking about. I see so many knockoffs of my hat, right? Make America great again. I see these things are out of plastic. They're out of all sorts of crap. Mine are made in America. And honestly, they do a great job but they don't produce as many as I'd like because frankly, there's a big -- I mean, it's amazing.","Those hats are amazing. But I wanted to have it made. And you know why I wanted, I wanted it anyway. But I also knew that as soon as the hats came out and other things, we have a website. As soon as the hats came out, I knew the press would be calling. And it's true. First hour when the hats were announced, I get a call from the New York Times.","Mr. Trump, where are those hats made? I said America. I knew it.","I know it. Because, as you know, if I would have said China, I would have been in big big trouble. But they're being knocked off all over the world. I mean, I see hats they're like helmets. I see them all. But what are you going to do?","But here's the story. We've got to build a wall. So when I talk and when I'm up on the stage with these guys, these people, wonderful people and a very nice woman, Carly. She's a nice woman. When I'm up on the stage with them, they think I'm crazy when I say Mexico. So I say, we're gonna build a wall. It's gonna be a great wall.","It's gonna be a great wall. See the ceiling, the ceiling is peanuts compared to the height of the wall I'm talking about. I'm talking about if they ever get up there, they're not coming down because it's too dangerous.","All right. You ever see what they do now? We have these little walls, they build ramps. They build a ramp. I say, wouldn't it be cheaper just to knock the wall down and just -- and then they drive over it with Jeeps loaded up with drugs. Do you see this? They build ramps so it was a picture in Time Magazine.","It's a ramp, a little ramp that goes over the wall and down. So they have a Jeep over, down, boom make money. We get the drugs. Think of it, we build a wall. It's right, you've got to build the wall. We get the drugs, they get the cash. Not so good, right? We don't like that deal. Our politicians don't know.","They don't know.","So when I say, Mexico is going to pay for it. These guys are on the stage with me. They're not business people. They don't understand. Mexico makes a fortune off the United States. Number one, we give them a lot of money. But in addition to that, they're taking our businesses. They're making -- if you talk about a trade deficit, I'll tell what Mexico in a certain way is in a mini version to new China.","Mexico is making an absolute fortune. Peanuts compared to the cost of the wall. Let's say the cost of the wall is $10 billion. That's a good. I can do a great job for 10. I think we'll have a lot of money left over.","Somebody else would have. You know, they -- and by the way, 20 years ago, they wanted to build a wall. People that are opposed to it now, they wanted to stop and they want to build a wall. You know one of the reasons they didn't build the wall? Because of the Environmental Protection Agency. They couldn't get an environmental impact study approved.","Can you believe it? Because there was a toad or a turtle or a snake or something was in the way. Now think of it. In China, in the South China Sea, there were these low level landmasses that were covered by water but pretty close to the top. China sends in massive excavators and they're gonna blah. They're building military fortresses in the South China Sea.","And a friend of mine, who is one of the biggest and richest people in China, he's a great guy. They're great people. They're fine. They're just too smart. I mean, the leaders are too smart for our people. They won't be too smart when I put my people there. When they call up, we'd like to speak to the donor that is negotiating.","No no. The donor now is Carl Icahn. You're going to speak to Carl Icahn. You know Carl great businessman. You have so many people. They call all these business people call. So a friend of mine so I call him and I say, you're actually doing that. And then jokingly, I said, how long did it take to get started?","Did you have to get an environmental impact study approved in order to excavate? He looked at me cause I hope you're kidding when you say that. They conceived of the idea. They started digging 4 hours later, OK? There's no, you know, go through 25 years of environmental impact, you're going to hurt the snail, you're going to hurt this, you're going to -- they're doing a big thing.","They excavated massive mass of -- take a look, massive, the biggest excavator. They're ripping the hell out of that ocean. They're ripping it and they're taking that dirt and they're putting it and they're building airfields and they're building forts.","We couldn't do it because just like I said for the wall, legitimately, they couldn't get an environmental impact. Now that's probably not the only reason it didn't happen. I heard their costs were too high. With me, that's easy. You know I'm doing the old post office at wash. I'm under budget. I'm ahead of schedule.","Hey, look at look at the campaign, guys have $59 million and he's down at the bottom. I'm nothing and I'm at the top. It's the same thing. I actually said -- it's funny. The other day, I got this great review. They said, Trump is a great speaker. The crowd is spellbound but he has one problem and I'm reading.","I want to see the problem is he speaks through the applause. In other words, like I say that, you applaud, I start talking before you finish your applause and you know why?","Because I'm so excited because we have so much potential. It's true. I don't want to wait for you're freaking applause. We have -- I have so many -- We have we have so much potential. There's so many things to do. I don't really sort of want to wait. I want to do it and I just noticed. I did it again. You were getting ready to give a big applause because you like that and I'm speaking.","I kill the applause but he's right. He's right. But except I'm not a speaker. What I am is a doer. I get things done. I get things done.","So when the people up on the stage with me and Hillary, Hillary doesn't have a clue. By the way, you talk about low energy. She has lower energy than Jeb Bush, which is hard to believe. She does. And I'll tell you and I've been saying it and maybe it's rude maybe it's not, but it doesn't matter. We have a much bigger problem.","We have to save our country. So if I'm rude and if people think I'm weird, I'm actually a nice person. I have a big heart. I want to help people. I want to help the migration. I want to do a safe zone in Syria. I don't want him coming here. We don't know who these people are. They're undocumented. They're undocumented and we should do a safe zone over there.","We should have the Gulf states, Saudi Arabia and these states that are not spending. They got to spend. They've got to pay. You know we're protecting them. We're doing -- they wouldn't be there for two minutes if we're not protecting them. They got to start paying. They're not taking anybody, OK?","How about Germany taking millions a year. Can you believe what she's doing to that country. And she was the person of the year and I wasn't. Everybody said Trump was supposed. Hey, what are you going to do. I think she's made -- I think I think she's made -- I think she's made a terrible mistake. We'll find out.","Time will tell. They having tremendous crime problems. I think she's made a terrible mistake. But what I like is in Syria, with other people's money, meaning the Gulf States and others and Germany and others because look Germany is paying a fortune to accept all these people. They'll give us. We do a massive safe zone and then eventually when this whole catastrophe straightens out, which I'll probably be able to get it straightened out.","I understand that stuff.","But once it's straightened out, they could go back home to their country, you know, to their area. It's interesting. I have thousands of people that work for me, thousands and I have people that come from far. They're all here legally, don't worry about it, I use E-Verify a lot. But I have people, I have people -- they go and check.","These guys go check. They went into the old post office checking everybody walked that door. Are you here legally? Are you here legally? They said they found one person out of hundreds and hundreds. I don't believe it. OK? I don't believe it. But you know, it's possible somebody said, hey, we do have 11 million people in the country and it's probably a much higher number than that.","OK? It's probably a much higher number, but we have to do something about it and we're going to do.","So I just want to finish by saying this, look, we have a situation that's out of control. Our country is a dumping ground for the rest of the world. We're laughed at by the rest of the world. And when I started this journey and it's a journey and I do love you people. You're amazing people. And by the way, you're so smart.","You know a lot of times they'll say, well Mr. Trump's people are blue collar. I love blue collar. I'm honored by that. But they're not blue collar. I mean, we have blue collar and we have executives and we have young people. They should -- the audience is older -- it's not older. The audience is young. The other night in Iowa, I told that and I said we have so many young people and the place erupted.","They're all young people. We have an amazing thing happen. It's just...","Look. That's their way of marginalizing not even me it's marginalizing you. It's disgusting. I mean, it's disgusting. But when I started this journey and that's what it is it's a journey and it's a movement that's taking place. It's a movement. Remember the old days, silent majority. It's not right. It's a noisy majority.","People are angry. It's a noisy majority. These aren't silent people anymore. I go to people you can't even hear.","This is an amazing thing that's happened. I received a call from one of the biggest reporters, who happens to be liberal but that's OK. We can have a couple of them, right? But a guy who is really respected recently and he said, how does it feel? I said, how does what feel? He said, what you have done has never been done in the history of politics in the United States.","I mean even CNN said, number one political story of the year is Trump. You know who at number two was? ISIS. ISIS was two. I'd rather reverse it. Let ISIS be one, let me be two because I want to knock the hell out of them and make me number one next year.","Make me number one next year. But this reporter who is a great intellect actually and very smart guy, very good guy, he said, he said, what you've done has never been done before in the history of this country. Newt Gingrich was on a television show the other day said, this is one of the great phenomenons I've ever seen in politics.","Nobody's ever seen it cause crowds like this forget it. I mean, it's only confined in this venue. Again, they sent 3,000 people home.","Can you believe it? Three -- more than 3,000. It's it's unbelievable what's happening. It's beautiful what's happening. It's beautiful what's happening. But Newt Gingrich said, he's never seen anything like this. But he said to me, the reporter, he said never been done before. I said, well, you know, it's fine.","But if I don't win, it's just a waste of time. He goes, no no no. What you've done is incredible. He said even if you don't win, what you've done is incredible. You've totally changed the landscape of politics. No, but... Don't applaud. Don't applaud.","Don't applaud. He said, you've totally changed the landscape of politics. It's forever going to be different. Your campaign has never been anything like it, OK? He was overly nice. I said you don't understand. You don't understand. If I don't win, I will consider this and I mean this, a total and complete waste of time.","I really do. So because we're not going to do anything. It's wonderful. Good. I had nice crowds. They'll write about me every once in a while, every two years I'll have a story, Trump had this rather good campaign. If we don't win, to me, and honestly, you should feel the same thing. If we don't win, it's a total waste of time because you have somebody else in there.","They won't be able to do what I do. They're not going to be able to. And even if you get one of these Republicans in, like I didn't finish Mexico. The wall. When I say Mexico is going to pay, they all laugh. They all go, ha ha ha. They think it's funny.","Honestly, these are people they think it's funny. They're laughing. You know lightly like, oh oh oh, that's so funny, ha ha ha. They get to pay for the wall, folks. They're making billions and billions and billions of dollars on deficits that we have with Mexico. The wall is peanuts. They get to pay for the wall.","But I have mentioned it, now they don't laugh because they suddenly agree with me. And then the other day one of the people said, it was Ted Cruz, who's a nice guy, but he said, we're gonna build a wall at the southern border. I said. wow. And my wife was sitting. Where did that come from, right? No. Ted's a good guy but he said on -- I think it was on Fox News being interviewed and he said, we're going to build a wall at the southern border.","He didn't say Mexico is gonna pay. He hasn't gotten that far yet but believe me, that's going to happen. See they're all trying to catch up with me because when I did this stuff, it was very out there. Now, I'm the one that everybody wants to sort of aspire to. But what happens is so Ted's up and he's talking, and you know routinely we're gonna have the border, we're gonna have this, that and we're gonna build a wall.","My wife is sitting and she's, darling, did you hear that? He just said they going to build a wall. That's the first time ever, you know, that's what you say. She hasn't heard that from any other candidate. OK, so we're going to build a wall. Mexico is gonna pay for it. There's so many things we're gonna do. But when I when I started the journey, it was amazing.","I came down took courage. I went down into the lobby of Trump Tower on the escalator with Melania. I have never seen -- it look like the Academy Awards, the press. We have a lot of press here today, all alive. Look at all those live cameras.","So when I came down, when I came down in the escalator, we came down and I said, we're going to do things. And I mentioned illegal immigration. You wouldn't even be talking about illegal. It wasn't even on the radio. Nobody was talking about illegal immigration. Is that right?","Now, it's one of the big subjects and that's why. And one of the beautiful polls that came out and I'm so proud of it. CNN just came out with a poll couple of I guess a week ago, 36% for Trump, second is 16%, third is 14% and then 12%. It's all the way down. But on the economy, they give me 55, 55%. That's with 16 people at the time.","On the budget. I mean, I understand the budget, the economy, I win it hands down. All right. But listen to this on illegal immigration, I'm almost at 50%. And on ISIS, likewise almost at 50%. So people want to be protected.","They want to feel safe. They need strength. They need toughness. They need smarts. I don't want to be tough. You know, I know a lot of tough guys but they're not smart. And they're the they're the easiest. You can be tough, but you've got to be smart. Let's start smart first. You got to be smart tough.","You got to be tough because the world is trying to take advantage of us. So what happens is this, I came out, I started, I did it, I was, Oh, that first couple of weeks with illegal immigration in Mexico and all of this stuff. Then Kate was killed in San Francisco and Jamiel was killed in Los Angeles. Jamiel show an unbelievable young man was killed just shot right through the head by an illegal immigrant.","Kate was shot by a guy came in five or six times shot in the back. So many great people that -- these are two so many. And then you have the economy and the jobs that are being lost and people aren't paying taxes and all of this stuff, right? And all of a sudden people are coming over and I'd say, the wall and now they're starting to say the wall.","We have to be progressive in our thinking. When I say progressive I mean like smart. I'm not talking progressive like a Bernie Sanders would say this guy wants to tax you think of it. Think of it. This guy wants to raise your taxes to 90%.","No no. Think you'll have to move out of this. I love this area, by the way, I've been here many times, great golfing area, right? We love it. No more golf and Bernie said no more golf. No no.","You won't have any golf anymore. They won't be -- you won't have any money left to be golf. You'll be paying it in taxes. This guy is a total disaster. And I'm not saying that. I tell you what. You know, Hillary said, well, I'd like to run against Trump.","Believe me, this poor Chuck Todd meet the press. His show is dying. And he keeps saying, do it, do it, but I never liked it. You know, I just -- he never treated me fairly. So I do a show, it gets the highest ratings he's had in years. He went from like a -- believe me, I won't even give you the numbers.","They were massive, the numbers, right? I saved his life. And then he goes, Hillary Clinton said that she would most like to run against Donald Trump. And yes and they're looking forward to it. Trust me. The last person -- She's already gotten a dose last night. Do you agree? She had a tough night. She had a tough night.","She had a tough night looking at the beauty pageant, OK? So Hillary Clinton said, and here's Chuck Todd and he's a nice guy, I'm not trying to knock him.","Please don't be insulted, Chuck. But she says she doesn't like him. But he doesn't treat me right. So he goes, the Clinton campaign said that they'd most like to run against Trump, like I'm some kind of a sap. So I come, I say, Chuck, let me explain something, when they say they want to run against me, that means they don't want to run against me. Do you understand that?","Do you understand it's reverse psychology? They say they want to run against me. First of all, I'm winning and tied in the polls now and I haven't even hit her yet. But look at what happened to all the guys I hit, they're gone so. They're gone or they're failing badly. OK? And they'll be gone soon.","But Hillary Clinton, think of it. So I say, so Chuck, report it like properly. Trust me. They don't want to run against Trump. The last thing she wants in her whole life is -- this was only -- I did this in like 15 minutes what happened to them. Because the husband wants to come and she wants to accuse me of things.","And the husband is one of the great abuses of the world. Give me a break. Give me a break. Give me a break.","So the last person she wants to run against is me. Now, here's the story. Look, here's the story. It's very simple. So I announced and I was talking about trade. I was talking about the wall. I was talking about the borders. I was talking about Obamacare. I was talking about Second Amendment will be saved, by the way.","Second Amendment. It will be saved. The Second Amendment is going to be with us.","If I'm president, you know, they're doing everything. They want to get rid of the bullets now. They're doing everything they can. Think of Paris, think of Los Angeles, think if you had some guns in Paris on the good side right? They had no guns. Paris is the toughest gun laws in the world, folks. And France, I mean, you get caught with a gun, it's -- The only one that has guns are the bad guys.","So they go in these various places, they call the guy the mastermind. He's a moron. I mean, this guy was a moron. I called him the guy with a dirty hat, right? They got him. So good. By the way, the French police did a great job and our Los Angeles police did a phenomenal job. They did a great job.","But wouldn't it be wonderful if let's see, this guy, right here in front of me, he's a tough guy. This guy with the hat with a lousy head of hair but he's a strong looking guy right here. This guy right there, see. And that -- wouldn't it be nice if they had a gun on their waist. Somebody? Him him him.","So that when they shot -- you know they were doing in Paris. Get over here, bum. Get over here, bum. Your turn. Get over here. Bum. 130 people with more to follow cause there are people that are so badly injured right now in hospitals. Other people are going to die. Same thing over there. These are people that gave a party in honor of their marriage.","There's something going on folks it's wrong. They gave them a party. They work there. They gave them a party.","She came in and a fiance permanent or some nonsense. And she was radicalized and he was probably radicalized by her or he was already radicalized and people knew that they were radicalized. And people in the area knew that they had bombs all over. Who the hell doesn't know, your the next door neighbor and they didn't want to talk about it. You've got to report these people.","We've got a real problem. You've got to report them. No more nonsense.","They didn't report them. And the reason they didn't is because they don't disagree with them so much. OK. Believe me. It's not because they're afraid. You saw the one it wasn't politically correct to report him. They didn't want to report him. I mean, give me a break. So we have to change. So it started off with me where I was going to talk about trade.","I was going to talk about all the things. I was going to talk about the military, building it up. I was going to do all of this. But after Paris and California and there'll be others because they have no fear of us. But after Paris and California have totally changed and my poll numbers were up 10 points.","It's amazing. It went up 10 points, I said, why? Do you think it was the debate? Because I did good in the debate. They should know people view you as a tough cookie that's not going to take this crap. That's what it is.","And now I talk about protection. I talk about -- trust me. The trade. Oh, that's so easy for me. I got the greatest guys in the world. They're going to come and they're gonna do a great job. I'm going to do some myself. I always talk about forward.","They're gonna build a plant, $2.5 billion in Mexico, not going to happen with me. That stuff. Those deals are no good. Ford's leaving. They're closing plants all over Michigan to build a plant and in Mexico. How the hell does that help us? OK. Who are the people that think this is a good thing for us. And in the meantime, in Michigan and other places where plants closing all over the place and they're spending think about it, $2.5 billion.","And then they get to sell cars, trucks and parts into the United States, no tax, no nothing. I'll say, you don't have to pay tax folks. And you know what, Ford will say, if I've got to pay tax were gonna to stay in the United States. I mean, it's very simple. It's very simple.","How about two weeks ago, Nabisco announced, the big Chicago. They announced are going to leave Chicago with one of their big plants and they're going to move it to Mexico. What's my statement? We're not eating Oreos anymore, right? No more. But I don't want this. It's not going to happen. They're gonna make product and they're going to sell it into the United States, not going to happen.","It's not going to happen. And by the way, I'm a free trader.","I believe, but you've got to be smart. I mean, we've got to get something. We don't get anything out of anything. We don't get anything. We lose on everything. That Iran deal was a disaster. By the way, I think of the Iran deal for one second. I always -- and this came to me two weeks ago, I don't know why I didn't think of it sooner.","Very disappointed with myself. The Iran deal is the worst deal I've ever seen negotiated.","OK. I'm wrong. You know what the worst deal is? Iran is a part of that one too. We gave them Iraq. That's even better. Think of it. We gave Iran, Iraq. Iran has the biggest, think of it. They're going to have the richest -- If you go to Iraq, take a look, among the largest oil reserves in the world. We gave them by decapitating Iraq and then leaving because frankly, once we did it, we should have kept 20,000 troops to stay.","We give Iraq. So not only did they make a great deal in terms of the Iran deal that we know, having to do with nuclear. We also gave them Iraq. We gave them Iraq that they've been after for 100 hundred years. We hande it to them. So now they have the largest oil reserves among in the world. That's even better than the original deal.","I mean, whoever is representing Iran is doing a hell of a job. OK? That was a stock, you got to buy some.","So we are not going to have deals like that with me. It's not going to happen. We're going to become rich again, we're going to become safe again and we're going to become strong again. And you're going to remember this moment, this is going to be an important moment for all of us. The one thing I have to say and I have to ask you to do, go out and vote.","It's going to be your turn.","Number three. Remember, it starts on February 1st with Iowa. We go to New Hampshire then we go to so three weeks.","We got four weeks to go and then we have three weeks after we start. No matter what's going on in your life, you got to go and vote. Because if you don't, it's not going to happen. Don't sit back and say, oh, Trump's going to do well. The more we can win by, you know, the more power we have in a sense because it's like a mandate.","But you got to go out and vote. And I will tell you this, it's been an honor to be here. I love this area. I love the people here. It's been an honor.","But we will make America great again. I promise. Thank you. Thank you. Thank you everybody. Thank you."],"text":" So incredible. We have had, no matter where we go. You know, it's a movement folks. This is a movement. This is a movement. No matter where we go -- it's amazing. We go to Dallas, we go to Oklahoma, we go all over. We went to the other night Iowa, packed every place, New Hampshire packed, every place we go to, it's like this. It's amazing and just great, great people. And they actually had to tell over 3,000 people, go home, we'll come back, we'll do another one but they had to go home. Would you like to leave and we'll let them come in? No? I don't think so. But we -- they turned away a lot of people and which is too bad actually. So maybe next time, I don't know, I think this is the largest room. I know it's a record for the room. You know it has to be a record because every inch of the room is taken with people in this standing and that setting. So that's great. I love. We love setting records. We want the country to set records right. So you know it has to be a record because every inch of the room is taken with people and they're standing. They're not sitting, so taht's great. We love setting records. We want the country to set records, right? So I do this and I love to do it and I talk about our success because that's ultimately what it's all about. I think we're going to do fantastically well in Iowa. I really think we're going to do great there. And I could say, oh gee, if we came into top four or five, I'm not. I'm looking to win everything. We want to run the table. We want to run it because that sends a signal. And you know, we've been a little bit -- we had to respond to Hillary. She came out with that... No. She came out -- remember, she wrote -- she said he's got a -- he's demonstrated a pension -- I demonstrated a pension for sexism. Can you believe it? Me. Nobody respects women more than Donald Trump. That I No doubt, no doubt. And you know when she said that, I had no choice because I didn't start it. I had no choice. And I did have to mention her husband situation, OK? And that is now the biggest story on television by a factor of 10. So we have to do it. You can't let people push you around. You can't let people tell lies. You can't do it. You know, it's interesting. One of the polls came out from CNBC and they said that if it's Trump against Hillary in the election, it will be the greatest voter turnout in the history of this country. I can see that. I can see that. I can see it. And they said all of these people that are going to come in new that never vote, they never vote, they don't care. They're going to mostly -- I tell you what, they're going to vote for Trump. That's why they're coming in because they're so fed up with this system. This corrupt horrible system. They're fed up with it and they're fed up with those guys back there, the media. They are the worst. They are the worst. They're fed up. They're fed up with the media. I mean I've got and you know, not all bad but there's so much dishonesty in the media. And I like to call it out. And one of the things that's really been amazing to me and such it's been so beautiful to watch, the level of genius in the public. They get it. You know they really get it. They want to marginalize us. They want to do all of this and they want to make everybody look like, oh gee. The level of genius they fully understand. They know they're crooked. They know they're dishonest and they really -- otherwise, who gets worst publicity than me? And yet I see a poll at 42%. And you know you're talking about 15, 16 people started with 17. How were you? Started with 17 people. And you know, I'd be happy with 42, if we had three, OK? Not thrilled. I'd like to be that over that 50 mark, but I think we're doing really well. And you know it's interesting -- but the debates. OK, so the debates. Thank you. I love you too, darling. I love you. I do. I love you. I love everybody. You know what, the rooms, no matter where, whether it's stadiums or big ballrooms like this one, it's amazing. And there's love in the room and I told the other night, I said, a friend of mine, very, very successful guy, who I would love to have negotiating against China. That's what we need, not these hacks that we have. No, no. I have guys. Carl Icahn endorsed me. A great businessman. We have -- I have great great business people that want to be involved and we're going to use -- we have the best, we have the best and we don't use them. We use political hacks, we use special interests people that really don't care about the country. They care about their deals. This is going to change so fast. You know, last year, $500 billion-trade deficit with China. Thank you. You know what $500 billion is? You do $100 bills, you'd fill the room to the ceiling. $500 billion deficit, trade deficit with China. What are we? Are we -- yeah, I guess, the answer is certainly, let's not blame us. Our leaders are stupid and/or, you have to say and/or, they have deals. Because what's happened is all of this money is being given to them by special interests, by all of these people, including lobbyists and these lobbyists make our leaders do -- our leaders, can you believe our leaders? This is worse. But they make the leaders of our country do things that they don't even want to do because they've given them tens and tens and tens of millions of dollars. When I look at this guy, Jeb Bush, he spent $59 million on his campaign and he's down in the grave. He's nowhere. No, no, think of it. It's got to be much more than that. It was actually $59 million a while ago. Every time I turn on an ad, I see an ad about Trump. I mean, it's not that bad an ad either. It's like, you know, you're going to do an ad, do an ad. But look, he's a low-energy person. Let's face it. We don't need low energy. We need lots of energy. But he spent, think of it, think of it, he spent $59 million. I spent nothing, right? Nothing. Now I'm going to be spending. You probably saw, I'm going to spend now. We're going to start spending a lot of money because I don't want to take any chances. You know, I love getting up and for the last couple of months, I've been leading from practically the time I announce, right? And for the last -- I'm leading a lot. I'm going to go over that because I go over polls. I love polls. I love polls. Now when they -- if they turn negative, I don't like them. And I promise if they turn negative, I'm not going to be talking about it. In fact, I get criticized all the time. You're always talking about your polls. One of these guys has got two. He's a two. I'm at 42. And one of these guys who's at two said, he always talks about his polls. And I don't and I wouldn't do either if I had to, I swear I wouldn't. I wouldn't. I wouldn't do it at all. But you know, I love to tell the story where I've spent nothing and Bush has spent $59 million, but much higher than that. That's just you know -- because I see since then I mean just you can't turn on this television without these commercials at Fox, every two minutes, it's a commercial on Trump. You know, what he did, it's false advertising. So I killed him in the debate. According to Reuters, according to everybody, Drudge, who's an amazing guy, by the way, if you don't know Drudge, Matt Drudge. Great. He's a great guy. But Drudge, 46%. 46%, you have 15 people. Now have you noticed, a couple have dropped out, a couple more. But 15, 16 people, 46%. Time magazine, 49%. Think of it. Slate, 51%. U.S. News and World Report, 69% said I won the debate. I won that debate, right? PBS, Public Broadcasting System, 69% said Trump won. No, you know, it's amazing. We have Washington Times at 62%; CBS, 59%; Fox, 62%; Fox Las Vegas, 62%. So they all say. Then I go back home after the debate, I like to see how did I do. Did I look good? Looking good is very important, right? Sometimes it's not as much like what you say, it's how did you look. I look good. It didn't sound too good but that's OK. You wonder is that a good trait. But I go home I watch and the pundits will say, I mean, they can't totally kill me because I know what's happening. We know what's that. Well, Mr. Trump was OK tonight. He was -- I won every, every single online poll I won. And then here's Bush. So Bush does an ad and he takes me and he was talking about you know something, and he made a statement and and then I killed him. I mean he -- by the way, I'm at 69%. He's at 1% he got. He came in last. He takes the ad -- and I shouldn't even talk about it. He's down to two or three, but I -- it bothers me when I see a guy spending $60 million on ads against me, a lot of it, right? I say, why is he doing this. Does he have something better? He should go home. Just relax. No honestly, he should go home and relax. He shouldn't be wasting his time, but it does. I say, why is this guy spending all this money, now he's spending it actually against a couple of other guys. Theye were also very weak. But here's my ad. So he made a statement and after that, his spin people said, oh, he was great. He took on Trump. He took on Trump. I'm standing here. He's over here, took on Trump, he made a statement that was written by his pollster. You know, sweet memory. He said, Mr. Trump, why don't you this, so OK, then I gave him an answer. I said, Jeb, I'm at 42, you're at two, right? It's a simple answer. You started off here right next to me, and then you were there, then you were there. By the next time, you're going to be off the stage, right? No, no. And then and that was it. So I responded. So he asked me a question. Question was fine. You know, professionally written. So he asked me a question. Good. I give an answer. I blow him away, right? Everybody says, Trump won the debate. Everybody. And that's it. So the ad is him asking the question and I'm standing here like this because I haven't -- in fact, you see in one of my -- I'm just about ready to open my mouth, but he doesn't let me respond. That's almost false advertising, isn't it? You know. So I mentioned that Hillary is a disaster. I mean Hillary. Hillary's controlled by her money, so is Jeb, so is -- by the way, I'm the only one self funding my campaign. I'm self funding. You know, one of the things that makes me happy, I heard one of the commentators this morning said, you know, I'd been watching this stuff for 50 years. I've never seen anything like what's happened with Trump. One of them actually said, one of them -- I'm special. You're special. I like you. I'm special. Isn't that nice? That's a very -- every once in a while somebody can say something that hits you. Where are you? Who said that? Wow so nice. Thank you. That's a nice one, right? That's like, you know, every once in a while, there's a statement that's either nice or brutal. I think low energy was a brutal statement, right? And by the way, low energy can be applied to Hillary. I just don't like to use the same thing twice on one of my enemies, right, because I consider them enemies. We view this as war. Don't we view this as war? It's war. It's war. And so you don't like to use it. I hate to give it up. What? We're going to help your daughter. We're going to help the country. That's called helping the daughter. We're going to help your country. So here's the story. So we are in a situation where we have incompetent leadership, where our trade deals are killing us. Our military is not prepared. General Odierno when he left, just recently, he said, we are less prepared now than at any time that he can remember. And I think he went back to the beginning. But let's say second world war, OK? That's enough. Now we should be very prepared now because the world hates us. She has done a terrible job as secretary of state. I mean, just think of it, Putin comes out, he said, Donald Trump is brilliant. He's doing an amazing job and he's leading the pack. OK, that's nice. And she and my opponents always feel terrible that Putin said, wouldn't it be nice if we could get along with the world? Wouldn't it be seriously? No, no, wouldn't it be nice? I mean they want me to refute his statement. How dare you say I'm brilliant. How dare -- that's a -- who's going to do that? And by the way, if he said it about any one of them, they would have been very happy. But the point is, we have to get along. The world has blown up around Barack Obama. Now I don't know if you saw his recent release. They were talking about the Department of State, State Department and they said very strongly, you know, the things that they've done. Well they couldn't find it because what have they done that's good. And they said, bringing peace to Syria. Did you see that? So instead of saying they made a mistake, call it a typo. They made a mistake. They're trying to justify. Well, we meant we're working on it. Can you believe bringing peace to Syria. The world is blowing up the migration is Syria. They say, one of their achievements for the year is bringing peace to Syria and the whole world is talking about it. It's the level of stupidity is incredible. I'm telling you. I used to use the word incompetent. Now I'll just call them stupid. I went to an Ivy League school. I'm very highly educated. I know words. I had the best words. I have the -- but there's no better word than stupid, right? There is none. There is none. There's no word like that. So we are going to turn things around but -- and if we have Hillary, I got to tell you, I just saw where for the last week she's been hitting me really hard with the women card, OK? Really hard. And I had to say, OK, that's enough, that's enough. And we did a strong number. She's not going to win. And by the way I love the concept. I love love love having a woman president. It can't be her. She's horrible. She's horrible. And you know who really don't -- I'll tell you who does not like -- yeah, we'll get Ivanka. Good. Let's do Ivanka. Let's go. But I'll tell you who does not like Hillary, our women. Women don't like Hillary. I see it all the time. And always so theatrical. Mr. Trump said this and that and this. Oh and you just -- I actually -- I shouldn't do it. I just have to turn off the television so many times. She just gives me a headache. But you know, although I think last night, I gave her a big headache. I can imagine. I can imagine those discussions. But you have to hit back hard and you can't let them push you around. And today, she gave a speech and she never even mentioned my name. You know, in the debate, I was mentioned nine times. I mean, everything to all of them but her. I was mentioned nine times, none of the other candidates were mentioned. And then she came out with the sexism, which is so nonsense and -- but she's playing that card and then I had to hit her back, so I hit her back and I talked about her husband and the abuse of women and the tremendous abuse. No, it's tremendous abuse. I mean you look at it, it's tremendous abuse. And I talked about that. And now today the television is going crazy and she gets up, makes a speech that does even mention anything about me with sexism or anything else. I wonder why? I wonder why? And remember this, it's really important. A poll just came out where we're tied. Another one came out a couple of weeks ago, Fox where I'm leading by four or five points against her, individually. We're doing great. I haven't even focused on her yet. Look at the people I focused on, I don't want to really knock them. I don't want to mention their names, but you know, of those people that are all gone, they were all people that attacked me. Wouldn't it be nice if our country could have that same thing. You attack and they are, boom, gone.And if we could do it verbally -- you know, if we could do it verbally, that's even better, right? You know, who wants to use our military? By the way, we are going to build the strongest, the best, the most powerful military ever ever ever. And we're going to take care of our vets. We're going to take care of our vets because they are being treated horribly. But we're going to build the strongest most powerful military ever and let me just tell you. Let me just tell you a little secret. It's the cheapest thing we can do. We never gonna have to use it. I don't think we're gonna have to use it. Don't forget, they talked about my tone. I remember when Jeb and Hillary the same day, Mr Trump's tone is not nice. They're chopping off Christian's heads in Syria and other places and they want me to have a nice tone. I'm supposed to be always isn't life wonderful, OK? Look, we've got to be tough. We've got to be smart. We've got to have heart too. We've got to have heart. We've got to take care of people. We've got to fix our health care program. This Obamacare is a disaster. You people know, you people know, Obamacare is a total catastrophe. It's gonna be repealed and replace. It will die in '17 anyway. I don't know if you heard what's happening but it's so bad. All the people that they didn't think were signing up are signing up and the other people that are really paying for it, aren't signing up. And your rates are going up 25, 35, 45%. Your deductibles are so high that unless you get hit by a tractor, you're never gonna be able to use your deductible. You're never going to be able to use it. So Obamacare is a disaster. We're going to repeal it. We're going to replace it. There are so many great things we can do on health care. So many great things. And it'll cost you much less money and it'll be great. It will be great. I mean you're signing in to programs on things that you'll never ever use. You know that and you're paying for it and you'll never ever use them. So we'll get that straight now. We're going to straighten out a lot of things. We have to straighten out common core. Common core is dead. It's gonna be dead. It's going to be dead. When I look at parents and I see local parents in Iowa and New Hampshire and South Carolina, I went to a school and I saw the parents, they love their children. They want that. They want educate -- they love. They don't care about money, they don't care about anything. They love their children. And it's local and they get together and they do wonderful programs as smart people as opposed to getting it done by bureaucrats and getting big fat checks in Washington. I mean, we have such talent in this country and we don't use it. So Obamacare, dead; Common Core, gone. We're going to get rid of it. Department of Education, we're going to get rid of it. We're bringing education to a local level. One thing on education. So in the world, we are ranked number 28. There are third-world countries that are ranked better than us in education and many other things. And yet, per pupil, we are number one by far. There's nobody close. Number two isn't even close. So we spend more money per pupil than any country in the world and we're ranked number 28, which is way down. Way down the bottom, essentially. I mean it's it's -- can you imagine we're ranked number 28 and we're number one. And that's what I do like saying about my campaign, I spent less money than anybody else and I have the best result. I'm number one by a lot. And I spent no money. I mean my plane cost me some money. But I spent no ads. Took a little radio ad in Iowa, but I didn't do that. I think the station is so lovely if you want to know the truth. But I spent essentially no money. And then you have all these other guys spending vast and they're like the way the United States is run. Now why would we put a guy, like Jeb, like some of the others. It's not only Jeb Bush. They spend money. I see Rubio at the ads all day long. You know the black background. He's got like a black thing. Should have put something like that behind him, right? Right there, the flag. No no. And I like him. I think he's a nice guy. But I see these ads you know with the with the backdrop and perfect. And it's just somber, it's not good. I think it's good. So think of it. I spent no money and I'm number one. Other spent. They will have spent hundreds of millions of dollars and they're not even in the race. That's what we need for our country. What? OK. I got 15,000, I know what that limit but that's OK. So but I think he's a fan. I don't think he's a pro. Are you a protester? No? OK. No he likes Trump. OK. He's not a protester. I love you. You know the only time -- don't worry about it. The only time the cameras focused on the crowd is when we have a protest. Because I always have like look at this ballroom packed. I always have the biggest crowds and I go home and my wife said, were there many people? I watched you on television tonight. I said when I had 20,000 people. The whole -- she said, they didn't show it. They have -- right on your face. So I have 20,000 people. I have 20,000 in Oklahoma, 35,000 in Mobile, Alabama. Nobody knows because those cameras they run in your face. And I think they can't move. You know, I think there may be fixed because modern cameras maybe. Except every time there's a guy that stands up protesting, you know, they're on drugs or something because some of these guys they said, they don't even know what the hell they're doing there. All of a sudden the cameras swerve and they perfect shots. And I like it because then it shows how big the crowds are. So you know. Sometime I think I'm going to put in some false protesters. I'll put in some friendly protesters. It's it's the only way I'm going to be able to get them. So when we started, I talked about trade, I talked about the border. I talked about a lot of things and I started on June 16th and in Trump Tower or the famous escalator, right? And it takes guts to run for president. You know it's like I never did this before. And then they tell you're on a debate, we had the largest debate with the largest audience in the history of cable television. Then CNN a couple of weeks later, had 23 million; Fox had 24 million; CNN had 23 million. The largest audience in the history of CNN. Now they're there and the cameras on live right now. I mean, you know, it's largest audience in the history. And now the debates used to be -- if you go back four years or eight years, you know whenever the cycles came up, nobody even wanted. They didn't want the debates. I think they were forced to take them for licensing. Nobody wanted the debates, so it drew nothing. But now they're drawing 24 million. Now they want have more debates. Can we have more? Can we have more? Can they go three hours? Remember, when they had the one go three hours, I said, no, I'm not doing three hours. It's too long. Who wants -- I could stand up if here for 50 hours. But who the hell wants to sit home watching three hours of this stuff, right? Mr. Trump you have 30 seconds. What would you do about ISIS? Oh great. And by the way, that question, I hate those questions, you know why? Because I want to be unpredictable. I don't want to tell ISIS what I'm going to do to knock the hell out of them. I hate it. I hate it. Remember, I said very strongly, keep the oil for what, four years. You've been watching. I mean, four years, I've been get the oil, get the oil, get the oil because who is going to get the oil? Iran is taking over Iraq. We made a deal for Iran done by some of the dumbest people on earth on our side. We gave them everything they wanted. We don't even get our prisoners back. And now Iran wants to start negotiating separately for them. Can you believe it. I go crazy. We would have gotten them back. All you have to do is say, we want our prisoners back. They would have said no. I would have said, I want them back. You don't understand me. I want them back. They would have said, no, we won't do that. I would have said, bye bye and I would've left. Then I would have doubled up the sanctions. And I guarantee you, I guarantee you that within 24 hours they would have call back and they'll say, you've got your prisoners. Can we talk? And I would have never given them $150 billion. I wouldn't never given them the money/ I would have never give. They used -- then I have to make nuclear. They can buy it. Why are they going to make it? Then we have the nuclear where they have self inspection. How about the area, you know, they're big area. They don't want us there. Oh I wonder why they don't want us there. So they self inspect, OK? Then they have the 24-day inspection. But the self inspection is the beauty. We think you're making nuclear weapons here. Well, let us go check Mr. President and we'll check. No sir, we're not making nuclear weapons. Nobody know. No we're not. We would never do a thing like that. These are people that have deceived us, they've lied to us. They're a terrorist state. But -- and I used to say it's the worst deal that I've ever seen negotiated and by the way, just to finish prisoners, so they come back, we get our prisoners. But then when I hear the other day that now this deal is done. It's all done. And now I hear they want to negotiate to get and what did they say. They said very strongly. They said, we are going to want a lot of, or the prisoners. That's our -- we're starting off. We're gonna want a lot. Now we've already taken off the sanctions. They're already rich as hell. What's going on there? That's why I say, I mean, some people say, it's worse than stupidity. There's something going on that we don't know about. I mean honestly. And you almost think -- I'm not saying that and I'm not a conspiracy person. She said, we are. We're saying it. I have the people in this room is saying and I'm trying to be like you know -- I'm just hoping they're just stupid people, OK, which they are. Or there's something going on. Because it's inconceivable. You know, did you ever see where some things are so bad that it can't be -- that nobody can do what they did, right? Nobody. So Iran now wants to negotiate separately for it. But that deal is done. Now we want to start all the deal and they want a lot. We want a lot and I just -- I want to just shoot the television, you know, because they would have had it, just for saying. And you know when they asked Kerry and Obama, the deal was made, everybody knows it's a horrible deal. It's going to lead to -- it's going to lead to tremendous nuclear proliferation and they're so rich now. You know they became $150 billion, that's -- they became so rich and many other things that you don't even know about. Most people don't even know what the agreement says. But I'll tell you what. When you look at what we're doing, we're not going to have -- if we keep going like this folks, we're not going to have a country left. We're not going to have a country. We're not going to have a country and we're like a dumping ground for the world. We're a dumping ground. They want to take these -- the migrants you know and I feel terrible about the migration caused by Hillary Clinton and Barack Obama. They're the ones that caused it. They go into Libya. They knocked the hell out of Gadhafi. OK. So Gadhafi, they back rebels who end up killing the ambassador and the other young people. You know that the ambassador was riding in a Jeep. One of our Jeeps, of course, a military jeep holding the Libyan flag and you know, freedom freedom freedom and then he gets killed by the same people. So we backed people that turned out to be far worse than Gadhafi. Look what we did in Iraq. Look what we did in Iraq. I mean what the hell do we get? We spent $2 trillion and that was as a year and a half ago. I keep saying $2 trillion, it's a lot more than that. We spent $2 trillion. We have thousands of deaths and I'm not even talking other side. You're talking about other side, you're talking about hundreds of thousands, maybe millions. You have thousands of deaths. We have wounded warriors who I love. All of -- these guys are the toughest. These are the greatest people. Now these are the greatest people. And then what happens? We leave and we have a president that announces the date of when we're leaving. So I said, man, if I'm the enemy, I'm just going to go away for 18 months, right? He gave a date. We are leaving Iraq. We won't be gone by such and such a time. I said, I'm just sitting there watching and I'm saying, man, that's really stupid. Because believe me, the enemy doesn't want to be killed. You know, you hear so much all they want to go with the virgins up to wherever they go, right? They don't. They want to live. They want to live and they want to take care of their families, always their families remember that because their families know what's going on. OK? You think their wives don't know what they're planning. You think their kids don't know exactly what daddy is doing when daddy is gonna fly into the world trade center. You think they don't know? They know exactly what's going on. Remember that. And frankly, I think they have more love for their families live than they do for their own life, OK? But they still want to live. So here's Obama gives an exact date, he gives an exact date. So they pull back and everyone says, oh, we're doing so well. Look, we're doing so well. The enemy. Why should they fight when they know in 18 months, they go on and take the place. So what happens? So we have ISIS taking a lot of oil. I said, take the oil. Remember when we left, I was opposed to going in because I said you're going to destabilize the Middle East because you had Iraq and you had Iran. And I said, they'll fight. They are always fighting for decades and decades for generations. They fight. That's what they do. They fight. How we ever got involved in this mess is hard to believe. They fight. And they were equal, militarily. They go this way, 10 feet. They go this way, 10 feet then they rest. A couple of years, then they start fighting again. Then Saddam Hussein throws a little gas. Everyone goes crazy always using gas. They go back forth. It's the same. And they were stabilized. And I said, if you go after one or the other, in this case, Iraq, you're going to destabilize the Middle East, that's what's going to happen. You're going to destabilize the Middle East. And that's exactly what happened. We totally destabilized the Middle East. We have now migrations largely because of what's happened afterwards. You know Iraq was horrible. It was stupid to go in. We should have never gone in. But we shouldn't have gone out the way we went out and we shouldn't be given dates. I mean, I would probably say we're gonna stay forever and they would've said, Oh man, and then keep going, keep going. Eventually, they would get tired. They say, this guy is crazy. I mean, he's never going to leave and you'll make a deal. But when you announce you're leaving in 18 months or whatever the hell he said, they just pulled back and then as soon as we left, they come in. OK? so they have the oil. You know the biggest beneficiary of the oil is, right? China. China always China. I love China. I love Mexico. Their leaders are too smart for us. We have no border. We will build a wall. Mexico will pay for the wall, by the way. They're building a wall. We're gonna have a border. And people are going to come into our country, but they're going to come in through a legal process. They're not coming in the way they're coming in now just walking in like nothing. They're going to come in but they're going to come through a legal process. So with Iraq, wo we give them a date and they take over. We didn't take the oil. So for four years I've been talking about it, then because of Paris, all of a sudden, they start bombing the oil. But I didn't want to just bomb the oil, I want to take the oil. They're bombing. You know, we're bombing, right? What's going to happen after that? So we're bombing and you know, we're not really bombing it because they're still selling it. I say, how could they keep this up. Obama doesn't want to hit him too hard because he's afraid he's going to pollute the atmosphere. No, this is serious. Now think of it. He talks about the carbon footprint and yet he'll fly a very old Air Force One, an old Boeing 747 with the old engines and you know spewing stuff. So he's got a problem with the carbon footprint. You can't use hairspray because hairspray is going to affect the ozone. I'm trying to figure out. Let's see, I'm in my room in New York City and I want to put a little spray so that I can, right? But I hear, well, they don't want me to use hairspray. They want me to use the pump because the other one, which I really like better than going bing, bing, bing. And then it comes out in big globs, right? And it's stuck in your hair and you say, Oh my God, I gotta take a shower again. My hair is all screwed up, right? I want to use hairspray. They say don't use hairspray. It's bad for the ozone. So I'm sitting at this concealed apartment. This concealed -- you know, I really do live in a very nice apartment, right? But it's sealed. It's beautiful. I don't think anything gets out. And I'm not supposed to be using hairspray. But think of it, so Obama's always talking about the global warming, that global warming is our biggest and most dangerous problem, OK? No, no, think of it. I mean even if you're a believer in global warming, ISIS is a big problem. Russia is a problem. China is a problem. We get a lot of problems. By the way, the maniac in North Korea is a problem. He actually has nuclear weapons, right? That's a problem. We get a lot of problems. We got a lot of problems. That's right. We don't win anymore. He said, we want to win. We don't win anymore. We're gonna win a lot. If I get elected, we're gonna win a lot. We're gonna win so much. We're going to win a lot. We're going to win so much you're all going to get sick and tired of winning years. You'll say, oh no, not again. I'm only kidding. You never get tired of winning, right? Never. But think of it. So Obama is talking about all of this with the global warming and that and a lot of it's a hoax. It's a hoax. I mean it's a moneymaking industry. OK? It's a hoax. A lot of it. Look, I want clean air and want clean water. That's my global -- I want clean clean crystal water and I want clean air and we can do that, but we don't have to destroy our businesses. We don't have to destroy it, OK? And by the way, China isn't abiding by anything. They're buying all of our coal. We can't use coal anymore, essentially. They're buying our coal and they're using it. Now when you talk about the planet, it's so big out there. We're here, they're there. It's like they're our next door neighbor, right, in terms of the universe. Miss Universe, by the way, made a great deal when I sold. Oh did I get rich. That was a great deal huh. You know they broke my choppers on that. They said, he talks about illegal immigration. We're not going to put him on television. First of all, that Univision is being sued like crazy. You wouldn't believe it. And NBC made a great deal with them, just like an amazing deal. Far more than I would have ever gotten. I mean, I made an unbelievable deal far more than I ever would have gotten if I said, I think I'm going to sell it if times were normal, right? Isn't it amazing the way this is gonna work out. But I love Miss Universe and I love the universe. But think of it, so China is spewing up all this stuff and we're holding back. And with China, you know, we signed these agreements where we have to do it now, they have to do it within 30 or 35 years. I don't think they're going to be doing it. It's like Japan. If somebody attacks Japan, we have to immediately go and start World War 3, OK? If we get attacked, Japan doesn't have to help us. Somehow that doesn't sound so fair. Does that sound good? So South Korea, I order televisions, I order thousands of televisions a year. I ordered televisions because I have a lot of stuff. I like nice branded. They're all made in South Korea. Most other than Sony and Sony in all fairness has lost its way. But a lot of Samsung, all of them. I mean they're all pretty much -- all of them, right? I think just about. But I order thousands of televisions, they're all from South Korea. So we have 28,000 people on the border, separating South Korea from this maniac in North Korea. We get nothing. What, we get nothing. Nothing. They're making a fortune. It's an economic behemoth. A lot of you don't know, we protect Germany. Germany. Mercedes Benz. How many people have a Mercedes Benz? We protect Germany. It's an economic behemoth. We protect Saudi Arabia. They were during the good old days. Now it's probably half, which is fine. But during the good, they were making a billion. Listen to this, a billion dollars a day. And we protect them, our military. They pay us peanuts like nothing. And then if we want to buy, if we want to move to another location, well, that's more expensive if we do that. We want to -- they charge us rent. I mean, look, we are run by people that are so bad. They're so out of their league. And I see it. I see it on the stage. You know there are a lot of them are nice people. You know a lot of people think I don't like this, but I do like them. But they don't have business sense, they don't have business ability. They don't have common sense. They're all politicians. They're all talk and no action. When I say, folks, when I say, we're going to build a wall, most of them say, you can't build a wall. We'll build a wall. In China, 2,000 years ago, they built the Great Wall of China, which is bigger than any wall we're thinking about, OK? The Great Wall of China goes 18,000 miles. We have 2,000 miles, of which we really only need 1,000 miles because you have a lot of natural barriers, right? That extremely tough to get across. We have a thousand miles. So China has 18,000 or 13,000 miles and we have 1,000 miles. We have modern cranes. We have Caterpillar tractors. I want to use Caterpillar. I don't want to use Komatsu. Made in America. Even my hats, they're made in America. Wasn't easy to find the guy could do those hats. You know what I'm talking about. I see so many knockoffs of my hat, right? Make America great again. I see these things are out of plastic. They're out of all sorts of crap. Mine are made in America. And honestly, they do a great job but they don't produce as many as I'd like because frankly, there's a big -- I mean, it's amazing. Those hats are amazing. But I wanted to have it made. And you know why I wanted, I wanted it anyway. But I also knew that as soon as the hats came out and other things, we have a website. As soon as the hats came out, I knew the press would be calling. And it's true. First hour when the hats were announced, I get a call from the New York Times. Mr. Trump, where are those hats made? I said America. I knew it. I know it. Because, as you know, if I would have said China, I would have been in big big trouble. But they're being knocked off all over the world. I mean, I see hats they're like helmets. I see them all. But what are you going to do? But here's the story. We've got to build a wall. So when I talk and when I'm up on the stage with these guys, these people, wonderful people and a very nice woman, Carly. She's a nice woman. When I'm up on the stage with them, they think I'm crazy when I say Mexico. So I say, we're gonna build a wall. It's gonna be a great wall. It's gonna be a great wall. See the ceiling, the ceiling is peanuts compared to the height of the wall I'm talking about. I'm talking about if they ever get up there, they're not coming down because it's too dangerous. All right. You ever see what they do now? We have these little walls, they build ramps. They build a ramp. I say, wouldn't it be cheaper just to knock the wall down and just -- and then they drive over it with Jeeps loaded up with drugs. Do you see this? They build ramps so it was a picture in Time Magazine. It's a ramp, a little ramp that goes over the wall and down. So they have a Jeep over, down, boom make money. We get the drugs. Think of it, we build a wall. It's right, you've got to build the wall. We get the drugs, they get the cash. Not so good, right? We don't like that deal. Our politicians don't know. They don't know. So when I say, Mexico is going to pay for it. These guys are on the stage with me. They're not business people. They don't understand. Mexico makes a fortune off the United States. Number one, we give them a lot of money. But in addition to that, they're taking our businesses. They're making -- if you talk about a trade deficit, I'll tell what Mexico in a certain way is in a mini version to new China. Mexico is making an absolute fortune. Peanuts compared to the cost of the wall. Let's say the cost of the wall is $10 billion. That's a good. I can do a great job for 10. I think we'll have a lot of money left over. Somebody else would have. You know, they -- and by the way, 20 years ago, they wanted to build a wall. People that are opposed to it now, they wanted to stop and they want to build a wall. You know one of the reasons they didn't build the wall? Because of the Environmental Protection Agency. They couldn't get an environmental impact study approved. Can you believe it? Because there was a toad or a turtle or a snake or something was in the way. Now think of it. In China, in the South China Sea, there were these low level landmasses that were covered by water but pretty close to the top. China sends in massive excavators and they're gonna blah. They're building military fortresses in the South China Sea. And a friend of mine, who is one of the biggest and richest people in China, he's a great guy. They're great people. They're fine. They're just too smart. I mean, the leaders are too smart for our people. They won't be too smart when I put my people there. When they call up, we'd like to speak to the donor that is negotiating. No no. The donor now is Carl Icahn. You're going to speak to Carl Icahn. You know Carl great businessman. You have so many people. They call all these business people call. So a friend of mine so I call him and I say, you're actually doing that. And then jokingly, I said, how long did it take to get started? Did you have to get an environmental impact study approved in order to excavate? He looked at me cause I hope you're kidding when you say that. They conceived of the idea. They started digging 4 hours later, OK? There's no, you know, go through 25 years of environmental impact, you're going to hurt the snail, you're going to hurt this, you're going to -- they're doing a big thing. They excavated massive mass of -- take a look, massive, the biggest excavator. They're ripping the hell out of that ocean. They're ripping it and they're taking that dirt and they're putting it and they're building airfields and they're building forts. We couldn't do it because just like I said for the wall, legitimately, they couldn't get an environmental impact. Now that's probably not the only reason it didn't happen. I heard their costs were too high. With me, that's easy. You know I'm doing the old post office at wash. I'm under budget. I'm ahead of schedule. Hey, look at look at the campaign, guys have $59 million and he's down at the bottom. I'm nothing and I'm at the top. It's the same thing. I actually said -- it's funny. The other day, I got this great review. They said, Trump is a great speaker. The crowd is spellbound but he has one problem and I'm reading. I want to see the problem is he speaks through the applause. In other words, like I say that, you applaud, I start talking before you finish your applause and you know why? Because I'm so excited because we have so much potential. It's true. I don't want to wait for you're freaking applause. We have -- I have so many -- We have we have so much potential. There's so many things to do. I don't really sort of want to wait. I want to do it and I just noticed. I did it again. You were getting ready to give a big applause because you like that and I'm speaking. I kill the applause but he's right. He's right. But except I'm not a speaker. What I am is a doer. I get things done. I get things done. So when the people up on the stage with me and Hillary, Hillary doesn't have a clue. By the way, you talk about low energy. She has lower energy than Jeb Bush, which is hard to believe. She does. And I'll tell you and I've been saying it and maybe it's rude maybe it's not, but it doesn't matter. We have a much bigger problem. We have to save our country. So if I'm rude and if people think I'm weird, I'm actually a nice person. I have a big heart. I want to help people. I want to help the migration. I want to do a safe zone in Syria. I don't want him coming here. We don't know who these people are. They're undocumented. They're undocumented and we should do a safe zone over there. We should have the Gulf states, Saudi Arabia and these states that are not spending. They got to spend. They've got to pay. You know we're protecting them. We're doing -- they wouldn't be there for two minutes if we're not protecting them. They got to start paying. They're not taking anybody, OK? How about Germany taking millions a year. Can you believe what she's doing to that country. And she was the person of the year and I wasn't. Everybody said Trump was supposed. Hey, what are you going to do. I think she's made -- I think I think she's made -- I think she's made a terrible mistake. We'll find out. Time will tell. They having tremendous crime problems. I think she's made a terrible mistake. But what I like is in Syria, with other people's money, meaning the Gulf States and others and Germany and others because look Germany is paying a fortune to accept all these people. They'll give us. We do a massive safe zone and then eventually when this whole catastrophe straightens out, which I'll probably be able to get it straightened out. I understand that stuff. But once it's straightened out, they could go back home to their country, you know, to their area. It's interesting. I have thousands of people that work for me, thousands and I have people that come from far. They're all here legally, don't worry about it, I use E-Verify a lot. But I have people, I have people -- they go and check. These guys go check. They went into the old post office checking everybody walked that door. Are you here legally? Are you here legally? They said they found one person out of hundreds and hundreds. I don't believe it. OK? I don't believe it. But you know, it's possible somebody said, hey, we do have 11 million people in the country and it's probably a much higher number than that. OK? It's probably a much higher number, but we have to do something about it and we're going to do. So I just want to finish by saying this, look, we have a situation that's out of control. Our country is a dumping ground for the rest of the world. We're laughed at by the rest of the world. And when I started this journey and it's a journey and I do love you people. You're amazing people. And by the way, you're so smart. You know a lot of times they'll say, well Mr. Trump's people are blue collar. I love blue collar. I'm honored by that. But they're not blue collar. I mean, we have blue collar and we have executives and we have young people. They should -- the audience is older -- it's not older. The audience is young. The other night in Iowa, I told that and I said we have so many young people and the place erupted. They're all young people. We have an amazing thing happen. It's just... Look. That's their way of marginalizing not even me it's marginalizing you. It's disgusting. I mean, it's disgusting. But when I started this journey and that's what it is it's a journey and it's a movement that's taking place. It's a movement. Remember the old days, silent majority. It's not right. It's a noisy majority. People are angry. It's a noisy majority. These aren't silent people anymore. I go to people you can't even hear. This is an amazing thing that's happened. I received a call from one of the biggest reporters, who happens to be liberal but that's OK. We can have a couple of them, right? But a guy who is really respected recently and he said, how does it feel? I said, how does what feel? He said, what you have done has never been done in the history of politics in the United States. I mean even CNN said, number one political story of the year is Trump. You know who at number two was? ISIS. ISIS was two. I'd rather reverse it. Let ISIS be one, let me be two because I want to knock the hell out of them and make me number one next year. Make me number one next year. But this reporter who is a great intellect actually and very smart guy, very good guy, he said, he said, what you've done has never been done before in the history of this country. Newt Gingrich was on a television show the other day said, this is one of the great phenomenons I've ever seen in politics. Nobody's ever seen it cause crowds like this forget it. I mean, it's only confined in this venue. Again, they sent 3,000 people home. Can you believe it? Three -- more than 3,000. It's it's unbelievable what's happening. It's beautiful what's happening. It's beautiful what's happening. But Newt Gingrich said, he's never seen anything like this. But he said to me, the reporter, he said never been done before. I said, well, you know, it's fine. But if I don't win, it's just a waste of time. He goes, no no no. What you've done is incredible. He said even if you don't win, what you've done is incredible. You've totally changed the landscape of politics. No, but... Don't applaud. Don't applaud. Don't applaud. He said, you've totally changed the landscape of politics. It's forever going to be different. Your campaign has never been anything like it, OK? He was overly nice. I said you don't understand. You don't understand. If I don't win, I will consider this and I mean this, a total and complete waste of time. I really do. So because we're not going to do anything. It's wonderful. Good. I had nice crowds. They'll write about me every once in a while, every two years I'll have a story, Trump had this rather good campaign. If we don't win, to me, and honestly, you should feel the same thing. If we don't win, it's a total waste of time because you have somebody else in there. They won't be able to do what I do. They're not going to be able to. And even if you get one of these Republicans in, like I didn't finish Mexico. The wall. When I say Mexico is going to pay, they all laugh. They all go, ha ha ha. They think it's funny. Honestly, these are people they think it's funny. They're laughing. You know lightly like, oh oh oh, that's so funny, ha ha ha. They get to pay for the wall, folks. They're making billions and billions and billions of dollars on deficits that we have with Mexico. The wall is peanuts. They get to pay for the wall. But I have mentioned it, now they don't laugh because they suddenly agree with me. And then the other day one of the people said, it was Ted Cruz, who's a nice guy, but he said, we're gonna build a wall at the southern border. I said. wow. And my wife was sitting. Where did that come from, right? No. Ted's a good guy but he said on -- I think it was on Fox News being interviewed and he said, we're going to build a wall at the southern border. He didn't say Mexico is gonna pay. He hasn't gotten that far yet but believe me, that's going to happen. See they're all trying to catch up with me because when I did this stuff, it was very out there. Now, I'm the one that everybody wants to sort of aspire to. But what happens is so Ted's up and he's talking, and you know routinely we're gonna have the border, we're gonna have this, that and we're gonna build a wall. My wife is sitting and she's, darling, did you hear that? He just said they going to build a wall. That's the first time ever, you know, that's what you say. She hasn't heard that from any other candidate. OK, so we're going to build a wall. Mexico is gonna pay for it. There's so many things we're gonna do. But when I when I started the journey, it was amazing. I came down took courage. I went down into the lobby of Trump Tower on the escalator with Melania. I have never seen -- it look like the Academy Awards, the press. We have a lot of press here today, all alive. Look at all those live cameras. So when I came down, when I came down in the escalator, we came down and I said, we're going to do things. And I mentioned illegal immigration. You wouldn't even be talking about illegal. It wasn't even on the radio. Nobody was talking about illegal immigration. Is that right? Now, it's one of the big subjects and that's why. And one of the beautiful polls that came out and I'm so proud of it. CNN just came out with a poll couple of I guess a week ago, 36% for Trump, second is 16%, third is 14% and then 12%. It's all the way down. But on the economy, they give me 55, 55%. That's with 16 people at the time. On the budget. I mean, I understand the budget, the economy, I win it hands down. All right. But listen to this on illegal immigration, I'm almost at 50%. And on ISIS, likewise almost at 50%. So people want to be protected. They want to feel safe. They need strength. They need toughness. They need smarts. I don't want to be tough. You know, I know a lot of tough guys but they're not smart. And they're the they're the easiest. You can be tough, but you've got to be smart. Let's start smart first. You got to be smart tough. You got to be tough because the world is trying to take advantage of us. So what happens is this, I came out, I started, I did it, I was, Oh, that first couple of weeks with illegal immigration in Mexico and all of this stuff. Then Kate was killed in San Francisco and Jamiel was killed in Los Angeles. Jamiel show an unbelievable young man was killed just shot right through the head by an illegal immigrant. Kate was shot by a guy came in five or six times shot in the back. So many great people that -- these are two so many. And then you have the economy and the jobs that are being lost and people aren't paying taxes and all of this stuff, right? And all of a sudden people are coming over and I'd say, the wall and now they're starting to say the wall. We have to be progressive in our thinking. When I say progressive I mean like smart. I'm not talking progressive like a Bernie Sanders would say this guy wants to tax you think of it. Think of it. This guy wants to raise your taxes to 90%. No no. Think you'll have to move out of this. I love this area, by the way, I've been here many times, great golfing area, right? We love it. No more golf and Bernie said no more golf. No no. You won't have any golf anymore. They won't be -- you won't have any money left to be golf. You'll be paying it in taxes. This guy is a total disaster. And I'm not saying that. I tell you what. You know, Hillary said, well, I'd like to run against Trump. Believe me, this poor Chuck Todd meet the press. His show is dying. And he keeps saying, do it, do it, but I never liked it. You know, I just -- he never treated me fairly. So I do a show, it gets the highest ratings he's had in years. He went from like a -- believe me, I won't even give you the numbers. They were massive, the numbers, right? I saved his life. And then he goes, Hillary Clinton said that she would most like to run against Donald Trump. And yes and they're looking forward to it. Trust me. The last person -- She's already gotten a dose last night. Do you agree? She had a tough night. She had a tough night. She had a tough night looking at the beauty pageant, OK? So Hillary Clinton said, and here's Chuck Todd and he's a nice guy, I'm not trying to knock him. Please don't be insulted, Chuck. But she says she doesn't like him. But he doesn't treat me right. So he goes, the Clinton campaign said that they'd most like to run against Trump, like I'm some kind of a sap. So I come, I say, Chuck, let me explain something, when they say they want to run against me, that means they don't want to run against me. Do you understand that? Do you understand it's reverse psychology? They say they want to run against me. First of all, I'm winning and tied in the polls now and I haven't even hit her yet. But look at what happened to all the guys I hit, they're gone so. They're gone or they're failing badly. OK? And they'll be gone soon. But Hillary Clinton, think of it. So I say, so Chuck, report it like properly. Trust me. They don't want to run against Trump. The last thing she wants in her whole life is -- this was only -- I did this in like 15 minutes what happened to them. Because the husband wants to come and she wants to accuse me of things. And the husband is one of the great abuses of the world. Give me a break. Give me a break. Give me a break. So the last person she wants to run against is me. Now, here's the story. Look, here's the story. It's very simple. So I announced and I was talking about trade. I was talking about the wall. I was talking about the borders. I was talking about Obamacare. I was talking about Second Amendment will be saved, by the way. Second Amendment. It will be saved. The Second Amendment is going to be with us. If I'm president, you know, they're doing everything. They want to get rid of the bullets now. They're doing everything they can. Think of Paris, think of Los Angeles, think if you had some guns in Paris on the good side right? They had no guns. Paris is the toughest gun laws in the world, folks. And France, I mean, you get caught with a gun, it's -- The only one that has guns are the bad guys. So they go in these various places, they call the guy the mastermind. He's a moron. I mean, this guy was a moron. I called him the guy with a dirty hat, right? They got him. So good. By the way, the French police did a great job and our Los Angeles police did a phenomenal job. They did a great job. But wouldn't it be wonderful if let's see, this guy, right here in front of me, he's a tough guy. This guy with the hat with a lousy head of hair but he's a strong looking guy right here. This guy right there, see. And that -- wouldn't it be nice if they had a gun on their waist. Somebody? Him him him. So that when they shot -- you know they were doing in Paris. Get over here, bum. Get over here, bum. Your turn. Get over here. Bum. 130 people with more to follow cause there are people that are so badly injured right now in hospitals. Other people are going to die. Same thing over there. These are people that gave a party in honor of their marriage. There's something going on folks it's wrong. They gave them a party. They work there. They gave them a party. She came in and a fiance permanent or some nonsense. And she was radicalized and he was probably radicalized by her or he was already radicalized and people knew that they were radicalized. And people in the area knew that they had bombs all over. Who the hell doesn't know, your the next door neighbor and they didn't want to talk about it. You've got to report these people. We've got a real problem. You've got to report them. No more nonsense. They didn't report them. And the reason they didn't is because they don't disagree with them so much. OK. Believe me. It's not because they're afraid. You saw the one it wasn't politically correct to report him. They didn't want to report him. I mean, give me a break. So we have to change. So it started off with me where I was going to talk about trade. I was going to talk about all the things. I was going to talk about the military, building it up. I was going to do all of this. But after Paris and California and there'll be others because they have no fear of us. But after Paris and California have totally changed and my poll numbers were up 10 points. It's amazing. It went up 10 points, I said, why? Do you think it was the debate? Because I did good in the debate. They should know people view you as a tough cookie that's not going to take this crap. That's what it is. And now I talk about protection. I talk about -- trust me. The trade. Oh, that's so easy for me. I got the greatest guys in the world. They're going to come and they're gonna do a great job. I'm going to do some myself. I always talk about forward. They're gonna build a plant, $2.5 billion in Mexico, not going to happen with me. That stuff. Those deals are no good. Ford's leaving. They're closing plants all over Michigan to build a plant and in Mexico. How the hell does that help us? OK. Who are the people that think this is a good thing for us. And in the meantime, in Michigan and other places where plants closing all over the place and they're spending think about it, $2.5 billion. And then they get to sell cars, trucks and parts into the United States, no tax, no nothing. I'll say, you don't have to pay tax folks. And you know what, Ford will say, if I've got to pay tax were gonna to stay in the United States. I mean, it's very simple. It's very simple. How about two weeks ago, Nabisco announced, the big Chicago. They announced are going to leave Chicago with one of their big plants and they're going to move it to Mexico. What's my statement? We're not eating Oreos anymore, right? No more. But I don't want this. It's not going to happen. They're gonna make product and they're going to sell it into the United States, not going to happen. It's not going to happen. And by the way, I'm a free trader. I believe, but you've got to be smart. I mean, we've got to get something. We don't get anything out of anything. We don't get anything. We lose on everything. That Iran deal was a disaster. By the way, I think of the Iran deal for one second. I always -- and this came to me two weeks ago, I don't know why I didn't think of it sooner. Very disappointed with myself. The Iran deal is the worst deal I've ever seen negotiated. OK. I'm wrong. You know what the worst deal is? Iran is a part of that one too. We gave them Iraq. That's even better. Think of it. We gave Iran, Iraq. Iran has the biggest, think of it. They're going to have the richest -- If you go to Iraq, take a look, among the largest oil reserves in the world. We gave them by decapitating Iraq and then leaving because frankly, once we did it, we should have kept 20,000 troops to stay. We give Iraq. So not only did they make a great deal in terms of the Iran deal that we know, having to do with nuclear. We also gave them Iraq. We gave them Iraq that they've been after for 100 hundred years. We hande it to them. So now they have the largest oil reserves among in the world. That's even better than the original deal. I mean, whoever is representing Iran is doing a hell of a job. OK? That was a stock, you got to buy some. So we are not going to have deals like that with me. It's not going to happen. We're going to become rich again, we're going to become safe again and we're going to become strong again. And you're going to remember this moment, this is going to be an important moment for all of us. The one thing I have to say and I have to ask you to do, go out and vote. It's going to be your turn. Number three. Remember, it starts on February 1st with Iowa. We go to New Hampshire then we go to so three weeks. We got four weeks to go and then we have three weeks after we start. No matter what's going on in your life, you got to go and vote. Because if you don't, it's not going to happen. Don't sit back and say, oh, Trump's going to do well. The more we can win by, you know, the more power we have in a sense because it's like a mandate. But you got to go out and vote. And I will tell you this, it's been an honor to be here. I love this area. I love the people here. It's been an honor. But we will make America great again. I promise. Thank you. Thank you. Thank you everybody. Thank you."}