{"id":484,"author":"Donald Trump","title":"Speech: Donald Trump Delivers a Speech in Grand Rapids, MI","date":"2015-12-21","link":"https://factba.se/transcript/donald-trump-speech-grand-rapids-mi-december-21-2015","paragraphs":["And you know, I brought him here. So the poll comes along, every single poll, there are 11 of them right here. See the name, Trump on top? By keeping them small. Small. But every single poll that they took for the debate, who won the debate? Who won? And it's sort of interesting because the Fox poll, which came out and it's a big one and a good one, which came out three or four nights after the debate had me up 11 points, 11. And I was already leading.","And then I said, I guess, I won the debate, right folks? You know, so we -- they had 11 polls and they had Drudge, who's a great guy, 46%. That's at 46% of the vote out of 15 people. That's a lot. I would honestly take right now 46% of three people, but this is 15 people. By the way, sadly, I guess you heard, Lindsey Graham left the race tonight.","Sad, very sad. I'm extremely said. He was nasty to me, wasn't he? Nasty. You see how many -- everybody that goes against me is like X, X. So we started off with 17. I won't say how many left but a lot of people are starting to leave. They're going to start to leave. But everybody that's going -- wouldn't it be nice -- that should happen with our country.","Everybody goes against us, down the tubes. Sort of interesting, right? Sort of interesting. So I'll go through fast. So this is on the debate. This -- The night of the debate, hundreds and hundreds of thousands of people voted. Who was number one in the debate? I was. I love you too. So who is number one?","Trump. Drudge, 46%. Time magazine. They didn't even give me the man of the year or the person of the year. They should have. That's why it's heading down the tubes, folks. They gave it to a woman, who has not done the right thing in German. It's not doing too well over there. Nice woman. I like her. I like her.","I better like here. I may have to deal with it. Look, hey Putin likes me. I want her to like me too, right? Right? You know, it's sort of funny. So Putin out of nowhere -- I never met Putin. But we were on 60 Minutes together. Not together, but together, meaning I had a segment, he had a segment. We got tremendous ratings on that show.","I took full credit. I said, if it wasn't for me, they wouldn't. But We didn't meet. So we were stable mates sort of sense, right? It was he and I on 60 Minutes like five, six weeks ago, and it was great. And he came out of nowhere two days ago and he said, Trump is brilliant. He's great. He's the leader.","He's the leader of the parties. And he said nice things. I didn't know. I never met him. So I didn't know. And he said nice things. All of a sudden, I'm hearing things like, oh, isn't it terrible that Putin is saying that. That's not terrible. That's good. That's like a good thing, not a bad thing. He can't stand Obama.","Obama can't stand him. They're always fighting. Wouldn't it be nice if we could get along like with people? You know? It's unbelievable. No, no. Think of it, you know, it's Russia after all. Somebody said, are you at all offended that he said nice things about you? I said, no, no. And they said, oh, Trump should have been much nastier.","That's terrible. And then they said, you know, he's killed reporters and I don't like that. I'm totally against that. By the way, I hate some of these people, but I'd never kill him. I hate him. No, I think -- no, these people, honestly, I'll be honest, I'll be honest. I would never kill them. I would never do that.","Let's say, no I wouldn't. I would never kill them, but I do hate him and some of them are such lying, disgusting people. It's true. It's true. But I would never kill them and anybody that does I think would be despicable. But you know, nobody said -- they say, he killed reporters. I said, really? He says, he didn't. Other people say he didn't. Who did he kill?","Well, we don't know but we hear that. I said, tell me who did he kill? And I go through this whole thing. It would be so great if we could get Russia on our side and other countries on our side and knock the hell out of ISIS and knock them, right? Right? So stupid. Just knock the living hell out of them.","Remember I said, take the oil, right? For years I've been saying that. For years I've been and -- Look, we have people running this country, who are stupid, who are stupid. I went to an Ivy League school. I'm very highly educated. I went to the best business school in the world, the Wharton School of Finance.","Somebody said, he's plainspoken. I don't have to be plainspoken. I have like this incredible vocabulary. But honestly, how can I describe our leaders better than the words stupid? Really, right? There's no word. There's no word. You know, I used to say grossly incompetent. But stupid stronger, isn't it? I don't know.","You look -- Bye bye. Bye bye. Hard to believe. USA. USA. USA. USA. So unbelievable. But I'm really trying to be really neutral. To one guy I said, get him out of here now. And they said the next day, it was horrible, horrible the way Trump talked. I mean the guy was a bad guy. It was terrible what he was doing.","But I was very rough. I said get him out of here. OK, so the next day, they come out and they say, that was horrible the way the Trump -- the next day, I had another big one, 21,000 people. I had one guy. One guy was like he went a little crazy. And I was very nice I said, please remove him but be very nice.","And if he wants to come back, let him. You know what they did the next? So the first day, he was terrible. He was rough. The second day -- I was going to tell you the second day but you know. Do you ever noticed how few it is and they will make it tomorrow sound like this was the biggest -- we had 9,000 or 10,000 people in here.","They'll talk about one guy or two guys -- headline, Trump had tickets. They had like three people. There was nobody outside. No, no. They set a site, a picket area. Said, nobody showed up. They will talk about the guy that just got taken out in about two seconds. So what happened, I was rough with the first guy.","Then the second, I was really not because I got a lot of bad press that I was too rough. I wasn't nice. So the second guy was -- the second event, I said, be really nice to him. Please, don't hurt him, please. And he was a bad guy. He was a rough guy, who's swinging at them. He was -- you know, they were in fistfights.","I mean I'm telling these guys to be nice. In the meantime, I'm standing up here. They have to take him on, right? But I'm saying, please, be gentle. If he'd like to come back later -- I was so nice. So the next day, Trump was off his game. He was very, very weak. So you can't win with these people. So you're too tough, you're too this, you're too that.","They're bad people. I'll tell you the only thing I love -- in fact, sometimes I'm going to do it myself. They never turn the camera, right? I've told you. You've heard this. They never turn the camera around. The thing I like about a guy like that or a guy like wherever the hell, the cameras move. They won't turn the cameras.","So when I go home. I'm proud of -- nobody gets audiences like I getting. Number one with the heart, right? Nobody. Nobody gets audience. We go, I get 35,000 in Mobile Alabama. I get 20,000. I mean, we get tremendous audiences. And Dallas was incredible, 21,000 people. Every place we go, it's packed. It's sold out.","It's all guided by the size of the venue. Look at this venue, the biggest -- I don't know when it was built. When was this venue built? Where's the owner? He was very nice. We gave -- he gave me a nice discount. Where's the owner? Where is the owner? We beat the hell out of him, but he's a good guy. He gave us a pretty cheap price.","I must tell you. Where is he? Anyway. Well -- however old it is. I mean we broke the record and I don't have a guitar. No guitar, you know? Elton John said, you get the biggest crowds in the world for a guy without a guitar, meaning you know without music, which is pretty good. So we're having an amazing time.","The subject is a tough subject because our country is doing poorly. We don't win. We're being laughed out all over the world. We're soft. We're weak. We have guys like Bergdahl, who get caught -- I mean he left. He was a deserter. He was a deserter. He was a dirty rotten deserter. And we lost five and maybe six young great brilliant wonderful people trying to bring him back.","They were killed, right? So he deserts. Now 60 years ago, they would have been shot within a very short period of time, right? Twenty five years ago, probably shot. Ten years ago, long-term in prison. Now I hear he's going to get off scratch free, why? No no. Think of it. And then we traded this guy who as far as I'm concerned, we could take him, drop him right back in the middle.","We traded -- Hello. Hey cameras, turn around there's another guy up there. The only time the camera will move is to see somebody like bye bye. That was the same guy fell as he came back in for seconds. What? No but it's sort of amazing. I have to finish the thing. So they never show the crowds. They always show my face and I have a big ego.","I like, I like when they -- but my wife said, how many people were at the event? Oh, it was packed. Oh. I said, what do you think? Well, I heard big noise but they only showed your face. They never move the camera. So I love your face too. He's a handsome guy. So I love him. We're all in love. Every place I go, it's a love fest.","I'm telling you folks, there's a movement going on. We're tired of what's happening. We're gonna take our country back. We're gonna take it back. We're gonna take it back. But I want the cameras to span the room. Go ahead fellas, watch. They don't turn them. They don't turn them. They don't turn them. Go ahead turn them.","Look, turn the camera. Go ahead, turn the camera ma'am. Turn the camera. You with the blond hair, turn the camera. Show the room. Go ahead. They don't turn them. What about hey, you in the center, why don't you turn your camera? Show them how many people come to these rallies. Turn them. Go ahead. Turn them.","Go ahead. They did? Thank you. That's the first time they've ever done that. Thank you. That's the first time. Amazing, amazing. Because what's going on is amazing and I'm telling you, it's a love fest. A friend of mine, very successful guy. He said, how many people tonight? I said, I don't know. It holds like 7,500. I think they have like 10,000. He said, what do you do? I said, they stand in the halls.","They stand all over the place. There are people outside that can't get in. Shall we wait a little while and let them get in? I don't think so, right? But no, they have people outside. They can't get in. And he said, how do you do that? Because I don't have a teleprompter, right? No teleprompter, right? I don't want a teleprompter.","You speak from the heart and the brain. You got a -- the brain, very important. But he said, how do you do that? And here's a guy, very, very rich, very successful guy. I said, you speak and it's easy because there's so much love in the room. It really is true. There is love in every room, whether I'm in Oklahoma, whether I'm in Dallas, whether I'm in Iowa, whether I go into I mean North Carolina, South Carolina.","New Hampshire is through the roof. There's love. I'm telling you folks, there's love in the room. We are going to turn this around. We're gonna get this country going again. There's love in the room. And you see Hillary -- I mean, did you watch that? What happened to her? She's terrible. She's terrible. Donald Trump is on video and ISIS is using him on the video to recruit.","And it turned out to be a lie. She's a liar. No, it turned out to be a lie. Turned out to be a lie. And the last person that she wants to run against is me. Believe me. Believe me. You know, I was just with somebody from ABC. I won't mention him. And he said, oh the Hillary camp said they'd love to run against Trump.","Of course, they're gonna say -- that's what they want to say. I mean, it's gonna be very -- ask Jeb Bush if he enjoys running against me. Seriously, ask him. In all fairness, ask Lindsey Graham. Did he enjoy running against Trump? Ask Perry, Governor Perry. Nice guys. All nice guys. Ask Bobby Jindal. He's back in Louisiana, which is a great state, by the way.","And they don't like him very much anymore over there. Ask all of these guys that have gone out, do they enjoy running against Trump? They don't enjoy it. They don't enjoy it. I enjoy it. They don't enjoy it. I mean people have said that Jeb Bush -- you know, he's low energy. People have said that if I, if I didn't run, this thing would have been over already.","He would had it. Why? For what reason? I mean, I don't know why. But they say, he would have had it. He's gonzo. He's down to 2%. And you saw they gave him during the debates a couple of soundbites. He goes like this, you could see it right here. He memorized it. Mr. Trump, I mean Donald, uh, uh. And I said, Jeb, I've got 42. You've got 2. We started off, you were here, I was here always in the center.","Now you're way down there and the next time you won't even be on the stage. Look, I love running against Hillary. I love running against her. Are you with me or against me? Oh, he's with me. Oh, oh, oh. You know, I'm looking at this guy and he's going crazy and I thought he was a protester. They'll say, he was a protester.","But he's got he's got a beautiful red, make America great hat on. Make America great, make America great again. OK, we like you. We're not gonna throw you out, OK? No, I see this guy, looks like a nice guy. He's going crazy but he's on our side, right? You're on our side. I like that. So look at this, the press just came out of the cage.","They just came out of the cage. So, so Hillary is gonna get beaten, but I haven't started with Hillary yet. What happened to her? I'm watching the debate and she disappeared. Where did she go? Where did she go? I thought she quit. I thought she gave up. Where did she go? Where did Hillary go? They had to start the debate without her.","Phase two. Why. I know where she went. It's disgusting. I don't want to talk about. It's too disgusting. Don't say it. It's disgusting. Let's not -- we want to be very, very straight up, OK? But I thought that -- wasn't that a weird deal? We're ready to start. They were looking. They gave her every benefit of the doubt because you know, it's ABC and she practically owns ABC.","She really does. I mean George Stephanopoulos interviewed me the other day. It was terrible. It was like it was one of the great interviews. Did anybody see that interview? But you know, he's a big, he's a big Hillary fan. Tonight, I was interviewed by another Hillary fan from ABC. He's all right. He's OK. Relax, relax, relax.","Take it easy. He's very committed. Relax. He's actually a Trump guy. He's just -- he's got a lot of energy. OK. OK. OK. Sit down. Come on, relax, relax. He's on our side. Who would know it? But he's on our side, I think. So I look forward to running against Hillary. We're gonna beat Hillary. You know what happened?","I backed John McCain. He lost. And that was a tough one in all fairness because I would say things weren't exactly going great. But he lost. And then I backed Mitt Romney. He should have won. He should have won. That was a race. We had a failed president and that was the race that should have been won and it should have been won easily.","And something happened. He went away, right? Oh don't hurt him. Don't hurt him. Be very nice. Be very nice. Yeah, be nice to him. Don't hurt him. See how nice I'm being. I'm only doing it for them you know that. Don't hurt him. Tell me -- I love you too man. Look at you, how handsome you are. Look, is there more fun than a Trump rally?","Is there more fun? No tax, no nothing. And everyone says, oh free trade. I'm a free trader. I love free trade. But it's gotta be smart trade. They can't take our jobs, take our base. They can't take, they can't take our money and then you get accused, oh, he's not a free trader. No, no. It's got to be fair.","They can't come in and take your factories and have cars made in Mexico and have cars made in Japan and have cars made all over the place except here. And you have your closed plants all over the place, and you guys are looking for jobs. It's a disgrace. And by the way, I'll tell you the one big thing that really helps me now.","You are really making great cars now. That's really helps me because for a while it was getting a little bit sticky there, right? It was getting a little bit little -- a little bit sticky. But you're making great cars. And I'll tell you just a couple of things I always talk about. Has anyone heard what I said about the Ford company, Ford?","Has anyone -- I tell that story, you heard it. Has anyone heard that story? Yes. Do you want to hear it again? OK, I'll tell you. So politicians are controlled by their donors and special interests and lobbyists. That's they control. Companies pay these lobbyists hundreds of thousands of dollars a month, even millions of dollars a month and they go in and they give Bush and they give -- look, I don't want to get involved.","Rubio, this one, this one, this one, this one and everybody. Except me. I'm the only one that's self funding. I'm the only one. Oh, it's the only one. I'm the only one. They gave Hillary a fortune. They're all giving these people. The insurance companies, the car companies, other countries, by the way. How do you honestly think?","Look, these aren't stupid people. How do you honestly think that China does so well? Is it because we're so stupid? And we are. But do you think they're so stupid? They're not that stupid. China does well. They have so many lobbyists. They have so many people representing their interests. Well, it's just, it's just I can't believe that it can happen.","What's gonna happen is this and I tell the story of Ford. Ford is now building a $2.5 billion plant in Mexico, right? We know that, right? No, no, think of it. Now you guys know the automobile business better than anybody, better than I do or ever will. All I know is I know how to keep, you know, people working because nobody -- you know, I have created tens of thousands of jobs over my lifetime.","I'm really good at it. I'm really good at it. So that's what I know. But you know the car industry. So Ford, good company. I like Ford. In fact, the president wrote me a beautiful letter talking about well, you know, it wasn't that bad. But he hardly mentioned what he was doing. He said, you know, how well the company -- he didn't want to mention this.","So Ford spending $2.5 billion. That's the biggest point. Can you imagine a one story plant $2.5 billion. That's a lot. That's a big plant, right? And it's gonna be in Mexico and they're gonna build trucks, cars and parts. And they're gonna make these things and they're gonna ship them all over maybe the world.","I don't know. I don't care about the world. But they're gonna ship them into this country, no tax, nothing. Now, I'm all for it if we get something. We don't get anything. What do we get for it? The Wharton School of Finance, got to get some. We get nothing. We get nothing. We lose plants. They close your plants.","And you're one of the -- I tell about the Ford plant. But usually, I'm not in Michigan. Usually, I'm someplace else where they care less about cars. They care about other things, right? Here, we care seriously about cars, right? We like cars, right? So, so Ford, $2.5 billion, they gonna build a plant. They're gonna make these cars.","They're gonna be fine. They're gonna ship them in. No tax, nothing. Where do we benefit other than -- what happens is, you're closing plants, all over, mostly Michigan, but you're closing plants. Now Tennessee had a problem because Tennessee was all set to get one of the big plants. One of the foreign companies was coming in. They're all set.","The deal was ready to be inked. And all of a sudden, boom, it was announced they're going to Mexico. Mexico is going to become the car capital of the world. You better be careful. Watch. Not with me as president. It's not, by the way. Not with me. Not with me. So here's what happened. So Jeb Bush and Hillary and others -- I don't even know why I mentioned Jeb.","You know what happens is this. Look, it's sad. It's very sad. His family is so ashamed. Look, sad. No you know why I don't like it? Spending millions of dollars of advertising on me, negative ads on me. He's got to get through about seven other guys before it gets to me. Why isn't he spending on other people?","So here's the story. So they are given -- I think he has $128 million. Now, a lot of it has been spent. Think of this, think of this. The person that spent the least by far is Donald Trump. And I'm in first place by a lot. Is that great? The person that spent the least is Trump. The person that spent the most is Jeb Bush.","Spent $55 million, $55 million and he's down at the bottom of the barrel, practically. Now wouldn't it be nice if we could do that for our country? Spend the least and get the best production. Now, I'm going to be spending a lot. I thought -- again, I'm spending my own money. I'm the only one. I'm self-funded.","But listen to this, I thought I'd be at about $35 million to this point. You know, I'm prepared for it. I don't care. Whatever it costs. I mean, whatever -- hey, look, if I see I'm doing poorly. I'm doing poorly. But you know, we all know that I'm doing well. But I'm expected -- I expected by this time, by like January to be up to about $35 million in expenditures for ads, mostly for advertising, right?","And I spend nothing. No because these -- No, I spend nothing. I spend nothing. To be honest, I spend I think $212,000 and that was only because I like the people. The people in Iowa are great. Some of those radio stations have been so -- you know, they've been nice. I put some ads on the radio stations in Iowa, but I spent $212,000. They've spent $30 million, $40 million, $50 million, $25 million, $28 million.","The money they spent -- and they have no control over it. And you know, these PACs, the money is all being stolen from inside because the consultants are like bloodsuckers. They're 10 times worse than a real estate salesman or broker, 10 times, which is saying pretty bad stuff. So just think of it. So we have a case, where I'm gonna have $35 million spent.","I'm $35 million under budget, is that good? Wouldn't that be nice? And very importantly, I'm doing the best. By far, doing the best because the Fox poll that just came out. We have a couple of them, we have CNN, so good, 36; second place is 16; then you have 9; and 8 and 5 and 2 or 1. I'll tell you they're nice guys.","They're very noncombative. They're so noncombative. I never saw people. They say, please leave and they walk out. I mean, they're very noncombative people. That's nice. You know, the funny thing and I mean this. I could take those three people, the three people. They'll say, it was a massive, massive demonstration.","Three people. And what they do is they put them in little section so you go. But I like that because then the cameras have to follow to see how many people are here. I do. But I really believe if I took those three people and I think they're good unless, they're drugged out, which is a possibility. I mean honestly because then I can't reason with them.","I always say to kids. People say, why are you kids here? I say no drugs, no alcohol, no cigarettes, whatever, from the time they're like two years old. I hope it worked. I think it worked. I mean, I hope. But I say no drugs, no alcohol, no cigarettes. I used to drive them crazy. Ivanka would look, Daddy, you're driving me crazy with that statement.","But I say that. But unless you're drugged out, which is a possibility. But if they're not, I'm telling you. I could sit with those kids and we would talk and all I'm doing is, I want to make our country better. I want to put people back to work. You know, forgetting all about even the applause hold for a second.","I want to put people back to work. We want to make our country strong. We want to create good health care, not Obamacare, which is a disaster, where the premiums are going up 35%, 45%, 55% and it's crashing. It's crashing. And I've explained this to them. I want to take care of our veterans. Our veterans are being treated horribly.","They're being treated horribly. I want to make, I want to make our military so strong, so big, so powerful that we don't have to use it. I don't want to use it. I don't want to use it. I don't want to use it. But what I want is I want people to look at us not like now where General Adriano when he left, recently I saw him on television, he said, we're the least prepared we've been.","And I think he said from inception, from the beginning. But let's say since World War two, World War one, I mean he actually said I think more than that. But he said, we're the least prepared. We are practically ever we're the least prepared ever. At a time when we have to be the most prepared. And if I took these young kids that stood up and they, you know, they take a chance.","They ruin their lives. They get arrested. What's the purpose of it? If I put them in a room and talk to them. Really, I had lunch with them or dinner, and I'd do it. I honestly believe, assuming no substance abuse, which is a possibility because who else would do this. I mean you stand up in a group of 9,000 maniacs that want to kill him, right?","But if -- I really believe I could talk to them say, look, we want to make our country good. We want to bring back spirit. We want to bring back our jobs from places that have been ripping us off. We want to take care of our country. And you go through point by point, whether you're a Democrat, a liberal, a conservative, a Republican, it's all the same.","I mean don't you think that would be a positive thing? I really believe if somebody would give him the message, it would be a positive thing. I really believe that. OK, now you're gonna play. Right? So, so Ford. So they open up a plant. Thank you. That's another friend. You know, it's hard to tell the friendly ones from there.","There's so much enthusiasm in here. That's another one. Thank you. So Ford is gonna build a plant. And I'm saying to myself, how does it help us? Now here's what happens. Let's assume that Hillary becomes president. Oh my God. Oh, she'll be the worst. Is that a president? You saw her the other day, in all fairness.","You saw her the other day. You saw the debates where they hide them in between football games. They put them on crazy. How about the next debate they have? They're putting it against two NFL playoff games so that nobody watches. Let me just tell you, I may win. I may not win. Hillary, that's not a president.","That's not. She's not taking us to -- everything that's been involved in Hillary has been losses. You take a look. Even a race to Obama, she was gonna beat Obama. I don't know who would be worse. I don't know. How does it get worse? But she was gonna beat -- she was favorite to win and she got slung. She lost.","I mean she lost but I watched her the other night. It was hard. It was really hard because there were a lot of other things went better including reading books and reading financial papers, which I actually enjoy reading. But I watched her the other night and I said, this is not a president. Now you can say what you want.","And we can be nice so we don't have to be nice. But the truth is, we have a very important thing happening. If we don't get it right this time. We're not gonna have a country left, folks. We're not gonna have a country. We're not gonna have a country left. So if Hillary were president or Jeb or one of these guys or Rubio, any of them.","First of all, most of them don't know what I'm talking about. They think, oh the Ford, is that wonderful that Ford is moving to Mexico. That's a great thing. By the way, Nabisco, just to make you feel not so lonely in the car business. Nabisco from Chicago just announced that they're moving their big plant from Chicago into Mexico, OK. Mexico, Mexico is becoming the China nearby.","They are taking our business like -- and by the way, I have great relationships with Mexico. I have great relationships with the Mexican people. I have thousands of them that have worked for me over the years. I have unbelievable relationships with Hispanics. I just won a poll in Nevada, where I was number one with the Hispanics, OK? Because I create jobs I create jobs, OK? But so here's the story.","So let's say any one of these politicians, other than me. I mean, honestly, any one of them get elected and they're there. And Ford is you know building this massive plant now. They all know it's a bad thing. They know it's not good. How is it good? We're closing three plants in Michigan to build one in Mexico.","It's not too good. I mean, they're gonna have to do a lot of hard work to convince me. So I would say, I'd devote about 30 seconds to listening to them and then I cut it off because I don't have time. Obama, it was reported today, played 250 rounds of golf and he's gonna be in Hawaii. I think that they say for three weeks.","How can a president -- for three weeks. I don't have time for that. I love golf. I think it's one of the greats but I don't have time. 250 rounds, that's more than a guy who plays on the PGA Tour plays. He played more golf last year than Tiger Woods. No, think of it. We don't have time for this. We don't have time for this.","We have to work. We have to work, OK? He talks about the carbon footprint and then he flies a really old 747 that spews out all sorts of to Hawaii, right? The carbon foot -- what happened to the carbon footprint? So here's the story. So with all of the money they give and it's massive. Yes, thank you. Yes, darling.","Yes. Well she doesn't sound very tough. That's a very weak voice. Go a little louder we can't hear you darling. Wow, that's not a protestor prime, right? So with all of this money that they give. Here's what happens, they go to a Jeb. And they say Mr. President, Ford has moved in, bah, bah, bah. Let's say, he knows it's bad because it's bad.","He'll say, well, that's no good. We don't want them to make that deal. Then he'll get a call from his donors, his special interests, his lobbyists. And they'll say, they helped you. They gave you $5 million, Jeb. You have to let them do it. And you know he's a very weak person so he's going to in two seconds.","You have to let them go in and he'll let them go in. They'll call Hillary. They'll say, Madam President, they gave you millions, they gave you millions of dollars. You can't do anything about that. And she'll say, you're right, I can't. They've been very loyal to me. Not to you, but to her, OK? Because she's 100% -- look, is she crooked or what?","OK? Give me a break. Is she crooked? I mean how crooked is she? How crooked is she? And you have to understand in my prior life, one of the magazines said world class businessmen, which is true. I'm all over the world and I did great, really good. And I get along with everybody. I get along with her. I get along with everybody.","I get along with Democrats. That's my obligation. That's my job. I have to do that. So they say to her, they say, it's bad. We got to stop it. And then she'll be confronted with the special interests, the lobbyists, the donors. And immediately she'll say, all right, let him build. Now here's Trump. Now Trump is president.","Trump, Trump, Trump is now President. Trump. Trump. So President Trump, I owe them all like -- you know, who I owe? I hear -- this is the group I owe. I owe these people. Wow. I owe this group. So I didn't take any of their money. And by the way, you know, it's sort of adverse to what I do. These people are coming up, especially I've been in first place practically since I announced, right?","For like six months, I've been in first place. Do you know how many people have come up? Don, I'd love to contribute to your campaign. I said, I'm not taking money. They said, but we'd love to make a major contribution. Because if I do, you know what's gonna happen. It's just psychologically. Even if it's not a deal or any.","It's just a guy gives you $5 million and he's representing a company or he's representing China or he's a -- you know, you've sort of feel obligated. I still really don't think it. But I'm a very loyal person. So I just do the easy way, don't take it. And it's very hard for me to say no because all my life I take, I take money.","I love money. I take money. Now I'm telling these people, I don't want your money. I don't want your money because I know what happens. So now they come to me and I'll get a call from the head of Ford. Nice guy, by the way. I think, who the hell knows, right? But I think he is. Wrote me a beautiful letter.","And he'll say to me. Mr. President, we're doing a wonderful thing. I said, why is it wonderful that you're building a plant in Mexico? Why can't you build that plant in the United States. Ideally, in Michigan, you know, ideally, I want it in Michigan. But why can't you even if it's anywhere in the United States, right?","But why can't you build that plant in Michigan? Well, bah, bah, bah, bah, bah. After about three seconds, I know it's all nonsense because there's nothing you can give us. And I'll say no, no, no. Here's the story. Here's the story. I'm a free trader, but this is no good for our country. If you build that plant in Mexico, I'm gonna charge you 35% on every car, truck and part that you send into our country.","Every every single one. Every single car, truck and part, we're gonna put a tax of 35%. And I'm a free trader but we can't be stupid traders because what's happening with China is 10 times worse. I mean, we have a trade deficit with China, $500 billion a year. And then I listen to Obama, our trading partner, they're no partner.","They are ripping us and I love China. They pay me a fortune. They buy my apartments. I have them as tenants in my building. I have the largest bank in the world in China. They pay me a lot of rent. How can I dislike China? But they're too smart for our politicians. So here's what happens. So I say, I want 35% tax on every car and every truck and every part that comes into this country.","And he's gonna say, well, we won't do it. Now here's what's probably gonna happen and I have the smartest businessmen in the world. Many of whom are endorsing me. Carl Icahn is endorsing me. A lot of the great ones because they know I'm like smart. This is what I do. So what happens -- but this is too easy.","I don't need any -- but this is too easy. This takes minutes. So what happens is he'll say probably, we can't do that. I'll say don't worry about it. Call me whenever you're ready. Within 24 hours I'll get a call and he'll make one more plea. Mr. President, that's not right. I'll say, 35%. And if you wait another day, it's going to 40%, OK? It's true.","Going to 40%. And as good and as tough and as smart as they are, here's what he's gonna say. He has to. This isn't like 99%. This is 100%. He's gonna say, Mr. President, we're going to build our new plant in the United States. Right here. Well, there's no place. I'd like to see it. But we're going to build our new -- and that's 100%. Now, he may wait a day, he may wait two days.","But that's what's going to happen. All right get him out. Get him out. Get him out. Thank you. No, he's so brave. He's so brave. He's holding up his hands like he's Mike Tyson. He'd never throw a punch. He's so brave. So anybody else is going to do whatever these companies want, I'm not. Because I'm not controlled, I am not controlled by anybody.","I'm doing this to make our country great again. Very simple. Very simple. And your industry in Michigan is going to start up big league again. These car manufacturers, they're gonna build right here now. It's enough. It's enough what's going on. This stupidity. A friend of mine is an excavator and I tell this story and it happened six, seven months ago and he's very depressed.","I said, what's wrong with you? Very good, great excavator, digs foundations and footings for a lot of big buildings and roads and everything else. And he's always ordered Caterpillar tractor stuff. He's always ordered Caterpillar excavators and tractors. So I said to him, why are you upset? He said, the first time in my life Donald, I've ordered Komatsu tractors.","It's a big order. I said, how do you find them? Good. They're not quite as good, but they're good. They're quality equipment. But I never did it before. I've always -- my whole life I've ordered Caterpillar tractors, Caterpillar equipment. He said, but what Japan has done to the yen with their recent devaluations makes it impossible for Caterpillar to compete.","Now he told me this probably almost a year ago now and I've been telling this story. And I've been saying be careful. Look, Caterpillar, look at what's happened to their stock. I mean this guy told me better than any analysts can tell me because that's your customer. And I said, so why did you do it? He said, I owe it to myself, to my family, to my employees, to my company to buy the best stuff I can get for the best price.","And he was very, very upset. First time, in his entire life that that happened. He was very, very upset. Now, they devalue. We have Carolyn Kennedy as our negotiator with Japan. We have political hacks as our negotiators with China. They put these brutal killers in charge. I know these guys. They are brutal, brutal brilliant killers.","And we put political hacks in there. We put Carolyn. She's a nice person. She's my daughter's -- I think she's very nice. She has to be nice. Ivanka likes her so she's nice. Who cares? I don't want her negotiating. I saw it on 60 Minutes. They did a profile on Carolyn Kennedy. Hello. Look at this people.","Well, what a bunch of losers, I tell you. You are a loser. You really are a loser now. Get him out. You know, it's so staged. They put him in different corners. So staged. Really are a loser. Sad. It's sad because we're all here to make America great again. We're not here -- we don't have to listen to this stuff.","But I have to tell you, I see what these guys do and they stage it because they only have a few of them. These guys will make it sound like it's a big deal. There's like three people so far, four people. I'll tell you we should have been doing that for the last seven, eight years. Why didn't we do it? OK? Say what you want about them, but we should have been doing that.","We don't do that. For some reason, we, meaning we collectively, we don't do that. We should have been doing that because what they've done to our country has destroyed our country. They are -- And I'll tell you what. It doesn't have long to go. We're in a big fat bubble. We're going to be up to $21 trillion in debt.","You saw that piece of garbage omnibus that they just passed, which is a disgrace, which is a disgrace. Approved by the Republicans, by the way. I'm more angry with the Republicans than I am with the Democrat. At least you know where they're coming from. But what they just passed is a disgrace. It's a disgrace.","If we're gonna bring our country back and it shouldn't be allowed. And these politicians that get elected by you and everybody else and they go to Washington and then they do a total fold all the time. They're always folding because they're politicians. They're all talk. They're no action. They don't get the job done.","They don't get it done. So anyway, so that's what happened. That's the story on the Ford. It's hard to believe. They're so weak though. Do you noticed? They just walk out. Come with us. Oh, OK. Bah, bah, bah. They're young people. You know what, idealistic -- although he wasn't so young actually. I must say.","So with Ford, they come back. I guarantee you they come back. With Nabisco, the same thing. I don't want people building outside of this country. I want to keep our great people to work. I want to bring jobs back from China. China is ripping us like nobody has ever ripped us. China created the single greatest theft in the history of the world.","They've taken our money. They've taken our jobs. They've rebuilt China. I love China. I love the people. I love what they do for me personally. They're wonderful. But they're too smart, they're too sharp, they're too cunning for our politicians, who are not smart people to handle. And on top of not being smart people, they're totally under the control of people that represent interests that are not good for us. It's very simple.","Don't forget. Don't forget, six months ago, prior to June 16th, I was like the fair haired boy. I gave $350,000 to the Republican governors and so. I was on the other side writing checks. I was like Mr. establishment, can you believe it? Once I do this, I'm not establishment anymore, which I love, I love, I love.","But nobody understands the game. Somebody said, well, have you dealt with politicians? Like, how about all my life I deal with -- that's all I do is I deal with politicians. I got the old post office on Pennsylvania Avenue, probably the most sought after property in the history of the GSA, General Services.","I got it under the Obama administration. Can you believe it? Everybody wanted it. I got it. That means you're really good. I mean, you're really -- and now it's under construction. We're building one of the great hotels of the world. It's under budget, ahead of schedule. It's about a year early. We're gonna be opening in September of next year, of '16. It's a year ahead of schedule.","That's what we have to do. And you know, what? We have to build a wall on our southern border. We have to do it. We have to do it. And it's gonna be a great wall. It's gonna be a real war. Nobody is coming over that wall, folks. Nobody. It's gonna be way, way up there. It's going to be a Trump wall. I always say, I've got to make it great and I've got to even make it beautiful cause someday they will honor me by calling it the Trump wall.","So now we're gonna build a wall. And it's not a big deal. Building a wall is not -- you know, that's not a big deal. When I build 95-story buildings -- let me tell you, walls are easy. Walls are really easy. It's called precast blank. Now in the past, you know, they've wanted walls but they weren't able.","Oh, here we go. I can't believe how easily they leave. I'll tell you, these security people, they're amazing. They just leave. OK. So we're gonna build a wall and we're gonna let people come in, but they're coming in legally. They're coming in legally. Now, if you remember, when I first came up with illegal immigration, oh, did I take trouble.","Rush Limbaugh said, I've never seen any human being take more incoming than Trump. And then I turned out to be right. It turned out to be right. Right? It turned out to be right. And now everybody wants to come to my -- but it's too late for them. Most of them, it's over. It's over. Many of them are over it. Do I hear some noise?","It's so much fun. OK, you can get them out. Yeah. Don't hurt them. Be nice. Now the press is gonna say Trump is soft. That's the problem. He's soft. He's gotten very soft. Yeah, don't hurt him. OK. OK. So let me tell you one other thing because it just has to go with the dealmaking and we need it. We need love.","We need compassion. We need heart. We need great health care. We need a lot of things. But look at the Iran deal, and this just came to me and I've never heard it from anywhere else. Iran made one of the greatest deals ever made in the history of deal making beyond countries. We gave them a $150 billion.","They kept our prisoners, which now they just announced they will begin negotiation for the prisoners. Do you believe this? We could have had them first. They kept our prisoners and they want to now start negotiation and they won a lot and they let us. But we won a lot. It makes me so angry, OK? So angry.","We should have gone in there, three years ago, when this -- You ever see anything take so long as this crazy Iran deal? We should have gone in there three years ago. Say, look, number one, give us back our prisoners. You don't what them. We do. It will set a great tone. Very important. Give us back our prisoners and they would have said no. We get up. We walk.","A day later -- and what we do when we walk, what do we do? We double up the sanctions. We triple up. A day later, within 48 hours, let's say. They call back. OK, we'll give you. That's it. We have a prisoners back. That would have been three years ago. But we have people like John Kerry and people like Barack Obama that are so incompetent.","That deal is a disgrace. So I've been saying this, 24 days for inspection but the 24 days doesn't start till a whole legal process ends and who knows how long that. So they have like this huge long period of time. So they're doing nuclear. And by the time, we get there everything is beautiful. Looks like that floor right there.","Everything's beautiful, painted battleship gray, everything's beautiful. So that's that. Now they have a right to self inspect. How about their bad areas? They don't want us in those areas. Those areas will self inspect. I mean, I can't even talk about this deal. So I've been saying, it's one of the greatest deals ever.","And then about a week and a half ago I started saying, it's not. They made an even greater deal than that. We gave them Iraq. Think of it, the second largest oil reserves in the world. We gave them Iraq. So they got the deal. They're loaded up with cash. They have $150 billion, billion, billion, billion with a B dollars.","But what did we do? We gave them Iraq because when we decapitated Iraq, those two armies, those two militaries were the same. They'd fight for decades. Boom, boom. They go 15 feet back, forth. There was equilibrium in the Middle East. You had a dictator. Who the hell cares? What the hell. I want to build this country.","I want to rebuild America. We spent, look, look, we've spent $4 trillion, maybe $5 trillion. They don't even know what we spent. They used to say and I've been using this number for two years so you know it's a hell of a lot higher. $2 trillion in Iraq. Thousands of our young great people dead. Wounded warriors, who I love all over the place.","You see all over these incredible people. Our most incredible people, the wounded warriors. They're all over. So think of this. Think of this. So we gave them all of this money. Cost 2 -- It's impossible. $2 trillion. This isn't now billions. This is now -- we're into the trillions. Words you never even heard of 10, 12 years ago.","$2 trillion, but the $2 trillion is now probably $3 trillion. And in the Middle East, I guess, we've spent $5 trillion. We could have rebuilt our bridges, our tunnels, our roads, our hospitals, our airports. We could have rebuilt our country. We could have rebuilt our military. We could have taken care of Social Security.","We could have taken care of every. We could have taken care of our veterans, who are treated worse than illegal immigrants, in many cases. So just think about it. So we spent at the time $2 trillion, which is now at least $3 trillion for Iraq. And what's happening? Iran is coming in, second largest oil reserves in the world.","Iran is coming in. They've been fighting for decades and decades. Iran is coming in, walking in and just like you're standing here and sitting here, now everybody standing. That's good. But just like you standing here, they're taking over Iraq. What have we got? We got nothing. And I've been saying for three years, take the oil.","I didn't say bomb the oil. You can do that too. I don't care because we're rebuilding. Exxon Mobile, these guys are so good. Boom, boom, boom, they put it back so fast. But you take the oil and you take the oil. You know, to the victor belong the spoils, right? You take the oil. You don't just leave it. We're the only country in the world -- You know, when I was young, when I was very young, we never lost a war.","They always used to say, my history teacher, United States has never lost a war. Now, we never win a war. We can't beat anybody. We can't beat anybody. We can't beat ISIS. I watch on television, they have a general. Well, what do you think about ISIS? Do you think we can -- I don't know. It's going to be a very tough battle.","I'm saying, where is General Patton? I want General Patton. Where is General MacArthur? Where is he. No, I watched this general on television saying that ISIS is a tough battle. Then I hear one of the reasons they're not doing the oil is Obama doesn't want to infect the environment because the oil is gonna pollute the environment.","This man there is something wrong with him. There is something wrong with him. So I said, take the oil. Take the oil. And you know what we do with the oil? We take the oil and we give some to the soldiers that have been so badly hurt. We give some to those wounded warriors. We give some to the parents, who have lost soldiers, sons and daughters, in that war.","And you're talking about peanuts compared to the values. You're talking about peanuts and you go in and you take the oil and you'd circle it and you make a lot of money. And you use it for good causes and you give some to Iraq, if the government remains. I mean, it's horrible government. Look, it's so corrupt.","It's such a corrupt government. You know that. I mean ISIS formed -- the reason ISIS formed, they wouldn't let them in on the deal. So they formed ISIS and ISIS turned out to be a hell of a lot tougher than the Iraqi government. So who has the oil now? So -- and who takes the oil? You know who the number one buyer of the oil is? China.","China. They haven't fired a bullet. They haven't spent $0.10. They're buying the oil. You know who's taking the oil in Libya? China. China smart. I'm not angry with them. I'm angry with our people. If I get elected president, those days are over. We're gonna become so successful again. We're gonna become so successful again.","You know, there's an expression about the American Dream, remember? And I always talk, the American Dream, wonderful American Dream. The truth is the American Dream is dead, but I'm gonna make it bigger and better and stronger than ever before, ever before. Bigger and better and stronger. We're gonna do something.","So I want to tell you, we've had a number of rallies. Yes. Thank you, darling. Thank you. We've had a number of rallies in Michigan. They've been incredible. But the people, whether it's Michigan or anywhere else, everybody we're all in the same thing. You know, they used to have an expression, the silent majority is back, right?","The silent majority. This isn't really a silent majority anymore, folks. This is a very very aggressive, very very noisy loud majority. Very very noisy, very very loud. So I want to tell you, I'm leading in every single poll. I'm leading. And I don't know, look, we have to get out and vote and all of that stuff.","We have to do it. You know, the last election people were not inspired. They didn't get out and vote. And if they would have voted, you would have had much better. But they didn't get out and vote. I think this time they're really inspired. Nobody has ever had crowds like this. You know, they say the crowds -- the biggest crowds anyone's ever seen.","They say these are crowds like the night before the election. You have a crowd like this maybe and I doubt that. And they're getting bigger and stronger and more and more vocal. We are going to make our country so strong and so powerful and we are going to make our 1jM8W_y-tRE"],"text":" And you know, I brought him here. So the poll comes along, every single poll, there are 11 of them right here. See the name, Trump on top? By keeping them small. Small. But every single poll that they took for the debate, who won the debate? Who won? And it's sort of interesting because the Fox poll, which came out and it's a big one and a good one, which came out three or four nights after the debate had me up 11 points, 11. And I was already leading. And then I said, I guess, I won the debate, right folks? You know, so we -- they had 11 polls and they had Drudge, who's a great guy, 46%. That's at 46% of the vote out of 15 people. That's a lot. I would honestly take right now 46% of three people, but this is 15 people. By the way, sadly, I guess you heard, Lindsey Graham left the race tonight. Sad, very sad. I'm extremely said. He was nasty to me, wasn't he? Nasty. You see how many -- everybody that goes against me is like X, X. So we started off with 17. I won't say how many left but a lot of people are starting to leave. They're going to start to leave. But everybody that's going -- wouldn't it be nice -- that should happen with our country. Everybody goes against us, down the tubes. Sort of interesting, right? Sort of interesting. So I'll go through fast. So this is on the debate. This -- The night of the debate, hundreds and hundreds of thousands of people voted. Who was number one in the debate? I was. I love you too. So who is number one? Trump. Drudge, 46%. Time magazine. They didn't even give me the man of the year or the person of the year. They should have. That's why it's heading down the tubes, folks. They gave it to a woman, who has not done the right thing in German. It's not doing too well over there. Nice woman. I like her. I like her. I better like here. I may have to deal with it. Look, hey Putin likes me. I want her to like me too, right? Right? You know, it's sort of funny. So Putin out of nowhere -- I never met Putin. But we were on 60 Minutes together. Not together, but together, meaning I had a segment, he had a segment. We got tremendous ratings on that show. I took full credit. I said, if it wasn't for me, they wouldn't. But We didn't meet. So we were stable mates sort of sense, right? It was he and I on 60 Minutes like five, six weeks ago, and it was great. And he came out of nowhere two days ago and he said, Trump is brilliant. He's great. He's the leader. He's the leader of the parties. And he said nice things. I didn't know. I never met him. So I didn't know. And he said nice things. All of a sudden, I'm hearing things like, oh, isn't it terrible that Putin is saying that. That's not terrible. That's good. That's like a good thing, not a bad thing. He can't stand Obama. Obama can't stand him. They're always fighting. Wouldn't it be nice if we could get along like with people? You know? It's unbelievable. No, no. Think of it, you know, it's Russia after all. Somebody said, are you at all offended that he said nice things about you? I said, no, no. And they said, oh, Trump should have been much nastier. That's terrible. And then they said, you know, he's killed reporters and I don't like that. I'm totally against that. By the way, I hate some of these people, but I'd never kill him. I hate him. No, I think -- no, these people, honestly, I'll be honest, I'll be honest. I would never kill them. I would never do that. Let's say, no I wouldn't. I would never kill them, but I do hate him and some of them are such lying, disgusting people. It's true. It's true. But I would never kill them and anybody that does I think would be despicable. But you know, nobody said -- they say, he killed reporters. I said, really? He says, he didn't. Other people say he didn't. Who did he kill? Well, we don't know but we hear that. I said, tell me who did he kill? And I go through this whole thing. It would be so great if we could get Russia on our side and other countries on our side and knock the hell out of ISIS and knock them, right? Right? So stupid. Just knock the living hell out of them. Remember I said, take the oil, right? For years I've been saying that. For years I've been and -- Look, we have people running this country, who are stupid, who are stupid. I went to an Ivy League school. I'm very highly educated. I went to the best business school in the world, the Wharton School of Finance. Somebody said, he's plainspoken. I don't have to be plainspoken. I have like this incredible vocabulary. But honestly, how can I describe our leaders better than the words stupid? Really, right? There's no word. There's no word. You know, I used to say grossly incompetent. But stupid stronger, isn't it? I don't know. You look -- Bye bye. Bye bye. Hard to believe. USA. USA. USA. USA. So unbelievable. But I'm really trying to be really neutral. To one guy I said, get him out of here now. And they said the next day, it was horrible, horrible the way Trump talked. I mean the guy was a bad guy. It was terrible what he was doing. But I was very rough. I said get him out of here. OK, so the next day, they come out and they say, that was horrible the way the Trump -- the next day, I had another big one, 21,000 people. I had one guy. One guy was like he went a little crazy. And I was very nice I said, please remove him but be very nice. And if he wants to come back, let him. You know what they did the next? So the first day, he was terrible. He was rough. The second day -- I was going to tell you the second day but you know. Do you ever noticed how few it is and they will make it tomorrow sound like this was the biggest -- we had 9,000 or 10,000 people in here. They'll talk about one guy or two guys -- headline, Trump had tickets. They had like three people. There was nobody outside. No, no. They set a site, a picket area. Said, nobody showed up. They will talk about the guy that just got taken out in about two seconds. So what happened, I was rough with the first guy. Then the second, I was really not because I got a lot of bad press that I was too rough. I wasn't nice. So the second guy was -- the second event, I said, be really nice to him. Please, don't hurt him, please. And he was a bad guy. He was a rough guy, who's swinging at them. He was -- you know, they were in fistfights. I mean I'm telling these guys to be nice. In the meantime, I'm standing up here. They have to take him on, right? But I'm saying, please, be gentle. If he'd like to come back later -- I was so nice. So the next day, Trump was off his game. He was very, very weak. So you can't win with these people. So you're too tough, you're too this, you're too that. They're bad people. I'll tell you the only thing I love -- in fact, sometimes I'm going to do it myself. They never turn the camera, right? I've told you. You've heard this. They never turn the camera around. The thing I like about a guy like that or a guy like wherever the hell, the cameras move. They won't turn the cameras. So when I go home. I'm proud of -- nobody gets audiences like I getting. Number one with the heart, right? Nobody. Nobody gets audience. We go, I get 35,000 in Mobile Alabama. I get 20,000. I mean, we get tremendous audiences. And Dallas was incredible, 21,000 people. Every place we go, it's packed. It's sold out. It's all guided by the size of the venue. Look at this venue, the biggest -- I don't know when it was built. When was this venue built? Where's the owner? He was very nice. We gave -- he gave me a nice discount. Where's the owner? Where is the owner? We beat the hell out of him, but he's a good guy. He gave us a pretty cheap price. I must tell you. Where is he? Anyway. Well -- however old it is. I mean we broke the record and I don't have a guitar. No guitar, you know? Elton John said, you get the biggest crowds in the world for a guy without a guitar, meaning you know without music, which is pretty good. So we're having an amazing time. The subject is a tough subject because our country is doing poorly. We don't win. We're being laughed out all over the world. We're soft. We're weak. We have guys like Bergdahl, who get caught -- I mean he left. He was a deserter. He was a deserter. He was a dirty rotten deserter. And we lost five and maybe six young great brilliant wonderful people trying to bring him back. They were killed, right? So he deserts. Now 60 years ago, they would have been shot within a very short period of time, right? Twenty five years ago, probably shot. Ten years ago, long-term in prison. Now I hear he's going to get off scratch free, why? No no. Think of it. And then we traded this guy who as far as I'm concerned, we could take him, drop him right back in the middle. We traded -- Hello. Hey cameras, turn around there's another guy up there. The only time the camera will move is to see somebody like bye bye. That was the same guy fell as he came back in for seconds. What? No but it's sort of amazing. I have to finish the thing. So they never show the crowds. They always show my face and I have a big ego. I like, I like when they -- but my wife said, how many people were at the event? Oh, it was packed. Oh. I said, what do you think? Well, I heard big noise but they only showed your face. They never move the camera. So I love your face too. He's a handsome guy. So I love him. We're all in love. Every place I go, it's a love fest. I'm telling you folks, there's a movement going on. We're tired of what's happening. We're gonna take our country back. We're gonna take it back. We're gonna take it back. But I want the cameras to span the room. Go ahead fellas, watch. They don't turn them. They don't turn them. They don't turn them. Go ahead turn them. Look, turn the camera. Go ahead, turn the camera ma'am. Turn the camera. You with the blond hair, turn the camera. Show the room. Go ahead. They don't turn them. What about hey, you in the center, why don't you turn your camera? Show them how many people come to these rallies. Turn them. Go ahead. Turn them. Go ahead. They did? Thank you. That's the first time they've ever done that. Thank you. That's the first time. Amazing, amazing. Because what's going on is amazing and I'm telling you, it's a love fest. A friend of mine, very successful guy. He said, how many people tonight? I said, I don't know. It holds like 7,500. I think they have like 10,000. He said, what do you do? I said, they stand in the halls. They stand all over the place. There are people outside that can't get in. Shall we wait a little while and let them get in? I don't think so, right? But no, they have people outside. They can't get in. And he said, how do you do that? Because I don't have a teleprompter, right? No teleprompter, right? I don't want a teleprompter. You speak from the heart and the brain. You got a -- the brain, very important. But he said, how do you do that? And here's a guy, very, very rich, very successful guy. I said, you speak and it's easy because there's so much love in the room. It really is true. There is love in every room, whether I'm in Oklahoma, whether I'm in Dallas, whether I'm in Iowa, whether I go into I mean North Carolina, South Carolina. New Hampshire is through the roof. There's love. I'm telling you folks, there's love in the room. We are going to turn this around. We're gonna get this country going again. There's love in the room. And you see Hillary -- I mean, did you watch that? What happened to her? She's terrible. She's terrible. Donald Trump is on video and ISIS is using him on the video to recruit. And it turned out to be a lie. She's a liar. No, it turned out to be a lie. Turned out to be a lie. And the last person that she wants to run against is me. Believe me. Believe me. You know, I was just with somebody from ABC. I won't mention him. And he said, oh the Hillary camp said they'd love to run against Trump. Of course, they're gonna say -- that's what they want to say. I mean, it's gonna be very -- ask Jeb Bush if he enjoys running against me. Seriously, ask him. In all fairness, ask Lindsey Graham. Did he enjoy running against Trump? Ask Perry, Governor Perry. Nice guys. All nice guys. Ask Bobby Jindal. He's back in Louisiana, which is a great state, by the way. And they don't like him very much anymore over there. Ask all of these guys that have gone out, do they enjoy running against Trump? They don't enjoy it. They don't enjoy it. I enjoy it. They don't enjoy it. I mean people have said that Jeb Bush -- you know, he's low energy. People have said that if I, if I didn't run, this thing would have been over already. He would had it. Why? For what reason? I mean, I don't know why. But they say, he would have had it. He's gonzo. He's down to 2%. And you saw they gave him during the debates a couple of soundbites. He goes like this, you could see it right here. He memorized it. Mr. Trump, I mean Donald, uh, uh. And I said, Jeb, I've got 42. You've got 2. We started off, you were here, I was here always in the center. Now you're way down there and the next time you won't even be on the stage. Look, I love running against Hillary. I love running against her. Are you with me or against me? Oh, he's with me. Oh, oh, oh. You know, I'm looking at this guy and he's going crazy and I thought he was a protester. They'll say, he was a protester. But he's got he's got a beautiful red, make America great hat on. Make America great, make America great again. OK, we like you. We're not gonna throw you out, OK? No, I see this guy, looks like a nice guy. He's going crazy but he's on our side, right? You're on our side. I like that. So look at this, the press just came out of the cage. They just came out of the cage. So, so Hillary is gonna get beaten, but I haven't started with Hillary yet. What happened to her? I'm watching the debate and she disappeared. Where did she go? Where did she go? I thought she quit. I thought she gave up. Where did she go? Where did Hillary go? They had to start the debate without her. Phase two. Why. I know where she went. It's disgusting. I don't want to talk about. It's too disgusting. Don't say it. It's disgusting. Let's not -- we want to be very, very straight up, OK? But I thought that -- wasn't that a weird deal? We're ready to start. They were looking. They gave her every benefit of the doubt because you know, it's ABC and she practically owns ABC. She really does. I mean George Stephanopoulos interviewed me the other day. It was terrible. It was like it was one of the great interviews. Did anybody see that interview? But you know, he's a big, he's a big Hillary fan. Tonight, I was interviewed by another Hillary fan from ABC. He's all right. He's OK. Relax, relax, relax. Take it easy. He's very committed. Relax. He's actually a Trump guy. He's just -- he's got a lot of energy. OK. OK. OK. Sit down. Come on, relax, relax. He's on our side. Who would know it? But he's on our side, I think. So I look forward to running against Hillary. We're gonna beat Hillary. You know what happened? I backed John McCain. He lost. And that was a tough one in all fairness because I would say things weren't exactly going great. But he lost. And then I backed Mitt Romney. He should have won. He should have won. That was a race. We had a failed president and that was the race that should have been won and it should have been won easily. And something happened. He went away, right? Oh don't hurt him. Don't hurt him. Be very nice. Be very nice. Yeah, be nice to him. Don't hurt him. See how nice I'm being. I'm only doing it for them you know that. Don't hurt him. Tell me -- I love you too man. Look at you, how handsome you are. Look, is there more fun than a Trump rally? Is there more fun? No tax, no nothing. And everyone says, oh free trade. I'm a free trader. I love free trade. But it's gotta be smart trade. They can't take our jobs, take our base. They can't take, they can't take our money and then you get accused, oh, he's not a free trader. No, no. It's got to be fair. They can't come in and take your factories and have cars made in Mexico and have cars made in Japan and have cars made all over the place except here. And you have your closed plants all over the place, and you guys are looking for jobs. It's a disgrace. And by the way, I'll tell you the one big thing that really helps me now. You are really making great cars now. That's really helps me because for a while it was getting a little bit sticky there, right? It was getting a little bit little -- a little bit sticky. But you're making great cars. And I'll tell you just a couple of things I always talk about. Has anyone heard what I said about the Ford company, Ford? Has anyone -- I tell that story, you heard it. Has anyone heard that story? Yes. Do you want to hear it again? OK, I'll tell you. So politicians are controlled by their donors and special interests and lobbyists. That's they control. Companies pay these lobbyists hundreds of thousands of dollars a month, even millions of dollars a month and they go in and they give Bush and they give -- look, I don't want to get involved. Rubio, this one, this one, this one, this one and everybody. Except me. I'm the only one that's self funding. I'm the only one. Oh, it's the only one. I'm the only one. They gave Hillary a fortune. They're all giving these people. The insurance companies, the car companies, other countries, by the way. How do you honestly think? Look, these aren't stupid people. How do you honestly think that China does so well? Is it because we're so stupid? And we are. But do you think they're so stupid? They're not that stupid. China does well. They have so many lobbyists. They have so many people representing their interests. Well, it's just, it's just I can't believe that it can happen. What's gonna happen is this and I tell the story of Ford. Ford is now building a $2.5 billion plant in Mexico, right? We know that, right? No, no, think of it. Now you guys know the automobile business better than anybody, better than I do or ever will. All I know is I know how to keep, you know, people working because nobody -- you know, I have created tens of thousands of jobs over my lifetime. I'm really good at it. I'm really good at it. So that's what I know. But you know the car industry. So Ford, good company. I like Ford. In fact, the president wrote me a beautiful letter talking about well, you know, it wasn't that bad. But he hardly mentioned what he was doing. He said, you know, how well the company -- he didn't want to mention this. So Ford spending $2.5 billion. That's the biggest point. Can you imagine a one story plant $2.5 billion. That's a lot. That's a big plant, right? And it's gonna be in Mexico and they're gonna build trucks, cars and parts. And they're gonna make these things and they're gonna ship them all over maybe the world. I don't know. I don't care about the world. But they're gonna ship them into this country, no tax, nothing. Now, I'm all for it if we get something. We don't get anything. What do we get for it? The Wharton School of Finance, got to get some. We get nothing. We get nothing. We lose plants. They close your plants. And you're one of the -- I tell about the Ford plant. But usually, I'm not in Michigan. Usually, I'm someplace else where they care less about cars. They care about other things, right? Here, we care seriously about cars, right? We like cars, right? So, so Ford, $2.5 billion, they gonna build a plant. They're gonna make these cars. They're gonna be fine. They're gonna ship them in. No tax, nothing. Where do we benefit other than -- what happens is, you're closing plants, all over, mostly Michigan, but you're closing plants. Now Tennessee had a problem because Tennessee was all set to get one of the big plants. One of the foreign companies was coming in. They're all set. The deal was ready to be inked. And all of a sudden, boom, it was announced they're going to Mexico. Mexico is going to become the car capital of the world. You better be careful. Watch. Not with me as president. It's not, by the way. Not with me. Not with me. So here's what happened. So Jeb Bush and Hillary and others -- I don't even know why I mentioned Jeb. You know what happens is this. Look, it's sad. It's very sad. His family is so ashamed. Look, sad. No you know why I don't like it? Spending millions of dollars of advertising on me, negative ads on me. He's got to get through about seven other guys before it gets to me. Why isn't he spending on other people? So here's the story. So they are given -- I think he has $128 million. Now, a lot of it has been spent. Think of this, think of this. The person that spent the least by far is Donald Trump. And I'm in first place by a lot. Is that great? The person that spent the least is Trump. The person that spent the most is Jeb Bush. Spent $55 million, $55 million and he's down at the bottom of the barrel, practically. Now wouldn't it be nice if we could do that for our country? Spend the least and get the best production. Now, I'm going to be spending a lot. I thought -- again, I'm spending my own money. I'm the only one. I'm self-funded. But listen to this, I thought I'd be at about $35 million to this point. You know, I'm prepared for it. I don't care. Whatever it costs. I mean, whatever -- hey, look, if I see I'm doing poorly. I'm doing poorly. But you know, we all know that I'm doing well. But I'm expected -- I expected by this time, by like January to be up to about $35 million in expenditures for ads, mostly for advertising, right? And I spend nothing. No because these -- No, I spend nothing. I spend nothing. To be honest, I spend I think $212,000 and that was only because I like the people. The people in Iowa are great. Some of those radio stations have been so -- you know, they've been nice. I put some ads on the radio stations in Iowa, but I spent $212,000. They've spent $30 million, $40 million, $50 million, $25 million, $28 million. The money they spent -- and they have no control over it. And you know, these PACs, the money is all being stolen from inside because the consultants are like bloodsuckers. They're 10 times worse than a real estate salesman or broker, 10 times, which is saying pretty bad stuff. So just think of it. So we have a case, where I'm gonna have $35 million spent. I'm $35 million under budget, is that good? Wouldn't that be nice? And very importantly, I'm doing the best. By far, doing the best because the Fox poll that just came out. We have a couple of them, we have CNN, so good, 36; second place is 16; then you have 9; and 8 and 5 and 2 or 1. I'll tell you they're nice guys. They're very noncombative. They're so noncombative. I never saw people. They say, please leave and they walk out. I mean, they're very noncombative people. That's nice. You know, the funny thing and I mean this. I could take those three people, the three people. They'll say, it was a massive, massive demonstration. Three people. And what they do is they put them in little section so you go. But I like that because then the cameras have to follow to see how many people are here. I do. But I really believe if I took those three people and I think they're good unless, they're drugged out, which is a possibility. I mean honestly because then I can't reason with them. I always say to kids. People say, why are you kids here? I say no drugs, no alcohol, no cigarettes, whatever, from the time they're like two years old. I hope it worked. I think it worked. I mean, I hope. But I say no drugs, no alcohol, no cigarettes. I used to drive them crazy. Ivanka would look, Daddy, you're driving me crazy with that statement. But I say that. But unless you're drugged out, which is a possibility. But if they're not, I'm telling you. I could sit with those kids and we would talk and all I'm doing is, I want to make our country better. I want to put people back to work. You know, forgetting all about even the applause hold for a second. I want to put people back to work. We want to make our country strong. We want to create good health care, not Obamacare, which is a disaster, where the premiums are going up 35%, 45%, 55% and it's crashing. It's crashing. And I've explained this to them. I want to take care of our veterans. Our veterans are being treated horribly. They're being treated horribly. I want to make, I want to make our military so strong, so big, so powerful that we don't have to use it. I don't want to use it. I don't want to use it. I don't want to use it. But what I want is I want people to look at us not like now where General Adriano when he left, recently I saw him on television, he said, we're the least prepared we've been. And I think he said from inception, from the beginning. But let's say since World War two, World War one, I mean he actually said I think more than that. But he said, we're the least prepared. We are practically ever we're the least prepared ever. At a time when we have to be the most prepared. And if I took these young kids that stood up and they, you know, they take a chance. They ruin their lives. They get arrested. What's the purpose of it? If I put them in a room and talk to them. Really, I had lunch with them or dinner, and I'd do it. I honestly believe, assuming no substance abuse, which is a possibility because who else would do this. I mean you stand up in a group of 9,000 maniacs that want to kill him, right? But if -- I really believe I could talk to them say, look, we want to make our country good. We want to bring back spirit. We want to bring back our jobs from places that have been ripping us off. We want to take care of our country. And you go through point by point, whether you're a Democrat, a liberal, a conservative, a Republican, it's all the same. I mean don't you think that would be a positive thing? I really believe if somebody would give him the message, it would be a positive thing. I really believe that. OK, now you're gonna play. Right? So, so Ford. So they open up a plant. Thank you. That's another friend. You know, it's hard to tell the friendly ones from there. There's so much enthusiasm in here. That's another one. Thank you. So Ford is gonna build a plant. And I'm saying to myself, how does it help us? Now here's what happens. Let's assume that Hillary becomes president. Oh my God. Oh, she'll be the worst. Is that a president? You saw her the other day, in all fairness. You saw her the other day. You saw the debates where they hide them in between football games. They put them on crazy. How about the next debate they have? They're putting it against two NFL playoff games so that nobody watches. Let me just tell you, I may win. I may not win. Hillary, that's not a president. That's not. She's not taking us to -- everything that's been involved in Hillary has been losses. You take a look. Even a race to Obama, she was gonna beat Obama. I don't know who would be worse. I don't know. How does it get worse? But she was gonna beat -- she was favorite to win and she got slung. She lost. I mean she lost but I watched her the other night. It was hard. It was really hard because there were a lot of other things went better including reading books and reading financial papers, which I actually enjoy reading. But I watched her the other night and I said, this is not a president. Now you can say what you want. And we can be nice so we don't have to be nice. But the truth is, we have a very important thing happening. If we don't get it right this time. We're not gonna have a country left, folks. We're not gonna have a country. We're not gonna have a country left. So if Hillary were president or Jeb or one of these guys or Rubio, any of them. First of all, most of them don't know what I'm talking about. They think, oh the Ford, is that wonderful that Ford is moving to Mexico. That's a great thing. By the way, Nabisco, just to make you feel not so lonely in the car business. Nabisco from Chicago just announced that they're moving their big plant from Chicago into Mexico, OK. Mexico, Mexico is becoming the China nearby. They are taking our business like -- and by the way, I have great relationships with Mexico. I have great relationships with the Mexican people. I have thousands of them that have worked for me over the years. I have unbelievable relationships with Hispanics. I just won a poll in Nevada, where I was number one with the Hispanics, OK? Because I create jobs I create jobs, OK? But so here's the story. So let's say any one of these politicians, other than me. I mean, honestly, any one of them get elected and they're there. And Ford is you know building this massive plant now. They all know it's a bad thing. They know it's not good. How is it good? We're closing three plants in Michigan to build one in Mexico. It's not too good. I mean, they're gonna have to do a lot of hard work to convince me. So I would say, I'd devote about 30 seconds to listening to them and then I cut it off because I don't have time. Obama, it was reported today, played 250 rounds of golf and he's gonna be in Hawaii. I think that they say for three weeks. How can a president -- for three weeks. I don't have time for that. I love golf. I think it's one of the greats but I don't have time. 250 rounds, that's more than a guy who plays on the PGA Tour plays. He played more golf last year than Tiger Woods. No, think of it. We don't have time for this. We don't have time for this. We have to work. We have to work, OK? He talks about the carbon footprint and then he flies a really old 747 that spews out all sorts of to Hawaii, right? The carbon foot -- what happened to the carbon footprint? So here's the story. So with all of the money they give and it's massive. Yes, thank you. Yes, darling. Yes. Well she doesn't sound very tough. That's a very weak voice. Go a little louder we can't hear you darling. Wow, that's not a protestor prime, right? So with all of this money that they give. Here's what happens, they go to a Jeb. And they say Mr. President, Ford has moved in, bah, bah, bah. Let's say, he knows it's bad because it's bad. He'll say, well, that's no good. We don't want them to make that deal. Then he'll get a call from his donors, his special interests, his lobbyists. And they'll say, they helped you. They gave you $5 million, Jeb. You have to let them do it. And you know he's a very weak person so he's going to in two seconds. You have to let them go in and he'll let them go in. They'll call Hillary. They'll say, Madam President, they gave you millions, they gave you millions of dollars. You can't do anything about that. And she'll say, you're right, I can't. They've been very loyal to me. Not to you, but to her, OK? Because she's 100% -- look, is she crooked or what? OK? Give me a break. Is she crooked? I mean how crooked is she? How crooked is she? And you have to understand in my prior life, one of the magazines said world class businessmen, which is true. I'm all over the world and I did great, really good. And I get along with everybody. I get along with her. I get along with everybody. I get along with Democrats. That's my obligation. That's my job. I have to do that. So they say to her, they say, it's bad. We got to stop it. And then she'll be confronted with the special interests, the lobbyists, the donors. And immediately she'll say, all right, let him build. Now here's Trump. Now Trump is president. Trump, Trump, Trump is now President. Trump. Trump. So President Trump, I owe them all like -- you know, who I owe? I hear -- this is the group I owe. I owe these people. Wow. I owe this group. So I didn't take any of their money. And by the way, you know, it's sort of adverse to what I do. These people are coming up, especially I've been in first place practically since I announced, right? For like six months, I've been in first place. Do you know how many people have come up? Don, I'd love to contribute to your campaign. I said, I'm not taking money. They said, but we'd love to make a major contribution. Because if I do, you know what's gonna happen. It's just psychologically. Even if it's not a deal or any. It's just a guy gives you $5 million and he's representing a company or he's representing China or he's a -- you know, you've sort of feel obligated. I still really don't think it. But I'm a very loyal person. So I just do the easy way, don't take it. And it's very hard for me to say no because all my life I take, I take money. I love money. I take money. Now I'm telling these people, I don't want your money. I don't want your money because I know what happens. So now they come to me and I'll get a call from the head of Ford. Nice guy, by the way. I think, who the hell knows, right? But I think he is. Wrote me a beautiful letter. And he'll say to me. Mr. President, we're doing a wonderful thing. I said, why is it wonderful that you're building a plant in Mexico? Why can't you build that plant in the United States. Ideally, in Michigan, you know, ideally, I want it in Michigan. But why can't you even if it's anywhere in the United States, right? But why can't you build that plant in Michigan? Well, bah, bah, bah, bah, bah. After about three seconds, I know it's all nonsense because there's nothing you can give us. And I'll say no, no, no. Here's the story. Here's the story. I'm a free trader, but this is no good for our country. If you build that plant in Mexico, I'm gonna charge you 35% on every car, truck and part that you send into our country. Every every single one. Every single car, truck and part, we're gonna put a tax of 35%. And I'm a free trader but we can't be stupid traders because what's happening with China is 10 times worse. I mean, we have a trade deficit with China, $500 billion a year. And then I listen to Obama, our trading partner, they're no partner. They are ripping us and I love China. They pay me a fortune. They buy my apartments. I have them as tenants in my building. I have the largest bank in the world in China. They pay me a lot of rent. How can I dislike China? But they're too smart for our politicians. So here's what happens. So I say, I want 35% tax on every car and every truck and every part that comes into this country. And he's gonna say, well, we won't do it. Now here's what's probably gonna happen and I have the smartest businessmen in the world. Many of whom are endorsing me. Carl Icahn is endorsing me. A lot of the great ones because they know I'm like smart. This is what I do. So what happens -- but this is too easy. I don't need any -- but this is too easy. This takes minutes. So what happens is he'll say probably, we can't do that. I'll say don't worry about it. Call me whenever you're ready. Within 24 hours I'll get a call and he'll make one more plea. Mr. President, that's not right. I'll say, 35%. And if you wait another day, it's going to 40%, OK? It's true. Going to 40%. And as good and as tough and as smart as they are, here's what he's gonna say. He has to. This isn't like 99%. This is 100%. He's gonna say, Mr. President, we're going to build our new plant in the United States. Right here. Well, there's no place. I'd like to see it. But we're going to build our new -- and that's 100%. Now, he may wait a day, he may wait two days. But that's what's going to happen. All right get him out. Get him out. Get him out. Thank you. No, he's so brave. He's so brave. He's holding up his hands like he's Mike Tyson. He'd never throw a punch. He's so brave. So anybody else is going to do whatever these companies want, I'm not. Because I'm not controlled, I am not controlled by anybody. I'm doing this to make our country great again. Very simple. Very simple. And your industry in Michigan is going to start up big league again. These car manufacturers, they're gonna build right here now. It's enough. It's enough what's going on. This stupidity. A friend of mine is an excavator and I tell this story and it happened six, seven months ago and he's very depressed. I said, what's wrong with you? Very good, great excavator, digs foundations and footings for a lot of big buildings and roads and everything else. And he's always ordered Caterpillar tractor stuff. He's always ordered Caterpillar excavators and tractors. So I said to him, why are you upset? He said, the first time in my life Donald, I've ordered Komatsu tractors. It's a big order. I said, how do you find them? Good. They're not quite as good, but they're good. They're quality equipment. But I never did it before. I've always -- my whole life I've ordered Caterpillar tractors, Caterpillar equipment. He said, but what Japan has done to the yen with their recent devaluations makes it impossible for Caterpillar to compete. Now he told me this probably almost a year ago now and I've been telling this story. And I've been saying be careful. Look, Caterpillar, look at what's happened to their stock. I mean this guy told me better than any analysts can tell me because that's your customer. And I said, so why did you do it? He said, I owe it to myself, to my family, to my employees, to my company to buy the best stuff I can get for the best price. And he was very, very upset. First time, in his entire life that that happened. He was very, very upset. Now, they devalue. We have Carolyn Kennedy as our negotiator with Japan. We have political hacks as our negotiators with China. They put these brutal killers in charge. I know these guys. They are brutal, brutal brilliant killers. And we put political hacks in there. We put Carolyn. She's a nice person. She's my daughter's -- I think she's very nice. She has to be nice. Ivanka likes her so she's nice. Who cares? I don't want her negotiating. I saw it on 60 Minutes. They did a profile on Carolyn Kennedy. Hello. Look at this people. Well, what a bunch of losers, I tell you. You are a loser. You really are a loser now. Get him out. You know, it's so staged. They put him in different corners. So staged. Really are a loser. Sad. It's sad because we're all here to make America great again. We're not here -- we don't have to listen to this stuff. But I have to tell you, I see what these guys do and they stage it because they only have a few of them. These guys will make it sound like it's a big deal. There's like three people so far, four people. I'll tell you we should have been doing that for the last seven, eight years. Why didn't we do it? OK? Say what you want about them, but we should have been doing that. We don't do that. For some reason, we, meaning we collectively, we don't do that. We should have been doing that because what they've done to our country has destroyed our country. They are -- And I'll tell you what. It doesn't have long to go. We're in a big fat bubble. We're going to be up to $21 trillion in debt. You saw that piece of garbage omnibus that they just passed, which is a disgrace, which is a disgrace. Approved by the Republicans, by the way. I'm more angry with the Republicans than I am with the Democrat. At least you know where they're coming from. But what they just passed is a disgrace. It's a disgrace. If we're gonna bring our country back and it shouldn't be allowed. And these politicians that get elected by you and everybody else and they go to Washington and then they do a total fold all the time. They're always folding because they're politicians. They're all talk. They're no action. They don't get the job done. They don't get it done. So anyway, so that's what happened. That's the story on the Ford. It's hard to believe. They're so weak though. Do you noticed? They just walk out. Come with us. Oh, OK. Bah, bah, bah. They're young people. You know what, idealistic -- although he wasn't so young actually. I must say. So with Ford, they come back. I guarantee you they come back. With Nabisco, the same thing. I don't want people building outside of this country. I want to keep our great people to work. I want to bring jobs back from China. China is ripping us like nobody has ever ripped us. China created the single greatest theft in the history of the world. They've taken our money. They've taken our jobs. They've rebuilt China. I love China. I love the people. I love what they do for me personally. They're wonderful. But they're too smart, they're too sharp, they're too cunning for our politicians, who are not smart people to handle. And on top of not being smart people, they're totally under the control of people that represent interests that are not good for us. It's very simple. Don't forget. Don't forget, six months ago, prior to June 16th, I was like the fair haired boy. I gave $350,000 to the Republican governors and so. I was on the other side writing checks. I was like Mr. establishment, can you believe it? Once I do this, I'm not establishment anymore, which I love, I love, I love. But nobody understands the game. Somebody said, well, have you dealt with politicians? Like, how about all my life I deal with -- that's all I do is I deal with politicians. I got the old post office on Pennsylvania Avenue, probably the most sought after property in the history of the GSA, General Services. I got it under the Obama administration. Can you believe it? Everybody wanted it. I got it. That means you're really good. I mean, you're really -- and now it's under construction. We're building one of the great hotels of the world. It's under budget, ahead of schedule. It's about a year early. We're gonna be opening in September of next year, of '16. It's a year ahead of schedule. That's what we have to do. And you know, what? We have to build a wall on our southern border. We have to do it. We have to do it. And it's gonna be a great wall. It's gonna be a real war. Nobody is coming over that wall, folks. Nobody. It's gonna be way, way up there. It's going to be a Trump wall. I always say, I've got to make it great and I've got to even make it beautiful cause someday they will honor me by calling it the Trump wall. So now we're gonna build a wall. And it's not a big deal. Building a wall is not -- you know, that's not a big deal. When I build 95-story buildings -- let me tell you, walls are easy. Walls are really easy. It's called precast blank. Now in the past, you know, they've wanted walls but they weren't able. Oh, here we go. I can't believe how easily they leave. I'll tell you, these security people, they're amazing. They just leave. OK. So we're gonna build a wall and we're gonna let people come in, but they're coming in legally. They're coming in legally. Now, if you remember, when I first came up with illegal immigration, oh, did I take trouble. Rush Limbaugh said, I've never seen any human being take more incoming than Trump. And then I turned out to be right. It turned out to be right. Right? It turned out to be right. And now everybody wants to come to my -- but it's too late for them. Most of them, it's over. It's over. Many of them are over it. Do I hear some noise? It's so much fun. OK, you can get them out. Yeah. Don't hurt them. Be nice. Now the press is gonna say Trump is soft. That's the problem. He's soft. He's gotten very soft. Yeah, don't hurt him. OK. OK. So let me tell you one other thing because it just has to go with the dealmaking and we need it. We need love. We need compassion. We need heart. We need great health care. We need a lot of things. But look at the Iran deal, and this just came to me and I've never heard it from anywhere else. Iran made one of the greatest deals ever made in the history of deal making beyond countries. We gave them a $150 billion. They kept our prisoners, which now they just announced they will begin negotiation for the prisoners. Do you believe this? We could have had them first. They kept our prisoners and they want to now start negotiation and they won a lot and they let us. But we won a lot. It makes me so angry, OK? So angry. We should have gone in there, three years ago, when this -- You ever see anything take so long as this crazy Iran deal? We should have gone in there three years ago. Say, look, number one, give us back our prisoners. You don't what them. We do. It will set a great tone. Very important. Give us back our prisoners and they would have said no. We get up. We walk. A day later -- and what we do when we walk, what do we do? We double up the sanctions. We triple up. A day later, within 48 hours, let's say. They call back. OK, we'll give you. That's it. We have a prisoners back. That would have been three years ago. But we have people like John Kerry and people like Barack Obama that are so incompetent. That deal is a disgrace. So I've been saying this, 24 days for inspection but the 24 days doesn't start till a whole legal process ends and who knows how long that. So they have like this huge long period of time. So they're doing nuclear. And by the time, we get there everything is beautiful. Looks like that floor right there. Everything's beautiful, painted battleship gray, everything's beautiful. So that's that. Now they have a right to self inspect. How about their bad areas? They don't want us in those areas. Those areas will self inspect. I mean, I can't even talk about this deal. So I've been saying, it's one of the greatest deals ever. And then about a week and a half ago I started saying, it's not. They made an even greater deal than that. We gave them Iraq. Think of it, the second largest oil reserves in the world. We gave them Iraq. So they got the deal. They're loaded up with cash. They have $150 billion, billion, billion, billion with a B dollars. But what did we do? We gave them Iraq because when we decapitated Iraq, those two armies, those two militaries were the same. They'd fight for decades. Boom, boom. They go 15 feet back, forth. There was equilibrium in the Middle East. You had a dictator. Who the hell cares? What the hell. I want to build this country. I want to rebuild America. We spent, look, look, we've spent $4 trillion, maybe $5 trillion. They don't even know what we spent. They used to say and I've been using this number for two years so you know it's a hell of a lot higher. $2 trillion in Iraq. Thousands of our young great people dead. Wounded warriors, who I love all over the place. You see all over these incredible people. Our most incredible people, the wounded warriors. They're all over. So think of this. Think of this. So we gave them all of this money. Cost 2 -- It's impossible. $2 trillion. This isn't now billions. This is now -- we're into the trillions. Words you never even heard of 10, 12 years ago. $2 trillion, but the $2 trillion is now probably $3 trillion. And in the Middle East, I guess, we've spent $5 trillion. We could have rebuilt our bridges, our tunnels, our roads, our hospitals, our airports. We could have rebuilt our country. We could have rebuilt our military. We could have taken care of Social Security. We could have taken care of every. We could have taken care of our veterans, who are treated worse than illegal immigrants, in many cases. So just think about it. So we spent at the time $2 trillion, which is now at least $3 trillion for Iraq. And what's happening? Iran is coming in, second largest oil reserves in the world. Iran is coming in. They've been fighting for decades and decades. Iran is coming in, walking in and just like you're standing here and sitting here, now everybody standing. That's good. But just like you standing here, they're taking over Iraq. What have we got? We got nothing. And I've been saying for three years, take the oil. I didn't say bomb the oil. You can do that too. I don't care because we're rebuilding. Exxon Mobile, these guys are so good. Boom, boom, boom, they put it back so fast. But you take the oil and you take the oil. You know, to the victor belong the spoils, right? You take the oil. You don't just leave it. We're the only country in the world -- You know, when I was young, when I was very young, we never lost a war. They always used to say, my history teacher, United States has never lost a war. Now, we never win a war. We can't beat anybody. We can't beat anybody. We can't beat ISIS. I watch on television, they have a general. Well, what do you think about ISIS? Do you think we can -- I don't know. It's going to be a very tough battle. I'm saying, where is General Patton? I want General Patton. Where is General MacArthur? Where is he. No, I watched this general on television saying that ISIS is a tough battle. Then I hear one of the reasons they're not doing the oil is Obama doesn't want to infect the environment because the oil is gonna pollute the environment. This man there is something wrong with him. There is something wrong with him. So I said, take the oil. Take the oil. And you know what we do with the oil? We take the oil and we give some to the soldiers that have been so badly hurt. We give some to those wounded warriors. We give some to the parents, who have lost soldiers, sons and daughters, in that war. And you're talking about peanuts compared to the values. You're talking about peanuts and you go in and you take the oil and you'd circle it and you make a lot of money. And you use it for good causes and you give some to Iraq, if the government remains. I mean, it's horrible government. Look, it's so corrupt. It's such a corrupt government. You know that. I mean ISIS formed -- the reason ISIS formed, they wouldn't let them in on the deal. So they formed ISIS and ISIS turned out to be a hell of a lot tougher than the Iraqi government. So who has the oil now? So -- and who takes the oil? You know who the number one buyer of the oil is? China. China. They haven't fired a bullet. They haven't spent $0.10. They're buying the oil. You know who's taking the oil in Libya? China. China smart. I'm not angry with them. I'm angry with our people. If I get elected president, those days are over. We're gonna become so successful again. We're gonna become so successful again. You know, there's an expression about the American Dream, remember? And I always talk, the American Dream, wonderful American Dream. The truth is the American Dream is dead, but I'm gonna make it bigger and better and stronger than ever before, ever before. Bigger and better and stronger. We're gonna do something. So I want to tell you, we've had a number of rallies. Yes. Thank you, darling. Thank you. We've had a number of rallies in Michigan. They've been incredible. But the people, whether it's Michigan or anywhere else, everybody we're all in the same thing. You know, they used to have an expression, the silent majority is back, right? The silent majority. This isn't really a silent majority anymore, folks. This is a very very aggressive, very very noisy loud majority. Very very noisy, very very loud. So I want to tell you, I'm leading in every single poll. I'm leading. And I don't know, look, we have to get out and vote and all of that stuff. We have to do it. You know, the last election people were not inspired. They didn't get out and vote. And if they would have voted, you would have had much better. But they didn't get out and vote. I think this time they're really inspired. Nobody has ever had crowds like this. You know, they say the crowds -- the biggest crowds anyone's ever seen. They say these are crowds like the night before the election. You have a crowd like this maybe and I doubt that. And they're getting bigger and stronger and more and more vocal. We are going to make our country so strong and so powerful and we are going to make our 1jM8W_y-tRE"}