{"id":485,"author":"Donald Trump","title":"Speech: Donald Trump Holds a Town Hall-Style Event in Des Moines, IA","date":"2015-12-11","link":"https://factba.se/transcript/donald-trump-speech-des-moines-ia-december-11-2015","paragraphs":["Oh, oh, you're going to be so sick of me you'll probably say we can't give him the caucus, just forget it. We can't stand the guy anymore. No, you're going to like me and we're going to be back and we're going to do a great job for you. Most importantly, we're going to get to that office and we're going to do the right thing.","We're going to do the right thing. So a few things. A lot -- so much has happened. You know, when we first came out, we were all talking together. And we were talking border security, which we're just doing so great with the border security. We're going to build a wall. Mexico's going to pay for the wall, we all know that.","We're going to have security. And the drugs are going to stop and people are going to come into the country but they're going to come into the country. They're going to be legal. They're coming in legally and that's the way, that's the way. And it affects Iowans so much. But -- so we were talking about that.","We're talking about repealing Obamacare. Boom, it's going to be repealed, it's going to be replaced. I don't know if you've been seeing what's happening but Obamacare is a total disaster. It's dying of its own weight. And by 17, meaning, he'll be playing golf and I'll be working very hard. But by 17 it's dead, it's dead.","You're not getting the people signed up. There's been a lot of talk about it and a lot of stories about it. Obamacare is dead but we'll terminate it quicker than that. And we will come up with something that will be so good, so much better. Premiums are going through the roof. Deductibles are so high that unless you're close to death, you're never going to get to use it. And even then I think you're going to get to use it, really.","So we're going to take care of that. And by the way, we have a lot of good people. We have ethanol that nobody is really -- we have the ethanol, where the ethanol people, right? I was here a month ago. I met with them all and they do a fantastic job. I toured the plants and they do a fantastic job. And it's so important and it's another form of, let's stay away from old pack and let's stay away from that Middle East stuff.","It's so important. So I just want to -- and actually, what I don't understand because the one guy that's doing pretty good with me in Iowa is Ted Cruz, and he's a nice guy. I mean, everything I say he agrees with me, no matter what I say. I was gonna do one really wild, but he agrees. But with the ethanol, really, it's -- he's got to come a long way because he's right now for the oil.","But I understand that oil pays him a lot of money, he's got to be for oil, right? The oil companies give him a lot of money. So -- but I'm with you. I'm with everybody. I'm with everybody. Look, I'm self-funding. I have no oil company. I have no special interest. I have no lobbyists that want me and, you know, they're representing countries that are ripping off the country.","They're representing companies that are ripping off our country. All I do is I'm going to be working for you, folks. We're going to do this thing together. We're going to make America so great again and maybe better than ever before. So, so important. So when we first started, I'd talk about China, how they're ripping us, and Japan and Mexico.","Mexico both at the border and in trade. They're taking so many of our companies. Nabisco is moving there with their big plant. Ford is moving there with a big plant. They took a big plant away from Tennessee, a great state. They took it away at last moment. We're not gonna let that stuff. We're going to do -- we're going to get it. We're going to do what we have to do, OK? But I talk about that -- thank you.","Oh, look at that group over there. Thank you. But I talk about that and I talk about it a lot. The fact is that about 2.5 weeks ago with Paris, I'm speaking a little bit differently now. Believe me, I can take care of China in my back pocket. That's easy for me. That's what I do. And we have all the cards.","A lot of people don't know, you know, these politicians they don't understand. We have the cards. You know with China, our people pay tax. They pay no tax. It's not supposed to be that way. They call it a tariff because it sounds better, but we will take care that. We'll take care of all of that. What happened is with Paris, there's a different mindset.","And when the polls came out last week, my numbers went way up because people felt more secure with me. Now, maybe it had to do -- yeah, really. Who knows why, who knows. But my poll numbers went up. And do you ever notice whenever there's something that I do that's proper but controversial, they say, now he's gone.","It's it. That's it, that's the end. I won't go over all of the different things because maybe you'll change your minds, right? So I won't. But they'll say, that's it, it's over. And then they come in, sir, your poll numbers went up nine points this week. I said, they did? Because I have to do what's right.","I have to do what's right. And you know what, if I don't make it, I don't make it. I have a good life. We all hopefully have a good, good life. I have a great family, nice people, wonderful people. They love me, I think. I hope. I think. But I have a great family and I built a great business. In fact, what -- thank you.","Who is that person? I love that person. Stand up. I love that person. Thank you. Thank you, darling. I appreciate it. There's such spirit. You know, like, this has such spirit no matter where I go, it's -- you know, we go to Dallas, we have 20,000 people. 35,000 people in Mobile, Alabama, 20,000 people in Oklahoma.","Wherever we go in Iowa, we have these crowds. This is supposed to be for -- in a round, this is supposed to be like a record. It is big, and yet it feels intimate. It feels good. And we're going to start taking questions. But I just want to say -- so I changed a couple of weeks ago. When I saw Paris, I changed.","And a big, big part of what I'm doing now is safety and security and smartness, and smartness. It's sort of interesting, you know, the slogan is Make America Great Again and I'm adding, Make America Great Again and safe again because we don't feel safe anymore. And the problem we have now that we never had to this extent is the power of weaponry, it's the power, it's the tremendous power.","You know, 100 years ago I would have said, let's not go -- I said, don't go there anyway. I said it strongly, don't go, you're going to destabilize the Middle East. But the fact is, right now, we're going to have to do things because we have some really, really sick degenerates. And it degenerates. And the press, look at all those cameras going all live.","All, you know, nobody else has cameras like this. They can make a speech, 100 times I make a speech, nobody cares. Look at this. And don't worry, they never panned the crowd, you know, they never. They have me. That's why I'm walking around. I figured I walk around maybe they'll get the crowd. They never panned the crowd.","I tell them to pan the crowd. They never do. I always go to my wife as she goes home -- I had a crowd 7,000 people last week. More, 7,000 people and in a confined space. It was there, 3,000 people outside that couldn't get in. My wife said, darling, the speech was excellent. Did you have many people there?","I said, what? She said, well, they never leave your face. They keep it purposely. But I'll tell you, I figured the cameras may be a little screwed up where you can't move them, right? But every time there's a protester, while I'm protesting, and it could be in the back left-hand corner of the room, the cameras swoop over there.","It's true, it's true. No, I used to think they couldn't move, you know. There -- maybe there's something with the crazy computers. You know, in the old days, everything was better, right? The car seats, you sit in your car and you want to move forward or back, you press a button, bing, bing. Now you have to open up things, press a computer, takes you 15 minutes.","Well, the same thing I figured with cameras. I didn't think they moved. I figured they were fixed for certain reasons. And then I saw a protester. And those cameras were bent in positions like you wouldn't have believed possible. So they're very dishonest people. What can I say? Not all of them, but most of them, most of them.","The press is this, I'll tell you, you have one of the most dishonest right here in your backyard. The Des Moines Register is the worst. They are the worst. The worst. No, they're very dishonest. You have some reporter named Jacobs, she is the worst. She -- she goes in and she will write so -- it's such a misrepresentation.","And so, I don't care, I mean who cares. So I'm saying it right in their backyard. They're failing anyway. They probably won't be in business in two years. They're losing -- I think they're losing a fortune. I think. You know it's funny, every time the Des Moines Register does a poll, I always do badly. And I believe, now of course I'm sure -- I'm only doing this so they don't sue me, but I don't mind if they do. I hope they sue me because they don't have enough money to sue me, that's a good thing.","But -- but I believe, and I may be wrong, in fact, I'll say I'm sure I'm wrong, but it's my opinion that they don't do it properly. Because you know they poll like 300 or 400 people. I'll explain it. But I really believe that, you know, they lose 20 people, well, in the pocket. Oh, Trump, oh, forget that one, forget that.","Now I don't know that they do that. Do you do that to Des Moines Register? But every time I'd have a Des Moines Register poll, I'd do poorly. I also do poorly with the Bloomberg polls, I don't know why. But we had a great poll come in CNN last couple of days where we're leading, I think, by 13 points and in Iowa, in Iowa.","And then we had another one come in where we're doing well. But I think Des Moines Register, somebody said it's coming out sometime, I'd just tell you, watch, Trump disappears. I think we're going to do so well. I think we're actually going to even do better, you know. We're leading in most of the polls.","We're leading in every poll now, every poll except Iowa. There was one poll, there was one poll, Monmouth. I never even heard Monmouth. What the hell is Monmouth? What is Monmouth? Explain it. I don't like Monmouth. You know why I don't like it? Because they always treat me badly also. But I only like polls that treat me well, right?","But -- but we're doing so well. Nationwide, we're leading every poll by tremendous. We just had one in Georgia, 44, 44. That's -- figure that, that's 44 with 15 people. I'd take 44 if we had 3 people. I don't think I'd take it if we had two people but I think I'd take care of it. But 44? A CBS came out, as you know, you probably saw that New York Times two days ago.","And we're 35 to a small number. We're killing everybody in every poll. Just one little outlier here and I'm sure, again, when Des Moines comes out, I'm sure it'll be a negative because I don't believe -- I don't believe that poll. But -- but we are going to win. And I tell what, honestly, Iowa is so important to me. I could say, oh let's not do -- I am an Evangelical, I'm a Christian, I'm a Presbyterian.","I'm a Presbyterian. I love Billy Graham. Franklin Graham came out with the most beautiful statements, Franklin Graham. He was so incredible. He came out -- I don't know if you all saw the statements he came out with about Trump, right? Stand up, please, right? Come on, stand up. You look great. Don't worry about it. Is that right?","He was so incredible. Franklin Graham was amazing. The son of Billy Graham who was, you know, there's nobody -- nobody that I've ever seen. Billy Graham was unbelievable. If anybody's going to his crusades, that were incredible. But -- so I think we're going to do, you know, we're doing really well with the Evangelicals.","And by the way, and again, I do like Ted Cruz. But not a lot of Evangelicals come out of Cuba, in all fairness. It's true. Not a lot come out, but I like him nevertheless. But I think we're going to do great and we are doing great with Evangelicals. We're doing great with the Tea Party, leading with the Tea Party.","And we're doing fantastic with old and young and middle and we're doing great with everybody. And so it's very important for me to win Iowa. Now, I could take -- put less pressure on myself and I could say, oh I don't care about Iowa. I don't care. But I do care. I do care so much about, that's why I'm here all the time.","And then the lies happen. You know, when I was using Iowa, they lie so much. I said, the people of Iowa can't be that stupid or dumb. The people of the country can't -- I'm trying to make a point, right? So I said the people of the country can't be that stupid. Well, they cut the country out, so I was referring to Iowa.","I love you, people, remember that, remember. I was talking about something and I won't even mention what I'm talking about because the guy I'm talking about, and was -- was actually a very good guy. But I will say this, we want to win Iowa so bad because if I win Iowa, I think we'll run the table. I really do. If -- I think we'll win the table.","We'll go right through because we're leading big in New Hampshire every poll, big, big in New Hampshire. Christie got an endorsement from this crazy newspaper up there. It's the weirdest deal I've ever seen. And it was -- you know, the paper that was in his state called up, said, are you sure about that?","Nobody ever called us. They can't believe it. And we could go into that but it's irrelevant. But we're leading New Hampshire, big. We're leading in South Carolina like monstrous numbers. We're leading the SCC, Nevada. We're leading in Texas. We're leading everywhere. We're leading big in Florida. Now you have Rubio, nice guy, by the way.","You have Rubio, and he is a nice guy but, he got to vote. You know, when the people put you in position to be a Senator, you got to go and vote. You can't be the number one person that doesn't vote in the Senate. You've got to say, hey, you know I'm a young guy, I want to go and vote. He should stay there a little longer.","He's a good guy. Stay there, go in, vote create a nice record. But, I don't know, how's he doing in Iowa? Not too good, right? He's not doing well. How's he -- how's Rubio doing? Not good. I mean, it seems like a two-person race right now. It seems like a two per -- and it's an important race to me. So I just want to let you know it's very important.","So with all of that, if we win Iowa, a lot of people say, we'd just go through -- I think we win virtually every state in the union, and it's over quickly, over quickly. Now, we're going to take questions and one of the questions will be, well, what about the Republican establishment? Establishment's got a problem.","You know, it's sort of like the fighters, you know, the great champions. Sometimes they'll go into a hometown of the guy they're fighting. And they'll say, you know, we never want to get a decision. We go for the knockout because the knockout is the knockout. Because you get a lot of bad decisions. I know a lot about the world of sports, believe me. And they go into a hometown to fight and it's a decision, and they say, oh we're in a problem and they lose the fight that they won.","The only way they win the fight, definitely knock out. So if we win Iowa, I think we're going to win everything after that. So I think it's going to show how important Iowa. And one thing -- and I'll pledge this, I'll pledge this to Iowa, even if I lose I'll pledge it, OK? I don't think I've ever said that my life.","But if we go and win, Iowa's staying right where it is in the chain. It's not moving. You know, there's a big move, there's a big move on to move Iowa into a much further back position by The Establishment. Folks, I win, it's not happening, OK? You're staying right here. Because it's great. It's great, you know, it's great.","And if I don't do that, Tana is going to be very angry at me. Right, Tana? How has she done? Is she incredible? Thank you. I appreciate all staff, I mean, Chuck and Stephanie and where's my big guy? Where the hell is he? Boy, how good is he on television, right? Where the hell is he? Where is he? Sam, big Sam, come here, Sam.","Come here. Look at the size of this. Come here, Sam. Look at him, big Sam. Come here. Are we going to win Iowa, Sam?","Beautiful. Be careful. He did so well, I don't want him falling when he's leaving, right? Beautiful. Thank you Sam. He's a great people. And I'm gonna be here, that night, I will be here with you. I'm going to be here that week and maybe a couple of weeks before all the time. So I'm going to be here because I'm going to watch you.","I'm not going to give you any chance that we lose it, OK? So let's take a few questions and we'll have a little fun and we just did a big interview with CNN just before this and you know Hillary, was Hillary missing today? What happened? She was two hours late. She -- no, did you hear? I just read and I may be wrong.","And you know if I'm one minute off they'll call me because they love Hillary. But -- they love her. You know why. I don't know why. Why? I'm trying to figure -- now I heard she was a couple of hours late, everybody left. You know what happened? She was sleeping. I'm telling you, she couldn't get out of bed.","She was sleeping. She was sleeping is right. OK, let's take some questions. Go ahead.","All right, good. Hi, Sue.","Thank you. Thank you.","Great. I'm so glad you asked me that question. And so you've been paying into Social Security and Medicare, by the way, let's put him in there because Medicare does work. With both, you have tremendous waste, fraud and abuse. We're gonna take care of that, OK? But we're not going to cut your Social Security and we're not cutting your Medicare.","We're going to take jobs back from all these countries that are ripping us off. We're going to become a wealthy country again and we're going to be able to save your Social Security. We'll not take it. Now, think of it, now I can't believe this number but I read over -- who is the man that told me the number?","Over 6 million people, I can't believe it, are aged 112 and over are getting Social Security. Who's the man that told me that? It was around here someplace. He said, oh Mr. Trump -- but I heard it. I read it. A tremendous, like 6 million people are getting Social Security, they're dead, meaning somebody else is picking up the -- because we know -- who is that man?","He's over there someplace, OK. Six million people more and I read that he just came up to me tonight to say, now it's an amazing statistic, the press is going to have to check it because what do I know, but can you imagine, you have six -- now we know there's not six million. There may be one, but there's not six million.","Anybody in this room 112 or over? Because if they are, I want to shake your hand. But -- so six million people over 112 years old picking up social security, and that's the beginning. So there's tremendous waste, fraud and abuse. What we're going to do is we're going to save Medicare, we're going to save Social Security.","You're going to get your pay. We're not going to raise the age and we're not going to do all the things that everyone else is talking about doing. They're all talking about doing it. And you don't have to. We're going to bring our jobs back. We're going to make our economy incredible again. My tax -- my tax proposal, which is in great detail in terms of policy, and it's gotten tremendous reviews from a lot of people, a lot of great groups.","But -- but we are going to cut taxes tremendously for the middle class and for businesses because our middle class -- our middle class is being decimated. And Sue, when that happens you're going to see an economy that takes off. We're going to get rid of a lot of that debt, if not all of it, but we're going to get rid of it as soon as -- you know we're at $19 trillion going to $21 trillion right now.","You know, if you go back eight or nine years, trillion wasn't even a word that anybody knew. And now it's like routine. So we are going to save your Social Security without cuts. We're going to bring the economy back. We're going to make ourselves rich again. A woman said to me in New Hampshire recently, she said, Mr. Trump, I'm voting for you, I love you, but it's very crude when you say you're going to make our country rich again.","I said I know it's crude, it sounds bad but many things I say are crude. It sounds bad but we can't make our country great again unless we make our country rich again. We can't let everybody in the world rip us off. Remember, remember we rebuilt China. The money they took out of our country, we rebuilt China.","You go there, they have bridges all over. They have bridges like the George Washington Bridge. Maybe I shouldn't mention that partic -- but like the George -- bigger like the George Washington Bridge. Only a few people got that one, that's OK. But we have -- they have bridges going up there. We have rebuilt China.","They've taken our jobs, they've taken our base, they've taken our manufacturing all over the place. They've taken our money, they've taken our money. Not going to happen anymore, folks. Not going to happen anymore. Not going to happen. I know the great business people -- we have the greatest business people in the world.","Guys like Carl Icahn, he calls me, Donald, I want to help, I want help. The smartest people come -- we're not going to use those special interest guy a donor. We use donors to negotiate with China because he gave some guy like, you know, whoever it might be because, again, I'm the only one to self-fund in my campaign.","Everybody else isn't. And when these guys, when these guys give money to politicians, to a large extent they own those politicians. They will do whatever the hell the special interests and the donors want. It's not going to happen with me. So Social Security, we're saving it. Medicare, we're saving it. We're going to make our country rich, OK? Thank you, sweetheart.","Thank you.","OK, Tana, go ahead.","I love the veterans. Am I good with the veterans, Jeff?","I love the veterans. That's the other group. We're leading with the veterans by like -- forget it. Go ahead.","Right.","Yes. It's called -- see, what I like about Jeff, he started off weak but he finished strong. That was a long route, hey Jeff, that was a long route to get to a good question. Yeah, it's called the statute of limitations, right? And you know it's a six-year statute, maybe five but it's probably six. But it's a six-year statute.","Yeah, you have to look at it. Look, Hillary Clinton -- you know this story. It's a crime. She committed a crime. Now, perhaps, perhaps somebody -- you know, we have to have a fair justice department. And perhaps Jeff will have some really good Attorney General that's going to say, well, you know -- and look, we want to be fair with everybody, OK? including Hillary Clinton.","But she committed a crime, in my opinion. Now, she shouldn't be allowed to run. She's being protected, absolutely. I have little doubt that they're going to find anything but they've already found it. I mean, you watch television, you have all these big scholars coming, these lawyers. Yes, she violated section so-and-so. Just one after another.","I mean, actually violated many, many laws not just like a little bit here, many laws. You mentioned General Petraeus, his life was destroyed. Over 5% of what Hillary Clinton did, over nothing. So I think she's going to be the nominee, definitely. The only question is whether or not she'll be allowed to run.","She's being protected by the Democrats. She's being protected by the President. And that's why, why do you think she's going along with these insane policies of his, OK? I mean, she goes along with everything. I don't even -- honestly in all fairness to her, I don't think she believes it. But I think she's afraid that he's going to say, listen I don't like her anymore.","Go take care of her, I'm going to get somebody else. I'm telling you. So the question is statute of limitations. It's a five-year statute of limitations. She's got a problem, she's got a problem. In one way she's running for her life. Because I know one thing, if she wins that's the end of that, right? But if she loses, she could have a very serious problem.","OK. Another question, please.","Hi Eric.","It's always exciting. Keith, out, out, get him out. Get him out.","Get him out. Get him out. USA. USA. USA.","That's a Hillary supporter. You know, I always say -- here's the sad thing. So a guy like that -- so a single person, always wants to be right in the line of the camera, right? Stands up. He's gone in a couple of minutes. Tomorrow the headlines, protest that -- it's really sad. We have like 2,000 people here and that the headline will be this -- wait, I got to say, this person.","Sorry. You know, it's sort of interesting because I've learned so much doing that. I never did this before. I've been doing it for five months. I've never been a politician. I hate being a politician. I mean, I know politicians so much. If you can't make money with politicians, there's something wrong, OK? I know them so well but I'm a politician, can you believe it? But it's -- it's amazing.","I see these people, and sometimes, you know, I'll go through -- I've had 20,000 people, no single -- not even a murmur just love. But every once in a while you have somebody stand up, every single time it turns out to be a big story and it's a shame. It's really a shame. It's really unfair. And that, to a certain extent, is the press also.","OK. Go ahead, Tana.","He'll probably have another one stand up at some point you know. They're lurking, they're lurking.","Well, I said right at the beginning, we're going to build a wall. It's going to be a real wall, going to be a real wall. It's not going to be -- you see that ceiling? That ceiling is nothing compared to the wall. And we can build it, and we can build it right and it'll be strong and powerful and as beautiful as a wall is going to look.","It's got to be beautiful because someday they're going to name it the Trump Wall. I know that, it's going to happen, it's going to happen. And it's going to work. And you know, walls do work. You know, they wanted to build a wall here 20 years ago. You know they couldn't get environmental impact statements, that just shows you.","China is building in the South China Sea massive military bases, right? Why? They're not supposed to. They have no respect for Obama or our country. They're not supposed to be doing that. And you can get them to stop just by saying we're not doing business with you anymore. The whole -- the whole economy -- what, you don't have to go to war.","It's economics. The whole country would collapse in two seconds. Believe me, we have such power and we don't know it. But they're building massive -- now they had little islands, they put the biggest excavators, not Caterpillars they used -- I think they're using Komatsu from Japan, which is pretty tough.","They have these massive excavators. And I said to a friend of mine who's Chinese from China, very rich guy, very successful guy, paid me a fortune for an apartment so I happen to like him, OK? I said jokingly, how long did it take them to do these massive islands, they're building right out of the sea, boom, those shovels go in, take out everything.","How long did it take you to get the environmental impact statements? He laughed. He said, what, are you kidding me? Nothing. They say, we will build there, about two seconds later you have excavators digging. So we had a problem with -- because the environmental -- look, I've won many environmental awards.","I'm a big believer, especially in clean air and clean water. I'm a big believer, just so you know. Big. And I've gotten so many awards for the environment. So I understand the environment. I've won many, many awards. But when you look at how we're impinged and hurt, but the wall was stopped because they couldn't get an environmental impact statement among other things.","They couldn't get an environmental impact statement. Now there was probably a snail or a turtle or a snake or something. You were ruining the habitat of a rattlesnake, I don't know. But they actually had people, a lot of people, people that now would be against it, but they wanted to build a wall years ago, they couldn't get it done.","I heard, you know, I said bomb the oil, right? I spent time there for three years. Now finally they start bomb, after Paris, they start bombing the oil. I've been saying it for years. You know, one of the reasons that we didn't bomb the oil, they didn't -- Obama didn't want to hurt the environment. Now I heard that and I thought it was -- I thought somebody was kidding.","I thought a comedian was saying it. It turned out to be true. He didn't want the flames and everything going into the atmosphere. This is the way we fight today. I'm telling you, folks, we're being led by stupid people. We're being led by stupid people. And you know, I said -- I've been saying not really bomb, I've been saying take the oil.","I didn't want to go into Iraq. But once we were there, I said when we left -- look, we shouldn't have been there but then when we left, we left the wrong way. First of all we have a president who told them a date. We're going to leave on such and such a date. When was it, like 18 months later? So the enemy all of a sudden said, wow, because they don't believe it. They didn't want to be killed, OK? They didn't want to be killed.","So the enemy said, they're going to leave on a certain date? So they pulled back, the day comes and now you see what happened. It's a disaster. And Iran is taking over Iraq. So anyway, I couldn't believe it when they said that. When we sent our 50 soldiers two weeks ago and our President gets up and announces, we are sending 50 soldiers.","OK, first of all, he thinks it's a good press announcement, it's not. 50 soldiers, it's not a lot even though they're the elite. But those 50 soldiers, because of that announcement, have a target on their heart. They have a target on their heart. What does he have to say that for? Why can't he let 50 soldiers go there quietly, stealth, stealth.","Why can't he just do that? Why can't he do that? Those 50 soldiers are in grave danger today because of that. And they probably don't even know that but everybody's looking for them. And that's the way it is. We have people that don't know what they're doing. We used to have General MacArthur, Douglas MacArthur, General George Patton, I mean, these were real people, these were real people.","Today we have generals, they go on talk shows and they say, oh, I mean, I saw a General the other day on a talk show. He said, and this was serious, and he's a good man, they're good men. But you got to lead these men, even the generals you have to have some power over them. He said, we are in the worst shape in terms of preparedness that we've been in in decades.","And this is a time where we have to be in the best shape because the world wants to kill us. And he said, we are in the worst shape that we've been in in many, many decades. Now, number one, he shouldn't be saying that because you're telling the enemy that. And the enemy feels emboldened when they hear that, right?","We shouldn't be saying it. We shouldn't be saying it. I mean even if it's true, you don't say it. You get it fixed and you put -- you do it the opposite. One thing I'm going to do, I tell you, I'm going to build our military so big and so strong and so powerful, so powerful that nobody is going to mess with us. Nobody is going to mess with us. You know, in many ways it's the cheapest thing you can do. Everyone's toying with us right now.","It's the cheapest thing you can do. The absolute cheapest thing you can do, OK? Come on, Tana.","Hi, Roger.","Yeah, you're right. I mean it's -- your second -- I'm a big Second Amendment person, by the way. Yes. Come here. Get up here. Come here. Get over here. My gunman, get over you. Come here. This guy, he has one of the great places -- might as well give him some free publicity. What the hell, he's out here.","My son buys weapons from him. My sons are in -- members of the NRA, so am I. Come here, come here. Looked like somebody was aiming at him up here. So, you know my sons, right? They're serious believers in the guns, right? What's the name of your company?","And you have a great company, and my sons love their equipment. And this is long before I was ever even thinking about doing this, right?","They begged you a lot of money? That's -- I guarantee. I hope they're negotiating a little bit. Thank you very much. It's a great company. Thank you, man. Be careful. Thank you. Now my sons are really great marksmen. They're big believers. And I'm a member of the -- I'm a member of the NRA but I'm not such a good shot.","But they're great shot, so it's one of those. But if you think about that question. So you know there's tremendous pressure to get rid of the guns, get rid of the magazines, no bullets. How about the one where they have three bullets in every magazine, it holds 12 and house 23. So the people with a lot will put three bullets in. I don't think the bad guys are going to say, well, I don't want to break the law.","I'm going to go kill people tonight, but I'm going to put three bullets in, right? These people, and you know, I have arguments with them all the time and I'm a practical guy. Honestly, if I didn't believe this, I couldn't say it. So in France or in California, if you have -- I have a permission to carry, which is a big thing in New York.","It's very hard to get. I have a license to carry. OK. But -- but in France or in California or in all these places where you see the shooters, right? If -- instead of having hundreds, like in France, hundreds of people in that room -- Paris has the toughest gun laws in the world. France has the toughest gun laws in the world.","Nobody has guns except the bad guys. So they walk in with or they walk in with the worst, the toughest, the best weaponry you can have and they said, over here, boom, over here, boom. So they kill 128 but many more are dying right now. They're in terrible shape in the hospitals. They just wipe the place out and they could have stayed there for longer.","They wiped it out. Then you had those two sleazebags from California. The married couple. I saw the press. The young married couple that did the shooting, they're not a young married couple. They're the worst, they're sleaze, you know. The young married. They say the young married couple, that's no young married couple.","So they walk into a place and they kill 14 people and others are going to be dying probably because a lot of other wounded people. But if somebody had guns in there, nobody had a gun, if somebody -- if these guys, look at this guy right here, stand up. How would you have done if you had a gun? Would you have been firing back a little bit?","They'd be in trouble, right? They would have been in trouble. Believe me, that guy. So you know, I went to like the Ivy League College and I have a lot of friends, they're against guns and -- and I said, I argue with them, I talk to them. I say, OK, we're in Paris. You have all these places and there's hundreds of people, guys walk in with guns and you have no gun.","Don't you think they would have been better if that -- well, Don, they can't -- they lose the argument but they never change their mind. So we have to fight for the Second Amendment. It's so simple, it's so simple. And believe me. Believe me, they want to take those guns away. And you always know that the bad ones are going to have the guns and they're going to have them more so than ever before.","So we're going to protect the Second Amendment if I'm President, that I can tell you. And by the way, we're also going to be saying Merry Christmas again. Do you ever notice, do you ever notice? That's right, Brad, Merry Christmas. And by the way, Merry Christmas, everybody. Merry Christmas. And Happy Holiday.","I have a lot of friends and, frankly, I have a lot of friends that aren't Christian. They like Christmas, everybody likes Christmas. It's politically incorrect to say Merry Christmas anymore. When I'm President, Merry Christmas, Happy Holidays, enjoy yourselves. Don't eat too much turkey, right? OK. So we're going to say Merry Christmas again, folks.","We're going to bring our country, we're going to bring that spirit back. OK. Go ahead, Tana.","She's great, by the way. Go ahead.","No, he's a good guy. He is a good guy. And so is Phil, is a great person, by the way.","It's interesting. That second is interesting because he is -- I really do, I'd like Ted Cruz a lot. And he's doing well, I'm doing well. I mean, it's not a contest between the two of us, just so we understand. We have to make that. But I do like him. And I would say that we would certainly have things in mind for Ted, to be honest with you.","I mean, he's somebody that I could certainly say that because I like him, he likes me. He actually put out a tweet tonight, he said, Donald Trump is -- I think he used the word terrific, that's a nice word. You know, whoever hears that? I can tell you other candidates are not exactly saying that about me, right?","Will you say hello to Phyllis for me? She's an amazing woman, amazing woman. OK. Go ahead, Tana.","OK, great question. So the super PACs are horrible. And I had many set up for me by people I didn't know. I mean, I'd see him on television talking about somebody named one, The Art of the Deal PAC. Two young guys, they look good. I mean, I don't know. But then, I got to be, you know, I started going around, and I see the corruption with these super PACs, where they're stuffed with money, people that put the money in are dealing with candidates, and the whole thing is wrong.","And I see it. I mean Bush is $125 million. Think of it, $125 million. By the way, if he had $2 billion, it wouldn't make any difference, OK? But Bush has $125 million -- and honestly, he's a nice person, he is. I don't want us to do that, but he's a very nice person. But it's $125 million and you say to yourself, people give $2 million, $5 million, $7 million, you know what's happening.","But some of the super PACs are running campaigns. They're actually running the campaign. Another thing -- and it's sort of interesting, one of the super PACs I believe has $6 million. Of the $6 million, this was reported on the front page of The Los Angeles Times, of the $6 million -- and one of the candidates, who's a nice person so I'm not going to mention the name, you know, when I like people, I like them.","I'm a very loyal person, all right? Of the $6 million, after all of the bloodsuckers took their cuts, the fundraisers, can you believe this? They had $140,000 left for their campaign. That's better than being a real estate broker. I'd rather do that than sell houses. They had $140,000 left. It was in the newspaper, I don't know.","I think, I'd believe it. But I've seen it. I saw it with the Romney campaign. Guys made tens of millions of dollars raising money for Romney. I say, what the hell is this? I mean, you get money and they get a cut. Look, our laws are so corrupt, our campaign finance laws are so totally corrupt. It's so horrible, so horrible.","And I don't necessarily want to stop people from giving because I think that's a good thing. But you got to get away from these PACs. What you have to have is people have to know who it is. So you have to open up the process. Let people know, if somebody wants to give him $1 million, you give him $1 million.","But everybody has to know that so-and-so gave $1 million. Because that puts a little pressure on guys like Brad who raises hundreds of millions, right, Brad? Puts a little pressure. But the concept of the PAC is -- it's no good, it's no good. It's -- it's -- it's a very dangerous, terrible thing. So we will change our comp -- our laws because you really have no choice.","It's so out of control, it's so terrible. But the papers that are in this room tonight, they should look at this. There is so little money left over for the candidates. It's one of the reasons I'm so happy I'm doing my own. We actually sent legal letters to either nine or 11 PACs. The Trump PAC, the Trump PAC, this PAC.","First of all, I'm sure that out of some of them, they stole the money. Some guy has no money, he sets up a Trump-something PAC, nothing to do with me, sets it up. All of a sudden he's got $2 million sitting there, right? People sending money. And you guys, you got no money. How much of that money do you think he's going to use to do what he's supposed to be doing?","That's common sense. So maybe all of it, but I doubt it. So we sent legal notices to everyone that we could find having to do with Trump. We don't want their money. We said don't do it. We don't want it. And we want, you know, ideally give the money back to the people that gave it to you. But the super PAC concept is corrupt and it's terrible and it should be ended.","And we're going to go to new campaign finance laws that are going to be terrific, OK? Thank you. OK. Go ahead.","Hi Kevin.","Yes, it is. It is. Well, look, he's from Texas. To the best of my knowledge, there's a lot of oil in Texas, right? So, you know, he gets a lot of money from the oil companies and he's totally against ethanol and everything else you're talking about. And I'm not, I'm totally in favor. And you know, it's a big industry here.","It's a big industry. You know, if that industry is upset, Iowa's got problems because you employ -- I was amazed. I was here three weeks ago with the group. Any of -- any of the people here that were at that meeting? They were such amazing people, right? Stand up. It was -- it was such -- had a good meeting, right?","And I learned so much about it. I was in favor of it even before. That's correct. I remember you very well. That's correct. How could you forget. But it was amazing, and looking at the plans -- but you know also beyond even the fuel capacities, which we want to create as much as we can, tremendous numbers of jobs in Iowa.","And I said to myself, if Ted Cruz is against ethanol, how does he win in Iowa? Because that's very anti-Iowa. I don't know how he wins in Iowa. I don't know. But, no, I'm totally for it, OK? Thank you. Thanks. We've got questions? Yeah.","sometimes purposely though.","Oh, thank you. Thank you.","Come on up here. Try to bring her up. So nice. You know, when she first started that question, I said, uh-oh, here it comes. And after midway through, I started -- I really appreciate it. Come on over here. Come on, get under there. You can get under. That's great. That's such a nice question. Thank you, darling.","Come here. Thank you. Here, don't fall. Thank you very much. It's so nice, so nice. What's your name?","Well, you know, it's good. Thank you, darl -- be careful. I was a member of The Establishment six months ago. I gave $350,000 to the RGA, that's the Republican Governors Association. I gave tremendous amounts of money away. I was like the fair-haired boy. Once I said, I'm running this. What, you're not supposed to run.","And then what happened, I ran against all these senators and governors and everyone said, well, I don't know. My wife said if you run, you're going to win because she understands that I like people, I love people and people love me. And she said you will run but you have to actually go and run. You have to announce you're running because nobody is going to believe you're running.","And so I didn't announce. I didn't want to announce because I didn't want to, like, announce and then things didn't work out. And I'm like some of these guys with a zero. Many of them is a zero. And so finally I said, look, let's -- we're going to do it. We have to -- just too many things that I watched on television with our President and the decisions that are made -- Bergdahl, where we get Bergdahl and they get five killers.","We get this horrible, dirty, rotten spot -- he's a terrible traitor. We get this horrible, terrible, traitor. And they get five killers that they've wanted for nine years, the worst killers. And they're all back on the battlefield. You know, so many decisions -- the Iran deal. The Iran deal, how bad is that?","They self-inspect. Oh, OK. Good. We're not building. We promise we're not building nuclear weapons. Oh, OK. That's OK. And we give them $150 billion and we don't even get our prisoners back. The whole thing is crazy. So I saw this. And I said to my wife, hey, I don't know if I'll do well or not. Who the hell knows?","And it's a risky thing. You know, I've always heard, if you're a very successful person, you can't run for office especially for President. And I see it all the time. And the people go after me. I don't even care at this point. I said we have to do it. Now we're gonna have to do it. And I looked at it, last time with Romney, and I didn't do it and I probably should have because he let us down.","I mean, look, he let us down. That was an election -- we had a failed President. Four years ago he was a failed President, just as bad as he is now. And Romney -- it's true. And Romney let us down. And that last month it was like he wasn't even campaigning. I said, why aren't you on Jay Leno? Why aren't you on David Letterman?","Why aren't you doing it? And he just didn't do it. OK. So he lost the election. So I backed McCain, he lost. I backed Romney, he lost. This time I said, I'm doing it myself, OK? We're going to win. We're going to win. But -- but there is an establishment out there, it's a real establishment, real people.","And they're people that are used to having their little puppets all over the place. And they're people that are used to giving donations and having control and they're people that you know, look, when they call me I'll treat them with respect. But I'm not going to be doing bad things if it's bad for the country.","I'm not going to let Ford build a plant in Mexico if I can keep it in Michigan. And -- and I'm not going to let the car companies and Nabisco and all these people and all these companies -- I'm all for free trade. I think it's great and I'm for it. But it's got to be smart trade. I'm not going to let them move to Mexico and then sell stuff over the border with no tax, no nothing.","So we lose our jobs, we lose our factories, they go over here, they make it, we let him come through. What -- how does that help us, folks? I went to the best business school in the world. Believe me, it doesn't help us, OK? Trust me. And we're not going to make deals like that anymore. We can't. We owe $19 trillion, we can't. So The Establishment is not ever probably -- I'd -- look, you know what, in the end, if this country starts humming, even The Establishment they'll be saying, OK, it's a good thing.","Because they'll be beneficiaries also. But we do have a real establishment, and they've never seen this happen before. A writer called up and he said, recently -- I told the story, I mean, one of the top journalists, to my way of thinking, certainly in the country and beyond. And he said, Mr. Trump, how does it feel?","I said, how does what feel? How does it feel? What you've done has never, ever been done before. I said, what have I done? You've dominated -- there's something they called the Summer of Trump, now they call it the Autumn of Trump. Hopefully, they're going to call it the Spring of Trump and, you know, I want the next Autumn of Trump but I said -- I said to the writer, I -- I don't know what you're talking about.","I haven't done anything because, frankly, if I don't win, I consider this to be a total waste of time. I'll be honest with you, as much as I like being with you tonight, because we won't be able to do anything. He said, no, no you've won. Even if you don't win, you've won. Or -- I said, no you're wrong. If I don't win, if I don't win, I have not -- I have wasted my time.","So you know, the point is that The Establishment can't believe it because they've never seen that happen before. So Time Magazine, I was on the cover of Time Magazine four or five weeks ago. And Time magazine was going to pick the person of the year. Everybody, even my enemies, said Trump is going to win.","I said I won't win. They said why? I won't win just like I should've gotten the Emmy for The Apprentice the first three years I was nominated. I should have. And I said I'll never win. I told everybody, I'll never win because I'm not Hollywood establishment. And with Time Magazine, I said, I will win. Bill O'Reilly, who's a great guy, did an editorial at the end of his show two days ago saying, nobody has done more than Trump.","He should've won. Now, I'm not saying I should have -- I probably should have, in all fairness. But he said nobody's done more. You know, taken over -- what we've done has been amazing. All of us together, not just me, it's not just me. It's all of us. It's all of us. From Dallas and Mobile and Oklahoma, all of us. Because the spirit -- but Bill O'Reilly had a whole big thing.","And other shows where they said Trump, Trump, who do you think? Trump. Well, Merkel got it. Now Merkel, what did she do? She's destroyed, I mean, she's in the process of destroying Germany with the migration. We have to help the people with the migration. We have to create a safe zone someplace in Syria.","But I don't want them coming into this country. I don't want to because we don't know who they are. We don't know who they are. Them with their printing presses that now do the forged -- the forged passports, OK? You heard about that. So we don't know. So the bottom line on that, it's such an interesting question.","You'll know in about a month or two whether or not The Establishment has treated me fairly. But the only thing I can say is this, if I win Iowa, I think it's over. I said before because I think, if I win Iowa, we're going to have -- New Hampshire is amazing, people are amazing. You would love the people.","They would love you. You love everybody. The whole country is in love. They want some -- it's called like, I call it the noisy majority. It's no longer a silent majority. It's a noisy majority. But if we win like I think we're going to win because we have such a big lead, honestly, it's not going to matter.","They can't do anything. I don't care about The Establishment. They can't do anything. You know, the only way they can do is if I'm a little bit short. If I'm two votes short, I have a problem because I have to go into that convention. I'm dealing with all these bloodsucker politicians and they'll make their deals and they'll have all their money guys around and they'll be in the back room making deals.","But if I get the number of delegates, there's not a thing they can do. And I'll end up doing fine with the Esta -- again I was a member of The Establishment six months ago. So -- but it's a very nice question. I appreciate it. Thank you. OK. Tana?","Absolutely. That was an easy one, I'll tell you.","So, Common Core. I'm such a believer in education. You know, I had an uncle who was a professor at MIT for which -- he was a brilliant guy. They just wrote an art -- in fact, I just retweeted an article about him today, you got to read it, OK? @realDonaldTrump, you have to read it. When I see somebody like Jeb, strong -- and I tell you one thing I respect, he didn't change his views.","He knew he was getting killed on this issue and he didn't change. And I respect that to a certain extent, but it's so wrong. Common Core is a total disaster. We have people -- we have people, bureaucrats in Washington, telling you how your child should be educated in Iowa and New Hampshire and all of the different places that we go to. It's ridiculous.","And I go around and I see the principals. I've seen so many students and teachers and professors and principals. And I've seen some of the people and they love -- even in Iowa at a school, I've seen some of the love that these parents give to those schools. This is real love. These are smart people and these are people, they're not working for a paycheck.","These are incredible people and I've seen one came back -- remember this, our educational system is a mess. We spend more money per pupil as a government than any other country in the world, and we're in 28th place. And I mean, like double what anybody else placed. So I want to bring education back to the local areas.","You're going to have parents and you're going to have unbelievably talented people and they love their kids and they want their kids to be well-educated because it's so important and you have to be very happy with it, OK? Thank you. Thank you.","That kid is tough-looking cookie, right? Go ahead.","That's right, that you people do it. And I've gotten to know you, I've gotten to know you really well. You people do it. We're backing you 100%. The job and the spirit you all have, it's always -- you're always perfectly attired with your green, but we are backing you 100%. You do a phenomenal job. There should be more people like you in this country.","You know, the whole grid is a disaster, right? I mean, the whole -- the whole country, the infrastructure of our country is falling apart. And nobody can build like me. That's what I do, I build, I build. I'm building on, as you know, in Pennsylvania Avenue, a big, tremendous hotel that I got from the government to the United States.","Can you believe -- during the Obama administration a couple of years ago. But we had the best plan, the best is the GSA is terrific. They're very good. Very -- actually they're very talented people. We're under budget and ahead of schedule. That's what we do. When you see these things where they're building a bridge and it's going to cost, you know, $1 billion that would have cost $12 billion.","How about when they built a hospital, they'd cost $3 billion. And I'd look at it, I'm very good, I can look at a building and tell you how much it's going to cost. I'd say $250 million. No, sir, $3 billion. $3 billion? You think somebody got rich on that one? So we're going to stop all this stuff. We're going to make our country so strong and so wonderful and we all love it, anyway.","We love it, but it's so sad to see what's happening. It's so sad. And we're going to change it around. Where's Tana? Are we all finished with those questions?","The last question.","You know, Tana doesn't let up. She's brutal. Corey, she's brutal. Well, she -- she had -- she did a good job on The Apprentice, though, right?","You know, I'll tell you. And there's another special person who did a great job on The Apprentice, Shawn Johnson. She's another champ. She is another one. And she's an incredible young woman and she's getting married, whatnot. I'll tell you what, Shawn Johnson, right, Tana?","She's fantastic. And so, say, where -- wherever Shawn may be, say hello to Shawn. She's great. Go ahead.","True, that's true. We have such a problem. And the biggest problem I have, you know, it relates to education. And the hardest thing you get is when you go around and you see students. And so many students come out to hear us and they always want to talk about the loans where they have student loans. And they're going through nice colleges, they're good students, they work hard, they can be really top in their class.","And they get out and they say, Mr. Trump, we have no jobs. We can't get jobs. So they're borrowed up to the hilt and they can't get jobs. We're going to bring our jobs back from China. We're going to bring our jobs back from all these places overseas that have stolen our jobs. We're going to bring our jobs back from South America.","We're bringing them back from Mexico. We're going to have jobs again. Believe me, we're going to be manufacturers again. We're going to start making Apple computers in this country. What the hell good does it do to make them in China? I want to make them in this country. And we have the ability to do it. So we're going to bring our jobs back, OK? Well, ladies and gentlemen, I just -- this has been a lot of fun.","This is the first time I've done this kind of a thing, but it's been amazing. And -- yes? Thank you. Thank you. I thought you were a protester at first. I said, oh, isn't that a terrible way to end? A protester in your final four words. Now that was very nice and thank you. And we love the military, right?","We love it. So I just want to thank you all for being here. We love you all. It's so important, Iowa was so important to me. And the relationships that I've developed here have been amazing. So we're going to make our country great again. We're going to make our country safe again. Thank you all for being here.","Thank you. Thank you. Thank you."],"text":" Oh, oh, you're going to be so sick of me you'll probably say we can't give him the caucus, just forget it. We can't stand the guy anymore. No, you're going to like me and we're going to be back and we're going to do a great job for you. Most importantly, we're going to get to that office and we're going to do the right thing. We're going to do the right thing. So a few things. A lot -- so much has happened. You know, when we first came out, we were all talking together. And we were talking border security, which we're just doing so great with the border security. We're going to build a wall. Mexico's going to pay for the wall, we all know that. We're going to have security. And the drugs are going to stop and people are going to come into the country but they're going to come into the country. They're going to be legal. They're coming in legally and that's the way, that's the way. And it affects Iowans so much. But -- so we were talking about that. We're talking about repealing Obamacare. Boom, it's going to be repealed, it's going to be replaced. I don't know if you've been seeing what's happening but Obamacare is a total disaster. It's dying of its own weight. And by 17, meaning, he'll be playing golf and I'll be working very hard. But by 17 it's dead, it's dead. You're not getting the people signed up. There's been a lot of talk about it and a lot of stories about it. Obamacare is dead but we'll terminate it quicker than that. And we will come up with something that will be so good, so much better. Premiums are going through the roof. Deductibles are so high that unless you're close to death, you're never going to get to use it. And even then I think you're going to get to use it, really. So we're going to take care of that. And by the way, we have a lot of good people. We have ethanol that nobody is really -- we have the ethanol, where the ethanol people, right? I was here a month ago. I met with them all and they do a fantastic job. I toured the plants and they do a fantastic job. And it's so important and it's another form of, let's stay away from old pack and let's stay away from that Middle East stuff. It's so important. So I just want to -- and actually, what I don't understand because the one guy that's doing pretty good with me in Iowa is Ted Cruz, and he's a nice guy. I mean, everything I say he agrees with me, no matter what I say. I was gonna do one really wild, but he agrees. But with the ethanol, really, it's -- he's got to come a long way because he's right now for the oil. But I understand that oil pays him a lot of money, he's got to be for oil, right? The oil companies give him a lot of money. So -- but I'm with you. I'm with everybody. I'm with everybody. Look, I'm self-funding. I have no oil company. I have no special interest. I have no lobbyists that want me and, you know, they're representing countries that are ripping off the country. They're representing companies that are ripping off our country. All I do is I'm going to be working for you, folks. We're going to do this thing together. We're going to make America so great again and maybe better than ever before. So, so important. So when we first started, I'd talk about China, how they're ripping us, and Japan and Mexico. Mexico both at the border and in trade. They're taking so many of our companies. Nabisco is moving there with their big plant. Ford is moving there with a big plant. They took a big plant away from Tennessee, a great state. They took it away at last moment. We're not gonna let that stuff. We're going to do -- we're going to get it. We're going to do what we have to do, OK? But I talk about that -- thank you. Oh, look at that group over there. Thank you. But I talk about that and I talk about it a lot. The fact is that about 2.5 weeks ago with Paris, I'm speaking a little bit differently now. Believe me, I can take care of China in my back pocket. That's easy for me. That's what I do. And we have all the cards. A lot of people don't know, you know, these politicians they don't understand. We have the cards. You know with China, our people pay tax. They pay no tax. It's not supposed to be that way. They call it a tariff because it sounds better, but we will take care that. We'll take care of all of that. What happened is with Paris, there's a different mindset. And when the polls came out last week, my numbers went way up because people felt more secure with me. Now, maybe it had to do -- yeah, really. Who knows why, who knows. But my poll numbers went up. And do you ever notice whenever there's something that I do that's proper but controversial, they say, now he's gone. It's it. That's it, that's the end. I won't go over all of the different things because maybe you'll change your minds, right? So I won't. But they'll say, that's it, it's over. And then they come in, sir, your poll numbers went up nine points this week. I said, they did? Because I have to do what's right. I have to do what's right. And you know what, if I don't make it, I don't make it. I have a good life. We all hopefully have a good, good life. I have a great family, nice people, wonderful people. They love me, I think. I hope. I think. But I have a great family and I built a great business. In fact, what -- thank you. Who is that person? I love that person. Stand up. I love that person. Thank you. Thank you, darling. I appreciate it. There's such spirit. You know, like, this has such spirit no matter where I go, it's -- you know, we go to Dallas, we have 20,000 people. 35,000 people in Mobile, Alabama, 20,000 people in Oklahoma. Wherever we go in Iowa, we have these crowds. This is supposed to be for -- in a round, this is supposed to be like a record. It is big, and yet it feels intimate. It feels good. And we're going to start taking questions. But I just want to say -- so I changed a couple of weeks ago. When I saw Paris, I changed. And a big, big part of what I'm doing now is safety and security and smartness, and smartness. It's sort of interesting, you know, the slogan is Make America Great Again and I'm adding, Make America Great Again and safe again because we don't feel safe anymore. And the problem we have now that we never had to this extent is the power of weaponry, it's the power, it's the tremendous power. You know, 100 years ago I would have said, let's not go -- I said, don't go there anyway. I said it strongly, don't go, you're going to destabilize the Middle East. But the fact is, right now, we're going to have to do things because we have some really, really sick degenerates. And it degenerates. And the press, look at all those cameras going all live. All, you know, nobody else has cameras like this. They can make a speech, 100 times I make a speech, nobody cares. Look at this. And don't worry, they never panned the crowd, you know, they never. They have me. That's why I'm walking around. I figured I walk around maybe they'll get the crowd. They never panned the crowd. I tell them to pan the crowd. They never do. I always go to my wife as she goes home -- I had a crowd 7,000 people last week. More, 7,000 people and in a confined space. It was there, 3,000 people outside that couldn't get in. My wife said, darling, the speech was excellent. Did you have many people there? I said, what? She said, well, they never leave your face. They keep it purposely. But I'll tell you, I figured the cameras may be a little screwed up where you can't move them, right? But every time there's a protester, while I'm protesting, and it could be in the back left-hand corner of the room, the cameras swoop over there. It's true, it's true. No, I used to think they couldn't move, you know. There -- maybe there's something with the crazy computers. You know, in the old days, everything was better, right? The car seats, you sit in your car and you want to move forward or back, you press a button, bing, bing. Now you have to open up things, press a computer, takes you 15 minutes. Well, the same thing I figured with cameras. I didn't think they moved. I figured they were fixed for certain reasons. And then I saw a protester. And those cameras were bent in positions like you wouldn't have believed possible. So they're very dishonest people. What can I say? Not all of them, but most of them, most of them. The press is this, I'll tell you, you have one of the most dishonest right here in your backyard. The Des Moines Register is the worst. They are the worst. The worst. No, they're very dishonest. You have some reporter named Jacobs, she is the worst. She -- she goes in and she will write so -- it's such a misrepresentation. And so, I don't care, I mean who cares. So I'm saying it right in their backyard. They're failing anyway. They probably won't be in business in two years. They're losing -- I think they're losing a fortune. I think. You know it's funny, every time the Des Moines Register does a poll, I always do badly. And I believe, now of course I'm sure -- I'm only doing this so they don't sue me, but I don't mind if they do. I hope they sue me because they don't have enough money to sue me, that's a good thing. But -- but I believe, and I may be wrong, in fact, I'll say I'm sure I'm wrong, but it's my opinion that they don't do it properly. Because you know they poll like 300 or 400 people. I'll explain it. But I really believe that, you know, they lose 20 people, well, in the pocket. Oh, Trump, oh, forget that one, forget that. Now I don't know that they do that. Do you do that to Des Moines Register? But every time I'd have a Des Moines Register poll, I'd do poorly. I also do poorly with the Bloomberg polls, I don't know why. But we had a great poll come in CNN last couple of days where we're leading, I think, by 13 points and in Iowa, in Iowa. And then we had another one come in where we're doing well. But I think Des Moines Register, somebody said it's coming out sometime, I'd just tell you, watch, Trump disappears. I think we're going to do so well. I think we're actually going to even do better, you know. We're leading in most of the polls. We're leading in every poll now, every poll except Iowa. There was one poll, there was one poll, Monmouth. I never even heard Monmouth. What the hell is Monmouth? What is Monmouth? Explain it. I don't like Monmouth. You know why I don't like it? Because they always treat me badly also. But I only like polls that treat me well, right? But -- but we're doing so well. Nationwide, we're leading every poll by tremendous. We just had one in Georgia, 44, 44. That's -- figure that, that's 44 with 15 people. I'd take 44 if we had 3 people. I don't think I'd take it if we had two people but I think I'd take care of it. But 44? A CBS came out, as you know, you probably saw that New York Times two days ago. And we're 35 to a small number. We're killing everybody in every poll. Just one little outlier here and I'm sure, again, when Des Moines comes out, I'm sure it'll be a negative because I don't believe -- I don't believe that poll. But -- but we are going to win. And I tell what, honestly, Iowa is so important to me. I could say, oh let's not do -- I am an Evangelical, I'm a Christian, I'm a Presbyterian. I'm a Presbyterian. I love Billy Graham. Franklin Graham came out with the most beautiful statements, Franklin Graham. He was so incredible. He came out -- I don't know if you all saw the statements he came out with about Trump, right? Stand up, please, right? Come on, stand up. You look great. Don't worry about it. Is that right? He was so incredible. Franklin Graham was amazing. The son of Billy Graham who was, you know, there's nobody -- nobody that I've ever seen. Billy Graham was unbelievable. If anybody's going to his crusades, that were incredible. But -- so I think we're going to do, you know, we're doing really well with the Evangelicals. And by the way, and again, I do like Ted Cruz. But not a lot of Evangelicals come out of Cuba, in all fairness. It's true. Not a lot come out, but I like him nevertheless. But I think we're going to do great and we are doing great with Evangelicals. We're doing great with the Tea Party, leading with the Tea Party. And we're doing fantastic with old and young and middle and we're doing great with everybody. And so it's very important for me to win Iowa. Now, I could take -- put less pressure on myself and I could say, oh I don't care about Iowa. I don't care. But I do care. I do care so much about, that's why I'm here all the time. And then the lies happen. You know, when I was using Iowa, they lie so much. I said, the people of Iowa can't be that stupid or dumb. The people of the country can't -- I'm trying to make a point, right? So I said the people of the country can't be that stupid. Well, they cut the country out, so I was referring to Iowa. I love you, people, remember that, remember. I was talking about something and I won't even mention what I'm talking about because the guy I'm talking about, and was -- was actually a very good guy. But I will say this, we want to win Iowa so bad because if I win Iowa, I think we'll run the table. I really do. If -- I think we'll win the table. We'll go right through because we're leading big in New Hampshire every poll, big, big in New Hampshire. Christie got an endorsement from this crazy newspaper up there. It's the weirdest deal I've ever seen. And it was -- you know, the paper that was in his state called up, said, are you sure about that? Nobody ever called us. They can't believe it. And we could go into that but it's irrelevant. But we're leading New Hampshire, big. We're leading in South Carolina like monstrous numbers. We're leading the SCC, Nevada. We're leading in Texas. We're leading everywhere. We're leading big in Florida. Now you have Rubio, nice guy, by the way. You have Rubio, and he is a nice guy but, he got to vote. You know, when the people put you in position to be a Senator, you got to go and vote. You can't be the number one person that doesn't vote in the Senate. You've got to say, hey, you know I'm a young guy, I want to go and vote. He should stay there a little longer. He's a good guy. Stay there, go in, vote create a nice record. But, I don't know, how's he doing in Iowa? Not too good, right? He's not doing well. How's he -- how's Rubio doing? Not good. I mean, it seems like a two-person race right now. It seems like a two per -- and it's an important race to me. So I just want to let you know it's very important. So with all of that, if we win Iowa, a lot of people say, we'd just go through -- I think we win virtually every state in the union, and it's over quickly, over quickly. Now, we're going to take questions and one of the questions will be, well, what about the Republican establishment? Establishment's got a problem. You know, it's sort of like the fighters, you know, the great champions. Sometimes they'll go into a hometown of the guy they're fighting. And they'll say, you know, we never want to get a decision. We go for the knockout because the knockout is the knockout. Because you get a lot of bad decisions. I know a lot about the world of sports, believe me. And they go into a hometown to fight and it's a decision, and they say, oh we're in a problem and they lose the fight that they won. The only way they win the fight, definitely knock out. So if we win Iowa, I think we're going to win everything after that. So I think it's going to show how important Iowa. And one thing -- and I'll pledge this, I'll pledge this to Iowa, even if I lose I'll pledge it, OK? I don't think I've ever said that my life. But if we go and win, Iowa's staying right where it is in the chain. It's not moving. You know, there's a big move, there's a big move on to move Iowa into a much further back position by The Establishment. Folks, I win, it's not happening, OK? You're staying right here. Because it's great. It's great, you know, it's great. And if I don't do that, Tana is going to be very angry at me. Right, Tana? How has she done? Is she incredible? Thank you. I appreciate all staff, I mean, Chuck and Stephanie and where's my big guy? Where the hell is he? Boy, how good is he on television, right? Where the hell is he? Where is he? Sam, big Sam, come here, Sam. Come here. Look at the size of this. Come here, Sam. Look at him, big Sam. Come here. Are we going to win Iowa, Sam? We're going to win Iowa. We're going to win Iowa. We're going to put him away. We're going to stand on their chests. We're going to step on their throats. We're gonna be out here. We're gonna run up the score. We're going to have the biggest victory in the history of the caucuses in the state of Iowa. Beautiful. Be careful. He did so well, I don't want him falling when he's leaving, right? Beautiful. Thank you Sam. He's a great people. And I'm gonna be here, that night, I will be here with you. I'm going to be here that week and maybe a couple of weeks before all the time. So I'm going to be here because I'm going to watch you. I'm not going to give you any chance that we lose it, OK? So let's take a few questions and we'll have a little fun and we just did a big interview with CNN just before this and you know Hillary, was Hillary missing today? What happened? She was two hours late. She -- no, did you hear? I just read and I may be wrong. And you know if I'm one minute off they'll call me because they love Hillary. But -- they love her. You know why. I don't know why. Why? I'm trying to figure -- now I heard she was a couple of hours late, everybody left. You know what happened? She was sleeping. I'm telling you, she couldn't get out of bed. She was sleeping. She was sleeping is right. OK, let's take some questions. Go ahead. OK. Yeah. So Mr. Trump we have Sue from the AARP. She's got a question. All right, good. Hi, Sue. Hi Mr. Trump. Good to see you again. Thanks for coming back. Thank you. Thank you. The Social Security Administration reports that by 2034, if nothing is done to update Social Security, the average Iowan is going to lose in 2034 15 -- 25% of their benefits which calculates to about $4,000 each year. So our question to you is this, what will you do to update Social Security? What are your specific solutions to update Social Security to put it on stable ground for future generations? Great. I'm so glad you asked me that question. And so you've been paying into Social Security and Medicare, by the way, let's put him in there because Medicare does work. With both, you have tremendous waste, fraud and abuse. We're gonna take care of that, OK? But we're not going to cut your Social Security and we're not cutting your Medicare. We're going to take jobs back from all these countries that are ripping us off. We're going to become a wealthy country again and we're going to be able to save your Social Security. We'll not take it. Now, think of it, now I can't believe this number but I read over -- who is the man that told me the number? Over 6 million people, I can't believe it, are aged 112 and over are getting Social Security. Who's the man that told me that? It was around here someplace. He said, oh Mr. Trump -- but I heard it. I read it. A tremendous, like 6 million people are getting Social Security, they're dead, meaning somebody else is picking up the -- because we know -- who is that man? He's over there someplace, OK. Six million people more and I read that he just came up to me tonight to say, now it's an amazing statistic, the press is going to have to check it because what do I know, but can you imagine, you have six -- now we know there's not six million. There may be one, but there's not six million. Anybody in this room 112 or over? Because if they are, I want to shake your hand. But -- so six million people over 112 years old picking up social security, and that's the beginning. So there's tremendous waste, fraud and abuse. What we're going to do is we're going to save Medicare, we're going to save Social Security. You're going to get your pay. We're not going to raise the age and we're not going to do all the things that everyone else is talking about doing. They're all talking about doing it. And you don't have to. We're going to bring our jobs back. We're going to make our economy incredible again. My tax -- my tax proposal, which is in great detail in terms of policy, and it's gotten tremendous reviews from a lot of people, a lot of great groups. But -- but we are going to cut taxes tremendously for the middle class and for businesses because our middle class -- our middle class is being decimated. And Sue, when that happens you're going to see an economy that takes off. We're going to get rid of a lot of that debt, if not all of it, but we're going to get rid of it as soon as -- you know we're at $19 trillion going to $21 trillion right now. You know, if you go back eight or nine years, trillion wasn't even a word that anybody knew. And now it's like routine. So we are going to save your Social Security without cuts. We're going to bring the economy back. We're going to make ourselves rich again. A woman said to me in New Hampshire recently, she said, Mr. Trump, I'm voting for you, I love you, but it's very crude when you say you're going to make our country rich again. I said I know it's crude, it sounds bad but many things I say are crude. It sounds bad but we can't make our country great again unless we make our country rich again. We can't let everybody in the world rip us off. Remember, remember we rebuilt China. The money they took out of our country, we rebuilt China. You go there, they have bridges all over. They have bridges like the George Washington Bridge. Maybe I shouldn't mention that partic -- but like the George -- bigger like the George Washington Bridge. Only a few people got that one, that's OK. But we have -- they have bridges going up there. We have rebuilt China. They've taken our jobs, they've taken our base, they've taken our manufacturing all over the place. They've taken our money, they've taken our money. Not going to happen anymore, folks. Not going to happen anymore. Not going to happen. I know the great business people -- we have the greatest business people in the world. Guys like Carl Icahn, he calls me, Donald, I want to help, I want help. The smartest people come -- we're not going to use those special interest guy a donor. We use donors to negotiate with China because he gave some guy like, you know, whoever it might be because, again, I'm the only one to self-fund in my campaign. Everybody else isn't. And when these guys, when these guys give money to politicians, to a large extent they own those politicians. They will do whatever the hell the special interests and the donors want. It's not going to happen with me. So Social Security, we're saving it. Medicare, we're saving it. We're going to make our country rich, OK? Thank you, sweetheart. Thank you. OK. OK, Tana, go ahead. All right. We've got a question back here from Jeff. Jeff, what's your question for Mr. Trump? Hello, Mr. Trump. Jeff Morin from Ankeny, Iowa here. And I have a question on behalf of Veterans for a Strong America. I love the veterans. Am I good with the veterans, Jeff? Very much so. I love the veterans. That's the other group. We're leading with the veterans by like -- forget it. Go ahead. I have a question here. I like to read it and make sure I have all of it. Strong America -- The Vets for Strong America had, in their 500,000 supporters, endorsed you this past summer. Right. Since they -- since then, the VSA has collected in the Senate. Come on Jeff. You knew you were doing this. I know, I had to get -- I had to read here, very sorry about that. Come on. You're gonna get fired. All right. I'm a little bit nervous, all right? OK. But they collected tens of thousands of signatures and they want to deliver that to the Iowa campaign office. And those signatures are to talk about General Petraeus and the comparisons between Hillary Clinton and General Petraeus and the double standard that is taking place. When you get into office, will you instruct the Department of Justice to take care of -- and take care of Hillary Clinton's accountability. Yes. It's called -- see, what I like about Jeff, he started off weak but he finished strong. That was a long route, hey Jeff, that was a long route to get to a good question. Yeah, it's called the statute of limitations, right? And you know it's a six-year statute, maybe five but it's probably six. But it's a six-year statute. Yeah, you have to look at it. Look, Hillary Clinton -- you know this story. It's a crime. She committed a crime. Now, perhaps, perhaps somebody -- you know, we have to have a fair justice department. And perhaps Jeff will have some really good Attorney General that's going to say, well, you know -- and look, we want to be fair with everybody, OK? including Hillary Clinton. But she committed a crime, in my opinion. Now, she shouldn't be allowed to run. She's being protected, absolutely. I have little doubt that they're going to find anything but they've already found it. I mean, you watch television, you have all these big scholars coming, these lawyers. Yes, she violated section so-and-so. Just one after another. I mean, actually violated many, many laws not just like a little bit here, many laws. You mentioned General Petraeus, his life was destroyed. Over 5% of what Hillary Clinton did, over nothing. So I think she's going to be the nominee, definitely. The only question is whether or not she'll be allowed to run. She's being protected by the Democrats. She's being protected by the President. And that's why, why do you think she's going along with these insane policies of his, OK? I mean, she goes along with everything. I don't even -- honestly in all fairness to her, I don't think she believes it. But I think she's afraid that he's going to say, listen I don't like her anymore. Go take care of her, I'm going to get somebody else. I'm telling you. So the question is statute of limitations. It's a five-year statute of limitations. She's got a problem, she's got a problem. In one way she's running for her life. Because I know one thing, if she wins that's the end of that, right? But if she loses, she could have a very serious problem. OK. Another question, please. All right. We have got Eric over here, what's your question for Mr. Trump? Hi Eric. Hi Mr. Trump. My name's Eric Durbin and I'm asking a question on behalf of the Iowa Grassroots Coalition. We know we have Syrian refugees that are coming in and we can't vet them properly. We know they're coming through the southern border. What would you do immediately on the southern border? It's always exciting. Keith, out, out, get him out. Get him out. Boo. Get him out. Get him out. USA. USA. USA. USA. USA. USA. That's a Hillary supporter. You know, I always say -- here's the sad thing. So a guy like that -- so a single person, always wants to be right in the line of the camera, right? Stands up. He's gone in a couple of minutes. Tomorrow the headlines, protest that -- it's really sad. We have like 2,000 people here and that the headline will be this -- wait, I got to say, this person. Sorry. You know, it's sort of interesting because I've learned so much doing that. I never did this before. I've been doing it for five months. I've never been a politician. I hate being a politician. I mean, I know politicians so much. If you can't make money with politicians, there's something wrong, OK? I know them so well but I'm a politician, can you believe it? But it's -- it's amazing. I see these people, and sometimes, you know, I'll go through -- I've had 20,000 people, no single -- not even a murmur just love. But every once in a while you have somebody stand up, every single time it turns out to be a big story and it's a shame. It's really a shame. It's really unfair. And that, to a certain extent, is the press also. OK. Go ahead, Tana. So until we were so rudely interrupted, Eric, why don't you go ahead and ask your question again. He'll probably have another one stand up at some point you know. They're lurking, they're lurking. So we have Syrian refugees coming in that we can't vet properly and they're coming in through the southern border. What can we do right now to protect the southern border? Thank you. Well, I said right at the beginning, we're going to build a wall. It's going to be a real wall, going to be a real wall. It's not going to be -- you see that ceiling? That ceiling is nothing compared to the wall. And we can build it, and we can build it right and it'll be strong and powerful and as beautiful as a wall is going to look. It's got to be beautiful because someday they're going to name it the Trump Wall. I know that, it's going to happen, it's going to happen. And it's going to work. And you know, walls do work. You know, they wanted to build a wall here 20 years ago. You know they couldn't get environmental impact statements, that just shows you. China is building in the South China Sea massive military bases, right? Why? They're not supposed to. They have no respect for Obama or our country. They're not supposed to be doing that. And you can get them to stop just by saying we're not doing business with you anymore. The whole -- the whole economy -- what, you don't have to go to war. It's economics. The whole country would collapse in two seconds. Believe me, we have such power and we don't know it. But they're building massive -- now they had little islands, they put the biggest excavators, not Caterpillars they used -- I think they're using Komatsu from Japan, which is pretty tough. They have these massive excavators. And I said to a friend of mine who's Chinese from China, very rich guy, very successful guy, paid me a fortune for an apartment so I happen to like him, OK? I said jokingly, how long did it take them to do these massive islands, they're building right out of the sea, boom, those shovels go in, take out everything. How long did it take you to get the environmental impact statements? He laughed. He said, what, are you kidding me? Nothing. They say, we will build there, about two seconds later you have excavators digging. So we had a problem with -- because the environmental -- look, I've won many environmental awards. I'm a big believer, especially in clean air and clean water. I'm a big believer, just so you know. Big. And I've gotten so many awards for the environment. So I understand the environment. I've won many, many awards. But when you look at how we're impinged and hurt, but the wall was stopped because they couldn't get an environmental impact statement among other things. They couldn't get an environmental impact statement. Now there was probably a snail or a turtle or a snake or something. You were ruining the habitat of a rattlesnake, I don't know. But they actually had people, a lot of people, people that now would be against it, but they wanted to build a wall years ago, they couldn't get it done. I heard, you know, I said bomb the oil, right? I spent time there for three years. Now finally they start bomb, after Paris, they start bombing the oil. I've been saying it for years. You know, one of the reasons that we didn't bomb the oil, they didn't -- Obama didn't want to hurt the environment. Now I heard that and I thought it was -- I thought somebody was kidding. I thought a comedian was saying it. It turned out to be true. He didn't want the flames and everything going into the atmosphere. This is the way we fight today. I'm telling you, folks, we're being led by stupid people. We're being led by stupid people. And you know, I said -- I've been saying not really bomb, I've been saying take the oil. I didn't want to go into Iraq. But once we were there, I said when we left -- look, we shouldn't have been there but then when we left, we left the wrong way. First of all we have a president who told them a date. We're going to leave on such and such a date. When was it, like 18 months later? So the enemy all of a sudden said, wow, because they don't believe it. They didn't want to be killed, OK? They didn't want to be killed. So the enemy said, they're going to leave on a certain date? So they pulled back, the day comes and now you see what happened. It's a disaster. And Iran is taking over Iraq. So anyway, I couldn't believe it when they said that. When we sent our 50 soldiers two weeks ago and our President gets up and announces, we are sending 50 soldiers. OK, first of all, he thinks it's a good press announcement, it's not. 50 soldiers, it's not a lot even though they're the elite. But those 50 soldiers, because of that announcement, have a target on their heart. They have a target on their heart. What does he have to say that for? Why can't he let 50 soldiers go there quietly, stealth, stealth. Why can't he just do that? Why can't he do that? Those 50 soldiers are in grave danger today because of that. And they probably don't even know that but everybody's looking for them. And that's the way it is. We have people that don't know what they're doing. We used to have General MacArthur, Douglas MacArthur, General George Patton, I mean, these were real people, these were real people. Today we have generals, they go on talk shows and they say, oh, I mean, I saw a General the other day on a talk show. He said, and this was serious, and he's a good man, they're good men. But you got to lead these men, even the generals you have to have some power over them. He said, we are in the worst shape in terms of preparedness that we've been in in decades. And this is a time where we have to be in the best shape because the world wants to kill us. And he said, we are in the worst shape that we've been in in many, many decades. Now, number one, he shouldn't be saying that because you're telling the enemy that. And the enemy feels emboldened when they hear that, right? We shouldn't be saying it. We shouldn't be saying it. I mean even if it's true, you don't say it. You get it fixed and you put -- you do it the opposite. One thing I'm going to do, I tell you, I'm going to build our military so big and so strong and so powerful, so powerful that nobody is going to mess with us. Nobody is going to mess with us. You know, in many ways it's the cheapest thing you can do. Everyone's toying with us right now. It's the cheapest thing you can do. The absolute cheapest thing you can do, OK? Come on, Tana. All right. We've got Roger right here. Roger, what's your question? Hello Mr. Trump, Roger Burdette. Hi, Roger. What is your response to those who want to enact more laws regarding firearms in an effort to keep evil people from doing evil things with firearms? Yeah, you're right. I mean it's -- your second -- I'm a big Second Amendment person, by the way. Yes. Come here. Get up here. Come here. Get over here. My gunman, get over you. Come here. This guy, he has one of the great places -- might as well give him some free publicity. What the hell, he's out here. My son buys weapons from him. My sons are in -- members of the NRA, so am I. Come here, come here. Looked like somebody was aiming at him up here. So, you know my sons, right? They're serious believers in the guns, right? What's the name of your company? It's called Brownells. We are the largest supplier. Thank you all. And you have a great company, and my sons love their equipment. And this is long before I was ever even thinking about doing this, right? Yeah, long time. Yeah. They begged you a lot of money? That's -- I guarantee. I hope they're negotiating a little bit. Thank you very much. It's a great company. Thank you, man. Be careful. Thank you. Now my sons are really great marksmen. They're big believers. And I'm a member of the -- I'm a member of the NRA but I'm not such a good shot. But they're great shot, so it's one of those. But if you think about that question. So you know there's tremendous pressure to get rid of the guns, get rid of the magazines, no bullets. How about the one where they have three bullets in every magazine, it holds 12 and house 23. So the people with a lot will put three bullets in. I don't think the bad guys are going to say, well, I don't want to break the law. I'm going to go kill people tonight, but I'm going to put three bullets in, right? These people, and you know, I have arguments with them all the time and I'm a practical guy. Honestly, if I didn't believe this, I couldn't say it. So in France or in California, if you have -- I have a permission to carry, which is a big thing in New York. It's very hard to get. I have a license to carry. OK. But -- but in France or in California or in all these places where you see the shooters, right? If -- instead of having hundreds, like in France, hundreds of people in that room -- Paris has the toughest gun laws in the world. France has the toughest gun laws in the world. Nobody has guns except the bad guys. So they walk in with or they walk in with the worst, the toughest, the best weaponry you can have and they said, over here, boom, over here, boom. So they kill 128 but many more are dying right now. They're in terrible shape in the hospitals. They just wipe the place out and they could have stayed there for longer. They wiped it out. Then you had those two sleazebags from California. The married couple. I saw the press. The young married couple that did the shooting, they're not a young married couple. They're the worst, they're sleaze, you know. The young married. They say the young married couple, that's no young married couple. So they walk into a place and they kill 14 people and others are going to be dying probably because a lot of other wounded people. But if somebody had guns in there, nobody had a gun, if somebody -- if these guys, look at this guy right here, stand up. How would you have done if you had a gun? Would you have been firing back a little bit? They'd be in trouble, right? They would have been in trouble. Believe me, that guy. So you know, I went to like the Ivy League College and I have a lot of friends, they're against guns and -- and I said, I argue with them, I talk to them. I say, OK, we're in Paris. You have all these places and there's hundreds of people, guys walk in with guns and you have no gun. Don't you think they would have been better if that -- well, Don, they can't -- they lose the argument but they never change their mind. So we have to fight for the Second Amendment. It's so simple, it's so simple. And believe me. Believe me, they want to take those guns away. And you always know that the bad ones are going to have the guns and they're going to have them more so than ever before. So we're going to protect the Second Amendment if I'm President, that I can tell you. And by the way, we're also going to be saying Merry Christmas again. Do you ever notice, do you ever notice? That's right, Brad, Merry Christmas. And by the way, Merry Christmas, everybody. Merry Christmas. And Happy Holiday. I have a lot of friends and, frankly, I have a lot of friends that aren't Christian. They like Christmas, everybody likes Christmas. It's politically incorrect to say Merry Christmas anymore. When I'm President, Merry Christmas, Happy Holidays, enjoy yourselves. Don't eat too much turkey, right? OK. So we're going to say Merry Christmas again, folks. We're going to bring our country, we're going to bring that spirit back. OK. Go ahead, Tana. All right. We've got Greg over here. What's your question? Hi, Greg Cummings with Tea Party Patriots. But this question comes through Eagle Forum directly from Phyllis Schlafly. She's great, by the way. Go ahead. Yes, yes. And this is her question. When nominated, what do you intend to do with Ted Cruz? Will you name him your Vice President? Or, or -- No, he's a good guy. He is a good guy. And so is Phil, is a great person, by the way. Or appoint him to the United States Supreme Court? OK. Thank you. It's interesting. That second is interesting because he is -- I really do, I'd like Ted Cruz a lot. And he's doing well, I'm doing well. I mean, it's not a contest between the two of us, just so we understand. We have to make that. But I do like him. And I would say that we would certainly have things in mind for Ted, to be honest with you. I mean, he's somebody that I could certainly say that because I like him, he likes me. He actually put out a tweet tonight, he said, Donald Trump is -- I think he used the word terrific, that's a nice word. You know, whoever hears that? I can tell you other candidates are not exactly saying that about me, right? Will you say hello to Phyllis for me? She's an amazing woman, amazing woman. OK. Go ahead, Tana. All right. We've got Ruth from Iowa Pays the Price. What's your question? All right, thanks. Hi. I appreciate that. You're not bought and paid for as Senator Bran has mentioned earlier. I know you've said super PACs are disgusting joke and that they're a scam. Our politicians have been corrupted by donors for years now. I'm wondering, if you're elected, how are you going to fix this mess and increase accountability in our campaign finances? OK, great question. So the super PACs are horrible. And I had many set up for me by people I didn't know. I mean, I'd see him on television talking about somebody named one, The Art of the Deal PAC. Two young guys, they look good. I mean, I don't know. But then, I got to be, you know, I started going around, and I see the corruption with these super PACs, where they're stuffed with money, people that put the money in are dealing with candidates, and the whole thing is wrong. And I see it. I mean Bush is $125 million. Think of it, $125 million. By the way, if he had $2 billion, it wouldn't make any difference, OK? But Bush has $125 million -- and honestly, he's a nice person, he is. I don't want us to do that, but he's a very nice person. But it's $125 million and you say to yourself, people give $2 million, $5 million, $7 million, you know what's happening. But some of the super PACs are running campaigns. They're actually running the campaign. Another thing -- and it's sort of interesting, one of the super PACs I believe has $6 million. Of the $6 million, this was reported on the front page of The Los Angeles Times, of the $6 million -- and one of the candidates, who's a nice person so I'm not going to mention the name, you know, when I like people, I like them. I'm a very loyal person, all right? Of the $6 million, after all of the bloodsuckers took their cuts, the fundraisers, can you believe this? They had $140,000 left for their campaign. That's better than being a real estate broker. I'd rather do that than sell houses. They had $140,000 left. It was in the newspaper, I don't know. I think, I'd believe it. But I've seen it. I saw it with the Romney campaign. Guys made tens of millions of dollars raising money for Romney. I say, what the hell is this? I mean, you get money and they get a cut. Look, our laws are so corrupt, our campaign finance laws are so totally corrupt. It's so horrible, so horrible. And I don't necessarily want to stop people from giving because I think that's a good thing. But you got to get away from these PACs. What you have to have is people have to know who it is. So you have to open up the process. Let people know, if somebody wants to give him $1 million, you give him $1 million. But everybody has to know that so-and-so gave $1 million. Because that puts a little pressure on guys like Brad who raises hundreds of millions, right, Brad? Puts a little pressure. But the concept of the PAC is -- it's no good, it's no good. It's -- it's -- it's a very dangerous, terrible thing. So we will change our comp -- our laws because you really have no choice. It's so out of control, it's so terrible. But the papers that are in this room tonight, they should look at this. There is so little money left over for the candidates. It's one of the reasons I'm so happy I'm doing my own. We actually sent legal letters to either nine or 11 PACs. The Trump PAC, the Trump PAC, this PAC. First of all, I'm sure that out of some of them, they stole the money. Some guy has no money, he sets up a Trump-something PAC, nothing to do with me, sets it up. All of a sudden he's got $2 million sitting there, right? People sending money. And you guys, you got no money. How much of that money do you think he's going to use to do what he's supposed to be doing? That's common sense. So maybe all of it, but I doubt it. So we sent legal notices to everyone that we could find having to do with Trump. We don't want their money. We said don't do it. We don't want it. And we want, you know, ideally give the money back to the people that gave it to you. But the super PAC concept is corrupt and it's terrible and it should be ended. And we're going to go to new campaign finance laws that are going to be terrific, OK? Thank you. OK. Go ahead. OK. We have got Kevin with America's Renewable Future. Hi Kevin. Good evening, Mr. Trump. Thank you for coming to Iowa. I'm a native of Des Moines, so on behalf of Des Moines, I'd just like to thank you for coming and thank you for supporting the Renewable Fuel Standard. You talked about this a little bit earlier. Senator Cruz is not in support of ethanol, he does not support renewable fuel. Can you tell me, do you think that's because of his ties to big oil? Yes, it is. It is. Well, look, he's from Texas. To the best of my knowledge, there's a lot of oil in Texas, right? So, you know, he gets a lot of money from the oil companies and he's totally against ethanol and everything else you're talking about. And I'm not, I'm totally in favor. And you know, it's a big industry here. It's a big industry. You know, if that industry is upset, Iowa's got problems because you employ -- I was amazed. I was here three weeks ago with the group. Any of -- any of the people here that were at that meeting? They were such amazing people, right? Stand up. It was -- it was such -- had a good meeting, right? And I learned so much about it. I was in favor of it even before. That's correct. I remember you very well. That's correct. How could you forget. But it was amazing, and looking at the plans -- but you know also beyond even the fuel capacities, which we want to create as much as we can, tremendous numbers of jobs in Iowa. And I said to myself, if Ted Cruz is against ethanol, how does he win in Iowa? Because that's very anti-Iowa. I don't know how he wins in Iowa. I don't know. But, no, I'm totally for it, OK? Thank you. Thanks. We've got questions? Yeah. OK. Yes. We've got Tamara over here, what's your question? Hi. I am -- I have the honor of serving Iowans as the Republican National Committeewoman. And so I do have a question for you on establishment or elite GOP, however you want to call it. I have to tell you, as the state central committee, we're neutral. So this is not to hurt you or harm you, it's for clarification. But when we see you make a statement, and sometimes it's controversial as we've noted, but after the firestorm -- sometimes purposely though. After the firestorm, the fact-checkers -- checkers come through and you're constitutionally sound. You agree with the party platform, I've not found anything where I see you in contradiction. Unlike there are other candidates that are in contradiction to the platform. You resonate with the public. You have unleashed America from the bondage of political correctness. Oh, thank you. Thank you. So here's my question. Why wouldn't a GOP and RNC be thrilled with a candidate that has the numbers you do, that is resonating with the public and is saying the things that, that is obviously -- Come on up here. Try to bring her up. So nice. You know, when she first started that question, I said, uh-oh, here it comes. And after midway through, I started -- I really appreciate it. Come on over here. Come on, get under there. You can get under. That's great. That's such a nice question. Thank you, darling. Come here. Thank you. Here, don't fall. Thank you very much. It's so nice, so nice. What's your name? I appreciate you running. I know there are a lot of other things you could be doing and we do appreciate you running. So I'm not going to fight you for the microphone, ever. So what -- why is it? Why would they not be thrilled that you are -- the numbers you have, the crowds you have, the message that you're bringing, you are reviving the heart of America. This is what we should want. Why? Well, you know, it's good. Thank you, darl -- be careful. I was a member of The Establishment six months ago. I gave $350,000 to the RGA, that's the Republican Governors Association. I gave tremendous amounts of money away. I was like the fair-haired boy. Once I said, I'm running this. What, you're not supposed to run. And then what happened, I ran against all these senators and governors and everyone said, well, I don't know. My wife said if you run, you're going to win because she understands that I like people, I love people and people love me. And she said you will run but you have to actually go and run. You have to announce you're running because nobody is going to believe you're running. And so I didn't announce. I didn't want to announce because I didn't want to, like, announce and then things didn't work out. And I'm like some of these guys with a zero. Many of them is a zero. And so finally I said, look, let's -- we're going to do it. We have to -- just too many things that I watched on television with our President and the decisions that are made -- Bergdahl, where we get Bergdahl and they get five killers. We get this horrible, dirty, rotten spot -- he's a terrible traitor. We get this horrible, terrible, traitor. And they get five killers that they've wanted for nine years, the worst killers. And they're all back on the battlefield. You know, so many decisions -- the Iran deal. The Iran deal, how bad is that? They self-inspect. Oh, OK. Good. We're not building. We promise we're not building nuclear weapons. Oh, OK. That's OK. And we give them $150 billion and we don't even get our prisoners back. The whole thing is crazy. So I saw this. And I said to my wife, hey, I don't know if I'll do well or not. Who the hell knows? And it's a risky thing. You know, I've always heard, if you're a very successful person, you can't run for office especially for President. And I see it all the time. And the people go after me. I don't even care at this point. I said we have to do it. Now we're gonna have to do it. And I looked at it, last time with Romney, and I didn't do it and I probably should have because he let us down. I mean, look, he let us down. That was an election -- we had a failed President. Four years ago he was a failed President, just as bad as he is now. And Romney -- it's true. And Romney let us down. And that last month it was like he wasn't even campaigning. I said, why aren't you on Jay Leno? Why aren't you on David Letterman? Why aren't you doing it? And he just didn't do it. OK. So he lost the election. So I backed McCain, he lost. I backed Romney, he lost. This time I said, I'm doing it myself, OK? We're going to win. We're going to win. But -- but there is an establishment out there, it's a real establishment, real people. And they're people that are used to having their little puppets all over the place. And they're people that are used to giving donations and having control and they're people that you know, look, when they call me I'll treat them with respect. But I'm not going to be doing bad things if it's bad for the country. I'm not going to let Ford build a plant in Mexico if I can keep it in Michigan. And -- and I'm not going to let the car companies and Nabisco and all these people and all these companies -- I'm all for free trade. I think it's great and I'm for it. But it's got to be smart trade. I'm not going to let them move to Mexico and then sell stuff over the border with no tax, no nothing. So we lose our jobs, we lose our factories, they go over here, they make it, we let him come through. What -- how does that help us, folks? I went to the best business school in the world. Believe me, it doesn't help us, OK? Trust me. And we're not going to make deals like that anymore. We can't. We owe $19 trillion, we can't. So The Establishment is not ever probably -- I'd -- look, you know what, in the end, if this country starts humming, even The Establishment they'll be saying, OK, it's a good thing. Because they'll be beneficiaries also. But we do have a real establishment, and they've never seen this happen before. A writer called up and he said, recently -- I told the story, I mean, one of the top journalists, to my way of thinking, certainly in the country and beyond. And he said, Mr. Trump, how does it feel? I said, how does what feel? How does it feel? What you've done has never, ever been done before. I said, what have I done? You've dominated -- there's something they called the Summer of Trump, now they call it the Autumn of Trump. Hopefully, they're going to call it the Spring of Trump and, you know, I want the next Autumn of Trump but I said -- I said to the writer, I -- I don't know what you're talking about. I haven't done anything because, frankly, if I don't win, I consider this to be a total waste of time. I'll be honest with you, as much as I like being with you tonight, because we won't be able to do anything. He said, no, no you've won. Even if you don't win, you've won. Or -- I said, no you're wrong. If I don't win, if I don't win, I have not -- I have wasted my time. So you know, the point is that The Establishment can't believe it because they've never seen that happen before. So Time Magazine, I was on the cover of Time Magazine four or five weeks ago. And Time magazine was going to pick the person of the year. Everybody, even my enemies, said Trump is going to win. I said I won't win. They said why? I won't win just like I should've gotten the Emmy for The Apprentice the first three years I was nominated. I should have. And I said I'll never win. I told everybody, I'll never win because I'm not Hollywood establishment. And with Time Magazine, I said, I will win. Bill O'Reilly, who's a great guy, did an editorial at the end of his show two days ago saying, nobody has done more than Trump. He should've won. Now, I'm not saying I should have -- I probably should have, in all fairness. But he said nobody's done more. You know, taken over -- what we've done has been amazing. All of us together, not just me, it's not just me. It's all of us. It's all of us. From Dallas and Mobile and Oklahoma, all of us. Because the spirit -- but Bill O'Reilly had a whole big thing. And other shows where they said Trump, Trump, who do you think? Trump. Well, Merkel got it. Now Merkel, what did she do? She's destroyed, I mean, she's in the process of destroying Germany with the migration. We have to help the people with the migration. We have to create a safe zone someplace in Syria. But I don't want them coming into this country. I don't want to because we don't know who they are. We don't know who they are. Them with their printing presses that now do the forged -- the forged passports, OK? You heard about that. So we don't know. So the bottom line on that, it's such an interesting question. You'll know in about a month or two whether or not The Establishment has treated me fairly. But the only thing I can say is this, if I win Iowa, I think it's over. I said before because I think, if I win Iowa, we're going to have -- New Hampshire is amazing, people are amazing. You would love the people. They would love you. You love everybody. The whole country is in love. They want some -- it's called like, I call it the noisy majority. It's no longer a silent majority. It's a noisy majority. But if we win like I think we're going to win because we have such a big lead, honestly, it's not going to matter. They can't do anything. I don't care about The Establishment. They can't do anything. You know, the only way they can do is if I'm a little bit short. If I'm two votes short, I have a problem because I have to go into that convention. I'm dealing with all these bloodsucker politicians and they'll make their deals and they'll have all their money guys around and they'll be in the back room making deals. But if I get the number of delegates, there's not a thing they can do. And I'll end up doing fine with the Esta -- again I was a member of The Establishment six months ago. So -- but it's a very nice question. I appreciate it. Thank you. OK. Tana? OK. We've got Heather. Heather, what's your question? Hi. Heather Stansell from Earlham, Iowa. My question is regarding education. In the past, you have come out against Common Core. Absolutely. That was an easy one, I'll tell you. But Common Core is actually a symptom of a larger disease and that is the fact that government thinks they know best for our children rather than the parents. With the recent passage of the Every Student Succeeds Act, the backroom deal made by Republicans and Democrats basically kept the federal entanglement in education. What will you do to return power to parents and make them have the choice on how to educate our children? Thank you. So, Common Core. I'm such a believer in education. You know, I had an uncle who was a professor at MIT for which -- he was a brilliant guy. They just wrote an art -- in fact, I just retweeted an article about him today, you got to read it, OK? @realDonaldTrump, you have to read it. When I see somebody like Jeb, strong -- and I tell you one thing I respect, he didn't change his views. He knew he was getting killed on this issue and he didn't change. And I respect that to a certain extent, but it's so wrong. Common Core is a total disaster. We have people -- we have people, bureaucrats in Washington, telling you how your child should be educated in Iowa and New Hampshire and all of the different places that we go to. It's ridiculous. And I go around and I see the principals. I've seen so many students and teachers and professors and principals. And I've seen some of the people and they love -- even in Iowa at a school, I've seen some of the love that these parents give to those schools. This is real love. These are smart people and these are people, they're not working for a paycheck. These are incredible people and I've seen one came back -- remember this, our educational system is a mess. We spend more money per pupil as a government than any other country in the world, and we're in 28th place. And I mean, like double what anybody else placed. So I want to bring education back to the local areas. You're going to have parents and you're going to have unbelievably talented people and they love their kids and they want their kids to be well-educated because it's so important and you have to be very happy with it, OK? Thank you. Thank you. OK. We're coming down to Logan. Logan, what's your question? Hi. My name is Logan Perry. That kid is tough-looking cookie, right? Go ahead. And I'm representing the Rural Electric Cooperatives, and we were wondering what your plans are for providing clean, safe, reliable and affordable energy? That's right, that you people do it. And I've gotten to know you, I've gotten to know you really well. You people do it. We're backing you 100%. The job and the spirit you all have, it's always -- you're always perfectly attired with your green, but we are backing you 100%. You do a phenomenal job. There should be more people like you in this country. You know, the whole grid is a disaster, right? I mean, the whole -- the whole country, the infrastructure of our country is falling apart. And nobody can build like me. That's what I do, I build, I build. I'm building on, as you know, in Pennsylvania Avenue, a big, tremendous hotel that I got from the government to the United States. Can you believe -- during the Obama administration a couple of years ago. But we had the best plan, the best is the GSA is terrific. They're very good. Very -- actually they're very talented people. We're under budget and ahead of schedule. That's what we do. When you see these things where they're building a bridge and it's going to cost, you know, $1 billion that would have cost $12 billion. How about when they built a hospital, they'd cost $3 billion. And I'd look at it, I'm very good, I can look at a building and tell you how much it's going to cost. I'd say $250 million. No, sir, $3 billion. $3 billion? You think somebody got rich on that one? So we're going to stop all this stuff. We're going to make our country so strong and so wonderful and we all love it, anyway. We love it, but it's so sad to see what's happening. It's so sad. And we're going to change it around. Where's Tana? Are we all finished with those questions? Do you have one, Jill? Yeah, we've got one more, OK? The last question. Joe McCray. You know, Tana doesn't let up. She's brutal. Corey, she's brutal. Well, she -- she had -- she did a good job on The Apprentice, though, right? I had a really good mentor. I had a good mentor. You know, I'll tell you. And there's another special person who did a great job on The Apprentice, Shawn Johnson. She's another champ. She is another one. And she's an incredible young woman and she's getting married, whatnot. I'll tell you what, Shawn Johnson, right, Tana? Oh, she's great. She's fantastic. And so, say, where -- wherever Shawn may be, say hello to Shawn. She's great. Go ahead. OK. Mr. Trump, can you talk about your jobs program? We don't have enough work to pay people a living wage today. True, that's true. We have such a problem. And the biggest problem I have, you know, it relates to education. And the hardest thing you get is when you go around and you see students. And so many students come out to hear us and they always want to talk about the loans where they have student loans. And they're going through nice colleges, they're good students, they work hard, they can be really top in their class. And they get out and they say, Mr. Trump, we have no jobs. We can't get jobs. So they're borrowed up to the hilt and they can't get jobs. We're going to bring our jobs back from China. We're going to bring our jobs back from all these places overseas that have stolen our jobs. We're going to bring our jobs back from South America. We're bringing them back from Mexico. We're going to have jobs again. Believe me, we're going to be manufacturers again. We're going to start making Apple computers in this country. What the hell good does it do to make them in China? I want to make them in this country. And we have the ability to do it. So we're going to bring our jobs back, OK? Well, ladies and gentlemen, I just -- this has been a lot of fun. This is the first time I've done this kind of a thing, but it's been amazing. And -- yes? Thank you. Thank you. I thought you were a protester at first. I said, oh, isn't that a terrible way to end? A protester in your final four words. Now that was very nice and thank you. And we love the military, right? We love it. So I just want to thank you all for being here. We love you all. It's so important, Iowa was so important to me. And the relationships that I've developed here have been amazing. So we're going to make our country great again. We're going to make our country safe again. Thank you all for being here. Thank you. Thank you. Thank you."}