{"id":487,"author":"Donald Trump","title":"Speech: Donald Trump in Raleigh, NC","date":"2015-12-04","link":"https://factba.se/transcript/donald-trump-speech-raleigh-nc-december-4-2015","paragraphs":["Wow. Wow. Thank you. Woah. Thank you. Thank you. What a beautiful crowd. What a beautiful place. Beautiful. Wow. Thank you. Folks, we have a movement going on. This is not like, this is a movement. We're going to take our country back. We're going to be a smart country, not a stupid country, led by stupid people.","And we are going to win so much. We are going to win again. We're going to win again. So today, I woke up nice and early which I always do and I turned on television. You saw that CNN came out with a new poll, right? Did we see these polls, right? People say why do you always mention polls? Because I'm always number one in the polls for you.","For you, right? Well, very importantly, in other polls and in just about every poll now, we beat Hillary so badly. It's -- she has got and I mean this, there's no strength, no stamina. She cannot lead us. It's a corrupt deal. It's a corrupt deal. She shouldn't be allowed to run and we will put an end to it. We're going to put an end to it. Believe me. We're going to put an end to it. So the Fox poll has this beating.","Now CNN was amazing. I love -- don't you love this winning stuff? Isn't it great? But I have to tell you, as good as this is, we have to get out there and vote because you know it's never easy. It's never easy and we have a little bit of a structural disadvantage as Republicans and Conservatives. So we have to get out there and vote.","Now, Trump 36. Now, now think of that. You've got 15 people running and you have 36, that's good. Remember they said, I started off, I had six. They said, well, that's his plateau. Then the next week it went to 12, then it went to 18, and every week they say, well, that's his max. That's fine. Then it went to 20, then it went to 25 and 28, and every week.","Now it's at 336 and another poll has it at 42, 42, amazing. OK. So, we're in the CNN poll. We're at 36, second places is 16, then you have a 12, you have a four, you have a three, who's three? Bush. Bush has three. Bye-bye. You know I tell this and I'm embarrassed by it but do you see all the Bush commercials?","It doesn't stop. So he isn't -- he's so boring. No, no, no, not boring, low energy that's -- but I think somebody told me he spent $32 million. Hillary has spent more than that. He is spending money like you wouldn't believe. So I've spent the least amount of money and have the best result. That's what we want for our country, right?","The least amount. Wouldn't it be nice if we could do that with our country? Spend the least and have the best, right? Right? Amazing. Now, I'm self-funding my campaign which I'm happy -- so many people like that. It's like a big deal because you know one thing, all of the people that you know, when you're in number one position, they all call, oh, Donald, we want to give you $5 million, $2 million, $1 million.","I said I don't want it. Actually, I feel guilty because all my life I take, I take, you know, I take. That was our business to take. I don't want it. You know the shame is that it's one, it's one person and the dishonest media, they are dishonest. You don't believe how dishonest. They are the most, they are the most dishonest people.","I mean a big percentage of them. They are so dishonest. They are so dishonest. They will make that one person into the headline. Trump has -- they can't even use the plural. They can't put the s but they'll figure it out. But they'll say, Trump has protester. They don't say that. What do you have 10,000 - 12,000 people?","By the way, a lot of people -- look at them pouring in. There are a lot of people outside. I have an idea. Should we wait about 45 minutes let everybody come into the room? No. No, right? But you'll see that. I mean, you're going to see tomorrow, the protester, the one protester. So that's OK and be very nice to the protester.","You know it's funny. We always have a -- and usually we have none but sometimes we have a couple. And when I'm rough and I say, get them out of the room. Then they say, oh, that's terrible. Then when I'm nice, I say be very careful, be very gentle, don't hurt the protester. Then they say he was very weak tonight.","So you can't win. So I'm trying to cut it right down the middle. Now make sure that young lady is in beautiful shape. And if she'd like to come back in, do we invite her back in? I don't mind. I don't mind. But we're having a lot of fun. A friend of mine is a very, very substantial, really wealthy guy, and a tremendous negotiator.","We'll use him for one of these countries that are ripping us off. I guarantee. They won't be ripping us off long. But he said to me how do you speak all the time? Because no matter where I go and it's really not me, it's what's happening, and what we're saying. And I talk about the silent majority but it's not a silent, it's a noisy, noisy, noisy, incredible majority.","And it is a majority and it is a majority. But he said how do you speak in front of? And I don't use like teleprompters and I don't have a written speech and I'd like to have a written speech because it would be so easy. You read, ladies and gentlemen, and by the way, I love North Carolina. You know, I don't know if you know.","You know in Charlotte, in Charlotte I have a great club, Trump National Golf Club. It's a tremendous success and I love it. I love it. I think it's one of the most beautiful places. I have to tell you this. So I have places in Miami. I have places in Palm Beach, and places all over the place, OK? That's by the way, that's the kind of thinking we need here.","But I send my crews down to different places to fix them. I have roving crews. These guys they're like, you know, they're all over the place, and they come to North Carolina and they call me back, and they always wanted to retire to Florida. And they love Florida and I love Florida, and by the way, I'm winning in the polls in Florida against a Senator who never votes, right?","Now while I'm beating a Senator who never votes, you know, that's a little, and a former Governor, and we're winning by a lot but they come down to North Carolina not thinking about North Carolina, and every single time they come back, they say, Mr. Trump, that's where I want to spend the rest of my life.","True story. Five guys. I don't know if you want them. They're rough guys. I don't -- I don't think you should take them. But they're very good at what they do but they love it and I love it too. We have a situation in our country where we have a President who is out of control. He's out of control. I don't know why.","I don't know why. But he won't even issue the term. He won't say the term as to what's happening. And he'd rather, he'd rather -- think of this, he would rather you ask him what's our biggest problem. Now we have ISIS trying to blow up our buildings, our cities, and destroy us. And by the way, chopping off heads if you're a Christian.","We have ISIS, it's like medieval times. You know in medieval times they chop off the head. Whoever heard of this until a couple of years ago? How about the cage? They drowned people, and then people say to me, Mr. Trump, they chop off heads, they drown people in steel cages. I get asked by one of these characters a few weeks ago, Mr. Trump, what do you think of waterboarding?","And I said can we go a couple of steps beyond waterboarding? No, it's incredible. And then I get heat they say he's vicious, he's vicious. I mean, they chop off their heads. I say waterboarding is fine and they do stories about me that I'm -- that my tone is tough. You know Bush said that. Bush, he said Mr. Trump's tone, his tone is very tough.","Think of it. Look what the world is doing to us. They're beating us militarily. We can't beat ISIS. They're beating us militarily. They're beating us on trade. We go into Iraq and we spend billions of dollars in Iraq, billions and then, we spend with the final number, what's the final number? $2 trillion.","We lose thousands of lives. In Iraq, we have Wounded Warriors who I love all over the place. And what do we have? We have nothing. We have nothing. And do you remember I said keep the oil. Keep the oil. And you know what, for three years, I've been saying keep the oil. And they have people saying, what does Trump know about this?","Well, about a week ago, they started knocking the hell out of the oil but they'll beat it up. But they won't keep it because they're not smart enough. We should keep it. If we're going to take it. We should keep it. Do you remember? Do you remember the old statement to the victor? Correct belong the spoils, right?","We're the only people, we go in, we fight, we lose, most importantly, and sadly, we lose lives. We spend trillions and trillions of dollars. We leave. We get nothing. Now Iran is taking over Iraq and who's taking the oil? ISIS, ISIS, and Iran, and others. But Iran is going to walk in. I said don't go in because you're going to destabilize and I'm the most militaristic person in this room other than this guy.","This guy looks pretty rough I'll tell you. But I'm the most -- forget it. But you got to know when to do it. You've got to know when to use it. I want to build our military so big and so strong and so powerful. That nobody, nobody, nobody is going to mess with us. And we've got to take care of our vets. They're our greatest people.","They're our greatest people. We have vets that are in waiting rooms four, five, six, and seven days before they can see a doctor, and they're dying before they -- they are literally dying by the thousands waiting for service. And in some cases, routine service. They need a procedure. They need a pill. They need a prescription.","They die. They die and these are the people -- this is why we're here. We're going to take care of our vets. We want to take care of our Wounded Warriors who are our greatest and most incredible people. And what I wanted to do with the Wounded Warriors and with the vets, we take the oil and we give the families of people that lost people in Iraq and Afghanistan and other places, we give them money.","We let them have money because they need -- they got to get something. They got to get something. And we take care of those people. We take care of our vets. We take care of our military. We got to do it. And we're going to do it and we're going to do it as soon as I win. If I win, I'm telling you, we are going to be so proud of our country again.","When I see deals made where Iran who laughs at our stupidity gets $150 billion, we make a horrible deal with 24-hour day periods before we can go and inspect and before the 24 days it's a whole procedure. So the 24 days can be much longer. And how do you like where they can self-inspect? Iran can go and self-inspect and they can report back to us. Oh, Mr. President, everything's fine, everything's fine.","This is Kerry, this is Obama. They didn't read The Art of the deal. They are grossly incompetent people. They weren't meant for the job and we got to get them out. We got to get them out. And I'll tell you what, Hillary is going to be just as bad. Hillary is going to be just as bad. If you look at Hillary.","If you look at Hillary. Sure. Hello. Thank you. Thank you. Isn't it a shame? Look at this, thousands of people are pouring in, and we have to get rid of one person who's wasting our time. Look at all the people coming in. All right take them out, please. Take them out.","You know really it is amazing. With all -- look at the people pouring into this room. With all of the people here, we have to waste time on one or two people. It's really ridiculous. I'll tell you, it really is. But I have to be nice. I've got to be nice. So Hillary, in my opinion, will be just as bad. Do you ever notice she does an event, she wakes up, she does an event, she puts on a pantsuit, oh, it's true, she walks in. So she walks in and does an event, you don't see her for four days, five days.","You know why? She goes back home and she goes to sleep. This is not what we need as a President. We need tremendous energy. We need tremendous smarts. We need somebody that's going to get the job done. We have to get the job done. And by the way, you know I don't talk about this as much for the last two weeks because I'm now talking more and more border security.","We going to build the wall. Mexico's going to pay for the wall. We're not going to let people come into our country that we have no idea who they are, where they come from, they have no documentation, the possible Syrian Trojan horse. These are the strongest looking people I've ever seen, the migration. They're all men.","I mean, you look at it. They're strong young men. I say why aren't they fighting for their country? What are they doing? So we're going to win. So here's the thing. So I said they want to allow 200,000 and I've heard that number and I'm pretty good at this stuff. And if you look I've made a lot of right decisions.","But I'll tell you. Listen to this, so they say 10,000 now. It was 3,000, now it's 10,000. But in the Democrat debate, what was the number? They talked about 65,000, right? They want to allow 200,000 to 250,000, in my opinion, how stupid can we be? We know nothing about these people. We don't have any idea where they come from, military and the police have told us, the military and the police have told us there is no way in a million years of finding out where they're from.","I mean, we can't even do a website for Obamacare. We spend $5 billion doing a website and we're going to say where some guy comes, who doesn't have -- and I do like -- because we all have heart. And I do like building in a safe zone someplace in Syria. That's what Merkel should have done instead of what's going on in Germany is a disaster.","And we'll contribute and we'll help and we'll get the Gulf states who are so wealthy. We'll contribute, we'll help because we want to help people but we don't want these people coming to the United States. And if they do, if they do, and if I win, they're going back. They've got to go back. They've got to go back.","They're going back. We owe $19 trillion. See, they've got a strategy. One there, one here, one there, three different places. So, so far we're really a two people but I think it might be three. So remember this, we're going to have our borders back. We're going to create strong borders.","And I mean strong. We are going to build a wall so powerful and so tall and so strong, and we're going to let people come in but they're all coming in legally. We want them to come in but they've got to come in legally. We want them to come in but they got to come in legally, legally. So since June, what I've been doing is talking very strongly about trade and China and how everybody's ripping off our country and how we don't know what we're doing.","Over the last couple of weeks, since we had the tragedy, we all had the tragedy in Paris. Now we had another one, which again, was the same thing. How about the person that knew what was going on, said they didn't want to report them because they think it might be racial profiling. Did you see that? No, did you see that?","And I'm not sure, do I believe the person? Can anybody be that dumb? But they didn't want to report because they didn't want to be involved with racial profiling. We have become so politically correct that we don't know what the hell we're doing. We don't know what we're doing. So since June when I made that announcement, and I always tell you, it takes guts to run for President.","Don't kid yourself. It takes guts and not so much for a politician because frankly, that's all they do. They run, they lose, they win, who cares? Nobody cares, and by the way, watch the super PACs because the super PACs are controlling the politicians. They have total control over the politicians. And those are the guys that you're electing.","No super PACs here, no super PACs. We send notices out. We send notices out. We don't want super PACs or we send them out strongly. So just remember those are the people that are controlling your destiny and these are not people that have you in mind. These are not people. Just remember that. Oh, here's another one.","Here's another one. Look at this guy. Get him out. Get him out. Get him out, please. Look at the cameras taking his picture. He's happy. So that's too bad. Yeh, that's too bad. So what we're going to do now and what I've been doing is I've really focused on security. We need now security, proper security.","We have to bring the safety of our country back. When I announced I was running, I gave it a very strong announcement and I talked about illegal immigration. And boy, did I take heat or what? I took heat. Now what -- and I was right. And I think that was maybe what drove us initially. Now everybody is saying and we have this right here on the economy, trump 55%, on budget 51%, but listen, on illegal immigration 48%, on ISIS 43%, on foreign policy 30%. People know what's happening.","We want protection. We want smarts. And we're going to have the finest, we're going to have the safest country. And we're going to leave our Second Amendment and we're going to protect ourselves if we have to. We're going to protect ourselves. It's amazing when you think of some of the things you hear where let's not have guns.","Well, you know one thing, the bad guys are going to have the guns. The bad guys are going to have the guns. It's not going to happen anymore. We're going to protect our Second Amendment and we are going to have protection in our country. Remember that. Before we get to questions, we'll do a question and answer, before we do that, Common Core is a disaster.","We have one of the worst education systems in the world. We're ranked number 28 in the world and we spend more money per pupil than any other country by far. That's going to end. We're going to have local education. We're going to have local, beautiful education, and we're going to go shooting up the charts and we're going to save money.","We're going to save money. So I want you to ask them. Let's do some -- do you have the mic? Where's the mic? OK, let's go. Come on get with it. Give me somebody good. A vicious, horrible, terrible question. Now, go ahead. What would you like to ask? Turn on the mic. Yeah, go ahead. You got to turn on the mic.","Come on. Who's running this place? Go ahead turn on the mic. Try somebody else.","OK. Let's go. I hear it. Let's go.","Hi.","You're fired.","Go ahead, darling. Go ahead.","Come on. It","It was a terrorist attack. It was, it was a terrorist attack.","Well, I would handle it so tough. You have no idea. You don't want to hear. You don't even want to hear. You don't want to hear how I'd handle it. I will get myself in so much trouble with them. We are going to handle it so tough. And you know what we're going to do? We're going to get it stopped because we can't allow this to happen to our country.","We're going to get it stopped. And by the way, and by the way, by the way, if the people in Paris or the people in California, if you had a couple of folks in there with guns and that knew how to use them and they were in that room. You wouldn't have dead people. The dead people would be the other guys. So just remember that.","Remember that, right? OK. Go ahead, another question. Hello.","How are you?","That's amazing.","So beautiful. Where are you from? Where are you from? Here? Thank you. It's very nice. I appreciate it. Beautiful. Look at her. Tears come down because she's so -- she loves our country. I mean it's incredible. Go ahead. Go ahead. Yes, yes.","Merry Christmas.","Merry Christmas. I'll tell you what. You know I'm glad you did that because we are going to bring Merry Christmas back to our stores. We're bringing it back. Go ahead.","Yeah, well, look. Tremendous crimes, taking jobs, you have no idea what's happening. I call it illegal immigration. But you have no idea what's happening. We are losing our jobs. You say, Kate in San Francisco, Jameel, you know, Jameel. This wonderful, beautiful young boy shot, shot instantly. Killed for no reason.","And I got to know his father and his father is a great man and what he's living with now nobody wants to live with. Shot by an illegal immigrant. We're going to stop it and want to stop it now. Stop it now, OK? Thank you.","Hillary for prison?","Well, it's a very interesting question because you know, the statute of limitations is six years. What she did is illegal. There's no question about that. She's being protected by the Democrats because she's their front runner. We have to do something about it. We have to do -- it's not right. General Petraeus essentially got two years.","I mean, what this meant they destroyed him. Other people went to jail for much less than what she did. I think she's going to get off and I think it's going to be her greatest achievement. She's going to get off. It will be her greatest achievement because she was one of the worst in history. The world blew up during that regime.","The world blew up. So we're going to take a look at it very, very strongly, OK? How great, how great are they? How great are they? I turn on my television one night and I see these two on television. I say they are the greatest. What is it? They became an Internet sensation. I hope you've monetized. Do you want to do a little routine?","Come on, go, come on, come on.","How good, how good, what people. What great people. OK. Let's take another one. That's great. Go ahead. Where's your -- where's your person? Go ahead. Hi. Go ahead.","Beautiful.","So, the illegal immigrants get treated, in many cases, better than our vets. That's not going to happen. It's not going to happen. You look at what's going on. Our vets are treated so poorly. It's not going to happen anymore, folks. It's not going to happen, OK? All right? You know it and you know I mean it. You know I mean it. Go ahead, George.","Give it. Go ahead. Hello. Look at it, it's Santa Claus.","Yes.","Oh, beautiful. They wrote beautifully.","Common Core. How quickly? It's going to be gone very quickly. It's going to be gone. It's no good. You've got some of these guys running against me as Republicans that want Common Core. And anybody that wants Common Core is not going to win. It makes no sense. It makes -- so you're a big opponent of Common Core?","Take care of your mommy. Thank you. Thank you. Go ahead.","OK. It's the question I probably get asked more than any question. Students, they work. They borrow to the hilt. They get in there, they graduate. They do great. The big problem they get out, they can't get jobs. We're taking our jobs back from China. We're taking our jobs back from Japan. We're taking our jobs back from Mexico.","When you get out, you're going to have jobs, and we're going to do something with your loans. Because the students are getting socked. And the colleges are raising their numbers too high, too fast, too high and too fast. You're going to be very happy. You watch, but when you get out, you're going to have jobs, right?","OK.","That's a pretty wild question. Say that one more time. What do you mean?","Oh, I don't want to get into that question. OK, give me another one. Give me another question. Go ahead, George. Go ahead. Go ahead, darling.","That's number four. Go ahead, say it. Go ahead.","Thank you, darling. And you know what darling? You're not going to be scared anymore. They're going to be scared. You're not going to be scared, OK? And just so you understand, when the World Trade Center was knocked down, the people, the animals that did that, they sent their wives and their families back to Saudi Arabia.","Most have, went back to Saudi Arabia. Those wives knew what their husbands were going to do. We never went after them. We never did anything. We have to attack much stronger. We have to be more vigilant. We have to be much tougher. We have to be much smarter or it's never ever going to end. Remember that.","Just remember that. Go ahead.","He's right. That's amazing. How old are you?","He's 13 years old and he knows China's stealing our technology. Our President doesn't know it and he knows it.","So look, China needs us desperately. Without us, China goes right down the tubes but they've been ripping us off for years. It's going to stop. Again, if we're losing on a balance, $400 billion a year with China, $70 billion a year with Japan, excuse me, $45 billion a year with Mexico. I love the Mexican people.","I have great respect for the country. Their leaders are so much tougher, smarter, and more cunning than our leaders. We're going to stop it, folks. We're going to stop it. You know I tell it all the time. Nabisco, Oreos, Oreos, Nabisco is moving their plant from Chicago into Mexico, OK? No good. It's no good.","Ford is building a $2.5 billion car factory, $2.5 billion for trucks, for cars, for parts. Not going to happen, folks. We're going to -- we're going to take it back. We're taking our country back. We can't continue to let this stuff happen. We're taking our country back. Go ahead. Yes, go ahead.","I don't think Obama has any rules of engagement. I don't think he has rules of engagement. OK. George get a question. Why don't you take him out the nearest door instead of walking him through the whole place, these people. You know our country is so divided. Look at what happens. Our country is so divided.","There's hatred between people. We want to bring it together. You know one thing, he's been a horrible President. You can't get much worse. I always thought though that he'd be able to unify and he'd be a cheerleader for the country. I always thought that President Obama would be a cheerleader. He's been a great, great divider.","I mean, you -- look at the level of hatred, and you know, if I could speak to these four people. I'd say look, you may be a Democrat, you may be a Liberal, who cares? We're going to make our country strong. We're going to make it good. We're going to create jobs. I really think I could talk sense into him.","But our country is so divided it's such a sad thing. But remember that's only four people. OK, go ahead.","Thank you.","Well, Wall Street has not been babies and what we have to do and what we are doing, and I don't know if this is going to pertain to a lot of people. We put in our tax plan. It's the biggest tax cut of anybody by far and the middle-class is getting the biggest part of it. We're bringing it back. We're simplifying it. We're bringing the rates way down.","It's going to be so beautiful. And corporations and companies and small businesses, they are going to benefit. We are going to have a dynamic economy again. We're going to start manufacturing. We're going to bring trillions of dollars into the country, and you are going to be very happy. So we're going to work, and you know what, Wall Street it's not a bad couple of words.","They really do produce jobs but they're at a disadvantage now too. We have created a tax code. Larry Kudlow, so many people love it. It's going to be dynamic. The middle class has been so hurt in this country, they've been destroyed. It's almost like we don't have a middle-class. The middle class built this country and your taxes are coming down.","Go ahead. We'll do one or two more, George. Let's go. Let's go one or two more. Go ahead.","Oh, I love that question. OK. A lot of things, ready? Number one I'd sign an executive order ending Obama's executive order where people can come into the country automatically, OK? I will immediate -- because I have many things. I'll immediately help our vets. We're going to start signing legislation. It's going to go quickly and we are going to help our vets.","And you know what I'm doing because I put in a big policy paper and people love it. We're immediately going to start building up our military and making it really, really powerful, strong. The cheapest thing we can do because nobody's going to mess with us, OK? And we're going to do many other things and we are going to end Obamacare.","OK. Ladies and gentlemen. Ladies and gentlemen this has been such an honor. When you -- remember this, remember this. I think he came back. I think he came back. Don't worry about him. We'll do this quickly. So that's OK. Goo job. Good job. Individual people but they're all friends. They all want to make havoc.","We are sitting on something that's bigger than any of us understands or knows. I always say make our country great again. And I've been saying for the last three weeks because I've really got to know the people. We are going to make our country great again, greater than ever before. I love you. Thank you very much. We're going to make it greater than ever before. Thank you, everybody. Thank you."],"text":" Wow. Wow. Thank you. Woah. Thank you. Thank you. What a beautiful crowd. What a beautiful place. Beautiful. Wow. Thank you. Folks, we have a movement going on. This is not like, this is a movement. We're going to take our country back. We're going to be a smart country, not a stupid country, led by stupid people. And we are going to win so much. We are going to win again. We're going to win again. So today, I woke up nice and early which I always do and I turned on television. You saw that CNN came out with a new poll, right? Did we see these polls, right? People say why do you always mention polls? Because I'm always number one in the polls for you. For you, right? Well, very importantly, in other polls and in just about every poll now, we beat Hillary so badly. It's -- she has got and I mean this, there's no strength, no stamina. She cannot lead us. It's a corrupt deal. It's a corrupt deal. She shouldn't be allowed to run and we will put an end to it. We're going to put an end to it. Believe me. We're going to put an end to it. So the Fox poll has this beating. Now CNN was amazing. I love -- don't you love this winning stuff? Isn't it great? But I have to tell you, as good as this is, we have to get out there and vote because you know it's never easy. It's never easy and we have a little bit of a structural disadvantage as Republicans and Conservatives. So we have to get out there and vote. Now, Trump 36. Now, now think of that. You've got 15 people running and you have 36, that's good. Remember they said, I started off, I had six. They said, well, that's his plateau. Then the next week it went to 12, then it went to 18, and every week they say, well, that's his max. That's fine. Then it went to 20, then it went to 25 and 28, and every week. Now it's at 336 and another poll has it at 42, 42, amazing. OK. So, we're in the CNN poll. We're at 36, second places is 16, then you have a 12, you have a four, you have a three, who's three? Bush. Bush has three. Bye-bye. You know I tell this and I'm embarrassed by it but do you see all the Bush commercials? It doesn't stop. So he isn't -- he's so boring. No, no, no, not boring, low energy that's -- but I think somebody told me he spent $32 million. Hillary has spent more than that. He is spending money like you wouldn't believe. So I've spent the least amount of money and have the best result. That's what we want for our country, right? The least amount. Wouldn't it be nice if we could do that with our country? Spend the least and have the best, right? Right? Amazing. Now, I'm self-funding my campaign which I'm happy -- so many people like that. It's like a big deal because you know one thing, all of the people that you know, when you're in number one position, they all call, oh, Donald, we want to give you $5 million, $2 million, $1 million. I said I don't want it. Actually, I feel guilty because all my life I take, I take, you know, I take. That was our business to take. I don't want it. You know the shame is that it's one, it's one person and the dishonest media, they are dishonest. You don't believe how dishonest. They are the most, they are the most dishonest people. I mean a big percentage of them. They are so dishonest. They are so dishonest. They will make that one person into the headline. Trump has -- they can't even use the plural. They can't put the s but they'll figure it out. But they'll say, Trump has protester. They don't say that. What do you have 10,000 - 12,000 people? By the way, a lot of people -- look at them pouring in. There are a lot of people outside. I have an idea. Should we wait about 45 minutes let everybody come into the room? No. No, right? But you'll see that. I mean, you're going to see tomorrow, the protester, the one protester. So that's OK and be very nice to the protester. You know it's funny. We always have a -- and usually we have none but sometimes we have a couple. And when I'm rough and I say, get them out of the room. Then they say, oh, that's terrible. Then when I'm nice, I say be very careful, be very gentle, don't hurt the protester. Then they say he was very weak tonight. So you can't win. So I'm trying to cut it right down the middle. Now make sure that young lady is in beautiful shape. And if she'd like to come back in, do we invite her back in? I don't mind. I don't mind. But we're having a lot of fun. A friend of mine is a very, very substantial, really wealthy guy, and a tremendous negotiator. We'll use him for one of these countries that are ripping us off. I guarantee. They won't be ripping us off long. But he said to me how do you speak all the time? Because no matter where I go and it's really not me, it's what's happening, and what we're saying. And I talk about the silent majority but it's not a silent, it's a noisy, noisy, noisy, incredible majority. And it is a majority and it is a majority. But he said how do you speak in front of? And I don't use like teleprompters and I don't have a written speech and I'd like to have a written speech because it would be so easy. You read, ladies and gentlemen, and by the way, I love North Carolina. You know, I don't know if you know. You know in Charlotte, in Charlotte I have a great club, Trump National Golf Club. It's a tremendous success and I love it. I love it. I think it's one of the most beautiful places. I have to tell you this. So I have places in Miami. I have places in Palm Beach, and places all over the place, OK? That's by the way, that's the kind of thinking we need here. But I send my crews down to different places to fix them. I have roving crews. These guys they're like, you know, they're all over the place, and they come to North Carolina and they call me back, and they always wanted to retire to Florida. And they love Florida and I love Florida, and by the way, I'm winning in the polls in Florida against a Senator who never votes, right? Now while I'm beating a Senator who never votes, you know, that's a little, and a former Governor, and we're winning by a lot but they come down to North Carolina not thinking about North Carolina, and every single time they come back, they say, Mr. Trump, that's where I want to spend the rest of my life. True story. Five guys. I don't know if you want them. They're rough guys. I don't -- I don't think you should take them. But they're very good at what they do but they love it and I love it too. We have a situation in our country where we have a President who is out of control. He's out of control. I don't know why. I don't know why. But he won't even issue the term. He won't say the term as to what's happening. And he'd rather, he'd rather -- think of this, he would rather you ask him what's our biggest problem. Now we have ISIS trying to blow up our buildings, our cities, and destroy us. And by the way, chopping off heads if you're a Christian. We have ISIS, it's like medieval times. You know in medieval times they chop off the head. Whoever heard of this until a couple of years ago? How about the cage? They drowned people, and then people say to me, Mr. Trump, they chop off heads, they drown people in steel cages. I get asked by one of these characters a few weeks ago, Mr. Trump, what do you think of waterboarding? And I said can we go a couple of steps beyond waterboarding? No, it's incredible. And then I get heat they say he's vicious, he's vicious. I mean, they chop off their heads. I say waterboarding is fine and they do stories about me that I'm -- that my tone is tough. You know Bush said that. Bush, he said Mr. Trump's tone, his tone is very tough. Think of it. Look what the world is doing to us. They're beating us militarily. We can't beat ISIS. They're beating us militarily. They're beating us on trade. We go into Iraq and we spend billions of dollars in Iraq, billions and then, we spend with the final number, what's the final number? $2 trillion. We lose thousands of lives. In Iraq, we have Wounded Warriors who I love all over the place. And what do we have? We have nothing. We have nothing. And do you remember I said keep the oil. Keep the oil. And you know what, for three years, I've been saying keep the oil. And they have people saying, what does Trump know about this? Well, about a week ago, they started knocking the hell out of the oil but they'll beat it up. But they won't keep it because they're not smart enough. We should keep it. If we're going to take it. We should keep it. Do you remember? Do you remember the old statement to the victor? Correct belong the spoils, right? We're the only people, we go in, we fight, we lose, most importantly, and sadly, we lose lives. We spend trillions and trillions of dollars. We leave. We get nothing. Now Iran is taking over Iraq and who's taking the oil? ISIS, ISIS, and Iran, and others. But Iran is going to walk in. I said don't go in because you're going to destabilize and I'm the most militaristic person in this room other than this guy. This guy looks pretty rough I'll tell you. But I'm the most -- forget it. But you got to know when to do it. You've got to know when to use it. I want to build our military so big and so strong and so powerful. That nobody, nobody, nobody is going to mess with us. And we've got to take care of our vets. They're our greatest people. They're our greatest people. We have vets that are in waiting rooms four, five, six, and seven days before they can see a doctor, and they're dying before they -- they are literally dying by the thousands waiting for service. And in some cases, routine service. They need a procedure. They need a pill. They need a prescription. They die. They die and these are the people -- this is why we're here. We're going to take care of our vets. We want to take care of our Wounded Warriors who are our greatest and most incredible people. And what I wanted to do with the Wounded Warriors and with the vets, we take the oil and we give the families of people that lost people in Iraq and Afghanistan and other places, we give them money. We let them have money because they need -- they got to get something. They got to get something. And we take care of those people. We take care of our vets. We take care of our military. We got to do it. And we're going to do it and we're going to do it as soon as I win. If I win, I'm telling you, we are going to be so proud of our country again. When I see deals made where Iran who laughs at our stupidity gets $150 billion, we make a horrible deal with 24-hour day periods before we can go and inspect and before the 24 days it's a whole procedure. So the 24 days can be much longer. And how do you like where they can self-inspect? Iran can go and self-inspect and they can report back to us. Oh, Mr. President, everything's fine, everything's fine. This is Kerry, this is Obama. They didn't read The Art of the deal. They are grossly incompetent people. They weren't meant for the job and we got to get them out. We got to get them out. And I'll tell you what, Hillary is going to be just as bad. Hillary is going to be just as bad. If you look at Hillary. If you look at Hillary. Sure. Hello. Thank you. Thank you. Isn't it a shame? Look at this, thousands of people are pouring in, and we have to get rid of one person who's wasting our time. Look at all the people coming in. All right take them out, please. Take them out. You know really it is amazing. With all -- look at the people pouring into this room. With all of the people here, we have to waste time on one or two people. It's really ridiculous. I'll tell you, it really is. But I have to be nice. I've got to be nice. So Hillary, in my opinion, will be just as bad. Do you ever notice she does an event, she wakes up, she does an event, she puts on a pantsuit, oh, it's true, she walks in. So she walks in and does an event, you don't see her for four days, five days. You know why? She goes back home and she goes to sleep. This is not what we need as a President. We need tremendous energy. We need tremendous smarts. We need somebody that's going to get the job done. We have to get the job done. And by the way, you know I don't talk about this as much for the last two weeks because I'm now talking more and more border security. We going to build the wall. Mexico's going to pay for the wall. We're not going to let people come into our country that we have no idea who they are, where they come from, they have no documentation, the possible Syrian Trojan horse. These are the strongest looking people I've ever seen, the migration. They're all men. I mean, you look at it. They're strong young men. I say why aren't they fighting for their country? What are they doing? So we're going to win. So here's the thing. So I said they want to allow 200,000 and I've heard that number and I'm pretty good at this stuff. And if you look I've made a lot of right decisions. But I'll tell you. Listen to this, so they say 10,000 now. It was 3,000, now it's 10,000. But in the Democrat debate, what was the number? They talked about 65,000, right? They want to allow 200,000 to 250,000, in my opinion, how stupid can we be? We know nothing about these people. We don't have any idea where they come from, military and the police have told us, the military and the police have told us there is no way in a million years of finding out where they're from. I mean, we can't even do a website for Obamacare. We spend $5 billion doing a website and we're going to say where some guy comes, who doesn't have -- and I do like -- because we all have heart. And I do like building in a safe zone someplace in Syria. That's what Merkel should have done instead of what's going on in Germany is a disaster. And we'll contribute and we'll help and we'll get the Gulf states who are so wealthy. We'll contribute, we'll help because we want to help people but we don't want these people coming to the United States. And if they do, if they do, and if I win, they're going back. They've got to go back. They've got to go back. They're going back. We owe $19 trillion. See, they've got a strategy. One there, one here, one there, three different places. So, so far we're really a two people but I think it might be three. So remember this, we're going to have our borders back. We're going to create strong borders. And I mean strong. We are going to build a wall so powerful and so tall and so strong, and we're going to let people come in but they're all coming in legally. We want them to come in but they've got to come in legally. We want them to come in but they got to come in legally, legally. So since June, what I've been doing is talking very strongly about trade and China and how everybody's ripping off our country and how we don't know what we're doing. Over the last couple of weeks, since we had the tragedy, we all had the tragedy in Paris. Now we had another one, which again, was the same thing. How about the person that knew what was going on, said they didn't want to report them because they think it might be racial profiling. Did you see that? No, did you see that? And I'm not sure, do I believe the person? Can anybody be that dumb? But they didn't want to report because they didn't want to be involved with racial profiling. We have become so politically correct that we don't know what the hell we're doing. We don't know what we're doing. So since June when I made that announcement, and I always tell you, it takes guts to run for President. Don't kid yourself. It takes guts and not so much for a politician because frankly, that's all they do. They run, they lose, they win, who cares? Nobody cares, and by the way, watch the super PACs because the super PACs are controlling the politicians. They have total control over the politicians. And those are the guys that you're electing. No super PACs here, no super PACs. We send notices out. We send notices out. We don't want super PACs or we send them out strongly. So just remember those are the people that are controlling your destiny and these are not people that have you in mind. These are not people. Just remember that. Oh, here's another one. Here's another one. Look at this guy. Get him out. Get him out. Get him out, please. Look at the cameras taking his picture. He's happy. So that's too bad. Yeh, that's too bad. So what we're going to do now and what I've been doing is I've really focused on security. We need now security, proper security. We have to bring the safety of our country back. When I announced I was running, I gave it a very strong announcement and I talked about illegal immigration. And boy, did I take heat or what? I took heat. Now what -- and I was right. And I think that was maybe what drove us initially. Now everybody is saying and we have this right here on the economy, trump 55%, on budget 51%, but listen, on illegal immigration 48%, on ISIS 43%, on foreign policy 30%. People know what's happening. We want protection. We want smarts. And we're going to have the finest, we're going to have the safest country. And we're going to leave our Second Amendment and we're going to protect ourselves if we have to. We're going to protect ourselves. It's amazing when you think of some of the things you hear where let's not have guns. Well, you know one thing, the bad guys are going to have the guns. The bad guys are going to have the guns. It's not going to happen anymore. We're going to protect our Second Amendment and we are going to have protection in our country. Remember that. Before we get to questions, we'll do a question and answer, before we do that, Common Core is a disaster. We have one of the worst education systems in the world. We're ranked number 28 in the world and we spend more money per pupil than any other country by far. That's going to end. We're going to have local education. We're going to have local, beautiful education, and we're going to go shooting up the charts and we're going to save money. We're going to save money. So I want you to ask them. Let's do some -- do you have the mic? Where's the mic? OK, let's go. Come on get with it. Give me somebody good. A vicious, horrible, terrible question. Now, go ahead. What would you like to ask? Turn on the mic. Yeah, go ahead. You got to turn on the mic. Come on. Who's running this place? Go ahead turn on the mic. Try somebody else. Check, check. OK. Let's go. I hear it. Let's go. Hello Mr. Trump, it's an honor, an honor to meet you. Hi. I was wondering what you would say to President Obama. You're fired. I have more. Go ahead, darling. Go ahead. OK. OK. I'm going to stay calm. I was wondering what you would say to President Obama now that we have had a terrorist attack right here in our country in California that I'm sure they did everything that they could to try to cover that up. But it's been stated today. Come on. It It has been stated today that it is and it was a terrorist attack and I -- It was a terrorist attack. It was, it was a terrorist attack. So how would you handle that? Well, I would handle it so tough. You have no idea. You don't want to hear. You don't even want to hear. You don't want to hear how I'd handle it. I will get myself in so much trouble with them. We are going to handle it so tough. And you know what we're going to do? We're going to get it stopped because we can't allow this to happen to our country. We're going to get it stopped. And by the way, and by the way, by the way, if the people in Paris or the people in California, if you had a couple of folks in there with guns and that knew how to use them and they were in that room. You wouldn't have dead people. The dead people would be the other guys. So just remember that. Remember that, right? OK. Go ahead, another question. Hello. Testing, testing. Hi, thank you so much. Thank you. I've been up to the plate. How are you? I just want you to know you're, you've somehow, look around you. You've tapped in to the American consciousness of We The People. You did that. That's all. That's amazing. You have reignited the fire and hope in America. Thank you. So beautiful. Where are you from? Where are you from? Here? Thank you. It's very nice. I appreciate it. Beautiful. Look at her. Tears come down because she's so -- she loves our country. I mean it's incredible. Go ahead. Go ahead. Yes, yes. Donald Trump, when you become President, first of all, I would say Merry Christmas. Merry Christmas. Hey, hey, yeah. Donald Trump -- Merry Christmas. I'll tell you what. You know I'm glad you did that because we are going to bring Merry Christmas back to our stores. We're bringing it back. Go ahead. Donald Trump, when you do become President of the United States of America, will you stop the word being used undocumented alien and use it correctly for the political people that are in office now and call them what they are illegal aliens not yourself. Because I admire you calling them what they are. But will you have that stopped in Congress and the House of Representatives, in places that serve us because they are illegal aliens. Yeah, well, look. Tremendous crimes, taking jobs, you have no idea what's happening. I call it illegal immigration. But you have no idea what's happening. We are losing our jobs. You say, Kate in San Francisco, Jameel, you know, Jameel. This wonderful, beautiful young boy shot, shot instantly. Killed for no reason. And I got to know his father and his father is a great man and what he's living with now nobody wants to live with. Shot by an illegal immigrant. We're going to stop it and want to stop it now. Stop it now, OK? Thank you. Good. Mr. President, I'm in favor of Hillary for prison. Hillary for prison? Will you and your administration prosecute her or at least look into it? Well, it's a very interesting question because you know, the statute of limitations is six years. What she did is illegal. There's no question about that. She's being protected by the Democrats because she's their front runner. We have to do something about it. We have to do -- it's not right. General Petraeus essentially got two years. I mean, what this meant they destroyed him. Other people went to jail for much less than what she did. I think she's going to get off and I think it's going to be her greatest achievement. She's going to get off. It will be her greatest achievement because she was one of the worst in history. The world blew up during that regime. The world blew up. So we're going to take a look at it very, very strongly, OK? How great, how great are they? How great are they? I turn on my television one night and I see these two on television. I say they are the greatest. What is it? They became an Internet sensation. I hope you've monetized. Do you want to do a little routine? Come on, go, come on, come on. First of all, I'm glad that the media can feel us and all. Let it go. Let it go, I see them. I want everybody to know -- Yes. That we stand behind Donald J. Trump. Yes, we do baby. Yes Yes. We support Donald J. Trump. Yes and we endorse. We endorse Donald J. Trump. And this is going to be our next President of the United States. Yes. The silent majority has spoken, baby. Yes. We spoke it. Don't get it twisted. That's right. Now listen, he going to put that wall up. Yes, he is. He going to build that wall. He going to build it. And he going to build it tall. He going to build it tall and he's going to protect us all. He's going to protect us all. We don't want this country to fall do we? Build that wall, Donald J. Trump. Build that wall. Build it. How good, how good, what people. What great people. OK. Let's take another one. That's great. Go ahead. Where's your -- where's your person? Go ahead. Hi. Go ahead. Donald, I'm retired military. Here's my -- and so is my friend, Bruce Williams. Beautiful. And we're having problems with the military, the VA hospitals, my question is why do we have all the foreigners come over here to punch their ticket to get a green card but then they go on the outside and have their own practice and take our money, no matter which way we look at it, we lose? So, the illegal immigrants get treated, in many cases, better than our vets. That's not going to happen. It's not going to happen. You look at what's going on. Our vets are treated so poorly. It's not going to happen anymore, folks. It's not going to happen, OK? All right? You know it and you know I mean it. You know I mean it. Go ahead, George. Give it. Go ahead. Hello. Look at it, it's Santa Claus. Mr. Trump -- Yes. This is you a super fan from The Washington Post article from Jenna Johnson. Oh, beautiful. They wrote beautifully. My eighth rally, we love you, and how quickly can you kick Common Core to the curb? Common Core. How quickly? It's going to be gone very quickly. It's going to be gone. It's no good. You've got some of these guys running against me as Republicans that want Common Core. And anybody that wants Common Core is not going to win. It makes no sense. It makes -- so you're a big opponent of Common Core? Take care of your mommy. Thank you. Thank you. Go ahead. Hello, Mr. Trump, I'm Ryan Fournier, Campbell University, representing Students for Trump. There's quite a few of us here. You've probably heard of me. I want to ask you, I want to, first of all, thank you for breaking this damn Establishment we have in Washington D.C. Give me a holler for that. What do you plan to do in office to support the students, to support the education system? OK. It's the question I probably get asked more than any question. Students, they work. They borrow to the hilt. They get in there, they graduate. They do great. The big problem they get out, they can't get jobs. We're taking our jobs back from China. We're taking our jobs back from Japan. We're taking our jobs back from Mexico. When you get out, you're going to have jobs, and we're going to do something with your loans. Because the students are getting socked. And the colleges are raising their numbers too high, too fast, too high and too fast. You're going to be very happy. You watch, but when you get out, you're going to have jobs, right? OK. Thank you. Mr. Trump, the next President of the United States of America, I would like to ask one question. Do you think the refugees that are coming here, are trying to come here, that are going to Germany and all over Europe, do you think they're going to be become priest and become celibate? If not, what is going to happen to the women in the world that their -- the countries are going to? That's a pretty wild question. Say that one more time. What do you mean? Do you think the refugees, those young strong refugees that are trying to get into America, are going to remain celibate? Who are they going to hook up with? Oh, I don't want to get into that question. OK, give me another one. Give me another question. Go ahead, George. Go ahead. Go ahead, darling. I'm from -- twelve years old and I'm from Virginia. I'm scared. What are you going to do to protect this country? I'm from Virginia. I'm 12 years old. What are you going to do to protect this country? I'm scared. That's number four. Go ahead, say it. Go ahead. I hope you are the next President of the United States. I'm from Virginia. I'm 12 years old. I'm scared and I want you to protect this country and I know you will. You will build our military so strong so powerful. No one -- Thank you, darling. And you know what darling? You're not going to be scared anymore. They're going to be scared. You're not going to be scared, OK? And just so you understand, when the World Trade Center was knocked down, the people, the animals that did that, they sent their wives and their families back to Saudi Arabia. Most have, went back to Saudi Arabia. Those wives knew what their husbands were going to do. We never went after them. We never did anything. We have to attack much stronger. We have to be more vigilant. We have to be much tougher. We have to be much smarter or it's never ever going to end. Remember that. Just remember that. Go ahead. Mr. Trump, China is stealing all our technology from our military, from our businesses, how can you stop that? It's crazy. It's gone too far. He's right. That's amazing. How old are you? I'm 13. He's 13 years old and he knows China's stealing our technology. Our President doesn't know it and he knows it. So look, China needs us desperately. Without us, China goes right down the tubes but they've been ripping us off for years. It's going to stop. Again, if we're losing on a balance, $400 billion a year with China, $70 billion a year with Japan, excuse me, $45 billion a year with Mexico. I love the Mexican people. I have great respect for the country. Their leaders are so much tougher, smarter, and more cunning than our leaders. We're going to stop it, folks. We're going to stop it. You know I tell it all the time. Nabisco, Oreos, Oreos, Nabisco is moving their plant from Chicago into Mexico, OK? No good. It's no good. Ford is building a $2.5 billion car factory, $2.5 billion for trucks, for cars, for parts. Not going to happen, folks. We're going to -- we're going to take it back. We're taking our country back. We can't continue to let this stuff happen. We're taking our country back. Go ahead. Yes, go ahead. Mr. Trump, what will you do to change Obama's rules of engagement to get -- allow our military to get a better chance to stay alive in combat? I don't think Obama has any rules of engagement. I don't think he has rules of engagement. OK. George get a question. Why don't you take him out the nearest door instead of walking him through the whole place, these people. You know our country is so divided. Look at what happens. Our country is so divided. There's hatred between people. We want to bring it together. You know one thing, he's been a horrible President. You can't get much worse. I always thought though that he'd be able to unify and he'd be a cheerleader for the country. I always thought that President Obama would be a cheerleader. He's been a great, great divider. I mean, you -- look at the level of hatred, and you know, if I could speak to these four people. I'd say look, you may be a Democrat, you may be a Liberal, who cares? We're going to make our country strong. We're going to make it good. We're going to create jobs. I really think I could talk sense into him. But our country is so divided it's such a sad thing. But remember that's only four people. OK, go ahead. Hello, my name is Sean and I had a question for you. So first of all, I read the are the deal and I love the book so much. It was great. Thank you. My question was what will you do in regulating hedge funds and Wall Street? Well, Wall Street has not been babies and what we have to do and what we are doing, and I don't know if this is going to pertain to a lot of people. We put in our tax plan. It's the biggest tax cut of anybody by far and the middle-class is getting the biggest part of it. We're bringing it back. We're simplifying it. We're bringing the rates way down. It's going to be so beautiful. And corporations and companies and small businesses, they are going to benefit. We are going to have a dynamic economy again. We're going to start manufacturing. We're going to bring trillions of dollars into the country, and you are going to be very happy. So we're going to work, and you know what, Wall Street it's not a bad couple of words. They really do produce jobs but they're at a disadvantage now too. We have created a tax code. Larry Kudlow, so many people love it. It's going to be dynamic. The middle class has been so hurt in this country, they've been destroyed. It's almost like we don't have a middle-class. The middle class built this country and your taxes are coming down. Go ahead. We'll do one or two more, George. Let's go. Let's go one or two more. Go ahead. Last question, Mr. Trump, Mr. Trump what would you do on your first day in office? Oh, I love that question. OK. A lot of things, ready? Number one I'd sign an executive order ending Obama's executive order where people can come into the country automatically, OK? I will immediate -- because I have many things. I'll immediately help our vets. We're going to start signing legislation. It's going to go quickly and we are going to help our vets. And you know what I'm doing because I put in a big policy paper and people love it. We're immediately going to start building up our military and making it really, really powerful, strong. The cheapest thing we can do because nobody's going to mess with us, OK? And we're going to do many other things and we are going to end Obamacare. OK. Ladies and gentlemen. Ladies and gentlemen this has been such an honor. When you -- remember this, remember this. I think he came back. I think he came back. Don't worry about him. We'll do this quickly. So that's OK. Goo job. Good job. Individual people but they're all friends. They all want to make havoc. We are sitting on something that's bigger than any of us understands or knows. I always say make our country great again. And I've been saying for the last three weeks because I've really got to know the people. We are going to make our country great again, greater than ever before. I love you. Thank you very much. We're going to make it greater than ever before. Thank you, everybody. Thank you."}