{"id":489,"author":"Donald Trump","title":"Speech: Donald Trump in Manassas, VA","date":"2015-12-02","link":"https://factba.se/transcript/donald-trump-speech-manassas-va-december-2-2015","paragraphs":["Thank you very much. So nice so amazing. Thank you very much. So nice so amazing, thank you very much. So nice so amazing, so amazing it is so great to be with you. So amazing it is so great to be with you. So amazing it is so great to be with you tonight and this was a little - this was a tonight and this was a little - this was a tonight and this was a little - this was a little tough weather, so a couple of little tough weather.","So a couple of little tough weather, so a couple of hours ago, they said mr. Trump, I think hours ago, they said mr. Trump, I think hours ago, they said mr. Trump, I think wicked what? That's okay. We - I love you wicked what that's okay. We - I love you wicked what that's okay. We - I love you more, okay.","Like I say to my son Barron I more okay, like I say to my son Barron I more okay, like I say to my son Barron, I love you because I love you more dead. So love you because I love you more dead. So love you because I love you more dead. So anyway I love it. I do love you that the - anyway I love it. I do love you that the - anyway I love it.","I do love you that the spirit in these rooms, the spirit, no spirit in these rooms, the spirit, no spirit in these rooms, the spirit no matter where we go is so is so matter where we go is so is so matter where we go is so Is so incredible and I, you know, a couple of incredible and I, you know, a couple of incredible and I, you know, a couple of hours ago they were saying - I'm sorry, sir, hours ago they were saying - I'm sorry, sir, hours ago they were saying, I'm sorry, Sir, you're gonna have to cancel your trip, you're gonna have to cancel your trip, you're gonna have to cancel your trip.","Can you imagine? They said it's gonna be, can you imagine they said it's gonna be. Can you imagine they said it's gonna be too tough and too tough, the flying's too tough and too tough. The flying's too tough and too tough. The flying's dangerous. It's really - it's not exactly dangerous, it's really - it's not exactly dangerous, it's really - it's not exactly nice outside, right?","I said I can't do nice outside, right? I said I can't do nice outside, right? I said I can't do that. No, I can't do that that no, I can't do that that no, I can't do that. I can't do it. Oh, we got - I can't do it. Oh, we got - I can't do it. Oh, we got those closest. It was marginal. I have to those closest.","It was marginal, I have to those closest, it was marginal, I have to tell you, but we got here. So you know in tell you, but we got here. So you know in tell you, but we got here. So you know in - as you probably heard in California, as you probably heard in California, as you probably heard in California, they're having a tremendous problem.","They're having a tremendous problem. They're having a tremendous problem right now. Two are killed as of now. And I right now two are killed as of now and I right now two are killed as of now. And I guess there's one that's on the loose or guess there's one that's on the loose or guess there's one that's on the loose or they're having a fight.","This is when we - they're having a fight. This is when we - they're having a fight. This is when we appreciate our great police and our law appreciate our great police and our law appreciate our great police and our law enforcement. They don't get enough credit enforcement, they don't get enough credit enforcement, they don't get enough credit, they should get it.","And you're always - they should get it and you're always - they should get it. And you're always gonna have some bad apples, you see it on gonna have some bad apples, you see it on gonna have some bad apples, you see it on television. No matter what business were television, no matter what business were television, no matter what business were in, if you're in the banking or anything in if you're in the banking or anything in if you're in the banking or anything else.","But I want to tell you they do one else, but I want to tell you they do one else. But I want to tell you they do one hell of a job. And when you see these hell of a job and when you see these hell of a job and when you see these shootouts, when you see these shootouts, I shootouts when you see these shootouts, I shootouts when you see these shootouts, I can tell you one thing I don't want to can tell you one thing, I don't want to can tell you one thing, I don't want to do it.","You don't want to do it do it. You don't want to do it, do it, you don't want to do it. So we want to thank the police and law, so we want to thank the police and law. So we want to thank the police and law enforcement. They're unbelievable people enforcement, they're unbelievable people enforcement, they're unbelievable people.","And with that being said, I think could - and with that being said, I think could - and with that being said, I think could we have a moment of silence? A lot of - we have a moment of silence. A lot of - we have a moment of silence, a lot of people killed and in honor of those people killed and in honor of those people killed.","And in honor of those people and the victims generally, let's people and the victims generally, let's people and the victims generally. Let's have a moment of silence. Please. Okay, have a moment of silence, please. Okay, have a moment of silence, please. Okay, thank you. Thank you. Thank you. Thank you.","So we have some really special people. So we have some really special people. So we have some really special people here. The most powerful people there are here. The most powerful people there are here, the most powerful people there are black pastors. You've been hearing a lot black pastors, you've been hearing a lot black pastors, you've been hearing a lot about it and we had some incredible about it and we had some incredible about it.","And we had some incredible times who over the last few days and times who over the last few days and times who over the last few days and we've had great support. It wasn't - we've had great support. It wasn't - we've had great support. It wasn't covered properly by the press, never does covered properly by the press.","Never does covered properly by the press. Never does cover. I mean they are so dishonest, oh, cover, I mean they are so dishonest, oh, cover, I mean they are so dishonest, oh yeah, yeah. But you probably read where a - yeah, yeah, but you probably read where a - yeah, yeah, but you probably read where a large - I don't even know the number, but a large - I don't even know the number, but a large - I don't even know the number, but a Large group of black pastors came to see large group of black pastors came to see large group of black pastors came to see me in New York and Manhattan.","And it was me in New York and Manhattan and it was me in New York and Manhattan. And it was really great and one of them was doctor really great and one of them was doctor really great and one of them was doctor and pastor, Steve parson and Steve put and pastor, Steve parson and Steve put and pastor, Steve parson and Steve put together A group of endorsers all together, a group of endorsers all together, a group of endorsers all endorsers and I said, well, you're endorsers and I said, well, you're endorsers and I said, well, you're endorsing me, I'm bringing you up for a endorsing me.","I'm bringing you up for a endorsing me, I'm bringing you up for a couple of seconds. I'm gonna say I don't - couple of seconds, I'm gonna say I don't couple of seconds, I'm gonna say, I don't know if these people want to be preached know if these people want to be preached know if these people want to be preached suit Tonight, we want to hear about other suit tonight.","We want to hear about other suit tonight. We want to hear about other things because Steve, you know can take things because Steve, you know can take things because Steve, you know can take over the whole night. And I'll just leave over the whole night and I'll just leave over the whole night. And I'll just leave you know that's okay too, but he's a - you know that's okay too, but he's a - you know that's okay too, but he's a great guy.","He was in New York with the great guy. He was in New York with the great guy. He was in New York with the others and I saw him, he was been all others and I saw him, he was been all others and I saw him. He was been all over television over the last couple of over television over the last couple of over television over the last couple of days and he is a beautiful guy.","So Steve days and he is a beautiful guy. So Steve days and he is a beautiful guy. So Steve come on up with your friends come on up, all right, I'm not gonna take tomorrow. All right, I'm not gonna take tomorrow. All right, I'm not gonna take tomorrow too long. But I will say this, I wear a too long, but I will say this, I wear a too long.","But I will say this. I wear a group of black ministers as I said, and group of black ministers as I said and group of black ministers. As I said and then we have one token brother over then we have one token brother over then we have one token brother over there, right? Okay. But I will say this there right, okay, but I will say this there right, okay.","But I will say this that people ask me well, why are you that people ask me well, why are you that people ask me? Well, why are you endorsing Donald Trump? Well, my opinion endorsing Donald Trump. Well, my opinion endorsing Donald Trump. Well, my opinion, he's the best and the only one that can - he's the best and the only one that can - he's the best and the only one that can beat Hillary Clinton, that's right.","I mean beat Hillary Clinton, that's right. I mean beat Hillary Clinton. That's right. I mean, listen, we got a win and one thing about, listen, we got a win and one thing about, listen, we got a win and one thing about Donald Trump is he's a winner. Donald Trump is - he's a winner. Donald Trump is - he's a winner, amen.","All right, here's another thing too, amen. All right. Here's another thing too, amen. All right, here's another thing too. He knows how to create wealth. Can I get, he knows how to create wealth, can I get, he knows how to create wealth, can I get amen? And as a black minister, I'll just amen. And as a black minister, I'll just amen.","And as a black minister, I'll just tell you this, we're right in the inner tell you this. We're right in the inner tell you this. We're right in the inner city and I tell you we need jobs, we need city and I tell you we need jobs, we need city and I tell you we need jobs, we need employment, we need businesses and I'll employment, we need businesses and I'll employment.","We need businesses and I'll tell you who better can help us, help tell you who better can help us, help tell you who better can help us help ourselves. And Donald Trump is saying so ourselves and Donald Trump is saying so ourselves and Donald Trump is saying. So, so I'll just tell you this that I'm glad, so I'll just tell you this that I'm glad.","So I'll just tell you this, that I'm glad I believe that this is a movement. It's a - I believe that this is a movement. It's a - I believe that this is a movement, it's a movement and I believe that we're in a movement and I believe that we're in a movement and I believe that we're in a situation now where this country called situation now where this country called situation now Where this country called America is gonna come back and be made, America is gonna come back and be made, America is gonna come back and be made great again and they're right now in great again and they're right now in great again and they're Right now, in fact, I believe it's done fact, I believe it's done.","Fact, I believe it's done. Oh, wealth transfer our wells a little - oh, wealth transfer, our wells a little - oh, wealth transfer, our wells a little vent, okay. And then I'll tell you one vent, okay? And then I'll tell you one vent, okay. And then I'll tell you one thing, mr. Trump is going to make this thing.","Mr. Trump is going to make this thing. Mr. Trump is going to make this military strong again. Why is that? Why military strong again? Why is that, why military strong again, why is that? Why is this? I'm gonna take too much time. Is this? I'm gonna take too much time. Is this? I'm gonna take too much time.","I'll tell you this down a chunk. Just I'll tell you this down a chunk, just I'll tell you this down a chunk just doesn't take anybody's mess, doesn't take anybody's mess, doesn't take anybody's mess. They've got big power. They have the - they've got big power, they have the - they've got big power. They have the ultimate power right, so go and enjoy ultimate power right, so go and enjoy ultimate power right, so go and enjoy yourselves.","Can you please get them a yourselves? Can you please get them a yourselves? Can you please get them a good location is pretty tight in here, good location is pretty tight in here, good location is pretty tight in here. Thank you. Thank you. Thank you so nice. So thank you. Thank you. Thank you so nice.","So thank you. Thank you. Thank you so nice. So nice do a fantastic job. I've seen what nice do a fantastic job. I've seen what nice do a fantastic job. I've seen what they do and man they do a job, nothing they do. And man they do a job, nothing they do. And man they do a job, nothing easy in life. You know nothing easy, easy in life.","You know nothing easy, easy in life. You know nothing easy. Sometimes that can be tough. You work in sometimes that can be tough. You work in sometimes that can be tough. You work in the inner cities, it can be pretty tough. The inner cities, it can be pretty tough. The inner cities, it can be pretty tough.","It could be pretty tough. It could be pretty tough. It could be pretty tough. It can also be rewarding and they get - it can also be rewarding and they get - it can also be rewarding and they get great rewards. Thank you very much and great rewards. Thank you very much and great rewards. Thank you very much and thank you, Steve.","So we've got a lot going. Thank you, Steve. So we've got a lot going. Thank you, Steve. So we've got a lot going on to this country and I don't know if on to this country and I don't know if on to this country and I don't know if you're tweeted, I'm on my way to Manassas, you're tweeted, I'm on my way to Manassas.","You're tweeted, I'm on my way to Manassas, I'm on my way and here I go. And first I - I'm on my way and here I go. And first I - I'm on my way and here I go. And first I said we're going to Virginia then would said we're going to Virginia then would said we're going to Virginia then would come. The truth is you look at what's come, the truth is you look at what's come.","The truth is you look at what's happening with our country and I said happening with our country and I said happening with our country and I said, you know, we're gonna have fun. You know, we're gonna have fun. You know we're gonna have fun considering we don't have good subject considering we don't have good subject considering we don't have good subject matter, right.","We have really bad subject matter, right. We have really bad subject matter, right. We have really bad subject matter. We don't win anymore, we don't win matter. We don't win anymore. We don't win matter. We don't win anymore. We don't win. We never win. We don't win with the - we never win. We don't win with the - we never win.","We don't win with the military. We don't win with trade. We military, we don't win with trade. We military, we don't win with trade. We don't win with deals any kind of deals. I don't win with deals any kind of deals. I don't win with deals. Any kind of deals I look at that Iran deal, it's one of the look at that Iran deal.","It's one of the look at that Iran deal. It's one of the worst things I've ever seen. No, no think worst things I've ever seen. No, no think worst things I've ever seen. No, no think of it. Think of it. They've already of it, think of it. They've already of it, think of it. They've already violated the deal.","You know, I don't know violated the deal. You know, I don't know violated the deal, you know, I don't know if you have you heard if you have - you heard if you have - you heard they've already violated the deal, the - they've already violated the deal, the - they've already violated the deal. The ink isn't even dry, okay?","It's not even - ink isn't even dry, okay? It's not even - ink isn't even dry, okay? It's not even dry and they violated the deal. So we dry and they violated the deal. So we dry and they violated the deal. So we don't do it anymore, you you look at, don't do it anymore, you you look at, don't do it anymore.","You - you look at surprises, right? She says the president surprises, right. She says the president surprises, right. She says the president, why this guy over here, why this guy over here, why this guy over here? She says, surprise, you're right, who said she says, surprise, you're right, who said she says, surprise, you're right, who said that stick up your hand.","I want to good that stick up your hand. I want to good that stick up your hand. I want to good, very good, very good. So we're gonna start very good, very good. So we're gonna start very good, very good. So we're gonna start winning and big, we're gonna win, we're winning and big. We're gonna win, we're winning and big.","We're gonna win, we're gonna win, we're gonna win, I live gonna win, we're gonna win. I live gonna win, we're gonna win. I live, we're gonna win a lot. We're gonna win, we're gonna win a lot. We're gonna win, we're gonna win a lot. We're gonna win all the time. We're gonna get rid of all the time. We're gonna get rid of all the time.","We're gonna get rid of Obamacare, which is a disaster disaster, Obamacare, which is a disaster disaster, Obamacare, which is a disaster disaster. And we're gonna replace it with - and we're gonna replace it with - and we're gonna replace it with something great. There's so many something great, there's so many something great, there's so many alternatives is so much better.","I don't - alternatives is so much better. I don't - alternatives is so much better. I don't know for those people involved with the know for those people involved with the know for those people involved with the whole Obamacare thing and the Democrats whole Obamacare thing and the Democrats whole Obamacare thing and the Democrats have real problems over it because you have Real problems over it because you have real problems over it because you know they voted and it was a fraudulent know.","They voted and it was a fraudulent know. They voted and it was a fraudulent vote. Let's face it, cuz Obama lied and in vote, let's face it, cuz Obama lied and in vote, let's face it, cuz Obama lied and in all fairness to your Senators and your all fairness to your Senators and your all fairness to your Senators and your congressman who Happen to be Democrats, congressman who happen to be Democrats, congressman who happen to be Democrats Obama line 28 times, she said keep your Obama line 28 times.","She said keep your Obama line 28 times. She said keep your doctor keep your plan, keep your doctor, keep your plan, keep your doctor, keep your plan, keep your - everything, everything's great. It's going everything, everything's great. It's going everything, everything's great, it's going to be and then these guys got stuck with to be.","And then these guys got stuck with to be - and then these guys got stuck with it and now they have to defend it and it - and now they have to defend it and it - and now they have to defend it and they're not gonna be able To defend it, they're not gonna be able to defend it. They're not gonna be able to defend it.","And we're gonna go into a big league. But - and we're gonna go into a big league, but - and we're gonna go into a big league, but we're gonna have a plan. There's so much we're gonna have a plan, there's so much we're gonna have a plan, there's so much better. So much cheaper, you look at better so much cheaper, you look at better so much cheaper.","You look at what's happening with deductibles on what's happening with deductibles on what's happening with deductibles on Obama care, it's out of control, you don't Obama care, it's out of control. You don't - Obama care, it's out of control, you don't - you can't use it. If you get hit by a - you can't use it.","If you get hit by a - you can't use it. If you get hit by a tractor, maybe you'll get a couple of tractor. Maybe you'll get a couple of tractor, maybe you'll get a couple of bucks. The premiums have gone up 35, 45 bucks. The premiums have gone up 35, 45 bucks. The premiums have gone up 35, 45 and 55 percent and just the other day and 55 percent.","And just the other day and 55 percent and just the other day and a lot of the very good newspapers and a lot of the very good newspapers and a lot of the very good newspapers, frankly and even of the bed once and frankly. And even of the bed once and frankly and even of the bed once and there are plenty of bad ones, these guys - there are plenty of bad ones.","These guys - there are plenty of bad ones, these guys. So dishonest, oh yeah, yeah, such so dishonest. Oh, yeah, yeah, such so dishonest, oh yeah, yeah, such dishonesty with the - the mainstream media dishonesty with the - the mainstream media dishonesty with the - the mainstream media, I will tell you such total dishonesty.","I will tell you such total dishonesty. I will tell you such total dishonesty, but if you look at the - if you look at - but if you look at the - if you look at - but if you look at the - if you look at over the last few days, you're seeing a - over the last few Days you're seeing a - over the last few days, you're seeing a lot of stories that Obamacare is lot of stories, that Obamacare is lot of stories that Obamacare is collapsing of its own weight and - and in collapsing of its own weight and - and in collapsing of its Own weight and - and in 2017 unfortunately you know if it's 2017, unfortunately you know if it's 2017, unfortunately you know if it's gonna go let it go now so that he has to gonna go let it go now so that he has to gonna Go let it go now so that he has to straighten it out.","But he's not gonna straighten it out, but he's not gonna straighten it out. But he's not gonna straighten it out correctly because straighten it out correctly because straighten it out correctly because nothing he does is correct. Nothing he - nothing he does is correct. Nothing he - nothing he does is correct.","Nothing he does. If you think about it, here's a guy does. If you think about it, here's a guy does. If you think about it, here's a guy we've got Isis and others that want to - we've got Isis and others that want to - we've got Isis and others that want to destroy us and he's more worried about destroy us and he's more worried about destroy us.","And he's more worried about global warming, global warming, global warming and - and he believes not now think of and - and he believes not now think of and - and he believes not now think of this, this this and he believes go global. I mean these and he believes go global, I mean these and he believes go global, I mean these comes out all the time that make it comes out all the time that make it comes out all the time that make it biggest problem is global warming.","And I biggest problem is global warming and I biggest problem is global warming and I say is this real, are we living in the say, is this real? Are we living in the say, is this real? Are we living in the world? You have people that they want to world, you have people that they want to world, you have people that they want to blow up, our cities want to kill all of blow up.","Our cities want to kill all of blow up. Our cities want to kill all of our people. They're cutting off heads our people, they're cutting off heads our people, they're cutting off heads like it's no tomorrow in the Middle East like it's no tomorrow in the Middle East like it's no tomorrow in the Middle East.","And far were - I mean, they're doing and far were - I mean, they're doing and far were - I mean, they're doing everything. They're drowning people in everything. They're drowning people in everything, they're drowning people in cages. We haven't seen anything like this cages. We haven't seen anything like this cages.","We haven't seen anything like this since medieval times, you know, in since medieval times, you know in since medieval times, you know, in medieval times I'd read they chopped off medieval times. I'd read they chopped off medieval times. I'd read they chopped off heads heads heads I never said, did anyone see chopping off?","I never said, did anyone see chopping off? I never said, did anyone see chopping off heads until you know you just seeing it heads until you know you just seeing it heads until you know you just seeing it over the last couple of years. Ad ad, it's over the last couple of years, ad ad, it's over the last couple of years.","Ad ad, it's true, isn't it though? It's true you true, isn't it though? It's true you true, isn't it though? It's true you whoever heard of this, this is a vicious whoever heard of this, this is a vicious whoever heard of this, this is a vicious group of animals and we've got to stop group of animals and we've got to stop group of animals and we've got To stop them and we're gonna stop them so strong them and we're gonna stop them so strong them and we're gonna stop them so strong and so fast, so strong and so fast now and so fast, so strong and so fast now and so Fast, so strong and so fast.","Now one of the things I want to tell you, one of the things I want to tell you, one of the things I want to tell you this, because a lot of you have heard me this because a lot of you have heard me this because a Lot of you have heard me speak and you've seen it, you know, speak and you've seen it, you know, speak and you've seen it.","You know, they're always covered on live. They're always covered on live. They're always covered on live television. They get ratings. I guys television, they get ratings, I guys television, they get ratings. I guys speaking at ratings, okay? They make a speaking at ratings, okay? They make a speaking at ratings, okay?","They make a fortune off me and I can't stand them fortune off me and I can't stand them fortune off me and I can't stand them and they can't stand me. They're always and they can't stand me. They're always and they can't stand me. They're always lying and not telling the truth, but they lying and not telling the truth, but they lying and not telling the truth, but they always put me in life, tell them nobody always put me in life, tell them nobody always put me in life, tell them Nobody else goes on the live television.","These else goes on the live television. These else goes on the live television. These other guys running for office, they first other guys running for office. They first other guys running for office. They - first of all, they don't have crowds like this of all. They don't have crowds like this of all.","They don't have crowds like this. Believe me, they have. I mean Bush goes, he believe me, they have - I mean Bush goes, he believe me, they have. I mean, Bush goes, he has like 59 people. It's true has like 59 people. It's true has like 59 people. It's true, he stands up, he starts speaking, he stands up.","He starts speaking, he stands up. He starts speaking, everybody falls asleep. We can make a lot. Everybody falls asleep. We can make a lot everybody falls asleep. We can make a lot of money with him, become sleep master of money with him, become sleep master of money with him, become sleep master, put people to sleep.","Now it's not but and put people to sleep now, it's not but and put people to sleep now it's not. But - and the other ones, if they have a hundred, the other ones, if they have a hundred, the other ones, if they have a hundred people, it's a lot every - every place I go people, it's a lot every - every place I go people, it's a lot every - Every place I go, we have thousands and thousands.","This was - we have thousands and thousands. This was - we have thousands and thousands. This was only restricted by the size of the room, only restricted by the size of the room, only restricted by the size of the room. And we have thousands packed and the - and we have thousands packed and the - and we have thousands packed and the fire marshal, I love where's the fire fire marshal?","I love where's the fire fire marshal? I love where's the fire marshal, what an, you know, it was so good marshal what an, you know, it was so good marshal what an, you know, it was so good cuz otherwise we gonna have a lot of cuz. Otherwise, we gonna have a lot of cuz otherwise we gonna have a lot of people standing outside.","They're still people standing outside. They're still people standing outside. They're still coming in the back. You're right, you're coming in the back. You're right, you're coming in the back, you're right, you're right, man, right, man, right, man, so by so by so by great people here, great, great people, but great people here, great, great people, but great people here, great, great people.","But we are going to do something that's - so we are going to do something that's - so we are going to do something that's so special because you know it was just special because you know it was just special because you know it was just mentioned that you Said movement, what do mentioned that you said movement, what do mentioned that you said movement, what do you think you think this is a movement you think you think this is a movement you think you think this is a movement, this is a movie.","I mean, master Steve said this is a movie. I mean, master Steve said this is a movie. I mean, master Steve said it's a movement. I didn't - I never told it's a movement. I didn't - I never told it's a movement. I didn't - I never told him that he might have listened because him that he might have listened because him that he might have listened because I used the expression sometimes.","But this - I used the expression sometimes, but this - I used the expression sometimes, but this is a movement is a movement, is a movement. I go to Dallas with the Mavericks play, I go to Dallas with the Mavericks play. I go to Dallas with the Mavericks play and oh, you guys like the Mavericks and - oh, you guys like the Mavericks and - oh, you guys like the Mavericks, that's good, good players.","And the owner that's good, good players and the owner that's good, good players and the owner, mark, mark, you but has been great. He's mark, mark, you, but has been great. He's mark, mark, you, but has been great. He's been great to us. You know, I have to tell been great to us, you know, I have to tell been great to us.","You know, I have to tell you and he said you want to use it, use you and he said you want to use it, use you. And he said you want to use it, use it and it was like go to Thursday, I said it and it was like go to Thursday, I said it and it was like go to Thursday, I said when he said Monday, I said how many, when he Said Monday, I said how many - when he said Monday, I said how many seats you have like 20,000, we filled it seats, you have like 20,000, we filled it seats, you have like 20,000, we filled it up in a day and a half.","We had no, no, we up in a day and a half, we had no, no, we up in a day and a half, we had no, no, we had time left over. We had 20,000 in, had time left over. We had 20,000 in, had time left over. We had 20,000 in Dallas, we had 20,000 in Oklahoma, we had Dallas, we had 20,000 in Oklahoma, we had Dallas, we had 20,000 in Oklahoma.","We had 35,000 people in Mobile, Alabama and 35,000 people in Mobile, Alabama and 35,000 people in Mobile, Alabama. And everywhere we go and I mean literally we - everywhere we go and I mean literally we - everywhere we go and I mean literally we go up to New Hampshire, we have crowds go up to New Hampshire.","We have crowds go up to New Hampshire. We have crowds that are many, many, many times the size that are many, many, many times the size that are many, many, many times the size of anyone else, nobody has even close of anyone else. Nobody has even close of anyone else. Nobody has even close. Thank You, Man.","Look at that guy. Thank You Man. Look at that guy. Thank You Man. Look at that guy. Thank you man. That's cool and I like thank you man, that's cool and I like thank you man that's cool. And I like your hat hold that hat up. Do we like your hat hold that hat up? Do we like your hat, hold that hat up? Do we like that happen, look at that, that happen, look at that that happen look at that and it looks better with that, with that and it looks better with that, with that and it looks better with that.","With that sort of okay, head of hair, I wouldn't say sort of okay, head of hair, I wouldn't say sort of okay, head of hair, I wouldn't say it, but I wouldn't say the greatest I've it. But I wouldn't say the greatest I've it. But I wouldn't say the greatest I've ever seen, but it's acceptable, hey, has ever seen, but it's acceptable, hey, has ever seen, but it's acceptable, hey, has didn't hurt him any.","It's really great, didn't hurt him any. It's really great, didn't hurt him any. It's really great. Thank you very much. You know, it's just thank you very much. You know, it's just thank you very much. You know it's just an honor to be here, but we're gonna be an honor to be here, but we're gonna be an honor to be here.","But we're gonna be so proud, so I started this whole thing, so proud. So I started this whole thing, so proud. So I started this whole thing as you know in June and it takes courage as you know in June and it takes courage. As you know, in June and it takes courage to run for it, does it takes courage to run for it, does it takes courage to run for it?","Does it takes courage? Especially I've never done this before, especially I've never done this before, especially I've never done this before and I'm self-funding my own campaign all and I'm self-funding my own campaign, all and I'm self-funding my own campaign, all these other guys. They're like these other guys.","They're like these other guys. They're like bloodsuckers. No, it's like blood, sir. These packs are a disgrace. They totally - these packs are a disgrace. They totally - these packs are a disgrace. They totally control the cannon. No, they're a disgrace control. The cannon, no, they're a disgrace control.","The cannon, no, they're a disgrace and I could have had a pack, you know and I could have had a pack, you know and I could have had a pack, you know, Bush raised 125 million dollars and he's Bush raised 125 million dollars and he's Bush raised 125 million dollars, and he's dying, he's dying in the polls dying, he's dying in the polls dying, he's dying in the polls, Rubio, all of them.","I - I won't say a couple Rubio, all of them. I - I won't say a couple Rubio, all of them, I - I won't say a couple of them because so far a couple of them. Of them, because so far a couple of them of them because so far a couple of them I like. But that'll end because they all I like. But that'll end because they all I like.","But that'll end because they all have to go through me. You know, they all have to go through me. You know, they all have to go through me. You know, they all know how. So it has to have, oh, it has to know how. So it has to have, oh, it has to know how. So it has to have, oh, it has to now Cruz, you know, as an example, Cruz has now Cruz, you know as an example, Cruz has now Cruz, you know as an example, Cruz has been great.","To me. It's been really nice, been great to me. It's been really nice, been great to me. It's been really nice to him. Otherwise he agrees it, you know, to him. Otherwise he agrees it, you know to him. Otherwise he agrees it. You know everything's good, but at some point he's - everything's good. But at some point, he's - everything's good, but at some point, he's gonna have to say I can to attack him gonna have to say I can to attack him gonna have to say I can to attack him because otherwise I'm gonna come in Because otherwise, I'm gonna come in because otherwise I'm gonna come in second place or third place or something, second place or third place or something second place or third place or something.","So they've all got to attack and I love. So they've all got to attack and I love. So they've all got to attack and I love it when they attack cuz so far everyone it when they attack cuz so far everyone it when they attack cuz. So far everyone that's attacked me, his gun bingo, right? That's attacked me, his gun bingo, right?","That's attacked me. His gun bingo, right? They've gone down, they've gone down, they've gone down, they've gone down big league. I shouldn't - they've gone down big league. I shouldn't. They've gone down big league. I shouldn't say this in front of the pastors cuz say this in front of the pastors cuz say this in front of the pastors cuz, they'll say that's not nice.","Is it okay? They'll say that's not nice. Is it okay? They'll say that's not nice. Is it okay, it's okay, right? They like winning. I mean, it's okay, right? They like winning. I mean, it's okay, right? They like winning. I mean, it's all about winning. It's really about - it's all about winning, it's really about - it's all about winning.","It's really about making America great again, that's what making America great. Again. That's what making America great. Again, that's what I've learned. That's I've learned that's - I've learned that's - so today, I read a big, big article that - so today, I read a big, big article that - so today, I read a big, big article that everyone's afraid to fight me because everyone's afraid to fight me because everyone's afraid to Fight me because you know so, hey, look, you look at Perry, you know, so, hey, look, you look at Perry, you know, so, hey, look, you look at Perry, very nice man, very nice man, very nice man from Texas, right, governor Perry and he from Texas, right Governor Perry and he from Texas, right governor Perry and he was so nice to me was so nice to me was so nice to me then all of a sudden one day I said he then all of a sudden one day I said he then all of A sudden one day I said he couldn't have said that he was vicious, couldn't have said that he was vicious, couldn't have said that he was vicious and violent went to Washington, made his and violent went to Washington, made his and violent went to Washington, made his Speech, the whole speech was about me for speech, the whole speech was about me for speech, the whole speech was about me for like a half an hour.","And I had to attack like a half an hour. And I had to attack like a half an hour. And I had to attack him and I attacked him very viciously him and I attacked him very viciously him and I attacked him very viciously and I feel guilty, not really I attacked and I feel guilty, not really. I attacked and I feel guilty not really.","I attacked him remember on the glasses and I him remember on the glasses and I him remember on the glasses and I attacked him of the IQ, okay? And then you attacked him of the IQ, okay? And then you attacked him of the IQ, okay? And then you have a guy like Lindsey Graham, he's a - have a guy like Lindsey Graham.","He's a - have a guy like Lindsey Graham, he's a sitting senator and you go to South, sitting senator and you go to South, sitting senator and you go to South Karen, by the way, his plan, I know so much, Karen, by the way, his plan. I know. So much, Karen, by the way, his plan, I know so much more than he does.","His plan is so bad more than he does. His plan is so bad more than he does. His plan is so bad. It's so stupid. It's so stupid, it's so stupid, it's so stupid, it's so stupid. It's so stupid. Remember that in the America we deserve. Remember that in the America we deserve. Remember that in the America we deserve.","I wrote that book in 2000. I wrote about - I wrote that book in 2000, I wrote about - I wrote that book in 2000, I wrote about Osama bin Laden, we got to take him out Osama bin Laden, we got to take him out Osama bin Laden, we got to take him out. You got to know where to use your power, you got to know where to use your power.","You got to know where to use your power. And I said, and I don't know how many and I said and I don't know how many and I said, and I don't know how many people saw it, but a couple of the people saw it, but a couple of the people saw it. But a couple of the announcers in the morning, they said wait announcers in the morning, they said wait announcers in the morning, they said wait a minute that book, what was it written a minute that book, what was it written a minute that book, what was it Written 2000, so I had Osama bin Laden and the 2000, so I had Osama bin Laden and the 2000. So I had Osama bin Laden.","And the reason is I watch and I listen and reason is I watch and I listen and reason is I watch and I listen and there's this guy with a big mouth, who is - there's this guy with a big mouth, who is - there's this guy with a Big mouth, who is very tall and I said wait a minute, let very tall and I said wait a minute, let very tall and I said wait a minute.","Let me ask you - oh, I hear some friends. I hear me ask you. Oh, I hear some friends. I hear me ask you - oh, I hear some friends, I hear some friends. I guess some friends you some friends, I guess some friends you some friends, I guess some friends, you know they don't want to make America know they don't want to make America know they don't want to make America great.","Again. I swear I don't think they great. Again, I swear I don't think they great. Again, I swear I don't think they do. You know, we want to be a unifier and do you know we want to be a unifier and do you know we want to be a unifier and we have to be a unifier. We have to be - we have to be a unifier.","We have to be - we have to be a unifier we have to be. And the funny thing is I do a great job. And the funny thing is I do a great job. And the funny thing is I do a great job with things and they will be a big with things and they will be a big with things and they will be a big beneficiary, but maybe they just don't beneficiary, but maybe they just don't beneficiary.","But maybe they just don't understand it yet, okay, maybe they don't understand it yet. Okay, maybe they don't understand it yet. Okay. Maybe they don't understand it yet, understand it yet, understand it yet, but maybe the - maybe the police could, but maybe the - maybe the police could. But maybe the - maybe the police could move them away, so we can all hear move them away.","So we can all hear move them away. So we can all hear ourselves, George, get them out. We have ourselves, George, get them out, we have ourselves, George, get them out. We have too far we have too far we have too far we have, yeah, we have to do not. It's not fair to - yeah, we have to do not. It's not fair to - yeah, we have to do not.","It's not fair to the pig. Thank you. Thank you. Thank you. You know, you know, the sad thing, there's, you know, you know the sad thing, there's, you know, you know the sad thing, there's like a very small group of people out like a very small group of people out like a very small group of people out there.","Although they are pretty noisy I there although they are pretty noisy I there although they are pretty noisy I will say, but now listen to him, yeah, well will say, but now listen to him, yeah, well will say, but now listen to him, yeah, well the police Removed them very nicely, very the police, removed them very nicely, very the police, removed them very nicely, very gently.","Please gently. Please gently, please. You know, I'll tell you what happens. So you know, I'll tell you what happens. So you know, I'll tell you what happens. So sometimes I'll say I want him out now, sometimes I'll say I want him out now, sometimes I'll say I want him out now and then they say he was terrible, he was and then they say he was terrible, he was and then they say he was Terrible, he was so nasty.","So uh, so then I go, please be so nasty. So uh, so then I go, please be so nasty. So uh, so then I go, please be gentle, please say. And then they say he's gentle, please say. And then they say he's gentle, please say and then they say he's too soft to be break, you know, you can't too soft to be break, you know, you can't too soft to be break, you know, you can't win, you can't win.","So I'll go middle, same win you can't win. So I'll go middle, same win you can't win. So I'll go middle same. Yeah, if you could remove them as soon as, yeah, if you could remove them as soon as, yeah, if you could remove them as soon as possible, that'll be good, aren't the possible that'll be good, aren't the possible that'll be good, aren't the police out there?","I think after the police out there, I think after the police out there, I think after the building after the build up my gate building after the build up my gate building after the build up my gate might think they're gonna do a great job. Might think they're gonna do a great job, might think they're gonna do a great job.","Yeah, we have to move them. Thank you very yeah, we have to move them. Thank you very yeah, we have to move them. Thank you very much. Thank you very much. Look at it the much. Thank you very much look at it the much. Thank you very much. Look at it. The people are pouring in through them, people are pouring in through them.","People are pouring in through them. They're coming in and you know the - they're coming in and you know the - they're coming in and you know the saddest part, you have a few people there saddest part, you have a few people there saddest part, you have a few people there. You have thousands of people here and you have thousands of people here and you have thousands of people here and the media, the headlines tomorrow will be the media.","The headlines tomorrow will be the media. The headlines tomorrow will be all protesters, right, protester, you know, all protesters, right, protester, you know, all protesters, right protester, you know what we have and I say it, I say it and I - what we have and I say it, I say it and I - what we Have - and I say it, I say it and I say it strongly, I used to use the term say it strongly, I used to use the term say it strongly, I used to use the term silent majority and the term has been silent majority and the term Has been silent, majority and the term has been used over the years and it really is used over the years.","And it really is used over the years. And it really is people that have been abused and we have people that have been abused and we have people that have been abused and we have a majority. But we don't know. We have a - a majority, but we don't know. We have a - a majority, but we don't know. We have a majority, but it's not a silent majority, majority, but it's not a silent majority, majority, but it's not a silent majority.","It's really become a noisy majority. It's the noisy majority and that's okay. It's the noisy majority and that's okay, it's the noisy majority and that's okay, that's okay, that's okay, that's okay. And because that's what we have to be, we - and because that's what we have to be, we - and because that's what we have to be, we have to be heard now folks because our have to be heard now folks because our have to be heard now folks Because our country's going to hell, we have a country's going to hell.","We have a country's going to hell. We have a president who's incompetent. He's president who's incompetent, he's president who's incompetent. He's incompetent, I'll tell you what this guy incompetent. I'll tell you what this guy incompetent, I'll tell you what this guy is grossly incompetent when I watch him is grossly incompetent when I watch him is grossly incompetent.","When I watch him taking all of this time and you know taking all of this time and you know taking all of this time and you know what I want clean air, I want clean water what I want clean air. I want clean water. What I want clean air, I want clean water, I want it to be immaculate. I want to be - I want it to be immaculate.","I want to be - I want it to be immaculate. I want to be sparkling. I want to be great. I've won so sparkling. I want to be great. I've won so sparkling, I want to be great. I've won so many environmental awards over the years, many environmental awards over the years, many environmental awards over the years.","You know I develop, I'm good. I'm really a - you know, I develop, I'm good. I'm really a - you know, I develop, I'm good. I'm really a great developer. Now I'm a politician, I great developer, now I'm a politician, I great developer now I'm a politician I - yeah, yeah, but I'm a great tavella and yeah, yeah, but I'm a great tavella and yeah, yeah, but I'm a great tavella and I've won so many environmental awards.","I've won so many environmental awards. I've won so many environmental awards and I'm proud of them. I think it's a - and I'm proud of them. I think it's a - and I'm proud of them. I think it's a great thing, but it's gotten - it's gotten great thing, but it's gotten - it's gotten great thing, but it's gotten - it's gotten out of control and this whole global out of control and this whole global out of control and this whole global warming thing, you Know they change it warming thing, you know they change it warming thing, you know they change it, global warming, climate change, extreme global warming, climate change, extreme global warming, climate change, extreme weather.","The reason is it's never sort of weather. The reason is it's never sort of weather. The reason is it's never sort of working now. The extreme weather one's working now the extreme weather one's working now the extreme weather, one's the bet, that's - that's truly got ta work, the bet that's - that's truly got ta work.","The bet that's - that's truly got ta work right. You know you see, I remember during right, you know you see, I remember during right, you know you see, I remember during the winter we had sort of a bad storm. The winter, we had sort of a bad storm. The winter, we had sort of a bad storm and they said, oh, wow!","This is global. And they said, oh, wow! This is global. And they said, oh, wow! This is global warming, global warming and it's warming global warming and it's warming global warming and it's unbelievable. And the snow was all over unbelievable and the snow was all over unbelievable and the snow was all over the place.","And they said we haven't had a - the place and they said we haven't had a the place and they said we haven't had a snow. Now this was the third, the number snow. Now this was the third, the number snow. Now this was the third - the number one snowstorm was in 1889 which blew one snowstorm was in 1889, which blew one snowstorm was in 1889, which blew everything out the window.","Look, we're everything out the window. Look, we're everything out the window. Look, we're gonna have, you know like this, it goes gonna have, you know like this, it goes gonna have, you know like this, it goes like this like this like this and we do want - we want clean air and we - and we do want - We want clean air and we - and we do want - we want clean air and we want clean water and other things, but want clean water and other things, but want clean water and other things.","But it's gotten to a point people are making. It's gotten to a point people are making, it's gotten to a point people are making a fortune off this stuff and our a fortune off this stuff and our a fortune off this stuff and our businesses are being hurt. Our businesses are being hurt. Our businesses are being hurt, our manufacturers can't compete, giant is manufacturers can't compete.","Giant is manufacturers can't compete. Giant is over there right now, laughing like hell over there right now, laughing like hell over there right now, laughing like hell at Barack Obama because we're stopping at Barack Obama because we're stopping at Barack Obama because we're stopping our plants from functioning and make it our Plants from functioning and make it our plants from functioning and make it so expensive and not any better, so expensive and not any better, so expensive and not any better pollution was.","So we're stopping our pollution was, so we're stopping our pollution was. So we're stopping our plants, we're doing all of this damage plants. We're doing all of this damage plants. We're doing all of this damage. China's agreeing to do things in many China's agreeing to do things in many China's agreeing to do things in many years from now.","And they'll violate the years from now and they'll violate the years from now and they'll violate the agreement a hundred percent because they agreement a hundred percent because they agreement a hundred percent because they always do just like Iran does just like always do, just like Iran. Does just like always do, just like Iran does, just like everybody does, everybody does everybody does.","We like the dummies. We like the - we like the dummies. We like the - we like the dummies. We like the - just the dummies I feel we used to be. So just the dummies I feel we used to be, so just the dummies, I feel we used to be so proud now we feel so stupid. We'll let by proud now. We feel so stupid. We'll let by proud now.","We feel so stupid. We'll let by stupid people and we can't have it stupid people and we can't have it stupid people and we can't have it anymore anymore anymore. We can't happen anymore some believe and we can't happen anymore some believe and we can't happen anymore some believe. And by the way, what I'm gonna do is we're - by the way, what I'm gonna do is we're - by the way, what I'm gonna do is we're gonna take some questions in a way you gonna take some questions in a way you Gon na take some questions in a way, you know it took me, it was brutal to get know it, took me, it was brutal to get know it took me, it was brutal to get here today.","I might as well stick around here today. I might as well stick around here today, I might as well stick around for a while. So - so what we're gonna do for a while, so - so what we're gonna do for a while. So, so what we're gonna do, you can start thinking about it because you can start thinking about it because you can start thinking about it because in another few minutes we're gonna talk in another few minutes.","We're gonna talk in another few minutes. We're gonna talk a little bit about what we have been a little bit about what we have been a little bit about what we have been planned and I want to take some planned and I want to take some planned and I want to take some Questions because I always find I love questions because I always find I love questions because I always find I love it.","I love taking questions even if it - I love taking questions even if it - I love taking questions. Even if they're vicious, horrible, violent, they're vicious, horrible, violent, they're vicious, horrible, violent questions. We'll take them anyway. Okay, questions, we'll take them anyway. Okay, questions, we'll take them anyway.","Okay. One thing you know with Hillary, she - one thing you know with Hillary, she - one thing you know with Hillary, she doesn't have the strength or the stamina doesn't have the strength or the stamina doesn't have the strength or the stamina to be President. She doesn't have it to be President, she doesn't have it to be President, she doesn't have it.","And I know her, I know I can't look you and I know her, I know I can't. Look, you and I know her, I know I can't. Look, you have to understand, I've got no longer have to understand, I've got no longer have to understand. I've got no longer over the years with everybody. I was a - over the years with everybody, I was a - over the years with everybody, I was a businessman, one of the magazine's said businessman, one of the magazine's said businessman, one of the magazine's said I'm a world-class businessman grave.","I'm a world-class businessman grave. I'm a world-class businessman, grave I am - I'm a great prisoner. I've made a - I am - I'm a great prisoner. I've made a - I am - I'm a great prisoner. I've made a fortune and I want to put that same fortune and I want to put that same fortune and I want to put that same thinking for the country.","We owe 19 thinking for the country. We owe 19 thinking for the country. We owe 19 trillion dollars, it's gonna be 21 trillion dollars, it's gonna be 21 trillion dollars, it's gonna be 21 trillion dollars very soon. You see this trillion dollars very soon you see this trillion dollars very soon. You see this ridiculous budget that was just passed ridiculous budget that was just passed ridiculous budget that was just passed like they passed it immediately.","Nobody like they passed it immediately. Nobody like they passed it immediately. Nobody fights. I was saying I know where the fights I was saying I know where the fights. I was saying I know where the Democrats are coming from, but the Democrats are coming from, but the Democrats are coming from. But the Republicans in a way are more Republicans in a way are more Republicans in a way are more disappointing because they go.","You elect disappointing because they go. You elect disappointing because they go, you elect them and you know what happens and look them. And you know what happens and look them and you know what happens. And look, you had in Virginia, one of the greatest you had in Virginia, one of the greatest you had in Virginia, one of the greatest upsets of all time and he deserved to be upsets of all time and he deserved to be upsets of all time.","And he deserved to be upset by the way, you know he's back in upset by the way, you know he's back in upset by the way. You know he's back in Bush. That was the end of Bush. Can you Bush that was the end of Bush? Can you Bush that was the end of Bush, can you believe that, but it was one of the believe that, but it was one of the believe that, but it was one of the greatest upsets.","I think it never greatest upsets. I think it never greatest upsets. I think it never happened before and you were so smart, I happened before and you were so smart. I happened before and you were so smart. I mean you were so smart, but what happens mean you were so smart, but what happens mean you were so smart, but what happens is they say we are going to end is they say we are going to end is they say we are going to end Obamacare, we are going to make our Obamacare, we are going to make our Obamacare, we are going to make our military strong.","We're gonna take our military strong. We're gonna take our military strong. We're gonna take our vets and we're gonna make our vets so vets and we're gonna make our vets. So vets and we're gonna make our vets so happy, everything's gonna be great, blah, happy, everything's gonna be great, blah, happy, everything's gonna be great, blah, blah, blah.","All words, you know, it's all blah, blah. All words, you know, it's all blah, blah. All words, you know, it's all talk, no action, politicians, right, and you talk no action, politicians, right? And you talk no action, politicians, right? And you love them and you're all forum and they love them and you're all forum and they love them and you're all forum.","And they win their election and they go to win their election and they go to win their election and they go to Washington. I always say it and they're Washington, I always say it and they're Washington, I always say it and they're with their wife or their - with their - with their wife or their - with their - with their wife or their - with their husband and they say, look, look, Mary, we Husband and they say, look, look Mary, we husband and they say, look, look Mary, we finally made it, look at the beautiful finally made it, look at the beautiful finally made it, look at the beautiful look at the beautiful columns, look at look at the beautiful columns, Look at, look at the beautiful columns, look at this, this is like they go into the - this - this is like they go into the - this - this is like they go into the Capitol building.","They say, oh, this is Capitol building, they say, oh, this is Capitol building. They say, oh, this is beautiful. This is beautiful. Now they beautiful. This is beautiful. Now they beautiful. This is beautiful. Now they have a vote on Obamacare, have a vote on Obamacare, have a vote on Obamacare. Oh, I vote in favor of it.","I don't want to - oh, I vote in favor of it. I don't want to - oh, I vote in favor of it. I don't want to believe this place, this is beautiful. Believe this place, this is beautiful. Believe this place, this is beautiful, don't they let us down. You know, no, they don't. They let us down, you know, no, they don't.","They let us down. You know no, they look, I promise you one thing. Look, I promise you one thing, look, I promise you one thing if I win, you'll say when - what, where what if I win, you'll say when - what, where what if I win, you'll say when, what, where what that always say. But I have to start up that always say but I have to start up that always say but I have to start up, you know, look I am against 15 guys.","It you know, look I am against 15 guys. It you know, look I am against 15 guys, it was 17 and what 17 now it's 15 and it's was 17 and what 17 now it's 15 and it's was 17 and what 17 now it's 15 and it's drying up fast, you know, yeah, drying up fast. You know, yeah, drying up fast, you know, yeah, yep guys with zero and they continue to yep guys with zero and they continue to yep guys with zero and they continue to go along.","Tell me can that be good for go along? Tell me, can that be good for go along, tell me can that be good for them? I mean you guys like Pataki he them. I mean you guys like Pataki he them. I mean you guys like Pataki, he can't get elected dog catcher, you have - can't get elected dog catcher, you have can't get elected dog catcher.","You have guys, you have guys honestly you have guys, you have guys, honestly you have guys, you have guys, honestly you have guys that can't even if you think about guys that can't even if you think about guys that can't even if you think about it, it It can't - even they can't get 1 %, they can't, can't even they can't get 1 %, they can't, can't even they can't get 1 %, they can't get anything.","They actually had one of get anything. They actually had one of get anything. They actually had one of them down with a zero and an arrow, them down with a zero and an arrow them down with a zero and an arrow pointing left, meaning less than zero pointing left, meaning less than zero pointing left, meaning less than zero.","That was on television now. I think that was on television now. I think that was on television now. I think that's a typographical error of some that's a typographical error of some that's a typographical error of some kind because how do you get less than kind because how do you get less than kind because how do you get less than zero, but it's like that's What it is and zero, but it's like that's what it is and zero, but it's like that's what it is and some of them didn't even register in.","Some of them didn't even register in. Some of them didn't even register in upcoming states and now they missed upcoming states and now they missed upcoming states and now they missed their times, right? They've missed their their times, right? They've missed their their times, right? They've missed their times and I was told that missed their times and I was told that missed their times and I was told that missed their times.","Well, if a guy doesn't want to put times, well, if a guy doesn't want to put times, well, if a guy doesn't want to put up money because he knows he's not gonna up money because he knows he's not gonna up money because he knows He's not gonna win or he can't get enough signatures to win or he can't get enough signatures to win or he can't get enough signatures to register in a Virginia or South Carolina register in a Virginia or South Carolina register in a Virginia or South Carolina Or in New Hampshire or wherever it may or in New Hampshire or wherever it may or in New Hampshire or wherever it may be, but numbers of them haven't register be, but numbers of them haven't register be, but numbers of them haven't register.","Why do we allow them to debate? I mean, if why do we allow them to debate, I mean, if why do we allow them to debate. I mean, if somebody gives up the state of Virginia, somebody gives up the state of Virginia, somebody gives up the state of Virginia or if somebody gives up the state of or if somebody gives up the state of or if somebody gives up the state of South Carolina, because you know they're South Carolina because you know they're South Carolina because you know they're pretty hard to get on the ballot.","They pretty hard to get on the ballot. They pretty hard to get on the ballot. They are by the way I'm already on the ballot are by the way I'm already on the ballot are by the way I'm already on the ballot. I got - I had some - I got - I had some - I got - I had some - I had something. Thank you. Thank you.","I - I had something. Thank you. Thank you. I - I had something. Thank you. Thank you. I know they're just saying we helped, you know, they're just saying we helped, you know, they're just saying we helped, you know, we had so many wheat, you know, I did know we had so many wheat, you know, I did know we had so many wheat, you Know, I did - we took many times the number of - we took many times the number of - we took many times the number of signatures.","We needed a lot and we did it signatures. We needed a lot and we did it signatures. We needed a lot and we did it so quickly who did it? You did it right? So quickly who did it? You did it right? So quickly, who did it? You did it right here stand up and take a bow, but you here stand up and take a bow, but you here stand up and take a bow, but you know what it is true.","Thank you honey a know what it is true. Thank you honey. A know what it is true. Thank you honey, a really great job. I know that if somebody really great job, I know that if somebody really great job, I know that if somebody doesn't get on the ballot and they can't, doesn't get on the ballot and they can't, doesn't get on the ballot and they can't get them about cuz.","They missed that time, get them about cuz, they missed that time, get them about cuz, they missed that time limit. So that means they gave up you limit. So that means they gave up you limit. So that means they gave up you know, a major state someplace why would know a major state someplace why would know a major state someplace.","Why would you let them on the debate stage to you, let them on the debate stage to you, let them on the debate stage to waste everybody's time and they're waste everybody's time and they're waste everybody's time and they're already at zero or one or two. Why would already at zero or one or two, why would already at zero or one or two?","Why would you allow them to be on the debate stage you allow them to be on the debate stage, you allow them to be on the debate stage. It's - it's - so it's not unfair, it's just - it's - it's - so it's not unfair, it's just - it's - it's - so it's not unfair, it's just stupid. It would psyche what are we doing stupid, it would psyche, what are we doing stupid, it would psyche, what are we doing.","And you don't have time to talk mr. and you don't have time to talk mr. and you don't have time to talk. Mr. Trump, the war in the Middle East in 30, Trump the war in the Middle East in 30, Trump the war in the Middle East. In 30 seconds, sir, what would you do? 30 seconds, seconds, sir, what would you do?","30 seconds, seconds, sir, what would you do? 30 seconds, and you know it's funny on the debates and you know it's funny on the debates and you know it's funny on the debates and I don't know if you've seen this, but - and I don't know if you've seen this, but - and I don't know if You've seen this, but I think almost or just about every - I think almost or just about every - I think almost or just about every single poll where they do the online single poll where they do the online single poll where they do the online polls.","After the big Drudge was an polls after the big Drudge was an polls after the big Drudge was an amazing guy by the way, if you ever met amazing guy by the way, if you ever met amazing guy by the way, if you ever met drugs, we Love drugs, drugs, we love drugs, drugs, we love drugs. He's an amazing guy, but drudge Time, he's an amazing guy.","But drudge Time, he's an amazing guy. But drudge Time magazine slate, every one of these groups magazine slate. Every one of these groups magazine slate, every one of these groups, they're doing these online polls of like they're doing these online polls of like they're doing these online polls of like six or seven.","Every debate I've won every six or seven, every debate I've won every six or seven, every debate, I've won every single poll in every single debate and single poll in every single debate and single poll in every single debate. And I'm really happy about it. I'm really happy about it. I'm really happy about it.","Now, I'll tell you cuz, it's become a big now I'll tell you cuz it's become a big now I'll tell you cuz it's become a big story. So the other day I said I don't story. So the other day I said I don't story so the other day I said I don't want to bring in my - okay, the break is want to bring in my - okay, the break is want to bring in my - okay, the break is early, so I will.","So let's say they would early, so I will - so let's say they would early. So I will - so let's say they would have had a couple of million. People have had a couple of million people have had a couple of million people watching the first debate, right? You know, watching the first debate, right, you know, watching the first debate, right?","You know, and it used to be that these debates and it used to be that these debates and it used to be that these debates, nobody even wanted up the television or nobody even wanted up the television or nobody even wanted up the television or if they Had I think they forced them if they had, I think they forced them.","If they had, I think they forced them down their throat. You have to take the down their throat. You have to take the down their throat. You have to take the debater with taking your license away or debater with taking your license away or debater with taking your license away or something, right? So the first debate was something, right?","So the first debate was something, right? So the first debate was by Fox and they had 24 million people by Fox and they had 24 million people by Fox and they had 24 million people actually more than that after the final - actually more than that after the final - actually more than that after the Final numbers, but 24 million people which was numbers, but 24 million people which was numbers, but 24 million people which was about the largest and the history of about the largest and the history of about the largest and the history of cable television, right.","The next one was cable television, right? The next one was cable television, right? The next one was CNN with their 23 million people now CNN with their 23 million people now CNN with their 23 million people. Now think of this - think of this - think of this CNN's covered some pretty big events. CNN's covered some pretty big events.","CNN's covered some pretty big events like Wars and other things right in the like Wars and other things, right in the like Wars and other things, right. In the history of CNN, it was the highest-rated history of CNN. It was the highest-rated history of CNN. It was the highest-rated show they've ever had and they made it show they've ever had and they made it show they've ever had and they made it three hours, which they shouldn't have three hours, which they shouldn't have three hours, which they shouldn't have done because I'm Still on that phone I done because I'm still on that phone I done because I'm still on that phone.","I could stand up. I could do this for 20, could stand up. I could do this for 20, could stand up. I could do this for 20 hours straight wouldn't matter, but hours straight wouldn't matter, but hours straight wouldn't matter. But nobody wants to watch this stuff for. Nobody wants to watch this stuff for.","Nobody wants to watch this stuff for three hours, three hours, three hours, especially when 90 % of the people know, especially when 90 % of the people know, especially when 90 % of the people know they're not doing what they're doing it. They're not doing what they're doing it. They're not doing what they're doing it.","I don't even know why they're doing it. I don't even know why they're doing it. I don't even know why they're doing it, but nobody wants. So that was unfair and - but nobody wants. So that was unfair and but nobody wants, so that was unfair. And then when we went to CNBC where that guy then when we went to CNBC where that guy then when we went to CNBC where that guy John Harwood, what an idiot he was right, John.","Harwood, what an idiot? He was right. John Harwood, what an idiot he was right now, how bad he's not even a professional now how bad he's not even a professional. Now how bad he's not even a professional and I have to tell you for four weeks and I have to tell you for four weeks and I have to tell you for four weeks before that.","He was so nice to me before that he was so nice to me before that he was so nice to me. Oh, mr. Trump. Oh, you're so wonderful, you? Oh, mr. Trump. Oh, you're so wonderful, you? Oh, mr. Trump. Oh, you're so wonderful. You know, mr. Trump, you're great and then he know mr. Trump, you're great and then he know mr.","Trump, you're great and then he comes out with a question he reads, it comes out with a question he reads, it comes out with a question, he reads it. Mr. Trump, and you know it reads a mr. Trump and you know it reads a mr. Trump and you know it reads a wiseguy question, I said that's not a wiseguy question.","I said that's not a wiseguy question. I said that's not a very nice question. To start off the day, very nice question to start off the day, very nice question to start off the day, but they wanted three hours because - but they wanted three hours because - but they wanted three hours because advertising sells for so much.","Now that advertising sells for. So much now that advertising sells for so much now that they make a fortune and I said I'm not - they make a fortune and I said I'm not - they make a fortune and I said I'm not gonna let him have three hours. I'm not gonna let him have three hours, I'm not gonna let him have three hours.","I'm not gonna let him have it and everyone said gonna let him have it and everyone said gonna let him have it. And everyone said these same people, they said, oh, you'll these same people, they said, oh, you'll these same people. They said, oh, you'll never be able to stop him. And I said you never be able to stop him.","And I said you never be able to stop him and I said you say, well, I stopped him. I think it took say, well, I stopped him. I think it took say, well, I stopped him. I think it took me what do you think, Cory, about three me, what do you think, Cory, about three me, what do you think Cory, about three minutes?","No, I said I'm not going and I minutes. No, I said I'm not going and I minutes. No, I said I'm not going and I have to tell you Carson said I'll - he'll have to tell you Carson said I'll - he'll have to tell you Carson said I'll - he'll go along with it. So that was very nice go along with it. So that was very nice go along with it.","So that was very nice. Ben Carson and he said that was - nope. I - Ben Carson and he said that was - nope. I - Ben Carson and he said that was - nope. I have to give credit where credit is due. Have to give credit where credit is due, have to give credit where credit is due because I've been a little bit rough on because I've been a little bit rough on because I've been a little bit rough on him.","But I have to give credit where he him, but I have to give credit where he him. But I have to give credit where he came along and he said I would go along came along and he said I would go along came along and he said I would go along and just so I went in, we went in and I - and just so I went in, we went in and I - and just so I went in, we went in and I said the two of us we're not doing.","It said the two of us we're not doing. It said the two of us, we're not doing it and they folded like an umbrella it took and they folded like an umbrella it took and they folded like an umbrella. It took two minutes. So now my big thing is they two minutes. So now my big thing is they two minutes. So now my big thing is they all say you can't get Mexico to pay for all say you can't get Mexico to pay for all say you can't get Mexico to pay for the wall dryer, the wall dryer.","The wall dryer time we're gonna build a wall time, we're gonna build a wall time, we're gonna build a wall, try try, try, we're gonna build a wall, it's going to - we're gonna build a wall, it's going to - we're gonna build A wall, it's going to be a great wall. It's not gonna be a - be a great wall. It's not gonna be a - be a great wall.","It's not gonna be a little toy. We'll build it not for a lot little toy. We'll build it. Not for a lot little toy, we'll build it not for a lot of money. You know in China they built of money. You know in China they built of money. You know in China they built the Great Wall of China, two thousand, the Great Wall of China.","Two thousand, the Great Wall of China two thousand years ago, it's 13,000 miles long, okay years ago, it's 13,000 miles long, okay. Years ago, it's 13,000 miles long, okay? This is serious walls, all right in our - this is serious walls, all right in our - this is serious walls, all right. In our case we need really a thousand miles case.","We need really a thousand miles case. We need really a thousand miles, it's two thousand miles. But summers it's two thousand miles, but summers it's two thousand miles, but summers natural borders, natural barriers which natural borders, natural barriers which natural borders, natural barriers which are pretty good that as good as the wall are pretty good that as good as the wall are pretty Good, that as good as the wall, but you know what, let's use it, right?","So - but you know what, let's use it, right? So - but you know what, let's use it, right? So we're gonna need about a thousand miles. We're gonna need about a thousand miles. We're gonna need about a thousand miles and think of it. So we're at a thousand and think of it. So we're at a thousand and think of it.","So we're at a thousand miles Chinese at 13,000. This was 2,000 miles Chinese at 13,000. This was 2,000 miles Chinese at 13,000. This was 2,000 years ago. They didn't have trucks. They - years ago, they didn't have trucks. They - years ago, they didn't have trucks, they didn't have tractors, they did it.","The didn't have tractors. They did it, the didn't have tractors, they did it the old-fashioned way, right? And they got it old-fashioned way, right? And they got it old-fashioned way, right? And they got it done and it is a big wall. So what we done and it is a big wall. So what we done and it is a big wall.","So what we have is we're gonna build a wall and have is we're gonna build a wall and have is we're gonna build a wall and we're gonna stop people from coming into. We're gonna stop people from coming into - we're gonna stop people from coming into our country illegally, okay? It's time. Our country illegally, okay.","It's time. Our country illegally, okay, it's time. It's time. And if people want to come in, it's time. And if people want to come in, it's time and if people want to come in legally, we want them to come and they legally, we want them to come and they legally, we want them to come and they have to go through the process and if have To go through the process and if have to go through the process and if people wanted to come in now when I people wanted to come in now when I people wanted to come in now, when I first mentioned this, all of the other first mentioned this, All of the other first mentioned this, all of the other candidates, again, we started with 17 now candidates.","Again, we started with 17 now candidates again, we started with 17. Now we're down to 15, but they're gonna start, we're down to 15, but they're gonna start, we're down to 15, but they're gonna start falling like flies you watch. I mean it's falling like flies you watch. I mean it's falling like flies you watch.","I mean it's got ta be at some point, I got ta leave, got ta be at some point, I got ta leave, got ta be at some point I got ta leave right, don't have to leave. I mean don't right, don't have to leave. I mean, don't right, don't have to leave. I mean, don't they sort of have to leave. We got this, they sort of have to leave.","We got this, they sort of have to leave. We got this one guy. He's terrible one guy. He's terrible one guy. He's terrible. He's the worst debater I've ever seen. He's the worst debater I've ever seen. He's the worst debater I've ever seen cases from Ohio. No, no. The guy is the worst debater. He's no, no.","The guy is the worst debater. He's no, no. The guy is the worst debater. He's a professional politician. He can't speak a professional politician. He can't speak a professional politician. He can't speak properly. He's terrible, he's terrible. We properly, he's terrible, he's terrible, we properly, he's terrible, he's terrible.","We have - again, I told you Lindsey Graham so have - again, I told you Lindsey Graham so have - again, I told you Lindsey Graham, so they do a poll and I mean I'm like they do a poll and I mean I'm like they do a poll. And I mean, I'm like killing him in South, how do you beat the killing him in South?","How do you beat the killing him in South? How do you beat the senator in Florida? So in Florida, you senator in Florida, so in Florida, you senator in Florida. So in Florida, you have to - you have a governor and you have have to - you have a governor and you have have to - you have a governor and you have a sitting senator who by the way doesn't a sitting senator who by the way doesn't a sitting Senator who by the way doesn't vote, he isn't vote.","How would you like to vote? He isn't vote. How would you like to vote? He isn't vote. How would you like to be in Florida and you invest in a - be in Florida and you invest in a - be in Florida and you invest in a younger, you invest in him, you you take younger, you invest in him, you you take younger, you invest in Him you - you take him to heart and you put him in his him to heart and you put him in his him to heart and you put him in his United States in.","I mean to me that's a United States in. I mean, to me that's a United States in. I mean to me that's a great - that's a great position, right, great. That's a great position, right, great. That's a great position, right. United States Senator for Florida, he's United States, Senator for Florida, he's United States, Senator for Florida.","He's in there for about 12 seconds and he in there for about 12 seconds and he in there for about 12 seconds. And he decide she wants to run for president, decide she wants to run for president, decide she wants to run for president, why, why, but how would you like to have a why why, but how would you like to have a why why, but how would you Like to have a guy who doesn't show up to vote now guy who doesn't show up to vote now guy who doesn't show up to vote.","Now you've put in a lot of time and effort. You've put in a lot of time and effort. You've put in a lot of time and effort making your choice, making your choice, making your choice. But if a man says he's gonna be your - but if a man says he's gonna be your - but if a man says he's gonna be your senator and then he goes around senator and then he goes around senator and then he goes around campaigning And fundraise, he was the campaigning and fundraise, he was the campaigning and fundraise.","He was the other day Homeland Security, very other day Homeland Security, very other day Homeland Security, very important meeting in Washington. He chose important meeting in Washington. He chose important meeting in Washington. He chose to go to a fundraiser in California now to go to a fundraiser in California now to go to a fundraiser in California.","Now I don't know that I'm gonna win Florida. I don't know that I'm gonna win Florida. I don't know that I'm gonna win Florida, but I am killing them in Florida and I - but I am killing them in Florida and I - but I am killing them in Florida and I think I have the ultimate soundbite. I think I have the ultimate soundbite.","I think I have the ultimate soundbite. I mean, seriously, if a guy, first of all mean, seriously, if a guy, first of all mean, seriously, if a guy, first of all, Rubio is very, very weak on illegal Rubio, is very, very weak on illegal Rubio, is very, very weak on illegal immigration. And he's in favor of amnesty immigration and he's in favor of amnesty immigration and he's in favor of amnesty.","So you can't win Bush just to put an end. So you can't win Bush just to put an end. So you can't win Bush. Just to put an end to that because I don't want to mention to that because I don't want to mention to that because I don't want to mention he's a very nice person low-energy, but he's a very nice person low-energy, but he's a very nice person low-energy.","But very nice, we don't need low-energy, very nice, we don't need low-energy, very nice. We don't need low-energy people, folks. We don't need - we can't people, folks, we don't need - we can't people, folks, we don't need, we can't afford them. Hillary is - I mean, Hillary afford them. Hillary is - I mean, Hillary afford them, Hillary is - I mean, Hillary, you ever see Hillary Hillary and I said you ever see Hillary Hillary and I said you ever see Hillary Hillary and I said she doesn't have the strength.","She - she doesn't have the strength. She - she doesn't have the strength, she doesn't have the stamina, but did you doesn't have the stamina, but did you doesn't have the stamina. But did you ever see, Hillary, she'll do an event like ever see Hillary, she'll do an event like ever see Hillary. She'll do an event like this and then won't show up like four this and then won't show up like four this and then won't show up like four, five you notice.","Yes, she goes home and five you notice, yes, she goes home. And five. You notice, yes, she goes home and sleeps. She'll do an event like this sleeps. She'll do an event like this sleeps. She'll do an event like this, and - and it's actually not - we shouldn't. And - and it's actually not - we shouldn't.","And - and it's actually not - we shouldn't be laughing. We should be crying because be laughing. We should be crying because be laughing. We should be crying because she's by far the front-runner. I mean, she's by far the front-runner. I mean, she's by far the front-runner. I mean, this other guy who's a joke.","He gave it this other guy who's a joke. He gave it this other guy who's a joke. He gave it up when he said no emails, Bernie, up when he said no emails. Bernie up when he said no emails, Bernie, a birdie he a birdie he a birdie he it up. I think he just had a hernia it up. I think he just had a hernia it up.","I think he just had a hernia operation. You know, he was carrying operation, you know, he was carrying operation, you know, he was carrying around the tax code that he wants to around the tax code that he wants to around the tax code that he wants to make larger. Sure. I actually just made make larger sure I actually just made make larger sure, I actually just made that up, but you know he just had a that up, but you know he just had a that up, but you know he just had a hernia operation and so I hope he gets hernia operation and so I hope he gets hernia operation and so I hope he gets better fast, but he's got no chance he better fast, but he's got no chance he better fast.","But he's got no chance he took Hillary and he gave her the took Hillary and he gave her the took Hillary and he gave her the election. He was doing fine and he was election, he was doing fine and he was election, he was doing fine. And he was getting the second largest crowds. I'm getting the second largest crowds.","I'm getting the second largest crowds I'm out by the way my crowds blow everyone out by the way my crowds blow everyone out by the way my crowds blow everyone away. You know, you know what said I was away, you know, you know what said I was away, you know, you know what said I was since I was in Sarasota the other day since I was in Sarasota the other day since I was in Sarasota the other Day Florida and what a great place and we - Florida and what a great place and we - Florida and what a great place and we had a time you wouldn't believe it is 12 had a time, you wouldn't believe it is 12 had a time.","You wouldn't believe it is 12 o'clock football games, everything going o'clock, football games, everything going o'clock, football games, everything going away at 12,000 people. And I don't I away at 12,000 people and I don't I away at 12,000 people and I don't - I don't ever say how many people I let the don't ever say how many people I let the don't ever say how many people I let the government say It now because we have an government say it now because we have an government say it now because we have an amazing Secret Service people.","We have amazing Secret Service people. We have amazing Secret Service people. We have amazing people that work here. I let them amazing people that work here. I let them amazing people that work here. I let them say because every time I say it, if I'm say because every time I say it, if I'm say because every time I say it, if I'm off by 3 people, they make like put off by 3 people.","They make like put off by 3 people they make like put headline and - and we had 12,000 people headline and - and we had 12,000 people headline and - and we had 12,000 people, nobody says that nobody covers that. But nobody says that nobody covers that. But nobody says that nobody covers that, but when Bernie Sanders would have a group when Bernie Sanders would have a group when Bernie Sanders would have a group of like 5,000, 5,000 people, so I get much of like 5,000, 5,000 people.","So I get much of like 5,000, 5,000 people. So I get much bigger things than he does now in the bigger things than he does now in the bigger things than he does. Now. In the meantime, his are going down the tubes we meantime his are going down the tubes we meantime his are going down the tubes, we have to talk about how much anymore, but have to talk about how much anymore, but have to talk about how much anymore.","But the truth is, Hillary shouldn't be. The truth is Hillary shouldn't be. The truth is Hillary shouldn't be allowed to run because what she did is allowed to run because what she did is allowed to run because what she did is illegal. What she did is a - I want her to run, I want her to run and I want her to run.","I want her to run and I want her to run. I want her to run. And by the way, the Fox poll just came out. I - by the way the Fox poll just came out, I - by the way the Fox poll just came out. I beat her easily in the fox ball one. You know, I can't believe it. I had this whole know. I can't believe it. I had this whole know.","I can't believe it, I had this whole thing and I never mentioned post and I thing and I never mentioned post and I thing and I never mentioned post and I can you believe that though. I'm so sad. Can you believe that though? I'm so sad, can you believe that though? I'm so sad, usually I start off by saying and then usually I start off by saying and then usually I start off by saying and then everybody says included the press and my everybody says included the press and my everybody says included the press and my opponents.","He always talks about polls, opponents. He always talks about polls, opponents. He always talks about polls. You know why? Because I'm winning all of you know why? Because I'm winning all of you know why? Because I'm winning all of them. If I were them. Honestly, if you them, if I were them honestly if you them, if I were them honestly, if you think about it, one of the major main think about it.","One of the major main think about it, one of the major main streams asked me that's so long ago, they streams asked me that's so long ago, they streams asked me that's so long ago they said why do you always talk about polls said, why do you Always talk about polls said, why do you always talk about polls?","And I didn't - I never thought of the - and I didn't - I never thought of the - and I didn't - I never thought of the question I said, I don't know because I'm question. I said, I don't know because I'm question I said I don't know because I'm winning. I'm winning every poll. It's good winning. I'm winning every poll.","It's good winning. I'm winning every poll. It's good to talk about him. I don't know what the - to talk about him. I don't know what the - to talk about him, I don't know what the hotel knows what they mean. I think they hotel knows what they mean. I think they hotel knows what they mean. I think they mean something right?","It is sort of mean something right? It is sort of mean something right? It is sort of strange, you know the interview 392 strange, you know the interview 392 strange, you know the interview 392 people and they say with certainty that people and they say with certainty that people and they say with certainty that your plus or minus three.","And it's sort your plus or minus three and it's sort your plus or minus three. And it's sort of an amazing thing. I studied it at of an amazing thing. I studied it at of an amazing thing. I studied it at Wharton. I guess it works cuz, you know, Wharton, I guess it works cuz, you know, Wharton, I guess it works cuz you know, frankly there's something going on, but frankly there's something going on, but frankly there's something going on.","But then when you have many, many, many of then when you have many, many, many of then when you have many, many, many of them, and I'm number one in every single them and I'm number one in every single them. And I'm number one in every single one and number one in every single state one and number one in every single state one and number one in every single state.","And number one, I mean, you look Iowa and number one, I mean, you look Iowa and number one, I mean, you look Iowa, number one, New Hampshire, number one, number one, New Hampshire, number one. Number one, New Hampshire, number one, South Carolina and big, big margin, big South Carolina and big, big margin, big South Carolina and big, big margin, big more.","They got a really work hard to more. They got a really work hard to more. They got a really work hard to catch me in New Hampshire. Let me tell catch me in New Hampshire, let me tell catch me in New Hampshire, let me tell you those people and and the people in you, those people and and the people in you, those people and and the people in our - these are great people.","And then you our - these are great people and then you our - these are great people and then you go down South Carolina, tremendous, every go down, South Carolina, tremendous, every go down, South Carolina, tremendous every and then we go to Nevada, tremendous. And - and then we go to Nevada, tremendous and - and then we go to Nevada, tremendous.","And in Nevada, I win the Hispanic vote, okay. In Nevada, I win the Hispanic vote, okay. In Nevada, I win the Hispanic vote, okay, they do. And I've always said, I'm gonna they do and I've always said I'm gonna they do. And I've always said I'm gonna win this battle because I'm gonna bring - win this battle because I'm gonna bring - win this battle because I'm gonna bring jobs back.","I'm bringing jobs back. I'm jobs back. I'm bringing jobs back. I'm jobs back. I'm bringing jobs back, I'm bringing them back from China and I'm bringing them back from China and I'm bringing them back from China and I'm bringing it back from Japan and I'm bringing it back from Japan and I'm bringing it back from Japan and I'm bringing it Back from Mexico, and I'm bringing it back from Mexico and I'm bringing it back from Mexico and I'm bringing it back from Vietnam, bringing it back from Vietnam, bringing it back from Vietnam and every place we're gonna have jobs and every place we're gonna have Jobs and every place we're gonna have jobs again, we're going to have jobs.","You know, again, we're going to have jobs. You know, again we're going to have jobs, you know the - the number one and I'll probably get the - the number one and I'll probably get the - the number one and I'll probably get it tonight, so I can maybe just avoid it tonight. So I can maybe just avoid it tonight, so I can maybe just avoid this question, but the number one this question but the number one this question.","But the number one question I get, I go around, I see a lot question I get I go around. I see a lot question I get I go around, I see a lot of different places. I use a lot of of different places. I use a lot of of different places. I use a lot of college auditoriums and all because the college auditoriums and all because the college auditoriums and all because the crowd sizes and a lot of students come crowd sizes and a lot of students come crowd sizes and a lot of students come up.","Mr. Trump, what can you do to help us up mr. Trump, what can you do to help us up mr. Trump? What can you do to help us? We're choking there, choking with that, we're choking there, choking with that, we're choking there, choking with that. And the biggest thing they're choking and the biggest thing they're choking and the biggest thing they're choking with, they then go for two years or four with they then go for two years or four with they then go for two years or four years to college.","And they can't get a years to college and they can't get a years to college and they can't get a job when they get out. And they're good job when they get out and they're good job when they get out and they're good students at good colleges. And they can't students at good colleges and they can't students at good colleges and they can't get a job.","It's one of the most heart, get a job. It's one of the most heart, get a job. It's one of the most heart wrenching questions again. And you see wrenching questions again and you see wrenching questions again and you see these students and they're borrowing these students and they're borrowing these students and they're borrowing money from an, you know, to a large extent, money from an, you know, to a large extent, money From an, you know, to a large extent from the federal government with it's from the federal government with it's from the federal government with - it's the only thing, it's just about the only - the only thing it's just about the only - the only thing it's just about the Only thing the federal government makes money thing, the federal government makes money thing.","The federal government makes money with his student loans, maybe that's the - with his student loans, maybe that's the - with his student loans, maybe that's the only thing. It shouldn't be making money. Only thing. It shouldn't be making money, only thing. It shouldn't be making money with, you know, if you think about it with, you know, if you think about it with, you know, if you think about it, but we're gonna do something with it and but we're gonna do something with it and but we're Gon na do something with it and you know, I don't know what's going on.","You know, I don't know what's going on. You know, I don't know what's going on with the colleges, but those colleges with the colleges, but those colleges with the colleges. But those colleges, they're going up like a skyrocket you. They're going up like a skyrocket you. They're going up like a skyrocket.","You know, things are sort of even nobody's know things are sort of even nobody's know things are sort of even nobody's going up at the colleges. So somebody's going up at the colleges. So somebody's going up at the colleges. So somebody's doing something wrong with their time doing something wrong with their time doing something wrong with their time.","And one of the reasons the colleges go and one of the reasons the colleges go. And one of the reasons the colleges go up is because the federal government up is because the federal government up is because the federal government pays for the students. But the students pays for the students, but the students pays for the students, but the students can't afford to pay that much and we got - can't afford to pay that much and we got - can't afford to pay that much.","And we got to look a little bit into the college's to look a little bit into the college's to look a little bit into the college's. Why are they going up more than anything? Why are they going up more than anything? Why are they going up more than anything else? They must be making a fortune else. They must be making a fortune else.","They must be making a fortune. Let's buy a college, you want to buy a - let's buy a college, you want to buy a let's buy a college, you want to buy a college, don't buy, don't buy but but college don't buy, don't buy but but college don't buy, don't buy but but there Is something going on, but one of there is something going on, but one of there is something going on.","But one of the saddest things is when you see these - the saddest things is when you see these - the saddest things is when you see these students and the worst is they're really students. And the worst is they're really students. And the worst is they're really good. And I mean, I've met so many of them good and I mean, I've met so many of them good.","And I mean, I've met so many of them and I feel so badly for them. But it - and I feel so badly for them. But it - and I feel so badly for them, but it gives me more inspiration because I'm gives me more inspiration because I'm gives me more inspiration because I'm gonna create the jobs, they can't get a gonna create the jobs, they can't get a gonna Create the jobs, they can't get a job when they graduate, they can't get job when they graduate, they can't get job.","When they graduate, they can't get jobs and we're gonna change that around jobs and we're gonna change that around jobs. And we're gonna change that around when they go through college and they do when they go through college and they do when they go through college and they do a good job and especially for the good - a good job and especially for the good - a good Job and especially for the good students, you know, you have students that students, you know, you have students that students, you know you have students that work really hard to be good students and work really hard to be good students and work really hard to be good Students and then they can't - they come out, they come, then they can't, they come out, they come, then they can't, they come out, they come out and they can't find anything they out and they can't find anything they out and they can't find anything.","They don't know what to do and then they owe - don't know what to do and then they owe, don't know what to do. And then they owe money to the federal government than to money to the federal government than to money to the federal government than to everybody else. And they've done everybody else and they've done everybody else and they've done everything they can to get through that.","Everything they can to get through that, everything they can to get through that college. We're gonna - we're gonna start college, we're gonna, we're gonna start college, we're gonna, we're gonna start winning in this country and we're gonna winning in this country and we're gonna winning in this country and we're gonna start start Start helping them now we got ta help them out, helping them now we got ta help them out, helping them.","Now we got ta help them out. You know, I always talk about the vets, you know, I always talk about the vets. You know, I always talk about the vets and everybody knows I have a great vet and everybody knows I have a great vet and everybody knows I have a great vet plan. Nobody treated worse than the vets plan.","Nobody treated worse than the vets plan. Nobody treated worse than the vets. Illegal immigrants are treated better, illegal immigrants are treated better, illegal immigrants are treated better than our vets. I'm telling you, no. It's than our vets. I'm telling you, no, it's than our vets, I'm telling you, no, it's - it's - they're being treated better than it's - they're being treated better than it's - they're being treated better than our vets and that's gonna end.","We're our vets and that's gonna end. We're our vets and that's gonna end. We're gonna treat our vets, we're gonna treat gonna treat our vets, we're gonna treat gonna treat our vets, we're gonna treat on that square and I put it in a policy on that square. And I put it in a policy on that square and I put it in a policy plan a couple of weeks ago.","I was on a plan a couple of weeks ago. I was on a plan a couple of weeks ago. I was on a great, great ship and we would - it was an great, great ship and we would - it was an great, great ship and we would - it was an amazing day on the Wisconsin and we put amazing day on the Wisconsin and we put amazing day On the Wisconsin and we put on the battleship, I say, can we use this on the battleship, I say, can we use this on the battleship?","I say, can we use this? Look at the ship, you can't build them. Look at the ship, you can't build them, look at the ship, you can't build them like this anymore. They sort of didn't like this anymore. They sort of didn't like this anymore. They sort of didn't give me the answer because that looks, give me the answer because that looks, give me the answer because that looks like an awfully, I love renovating you like an awfully, I love renovating you like an awfully, I love renovating, you know, I love Buying a building, the know I love buying a building, the know I love buying a building, the foundations, are there, the structures, foundations, are there, the structures, foundations, are there the structures there, the outside is there have to there the outside?","Is there have to - there the outside is there have to replace Windows? Sometimes if you can replace Windows, sometimes if you can replace Windows, sometimes if you can keep them, you keep them like I'm doing, keep them, you keep them like I'm doing, keep them, you keep them like I'm doing the old post office in Washington way the old Post office in Washington way the old post office in Washington way.","Yeah, you know, yeah, that's right. You - yeah, you know, yeah, that's right. You - yeah, you know, yeah, that's right. You people would know it. One of the most people would know it, one of the most people would know it. One of the most beautiful buildings in Washington was a beautiful buildings in Washington was a beautiful buildings in Washington was a disaster for 30 years, put it out to bid disaster for 30 years, put it out to bid disaster for 30 years, put it out to bid.","Think of it in the Obama administration, think of it in the Obama administration, think of it in the Obama administration, Trump got it, can am ia good deal maker, Trump got it, can am ia good deal maker Trump got it, can am ia good deal maker? Okay. One of the most sought-after, okay, one of the most sought-after, okay, one of the most sought-after properties in the history of the properties in the history of the properties in the history of the government services, you know, GSA and government services, you know, GSA and government services.","You know GSA and we're now under budget and ahead of we're now under budget and ahead of we're now under budget and ahead of schedule. Think of that that's what you schedule think of that. That's what you schedule think of that, that's what you want in the country. That's what you want want in the country.","That's what you want want in the country. That's what you want in the country and it's gonna be one of in the country and it's gonna be one of in the country and it's gonna be one of the best hotels anywhere in the world, the best hotels anywhere in the world. The best hotels anywhere in the world, the the open, we're calling it, if you the the open, we're calling it, if you the the open, we're calling it, if you don't mind, Trump International, I didn't - don't mind Trump International, I didn't - don't mind Trump International, I didn't Want to keep it, the OPA somebody said, want to keep it.","The OPA somebody said, want to keep it. The OPA, somebody said well, we have to keep the name the well, we have to keep the name the well. We have to keep the name. The government, they were saying we have to government, they were saying we have to government, they were saying we have to keep the name of the old post offices, keep the name of the old post offices, keep the name of the old post offices.","But it's not a post office Hotel we have, but it's not a post office Hotel we have, but it's not a post office Hotel. We have to change it. But I will tell you and to change it, but I will tell you and to change it. But I will tell you and I've dealt with the GSA and they're - I've dealt with the GSA and they're - I've dealt with the GSA and they're really terrific people that you really, really terrific people that you really, really terrific people that you really have some - you know, You have some great - have some, you know, you have some great have some, you know, you have some great people in government.","You really do. If we people in government, you really do. If we people in government, you really do, if we can be led properly, this country is can be led properly. This country is can be led properly. This country is gonna go to a level that you won't even gonna go to a level that you won't even gonna go to a level that you won't even believe.","You know, I've been saying over believe. You know, I've been saying over believe, you know, I've been saying over the last two months because I've met so the last two months because I've met so the last two months because I've met so many people like yourselves and it's many people like yourselves. And it's many people like yourselves and it's really similar.","There's so much love in really similar. There's so much love in really similar. There's so much love in the room, but I've met so many people and the room. But I've met so many people and the room. But I've met so many people and I've seen the - the genius, I've seen the - the genius, I've seen the - the genius of these people and I've been saying of these people and I've been saying of these people and I've been saying we're not only gonna make Our country, we're not only gonna make our country, we're not only gonna make our country great.","Again, we're gonna make it in my great. Again, we're gonna make it in my great. Again, we're gonna make it in my opinion, opinion, opinion. I really think we have the potential do I really think we have the potential? Do I really think we have the potential do it greater than ever before. I really it greater than ever before.","I really it greater than ever before. I really believe it and we'll make it great and believe it and we'll make it great and believe it and we'll make it great and we'll build it up and we'll make it rich, we'll build it up and we'll make it rich, we'll build it up and We'll make it rich again, here's somebody, a woman came up to again, here's somebody, a woman came up to again, here's somebody, a woman came up to me, said mr.","Trump, that's a little crass me said. Mr. Trump, that's a little crass me said. Mr. Trump, that's a little crass to say, rich, I got ta make it rich. We're a to say, rich, I got ta make it rich. We're a to say, rich, I got ta make it rich. We're a debtor nation right now. Debtor nation right now debtor nation right now, she said I'm voting for you.","Mr. Trump, I - she said I'm voting for you. Mr. Trump, I - she said I'm voting for you. Mr. Trump, I love you, I love you, but please don't say love you, I love you. But please don't say love you, I love you, but please don't say we're gonna make it rich. Mr. Trump, it's - we're gonna make it rich. Mr.","Trump, it's - we're gonna make it rich. Mr. Trump, it's Chris. I said I have to say it, I have to - Chris, I said I have to say it, I have to Chris, I said I have to say it. I have to be truthful. We're gonna save Social, be truthful, we're gonna save Social, be truthful. We're gonna save Social Security, we're not gonna cut Social Security.","We're not gonna cut Social Security. We're not gonna cut Social Security. We're not gonna cut Medicare Security. We're not gonna cut Medicare Security. We're not gonna cut Medicare. You know, Carson wants to cut Medicare. He, you know, Carson wants to cut Medicare. He, you know, Carson wants to cut Medicare, he wants to get rid of Medicare Z, you know, wants to get rid of Medicare Z, you know wants to get rid of Medicare Z. You know it's actually a program that works great.","It's actually a program that works great. It's actually a program that works great. Now you have waste fraud, abuse in Social, now you have waste fraud, abuse in Social. Now you have waste fraud, abuse in Social Security and Medicare will take care of Security and Medicare will take care of Security and Medicare will take care of that will have property.","But you're not - that will have property, but you're not - that will have property but you're not gonna be cut, you've been paying into gonna be cut, you've been paying into gonna be cut, you've been paying into your plans, you've been paying into your plans. You've been paying into your plans. You've been paying into Social Security for years now.","They're Social Security for years now. They're Social Security for years now they're coming up to you. It's getting to be that coming up to you. It's getting to be that coming up to you. It's getting to be that time me. I don't want this Social time me. I don't want this Social time me. I don't want this Social Security, okay, but it's getting to be Security, okay, but it's getting to be Security, okay.","But it's getting to be that time where you're gonna need it and that time where you're gonna need it and that time where you're gonna need it. And I think it's unfair after all these, I think it's unfair after all these. I think it's unfair after all these years, they want to cut you years. They want to cut you years.","They want to cut you. Governor Christie wants to wants to Governor Christie wants to wants to Governor Christie wants to wants to raise the age so that you have to wait, raise the age so that you have to wait, raise the age so that you have to wait another, you know, pretty Extended period another, you know, pretty extended period another you know, pretty extended period of time.","It's not fair. You've been - you've of time, it's not fair. You've been - you've of time, it's not fair. You've been - you've been paying in for use, we're gonna take been paying in for use. We're gonna take been paying in for use. We're gonna take money back from all these countries that money back from all these countries that money back from all these countries that have been just absolutely eating our - have been just absolutely eating our - have been just absolutely eating our lunch.","We're gonna have so much money, so lunch we're gonna have so much money. So lunch we're gonna have so much money. So I said to the woman I said, you know what I said to the woman I said, you know what I said to the woman I said you know what, it may be Chris, but I have no choice. It may be Chris, but I have no choice.","It may be Chris, but I have no choice. We're gonna be so rich and we're gonna, we're gonna be so rich and we're gonna, we're gonna be so rich and we're gonna what we're going to do and you're - what we're going to do and you're - what we're going to do. And you're talking about tremendous money, don't talking about tremendous money, don't talking about tremendous money.","Don't forget when a China - when you have forget when a China - when you have forget when a China - when you have imbalances of four hundred, four hundred imbalances of four hundred, four hundred imbalances of four hundred, four hundred and fifty billion billion not million and fifty billion Billion not million and fifty billion billion not million for 450 million wouldn't be good, right for 450 million wouldn't be good, right for 450 million wouldn't be good, right, how about four hundred and fifty billion, how about four hundred and fifty billion, how about four hundred.","And fifty billion a year, a year and then they say, oh, a year a year and then they say, oh, a year a year and then they say, oh, that's terrible, that's terrible, that's terrible. I am a free trader, I believe in free. I am a free trader, I believe in free. I am a free trader, I believe in free trip. It has to be smart trade.","We can't trip. It has to be smart trade. We can't trip. It has to be smart trade. We can't be stupid people, right. So they said all be stupid people, right? So they said all be stupid people, right? So they said all Trump isn't a free trader. He's not all. Trump isn't a free trader, he's not all. Trump isn't a free trader, he's not all is terrible.","I said no, no, I'm a free is terrible. I said no, no, I'm a free is terrible. I said no, no, I'm a free trader, but one for years. We have a trade trader, but one for years we have a trade trader, but one for years. We have a trade imbalance with China of over 400 billion imbalance with China of over 400 billion imbalance with China of over 400 billion every year, every year, every year that's called dumb trade, that's not that that's called dumb trade.","That's not that that's called dumb trade. That's not that we have to be and then the head of China we have to be and then the head of China we have to be and then the head of China comes and poor Obama. So said he greets comes and poor Obama. So said he greets comes and poor Obama so said he greets him with a state dinner, I state for what him with a state dinner.","I state for what him with a state dinner. I state for what and he talks about our partner. Well, I - and he talks about our partner well, I - and he talks about our partner. Well, I want to be a partner too, if I can be a - want to be a partner too, if I can be a - want to be a partner too. If I can be a partner where I'm making four hundred to partner where I'm making four hundred to partner where I'm making four hundred to four hundred and fifty billion dollars I four hundred and fifty billion dollars I four hundred and fifty billion dollars.","I agree, agree, agree and the guy in China, they had been a - and the guy in China, they had been a - and the guy in China, they had been a good looking guy strong as hell in a good looking guy, strong as hell in a good looking Guy strong as hell in a different system over there that's like different system over there that's like different system over there.","That's like one of these system. You keep counting one of these system. You keep counting one of these system, you keep counting each other and the toughest smartest guy, each other and the toughest smartest guy each other and the toughest, smartest guy gets up to the top. We don't do that over, gets up to the top.","We don't do that over - gets up to the top. We don't do that over here here here. That's assist. I mean, I don't know if you - that's assist. I mean, I don't know if you - that's assist. I mean I don't know if you know how it works from the time they're know how it works from the time they're know how it works from the time they're in kindergarten, the smartest, the in kindergarten, the smartest, the in kindergarten, the smartest, the toughest, the smartest.","The toughest but toughest the smartest, the toughest, but toughest the smartest, the toughest. But by the time they get up to that little by the time they get up to that little by the time they get up to that little point that guy is tough. So he's looking point that guy is tough, so he's looking point that guy is tough.","So he's looking at Obama talking about this wonderful at Obama talking about this wonderful at Obama talking about this wonderful relationship we have, he's building relationship, we have, he's building relationship. We have - he's building Islands, military islands in the South Islands, military islands in the South Islands, military islands in the South China Sea.","I don't think he got an China Sea. I don't think he got an China Sea. I don't think he got an environmental impact statement. Do you do environmental impact statement? Do you do environmental impact statement? Do you - do you think they went out and said, oh, we you think they went out and said, oh, we you think they went out and said oh, we have to do.","Our environmental impact said, have to do our environmental impact said, have to do our environmental impact said no, they just put about 300 excavators. No, they just put about 300 excavators. No, they just put about 300 excavators out there and they started digging that out there. And they started digging that out there and they started digging that ocean and drop in that sand now and by ocean and drop in that sand now and by ocean and drop in that sand now.","And by the way, I heard this the other day and I the way I heard this the other day and I the way I heard this the other day and I don't choose two things I've been saying don't choose. Two things I've been saying don't choose. Two things I've been saying bombed the oil and keep it now I didn't bombed the oil and keep it now I didn't bombed the oil and keep it.","Now I didn't want to go into Iraq. I should get credit want to go into Iraq. I should get credit want to go into Iraq. I should get credit for vision and I'm more militaristic for vision and I'm more militaristic for vision and I'm more militaristic than anybody other than him anybody in than anybody other than him anybody in than anybody other than him anybody in this room.","Now this guy looks like a this room now this guy looks like a this room now this guy looks like a seriously, he looks like a warrior. But seriously he looks like a warrior. But seriously he looks like a warrior, but I'm more militaristic than anybody in. I'm more militaristic than anybody in - I'm more militaristic than anybody in this room, but I want to build that this room.","But I want to build that this room. But I want to build that military so strong. But I've been saying military so strong, but I've been saying military so strong, but I've been saying don't go into Iraq and in 2003 or for a don't go into Iraq and in 2003 or for a don't go into Iraq and in 2003 or for a delegation Came from the White House delegation came from the White House delegation came from the White House because they get a lot of publicity for because they get a lot of publicity for because they get a lot of publicity for whatever even as a developer.","Then I do. Whatever, even as a developer, then I do whatever, even as a developer, then I do the apprentice, that was a huge hit by the apprentice. That was a huge hit by the apprentice. That was a huge hit. By the way, they wanted to extend me. They - the way they wanted to extend me, they the way they wanted to extend me.","They came in. Steve Burke, the head of Comcast came in Steve Burke, the head of Comcast, came in Steve Burke, the head of Comcast. An incredible guy came to my office with an incredible guy, came to my office with an incredible guy, came to my office with executives from NBC executives, from NBC executives, from NBC and they want to extend me.","I said Steve and they want to extend me. I said Steve and they want to extend me, I said Steve, I want to run for president. He said no, I want to run for president. He said no, I want to run for president. He said no, no, we want to extend you and nobody. No, we want to extend you and nobody, no, we want to extend you and nobody thought.","I was gonna run. Nobody he said thought I was gonna run. Nobody he said thought I was gonna run, nobody, he said no, no. And they announced they're going no, no, and they announced they're going no, no. And they announced they're going to extend the apprentice with me and to extend the apprentice with me and to extend the apprentice with me.","And that would be season 15 and 16. I mean that would be season 15 and 16, I mean that would be season 15 and 16. I mean, you know it's been a great hit and I, you know it's been a great hit and I, you know it's been a great hit and I said no, I don't want to do that. And I said, no, I don't want to do that.","And I said, no, I don't want to do that and I just held my breath, you know the famous just held my breath, you know the famous just held my breath, you know the famous escalator scene, right. I held my breath I escalator scene right. I held my breath, I escalator scene right. I held my breath. I said to my wife, ha, are you sure I want said to my wife ha, are you sure I want said to my wife ha, are you sure I want to be doing this.","And I said, let's go and to be doing this and I said let's go and to be doing this and I said let's go and we went down that escalator and we stood - we went down that escalator and we stood - we went down that escalator and we Stood you never saw it looked like the Academy, you never saw it looked like the Academy, you never saw it looked like the Academy Awards, the press, the press, I mean even Awards, the press, the press - I mean even Awards the press, the press.","I mean, even now look, look at tonight, it's - it's so now look, look at tonight, it's - it's so now look, look at tonight, it's - it's so many cameras back there. The other thing many cameras back there, the other thing many cameras back there. The other thing I look at all those red lights, every I look at all those red lights, every I look at all those red lights, every word, every word, no.","Think of it every word, every word, no. Think of it every word, every word. No. Think of it every word, but you know it's - it's an amazing word, but you know it's - it's an amazing word, but you know it's - it's an amazing things I said to my wife come on. Let's things I said to my wife come on. Let's things I said to my wife come on, let's go and she way beautifully, you know in go and she way beautifully, you know in go and she way beautifully.","You know in the Escalade I was waving and then I - the Escalade I was waving and then I - the Escalade I was waving and then I went up, I talked about illegal went up, I talked about illegal went up, I talked about illegal immigration and little. Did I know I was immigration and little, did I know I was immigration and little did I know I was hitting a nerve that was so incredible hitting a nerve that was so incredible hitting a nerve that was so incredible.","And I'm telling you, had I not made that and I'm telling you, had I not made that and I'm telling you, had I not made that speech and I not talk about what's speech and I not talk about what's speech and I not talk about what's happening Cuz after that you had Jamil happening cuz after that you had Jamil happening cuz.","After that you had Jamil killed, which he was this wonderful man killed, which he was this wonderful man killed, which he was this wonderful man. You saw his father probably over the - you saw his father probably over the - you saw his father probably over the last couple of days on television last couple of days on television last couple of days on television.","Viciously shot for no reason whatsoever viciously shot for no reason whatsoever. Viciously shot for no reason whatsoever, right off the sidewalk shot and then you right off the sidewalk shot and then you right off the sidewalk shot. And then you see Kate in San Francisco shot by an see, Kate in San Francisco shot by an see, Kate in San Francisco shot by an illegal immigrant.","And you see all of the illegal immigrant and you see all of the illegal immigrant. And you see all of the tremendous crime and all of a sudden tremendous crime and all of a sudden tremendous crime and all of a sudden people stopping. Did I take abuse, rush, people stopping? Did I take abuse, rush, people stopping?","Did I take abuse rush? Limbaugh said nobody's ever taken more limbaugh said nobody's ever taken more limbaugh said nobody's ever taken more incoming than Trump. I was saying if this incoming than Trump, I was saying if this incoming than Trump, I was saying if this is gonna be like this, I don't know if I is gonna be like this.","I don't know if I is gonna be like this. I don't know if I can last for a year and a half, this is a can last for a year and a half. This is a can last for a year and a half. This is a lot of incoming. I never heard that term lot of incoming. I never heard that term lot of incoming, I never heard that term with respect to the press or the PR, but with respect to the press or the PR. But with respect to the press or the PR, but Rush Limbaugh said, I've never seen a man Rush.","Limbaugh said I've never seen a man Rush. Limbaugh said I've never seen a man take incoming like that and then he has take incoming like that. And then he has take incoming like that and then he has a news conference and he doubles down a news conference and he doubles down a news conference and he doubles down.","And he said I'm right about it. I've said and he said I'm right about it. I've said and he said I'm right about it, I've said of somebody else now it's sort of strength because I know now it's sort of strength because I know now it's sort of strength because I know how it works. You got to be smart, you got how it works, you got to be smart, you got how it works.","You got to be smart, you got to be tough, somebody else would have to be tough, somebody else would have to be tough. Somebody else would have gone up and other people have sentence gone up and other people have sentence gone up and other people have sentence. I'd like to apologize. Is there any way I - I'd like to apologize, is there any way I - I'd like to apologize, is there any way I can apologize to the people for them, you can apologize to the people for them.","You can apologize to the people for them. You can't do that when you're right, you're can't do that when you're right, you're can't do that when you're right, you're right, you're right, you got to stick with right? You're right, you got to stick with right? You're right, you got to stick with it. But I said, I - I said at this level of it, but I said I - I said at this level of it, but I said I - I said at this level of intensity, there's no way any human being intensity.","There's no way any human being intensity. There's no way any human being - can make it for a year, but all of a can make it for a year, but all of a can make it for a year. But all of a sudden people started seeing - I was right sudden people started seeing, I was right sudden people started seeing, I was right and if I didn't bring that up, but if I - and if I didn't bring that up, but if I - and if I didn't Bring that up, but if I didn't take all of that, unbelievable didn't take all of that.","Unbelievable didn't take all of that unbelievable harsh and unfair punishment from the harsh and unfair punishment from the harsh and unfair punishment from the mainstream media, mainstream media mainstream media. I'll tell you what we would make me. I'll tell you what we would make me. I'll tell you what we would make me talking about illegal immigration.","We talking about illegal immigration. We talking about illegal immigration. We wouldn't be talking about the crime and wouldn't be talking about the crime and wouldn't be talking about the crime. And don't kid yourself, I don't mention it, don't kid yourself. I don't mention it, don't kid yourself. I don't mention it that often because I'm really good at that often because I'm really good at that often because I'm really good at this stuff.","But the jobs that are being this stuff, but the jobs that are being this stuff, but the jobs that are being taken away from people that are in our - taken away from people that are in our - taken away from people that are in our country, we're losing Tremendous numbers country, we're losing tremendous numbers country we're losing tremendous numbers of jobs.","So we're gonna change that whole of jobs. So we're gonna change that whole of jobs. So we're gonna change that whole system. It's gonna be changed. Remember system, it's gonna be changed. Remember system it's gonna be changed. Remember this, you know, you have to get points for this, you know, you have to get points for this.","You know, you have to get points for vision when you elect somebody and I vision when you elect somebody and I vision when you elect somebody and I think I have everybody in this room. I'm think I have everybody in this room. I'm think I have everybody in this room. I'm pretty sure do I have everybody, I think pretty sure do I have everybody?","I think pretty sure do I have everybody I think so. I mean, you know I leave these places. So I mean, you know, I leave these places. So I mean you know I leave these places and they say, well they're there because - and they say well they're there because - and they say, well they're there because he's a great entertainer.","I'm not here to - he's a great entertainer. I'm not here to - he's a great entertainer. I'm not here to entertain folks. I'm not an entertainer entertain folks. I'm not an entertainer entertain folks. I'm not an entertainer - I'm not an entertainer, but a lot of - I'm not an entertainer but a lot of - I'm not an entertainer but a lot of thing.","You know outreach, sir is like the thing you know outreach, sir is like the thing you know outreach, sir. Is like the people in the room are there because he people in the room are there because he people in the room are there because he is a wonderful show and a wonderful is a wonderful show and a wonderful is a wonderful show and a wonderful entertainer And that's not the reason entertainer and that's not the reason entertainer and that's not the reason you here.","Yeah, here to vote. Please don't you here. Yeah, here to vote. Please don't you here. Yeah, here to vote. Please don't - don't waste my time with the don't waste. My time with the don't waste my time with the entertainment stuff, okay? I'm not an entertainment stuff, okay. I'm not an entertainment stuff, okay.","I'm not an entertainer - believe me, I'm somebody that entertainer, believe me, I'm somebody that entertainer, believe me, I'm somebody that knows how to get things done. I'm a guy knows how to get things done. I'm a guy knows how to get things done. I'm a guy that's won all my life, whether it's The - that's won all my life, whether it's The - that's won all my life, whether it's The Apprentice or whether it's business or Apprentice or whether it's business or Apprentice or whether it's business or whether it's the art Of the deal, what - whether it's the art of the deal, what - whether it's the art of the deal, what are the most incredible one of the - are the most incredible one of the - are the most incredible one of the biggest selling business books of all biggest selling Business books of all biggest selling business books of all time, I think the biggest, but I want to time I think the biggest, but I want to time I think the biggest, but I want to say one of the good - if it's three short, say, one of The good - if it's three short, say one of the good, if it's three short, I'll get killed if I say thee, but I - I'll get killed if I say thee, but I - I'll get killed if I say thee, but I think it is the biggest selling business.","Think it is the biggest selling business, think it is the biggest selling business book. I mean that's what I do. We got a book, I mean that's what I do. We got a book, I mean that's what I do. We got a win, we can win together. One of the win we can win together, one of the win we can win together. One of the things vision I've been saying right, things vision, I've been saying right, things vision, I've been saying right.","Thank you. I'll take the oil, take the oil. Thank you. I'll take the oil, take the oil, thank you. I'll take the oil, take the oil, we shouldn't have been there. Iraq, Iran, we shouldn't have been there. Iraq, Iran, we shouldn't have been there. Iraq, Iran fighting, fighting, fighting their whole fighting, fighting, fighting their whole fighting, fighting fighting their whole lives.","Everyone there was tight lives. Everyone, there was tight lives. Everyone there was tight, they love to fight. We want to rebuild, they love to fight, we want to rebuild, they love to fight. We want to rebuild our country right fight, fight, fight our country right fight, fight, fight our country right fight fight, fight.","We built a gas station, did you see the - we built a gas station, did you see the - we built a gas station, did you see the care station costs, 43 million dollars, care station costs, 43 million dollars, care station costs, 43 million dollars and then it didn't Work, okay, okay. And then it didn't work.","Okay, okay. And then it didn't work. Okay, okay. And yet if we want to spend $ 2 in this and yet if we want to spend $ 2 in this and yet if we want to spend $ 2 in this country, we don't have any money. If we country we don't have any money. If we country we don't have any money if we want to build a school for his children, want to build a school for his children, want to build a school for his children.","We don't have any money if we want to. We don't have any money. If we want to, we don't have any money if we want to fix up our roads that decrepit our fix up our roads that decrepit our fix up our roads that decrepit our bridges are falling down in China, bridges are falling down in China, bridges are falling Down in China, they're building bridges all over the - they're building bridges all over the - they're building bridges all over the place, okay?","So I said take the oil and place, okay. So I said take the oil and place, okay. So I said take the oil and keep it, we shouldn't have been in Iraq, keep it. We shouldn't have been in Iraq, keep it. We shouldn't have been in Iraq, but take the oil because you."],"text":" Thank you very much. So nice so amazing. Thank you very much. So nice so amazing, thank you very much. So nice so amazing, so amazing it is so great to be with you. So amazing it is so great to be with you. So amazing it is so great to be with you tonight and this was a little - this was a tonight and this was a little - this was a tonight and this was a little - this was a little tough weather, so a couple of little tough weather. So a couple of little tough weather, so a couple of hours ago, they said mr. Trump, I think hours ago, they said mr. Trump, I think hours ago, they said mr. Trump, I think wicked what? That's okay. We - I love you wicked what that's okay. We - I love you wicked what that's okay. We - I love you more, okay. Like I say to my son Barron I more okay, like I say to my son Barron I more okay, like I say to my son Barron, I love you because I love you more dead. So love you because I love you more dead. So love you because I love you more dead. So anyway I love it. I do love you that the - anyway I love it. I do love you that the - anyway I love it. I do love you that the spirit in these rooms, the spirit, no spirit in these rooms, the spirit, no spirit in these rooms, the spirit no matter where we go is so is so matter where we go is so is so matter where we go is so Is so incredible and I, you know, a couple of incredible and I, you know, a couple of incredible and I, you know, a couple of hours ago they were saying - I'm sorry, sir, hours ago they were saying - I'm sorry, sir, hours ago they were saying, I'm sorry, Sir, you're gonna have to cancel your trip, you're gonna have to cancel your trip, you're gonna have to cancel your trip. Can you imagine? They said it's gonna be, can you imagine they said it's gonna be. Can you imagine they said it's gonna be too tough and too tough, the flying's too tough and too tough. The flying's too tough and too tough. The flying's dangerous. It's really - it's not exactly dangerous, it's really - it's not exactly dangerous, it's really - it's not exactly nice outside, right? I said I can't do nice outside, right? I said I can't do nice outside, right? I said I can't do that. No, I can't do that that no, I can't do that that no, I can't do that. I can't do it. Oh, we got - I can't do it. Oh, we got - I can't do it. Oh, we got those closest. It was marginal. I have to those closest. It was marginal, I have to those closest, it was marginal, I have to tell you, but we got here. So you know in tell you, but we got here. So you know in tell you, but we got here. So you know in - as you probably heard in California, as you probably heard in California, as you probably heard in California, they're having a tremendous problem. They're having a tremendous problem. They're having a tremendous problem right now. Two are killed as of now. And I right now two are killed as of now and I right now two are killed as of now. And I guess there's one that's on the loose or guess there's one that's on the loose or guess there's one that's on the loose or they're having a fight. This is when we - they're having a fight. This is when we - they're having a fight. This is when we appreciate our great police and our law appreciate our great police and our law appreciate our great police and our law enforcement. They don't get enough credit enforcement, they don't get enough credit enforcement, they don't get enough credit, they should get it. And you're always - they should get it and you're always - they should get it. And you're always gonna have some bad apples, you see it on gonna have some bad apples, you see it on gonna have some bad apples, you see it on television. No matter what business were television, no matter what business were television, no matter what business were in, if you're in the banking or anything in if you're in the banking or anything in if you're in the banking or anything else. But I want to tell you they do one else, but I want to tell you they do one else. But I want to tell you they do one hell of a job. And when you see these hell of a job and when you see these hell of a job and when you see these shootouts, when you see these shootouts, I shootouts when you see these shootouts, I shootouts when you see these shootouts, I can tell you one thing I don't want to can tell you one thing, I don't want to can tell you one thing, I don't want to do it. You don't want to do it do it. You don't want to do it, do it, you don't want to do it. So we want to thank the police and law, so we want to thank the police and law. So we want to thank the police and law enforcement. They're unbelievable people enforcement, they're unbelievable people enforcement, they're unbelievable people. And with that being said, I think could - and with that being said, I think could - and with that being said, I think could we have a moment of silence? A lot of - we have a moment of silence. A lot of - we have a moment of silence, a lot of people killed and in honor of those people killed and in honor of those people killed. And in honor of those people and the victims generally, let's people and the victims generally, let's people and the victims generally. Let's have a moment of silence. Please. Okay, have a moment of silence, please. Okay, have a moment of silence, please. Okay, thank you. Thank you. Thank you. Thank you. So we have some really special people. So we have some really special people. So we have some really special people here. The most powerful people there are here. The most powerful people there are here, the most powerful people there are black pastors. You've been hearing a lot black pastors, you've been hearing a lot black pastors, you've been hearing a lot about it and we had some incredible about it and we had some incredible about it. And we had some incredible times who over the last few days and times who over the last few days and times who over the last few days and we've had great support. It wasn't - we've had great support. It wasn't - we've had great support. It wasn't covered properly by the press, never does covered properly by the press. Never does covered properly by the press. Never does cover. I mean they are so dishonest, oh, cover, I mean they are so dishonest, oh, cover, I mean they are so dishonest, oh yeah, yeah. But you probably read where a - yeah, yeah, but you probably read where a - yeah, yeah, but you probably read where a large - I don't even know the number, but a large - I don't even know the number, but a large - I don't even know the number, but a Large group of black pastors came to see large group of black pastors came to see large group of black pastors came to see me in New York and Manhattan. And it was me in New York and Manhattan and it was me in New York and Manhattan. And it was really great and one of them was doctor really great and one of them was doctor really great and one of them was doctor and pastor, Steve parson and Steve put and pastor, Steve parson and Steve put and pastor, Steve parson and Steve put together A group of endorsers all together, a group of endorsers all together, a group of endorsers all endorsers and I said, well, you're endorsers and I said, well, you're endorsers and I said, well, you're endorsing me, I'm bringing you up for a endorsing me. I'm bringing you up for a endorsing me, I'm bringing you up for a couple of seconds. I'm gonna say I don't - couple of seconds, I'm gonna say I don't couple of seconds, I'm gonna say, I don't know if these people want to be preached know if these people want to be preached know if these people want to be preached suit Tonight, we want to hear about other suit tonight. We want to hear about other suit tonight. We want to hear about other things because Steve, you know can take things because Steve, you know can take things because Steve, you know can take over the whole night. And I'll just leave over the whole night and I'll just leave over the whole night. And I'll just leave you know that's okay too, but he's a - you know that's okay too, but he's a - you know that's okay too, but he's a great guy. He was in New York with the great guy. He was in New York with the great guy. He was in New York with the others and I saw him, he was been all others and I saw him, he was been all others and I saw him. He was been all over television over the last couple of over television over the last couple of over television over the last couple of days and he is a beautiful guy. So Steve days and he is a beautiful guy. So Steve days and he is a beautiful guy. So Steve come on up with your friends come on up, all right, I'm not gonna take tomorrow. All right, I'm not gonna take tomorrow. All right, I'm not gonna take tomorrow too long. But I will say this, I wear a too long, but I will say this, I wear a too long. But I will say this. I wear a group of black ministers as I said, and group of black ministers as I said and group of black ministers. As I said and then we have one token brother over then we have one token brother over then we have one token brother over there, right? Okay. But I will say this there right, okay, but I will say this there right, okay. But I will say this that people ask me well, why are you that people ask me well, why are you that people ask me? Well, why are you endorsing Donald Trump? Well, my opinion endorsing Donald Trump. Well, my opinion endorsing Donald Trump. Well, my opinion, he's the best and the only one that can - he's the best and the only one that can - he's the best and the only one that can beat Hillary Clinton, that's right. I mean beat Hillary Clinton, that's right. I mean beat Hillary Clinton. That's right. I mean, listen, we got a win and one thing about, listen, we got a win and one thing about, listen, we got a win and one thing about Donald Trump is he's a winner. Donald Trump is - he's a winner. Donald Trump is - he's a winner, amen. All right, here's another thing too, amen. All right. Here's another thing too, amen. All right, here's another thing too. He knows how to create wealth. Can I get, he knows how to create wealth, can I get, he knows how to create wealth, can I get amen? And as a black minister, I'll just amen. And as a black minister, I'll just amen. And as a black minister, I'll just tell you this, we're right in the inner tell you this. We're right in the inner tell you this. We're right in the inner city and I tell you we need jobs, we need city and I tell you we need jobs, we need city and I tell you we need jobs, we need employment, we need businesses and I'll employment, we need businesses and I'll employment. We need businesses and I'll tell you who better can help us, help tell you who better can help us, help tell you who better can help us help ourselves. And Donald Trump is saying so ourselves and Donald Trump is saying so ourselves and Donald Trump is saying. So, so I'll just tell you this that I'm glad, so I'll just tell you this that I'm glad. So I'll just tell you this, that I'm glad I believe that this is a movement. It's a - I believe that this is a movement. It's a - I believe that this is a movement, it's a movement and I believe that we're in a movement and I believe that we're in a movement and I believe that we're in a situation now where this country called situation now where this country called situation now Where this country called America is gonna come back and be made, America is gonna come back and be made, America is gonna come back and be made great again and they're right now in great again and they're right now in great again and they're Right now, in fact, I believe it's done fact, I believe it's done. Fact, I believe it's done. Oh, wealth transfer our wells a little - oh, wealth transfer, our wells a little - oh, wealth transfer, our wells a little vent, okay. And then I'll tell you one vent, okay? And then I'll tell you one vent, okay. And then I'll tell you one thing, mr. Trump is going to make this thing. Mr. Trump is going to make this thing. Mr. Trump is going to make this military strong again. Why is that? Why military strong again? Why is that, why military strong again, why is that? Why is this? I'm gonna take too much time. Is this? I'm gonna take too much time. Is this? I'm gonna take too much time. I'll tell you this down a chunk. Just I'll tell you this down a chunk, just I'll tell you this down a chunk just doesn't take anybody's mess, doesn't take anybody's mess, doesn't take anybody's mess. They've got big power. They have the - they've got big power, they have the - they've got big power. They have the ultimate power right, so go and enjoy ultimate power right, so go and enjoy ultimate power right, so go and enjoy yourselves. Can you please get them a yourselves? Can you please get them a yourselves? Can you please get them a good location is pretty tight in here, good location is pretty tight in here, good location is pretty tight in here. Thank you. Thank you. Thank you so nice. So thank you. Thank you. Thank you so nice. So thank you. Thank you. Thank you so nice. So nice do a fantastic job. I've seen what nice do a fantastic job. I've seen what nice do a fantastic job. I've seen what they do and man they do a job, nothing they do. And man they do a job, nothing they do. And man they do a job, nothing easy in life. You know nothing easy, easy in life. You know nothing easy, easy in life. You know nothing easy. Sometimes that can be tough. You work in sometimes that can be tough. You work in sometimes that can be tough. You work in the inner cities, it can be pretty tough. The inner cities, it can be pretty tough. The inner cities, it can be pretty tough. It could be pretty tough. It could be pretty tough. It could be pretty tough. It can also be rewarding and they get - it can also be rewarding and they get - it can also be rewarding and they get great rewards. Thank you very much and great rewards. Thank you very much and great rewards. Thank you very much and thank you, Steve. So we've got a lot going. Thank you, Steve. So we've got a lot going. Thank you, Steve. So we've got a lot going on to this country and I don't know if on to this country and I don't know if on to this country and I don't know if you're tweeted, I'm on my way to Manassas, you're tweeted, I'm on my way to Manassas. You're tweeted, I'm on my way to Manassas, I'm on my way and here I go. And first I - I'm on my way and here I go. And first I - I'm on my way and here I go. And first I said we're going to Virginia then would said we're going to Virginia then would said we're going to Virginia then would come. The truth is you look at what's come, the truth is you look at what's come. The truth is you look at what's happening with our country and I said happening with our country and I said happening with our country and I said, you know, we're gonna have fun. You know, we're gonna have fun. You know we're gonna have fun considering we don't have good subject considering we don't have good subject considering we don't have good subject matter, right. We have really bad subject matter, right. We have really bad subject matter, right. We have really bad subject matter. We don't win anymore, we don't win matter. We don't win anymore. We don't win matter. We don't win anymore. We don't win. We never win. We don't win with the - we never win. We don't win with the - we never win. We don't win with the military. We don't win with trade. We military, we don't win with trade. We military, we don't win with trade. We don't win with deals any kind of deals. I don't win with deals any kind of deals. I don't win with deals. Any kind of deals I look at that Iran deal, it's one of the look at that Iran deal. It's one of the look at that Iran deal. It's one of the worst things I've ever seen. No, no think worst things I've ever seen. No, no think worst things I've ever seen. No, no think of it. Think of it. They've already of it, think of it. They've already of it, think of it. They've already violated the deal. You know, I don't know violated the deal. You know, I don't know violated the deal, you know, I don't know if you have you heard if you have - you heard if you have - you heard they've already violated the deal, the - they've already violated the deal, the - they've already violated the deal. The ink isn't even dry, okay? It's not even - ink isn't even dry, okay? It's not even - ink isn't even dry, okay? It's not even dry and they violated the deal. So we dry and they violated the deal. So we dry and they violated the deal. So we don't do it anymore, you you look at, don't do it anymore, you you look at, don't do it anymore. You - you look at surprises, right? She says the president surprises, right. She says the president surprises, right. She says the president, why this guy over here, why this guy over here, why this guy over here? She says, surprise, you're right, who said she says, surprise, you're right, who said she says, surprise, you're right, who said that stick up your hand. I want to good that stick up your hand. I want to good that stick up your hand. I want to good, very good, very good. So we're gonna start very good, very good. So we're gonna start very good, very good. So we're gonna start winning and big, we're gonna win, we're winning and big. We're gonna win, we're winning and big. We're gonna win, we're gonna win, we're gonna win, I live gonna win, we're gonna win. I live gonna win, we're gonna win. I live, we're gonna win a lot. We're gonna win, we're gonna win a lot. We're gonna win, we're gonna win a lot. We're gonna win all the time. We're gonna get rid of all the time. We're gonna get rid of all the time. We're gonna get rid of Obamacare, which is a disaster disaster, Obamacare, which is a disaster disaster, Obamacare, which is a disaster disaster. And we're gonna replace it with - and we're gonna replace it with - and we're gonna replace it with something great. There's so many something great, there's so many something great, there's so many alternatives is so much better. I don't - alternatives is so much better. I don't - alternatives is so much better. I don't know for those people involved with the know for those people involved with the know for those people involved with the whole Obamacare thing and the Democrats whole Obamacare thing and the Democrats whole Obamacare thing and the Democrats have real problems over it because you have Real problems over it because you have real problems over it because you know they voted and it was a fraudulent know. They voted and it was a fraudulent know. They voted and it was a fraudulent vote. Let's face it, cuz Obama lied and in vote, let's face it, cuz Obama lied and in vote, let's face it, cuz Obama lied and in all fairness to your Senators and your all fairness to your Senators and your all fairness to your Senators and your congressman who Happen to be Democrats, congressman who happen to be Democrats, congressman who happen to be Democrats Obama line 28 times, she said keep your Obama line 28 times. She said keep your Obama line 28 times. She said keep your doctor keep your plan, keep your doctor, keep your plan, keep your doctor, keep your plan, keep your - everything, everything's great. It's going everything, everything's great. It's going everything, everything's great, it's going to be and then these guys got stuck with to be. And then these guys got stuck with to be - and then these guys got stuck with it and now they have to defend it and it - and now they have to defend it and it - and now they have to defend it and they're not gonna be able To defend it, they're not gonna be able to defend it. They're not gonna be able to defend it. And we're gonna go into a big league. But - and we're gonna go into a big league, but - and we're gonna go into a big league, but we're gonna have a plan. There's so much we're gonna have a plan, there's so much we're gonna have a plan, there's so much better. So much cheaper, you look at better so much cheaper, you look at better so much cheaper. You look at what's happening with deductibles on what's happening with deductibles on what's happening with deductibles on Obama care, it's out of control, you don't Obama care, it's out of control. You don't - Obama care, it's out of control, you don't - you can't use it. If you get hit by a - you can't use it. If you get hit by a - you can't use it. If you get hit by a tractor, maybe you'll get a couple of tractor. Maybe you'll get a couple of tractor, maybe you'll get a couple of bucks. The premiums have gone up 35, 45 bucks. The premiums have gone up 35, 45 bucks. The premiums have gone up 35, 45 and 55 percent and just the other day and 55 percent. And just the other day and 55 percent and just the other day and a lot of the very good newspapers and a lot of the very good newspapers and a lot of the very good newspapers, frankly and even of the bed once and frankly. And even of the bed once and frankly and even of the bed once and there are plenty of bad ones, these guys - there are plenty of bad ones. These guys - there are plenty of bad ones, these guys. So dishonest, oh yeah, yeah, such so dishonest. Oh, yeah, yeah, such so dishonest, oh yeah, yeah, such dishonesty with the - the mainstream media dishonesty with the - the mainstream media dishonesty with the - the mainstream media, I will tell you such total dishonesty. I will tell you such total dishonesty. I will tell you such total dishonesty, but if you look at the - if you look at - but if you look at the - if you look at - but if you look at the - if you look at over the last few days, you're seeing a - over the last few Days you're seeing a - over the last few days, you're seeing a lot of stories that Obamacare is lot of stories, that Obamacare is lot of stories that Obamacare is collapsing of its own weight and - and in collapsing of its own weight and - and in collapsing of its Own weight and - and in 2017 unfortunately you know if it's 2017, unfortunately you know if it's 2017, unfortunately you know if it's gonna go let it go now so that he has to gonna go let it go now so that he has to gonna Go let it go now so that he has to straighten it out. But he's not gonna straighten it out, but he's not gonna straighten it out. But he's not gonna straighten it out correctly because straighten it out correctly because straighten it out correctly because nothing he does is correct. Nothing he - nothing he does is correct. Nothing he - nothing he does is correct. Nothing he does. If you think about it, here's a guy does. If you think about it, here's a guy does. If you think about it, here's a guy we've got Isis and others that want to - we've got Isis and others that want to - we've got Isis and others that want to destroy us and he's more worried about destroy us and he's more worried about destroy us. And he's more worried about global warming, global warming, global warming and - and he believes not now think of and - and he believes not now think of and - and he believes not now think of this, this this and he believes go global. I mean these and he believes go global, I mean these and he believes go global, I mean these comes out all the time that make it comes out all the time that make it comes out all the time that make it biggest problem is global warming. And I biggest problem is global warming and I biggest problem is global warming and I say is this real, are we living in the say, is this real? Are we living in the say, is this real? Are we living in the world? You have people that they want to world, you have people that they want to world, you have people that they want to blow up, our cities want to kill all of blow up. Our cities want to kill all of blow up. Our cities want to kill all of our people. They're cutting off heads our people, they're cutting off heads our people, they're cutting off heads like it's no tomorrow in the Middle East like it's no tomorrow in the Middle East like it's no tomorrow in the Middle East. And far were - I mean, they're doing and far were - I mean, they're doing and far were - I mean, they're doing everything. They're drowning people in everything. They're drowning people in everything, they're drowning people in cages. We haven't seen anything like this cages. We haven't seen anything like this cages. We haven't seen anything like this since medieval times, you know, in since medieval times, you know in since medieval times, you know, in medieval times I'd read they chopped off medieval times. I'd read they chopped off medieval times. I'd read they chopped off heads heads heads I never said, did anyone see chopping off? I never said, did anyone see chopping off? I never said, did anyone see chopping off heads until you know you just seeing it heads until you know you just seeing it heads until you know you just seeing it over the last couple of years. Ad ad, it's over the last couple of years, ad ad, it's over the last couple of years. Ad ad, it's true, isn't it though? It's true you true, isn't it though? It's true you true, isn't it though? It's true you whoever heard of this, this is a vicious whoever heard of this, this is a vicious whoever heard of this, this is a vicious group of animals and we've got to stop group of animals and we've got to stop group of animals and we've got To stop them and we're gonna stop them so strong them and we're gonna stop them so strong them and we're gonna stop them so strong and so fast, so strong and so fast now and so fast, so strong and so fast now and so Fast, so strong and so fast. Now one of the things I want to tell you, one of the things I want to tell you, one of the things I want to tell you this, because a lot of you have heard me this because a lot of you have heard me this because a Lot of you have heard me speak and you've seen it, you know, speak and you've seen it, you know, speak and you've seen it. You know, they're always covered on live. They're always covered on live. They're always covered on live television. They get ratings. I guys television, they get ratings, I guys television, they get ratings. I guys speaking at ratings, okay? They make a speaking at ratings, okay? They make a speaking at ratings, okay? They make a fortune off me and I can't stand them fortune off me and I can't stand them fortune off me and I can't stand them and they can't stand me. They're always and they can't stand me. They're always and they can't stand me. They're always lying and not telling the truth, but they lying and not telling the truth, but they lying and not telling the truth, but they always put me in life, tell them nobody always put me in life, tell them nobody always put me in life, tell them Nobody else goes on the live television. These else goes on the live television. These else goes on the live television. These other guys running for office, they first other guys running for office. They first other guys running for office. They - first of all, they don't have crowds like this of all. They don't have crowds like this of all. They don't have crowds like this. Believe me, they have. I mean Bush goes, he believe me, they have - I mean Bush goes, he believe me, they have. I mean, Bush goes, he has like 59 people. It's true has like 59 people. It's true has like 59 people. It's true, he stands up, he starts speaking, he stands up. He starts speaking, he stands up. He starts speaking, everybody falls asleep. We can make a lot. Everybody falls asleep. We can make a lot everybody falls asleep. We can make a lot of money with him, become sleep master of money with him, become sleep master of money with him, become sleep master, put people to sleep. Now it's not but and put people to sleep now, it's not but and put people to sleep now it's not. But - and the other ones, if they have a hundred, the other ones, if they have a hundred, the other ones, if they have a hundred people, it's a lot every - every place I go people, it's a lot every - every place I go people, it's a lot every - Every place I go, we have thousands and thousands. This was - we have thousands and thousands. This was - we have thousands and thousands. This was only restricted by the size of the room, only restricted by the size of the room, only restricted by the size of the room. And we have thousands packed and the - and we have thousands packed and the - and we have thousands packed and the fire marshal, I love where's the fire fire marshal? I love where's the fire fire marshal? I love where's the fire marshal, what an, you know, it was so good marshal what an, you know, it was so good marshal what an, you know, it was so good cuz otherwise we gonna have a lot of cuz. Otherwise, we gonna have a lot of cuz otherwise we gonna have a lot of people standing outside. They're still people standing outside. They're still people standing outside. They're still coming in the back. You're right, you're coming in the back. You're right, you're coming in the back, you're right, you're right, man, right, man, right, man, so by so by so by great people here, great, great people, but great people here, great, great people, but great people here, great, great people. But we are going to do something that's - so we are going to do something that's - so we are going to do something that's so special because you know it was just special because you know it was just special because you know it was just mentioned that you Said movement, what do mentioned that you said movement, what do mentioned that you said movement, what do you think you think this is a movement you think you think this is a movement you think you think this is a movement, this is a movie. I mean, master Steve said this is a movie. I mean, master Steve said this is a movie. I mean, master Steve said it's a movement. I didn't - I never told it's a movement. I didn't - I never told it's a movement. I didn't - I never told him that he might have listened because him that he might have listened because him that he might have listened because I used the expression sometimes. But this - I used the expression sometimes, but this - I used the expression sometimes, but this is a movement is a movement, is a movement. I go to Dallas with the Mavericks play, I go to Dallas with the Mavericks play. I go to Dallas with the Mavericks play and oh, you guys like the Mavericks and - oh, you guys like the Mavericks and - oh, you guys like the Mavericks, that's good, good players. And the owner that's good, good players and the owner that's good, good players and the owner, mark, mark, you but has been great. He's mark, mark, you, but has been great. He's mark, mark, you, but has been great. He's been great to us. You know, I have to tell been great to us, you know, I have to tell been great to us. You know, I have to tell you and he said you want to use it, use you and he said you want to use it, use you. And he said you want to use it, use it and it was like go to Thursday, I said it and it was like go to Thursday, I said it and it was like go to Thursday, I said when he said Monday, I said how many, when he Said Monday, I said how many - when he said Monday, I said how many seats you have like 20,000, we filled it seats, you have like 20,000, we filled it seats, you have like 20,000, we filled it up in a day and a half. We had no, no, we up in a day and a half, we had no, no, we up in a day and a half, we had no, no, we had time left over. We had 20,000 in, had time left over. We had 20,000 in, had time left over. We had 20,000 in Dallas, we had 20,000 in Oklahoma, we had Dallas, we had 20,000 in Oklahoma, we had Dallas, we had 20,000 in Oklahoma. We had 35,000 people in Mobile, Alabama and 35,000 people in Mobile, Alabama and 35,000 people in Mobile, Alabama. And everywhere we go and I mean literally we - everywhere we go and I mean literally we - everywhere we go and I mean literally we go up to New Hampshire, we have crowds go up to New Hampshire. We have crowds go up to New Hampshire. We have crowds that are many, many, many times the size that are many, many, many times the size that are many, many, many times the size of anyone else, nobody has even close of anyone else. Nobody has even close of anyone else. Nobody has even close. Thank You, Man. Look at that guy. Thank You Man. Look at that guy. Thank You Man. Look at that guy. Thank you man. That's cool and I like thank you man, that's cool and I like thank you man that's cool. And I like your hat hold that hat up. Do we like your hat hold that hat up? Do we like your hat, hold that hat up? Do we like that happen, look at that, that happen, look at that that happen look at that and it looks better with that, with that and it looks better with that, with that and it looks better with that. With that sort of okay, head of hair, I wouldn't say sort of okay, head of hair, I wouldn't say sort of okay, head of hair, I wouldn't say it, but I wouldn't say the greatest I've it. But I wouldn't say the greatest I've it. But I wouldn't say the greatest I've ever seen, but it's acceptable, hey, has ever seen, but it's acceptable, hey, has ever seen, but it's acceptable, hey, has didn't hurt him any. It's really great, didn't hurt him any. It's really great, didn't hurt him any. It's really great. Thank you very much. You know, it's just thank you very much. You know, it's just thank you very much. You know it's just an honor to be here, but we're gonna be an honor to be here, but we're gonna be an honor to be here. But we're gonna be so proud, so I started this whole thing, so proud. So I started this whole thing, so proud. So I started this whole thing as you know in June and it takes courage as you know in June and it takes courage. As you know, in June and it takes courage to run for it, does it takes courage to run for it, does it takes courage to run for it? Does it takes courage? Especially I've never done this before, especially I've never done this before, especially I've never done this before and I'm self-funding my own campaign all and I'm self-funding my own campaign, all and I'm self-funding my own campaign, all these other guys. They're like these other guys. They're like these other guys. They're like bloodsuckers. No, it's like blood, sir. These packs are a disgrace. They totally - these packs are a disgrace. They totally - these packs are a disgrace. They totally control the cannon. No, they're a disgrace control. The cannon, no, they're a disgrace control. The cannon, no, they're a disgrace and I could have had a pack, you know and I could have had a pack, you know and I could have had a pack, you know, Bush raised 125 million dollars and he's Bush raised 125 million dollars and he's Bush raised 125 million dollars, and he's dying, he's dying in the polls dying, he's dying in the polls dying, he's dying in the polls, Rubio, all of them. I - I won't say a couple Rubio, all of them. I - I won't say a couple Rubio, all of them, I - I won't say a couple of them because so far a couple of them. Of them, because so far a couple of them of them because so far a couple of them I like. But that'll end because they all I like. But that'll end because they all I like. But that'll end because they all have to go through me. You know, they all have to go through me. You know, they all have to go through me. You know, they all know how. So it has to have, oh, it has to know how. So it has to have, oh, it has to know how. So it has to have, oh, it has to now Cruz, you know, as an example, Cruz has now Cruz, you know as an example, Cruz has now Cruz, you know as an example, Cruz has been great. To me. It's been really nice, been great to me. It's been really nice, been great to me. It's been really nice to him. Otherwise he agrees it, you know, to him. Otherwise he agrees it, you know to him. Otherwise he agrees it. You know everything's good, but at some point he's - everything's good. But at some point, he's - everything's good, but at some point, he's gonna have to say I can to attack him gonna have to say I can to attack him gonna have to say I can to attack him because otherwise I'm gonna come in Because otherwise, I'm gonna come in because otherwise I'm gonna come in second place or third place or something, second place or third place or something second place or third place or something. So they've all got to attack and I love. So they've all got to attack and I love. So they've all got to attack and I love it when they attack cuz so far everyone it when they attack cuz so far everyone it when they attack cuz. So far everyone that's attacked me, his gun bingo, right? That's attacked me, his gun bingo, right? That's attacked me. His gun bingo, right? They've gone down, they've gone down, they've gone down, they've gone down big league. I shouldn't - they've gone down big league. I shouldn't. They've gone down big league. I shouldn't say this in front of the pastors cuz say this in front of the pastors cuz say this in front of the pastors cuz, they'll say that's not nice. Is it okay? They'll say that's not nice. Is it okay? They'll say that's not nice. Is it okay, it's okay, right? They like winning. I mean, it's okay, right? They like winning. I mean, it's okay, right? They like winning. I mean, it's all about winning. It's really about - it's all about winning, it's really about - it's all about winning. It's really about making America great again, that's what making America great. Again. That's what making America great. Again, that's what I've learned. That's I've learned that's - I've learned that's - so today, I read a big, big article that - so today, I read a big, big article that - so today, I read a big, big article that everyone's afraid to fight me because everyone's afraid to fight me because everyone's afraid to Fight me because you know so, hey, look, you look at Perry, you know, so, hey, look, you look at Perry, you know, so, hey, look, you look at Perry, very nice man, very nice man, very nice man from Texas, right, governor Perry and he from Texas, right Governor Perry and he from Texas, right governor Perry and he was so nice to me was so nice to me was so nice to me then all of a sudden one day I said he then all of a sudden one day I said he then all of A sudden one day I said he couldn't have said that he was vicious, couldn't have said that he was vicious, couldn't have said that he was vicious and violent went to Washington, made his and violent went to Washington, made his and violent went to Washington, made his Speech, the whole speech was about me for speech, the whole speech was about me for speech, the whole speech was about me for like a half an hour. And I had to attack like a half an hour. And I had to attack like a half an hour. And I had to attack him and I attacked him very viciously him and I attacked him very viciously him and I attacked him very viciously and I feel guilty, not really I attacked and I feel guilty, not really. I attacked and I feel guilty not really. I attacked him remember on the glasses and I him remember on the glasses and I him remember on the glasses and I attacked him of the IQ, okay? And then you attacked him of the IQ, okay? And then you attacked him of the IQ, okay? And then you have a guy like Lindsey Graham, he's a - have a guy like Lindsey Graham. He's a - have a guy like Lindsey Graham, he's a sitting senator and you go to South, sitting senator and you go to South, sitting senator and you go to South Karen, by the way, his plan, I know so much, Karen, by the way, his plan. I know. So much, Karen, by the way, his plan, I know so much more than he does. His plan is so bad more than he does. His plan is so bad more than he does. His plan is so bad. It's so stupid. It's so stupid, it's so stupid, it's so stupid, it's so stupid. It's so stupid. Remember that in the America we deserve. Remember that in the America we deserve. Remember that in the America we deserve. I wrote that book in 2000. I wrote about - I wrote that book in 2000, I wrote about - I wrote that book in 2000, I wrote about Osama bin Laden, we got to take him out Osama bin Laden, we got to take him out Osama bin Laden, we got to take him out. You got to know where to use your power, you got to know where to use your power. You got to know where to use your power. And I said, and I don't know how many and I said and I don't know how many and I said, and I don't know how many people saw it, but a couple of the people saw it, but a couple of the people saw it. But a couple of the announcers in the morning, they said wait announcers in the morning, they said wait announcers in the morning, they said wait a minute that book, what was it written a minute that book, what was it written a minute that book, what was it Written 2000, so I had Osama bin Laden and the 2000, so I had Osama bin Laden and the 2000. So I had Osama bin Laden. And the reason is I watch and I listen and reason is I watch and I listen and reason is I watch and I listen and there's this guy with a big mouth, who is - there's this guy with a big mouth, who is - there's this guy with a Big mouth, who is very tall and I said wait a minute, let very tall and I said wait a minute, let very tall and I said wait a minute. Let me ask you - oh, I hear some friends. I hear me ask you. Oh, I hear some friends. I hear me ask you - oh, I hear some friends, I hear some friends. I guess some friends you some friends, I guess some friends you some friends, I guess some friends, you know they don't want to make America know they don't want to make America know they don't want to make America great. Again. I swear I don't think they great. Again, I swear I don't think they great. Again, I swear I don't think they do. You know, we want to be a unifier and do you know we want to be a unifier and do you know we want to be a unifier and we have to be a unifier. We have to be - we have to be a unifier. We have to be - we have to be a unifier we have to be. And the funny thing is I do a great job. And the funny thing is I do a great job. And the funny thing is I do a great job with things and they will be a big with things and they will be a big with things and they will be a big beneficiary, but maybe they just don't beneficiary, but maybe they just don't beneficiary. But maybe they just don't understand it yet, okay, maybe they don't understand it yet. Okay, maybe they don't understand it yet. Okay. Maybe they don't understand it yet, understand it yet, understand it yet, but maybe the - maybe the police could, but maybe the - maybe the police could. But maybe the - maybe the police could move them away, so we can all hear move them away. So we can all hear move them away. So we can all hear ourselves, George, get them out. We have ourselves, George, get them out, we have ourselves, George, get them out. We have too far we have too far we have too far we have, yeah, we have to do not. It's not fair to - yeah, we have to do not. It's not fair to - yeah, we have to do not. It's not fair to the pig. Thank you. Thank you. Thank you. You know, you know, the sad thing, there's, you know, you know the sad thing, there's, you know, you know the sad thing, there's like a very small group of people out like a very small group of people out like a very small group of people out there. Although they are pretty noisy I there although they are pretty noisy I there although they are pretty noisy I will say, but now listen to him, yeah, well will say, but now listen to him, yeah, well will say, but now listen to him, yeah, well the police Removed them very nicely, very the police, removed them very nicely, very the police, removed them very nicely, very gently. Please gently. Please gently, please. You know, I'll tell you what happens. So you know, I'll tell you what happens. So you know, I'll tell you what happens. So sometimes I'll say I want him out now, sometimes I'll say I want him out now, sometimes I'll say I want him out now and then they say he was terrible, he was and then they say he was terrible, he was and then they say he was Terrible, he was so nasty. So uh, so then I go, please be so nasty. So uh, so then I go, please be so nasty. So uh, so then I go, please be gentle, please say. And then they say he's gentle, please say. And then they say he's gentle, please say and then they say he's too soft to be break, you know, you can't too soft to be break, you know, you can't too soft to be break, you know, you can't win, you can't win. So I'll go middle, same win you can't win. So I'll go middle, same win you can't win. So I'll go middle same. Yeah, if you could remove them as soon as, yeah, if you could remove them as soon as, yeah, if you could remove them as soon as possible, that'll be good, aren't the possible that'll be good, aren't the possible that'll be good, aren't the police out there? I think after the police out there, I think after the police out there, I think after the building after the build up my gate building after the build up my gate building after the build up my gate might think they're gonna do a great job. Might think they're gonna do a great job, might think they're gonna do a great job. Yeah, we have to move them. Thank you very yeah, we have to move them. Thank you very yeah, we have to move them. Thank you very much. Thank you very much. Look at it the much. Thank you very much look at it the much. Thank you very much. Look at it. The people are pouring in through them, people are pouring in through them. People are pouring in through them. They're coming in and you know the - they're coming in and you know the - they're coming in and you know the saddest part, you have a few people there saddest part, you have a few people there saddest part, you have a few people there. You have thousands of people here and you have thousands of people here and you have thousands of people here and the media, the headlines tomorrow will be the media. The headlines tomorrow will be the media. The headlines tomorrow will be all protesters, right, protester, you know, all protesters, right, protester, you know, all protesters, right protester, you know what we have and I say it, I say it and I - what we have and I say it, I say it and I - what we Have - and I say it, I say it and I say it strongly, I used to use the term say it strongly, I used to use the term say it strongly, I used to use the term silent majority and the term has been silent majority and the term Has been silent, majority and the term has been used over the years and it really is used over the years. And it really is used over the years. And it really is people that have been abused and we have people that have been abused and we have people that have been abused and we have a majority. But we don't know. We have a - a majority, but we don't know. We have a - a majority, but we don't know. We have a majority, but it's not a silent majority, majority, but it's not a silent majority, majority, but it's not a silent majority. It's really become a noisy majority. It's the noisy majority and that's okay. It's the noisy majority and that's okay, it's the noisy majority and that's okay, that's okay, that's okay, that's okay. And because that's what we have to be, we - and because that's what we have to be, we - and because that's what we have to be, we have to be heard now folks because our have to be heard now folks because our have to be heard now folks Because our country's going to hell, we have a country's going to hell. We have a country's going to hell. We have a president who's incompetent. He's president who's incompetent, he's president who's incompetent. He's incompetent, I'll tell you what this guy incompetent. I'll tell you what this guy incompetent, I'll tell you what this guy is grossly incompetent when I watch him is grossly incompetent when I watch him is grossly incompetent. When I watch him taking all of this time and you know taking all of this time and you know taking all of this time and you know what I want clean air, I want clean water what I want clean air. I want clean water. What I want clean air, I want clean water, I want it to be immaculate. I want to be - I want it to be immaculate. I want to be - I want it to be immaculate. I want to be sparkling. I want to be great. I've won so sparkling. I want to be great. I've won so sparkling, I want to be great. I've won so many environmental awards over the years, many environmental awards over the years, many environmental awards over the years. You know I develop, I'm good. I'm really a - you know, I develop, I'm good. I'm really a - you know, I develop, I'm good. I'm really a great developer. Now I'm a politician, I great developer, now I'm a politician, I great developer now I'm a politician I - yeah, yeah, but I'm a great tavella and yeah, yeah, but I'm a great tavella and yeah, yeah, but I'm a great tavella and I've won so many environmental awards. I've won so many environmental awards. I've won so many environmental awards and I'm proud of them. I think it's a - and I'm proud of them. I think it's a - and I'm proud of them. I think it's a great thing, but it's gotten - it's gotten great thing, but it's gotten - it's gotten great thing, but it's gotten - it's gotten out of control and this whole global out of control and this whole global out of control and this whole global warming thing, you Know they change it warming thing, you know they change it warming thing, you know they change it, global warming, climate change, extreme global warming, climate change, extreme global warming, climate change, extreme weather. The reason is it's never sort of weather. The reason is it's never sort of weather. The reason is it's never sort of working now. The extreme weather one's working now the extreme weather one's working now the extreme weather, one's the bet, that's - that's truly got ta work, the bet that's - that's truly got ta work. The bet that's - that's truly got ta work right. You know you see, I remember during right, you know you see, I remember during right, you know you see, I remember during the winter we had sort of a bad storm. The winter, we had sort of a bad storm. The winter, we had sort of a bad storm and they said, oh, wow! This is global. And they said, oh, wow! This is global. And they said, oh, wow! This is global warming, global warming and it's warming global warming and it's warming global warming and it's unbelievable. And the snow was all over unbelievable and the snow was all over unbelievable and the snow was all over the place. And they said we haven't had a - the place and they said we haven't had a the place and they said we haven't had a snow. Now this was the third, the number snow. Now this was the third, the number snow. Now this was the third - the number one snowstorm was in 1889 which blew one snowstorm was in 1889, which blew one snowstorm was in 1889, which blew everything out the window. Look, we're everything out the window. Look, we're everything out the window. Look, we're gonna have, you know like this, it goes gonna have, you know like this, it goes gonna have, you know like this, it goes like this like this like this and we do want - we want clean air and we - and we do want - We want clean air and we - and we do want - we want clean air and we want clean water and other things, but want clean water and other things, but want clean water and other things. But it's gotten to a point people are making. It's gotten to a point people are making, it's gotten to a point people are making a fortune off this stuff and our a fortune off this stuff and our a fortune off this stuff and our businesses are being hurt. Our businesses are being hurt. Our businesses are being hurt, our manufacturers can't compete, giant is manufacturers can't compete. Giant is manufacturers can't compete. Giant is over there right now, laughing like hell over there right now, laughing like hell over there right now, laughing like hell at Barack Obama because we're stopping at Barack Obama because we're stopping at Barack Obama because we're stopping our plants from functioning and make it our Plants from functioning and make it our plants from functioning and make it so expensive and not any better, so expensive and not any better, so expensive and not any better pollution was. So we're stopping our pollution was, so we're stopping our pollution was. So we're stopping our plants, we're doing all of this damage plants. We're doing all of this damage plants. We're doing all of this damage. China's agreeing to do things in many China's agreeing to do things in many China's agreeing to do things in many years from now. And they'll violate the years from now and they'll violate the years from now and they'll violate the agreement a hundred percent because they agreement a hundred percent because they agreement a hundred percent because they always do just like Iran does just like always do, just like Iran. Does just like always do, just like Iran does, just like everybody does, everybody does everybody does. We like the dummies. We like the - we like the dummies. We like the - we like the dummies. We like the - just the dummies I feel we used to be. So just the dummies I feel we used to be, so just the dummies, I feel we used to be so proud now we feel so stupid. We'll let by proud now. We feel so stupid. We'll let by proud now. We feel so stupid. We'll let by stupid people and we can't have it stupid people and we can't have it stupid people and we can't have it anymore anymore anymore. We can't happen anymore some believe and we can't happen anymore some believe and we can't happen anymore some believe. And by the way, what I'm gonna do is we're - by the way, what I'm gonna do is we're - by the way, what I'm gonna do is we're gonna take some questions in a way you gonna take some questions in a way you Gon na take some questions in a way, you know it took me, it was brutal to get know it, took me, it was brutal to get know it took me, it was brutal to get here today. I might as well stick around here today. I might as well stick around here today, I might as well stick around for a while. So - so what we're gonna do for a while, so - so what we're gonna do for a while. So, so what we're gonna do, you can start thinking about it because you can start thinking about it because you can start thinking about it because in another few minutes we're gonna talk in another few minutes. We're gonna talk in another few minutes. We're gonna talk a little bit about what we have been a little bit about what we have been a little bit about what we have been planned and I want to take some planned and I want to take some planned and I want to take some Questions because I always find I love questions because I always find I love questions because I always find I love it. I love taking questions even if it - I love taking questions even if it - I love taking questions. Even if they're vicious, horrible, violent, they're vicious, horrible, violent, they're vicious, horrible, violent questions. We'll take them anyway. Okay, questions, we'll take them anyway. Okay, questions, we'll take them anyway. Okay. One thing you know with Hillary, she - one thing you know with Hillary, she - one thing you know with Hillary, she doesn't have the strength or the stamina doesn't have the strength or the stamina doesn't have the strength or the stamina to be President. She doesn't have it to be President, she doesn't have it to be President, she doesn't have it. And I know her, I know I can't look you and I know her, I know I can't. Look, you and I know her, I know I can't. Look, you have to understand, I've got no longer have to understand, I've got no longer have to understand. I've got no longer over the years with everybody. I was a - over the years with everybody, I was a - over the years with everybody, I was a businessman, one of the magazine's said businessman, one of the magazine's said businessman, one of the magazine's said I'm a world-class businessman grave. I'm a world-class businessman grave. I'm a world-class businessman, grave I am - I'm a great prisoner. I've made a - I am - I'm a great prisoner. I've made a - I am - I'm a great prisoner. I've made a fortune and I want to put that same fortune and I want to put that same fortune and I want to put that same thinking for the country. We owe 19 thinking for the country. We owe 19 thinking for the country. We owe 19 trillion dollars, it's gonna be 21 trillion dollars, it's gonna be 21 trillion dollars, it's gonna be 21 trillion dollars very soon. You see this trillion dollars very soon you see this trillion dollars very soon. You see this ridiculous budget that was just passed ridiculous budget that was just passed ridiculous budget that was just passed like they passed it immediately. Nobody like they passed it immediately. Nobody like they passed it immediately. Nobody fights. I was saying I know where the fights I was saying I know where the fights. I was saying I know where the Democrats are coming from, but the Democrats are coming from, but the Democrats are coming from. But the Republicans in a way are more Republicans in a way are more Republicans in a way are more disappointing because they go. You elect disappointing because they go. You elect disappointing because they go, you elect them and you know what happens and look them. And you know what happens and look them and you know what happens. And look, you had in Virginia, one of the greatest you had in Virginia, one of the greatest you had in Virginia, one of the greatest upsets of all time and he deserved to be upsets of all time and he deserved to be upsets of all time. And he deserved to be upset by the way, you know he's back in upset by the way, you know he's back in upset by the way. You know he's back in Bush. That was the end of Bush. Can you Bush that was the end of Bush? Can you Bush that was the end of Bush, can you believe that, but it was one of the believe that, but it was one of the believe that, but it was one of the greatest upsets. I think it never greatest upsets. I think it never greatest upsets. I think it never happened before and you were so smart, I happened before and you were so smart. I happened before and you were so smart. I mean you were so smart, but what happens mean you were so smart, but what happens mean you were so smart, but what happens is they say we are going to end is they say we are going to end is they say we are going to end Obamacare, we are going to make our Obamacare, we are going to make our Obamacare, we are going to make our military strong. We're gonna take our military strong. We're gonna take our military strong. We're gonna take our vets and we're gonna make our vets so vets and we're gonna make our vets. So vets and we're gonna make our vets so happy, everything's gonna be great, blah, happy, everything's gonna be great, blah, happy, everything's gonna be great, blah, blah, blah. All words, you know, it's all blah, blah. All words, you know, it's all blah, blah. All words, you know, it's all talk, no action, politicians, right, and you talk no action, politicians, right? And you talk no action, politicians, right? And you love them and you're all forum and they love them and you're all forum and they love them and you're all forum. And they win their election and they go to win their election and they go to win their election and they go to Washington. I always say it and they're Washington, I always say it and they're Washington, I always say it and they're with their wife or their - with their - with their wife or their - with their - with their wife or their - with their husband and they say, look, look, Mary, we Husband and they say, look, look Mary, we husband and they say, look, look Mary, we finally made it, look at the beautiful finally made it, look at the beautiful finally made it, look at the beautiful look at the beautiful columns, look at look at the beautiful columns, Look at, look at the beautiful columns, look at this, this is like they go into the - this - this is like they go into the - this - this is like they go into the Capitol building. They say, oh, this is Capitol building, they say, oh, this is Capitol building. They say, oh, this is beautiful. This is beautiful. Now they beautiful. This is beautiful. Now they beautiful. This is beautiful. Now they have a vote on Obamacare, have a vote on Obamacare, have a vote on Obamacare. Oh, I vote in favor of it. I don't want to - oh, I vote in favor of it. I don't want to - oh, I vote in favor of it. I don't want to believe this place, this is beautiful. Believe this place, this is beautiful. Believe this place, this is beautiful, don't they let us down. You know, no, they don't. They let us down, you know, no, they don't. They let us down. You know no, they look, I promise you one thing. Look, I promise you one thing, look, I promise you one thing if I win, you'll say when - what, where what if I win, you'll say when - what, where what if I win, you'll say when, what, where what that always say. But I have to start up that always say but I have to start up that always say but I have to start up, you know, look I am against 15 guys. It you know, look I am against 15 guys. It you know, look I am against 15 guys, it was 17 and what 17 now it's 15 and it's was 17 and what 17 now it's 15 and it's was 17 and what 17 now it's 15 and it's drying up fast, you know, yeah, drying up fast. You know, yeah, drying up fast, you know, yeah, yep guys with zero and they continue to yep guys with zero and they continue to yep guys with zero and they continue to go along. Tell me can that be good for go along? Tell me, can that be good for go along, tell me can that be good for them? I mean you guys like Pataki he them. I mean you guys like Pataki he them. I mean you guys like Pataki, he can't get elected dog catcher, you have - can't get elected dog catcher, you have can't get elected dog catcher. You have guys, you have guys honestly you have guys, you have guys, honestly you have guys, you have guys, honestly you have guys that can't even if you think about guys that can't even if you think about guys that can't even if you think about it, it It can't - even they can't get 1 %, they can't, can't even they can't get 1 %, they can't, can't even they can't get 1 %, they can't get anything. They actually had one of get anything. They actually had one of get anything. They actually had one of them down with a zero and an arrow, them down with a zero and an arrow them down with a zero and an arrow pointing left, meaning less than zero pointing left, meaning less than zero pointing left, meaning less than zero. That was on television now. I think that was on television now. I think that was on television now. I think that's a typographical error of some that's a typographical error of some that's a typographical error of some kind because how do you get less than kind because how do you get less than kind because how do you get less than zero, but it's like that's What it is and zero, but it's like that's what it is and zero, but it's like that's what it is and some of them didn't even register in. Some of them didn't even register in. Some of them didn't even register in upcoming states and now they missed upcoming states and now they missed upcoming states and now they missed their times, right? They've missed their their times, right? They've missed their their times, right? They've missed their times and I was told that missed their times and I was told that missed their times and I was told that missed their times. Well, if a guy doesn't want to put times, well, if a guy doesn't want to put times, well, if a guy doesn't want to put up money because he knows he's not gonna up money because he knows he's not gonna up money because he knows He's not gonna win or he can't get enough signatures to win or he can't get enough signatures to win or he can't get enough signatures to register in a Virginia or South Carolina register in a Virginia or South Carolina register in a Virginia or South Carolina Or in New Hampshire or wherever it may or in New Hampshire or wherever it may or in New Hampshire or wherever it may be, but numbers of them haven't register be, but numbers of them haven't register be, but numbers of them haven't register. Why do we allow them to debate? I mean, if why do we allow them to debate, I mean, if why do we allow them to debate. I mean, if somebody gives up the state of Virginia, somebody gives up the state of Virginia, somebody gives up the state of Virginia or if somebody gives up the state of or if somebody gives up the state of or if somebody gives up the state of South Carolina, because you know they're South Carolina because you know they're South Carolina because you know they're pretty hard to get on the ballot. They pretty hard to get on the ballot. They pretty hard to get on the ballot. They are by the way I'm already on the ballot are by the way I'm already on the ballot are by the way I'm already on the ballot. I got - I had some - I got - I had some - I got - I had some - I had something. Thank you. Thank you. I - I had something. Thank you. Thank you. I - I had something. Thank you. Thank you. I know they're just saying we helped, you know, they're just saying we helped, you know, they're just saying we helped, you know, we had so many wheat, you know, I did know we had so many wheat, you know, I did know we had so many wheat, you Know, I did - we took many times the number of - we took many times the number of - we took many times the number of signatures. We needed a lot and we did it signatures. We needed a lot and we did it signatures. We needed a lot and we did it so quickly who did it? You did it right? So quickly who did it? You did it right? So quickly, who did it? You did it right here stand up and take a bow, but you here stand up and take a bow, but you here stand up and take a bow, but you know what it is true. Thank you honey a know what it is true. Thank you honey. A know what it is true. Thank you honey, a really great job. I know that if somebody really great job, I know that if somebody really great job, I know that if somebody doesn't get on the ballot and they can't, doesn't get on the ballot and they can't, doesn't get on the ballot and they can't get them about cuz. They missed that time, get them about cuz, they missed that time, get them about cuz, they missed that time limit. So that means they gave up you limit. So that means they gave up you limit. So that means they gave up you know, a major state someplace why would know a major state someplace why would know a major state someplace. Why would you let them on the debate stage to you, let them on the debate stage to you, let them on the debate stage to waste everybody's time and they're waste everybody's time and they're waste everybody's time and they're already at zero or one or two. Why would already at zero or one or two, why would already at zero or one or two? Why would you allow them to be on the debate stage you allow them to be on the debate stage, you allow them to be on the debate stage. It's - it's - so it's not unfair, it's just - it's - it's - so it's not unfair, it's just - it's - it's - so it's not unfair, it's just stupid. It would psyche what are we doing stupid, it would psyche, what are we doing stupid, it would psyche, what are we doing. And you don't have time to talk mr. and you don't have time to talk mr. and you don't have time to talk. Mr. Trump, the war in the Middle East in 30, Trump the war in the Middle East in 30, Trump the war in the Middle East. In 30 seconds, sir, what would you do? 30 seconds, seconds, sir, what would you do? 30 seconds, seconds, sir, what would you do? 30 seconds, and you know it's funny on the debates and you know it's funny on the debates and you know it's funny on the debates and I don't know if you've seen this, but - and I don't know if you've seen this, but - and I don't know if You've seen this, but I think almost or just about every - I think almost or just about every - I think almost or just about every single poll where they do the online single poll where they do the online single poll where they do the online polls. After the big Drudge was an polls after the big Drudge was an polls after the big Drudge was an amazing guy by the way, if you ever met amazing guy by the way, if you ever met amazing guy by the way, if you ever met drugs, we Love drugs, drugs, we love drugs, drugs, we love drugs. He's an amazing guy, but drudge Time, he's an amazing guy. But drudge Time, he's an amazing guy. But drudge Time magazine slate, every one of these groups magazine slate. Every one of these groups magazine slate, every one of these groups, they're doing these online polls of like they're doing these online polls of like they're doing these online polls of like six or seven. Every debate I've won every six or seven, every debate I've won every six or seven, every debate, I've won every single poll in every single debate and single poll in every single debate and single poll in every single debate. And I'm really happy about it. I'm really happy about it. I'm really happy about it. Now, I'll tell you cuz, it's become a big now I'll tell you cuz it's become a big now I'll tell you cuz it's become a big story. So the other day I said I don't story. So the other day I said I don't story so the other day I said I don't want to bring in my - okay, the break is want to bring in my - okay, the break is want to bring in my - okay, the break is early, so I will. So let's say they would early, so I will - so let's say they would early. So I will - so let's say they would have had a couple of million. People have had a couple of million people have had a couple of million people watching the first debate, right? You know, watching the first debate, right, you know, watching the first debate, right? You know, and it used to be that these debates and it used to be that these debates and it used to be that these debates, nobody even wanted up the television or nobody even wanted up the television or nobody even wanted up the television or if they Had I think they forced them if they had, I think they forced them. If they had, I think they forced them down their throat. You have to take the down their throat. You have to take the down their throat. You have to take the debater with taking your license away or debater with taking your license away or debater with taking your license away or something, right? So the first debate was something, right? So the first debate was something, right? So the first debate was by Fox and they had 24 million people by Fox and they had 24 million people by Fox and they had 24 million people actually more than that after the final - actually more than that after the final - actually more than that after the Final numbers, but 24 million people which was numbers, but 24 million people which was numbers, but 24 million people which was about the largest and the history of about the largest and the history of about the largest and the history of cable television, right. The next one was cable television, right? The next one was cable television, right? The next one was CNN with their 23 million people now CNN with their 23 million people now CNN with their 23 million people. Now think of this - think of this - think of this CNN's covered some pretty big events. CNN's covered some pretty big events. CNN's covered some pretty big events like Wars and other things right in the like Wars and other things, right in the like Wars and other things, right. In the history of CNN, it was the highest-rated history of CNN. It was the highest-rated history of CNN. It was the highest-rated show they've ever had and they made it show they've ever had and they made it show they've ever had and they made it three hours, which they shouldn't have three hours, which they shouldn't have three hours, which they shouldn't have done because I'm Still on that phone I done because I'm still on that phone I done because I'm still on that phone. I could stand up. I could do this for 20, could stand up. I could do this for 20, could stand up. I could do this for 20 hours straight wouldn't matter, but hours straight wouldn't matter, but hours straight wouldn't matter. But nobody wants to watch this stuff for. Nobody wants to watch this stuff for. Nobody wants to watch this stuff for three hours, three hours, three hours, especially when 90 % of the people know, especially when 90 % of the people know, especially when 90 % of the people know they're not doing what they're doing it. They're not doing what they're doing it. They're not doing what they're doing it. I don't even know why they're doing it. I don't even know why they're doing it. I don't even know why they're doing it, but nobody wants. So that was unfair and - but nobody wants. So that was unfair and but nobody wants, so that was unfair. And then when we went to CNBC where that guy then when we went to CNBC where that guy then when we went to CNBC where that guy John Harwood, what an idiot he was right, John. Harwood, what an idiot? He was right. John Harwood, what an idiot he was right now, how bad he's not even a professional now how bad he's not even a professional. Now how bad he's not even a professional and I have to tell you for four weeks and I have to tell you for four weeks and I have to tell you for four weeks before that. He was so nice to me before that he was so nice to me before that he was so nice to me. Oh, mr. Trump. Oh, you're so wonderful, you? Oh, mr. Trump. Oh, you're so wonderful, you? Oh, mr. Trump. Oh, you're so wonderful. You know, mr. Trump, you're great and then he know mr. Trump, you're great and then he know mr. Trump, you're great and then he comes out with a question he reads, it comes out with a question he reads, it comes out with a question, he reads it. Mr. Trump, and you know it reads a mr. Trump and you know it reads a mr. Trump and you know it reads a wiseguy question, I said that's not a wiseguy question. I said that's not a wiseguy question. I said that's not a very nice question. To start off the day, very nice question to start off the day, very nice question to start off the day, but they wanted three hours because - but they wanted three hours because - but they wanted three hours because advertising sells for so much. Now that advertising sells for. So much now that advertising sells for so much now that they make a fortune and I said I'm not - they make a fortune and I said I'm not - they make a fortune and I said I'm not gonna let him have three hours. I'm not gonna let him have three hours, I'm not gonna let him have three hours. I'm not gonna let him have it and everyone said gonna let him have it and everyone said gonna let him have it. And everyone said these same people, they said, oh, you'll these same people, they said, oh, you'll these same people. They said, oh, you'll never be able to stop him. And I said you never be able to stop him. And I said you never be able to stop him and I said you say, well, I stopped him. I think it took say, well, I stopped him. I think it took say, well, I stopped him. I think it took me what do you think, Cory, about three me, what do you think, Cory, about three me, what do you think Cory, about three minutes? No, I said I'm not going and I minutes. No, I said I'm not going and I minutes. No, I said I'm not going and I have to tell you Carson said I'll - he'll have to tell you Carson said I'll - he'll have to tell you Carson said I'll - he'll go along with it. So that was very nice go along with it. So that was very nice go along with it. So that was very nice. Ben Carson and he said that was - nope. I - Ben Carson and he said that was - nope. I - Ben Carson and he said that was - nope. I have to give credit where credit is due. Have to give credit where credit is due, have to give credit where credit is due because I've been a little bit rough on because I've been a little bit rough on because I've been a little bit rough on him. But I have to give credit where he him, but I have to give credit where he him. But I have to give credit where he came along and he said I would go along came along and he said I would go along came along and he said I would go along and just so I went in, we went in and I - and just so I went in, we went in and I - and just so I went in, we went in and I said the two of us we're not doing. It said the two of us we're not doing. It said the two of us, we're not doing it and they folded like an umbrella it took and they folded like an umbrella it took and they folded like an umbrella. It took two minutes. So now my big thing is they two minutes. So now my big thing is they two minutes. So now my big thing is they all say you can't get Mexico to pay for all say you can't get Mexico to pay for all say you can't get Mexico to pay for the wall dryer, the wall dryer. The wall dryer time we're gonna build a wall time, we're gonna build a wall time, we're gonna build a wall, try try, try, we're gonna build a wall, it's going to - we're gonna build a wall, it's going to - we're gonna build A wall, it's going to be a great wall. It's not gonna be a - be a great wall. It's not gonna be a - be a great wall. It's not gonna be a little toy. We'll build it not for a lot little toy. We'll build it. Not for a lot little toy, we'll build it not for a lot of money. You know in China they built of money. You know in China they built of money. You know in China they built the Great Wall of China, two thousand, the Great Wall of China. Two thousand, the Great Wall of China two thousand years ago, it's 13,000 miles long, okay years ago, it's 13,000 miles long, okay. Years ago, it's 13,000 miles long, okay? This is serious walls, all right in our - this is serious walls, all right in our - this is serious walls, all right. In our case we need really a thousand miles case. We need really a thousand miles case. We need really a thousand miles, it's two thousand miles. But summers it's two thousand miles, but summers it's two thousand miles, but summers natural borders, natural barriers which natural borders, natural barriers which natural borders, natural barriers which are pretty good that as good as the wall are pretty good that as good as the wall are pretty Good, that as good as the wall, but you know what, let's use it, right? So - but you know what, let's use it, right? So - but you know what, let's use it, right? So we're gonna need about a thousand miles. We're gonna need about a thousand miles. We're gonna need about a thousand miles and think of it. So we're at a thousand and think of it. So we're at a thousand and think of it. So we're at a thousand miles Chinese at 13,000. This was 2,000 miles Chinese at 13,000. This was 2,000 miles Chinese at 13,000. This was 2,000 years ago. They didn't have trucks. They - years ago, they didn't have trucks. They - years ago, they didn't have trucks, they didn't have tractors, they did it. The didn't have tractors. They did it, the didn't have tractors, they did it the old-fashioned way, right? And they got it old-fashioned way, right? And they got it old-fashioned way, right? And they got it done and it is a big wall. So what we done and it is a big wall. So what we done and it is a big wall. So what we have is we're gonna build a wall and have is we're gonna build a wall and have is we're gonna build a wall and we're gonna stop people from coming into. We're gonna stop people from coming into - we're gonna stop people from coming into our country illegally, okay? It's time. Our country illegally, okay. It's time. Our country illegally, okay, it's time. It's time. And if people want to come in, it's time. And if people want to come in, it's time and if people want to come in legally, we want them to come and they legally, we want them to come and they legally, we want them to come and they have to go through the process and if have To go through the process and if have to go through the process and if people wanted to come in now when I people wanted to come in now when I people wanted to come in now, when I first mentioned this, all of the other first mentioned this, All of the other first mentioned this, all of the other candidates, again, we started with 17 now candidates. Again, we started with 17 now candidates again, we started with 17. Now we're down to 15, but they're gonna start, we're down to 15, but they're gonna start, we're down to 15, but they're gonna start falling like flies you watch. I mean it's falling like flies you watch. I mean it's falling like flies you watch. I mean it's got ta be at some point, I got ta leave, got ta be at some point, I got ta leave, got ta be at some point I got ta leave right, don't have to leave. I mean don't right, don't have to leave. I mean, don't right, don't have to leave. I mean, don't they sort of have to leave. We got this, they sort of have to leave. We got this, they sort of have to leave. We got this one guy. He's terrible one guy. He's terrible one guy. He's terrible. He's the worst debater I've ever seen. He's the worst debater I've ever seen. He's the worst debater I've ever seen cases from Ohio. No, no. The guy is the worst debater. He's no, no. The guy is the worst debater. He's no, no. The guy is the worst debater. He's a professional politician. He can't speak a professional politician. He can't speak a professional politician. He can't speak properly. He's terrible, he's terrible. We properly, he's terrible, he's terrible, we properly, he's terrible, he's terrible. We have - again, I told you Lindsey Graham so have - again, I told you Lindsey Graham so have - again, I told you Lindsey Graham, so they do a poll and I mean I'm like they do a poll and I mean I'm like they do a poll. And I mean, I'm like killing him in South, how do you beat the killing him in South? How do you beat the killing him in South? How do you beat the senator in Florida? So in Florida, you senator in Florida, so in Florida, you senator in Florida. So in Florida, you have to - you have a governor and you have have to - you have a governor and you have have to - you have a governor and you have a sitting senator who by the way doesn't a sitting senator who by the way doesn't a sitting Senator who by the way doesn't vote, he isn't vote. How would you like to vote? He isn't vote. How would you like to vote? He isn't vote. How would you like to be in Florida and you invest in a - be in Florida and you invest in a - be in Florida and you invest in a younger, you invest in him, you you take younger, you invest in him, you you take younger, you invest in Him you - you take him to heart and you put him in his him to heart and you put him in his him to heart and you put him in his United States in. I mean to me that's a United States in. I mean, to me that's a United States in. I mean to me that's a great - that's a great position, right, great. That's a great position, right, great. That's a great position, right. United States Senator for Florida, he's United States, Senator for Florida, he's United States, Senator for Florida. He's in there for about 12 seconds and he in there for about 12 seconds and he in there for about 12 seconds. And he decide she wants to run for president, decide she wants to run for president, decide she wants to run for president, why, why, but how would you like to have a why why, but how would you like to have a why why, but how would you Like to have a guy who doesn't show up to vote now guy who doesn't show up to vote now guy who doesn't show up to vote. Now you've put in a lot of time and effort. You've put in a lot of time and effort. You've put in a lot of time and effort making your choice, making your choice, making your choice. But if a man says he's gonna be your - but if a man says he's gonna be your - but if a man says he's gonna be your senator and then he goes around senator and then he goes around senator and then he goes around campaigning And fundraise, he was the campaigning and fundraise, he was the campaigning and fundraise. He was the other day Homeland Security, very other day Homeland Security, very other day Homeland Security, very important meeting in Washington. He chose important meeting in Washington. He chose important meeting in Washington. He chose to go to a fundraiser in California now to go to a fundraiser in California now to go to a fundraiser in California. Now I don't know that I'm gonna win Florida. I don't know that I'm gonna win Florida. I don't know that I'm gonna win Florida, but I am killing them in Florida and I - but I am killing them in Florida and I - but I am killing them in Florida and I think I have the ultimate soundbite. I think I have the ultimate soundbite. I think I have the ultimate soundbite. I mean, seriously, if a guy, first of all mean, seriously, if a guy, first of all mean, seriously, if a guy, first of all, Rubio is very, very weak on illegal Rubio, is very, very weak on illegal Rubio, is very, very weak on illegal immigration. And he's in favor of amnesty immigration and he's in favor of amnesty immigration and he's in favor of amnesty. So you can't win Bush just to put an end. So you can't win Bush just to put an end. So you can't win Bush. Just to put an end to that because I don't want to mention to that because I don't want to mention to that because I don't want to mention he's a very nice person low-energy, but he's a very nice person low-energy, but he's a very nice person low-energy. But very nice, we don't need low-energy, very nice, we don't need low-energy, very nice. We don't need low-energy people, folks. We don't need - we can't people, folks, we don't need - we can't people, folks, we don't need, we can't afford them. Hillary is - I mean, Hillary afford them. Hillary is - I mean, Hillary afford them, Hillary is - I mean, Hillary, you ever see Hillary Hillary and I said you ever see Hillary Hillary and I said you ever see Hillary Hillary and I said she doesn't have the strength. She - she doesn't have the strength. She - she doesn't have the strength, she doesn't have the stamina, but did you doesn't have the stamina, but did you doesn't have the stamina. But did you ever see, Hillary, she'll do an event like ever see Hillary, she'll do an event like ever see Hillary. She'll do an event like this and then won't show up like four this and then won't show up like four this and then won't show up like four, five you notice. Yes, she goes home and five you notice, yes, she goes home. And five. You notice, yes, she goes home and sleeps. She'll do an event like this sleeps. She'll do an event like this sleeps. She'll do an event like this, and - and it's actually not - we shouldn't. And - and it's actually not - we shouldn't. And - and it's actually not - we shouldn't be laughing. We should be crying because be laughing. We should be crying because be laughing. We should be crying because she's by far the front-runner. I mean, she's by far the front-runner. I mean, she's by far the front-runner. I mean, this other guy who's a joke. He gave it this other guy who's a joke. He gave it this other guy who's a joke. He gave it up when he said no emails, Bernie, up when he said no emails. Bernie up when he said no emails, Bernie, a birdie he a birdie he a birdie he it up. I think he just had a hernia it up. I think he just had a hernia it up. I think he just had a hernia operation. You know, he was carrying operation, you know, he was carrying operation, you know, he was carrying around the tax code that he wants to around the tax code that he wants to around the tax code that he wants to make larger. Sure. I actually just made make larger sure I actually just made make larger sure, I actually just made that up, but you know he just had a that up, but you know he just had a that up, but you know he just had a hernia operation and so I hope he gets hernia operation and so I hope he gets hernia operation and so I hope he gets better fast, but he's got no chance he better fast, but he's got no chance he better fast. But he's got no chance he took Hillary and he gave her the took Hillary and he gave her the took Hillary and he gave her the election. He was doing fine and he was election, he was doing fine and he was election, he was doing fine. And he was getting the second largest crowds. I'm getting the second largest crowds. I'm getting the second largest crowds I'm out by the way my crowds blow everyone out by the way my crowds blow everyone out by the way my crowds blow everyone away. You know, you know what said I was away, you know, you know what said I was away, you know, you know what said I was since I was in Sarasota the other day since I was in Sarasota the other day since I was in Sarasota the other Day Florida and what a great place and we - Florida and what a great place and we - Florida and what a great place and we had a time you wouldn't believe it is 12 had a time, you wouldn't believe it is 12 had a time. You wouldn't believe it is 12 o'clock football games, everything going o'clock, football games, everything going o'clock, football games, everything going away at 12,000 people. And I don't I away at 12,000 people and I don't I away at 12,000 people and I don't - I don't ever say how many people I let the don't ever say how many people I let the don't ever say how many people I let the government say It now because we have an government say it now because we have an government say it now because we have an amazing Secret Service people. We have amazing Secret Service people. We have amazing Secret Service people. We have amazing people that work here. I let them amazing people that work here. I let them amazing people that work here. I let them say because every time I say it, if I'm say because every time I say it, if I'm say because every time I say it, if I'm off by 3 people, they make like put off by 3 people. They make like put off by 3 people they make like put headline and - and we had 12,000 people headline and - and we had 12,000 people headline and - and we had 12,000 people, nobody says that nobody covers that. But nobody says that nobody covers that. But nobody says that nobody covers that, but when Bernie Sanders would have a group when Bernie Sanders would have a group when Bernie Sanders would have a group of like 5,000, 5,000 people, so I get much of like 5,000, 5,000 people. So I get much of like 5,000, 5,000 people. So I get much bigger things than he does now in the bigger things than he does now in the bigger things than he does. Now. In the meantime, his are going down the tubes we meantime his are going down the tubes we meantime his are going down the tubes, we have to talk about how much anymore, but have to talk about how much anymore, but have to talk about how much anymore. But the truth is, Hillary shouldn't be. The truth is Hillary shouldn't be. The truth is Hillary shouldn't be allowed to run because what she did is allowed to run because what she did is allowed to run because what she did is illegal. What she did is a - I want her to run, I want her to run and I want her to run. I want her to run and I want her to run. I want her to run. And by the way, the Fox poll just came out. I - by the way the Fox poll just came out, I - by the way the Fox poll just came out. I beat her easily in the fox ball one. You know, I can't believe it. I had this whole know. I can't believe it. I had this whole know. I can't believe it, I had this whole thing and I never mentioned post and I thing and I never mentioned post and I thing and I never mentioned post and I can you believe that though. I'm so sad. Can you believe that though? I'm so sad, can you believe that though? I'm so sad, usually I start off by saying and then usually I start off by saying and then usually I start off by saying and then everybody says included the press and my everybody says included the press and my everybody says included the press and my opponents. He always talks about polls, opponents. He always talks about polls, opponents. He always talks about polls. You know why? Because I'm winning all of you know why? Because I'm winning all of you know why? Because I'm winning all of them. If I were them. Honestly, if you them, if I were them honestly if you them, if I were them honestly, if you think about it, one of the major main think about it. One of the major main think about it, one of the major main streams asked me that's so long ago, they streams asked me that's so long ago, they streams asked me that's so long ago they said why do you always talk about polls said, why do you Always talk about polls said, why do you always talk about polls? And I didn't - I never thought of the - and I didn't - I never thought of the - and I didn't - I never thought of the question I said, I don't know because I'm question. I said, I don't know because I'm question I said I don't know because I'm winning. I'm winning every poll. It's good winning. I'm winning every poll. It's good winning. I'm winning every poll. It's good to talk about him. I don't know what the - to talk about him. I don't know what the - to talk about him, I don't know what the hotel knows what they mean. I think they hotel knows what they mean. I think they hotel knows what they mean. I think they mean something right? It is sort of mean something right? It is sort of mean something right? It is sort of strange, you know the interview 392 strange, you know the interview 392 strange, you know the interview 392 people and they say with certainty that people and they say with certainty that people and they say with certainty that your plus or minus three. And it's sort your plus or minus three and it's sort your plus or minus three. And it's sort of an amazing thing. I studied it at of an amazing thing. I studied it at of an amazing thing. I studied it at Wharton. I guess it works cuz, you know, Wharton, I guess it works cuz, you know, Wharton, I guess it works cuz you know, frankly there's something going on, but frankly there's something going on, but frankly there's something going on. But then when you have many, many, many of then when you have many, many, many of then when you have many, many, many of them, and I'm number one in every single them and I'm number one in every single them. And I'm number one in every single one and number one in every single state one and number one in every single state one and number one in every single state. And number one, I mean, you look Iowa and number one, I mean, you look Iowa and number one, I mean, you look Iowa, number one, New Hampshire, number one, number one, New Hampshire, number one. Number one, New Hampshire, number one, South Carolina and big, big margin, big South Carolina and big, big margin, big South Carolina and big, big margin, big more. They got a really work hard to more. They got a really work hard to more. They got a really work hard to catch me in New Hampshire. Let me tell catch me in New Hampshire, let me tell catch me in New Hampshire, let me tell you those people and and the people in you, those people and and the people in you, those people and and the people in our - these are great people. And then you our - these are great people and then you our - these are great people and then you go down South Carolina, tremendous, every go down, South Carolina, tremendous, every go down, South Carolina, tremendous every and then we go to Nevada, tremendous. And - and then we go to Nevada, tremendous and - and then we go to Nevada, tremendous. And in Nevada, I win the Hispanic vote, okay. In Nevada, I win the Hispanic vote, okay. In Nevada, I win the Hispanic vote, okay, they do. And I've always said, I'm gonna they do and I've always said I'm gonna they do. And I've always said I'm gonna win this battle because I'm gonna bring - win this battle because I'm gonna bring - win this battle because I'm gonna bring jobs back. I'm bringing jobs back. I'm jobs back. I'm bringing jobs back. I'm jobs back. I'm bringing jobs back, I'm bringing them back from China and I'm bringing them back from China and I'm bringing them back from China and I'm bringing it back from Japan and I'm bringing it back from Japan and I'm bringing it back from Japan and I'm bringing it Back from Mexico, and I'm bringing it back from Mexico and I'm bringing it back from Mexico and I'm bringing it back from Vietnam, bringing it back from Vietnam, bringing it back from Vietnam and every place we're gonna have jobs and every place we're gonna have Jobs and every place we're gonna have jobs again, we're going to have jobs. You know, again, we're going to have jobs. You know, again we're going to have jobs, you know the - the number one and I'll probably get the - the number one and I'll probably get the - the number one and I'll probably get it tonight, so I can maybe just avoid it tonight. So I can maybe just avoid it tonight, so I can maybe just avoid this question, but the number one this question but the number one this question. But the number one question I get, I go around, I see a lot question I get I go around. I see a lot question I get I go around, I see a lot of different places. I use a lot of of different places. I use a lot of of different places. I use a lot of college auditoriums and all because the college auditoriums and all because the college auditoriums and all because the crowd sizes and a lot of students come crowd sizes and a lot of students come crowd sizes and a lot of students come up. Mr. Trump, what can you do to help us up mr. Trump, what can you do to help us up mr. Trump? What can you do to help us? We're choking there, choking with that, we're choking there, choking with that, we're choking there, choking with that. And the biggest thing they're choking and the biggest thing they're choking and the biggest thing they're choking with, they then go for two years or four with they then go for two years or four with they then go for two years or four years to college. And they can't get a years to college and they can't get a years to college and they can't get a job when they get out. And they're good job when they get out and they're good job when they get out and they're good students at good colleges. And they can't students at good colleges and they can't students at good colleges and they can't get a job. It's one of the most heart, get a job. It's one of the most heart, get a job. It's one of the most heart wrenching questions again. And you see wrenching questions again and you see wrenching questions again and you see these students and they're borrowing these students and they're borrowing these students and they're borrowing money from an, you know, to a large extent, money from an, you know, to a large extent, money From an, you know, to a large extent from the federal government with it's from the federal government with it's from the federal government with - it's the only thing, it's just about the only - the only thing it's just about the only - the only thing it's just about the Only thing the federal government makes money thing, the federal government makes money thing. The federal government makes money with his student loans, maybe that's the - with his student loans, maybe that's the - with his student loans, maybe that's the only thing. It shouldn't be making money. Only thing. It shouldn't be making money, only thing. It shouldn't be making money with, you know, if you think about it with, you know, if you think about it with, you know, if you think about it, but we're gonna do something with it and but we're gonna do something with it and but we're Gon na do something with it and you know, I don't know what's going on. You know, I don't know what's going on. You know, I don't know what's going on with the colleges, but those colleges with the colleges, but those colleges with the colleges. But those colleges, they're going up like a skyrocket you. They're going up like a skyrocket you. They're going up like a skyrocket. You know, things are sort of even nobody's know things are sort of even nobody's know things are sort of even nobody's going up at the colleges. So somebody's going up at the colleges. So somebody's going up at the colleges. So somebody's doing something wrong with their time doing something wrong with their time doing something wrong with their time. And one of the reasons the colleges go and one of the reasons the colleges go. And one of the reasons the colleges go up is because the federal government up is because the federal government up is because the federal government pays for the students. But the students pays for the students, but the students pays for the students, but the students can't afford to pay that much and we got - can't afford to pay that much and we got - can't afford to pay that much. And we got to look a little bit into the college's to look a little bit into the college's to look a little bit into the college's. Why are they going up more than anything? Why are they going up more than anything? Why are they going up more than anything else? They must be making a fortune else. They must be making a fortune else. They must be making a fortune. Let's buy a college, you want to buy a - let's buy a college, you want to buy a let's buy a college, you want to buy a college, don't buy, don't buy but but college don't buy, don't buy but but college don't buy, don't buy but but there Is something going on, but one of there is something going on, but one of there is something going on. But one of the saddest things is when you see these - the saddest things is when you see these - the saddest things is when you see these students and the worst is they're really students. And the worst is they're really students. And the worst is they're really good. And I mean, I've met so many of them good and I mean, I've met so many of them good. And I mean, I've met so many of them and I feel so badly for them. But it - and I feel so badly for them. But it - and I feel so badly for them, but it gives me more inspiration because I'm gives me more inspiration because I'm gives me more inspiration because I'm gonna create the jobs, they can't get a gonna create the jobs, they can't get a gonna Create the jobs, they can't get a job when they graduate, they can't get job when they graduate, they can't get job. When they graduate, they can't get jobs and we're gonna change that around jobs and we're gonna change that around jobs. And we're gonna change that around when they go through college and they do when they go through college and they do when they go through college and they do a good job and especially for the good - a good job and especially for the good - a good Job and especially for the good students, you know, you have students that students, you know, you have students that students, you know you have students that work really hard to be good students and work really hard to be good students and work really hard to be good Students and then they can't - they come out, they come, then they can't, they come out, they come, then they can't, they come out, they come out and they can't find anything they out and they can't find anything they out and they can't find anything. They don't know what to do and then they owe - don't know what to do and then they owe, don't know what to do. And then they owe money to the federal government than to money to the federal government than to money to the federal government than to everybody else. And they've done everybody else and they've done everybody else and they've done everything they can to get through that. Everything they can to get through that, everything they can to get through that college. We're gonna - we're gonna start college, we're gonna, we're gonna start college, we're gonna, we're gonna start winning in this country and we're gonna winning in this country and we're gonna winning in this country and we're gonna start start Start helping them now we got ta help them out, helping them now we got ta help them out, helping them. Now we got ta help them out. You know, I always talk about the vets, you know, I always talk about the vets. You know, I always talk about the vets and everybody knows I have a great vet and everybody knows I have a great vet and everybody knows I have a great vet plan. Nobody treated worse than the vets plan. Nobody treated worse than the vets plan. Nobody treated worse than the vets. Illegal immigrants are treated better, illegal immigrants are treated better, illegal immigrants are treated better than our vets. I'm telling you, no. It's than our vets. I'm telling you, no, it's than our vets, I'm telling you, no, it's - it's - they're being treated better than it's - they're being treated better than it's - they're being treated better than our vets and that's gonna end. We're our vets and that's gonna end. We're our vets and that's gonna end. We're gonna treat our vets, we're gonna treat gonna treat our vets, we're gonna treat gonna treat our vets, we're gonna treat on that square and I put it in a policy on that square. And I put it in a policy on that square and I put it in a policy plan a couple of weeks ago. I was on a plan a couple of weeks ago. I was on a plan a couple of weeks ago. I was on a great, great ship and we would - it was an great, great ship and we would - it was an great, great ship and we would - it was an amazing day on the Wisconsin and we put amazing day on the Wisconsin and we put amazing day On the Wisconsin and we put on the battleship, I say, can we use this on the battleship, I say, can we use this on the battleship? I say, can we use this? Look at the ship, you can't build them. Look at the ship, you can't build them, look at the ship, you can't build them like this anymore. They sort of didn't like this anymore. They sort of didn't like this anymore. They sort of didn't give me the answer because that looks, give me the answer because that looks, give me the answer because that looks like an awfully, I love renovating you like an awfully, I love renovating you like an awfully, I love renovating, you know, I love Buying a building, the know I love buying a building, the know I love buying a building, the foundations, are there, the structures, foundations, are there, the structures, foundations, are there the structures there, the outside is there have to there the outside? Is there have to - there the outside is there have to replace Windows? Sometimes if you can replace Windows, sometimes if you can replace Windows, sometimes if you can keep them, you keep them like I'm doing, keep them, you keep them like I'm doing, keep them, you keep them like I'm doing the old post office in Washington way the old Post office in Washington way the old post office in Washington way. Yeah, you know, yeah, that's right. You - yeah, you know, yeah, that's right. You - yeah, you know, yeah, that's right. You people would know it. One of the most people would know it, one of the most people would know it. One of the most beautiful buildings in Washington was a beautiful buildings in Washington was a beautiful buildings in Washington was a disaster for 30 years, put it out to bid disaster for 30 years, put it out to bid disaster for 30 years, put it out to bid. Think of it in the Obama administration, think of it in the Obama administration, think of it in the Obama administration, Trump got it, can am ia good deal maker, Trump got it, can am ia good deal maker Trump got it, can am ia good deal maker? Okay. One of the most sought-after, okay, one of the most sought-after, okay, one of the most sought-after properties in the history of the properties in the history of the properties in the history of the government services, you know, GSA and government services, you know, GSA and government services. You know GSA and we're now under budget and ahead of we're now under budget and ahead of we're now under budget and ahead of schedule. Think of that that's what you schedule think of that. That's what you schedule think of that, that's what you want in the country. That's what you want want in the country. That's what you want want in the country. That's what you want in the country and it's gonna be one of in the country and it's gonna be one of in the country and it's gonna be one of the best hotels anywhere in the world, the best hotels anywhere in the world. The best hotels anywhere in the world, the the open, we're calling it, if you the the open, we're calling it, if you the the open, we're calling it, if you don't mind, Trump International, I didn't - don't mind Trump International, I didn't - don't mind Trump International, I didn't Want to keep it, the OPA somebody said, want to keep it. The OPA somebody said, want to keep it. The OPA, somebody said well, we have to keep the name the well, we have to keep the name the well. We have to keep the name. The government, they were saying we have to government, they were saying we have to government, they were saying we have to keep the name of the old post offices, keep the name of the old post offices, keep the name of the old post offices. But it's not a post office Hotel we have, but it's not a post office Hotel we have, but it's not a post office Hotel. We have to change it. But I will tell you and to change it, but I will tell you and to change it. But I will tell you and I've dealt with the GSA and they're - I've dealt with the GSA and they're - I've dealt with the GSA and they're really terrific people that you really, really terrific people that you really, really terrific people that you really have some - you know, You have some great - have some, you know, you have some great have some, you know, you have some great people in government. You really do. If we people in government, you really do. If we people in government, you really do, if we can be led properly, this country is can be led properly. This country is can be led properly. This country is gonna go to a level that you won't even gonna go to a level that you won't even gonna go to a level that you won't even believe. You know, I've been saying over believe. You know, I've been saying over believe, you know, I've been saying over the last two months because I've met so the last two months because I've met so the last two months because I've met so many people like yourselves and it's many people like yourselves. And it's many people like yourselves and it's really similar. There's so much love in really similar. There's so much love in really similar. There's so much love in the room, but I've met so many people and the room. But I've met so many people and the room. But I've met so many people and I've seen the - the genius, I've seen the - the genius, I've seen the - the genius of these people and I've been saying of these people and I've been saying of these people and I've been saying we're not only gonna make Our country, we're not only gonna make our country, we're not only gonna make our country great. Again, we're gonna make it in my great. Again, we're gonna make it in my great. Again, we're gonna make it in my opinion, opinion, opinion. I really think we have the potential do I really think we have the potential? Do I really think we have the potential do it greater than ever before. I really it greater than ever before. I really it greater than ever before. I really believe it and we'll make it great and believe it and we'll make it great and believe it and we'll make it great and we'll build it up and we'll make it rich, we'll build it up and we'll make it rich, we'll build it up and We'll make it rich again, here's somebody, a woman came up to again, here's somebody, a woman came up to again, here's somebody, a woman came up to me, said mr. Trump, that's a little crass me said. Mr. Trump, that's a little crass me said. Mr. Trump, that's a little crass to say, rich, I got ta make it rich. We're a to say, rich, I got ta make it rich. We're a to say, rich, I got ta make it rich. We're a debtor nation right now. Debtor nation right now debtor nation right now, she said I'm voting for you. Mr. Trump, I - she said I'm voting for you. Mr. Trump, I - she said I'm voting for you. Mr. Trump, I love you, I love you, but please don't say love you, I love you. But please don't say love you, I love you, but please don't say we're gonna make it rich. Mr. Trump, it's - we're gonna make it rich. Mr. Trump, it's - we're gonna make it rich. Mr. Trump, it's Chris. I said I have to say it, I have to - Chris, I said I have to say it, I have to Chris, I said I have to say it. I have to be truthful. We're gonna save Social, be truthful, we're gonna save Social, be truthful. We're gonna save Social Security, we're not gonna cut Social Security. We're not gonna cut Social Security. We're not gonna cut Social Security. We're not gonna cut Medicare Security. We're not gonna cut Medicare Security. We're not gonna cut Medicare. You know, Carson wants to cut Medicare. He, you know, Carson wants to cut Medicare. He, you know, Carson wants to cut Medicare, he wants to get rid of Medicare Z, you know, wants to get rid of Medicare Z, you know wants to get rid of Medicare Z. You know it's actually a program that works great. It's actually a program that works great. It's actually a program that works great. Now you have waste fraud, abuse in Social, now you have waste fraud, abuse in Social. Now you have waste fraud, abuse in Social Security and Medicare will take care of Security and Medicare will take care of Security and Medicare will take care of that will have property. But you're not - that will have property, but you're not - that will have property but you're not gonna be cut, you've been paying into gonna be cut, you've been paying into gonna be cut, you've been paying into your plans, you've been paying into your plans. You've been paying into your plans. You've been paying into Social Security for years now. They're Social Security for years now. They're Social Security for years now they're coming up to you. It's getting to be that coming up to you. It's getting to be that coming up to you. It's getting to be that time me. I don't want this Social time me. I don't want this Social time me. I don't want this Social Security, okay, but it's getting to be Security, okay, but it's getting to be Security, okay. But it's getting to be that time where you're gonna need it and that time where you're gonna need it and that time where you're gonna need it. And I think it's unfair after all these, I think it's unfair after all these. I think it's unfair after all these years, they want to cut you years. They want to cut you years. They want to cut you. Governor Christie wants to wants to Governor Christie wants to wants to Governor Christie wants to wants to raise the age so that you have to wait, raise the age so that you have to wait, raise the age so that you have to wait another, you know, pretty Extended period another, you know, pretty extended period another you know, pretty extended period of time. It's not fair. You've been - you've of time, it's not fair. You've been - you've of time, it's not fair. You've been - you've been paying in for use, we're gonna take been paying in for use. We're gonna take been paying in for use. We're gonna take money back from all these countries that money back from all these countries that money back from all these countries that have been just absolutely eating our - have been just absolutely eating our - have been just absolutely eating our lunch. We're gonna have so much money, so lunch we're gonna have so much money. So lunch we're gonna have so much money. So I said to the woman I said, you know what I said to the woman I said, you know what I said to the woman I said you know what, it may be Chris, but I have no choice. It may be Chris, but I have no choice. It may be Chris, but I have no choice. We're gonna be so rich and we're gonna, we're gonna be so rich and we're gonna, we're gonna be so rich and we're gonna what we're going to do and you're - what we're going to do and you're - what we're going to do. And you're talking about tremendous money, don't talking about tremendous money, don't talking about tremendous money. Don't forget when a China - when you have forget when a China - when you have forget when a China - when you have imbalances of four hundred, four hundred imbalances of four hundred, four hundred imbalances of four hundred, four hundred and fifty billion billion not million and fifty billion Billion not million and fifty billion billion not million for 450 million wouldn't be good, right for 450 million wouldn't be good, right for 450 million wouldn't be good, right, how about four hundred and fifty billion, how about four hundred and fifty billion, how about four hundred. And fifty billion a year, a year and then they say, oh, a year a year and then they say, oh, a year a year and then they say, oh, that's terrible, that's terrible, that's terrible. I am a free trader, I believe in free. I am a free trader, I believe in free. I am a free trader, I believe in free trip. It has to be smart trade. We can't trip. It has to be smart trade. We can't trip. It has to be smart trade. We can't be stupid people, right. So they said all be stupid people, right? So they said all be stupid people, right? So they said all Trump isn't a free trader. He's not all. Trump isn't a free trader, he's not all. Trump isn't a free trader, he's not all is terrible. I said no, no, I'm a free is terrible. I said no, no, I'm a free is terrible. I said no, no, I'm a free trader, but one for years. We have a trade trader, but one for years we have a trade trader, but one for years. We have a trade imbalance with China of over 400 billion imbalance with China of over 400 billion imbalance with China of over 400 billion every year, every year, every year that's called dumb trade, that's not that that's called dumb trade. That's not that that's called dumb trade. That's not that we have to be and then the head of China we have to be and then the head of China we have to be and then the head of China comes and poor Obama. So said he greets comes and poor Obama. So said he greets comes and poor Obama so said he greets him with a state dinner, I state for what him with a state dinner. I state for what him with a state dinner. I state for what and he talks about our partner. Well, I - and he talks about our partner well, I - and he talks about our partner. Well, I want to be a partner too, if I can be a - want to be a partner too, if I can be a - want to be a partner too. If I can be a partner where I'm making four hundred to partner where I'm making four hundred to partner where I'm making four hundred to four hundred and fifty billion dollars I four hundred and fifty billion dollars I four hundred and fifty billion dollars. I agree, agree, agree and the guy in China, they had been a - and the guy in China, they had been a - and the guy in China, they had been a good looking guy strong as hell in a good looking guy, strong as hell in a good looking Guy strong as hell in a different system over there that's like different system over there that's like different system over there. That's like one of these system. You keep counting one of these system. You keep counting one of these system, you keep counting each other and the toughest smartest guy, each other and the toughest smartest guy each other and the toughest, smartest guy gets up to the top. We don't do that over, gets up to the top. We don't do that over - gets up to the top. We don't do that over here here here. That's assist. I mean, I don't know if you - that's assist. I mean, I don't know if you - that's assist. I mean I don't know if you know how it works from the time they're know how it works from the time they're know how it works from the time they're in kindergarten, the smartest, the in kindergarten, the smartest, the in kindergarten, the smartest, the toughest, the smartest. The toughest but toughest the smartest, the toughest, but toughest the smartest, the toughest. But by the time they get up to that little by the time they get up to that little by the time they get up to that little point that guy is tough. So he's looking point that guy is tough, so he's looking point that guy is tough. So he's looking at Obama talking about this wonderful at Obama talking about this wonderful at Obama talking about this wonderful relationship we have, he's building relationship, we have, he's building relationship. We have - he's building Islands, military islands in the South Islands, military islands in the South Islands, military islands in the South China Sea. I don't think he got an China Sea. I don't think he got an China Sea. I don't think he got an environmental impact statement. Do you do environmental impact statement? Do you do environmental impact statement? Do you - do you think they went out and said, oh, we you think they went out and said, oh, we you think they went out and said oh, we have to do. Our environmental impact said, have to do our environmental impact said, have to do our environmental impact said no, they just put about 300 excavators. No, they just put about 300 excavators. No, they just put about 300 excavators out there and they started digging that out there. And they started digging that out there and they started digging that ocean and drop in that sand now and by ocean and drop in that sand now and by ocean and drop in that sand now. And by the way, I heard this the other day and I the way I heard this the other day and I the way I heard this the other day and I don't choose two things I've been saying don't choose. Two things I've been saying don't choose. Two things I've been saying bombed the oil and keep it now I didn't bombed the oil and keep it now I didn't bombed the oil and keep it. Now I didn't want to go into Iraq. I should get credit want to go into Iraq. I should get credit want to go into Iraq. I should get credit for vision and I'm more militaristic for vision and I'm more militaristic for vision and I'm more militaristic than anybody other than him anybody in than anybody other than him anybody in than anybody other than him anybody in this room. Now this guy looks like a this room now this guy looks like a this room now this guy looks like a seriously, he looks like a warrior. But seriously he looks like a warrior. But seriously he looks like a warrior, but I'm more militaristic than anybody in. I'm more militaristic than anybody in - I'm more militaristic than anybody in this room, but I want to build that this room. But I want to build that this room. But I want to build that military so strong. But I've been saying military so strong, but I've been saying military so strong, but I've been saying don't go into Iraq and in 2003 or for a don't go into Iraq and in 2003 or for a don't go into Iraq and in 2003 or for a delegation Came from the White House delegation came from the White House delegation came from the White House because they get a lot of publicity for because they get a lot of publicity for because they get a lot of publicity for whatever even as a developer. Then I do. Whatever, even as a developer, then I do whatever, even as a developer, then I do the apprentice, that was a huge hit by the apprentice. That was a huge hit by the apprentice. That was a huge hit. By the way, they wanted to extend me. They - the way they wanted to extend me, they the way they wanted to extend me. They came in. Steve Burke, the head of Comcast came in Steve Burke, the head of Comcast, came in Steve Burke, the head of Comcast. An incredible guy came to my office with an incredible guy, came to my office with an incredible guy, came to my office with executives from NBC executives, from NBC executives, from NBC and they want to extend me. I said Steve and they want to extend me. I said Steve and they want to extend me, I said Steve, I want to run for president. He said no, I want to run for president. He said no, I want to run for president. He said no, no, we want to extend you and nobody. No, we want to extend you and nobody, no, we want to extend you and nobody thought. I was gonna run. Nobody he said thought I was gonna run. Nobody he said thought I was gonna run, nobody, he said no, no. And they announced they're going no, no, and they announced they're going no, no. And they announced they're going to extend the apprentice with me and to extend the apprentice with me and to extend the apprentice with me. And that would be season 15 and 16. I mean that would be season 15 and 16, I mean that would be season 15 and 16. I mean, you know it's been a great hit and I, you know it's been a great hit and I, you know it's been a great hit and I said no, I don't want to do that. And I said, no, I don't want to do that. And I said, no, I don't want to do that and I just held my breath, you know the famous just held my breath, you know the famous just held my breath, you know the famous escalator scene, right. I held my breath I escalator scene right. I held my breath, I escalator scene right. I held my breath. I said to my wife, ha, are you sure I want said to my wife ha, are you sure I want said to my wife ha, are you sure I want to be doing this. And I said, let's go and to be doing this and I said let's go and to be doing this and I said let's go and we went down that escalator and we stood - we went down that escalator and we stood - we went down that escalator and we Stood you never saw it looked like the Academy, you never saw it looked like the Academy, you never saw it looked like the Academy Awards, the press, the press, I mean even Awards, the press, the press - I mean even Awards the press, the press. I mean, even now look, look at tonight, it's - it's so now look, look at tonight, it's - it's so now look, look at tonight, it's - it's so many cameras back there. The other thing many cameras back there, the other thing many cameras back there. The other thing I look at all those red lights, every I look at all those red lights, every I look at all those red lights, every word, every word, no. Think of it every word, every word, no. Think of it every word, every word. No. Think of it every word, but you know it's - it's an amazing word, but you know it's - it's an amazing word, but you know it's - it's an amazing things I said to my wife come on. Let's things I said to my wife come on. Let's things I said to my wife come on, let's go and she way beautifully, you know in go and she way beautifully, you know in go and she way beautifully. You know in the Escalade I was waving and then I - the Escalade I was waving and then I - the Escalade I was waving and then I went up, I talked about illegal went up, I talked about illegal went up, I talked about illegal immigration and little. Did I know I was immigration and little, did I know I was immigration and little did I know I was hitting a nerve that was so incredible hitting a nerve that was so incredible hitting a nerve that was so incredible. And I'm telling you, had I not made that and I'm telling you, had I not made that and I'm telling you, had I not made that speech and I not talk about what's speech and I not talk about what's speech and I not talk about what's happening Cuz after that you had Jamil happening cuz after that you had Jamil happening cuz. After that you had Jamil killed, which he was this wonderful man killed, which he was this wonderful man killed, which he was this wonderful man. You saw his father probably over the - you saw his father probably over the - you saw his father probably over the last couple of days on television last couple of days on television last couple of days on television. Viciously shot for no reason whatsoever viciously shot for no reason whatsoever. Viciously shot for no reason whatsoever, right off the sidewalk shot and then you right off the sidewalk shot and then you right off the sidewalk shot. And then you see Kate in San Francisco shot by an see, Kate in San Francisco shot by an see, Kate in San Francisco shot by an illegal immigrant. And you see all of the illegal immigrant and you see all of the illegal immigrant. And you see all of the tremendous crime and all of a sudden tremendous crime and all of a sudden tremendous crime and all of a sudden people stopping. Did I take abuse, rush, people stopping? Did I take abuse, rush, people stopping? Did I take abuse rush? Limbaugh said nobody's ever taken more limbaugh said nobody's ever taken more limbaugh said nobody's ever taken more incoming than Trump. I was saying if this incoming than Trump, I was saying if this incoming than Trump, I was saying if this is gonna be like this, I don't know if I is gonna be like this. I don't know if I is gonna be like this. I don't know if I can last for a year and a half, this is a can last for a year and a half. This is a can last for a year and a half. This is a lot of incoming. I never heard that term lot of incoming. I never heard that term lot of incoming, I never heard that term with respect to the press or the PR, but with respect to the press or the PR. But with respect to the press or the PR, but Rush Limbaugh said, I've never seen a man Rush. Limbaugh said I've never seen a man Rush. Limbaugh said I've never seen a man take incoming like that and then he has take incoming like that. And then he has take incoming like that and then he has a news conference and he doubles down a news conference and he doubles down a news conference and he doubles down. And he said I'm right about it. I've said and he said I'm right about it. I've said and he said I'm right about it, I've said of somebody else now it's sort of strength because I know now it's sort of strength because I know now it's sort of strength because I know how it works. You got to be smart, you got how it works, you got to be smart, you got how it works. You got to be smart, you got to be tough, somebody else would have to be tough, somebody else would have to be tough. Somebody else would have gone up and other people have sentence gone up and other people have sentence gone up and other people have sentence. I'd like to apologize. Is there any way I - I'd like to apologize, is there any way I - I'd like to apologize, is there any way I can apologize to the people for them, you can apologize to the people for them. You can apologize to the people for them. You can't do that when you're right, you're can't do that when you're right, you're can't do that when you're right, you're right, you're right, you got to stick with right? You're right, you got to stick with right? You're right, you got to stick with it. But I said, I - I said at this level of it, but I said I - I said at this level of it, but I said I - I said at this level of intensity, there's no way any human being intensity. There's no way any human being intensity. There's no way any human being - can make it for a year, but all of a can make it for a year, but all of a can make it for a year. But all of a sudden people started seeing - I was right sudden people started seeing, I was right sudden people started seeing, I was right and if I didn't bring that up, but if I - and if I didn't bring that up, but if I - and if I didn't Bring that up, but if I didn't take all of that, unbelievable didn't take all of that. Unbelievable didn't take all of that unbelievable harsh and unfair punishment from the harsh and unfair punishment from the harsh and unfair punishment from the mainstream media, mainstream media mainstream media. I'll tell you what we would make me. I'll tell you what we would make me. I'll tell you what we would make me talking about illegal immigration. We talking about illegal immigration. We talking about illegal immigration. We wouldn't be talking about the crime and wouldn't be talking about the crime and wouldn't be talking about the crime. And don't kid yourself, I don't mention it, don't kid yourself. I don't mention it, don't kid yourself. I don't mention it that often because I'm really good at that often because I'm really good at that often because I'm really good at this stuff. But the jobs that are being this stuff, but the jobs that are being this stuff, but the jobs that are being taken away from people that are in our - taken away from people that are in our - taken away from people that are in our country, we're losing Tremendous numbers country, we're losing tremendous numbers country we're losing tremendous numbers of jobs. So we're gonna change that whole of jobs. So we're gonna change that whole of jobs. So we're gonna change that whole system. It's gonna be changed. Remember system, it's gonna be changed. Remember system it's gonna be changed. Remember this, you know, you have to get points for this, you know, you have to get points for this. You know, you have to get points for vision when you elect somebody and I vision when you elect somebody and I vision when you elect somebody and I think I have everybody in this room. I'm think I have everybody in this room. I'm think I have everybody in this room. I'm pretty sure do I have everybody, I think pretty sure do I have everybody? I think pretty sure do I have everybody I think so. I mean, you know I leave these places. So I mean, you know, I leave these places. So I mean you know I leave these places and they say, well they're there because - and they say well they're there because - and they say, well they're there because he's a great entertainer. I'm not here to - he's a great entertainer. I'm not here to - he's a great entertainer. I'm not here to entertain folks. I'm not an entertainer entertain folks. I'm not an entertainer entertain folks. I'm not an entertainer - I'm not an entertainer, but a lot of - I'm not an entertainer but a lot of - I'm not an entertainer but a lot of thing. You know outreach, sir is like the thing you know outreach, sir is like the thing you know outreach, sir. Is like the people in the room are there because he people in the room are there because he people in the room are there because he is a wonderful show and a wonderful is a wonderful show and a wonderful is a wonderful show and a wonderful entertainer And that's not the reason entertainer and that's not the reason entertainer and that's not the reason you here. Yeah, here to vote. Please don't you here. Yeah, here to vote. Please don't you here. Yeah, here to vote. Please don't - don't waste my time with the don't waste. My time with the don't waste my time with the entertainment stuff, okay? I'm not an entertainment stuff, okay. I'm not an entertainment stuff, okay. I'm not an entertainer - believe me, I'm somebody that entertainer, believe me, I'm somebody that entertainer, believe me, I'm somebody that knows how to get things done. I'm a guy knows how to get things done. I'm a guy knows how to get things done. I'm a guy that's won all my life, whether it's The - that's won all my life, whether it's The - that's won all my life, whether it's The Apprentice or whether it's business or Apprentice or whether it's business or Apprentice or whether it's business or whether it's the art Of the deal, what - whether it's the art of the deal, what - whether it's the art of the deal, what are the most incredible one of the - are the most incredible one of the - are the most incredible one of the biggest selling business books of all biggest selling Business books of all biggest selling business books of all time, I think the biggest, but I want to time I think the biggest, but I want to time I think the biggest, but I want to say one of the good - if it's three short, say, one of The good - if it's three short, say one of the good, if it's three short, I'll get killed if I say thee, but I - I'll get killed if I say thee, but I - I'll get killed if I say thee, but I think it is the biggest selling business. Think it is the biggest selling business, think it is the biggest selling business book. I mean that's what I do. We got a book, I mean that's what I do. We got a book, I mean that's what I do. We got a win, we can win together. One of the win we can win together, one of the win we can win together. One of the things vision I've been saying right, things vision, I've been saying right, things vision, I've been saying right. Thank you. I'll take the oil, take the oil. Thank you. I'll take the oil, take the oil, thank you. I'll take the oil, take the oil, we shouldn't have been there. Iraq, Iran, we shouldn't have been there. Iraq, Iran, we shouldn't have been there. Iraq, Iran fighting, fighting, fighting their whole fighting, fighting, fighting their whole fighting, fighting fighting their whole lives. Everyone there was tight lives. Everyone, there was tight lives. Everyone there was tight, they love to fight. We want to rebuild, they love to fight, we want to rebuild, they love to fight. We want to rebuild our country right fight, fight, fight our country right fight, fight, fight our country right fight fight, fight. We built a gas station, did you see the - we built a gas station, did you see the - we built a gas station, did you see the care station costs, 43 million dollars, care station costs, 43 million dollars, care station costs, 43 million dollars and then it didn't Work, okay, okay. And then it didn't work. Okay, okay. And then it didn't work. Okay, okay. And yet if we want to spend $ 2 in this and yet if we want to spend $ 2 in this and yet if we want to spend $ 2 in this country, we don't have any money. If we country we don't have any money. If we country we don't have any money if we want to build a school for his children, want to build a school for his children, want to build a school for his children. We don't have any money if we want to. We don't have any money. If we want to, we don't have any money if we want to fix up our roads that decrepit our fix up our roads that decrepit our fix up our roads that decrepit our bridges are falling down in China, bridges are falling down in China, bridges are falling Down in China, they're building bridges all over the - they're building bridges all over the - they're building bridges all over the place, okay? So I said take the oil and place, okay. So I said take the oil and place, okay. So I said take the oil and keep it, we shouldn't have been in Iraq, keep it. We shouldn't have been in Iraq, keep it. We shouldn't have been in Iraq, but take the oil because you."}