{"id":490,"author":"Donald Trump","title":"Speech: Donald Trump in Macon, GA","date":"2015-11-30","link":"https://factba.se/transcript/donald-trump-speech-macon-ga-november-30-2015","paragraphs":["Thank you very much. What an incredible group of people. Beautiful. And you know, no matter where we're going now everybody wants to see greatness for our country. We want to bring it back. It's the same. Everybody loves each other. I'll tell you, we left so many places. I mean, we go New Hampshire, we go Iowa, we go South Carolina, we go to Virginia, we go -- no matter where we go -- Dallas -- no matter where we go, it's the same thing.","There's so much love in the room. It's easy to do this. It really is. It's easy to do. It's easy. Amazing. It's amazing. I want to thank Herman Cain, my friend, for his wonderful remarks. He's really a good guy. nine nine nine, right? Nine nine nine. Wherever Herman, is. Thank you, Herman. And you know we had a meeting today that was amazing.","We had the African-American pastors. So many came up to Trump Tower. It was like one of the most inspiring meetings. It was an unbelievable -- the love they have for the people that they represent, and people generally, was incredible. And I just want to tell you, they left Trump Tower. I then immediately got on the plane and I felt very inspired.","It was a really terrific day. So -- and Bruce is here. Where there is Bruce? Bruce LeVell. Where is Bruce? Bruce, get over here, Bruce. You know Bruce? You don't know. Bruce. Come on, Bruce. Bruce. Bruce. All right, now get the hell out of here.","Thank you, Bruce, Pastor. Thank you. That was very nice. But we met with many, many pastors, and it was just great. So as you can see, the people are still pouring out. Now we could get all of these people coming in right now if you'd like to wait for 45 minutes before we start. You want to do that? I had a feeling you were going to say that.","I had a feeling. It's been going amazingly well. You do have the mainstream here. You know, I've been hearing about mainstream media all my life -- boo, boo. No, I've been hearing about it, and it's true. I mean, they don't give you accurate really representation. It's an amazing thing. They don't do it. They don't do it. You know, I constantly talk about the cameras.","They never show the crowds. They never show the crowds. My wife is always disappointed. Darling, you must not have had a good crowd tonight. But now, after about three or four times, she understands they never want to show the crowd. They never want to fan the cameras. It's an incredible thing. Can you do it maybe once?","Fan the cameras. Fan them over. Fan them over. You know, I should be happy. It's focused on my face. They never move it. Nobody knows what's going on because you really don't. They don't want to -- I mean, it sounds crazy. They don't want to show the kind of response we're getting. So we had 12,000 people.","We had 12,000 in Sarasota, Florida on Saturday, in an afternoon during football games, 12,000. Biggest crowd ever. They've never had a crowd even close. The arena held six. We had six outside, six inside. I made two speeches, and nobody knew that. They don't talk about. So that's OK. Here's the story. Here's what's important.","Here's what's important. We're winning in every single category. Every category. We're winning every single poll. Fox just came out. We're beating Hillary Clinton even head to head by a lot. And I have to tell you, we're beating her by a lot. But she does -- and there's people going to say, oh, that's not a nice thing to say.","Who cares? We can't afford to be so nice, folks. We don't have the options. You know, for a while we had options. We could mess it up. We don't have the options. We've got to get it right. She doesn't have the strength or the stamina to be president. She just doesn't. She doesn't. I know her. You ever notice, she'll got in one of these things and she'll do something, and it's by the way, the crowds are like -- the crowds are like 200 people.","We were in New Hampshire, actually, a part of Massachusetts. We're at 48%. You know why? Because Tom Brady likes me What can I tell you. I think so. If Tom Brady likes you, you're in pretty good shape in Massachusetts. But we have 48% in the poll in Massachusetts, and we're landing -- and Hillary is nearby, and she's going past.","And we had all of the police in Massachusetts give us a motorcade. You never saw anything like it. It was like 50 motorcycles. That's the most incredible -- I actually said, why do I have to be president? No president ever had a motorcade like we just got. And Hillary -- we had 4,500 people. And right next door, meaning ten miles up the road, Hillary had about 200 people.","It was -- that's the way it is. That's the way it is. And I'll tell you, this just came out. I don't know if the other networks to keep their thing going, but I might as well. CNBC and CNN, they were pretty lousy. That guy John Harwood was a real stiff, wasn't he? What a dope. What a dope he was. He was so nice to me for three four weeks.","Oh, yes, Mr. Trump. Oh Mr. Trump, we look so forward, we look so forward to having you. And then he reads his questions, such a nasty -- and I said, what a nasty question, right? So they're just a bunch of phony people. But when it comes to this, I'll say it's good, because I only it's good news. So good news, they're not phony.","All right so this was CNBC. So it's staying home. And it says for the frontrunner, 75% Republicans polled -- basically, you see the charts. And that if Trump runs, far more people are going out to vote in the election. Far, far. Then it says, no matter -- I have no glasses on, but these are minor details.","I didn't want to put the glasses on. Does it make sense? Shall I put them on? No. They all say, no, don't do it. Don't do it. OK. I'm going to do it without. No matter what party affiliation you consider, Trump brings them out. This is CNBC. Republicans, Democrats, and independents are almost likely to show up if Trump is on the ballot.","In our analysis we assume constant variables the Democrats nominating Hillary, which is going to happen, unfortunately, or fortunately. I'd actually rather run against her. She has done such a lousy job. You know -- you know what her legacy is going to be? The greatest job that she has ever done will be getting out of the email scandal, assuming that happens.","It's true. That will be her greatest achievement. You see all the classifieds today? They have thousands. How does a person have that many e-mail? They have 3,000, here, five -- how do you have that many emails anyway? But they have thousands of classified today. It's disgusting. Because frankly, she shouldn't be allowed to run.","She shouldn't be. But the Democrats are protecting her. She's being fully protected, as the expression goes. And by the way, we can't tell any more jokes. You know, every time I kid and tell jokes, these guys put on like, you know, a little segment. Like the belt, right, the belt. You know what I'm talking -- I told you about Carson and how it doesn't work that way if you hit.","And I went into it like a whole big thing, can't be possible, the belt will twist. So I'm going through this thing like for three minutes, then I pull over to this side, and they start showing the belt. And I start showing it very strong, very nice, you know, but it's a part of a holster. They never show anything.","Just that two or three second clip. I'm playing with my belt and people don't know what the hell you're doing. It's unbelievable. And then I talked about -- the other day I talked about a reporter who changed his story. He changed his story. And I go into this very highly exaggerated phase of changing the story.","They don't say what it's all about. All they do is they show these little snippets. They do whatever they can to make him look best. So what I'm going to do, I'm not going to tell anymore jokes. I'm not going to kid. Oh, you want me to? You want me to? OK. OK, so I will. Just as long -- no it's true. And then my opponents do commercials where they take a two-second snippet.","These are really dishonest people. Like this guy Kasich. He did a commercial. Total stiff a bit. I'm beating him in Ohio by a lot, and he's the governor of Ohio. No, it's terrible. They say something to the effect that kind of people -- I was talking about Carson, and I said that he had a certain problem, right?","We don't have to go into it. OK, I will. No, I said he had a certain pathological problem now. Now, he wrote it, I didn't write it. And he said he suffers from pathological disease, OK? That's a serious problem. Don't we have enough problems in this world? And I said, essentially, the people of Iowa can't be that stupid.","And then I said, the people of the United States, something to the effect, can't be that -- in other words, talking about everybody. How can you vote for somebody with a problem like that? I'm not even talking about going after the mother with a hammer. I'm not talking about hitting his friend in the face with a lock.","And I'm not talking about that total nonsense about, boom, into his stomach, and the belt saved it. OK. OK. I'm not talking about those, I said I'm not going to mention them tonight. So just disregard. It's like you tell before a jury or the judges, please disregard. Oh, OK. We'll disregard. So what happens, what happens, is Kasich does a commercial.","But he only puts up the first part. He doesn't put up the second about all the people in the United States. They take little snippets. These a horrible people, horrible people. Interestingly, in the same poll, not that I care about Kasich. I think he's got 1%, but Kasich does the worst. You know, it's funny when people come after me, they've gone down the tubes.","You look at Kasich. Now, before that, Jindal he was vicious. Bobby Jindal. Alfred E. Newman, I call him. No, it's true. Think of it. He was vicious. He was so vicious, he was going after me. I said, I don't even know this guy. And then you had Perry, the nicest guy from Texas. He had a problem. You know, one of the worst debate performances in the history of debates.","That was a debate performance you can never, ever live down. But all of a sudden, he became vicious. He goes to Washington to make a major speech on me. I said, what did I do? Because they wanted to pick up. He goes down. Lindsey Graham. I mean, this poor guy No. ,No. The poor guy. Think of it. He's a U.S. senator.","And in South Carolina. I was at 32 or 38, and he was a 2 or 3, and he's a sitting senator. How about Florida? How about Florida? In Florida, I'm at 32 and 28, very high numbers. And a governor, Bush. I mean, honestly? It's over. So many commercials. I can't watch them. He spent millions and millions of dollars -- I've spent nothing.","I haven't done a commercial. I actually felt badly. No. I actually felt badly. I did a radio commercial. A small one, because the press was killing me. Why aren't you doing more commercials? Why, why, why? They said, you gotta do a commercial. I don't need it, but we got to do a commercial. So we did actually a pretty good radio commercial.","We're going to be doing a lot of commercials actually, I think. Actually, we're going to be doing most of the commercials, that if somebody hits me, I'm going to hit them back so hard. Oh. Oh. You have no idea. We're going to hit them back 10 times harder than they ever, which is what we should be doing with ISIS and everybody else.","OK. Incredible. It's so cute. These people that are pouring in, in the back, they don't know what they're missing, do they? They don't know. So so many things. But Lindsey Graham, disaster. Perry, disaster. All like disasters. Think of this. And a friend of mine said, you know, so far -- Christie hasn't hit me yet.","He will. He has to he's no choice. He's a two or three, he's got to hit me. At some point, Rubio's got to hit me. Hey, there's only one way you get to the top, and it's all through Trump. Let's face it. They have to. Even, I think, Cruz is going to have to hit me because, you know, he's a nice guy. He's been so support -- everything I said, he supported.","Every single thing I said. And he's been so supportive. But at some point, he's going to have to hit me, right? It's gonna be a sad day, but we will hit back. I promise. I promise. But you look at what's going on, and you look at the world and you see what's happening, and we have to get this right. We can't put a stiff.","We can't put a low-energy person. We can't put people, some of whom I've gotten to know. Some of whom I respect. Some of whom, I really don't respect. Some of whom I don't respect. I look at some of the people that are on the dais. I never debated before. Now in all fairness, every online poll, Drudge was terrific.","He's a terrific guy, by the way, Drudge. But Drudge has a big poll. Hundreds of thousands of people vote after the debates. Time Magazine. I was just on the cover of Time magazine. Believe me. Other than that, I have no power over Time Magazine. Time magazine slate. They will do these poses, like five or six.","So we have the debate. Every single debate. And believe me, hundreds of thousands. I am not telling people to make phone calls, all right? It's an online poll, which I think are actually better in many respects than whether you interview 300 people and they say you're winning. I don't understand 300 people.","I do understand 200,000 people. But I don't understand why the interview 297.3, point three point three is a baby. OK. So I never understood that. But you know what? Whatever it -- I took that at the Wharton School of Finance. I took that whole thing, and it never made sense to me, but I guess it works, because usually, they're right.","Although in the last number of elections they've been wrong. I hope they're right, right. I want them to be right. They got to be right. But you look at these polls, and in the debates I won all the debates. And I'm saying to myself today, CNN I'm coming over. And I told you, we had this great pastors meeting.","This great, great -- I mean, look, the camera just went off from CNN. They know me. I love. I love hitting them. While their cameras on. No, no. I love it. I love it. So CNN gave me the worst story. It was like the meeting never even took place. And it was such a great. It was like a love fest. And I said, that's really unfair stuff.","So maybe how would you like to do this? Fox, for the first debate, ended up with 24 to 25 million people, one of the largest in the history of cable. Maybe the largest show, I think, in the history of cable. CNN had 23 million people. It was the biggest show in the history of CNN. This isn't me. This is from SHOWBIZ.","OK. The biggest ratings in the history of CNN, biggest they cover wars.","They cover -- how about the next debate is with CNN. Now you have to tell me, because I know what they're going to say. They're going to say, oh, Trump is chicken. OK. How about I tell CNN, who doesn't treat me properly. They don't. They just, right? They really don't. Now, I have a lot of respect for some of the people over there, but they don't treat me -- how about I tell CNN that I'm not going to do the next debate, OK? I'll tell you the problem.","You know we discussed -- this a nice thing. When you're really smart. Like really, really, really smart like I am. It's true . It's always been true. But I can do these things extemporaneously so I don't need teleprompters. Like Obama, he walks out. Ladies and gentlemen of Georgia. Ladies and gentlemen, thank you very much.","You know how easy that is? You read for a half hour, and you -- I talk for an hour and a half. And I don't have any of that stuff. But the nice thing is you can be very current. You know, current events. You're not reading a speech, and you have to get speechwriters to change. I mean, I hear things on the airplane coming over.","We could talk about them. But how about we do this with CNN? I won't do the debate unless they pay me $5 million, all of which money goes to the wounded warriors or go to vets. Truth. Truth. I would love to do it. OK. Let me give you the bad. So what will happen is they'll say, oh, Trump is chicken. Well, I've done four of them.","And according to every online poll, I won every one of them. Now when I turn on the television, and I listen to these, you know, the talking heads who are not smart people at all. They call them elite. My education is better than any of them. I'm smarter than they are. Many other people -- no, many other people in the room as smarter as they are.","But the talking heads, I could name them. But actually, a couple of them actually started to come around. So I got to be careful. I can't send them all the way back again. Right. But you know, guys like Karl Rove. He spends hundreds of millions of dollars on campaigns. He wins nothing. He wins nothing. There are some people that are losers.","OK. But how about if we do the -- no, they're losers. They're losers. And that's the problem, we can't have that. We can't have that with the Republican Party. We have to get the right people and we have to win. That's why when I show you this. This poll, it's a Fox poll where I beat Hillary, that's what we have to have.","And I'll be -- I haven't even started on Hillary yet, other than I do say no strength no stamina. But with CNN. So I say $5 million goes to the wounded warrior and the vets. OK. Do we like that? Here's the problem. We're winning by a lot. I say because we're all in this thing. You know, a lot of people say, oh, well Trump's crowd -- they say it over here -- Trump's crowd, it was packed.","We haven't had. I mean, you look at every say. Mark Cuban called up. He want to use my arena, the Dallas Mavericks. I said, what day is it? Thursday. When can I use it? Monday. I said four days. How many seats? 20,000 seats. We filled it up like a day and a half. And he predicted that. He knew it. There's a feeling.","By the way, there's a feeling. But here's the problem. So we're leading and everything. The biggest crowds, by far. So much bigger than Bernie said. You know you always hear about Bernie Sanders, our crowds -- may he rest in peace. You know he had an operation today. I think it was a hernia operation. You know?","You know why? Carrying around too much tax problems, because he's going to tax you. He's going to tax you. But let's not even talk tax problem. He wants to double and triple everyone's -- wants to bring you up to 90%. 90%. And he wants to bring you because he wants to take -- now what happened is Hillary now has gone way left, and she wants to give everybody free everything, except for the people that pay taxes.","You know somebody has to pay. Somebody has to pay, so it's going to be Hillary. But here's the problem. So with CNN, I said, no, I'm not doing it. Their ratings will go down where they would be. You know let's say they would have had a million people. When they have maybe 2 million people, and they have 24, 25 million people.","The case of Fox, 23. So they're expecting a lot a big audience. December 15th. They're advertising it all of -- what I do like, they finally use a beautiful picture of me. Finally. Sometimes, the pictures are so bad. They have my chin pulled back so I look like quadruple chins. They picked worst -- but they picked a good picture.","I'm so happy with them I actually wrote him a letter saying Thank you for the first time in about two years. But here's what happens. I won five million dollars. They were getting four thousand dollars for a 30 second ad for the last debate. They went from $4,000 to approximately $250,000 for a 30 second ad. That's a lot of money.And then if you remember, CNBC extended their debate by one hour two days before.","They said they're extending it because they were making a fortune. They were totally sold out. And who's the one that said, no way, you're not going to do it. I did not, because -- I could stand up there forever. But I said you're not going to do it. And everybody told me. Everybody. This is like the wall.","Believe me we're going to build a wall. Mexico's going to pay for it. Believe me. It's like the wall. Like the wall. Everyone says, oh, you'll never get Mexico to pay for the wall. So what I did, this was CNBC, they're going to make it three hours. I said no one, I can stand up here for twenty five hours.","I can stand up for two days. I don't care. But who the hell wants to watch the same questions over and over and over again, right?. For two and a half three hours. So I said, no way. And I said we're not going to do it. In all fairness, Carson joined in with me. He said, absolutely, I'll go along. And they folded in about two seconds.","That's supposed to be the business network. They folded quick. Quickly. They failed. So with CNN, here's what they'll say. Trump's chicken. He's afraid to debate. He's afraid to debate. And what I don't do, I just hope to Corrie and hope to all of my people, I said I'd love because I watch the story of the past as it was so -- It was so terrible.","It was done by a reporter sitting right back there. No it's true. Who by the way, she wasn't even there. She wasn't in Trump Tower. That's when we had a beautiful news conference with all these pastors and it was like we didn't do anything. I won't mention a name I don't want to make her any more famous than she is. She's not very famous, believe me. But such a -- such a such a disgusting report.","So the problem is they'll say that Trump is chicken now. If you're not leading and you're going nowhere, you have nothing to lose. But wouldn't it be bad. I'm leading the polls. I don't do it. I play cute, because you're playing cute, right? It gets out I'm chicken, which I'm not. One thing I'm not is chicken OK? Every -- remember, every single poll, I won every single poll in the debate.","So all four debates, check it folks. You know I only say what's true, because if I say anything that's even slightly off, the next day, I have headlines. Every single poll. But if I do this it could be he's playing too cute and maybe I don't do well and maybe my real polls, which are the polls we're leading by so much, maybe they go down.","So should I tell CNN that I'm not doing the debate because they treat me really unfairly? And say, but I will do it if you give $5 million to the vets. Well I know where the people in this room. Good. And if they covered my whole remarks good. But they don't want it -- they'll just cover a tiny bit. They won't mention what I just said.","So they give you like three seconds of this if I do it, have a feeling I could face repercussions in the polls. Should I do it or not? I don't know if I wanted to take the chance. I don't know. You know, it's a little it's a little -- OK, we all heard of the Apprentice, right? The Apprentice, one of the great.","I love the Apprentice. So Mark Burnett came up, want to do the Apprentice. Show became a tremendous, tremendous hit. And by the way the head of Comcast, who's a great guy Stebe Bert came to my office just before announced he wanted to renew for a lot of money. I'll pay whatever wanted to renew and I said Steve I think I'm going to run.","I wasn't sure because I wasn't sure until I got down that escalator with my beautiful wife waving. She was more confident than I was up there. But she's waving, and I'm saying ah, yay, yay. Am I going to do this? The bottom of Trump Tower, this massive area, was you couldn't even see any of the marble because there were so many cameras on it and I took a deep breath and I went.","Let's go. And I get it -- and by the way. And in that speech, we announced illegal immigration. We announced a whole pile of things that turned out to be a very, very big deal. A very, very big deal, right? Very big deal. So build a wall. So so what happens. So what happens with The Apprentice is we went on, and they didn't have an option, because everybody said, Well, Trump is going to be. He's not a television star.","They did a one season deal without an option. Very unusual. They didn't want to waste the ink. And critics said, why would anybody want to watch The Apprentice with Donald Trump? And then they said the worst insult I've ever had. This one critic, a total moron, said, women will never watch. You know, unless women watch a show, it can't be successful, because women make up a big part of the audience.","Unless you have big women, and you just can't. The people in television know that. And there's one guy said, why would women ever want to watch Donald Trump on television? Can You believe this? This is when it first came out. In fact, I said to my wife babe, darling, am I that bad? And I said, I've done fine.","But the show goes out, and it starts at No. 10. It goes to No. 8. It goes to No. 5. Anyway, many evenings, the No. 1 show in town became this phenomena. And so what happened is I play chicken, because they didn't have an option. So what happened is NBC came to me, and I read all about Friends, where they made $2 million an episode, and they were -- how many are them?","Five, or something, right? Jennifer Aniston, all of them. And they had like a union, but they made a lot of money per episode. I would have not formed that union. If I were Jennifer, maybe I would have asked for more. But that's OK, she's a team player. So what happens. What happens. I said, I know nothing.","My agent told me don't do The Apprentice in the first place. It's not going to work. So I fired him. I said, you know, the show just went to No. 1. Now I fired my agent. So I'm stuck without an agent. But I read all about these ridiculous salaries that these television stars, and I asked for a tremendous salary.","I said, look, I have the hottest show on television. You remember that season one in particular, the final episode. I think it was second after the Super Bowl, had tremendous numbers of people watching it. And I said, all right, I'll do this myself. This is too simple. And so I asked for a crazy number. And they said no. They turned me down.","And I said, man, I just blew it. And two days later, they called me back. We'll give it to you. OK. And I said, why -- they paid me a -- you saw the money I made on The Apprentice. I had to file it. How much was it? $213 million. Do you believe that? Nobody believes it. I don't believe it. I mean, to be honest, I had to file it. I had to file myself.","Everybody said, well, maybe he's not as big as people think. And you know what's going to happen, and he won't file. Well I filed, and I was much bigger. And by the way, I don't say that -- bigger better, stronger, low debt, tremendous cash flow, numbers that I wouldn't have ever believed even 15 years ago.","I built a great company. The reason I say that isn't for ego. It's because this is the mentality. This is the thinking that we need for our country to make us great again. So just to finish, and then we're going to get back on to that. But just to finish, I said to the head of NBC. Why did you fold? Because I love business.","You know. I love to know why did people fold like little people. Why did they fold? So I said, why did you fold? He said, you know, we weren't. And we started interviewing other people. But in the end, we didn't want to take a chance. OK. And it's the same thing with us. It's the same thing with us. We are going to do something so strong and so bold, but we can't take a chance and pick the wrong president.","We can't pick a woman who is totally embroiled in scandal for her whole life. Whitewater. No. Think of it right. Whitewater was no different. Everybody that studied it, they did a book on it. She should have been indited.. She should have been indited. How about -- wasn't it the cattle futures, the cattle futures, right, where her numbers went up, like she made a massive amount of money in like one week.","And guys that do this professionally all their lives, they've never made that. The whole thing, the whole thing is a scandal. The whole thing is corrupt. It's corrupt. And it has been. You look at the foundation. You look at everything. It's been so bad for so long. We can't do that. We can't get involved in that stuff anymore.","And honestly, it's true. She'll say hello to people. She disappears for five days. I don't disappear for five days. Tomorrow, I'm going someplace. All the time. You know all the time, I'm going. We need tremendous stamina. We need tremendous strength. And this is women, men. You know what I'm talking about.","We need strength. We need stamina. And we need smarts. We don't need just a tough person. Because I know tough guys. I know tough guys. I know tough people. And tough is no good. Tough is no good without the brainpower. You need the brain. You need the brain. But we need to toughness, too. We need General Patton.","We need General Patton. I mean, our armed services today are so politically correct that a guy like General Patton, who is a vicious, ruthless, horrendous human being who cursed and spat and spit in people's faces. Who cares? He was great. And by the way, his troops would go to hell for him. His troops would go to hell.","Mad Dog. His troops would go to hell for him. Or we need General Douglas MacArthur. In the history of West Point, one of the greatest intellects. And he was a totally different type, but he was a guy that only understood winning. That's what he understood. We don't need these guys that I see on television all the time talking about ISIS is very tough.","ISIS is tough. They're 60,000 people. We got them through horrible planning. Horrible planning. That whole thing with Iraq. Again, got to be given points. I said in 2003, 2004, don't go. And now, I am by far -- and we have a lot of vets. I love you, vets. I love you. Lot of vets. We have a lot of vets in this room.","And we're going to take care of our vets. We are going to really take care of our vets. You know, we put in a plan recently -- we're going to take care of our vets. But we have to have people that don't talk. We don't want talkers. We want doers. We want people that know what's happening. I see on television all these generals they're talking about, yes, we're going to do this.","I see Obama a couple of weeks ago, \"We are going to send 50 men to Iraq, or to Syria.\" And then he said, \"Where are we sending those men by the way?\" Why would a President, or -- I didn't say it. I didn't say it. I didn't say that. Go ahead, say it again, but louder. Very rude. They're very rude in Georgia, aren't they?","You heard what he said. you heard what he said. Well there's something going on, because some of these decisions are hard to believe. So he announces that he's sending 50 men off, and maybe some women, I don't know. But he's sending 50 people over, our finest. Why would you do that? Why would you say anything?","Because now, they're being hunted. Now they've got targets on their back. Now the enemy knows they're going over there. Why would you say that? They're being hunted like wild dogs. They're being hunted. Why would you say that you're sending 50 people. And it's you know, the interesting thing, it's not even good psychologically.","Because 50 is not the number. I mean, you know, 50 people. So it's not even good from that standpoint. It's not like we're sending a 100,000 people. 50 people. They probably say, wow. Well No. 1, we're going to get those 50. If we're the enemy, right? No. 1, we're going to get those 50, and we're going to make them look real bad.","And No. 2, 50 people. How stupid is this? OK. If you're going to do it, either do it, or don't do it. But you have to either do it or you don't do it. This strategy. This strategy is totally wrong. So I write the book, 2000, The America We Deserve. You saw that, right? Did you see the book? Does anybody have that book?","The America We Deserve in the year 2000, and I talk about Osama Bin Laden, because he was a terrorist with a big, fat mouth, and he was going around saying the destruction he's going to do. And I say -- I said in the book two years before the World Trade Center came down. You better do something about this guy Osama Bin Laden.","I said something about he's going to crawl into Iraq and come back. And a couple of people said, man, Trump actually called Osama, he did. He came back. He knocked down the World Trade Center, with thousands and thousands of lives, and people still dying and families still suffering because they lost people.","This was the worst attack. This was worse than Pearl Harbor, because at least that was an attack on the military. This was an attack on innocent people working in an office and having lunch up on top of the world. This was an attack on civilians. The worst attack in the history of the country. And we could have done something about it. We could have done something if we had leaders, if we had smart people.","We could have done something about that. Osama bin Laden was out there. I wrote about him in my book. He was out there. You don't go out and say we're sending 50 men. Here's another thing. Bush started a war. Shouldn't have been started. You're going to destabilize the whole Middle East, that's what happened.","And I said it. 2003, 2004, Reuters has a big article on top, Trump says totally against the war. Not because I would be against, but because you have to know, I'm gonna build a military so strong, so powerful, so great that we'll never have to use it. We're never going to have to use it. We don't want to use it. We don't want to use it. Look, in many ways.","In many ways, the military is -- and building it up is the cheapest thing we can do. Because it's like the tough guy. You never really want to go against the tough guy. You know you get the tough -- we grow up and we all know what we're talking about, but I'm the tough guy. Well hopefully, I'm the smart guy.","We have to have cunning. We have to have guile. We have to have a lot of different qualities. But we can't keep going with these all talk, no action politicians who are paid off by their PACs. They're paid off by the PACs. They're controlled like little puppets by their PAC. We can't keep going like this.","We owe 19 trillion. That's now going to be $21 dollars. That's a number that's absurd. It's a number that -- who would have even thought this is possible. China's ripping up on trade. Japan is killing us on trade. With China, we're losing $450 billion on an imbalance a year. With Japan, it's $70 billion a year.","Mexico's 45. That's why -- people say, I told you before, I say they're gonna build a wall. You know why? Because they're making a fortune. Mexico. I love the Mexican people. I respect Mexico. I respect their leaders. But their leaders are so much smarter than our leaders. You stay in Mexico one extra day, they have five soldiers escort you out of the country.","And yet, they send everybody over that they don't want. People that go through Mexico keep going. The dummies in the United States -- a woman's pregnant. She has a baby. She steps over the border. She has a baby. It's an American citizen. We take care of the baby for 85 years. No more. And I attack that.","Anchor babies. I attacked it, and I attacked it strong. And it turned out I was right. I didn't even know that at the time. Because everybody said, all of these dumbass politicians said, oh, no. Oh no. It's what they are. They're good at one thing. I'll tell you what. They're good at one thing. Getting reelected.","I mean, I have to deal with them. A guy like Kasich. This guy's nothing. These people, these are people that should not be on the stage. These are people. It's an embarrassment to have some of them on the stage. And some are very good. I'll be honest. I'm not going to tell you who, because I want you to vote for me. But there are some that are very good, but there are some that should not be on the stage.","I mean, you have a guy like Pataki. He doesn't even register in certain areas where you have to register, and he's going to be back in the stage. If I'm running a Republican Party, and if somebody is not registered, let's say, in Virginia, or let's say in South Carolina because they don't want to pay the fee or they can't get some signatures on a ballot.","And he can't register because it's now the time limit. So you don't have South Carolina or you don't have Virginia. You're not going to be on the debate stage with us. But they don't do anything about it. They don't do anything about it. So we have to get tougher. We have to get smarter. We have to really run this country with love and with heart, and we have to take care of people that are sick.","We have to take care of people that need help. We have to get better health care. Obamacare is a disaster. A disaster. Obamacare is going to be repealed and replaced with something so much better. So much better. I don't know if you saw recently where premiums are going up 35, 45, 55%. People can't afford them.","The coverage is horrible. The deductibles are so high that unless you're dead, you can't use it, OK? You can't use it. It's useless. It's useless. It's terrible. And it was all a big lie 28 times. You can have your doctor. You can have your plan. You can have whatever the hell you want. And frankly, the Democrats are going to pay a big price.","Because I don't know if you've been reading the papers lately, but Obamacare is in big, big trouble, financial trouble. They have to be bailed out big league by Congress. They're going to have to be bailed out big, big league in '17. Now unfortunately, you're going to have a new president. I'm going to inherit this stuff.","I got all these problems to fix, but I'll fix them, believe me. Believe me. But here's the problem. The Democrats, at least we know where they're coming from right. These Republicans, we send them to Washington. And I support them. I give a lot of money, all that stuff. But we send them to Washington, and they get down there and they don't do the job that they campaigned for.","They say, we're going to end Obamacare, right? I don't know if you have any of this area. Probably you do. We're going to end Obamacare. We're going to do this we're going to strengthen up our military. We're going to take care of our vets. We're going to take care of our vets. They talk and they talk and they talk.","Now they get down to these gorgeous halls with the beautiful marble columns and the angels on the ceiling, right? And he looks at his wife and he says, \"We finally hit the big time, darling\". We fight. And it comes to a vote on Obamacare, everybody raises their hand. I mean, look at this last budget. This last budget was approved so fast, and we have to raise $2 trillion because of this budget.","When you do the budget you're supposed to start the following morning when negotiating because you don't have enough time, then they say closed down government. Everybody's afraid of closing down the government. And you know the funny thing? I wrote The Art of the Deal. The funny thing is that. Nobody is going to blame -- be blamed for closing down the government but Obama.","When people read the history books, they're not going to say Boehner closed -- nobody's going to know who Boehner is. They're going to say during the Obama administration, the government closed down. He was a horrible president. Still. They're going to say he was a horrible president. He didn't know what the hell he was doing.","He was a tremendous divider, because he's the most divisive human being I think I've ever seen. And the one thing a lot of us thought, including me -- I said, you know what? He's not going to be the president. But you know what, he will unify, perhaps, the country. And he'll bring white and African-American and everybody.","He'll bring them all together. And you know what, that turned out to be totally wrong. It's never been worse. And when I met today with the African-American pastor, it's never been worse than it is today. And frankly, if you're African-American, you have 51 to 55% unemployed. I mean, everything is bad. The man has been a horrible president.","He's been horrible. To a point where people that would never vote Republican come up to my office and they want to really talk turkey, and it's hard for them. They always go Democrat. And it's hard for them. But they come up to my office because they really want help. So he's been a great divider. He's been an incompetent president.","Everything he touches turns to you know what. Well everything. Think of it. We don't have victories anymore, right? We don't have victories. When's the last time we had a victory? We don't have victories anymore. Our health care is no good. It's a disaster. Our trade with all of these countries is no good.","Our borders are like sieves, people are just pouring in. We have sanctuary cities, which by the way, will end very quickly, OK? When I made the speech in Trump Tower that I'm going to run, and I gave up a lot. I gave up a lot. Because what I gave up is far more than any campaign is gonna cause. I'm talking now in dollars.","I gave up a tremendous amount, including shows and everything else. But I gave up a lot. You know a politician gives up nothing. They run, they lose, they win. They run again totally controlled by their donors by special interests and by lobbyists, totally. And there is a story, and I have to tell you because this is like -- and I've been saying it for a long time.","I think we had either 9 or 11 super PACs formed for me. Trump super PAC. One of them The art of the Deal PAC. The Art of the Deal. So people give money. You know these and a lot of these people that formed the super PAC have no money. Maybe I'll give you a good idea, right? You go form a super PAC, Keep all the money for yourself.","So I'm saying to myself, I wonder, when people send to the art of the deal super, they probably think I'm running. But we're not supposed to run it. I'm not running it. And I see these two young guys are on television, and I see others, and they're all talking about this -- nothing to do with it. We sent legal letters to all of these super PACs to close your doors, close up. I would have had hundreds of millions of dollars if I wanted to have a super PAC and if I wanted to have other people fund my campaign.","I don't want other people to fund my campaign. I don't. I don't want to. Because nobody knows the game better than me. We take the small contributions because I have to. I mean, I have people sending me $21, $17, $28, $100, and you have to. Those are people that are in love with this country. And you have to take that -- it's called small, like tiny contributions.","But these are people that really want to invest in this country, the greatness of the country. And frankly, to send their money back would cause more than some of the checks that come in. You wouldn't even know. And there's no letter I can write to a woman who sent in $17.50 with a four page letter. Four page letter.","So proud that she sent this money. There's no letter that I can write where she's not insulted. I have turned down tens of millions of dollars. And you know, most of those guys have gone to other campaigns because they want to -- I mean, they're like worst players in a certain way, but they also want access and they want power.","And I said, I don't want to take your money. I'm not going to take your money. So here's the story. It was just on the front page of The Los Angeles Times. A super PAC called American Legacy raised $6 million. Now this is -- I guess, it's a Carson or a Carson-oriented super PAC, right? Of the $6 million, only $140,000 was left for the campaign.","No, but this is the same with Bush, maybe not as bad. It's the same with Rubio. It's the same with all of them. Or most of then, I guess. Maybe a couple of them do it properly. But the consultants and the fundraisers and all of these people, they take the money. They're professionals. They make a money better than being a real estate broker, to be honest with you.","I mean, I'll probably give a lot of people in the audience an idea, but it's better than being a real estate broker. So think of it -- Jeb Bush. Yes, Jeb. He's he's another beauty. He's in a -- Jeb Bush the other day said Donald Trump -- you know, he's trying to talk tough now because I said he's got no energy.","I call him a low-energy person, so now, he wants to be a tough guy. It doesn't work. You can't be tough if you're not tough, you know. We know that. He should be himself. If he's himself, he'd do better. Can't do any worse. But Jeb Bush the other day said, Donald Trump doesn't have the right tone to be president.","The tone. And I said to my -- he goes, who cares? That's very good. Who cares is right. So here's the story. So they're chopping off people's heads in the Middle East, right? They're drowning people in cages. We're like living in medieval times. We can't waterboard. They asked me the other day, do you say that.","They chop off heads. And one of the announcers asked me the other day, one of the talking heads, actually. Said Mr. Trump, what do you think of waterboarding? What do you think -- I said, what do I think of waterboarding. Well do you want to go a step further than waterboarding, because I'm OK with that, too.","I said, you know they're chopping off everybody's heads. Every day you see a James Foley, great parents. I made a contribution to the people and to the parents because they did the Foley foundation, and I got to know them and him, and through them. And he's like -- he was like this great person. They thought he was the first.","And I said you know, I think ISIS made a terrible mistake. When they did that, they created this tremendous hatred. Well now, they're doing it all over the place. And we haven't done anything about it. And we have a president that doesn't even want to mention Islamic problems. Doesn't want to mention it, OK? Right?","No he doesn't want to mention it. He doesn't want to say. You know when you -- when you think about it, he doesn't want to use the terms. He doesn't want to say what it is. And you can't cure a problem if you're not going to say what the problem is. You just can't cure it. So we have a terrorism problem, like probably there hasn't been.","We're fighting a war like we've never fought. Of course, he's not saying it's a war either. But we're fighting a war, where they're blowing up airplanes, where they're doing things like what you just saw in Paris and other places. And we have a president that refuses to use proper terminology. And why that is, nobody can really tell me that one.","OK? Why that one. This audience is amazing. I wish everybody -- I wish everybody could hear. You know, when you think of radical, right? Radical Muslim, anything you want to say. But it's a problem, and it's a problem that has to be addressed, whether it's Muslim extremists or not. You have to say what it is. And that's what it is. That's what it is. Even at a soccer game recently, you saw that the other day, where they had a soccer game, they had one minute of silence for the people that were just absolutely bludgeoned.","Absolutely what they did in Paris. And people are yelling things from the audience. Things that weren't supposed to happen. And the players were unbelievably embarrassed, and it was a great embarrassment. And you don't get a lot of reporting on it, but it was -- most of you have heard about it. That was last week.","So we need strength. We need power. We need smarts. We're going to redo this country. We're going to make it better than it's ever been before. I really believe that. I really believe. I really believe. Well, thank you. The other day, I read on the headline of one of the newspapers, the number of migrants crossing the Rio Grande is through the roof.","You know we've been here, oh, well it's not. Tremendous increase, the number of migrants crossing the Rio Grande. Our country has no borders. If you don't have borders, you don't have a country. I'm sorry. I'm sorry. I'm sorry. So -- and I'll tell you this. If I didn't -- at the base of Trump Tower in New York, if I didn't think talk about illegal immigration, I don't even think you'd be talking about it right now.","You had Kate in San Francisco. You had Jamiel, this young, incredible guy that was going to go to -- a football player, a good student. His father, I've gotten to know him. An unbelievable man. And his son was shot and killed walking home with a sandwich for his father from the deli. He was going to go on a scholarship to one of the great colleges, maybe Stanford, on a football scholarship.","The apple of the father's eye. And he called up his father, and he said, \"Pop,\" -- he called him Pop. \"I'll be home in a couple of minutes. I'm right outside. I've got your sandwich. \" And then a minute later, Jamiel Shaw Sr. heard three or four gunshots ring out, and he knew, he knew it was his son. And this was a guy that walked up to his son, held a gun to his head and pulled the trigger right through the head.","And when the boy went down, he went like this. And he shot him again and blew his hands off. An illegal immigrant that came over. Kate, the same thing. In Los Angeles a few weeks ago, a woman, 66 year old veteran, raped, sodomized and killed by an illegal immigrant. We've gotta get our country back, folks.","We've got to get. And by the way. By the way, these are three instances. These are three. There are thousands and thousands and thousands. It's horrible. It's horrible. And the Border Patrol, I was over there not long ago, in Laredo, Texas. And the Border Patrol -- these are great people. And they said, they're told, stand down, stand down.","These guys are fantastic people. They'd love to do their job. They can't do their job. They're not allowed to do their job. And people are pouring into the country. And now, we have Syrians that look awfully strong. No. Can't do it. Hey, look we all have a heart. And you know what, I'm all for building safe zones in Syria, which is much less expensive.","And believe it or not, they'd rather be there. You know, I have many -- I have thousands of employees, and I have employees from parts of the world -- all legally here. Oh, have I been tested. I had these guys going to reporters, to every place. Have I been tested. But I have -- and I don't know, maybe somebody sneaks in, and believe me, they'll find it if they do. But I have from all over.","But you know, it's funny. They come from countries that you wouldn't think much of. You would never think that you'd want to go. They're big ambition is to make money here and go back to their country. They want to go back to their country. And I understand that. I understand that. They want to go home. They want to be back with their mothers and their fathers in their soil and their plants.","Even if the plant is not the kind of plant that you like. They want to go home to their country. And I understand that. And the fact is if you build safe zones, and boy, do you have plenty of land over there. But if you build safe zones and you've got to get the Gulf States -- as an example, Saudi Arabia makes a billion a day.","Now that was a couple of months ago when oil was -- so let's say they make a half. They make $1 billion a day. So much money, they don't know what to do with it. I know, they're wonderful people. They treat me nicely. They buy my apartments. I love them. OK. But you know what? The money is enormous. We don't have money.","We're a debtor nation. We got to get them to put up money. We defend them. We defend Germany. We defend Japan. We defend South Korea, and he's there right next to the maniac. This guy is a maniac. We have 28,000 soldiers. We defend -- they give us like nothing. If you want to buy a television, LG, Samsung, Sharp.","They all come -- I bought thousands and thousands of televisions in the last year for different projects, right? Can you believe I'm running part time, I'm like running part time. I'm doing well for a part timer, right? Oh by the way, talking about -- so wouldn't it be nice? I've spent less money on my campaign than anybody else.","And I'm in first place in every poll. Wouldn't that be nice? No. No. But wouldn't it be nice if the country could do the same thing? Wouldn't it be nice. As an example. At first, I said, you know, I have to spend more money. It doesn't look that good. I haven't spent that -- and then somebody said to me, you know it really is great.","I don't know if anybody ever heard of Charles O. Finley. He owned the Oakland A's, right? He had the lowest payroll in baseball, and he won the World Series three times in a row. He had a young Reggie Jackson, a young Catfish Hunter, and George Steinbrenner who was one of my best friends and a great guy.","But he used to just buy his players all the time. And George told me, this guy is a genius. He had the lowest payroll in baseball, and he won the World Series three times. And he sells his players for a fortune, and replace them with guys that were just as good. Wouldn't it be great if our country could run like that?","Wouldn't it be great? Wouldn't that be great? Do you remember for the last -- there's a lot of the people in this room know what I'm saying, and they've been following us. Do you remember when I've been saying oil? Attack the oil, right? I've been saying that now for what, four years? But I say more. I say attack the oil and then keep it. These guys attack it, but they don't want to keep it, because they're stupid.","So for four years, I've been saying attack the oil. Attack the wealth of ISIS. Attack the wealth. And they all said, oh, that would be ridiculous. Obama actually had one of his generals say, well, that wouldn't be a good military -- I said, wait a minute. They're making much of their money from oil. They're making a lot from banking.","And who knows better about attacking banks than I do. I'm one of the old time pros of history. OK. You got to attack the banks. Money is pouring in from banks illegally. Money is pouring in. And the banks will stop it because I know how -- I know the games. These politicians don't know anything. But I've been saying attack the oil, attack the oil.","They've been saying that doesn't make sense. That's not a good strategy. I actually heard the other day that attacking the oil is a bad idea because it's environmentally not sensitive. Can you believe this? Attack the oil, because what's going to happen is you're going to have fires, you're going to have smoke.","And they want to do it for environmental reasons. Can you believe the incredible incompetence? OK. So I've been saying that that is a serious consideration as to why they didn't attack the oil, just to show you how stupid our leaders are. And these people want to kill all of us. So I've been saying attack the oil.","Well after Paris and right at Paris, finally, and it was France that did it. Can you believe it? It was France that led the attack, which I'm I'm happy about. But they finally started attacking the oil, and only one person back there said, you know, that was Trump's idea a long time ago. And he's been saying it every time I -- every chance I got.","But I said one other thing. I said attack the oil. Go in there, recapture. Get Exxonmobil. Get a couple of these great companies. They'll rebuild the infrastructure. Don't worry about the infrastructure. These companies are amazing. Half of you probably work there. They're amazing companies. They will rebuild it so fast that they're build it new and nice.","We'll encircle it. We'll make a fortune. And we'll give a percentage of that money to the families of the soldiers of Iraq and other places that were killed and so badly wounded. We'll give a percentage of that money to the wounded warriors, and we'll take care of our people. But these guys don't want to do it. You know, in the old days, to the victor -- you know you're a military man.","I could see it. Stands up straight. Great guy. But I can see it. To the victor belong the spoils, right? We don't do that. We don't do that. We're so dumb, we go and bomb the hell out of places, win, win, then we lose. And how about Obama? So I talked to you about the 50. But how about this one? When he gave the exact date when we're pulling out.","OK. How about that? And I said, wait a minute. It must be some kind of a game. I thought maybe he's playing a game, that he didn't mean it. Because if he doesn't mean it, he'll get them by surprise. See, our country needs the word unpredictable. We're totally predictable. He announces the 50. He announces next week, we'll be bombing a certain city.","In the meantime, it turns out to be hell on wheels, because they're so prepared. Because whatever he says turns out to be right. You'd think he'd be leading them. So what happens is Obama comes out, and he said, we're leaving Iraq on a certain date. And he meant it. So what happens? And believe me, they don't want to be killed.","You know you read all about it going up. They don't want to be killed. They want to be killed if they can avoid it. So they pull back. They say, wait a minute this guy. How stupid is he? He's told us when he's leaving. What do we have to fight for? They're leaving soon. So they pull back. And we think we're doing great, because they pulled back.","And then we leave, and then they go and do whatever they want. And by the way, ISIS came because we had no control over the people that took over Iraq. They wouldn't let ISIS have their fair share. And what happened is ISIS became more vicious, by far, than them, and more vicious than Saddam Hussein, by the way, who didn't have weapons of mass destruction.","So what happens -- so what happens is we have a president that told them the exact day that we're pulling out, all right? Now you tell me how stupid is that. And now, they have. -- and now, they have a war going on where they don't know what they're doing. They're fighting Syria, but Syria's fighting ISIS, and they're fighting together.","So we're fighting ISIS, and we're also fighting Syria. So Syria's now saying, wow, I can't believe it. The United States who's fighting us is killing our worst enemy, ISIS. We love the United States. And Assad is down on the side of Russia. And because we gave Iran $150 billion. We don't get our prisoners.","We don't -- I don't have to go into it. Maybe the worst deal ever made ever that I've ever seen of any kind. So now, we're fighting Iran. We're potentially fighting Russia. We're fighting ISIS. ISIS is fighting Syria. Serious fight. We don't know what the hell we're doing. We have stupid people. You can't fight them both.","You got to pick your guy. You got to pick your guy. And I tell you who I pick. Assad is a bad guy. We're backing the rebels, just like we did in other places. OK. We're backing the rebels to go in. Now who are the rebels? Nobody knows who they are. Some people think the rebels are ISIS. And some people think the rebels are far worse than Assad.","So we're backing the rebels. Look what happened in Libya. Look what happened in Iraq. We don't back people. And we give them our equipment, and one shot's fired up in the air, and all our equipment is in the hands of the enemy. This stuff isn't going to happen if Trump gets there. Every single poll. Not going to happen.","Every single poll is saying No. 1 by far in leaders -- I'm not saying leader, I'm just telling you, I'll be a great leader. But every single poll. You know why I'm going to be a great leader, because I'm going to win. You know Vince Lombardi would win. That's why he was a leader. If Vince Lombardi for the Packers lost all the time, he wouldn't have been a leader.","If Coach Belichick who's a great guy -- last night, a little upset, but that's OK. But Coach Belichick is a winner. These guys -- the only way you can be a winner, you can't be a loser and be a leader. You can't. Doesn't work. Because you may get away with it for a little while, but eventually, people will say, we keep losing.","We want somebody who's going to win. I win. I win. I know how to win. I know how to win. Just like now, we're driving the Republican establishment crazy, crazy, crazy. They don't know what to do. And the reason they're going crazy is because they want to have their puppets, and I'm not a puppet. And when Ford, which moved to Mexico, when they call me, I'm going to do what's right for you.","I'm not going to do what's right for me, because I don't care. And I'm not going to do what's right because they were fundraisers and they gave me a lot of money. And when Nabisco, which just moved its big plant to Mexico, wants something. Oh, they're going to suffer. Oh, they're going to suffer. OK. And when the fund raisers and the lobbyists and the special interests see me about Nabisco, I'm gonna do what's right for you.","So really in a nutshell. It's been great being with you tonight. It's like this all over. It's like the enthusiasm, the love the incredible everything. It's it's like this all over. We have an amazing country of people that really want to see us be great again the expression Make America Great Again. I mean, they really want to see it. We have to get out and vote.","Don't believe all this stuff. I think I'm going to win the Hispanic vote. And I frankly don't think it matters. You know the fact is that if the Republicans got up and voted last time, you would have had a different president. I don't know if you know. Romney let us down. He let us down, and he didn't energize the base.","People were saying, I don't care. I mean, if you don't care between Obama and Romney. That's not doing a good job. We've got to get out. We've got to be energy. If you have a broken leg, a broken back, a broken neck, you have to get up and you have to vote. You've got to go out and vote. And I'll tell you this.","And I say this even more strongly now than ever, before because I've gotten to know so many people on the trail. Our country is made up of unbelievable people and spirit. Our country, with proper leadership, and I'll give you really proper, we're gonna have fun. We're going to have victories. We're going to win.","We're going to win so much. We're going to do things we're going to be -- we're going to take care of our people that need it, which Republicans aren't going to ever get credit for. And we're going to do that. We have to do that. Otherwise, I wouldn't even run for office. We're going to have a big beautiful heart.","But we're going to make this country not only great again, we're going to make our country greater than it's ever been before. And we can do it. We can do it. Thank you. Thank you. I love you. Thank you very much. I love you. Thank you. I love you. Thank you very much. Thank you."],"text":" Thank you very much. What an incredible group of people. Beautiful. And you know, no matter where we're going now everybody wants to see greatness for our country. We want to bring it back. It's the same. Everybody loves each other. I'll tell you, we left so many places. I mean, we go New Hampshire, we go Iowa, we go South Carolina, we go to Virginia, we go -- no matter where we go -- Dallas -- no matter where we go, it's the same thing. There's so much love in the room. It's easy to do this. It really is. It's easy to do. It's easy. Amazing. It's amazing. I want to thank Herman Cain, my friend, for his wonderful remarks. He's really a good guy. nine nine nine, right? Nine nine nine. Wherever Herman, is. Thank you, Herman. And you know we had a meeting today that was amazing. We had the African-American pastors. So many came up to Trump Tower. It was like one of the most inspiring meetings. It was an unbelievable -- the love they have for the people that they represent, and people generally, was incredible. And I just want to tell you, they left Trump Tower. I then immediately got on the plane and I felt very inspired. It was a really terrific day. So -- and Bruce is here. Where there is Bruce? Bruce LeVell. Where is Bruce? Bruce, get over here, Bruce. You know Bruce? You don't know. Bruce. Come on, Bruce. Bruce. Bruce. All right, now get the hell out of here. You know, this is so impromptu. You never know when you ride with this guy. I was in New York, and I went up there, guys, on a serious note to just defend a lot of the things that you've been seeing in the news that were totally false. Donald Trump is not a racist, guys. Really? You know, I went to his campaign, and I'll be honest, you guys probably never met him. I've met him several times. Actually rode back on his plane, and got to help land the plane with my beautiful wife Sharon over here. Where are you, Sharon? And we had a big meeting up at the Trump headquarters, and we had over hundreds of pastors that showed up that looked like me and different leaders across the country, to denounce this rumor, this accusation against this fine man. It's all -- guys, when I walked -- the first thing when I walked up to his office, I looked around, and it was so culturally diverse, it was amazing. Most of the women were in charge. They had the higher positions in his organization. Did y'all know that? But on a serious note, I won't talk because it's about Donald Trump. I just want to let you know that you know I am wholeheartedly thankful to be a part of this campaign and to help him. And I hope you guys help him. I know there's a lot of establishment guys. I was part of the establishment. I used to be a chairman on that GOP chair. Some of you all know me. But I'm here to tell you, it's not about anything else except you guys, the people. And I just want you to let you know that Donald Trump is here for everyone, hears every voice. And he's our guy. Thank you, Bruce, Pastor. Thank you. That was very nice. But we met with many, many pastors, and it was just great. So as you can see, the people are still pouring out. Now we could get all of these people coming in right now if you'd like to wait for 45 minutes before we start. You want to do that? I had a feeling you were going to say that. I had a feeling. It's been going amazingly well. You do have the mainstream here. You know, I've been hearing about mainstream media all my life -- boo, boo. No, I've been hearing about it, and it's true. I mean, they don't give you accurate really representation. It's an amazing thing. They don't do it. They don't do it. You know, I constantly talk about the cameras. They never show the crowds. They never show the crowds. My wife is always disappointed. Darling, you must not have had a good crowd tonight. But now, after about three or four times, she understands they never want to show the crowd. They never want to fan the cameras. It's an incredible thing. Can you do it maybe once? Fan the cameras. Fan them over. Fan them over. You know, I should be happy. It's focused on my face. They never move it. Nobody knows what's going on because you really don't. They don't want to -- I mean, it sounds crazy. They don't want to show the kind of response we're getting. So we had 12,000 people. We had 12,000 in Sarasota, Florida on Saturday, in an afternoon during football games, 12,000. Biggest crowd ever. They've never had a crowd even close. The arena held six. We had six outside, six inside. I made two speeches, and nobody knew that. They don't talk about. So that's OK. Here's the story. Here's what's important. Here's what's important. We're winning in every single category. Every category. We're winning every single poll. Fox just came out. We're beating Hillary Clinton even head to head by a lot. And I have to tell you, we're beating her by a lot. But she does -- and there's people going to say, oh, that's not a nice thing to say. Who cares? We can't afford to be so nice, folks. We don't have the options. You know, for a while we had options. We could mess it up. We don't have the options. We've got to get it right. She doesn't have the strength or the stamina to be president. She just doesn't. She doesn't. I know her. You ever notice, she'll got in one of these things and she'll do something, and it's by the way, the crowds are like -- the crowds are like 200 people. We were in New Hampshire, actually, a part of Massachusetts. We're at 48%. You know why? Because Tom Brady likes me What can I tell you. I think so. If Tom Brady likes you, you're in pretty good shape in Massachusetts. But we have 48% in the poll in Massachusetts, and we're landing -- and Hillary is nearby, and she's going past. And we had all of the police in Massachusetts give us a motorcade. You never saw anything like it. It was like 50 motorcycles. That's the most incredible -- I actually said, why do I have to be president? No president ever had a motorcade like we just got. And Hillary -- we had 4,500 people. And right next door, meaning ten miles up the road, Hillary had about 200 people. It was -- that's the way it is. That's the way it is. And I'll tell you, this just came out. I don't know if the other networks to keep their thing going, but I might as well. CNBC and CNN, they were pretty lousy. That guy John Harwood was a real stiff, wasn't he? What a dope. What a dope he was. He was so nice to me for three four weeks. Oh, yes, Mr. Trump. Oh Mr. Trump, we look so forward, we look so forward to having you. And then he reads his questions, such a nasty -- and I said, what a nasty question, right? So they're just a bunch of phony people. But when it comes to this, I'll say it's good, because I only it's good news. So good news, they're not phony. All right so this was CNBC. So it's staying home. And it says for the frontrunner, 75% Republicans polled -- basically, you see the charts. And that if Trump runs, far more people are going out to vote in the election. Far, far. Then it says, no matter -- I have no glasses on, but these are minor details. I didn't want to put the glasses on. Does it make sense? Shall I put them on? No. They all say, no, don't do it. Don't do it. OK. I'm going to do it without. No matter what party affiliation you consider, Trump brings them out. This is CNBC. Republicans, Democrats, and independents are almost likely to show up if Trump is on the ballot. In our analysis we assume constant variables the Democrats nominating Hillary, which is going to happen, unfortunately, or fortunately. I'd actually rather run against her. She has done such a lousy job. You know -- you know what her legacy is going to be? The greatest job that she has ever done will be getting out of the email scandal, assuming that happens. It's true. That will be her greatest achievement. You see all the classifieds today? They have thousands. How does a person have that many e-mail? They have 3,000, here, five -- how do you have that many emails anyway? But they have thousands of classified today. It's disgusting. Because frankly, she shouldn't be allowed to run. She shouldn't be. But the Democrats are protecting her. She's being fully protected, as the expression goes. And by the way, we can't tell any more jokes. You know, every time I kid and tell jokes, these guys put on like, you know, a little segment. Like the belt, right, the belt. You know what I'm talking -- I told you about Carson and how it doesn't work that way if you hit. And I went into it like a whole big thing, can't be possible, the belt will twist. So I'm going through this thing like for three minutes, then I pull over to this side, and they start showing the belt. And I start showing it very strong, very nice, you know, but it's a part of a holster. They never show anything. Just that two or three second clip. I'm playing with my belt and people don't know what the hell you're doing. It's unbelievable. And then I talked about -- the other day I talked about a reporter who changed his story. He changed his story. And I go into this very highly exaggerated phase of changing the story. They don't say what it's all about. All they do is they show these little snippets. They do whatever they can to make him look best. So what I'm going to do, I'm not going to tell anymore jokes. I'm not going to kid. Oh, you want me to? You want me to? OK. OK, so I will. Just as long -- no it's true. And then my opponents do commercials where they take a two-second snippet. These are really dishonest people. Like this guy Kasich. He did a commercial. Total stiff a bit. I'm beating him in Ohio by a lot, and he's the governor of Ohio. No, it's terrible. They say something to the effect that kind of people -- I was talking about Carson, and I said that he had a certain problem, right? We don't have to go into it. OK, I will. No, I said he had a certain pathological problem now. Now, he wrote it, I didn't write it. And he said he suffers from pathological disease, OK? That's a serious problem. Don't we have enough problems in this world? And I said, essentially, the people of Iowa can't be that stupid. And then I said, the people of the United States, something to the effect, can't be that -- in other words, talking about everybody. How can you vote for somebody with a problem like that? I'm not even talking about going after the mother with a hammer. I'm not talking about hitting his friend in the face with a lock. And I'm not talking about that total nonsense about, boom, into his stomach, and the belt saved it. OK. OK. I'm not talking about those, I said I'm not going to mention them tonight. So just disregard. It's like you tell before a jury or the judges, please disregard. Oh, OK. We'll disregard. So what happens, what happens, is Kasich does a commercial. But he only puts up the first part. He doesn't put up the second about all the people in the United States. They take little snippets. These a horrible people, horrible people. Interestingly, in the same poll, not that I care about Kasich. I think he's got 1%, but Kasich does the worst. You know, it's funny when people come after me, they've gone down the tubes. You look at Kasich. Now, before that, Jindal he was vicious. Bobby Jindal. Alfred E. Newman, I call him. No, it's true. Think of it. He was vicious. He was so vicious, he was going after me. I said, I don't even know this guy. And then you had Perry, the nicest guy from Texas. He had a problem. You know, one of the worst debate performances in the history of debates. That was a debate performance you can never, ever live down. But all of a sudden, he became vicious. He goes to Washington to make a major speech on me. I said, what did I do? Because they wanted to pick up. He goes down. Lindsey Graham. I mean, this poor guy No. ,No. The poor guy. Think of it. He's a U.S. senator. And in South Carolina. I was at 32 or 38, and he was a 2 or 3, and he's a sitting senator. How about Florida? How about Florida? In Florida, I'm at 32 and 28, very high numbers. And a governor, Bush. I mean, honestly? It's over. So many commercials. I can't watch them. He spent millions and millions of dollars -- I've spent nothing. I haven't done a commercial. I actually felt badly. No. I actually felt badly. I did a radio commercial. A small one, because the press was killing me. Why aren't you doing more commercials? Why, why, why? They said, you gotta do a commercial. I don't need it, but we got to do a commercial. So we did actually a pretty good radio commercial. We're going to be doing a lot of commercials actually, I think. Actually, we're going to be doing most of the commercials, that if somebody hits me, I'm going to hit them back so hard. Oh. Oh. You have no idea. We're going to hit them back 10 times harder than they ever, which is what we should be doing with ISIS and everybody else. OK. Incredible. It's so cute. These people that are pouring in, in the back, they don't know what they're missing, do they? They don't know. So so many things. But Lindsey Graham, disaster. Perry, disaster. All like disasters. Think of this. And a friend of mine said, you know, so far -- Christie hasn't hit me yet. He will. He has to he's no choice. He's a two or three, he's got to hit me. At some point, Rubio's got to hit me. Hey, there's only one way you get to the top, and it's all through Trump. Let's face it. They have to. Even, I think, Cruz is going to have to hit me because, you know, he's a nice guy. He's been so support -- everything I said, he supported. Every single thing I said. And he's been so supportive. But at some point, he's going to have to hit me, right? It's gonna be a sad day, but we will hit back. I promise. I promise. But you look at what's going on, and you look at the world and you see what's happening, and we have to get this right. We can't put a stiff. We can't put a low-energy person. We can't put people, some of whom I've gotten to know. Some of whom I respect. Some of whom, I really don't respect. Some of whom I don't respect. I look at some of the people that are on the dais. I never debated before. Now in all fairness, every online poll, Drudge was terrific. He's a terrific guy, by the way, Drudge. But Drudge has a big poll. Hundreds of thousands of people vote after the debates. Time Magazine. I was just on the cover of Time magazine. Believe me. Other than that, I have no power over Time Magazine. Time magazine slate. They will do these poses, like five or six. So we have the debate. Every single debate. And believe me, hundreds of thousands. I am not telling people to make phone calls, all right? It's an online poll, which I think are actually better in many respects than whether you interview 300 people and they say you're winning. I don't understand 300 people. I do understand 200,000 people. But I don't understand why the interview 297.3, point three point three is a baby. OK. So I never understood that. But you know what? Whatever it -- I took that at the Wharton School of Finance. I took that whole thing, and it never made sense to me, but I guess it works, because usually, they're right. Although in the last number of elections they've been wrong. I hope they're right, right. I want them to be right. They got to be right. But you look at these polls, and in the debates I won all the debates. And I'm saying to myself today, CNN I'm coming over. And I told you, we had this great pastors meeting. This great, great -- I mean, look, the camera just went off from CNN. They know me. I love. I love hitting them. While their cameras on. No, no. I love it. I love it. So CNN gave me the worst story. It was like the meeting never even took place. And it was such a great. It was like a love fest. And I said, that's really unfair stuff. So maybe how would you like to do this? Fox, for the first debate, ended up with 24 to 25 million people, one of the largest in the history of cable. Maybe the largest show, I think, in the history of cable. CNN had 23 million people. It was the biggest show in the history of CNN. This isn't me. This is from SHOWBIZ. OK. The biggest ratings in the history of CNN, biggest they cover wars. They cover -- how about the next debate is with CNN. Now you have to tell me, because I know what they're going to say. They're going to say, oh, Trump is chicken. OK. How about I tell CNN, who doesn't treat me properly. They don't. They just, right? They really don't. Now, I have a lot of respect for some of the people over there, but they don't treat me -- how about I tell CNN that I'm not going to do the next debate, OK? I'll tell you the problem. You know we discussed -- this a nice thing. When you're really smart. Like really, really, really smart like I am. It's true . It's always been true. But I can do these things extemporaneously so I don't need teleprompters. Like Obama, he walks out. Ladies and gentlemen of Georgia. Ladies and gentlemen, thank you very much. You know how easy that is? You read for a half hour, and you -- I talk for an hour and a half. And I don't have any of that stuff. But the nice thing is you can be very current. You know, current events. You're not reading a speech, and you have to get speechwriters to change. I mean, I hear things on the airplane coming over. We could talk about them. But how about we do this with CNN? I won't do the debate unless they pay me $5 million, all of which money goes to the wounded warriors or go to vets. Truth. Truth. I would love to do it. OK. Let me give you the bad. So what will happen is they'll say, oh, Trump is chicken. Well, I've done four of them. And according to every online poll, I won every one of them. Now when I turn on the television, and I listen to these, you know, the talking heads who are not smart people at all. They call them elite. My education is better than any of them. I'm smarter than they are. Many other people -- no, many other people in the room as smarter as they are. But the talking heads, I could name them. But actually, a couple of them actually started to come around. So I got to be careful. I can't send them all the way back again. Right. But you know, guys like Karl Rove. He spends hundreds of millions of dollars on campaigns. He wins nothing. He wins nothing. There are some people that are losers. OK. But how about if we do the -- no, they're losers. They're losers. And that's the problem, we can't have that. We can't have that with the Republican Party. We have to get the right people and we have to win. That's why when I show you this. This poll, it's a Fox poll where I beat Hillary, that's what we have to have. And I'll be -- I haven't even started on Hillary yet, other than I do say no strength no stamina. But with CNN. So I say $5 million goes to the wounded warrior and the vets. OK. Do we like that? Here's the problem. We're winning by a lot. I say because we're all in this thing. You know, a lot of people say, oh, well Trump's crowd -- they say it over here -- Trump's crowd, it was packed. We haven't had. I mean, you look at every say. Mark Cuban called up. He want to use my arena, the Dallas Mavericks. I said, what day is it? Thursday. When can I use it? Monday. I said four days. How many seats? 20,000 seats. We filled it up like a day and a half. And he predicted that. He knew it. There's a feeling. By the way, there's a feeling. But here's the problem. So we're leading and everything. The biggest crowds, by far. So much bigger than Bernie said. You know you always hear about Bernie Sanders, our crowds -- may he rest in peace. You know he had an operation today. I think it was a hernia operation. You know? You know why? Carrying around too much tax problems, because he's going to tax you. He's going to tax you. But let's not even talk tax problem. He wants to double and triple everyone's -- wants to bring you up to 90%. 90%. And he wants to bring you because he wants to take -- now what happened is Hillary now has gone way left, and she wants to give everybody free everything, except for the people that pay taxes. You know somebody has to pay. Somebody has to pay, so it's going to be Hillary. But here's the problem. So with CNN, I said, no, I'm not doing it. Their ratings will go down where they would be. You know let's say they would have had a million people. When they have maybe 2 million people, and they have 24, 25 million people. The case of Fox, 23. So they're expecting a lot a big audience. December 15th. They're advertising it all of -- what I do like, they finally use a beautiful picture of me. Finally. Sometimes, the pictures are so bad. They have my chin pulled back so I look like quadruple chins. They picked worst -- but they picked a good picture. I'm so happy with them I actually wrote him a letter saying Thank you for the first time in about two years. But here's what happens. I won five million dollars. They were getting four thousand dollars for a 30 second ad for the last debate. They went from $4,000 to approximately $250,000 for a 30 second ad. That's a lot of money.And then if you remember, CNBC extended their debate by one hour two days before. They said they're extending it because they were making a fortune. They were totally sold out. And who's the one that said, no way, you're not going to do it. I did not, because -- I could stand up there forever. But I said you're not going to do it. And everybody told me. Everybody. This is like the wall. Believe me we're going to build a wall. Mexico's going to pay for it. Believe me. It's like the wall. Like the wall. Everyone says, oh, you'll never get Mexico to pay for the wall. So what I did, this was CNBC, they're going to make it three hours. I said no one, I can stand up here for twenty five hours. I can stand up for two days. I don't care. But who the hell wants to watch the same questions over and over and over again, right?. For two and a half three hours. So I said, no way. And I said we're not going to do it. In all fairness, Carson joined in with me. He said, absolutely, I'll go along. And they folded in about two seconds. That's supposed to be the business network. They folded quick. Quickly. They failed. So with CNN, here's what they'll say. Trump's chicken. He's afraid to debate. He's afraid to debate. And what I don't do, I just hope to Corrie and hope to all of my people, I said I'd love because I watch the story of the past as it was so -- It was so terrible. It was done by a reporter sitting right back there. No it's true. Who by the way, she wasn't even there. She wasn't in Trump Tower. That's when we had a beautiful news conference with all these pastors and it was like we didn't do anything. I won't mention a name I don't want to make her any more famous than she is. She's not very famous, believe me. But such a -- such a such a disgusting report. So the problem is they'll say that Trump is chicken now. If you're not leading and you're going nowhere, you have nothing to lose. But wouldn't it be bad. I'm leading the polls. I don't do it. I play cute, because you're playing cute, right? It gets out I'm chicken, which I'm not. One thing I'm not is chicken OK? Every -- remember, every single poll, I won every single poll in the debate. So all four debates, check it folks. You know I only say what's true, because if I say anything that's even slightly off, the next day, I have headlines. Every single poll. But if I do this it could be he's playing too cute and maybe I don't do well and maybe my real polls, which are the polls we're leading by so much, maybe they go down. So should I tell CNN that I'm not doing the debate because they treat me really unfairly? And say, but I will do it if you give $5 million to the vets. Well I know where the people in this room. Good. And if they covered my whole remarks good. But they don't want it -- they'll just cover a tiny bit. They won't mention what I just said. So they give you like three seconds of this if I do it, have a feeling I could face repercussions in the polls. Should I do it or not? I don't know if I wanted to take the chance. I don't know. You know, it's a little it's a little -- OK, we all heard of the Apprentice, right? The Apprentice, one of the great. I love the Apprentice. So Mark Burnett came up, want to do the Apprentice. Show became a tremendous, tremendous hit. And by the way the head of Comcast, who's a great guy Stebe Bert came to my office just before announced he wanted to renew for a lot of money. I'll pay whatever wanted to renew and I said Steve I think I'm going to run. I wasn't sure because I wasn't sure until I got down that escalator with my beautiful wife waving. She was more confident than I was up there. But she's waving, and I'm saying ah, yay, yay. Am I going to do this? The bottom of Trump Tower, this massive area, was you couldn't even see any of the marble because there were so many cameras on it and I took a deep breath and I went. Let's go. And I get it -- and by the way. And in that speech, we announced illegal immigration. We announced a whole pile of things that turned out to be a very, very big deal. A very, very big deal, right? Very big deal. So build a wall. So so what happens. So what happens with The Apprentice is we went on, and they didn't have an option, because everybody said, Well, Trump is going to be. He's not a television star. They did a one season deal without an option. Very unusual. They didn't want to waste the ink. And critics said, why would anybody want to watch The Apprentice with Donald Trump? And then they said the worst insult I've ever had. This one critic, a total moron, said, women will never watch. You know, unless women watch a show, it can't be successful, because women make up a big part of the audience. Unless you have big women, and you just can't. The people in television know that. And there's one guy said, why would women ever want to watch Donald Trump on television? Can You believe this? This is when it first came out. In fact, I said to my wife babe, darling, am I that bad? And I said, I've done fine. But the show goes out, and it starts at No. 10. It goes to No. 8. It goes to No. 5. Anyway, many evenings, the No. 1 show in town became this phenomena. And so what happened is I play chicken, because they didn't have an option. So what happened is NBC came to me, and I read all about Friends, where they made $2 million an episode, and they were -- how many are them? Five, or something, right? Jennifer Aniston, all of them. And they had like a union, but they made a lot of money per episode. I would have not formed that union. If I were Jennifer, maybe I would have asked for more. But that's OK, she's a team player. So what happens. What happens. I said, I know nothing. My agent told me don't do The Apprentice in the first place. It's not going to work. So I fired him. I said, you know, the show just went to No. 1. Now I fired my agent. So I'm stuck without an agent. But I read all about these ridiculous salaries that these television stars, and I asked for a tremendous salary. I said, look, I have the hottest show on television. You remember that season one in particular, the final episode. I think it was second after the Super Bowl, had tremendous numbers of people watching it. And I said, all right, I'll do this myself. This is too simple. And so I asked for a crazy number. And they said no. They turned me down. And I said, man, I just blew it. And two days later, they called me back. We'll give it to you. OK. And I said, why -- they paid me a -- you saw the money I made on The Apprentice. I had to file it. How much was it? $213 million. Do you believe that? Nobody believes it. I don't believe it. I mean, to be honest, I had to file it. I had to file myself. Everybody said, well, maybe he's not as big as people think. And you know what's going to happen, and he won't file. Well I filed, and I was much bigger. And by the way, I don't say that -- bigger better, stronger, low debt, tremendous cash flow, numbers that I wouldn't have ever believed even 15 years ago. I built a great company. The reason I say that isn't for ego. It's because this is the mentality. This is the thinking that we need for our country to make us great again. So just to finish, and then we're going to get back on to that. But just to finish, I said to the head of NBC. Why did you fold? Because I love business. You know. I love to know why did people fold like little people. Why did they fold? So I said, why did you fold? He said, you know, we weren't. And we started interviewing other people. But in the end, we didn't want to take a chance. OK. And it's the same thing with us. It's the same thing with us. We are going to do something so strong and so bold, but we can't take a chance and pick the wrong president. We can't pick a woman who is totally embroiled in scandal for her whole life. Whitewater. No. Think of it right. Whitewater was no different. Everybody that studied it, they did a book on it. She should have been indited.. She should have been indited. How about -- wasn't it the cattle futures, the cattle futures, right, where her numbers went up, like she made a massive amount of money in like one week. And guys that do this professionally all their lives, they've never made that. The whole thing, the whole thing is a scandal. The whole thing is corrupt. It's corrupt. And it has been. You look at the foundation. You look at everything. It's been so bad for so long. We can't do that. We can't get involved in that stuff anymore. And honestly, it's true. She'll say hello to people. She disappears for five days. I don't disappear for five days. Tomorrow, I'm going someplace. All the time. You know all the time, I'm going. We need tremendous stamina. We need tremendous strength. And this is women, men. You know what I'm talking about. We need strength. We need stamina. And we need smarts. We don't need just a tough person. Because I know tough guys. I know tough guys. I know tough people. And tough is no good. Tough is no good without the brainpower. You need the brain. You need the brain. But we need to toughness, too. We need General Patton. We need General Patton. I mean, our armed services today are so politically correct that a guy like General Patton, who is a vicious, ruthless, horrendous human being who cursed and spat and spit in people's faces. Who cares? He was great. And by the way, his troops would go to hell for him. His troops would go to hell. Mad Dog. His troops would go to hell for him. Or we need General Douglas MacArthur. In the history of West Point, one of the greatest intellects. And he was a totally different type, but he was a guy that only understood winning. That's what he understood. We don't need these guys that I see on television all the time talking about ISIS is very tough. ISIS is tough. They're 60,000 people. We got them through horrible planning. Horrible planning. That whole thing with Iraq. Again, got to be given points. I said in 2003, 2004, don't go. And now, I am by far -- and we have a lot of vets. I love you, vets. I love you. Lot of vets. We have a lot of vets in this room. And we're going to take care of our vets. We are going to really take care of our vets. You know, we put in a plan recently -- we're going to take care of our vets. But we have to have people that don't talk. We don't want talkers. We want doers. We want people that know what's happening. I see on television all these generals they're talking about, yes, we're going to do this. I see Obama a couple of weeks ago, \"We are going to send 50 men to Iraq, or to Syria.\" And then he said, \"Where are we sending those men by the way?\" Why would a President, or -- I didn't say it. I didn't say it. I didn't say that. Go ahead, say it again, but louder. Very rude. They're very rude in Georgia, aren't they? You heard what he said. you heard what he said. Well there's something going on, because some of these decisions are hard to believe. So he announces that he's sending 50 men off, and maybe some women, I don't know. But he's sending 50 people over, our finest. Why would you do that? Why would you say anything? Because now, they're being hunted. Now they've got targets on their back. Now the enemy knows they're going over there. Why would you say that? They're being hunted like wild dogs. They're being hunted. Why would you say that you're sending 50 people. And it's you know, the interesting thing, it's not even good psychologically. Because 50 is not the number. I mean, you know, 50 people. So it's not even good from that standpoint. It's not like we're sending a 100,000 people. 50 people. They probably say, wow. Well No. 1, we're going to get those 50. If we're the enemy, right? No. 1, we're going to get those 50, and we're going to make them look real bad. And No. 2, 50 people. How stupid is this? OK. If you're going to do it, either do it, or don't do it. But you have to either do it or you don't do it. This strategy. This strategy is totally wrong. So I write the book, 2000, The America We Deserve. You saw that, right? Did you see the book? Does anybody have that book? The America We Deserve in the year 2000, and I talk about Osama Bin Laden, because he was a terrorist with a big, fat mouth, and he was going around saying the destruction he's going to do. And I say -- I said in the book two years before the World Trade Center came down. You better do something about this guy Osama Bin Laden. I said something about he's going to crawl into Iraq and come back. And a couple of people said, man, Trump actually called Osama, he did. He came back. He knocked down the World Trade Center, with thousands and thousands of lives, and people still dying and families still suffering because they lost people. This was the worst attack. This was worse than Pearl Harbor, because at least that was an attack on the military. This was an attack on innocent people working in an office and having lunch up on top of the world. This was an attack on civilians. The worst attack in the history of the country. And we could have done something about it. We could have done something if we had leaders, if we had smart people. We could have done something about that. Osama bin Laden was out there. I wrote about him in my book. He was out there. You don't go out and say we're sending 50 men. Here's another thing. Bush started a war. Shouldn't have been started. You're going to destabilize the whole Middle East, that's what happened. And I said it. 2003, 2004, Reuters has a big article on top, Trump says totally against the war. Not because I would be against, but because you have to know, I'm gonna build a military so strong, so powerful, so great that we'll never have to use it. We're never going to have to use it. We don't want to use it. We don't want to use it. Look, in many ways. In many ways, the military is -- and building it up is the cheapest thing we can do. Because it's like the tough guy. You never really want to go against the tough guy. You know you get the tough -- we grow up and we all know what we're talking about, but I'm the tough guy. Well hopefully, I'm the smart guy. We have to have cunning. We have to have guile. We have to have a lot of different qualities. But we can't keep going with these all talk, no action politicians who are paid off by their PACs. They're paid off by the PACs. They're controlled like little puppets by their PAC. We can't keep going like this. We owe 19 trillion. That's now going to be $21 dollars. That's a number that's absurd. It's a number that -- who would have even thought this is possible. China's ripping up on trade. Japan is killing us on trade. With China, we're losing $450 billion on an imbalance a year. With Japan, it's $70 billion a year. Mexico's 45. That's why -- people say, I told you before, I say they're gonna build a wall. You know why? Because they're making a fortune. Mexico. I love the Mexican people. I respect Mexico. I respect their leaders. But their leaders are so much smarter than our leaders. You stay in Mexico one extra day, they have five soldiers escort you out of the country. And yet, they send everybody over that they don't want. People that go through Mexico keep going. The dummies in the United States -- a woman's pregnant. She has a baby. She steps over the border. She has a baby. It's an American citizen. We take care of the baby for 85 years. No more. And I attack that. Anchor babies. I attacked it, and I attacked it strong. And it turned out I was right. I didn't even know that at the time. Because everybody said, all of these dumbass politicians said, oh, no. Oh no. It's what they are. They're good at one thing. I'll tell you what. They're good at one thing. Getting reelected. I mean, I have to deal with them. A guy like Kasich. This guy's nothing. These people, these are people that should not be on the stage. These are people. It's an embarrassment to have some of them on the stage. And some are very good. I'll be honest. I'm not going to tell you who, because I want you to vote for me. But there are some that are very good, but there are some that should not be on the stage. I mean, you have a guy like Pataki. He doesn't even register in certain areas where you have to register, and he's going to be back in the stage. If I'm running a Republican Party, and if somebody is not registered, let's say, in Virginia, or let's say in South Carolina because they don't want to pay the fee or they can't get some signatures on a ballot. And he can't register because it's now the time limit. So you don't have South Carolina or you don't have Virginia. You're not going to be on the debate stage with us. But they don't do anything about it. They don't do anything about it. So we have to get tougher. We have to get smarter. We have to really run this country with love and with heart, and we have to take care of people that are sick. We have to take care of people that need help. We have to get better health care. Obamacare is a disaster. A disaster. Obamacare is going to be repealed and replaced with something so much better. So much better. I don't know if you saw recently where premiums are going up 35, 45, 55%. People can't afford them. The coverage is horrible. The deductibles are so high that unless you're dead, you can't use it, OK? You can't use it. It's useless. It's useless. It's terrible. And it was all a big lie 28 times. You can have your doctor. You can have your plan. You can have whatever the hell you want. And frankly, the Democrats are going to pay a big price. Because I don't know if you've been reading the papers lately, but Obamacare is in big, big trouble, financial trouble. They have to be bailed out big league by Congress. They're going to have to be bailed out big, big league in '17. Now unfortunately, you're going to have a new president. I'm going to inherit this stuff. I got all these problems to fix, but I'll fix them, believe me. Believe me. But here's the problem. The Democrats, at least we know where they're coming from right. These Republicans, we send them to Washington. And I support them. I give a lot of money, all that stuff. But we send them to Washington, and they get down there and they don't do the job that they campaigned for. They say, we're going to end Obamacare, right? I don't know if you have any of this area. Probably you do. We're going to end Obamacare. We're going to do this we're going to strengthen up our military. We're going to take care of our vets. We're going to take care of our vets. They talk and they talk and they talk. Now they get down to these gorgeous halls with the beautiful marble columns and the angels on the ceiling, right? And he looks at his wife and he says, \"We finally hit the big time, darling\". We fight. And it comes to a vote on Obamacare, everybody raises their hand. I mean, look at this last budget. This last budget was approved so fast, and we have to raise $2 trillion because of this budget. When you do the budget you're supposed to start the following morning when negotiating because you don't have enough time, then they say closed down government. Everybody's afraid of closing down the government. And you know the funny thing? I wrote The Art of the Deal. The funny thing is that. Nobody is going to blame -- be blamed for closing down the government but Obama. When people read the history books, they're not going to say Boehner closed -- nobody's going to know who Boehner is. They're going to say during the Obama administration, the government closed down. He was a horrible president. Still. They're going to say he was a horrible president. He didn't know what the hell he was doing. He was a tremendous divider, because he's the most divisive human being I think I've ever seen. And the one thing a lot of us thought, including me -- I said, you know what? He's not going to be the president. But you know what, he will unify, perhaps, the country. And he'll bring white and African-American and everybody. He'll bring them all together. And you know what, that turned out to be totally wrong. It's never been worse. And when I met today with the African-American pastor, it's never been worse than it is today. And frankly, if you're African-American, you have 51 to 55% unemployed. I mean, everything is bad. The man has been a horrible president. He's been horrible. To a point where people that would never vote Republican come up to my office and they want to really talk turkey, and it's hard for them. They always go Democrat. And it's hard for them. But they come up to my office because they really want help. So he's been a great divider. He's been an incompetent president. Everything he touches turns to you know what. Well everything. Think of it. We don't have victories anymore, right? We don't have victories. When's the last time we had a victory? We don't have victories anymore. Our health care is no good. It's a disaster. Our trade with all of these countries is no good. Our borders are like sieves, people are just pouring in. We have sanctuary cities, which by the way, will end very quickly, OK? When I made the speech in Trump Tower that I'm going to run, and I gave up a lot. I gave up a lot. Because what I gave up is far more than any campaign is gonna cause. I'm talking now in dollars. I gave up a tremendous amount, including shows and everything else. But I gave up a lot. You know a politician gives up nothing. They run, they lose, they win. They run again totally controlled by their donors by special interests and by lobbyists, totally. And there is a story, and I have to tell you because this is like -- and I've been saying it for a long time. I think we had either 9 or 11 super PACs formed for me. Trump super PAC. One of them The art of the Deal PAC. The Art of the Deal. So people give money. You know these and a lot of these people that formed the super PAC have no money. Maybe I'll give you a good idea, right? You go form a super PAC, Keep all the money for yourself. So I'm saying to myself, I wonder, when people send to the art of the deal super, they probably think I'm running. But we're not supposed to run it. I'm not running it. And I see these two young guys are on television, and I see others, and they're all talking about this -- nothing to do with it. We sent legal letters to all of these super PACs to close your doors, close up. I would have had hundreds of millions of dollars if I wanted to have a super PAC and if I wanted to have other people fund my campaign. I don't want other people to fund my campaign. I don't. I don't want to. Because nobody knows the game better than me. We take the small contributions because I have to. I mean, I have people sending me $21, $17, $28, $100, and you have to. Those are people that are in love with this country. And you have to take that -- it's called small, like tiny contributions. But these are people that really want to invest in this country, the greatness of the country. And frankly, to send their money back would cause more than some of the checks that come in. You wouldn't even know. And there's no letter I can write to a woman who sent in $17.50 with a four page letter. Four page letter. So proud that she sent this money. There's no letter that I can write where she's not insulted. I have turned down tens of millions of dollars. And you know, most of those guys have gone to other campaigns because they want to -- I mean, they're like worst players in a certain way, but they also want access and they want power. And I said, I don't want to take your money. I'm not going to take your money. So here's the story. It was just on the front page of The Los Angeles Times. A super PAC called American Legacy raised $6 million. Now this is -- I guess, it's a Carson or a Carson-oriented super PAC, right? Of the $6 million, only $140,000 was left for the campaign. No, but this is the same with Bush, maybe not as bad. It's the same with Rubio. It's the same with all of them. Or most of then, I guess. Maybe a couple of them do it properly. But the consultants and the fundraisers and all of these people, they take the money. They're professionals. They make a money better than being a real estate broker, to be honest with you. I mean, I'll probably give a lot of people in the audience an idea, but it's better than being a real estate broker. So think of it -- Jeb Bush. Yes, Jeb. He's he's another beauty. He's in a -- Jeb Bush the other day said Donald Trump -- you know, he's trying to talk tough now because I said he's got no energy. I call him a low-energy person, so now, he wants to be a tough guy. It doesn't work. You can't be tough if you're not tough, you know. We know that. He should be himself. If he's himself, he'd do better. Can't do any worse. But Jeb Bush the other day said, Donald Trump doesn't have the right tone to be president. The tone. And I said to my -- he goes, who cares? That's very good. Who cares is right. So here's the story. So they're chopping off people's heads in the Middle East, right? They're drowning people in cages. We're like living in medieval times. We can't waterboard. They asked me the other day, do you say that. They chop off heads. And one of the announcers asked me the other day, one of the talking heads, actually. Said Mr. Trump, what do you think of waterboarding? What do you think -- I said, what do I think of waterboarding. Well do you want to go a step further than waterboarding, because I'm OK with that, too. I said, you know they're chopping off everybody's heads. Every day you see a James Foley, great parents. I made a contribution to the people and to the parents because they did the Foley foundation, and I got to know them and him, and through them. And he's like -- he was like this great person. They thought he was the first. And I said you know, I think ISIS made a terrible mistake. When they did that, they created this tremendous hatred. Well now, they're doing it all over the place. And we haven't done anything about it. And we have a president that doesn't even want to mention Islamic problems. Doesn't want to mention it, OK? Right? No he doesn't want to mention it. He doesn't want to say. You know when you -- when you think about it, he doesn't want to use the terms. He doesn't want to say what it is. And you can't cure a problem if you're not going to say what the problem is. You just can't cure it. So we have a terrorism problem, like probably there hasn't been. We're fighting a war like we've never fought. Of course, he's not saying it's a war either. But we're fighting a war, where they're blowing up airplanes, where they're doing things like what you just saw in Paris and other places. And we have a president that refuses to use proper terminology. And why that is, nobody can really tell me that one. OK? Why that one. This audience is amazing. I wish everybody -- I wish everybody could hear. You know, when you think of radical, right? Radical Muslim, anything you want to say. But it's a problem, and it's a problem that has to be addressed, whether it's Muslim extremists or not. You have to say what it is. And that's what it is. That's what it is. Even at a soccer game recently, you saw that the other day, where they had a soccer game, they had one minute of silence for the people that were just absolutely bludgeoned. Absolutely what they did in Paris. And people are yelling things from the audience. Things that weren't supposed to happen. And the players were unbelievably embarrassed, and it was a great embarrassment. And you don't get a lot of reporting on it, but it was -- most of you have heard about it. That was last week. So we need strength. We need power. We need smarts. We're going to redo this country. We're going to make it better than it's ever been before. I really believe that. I really believe. I really believe. Well, thank you. The other day, I read on the headline of one of the newspapers, the number of migrants crossing the Rio Grande is through the roof. You know we've been here, oh, well it's not. Tremendous increase, the number of migrants crossing the Rio Grande. Our country has no borders. If you don't have borders, you don't have a country. I'm sorry. I'm sorry. I'm sorry. So -- and I'll tell you this. If I didn't -- at the base of Trump Tower in New York, if I didn't think talk about illegal immigration, I don't even think you'd be talking about it right now. You had Kate in San Francisco. You had Jamiel, this young, incredible guy that was going to go to -- a football player, a good student. His father, I've gotten to know him. An unbelievable man. And his son was shot and killed walking home with a sandwich for his father from the deli. He was going to go on a scholarship to one of the great colleges, maybe Stanford, on a football scholarship. The apple of the father's eye. And he called up his father, and he said, \"Pop,\" -- he called him Pop. \"I'll be home in a couple of minutes. I'm right outside. I've got your sandwich. \" And then a minute later, Jamiel Shaw Sr. heard three or four gunshots ring out, and he knew, he knew it was his son. And this was a guy that walked up to his son, held a gun to his head and pulled the trigger right through the head. And when the boy went down, he went like this. And he shot him again and blew his hands off. An illegal immigrant that came over. Kate, the same thing. In Los Angeles a few weeks ago, a woman, 66 year old veteran, raped, sodomized and killed by an illegal immigrant. We've gotta get our country back, folks. We've got to get. And by the way. By the way, these are three instances. These are three. There are thousands and thousands and thousands. It's horrible. It's horrible. And the Border Patrol, I was over there not long ago, in Laredo, Texas. And the Border Patrol -- these are great people. And they said, they're told, stand down, stand down. These guys are fantastic people. They'd love to do their job. They can't do their job. They're not allowed to do their job. And people are pouring into the country. And now, we have Syrians that look awfully strong. No. Can't do it. Hey, look we all have a heart. And you know what, I'm all for building safe zones in Syria, which is much less expensive. And believe it or not, they'd rather be there. You know, I have many -- I have thousands of employees, and I have employees from parts of the world -- all legally here. Oh, have I been tested. I had these guys going to reporters, to every place. Have I been tested. But I have -- and I don't know, maybe somebody sneaks in, and believe me, they'll find it if they do. But I have from all over. But you know, it's funny. They come from countries that you wouldn't think much of. You would never think that you'd want to go. They're big ambition is to make money here and go back to their country. They want to go back to their country. And I understand that. I understand that. They want to go home. They want to be back with their mothers and their fathers in their soil and their plants. Even if the plant is not the kind of plant that you like. They want to go home to their country. And I understand that. And the fact is if you build safe zones, and boy, do you have plenty of land over there. But if you build safe zones and you've got to get the Gulf States -- as an example, Saudi Arabia makes a billion a day. Now that was a couple of months ago when oil was -- so let's say they make a half. They make $1 billion a day. So much money, they don't know what to do with it. I know, they're wonderful people. They treat me nicely. They buy my apartments. I love them. OK. But you know what? The money is enormous. We don't have money. We're a debtor nation. We got to get them to put up money. We defend them. We defend Germany. We defend Japan. We defend South Korea, and he's there right next to the maniac. This guy is a maniac. We have 28,000 soldiers. We defend -- they give us like nothing. If you want to buy a television, LG, Samsung, Sharp. They all come -- I bought thousands and thousands of televisions in the last year for different projects, right? Can you believe I'm running part time, I'm like running part time. I'm doing well for a part timer, right? Oh by the way, talking about -- so wouldn't it be nice? I've spent less money on my campaign than anybody else. And I'm in first place in every poll. Wouldn't that be nice? No. No. But wouldn't it be nice if the country could do the same thing? Wouldn't it be nice. As an example. At first, I said, you know, I have to spend more money. It doesn't look that good. I haven't spent that -- and then somebody said to me, you know it really is great. I don't know if anybody ever heard of Charles O. Finley. He owned the Oakland A's, right? He had the lowest payroll in baseball, and he won the World Series three times in a row. He had a young Reggie Jackson, a young Catfish Hunter, and George Steinbrenner who was one of my best friends and a great guy. But he used to just buy his players all the time. And George told me, this guy is a genius. He had the lowest payroll in baseball, and he won the World Series three times. And he sells his players for a fortune, and replace them with guys that were just as good. Wouldn't it be great if our country could run like that? Wouldn't it be great? Wouldn't that be great? Do you remember for the last -- there's a lot of the people in this room know what I'm saying, and they've been following us. Do you remember when I've been saying oil? Attack the oil, right? I've been saying that now for what, four years? But I say more. I say attack the oil and then keep it. These guys attack it, but they don't want to keep it, because they're stupid. So for four years, I've been saying attack the oil. Attack the wealth of ISIS. Attack the wealth. And they all said, oh, that would be ridiculous. Obama actually had one of his generals say, well, that wouldn't be a good military -- I said, wait a minute. They're making much of their money from oil. They're making a lot from banking. And who knows better about attacking banks than I do. I'm one of the old time pros of history. OK. You got to attack the banks. Money is pouring in from banks illegally. Money is pouring in. And the banks will stop it because I know how -- I know the games. These politicians don't know anything. But I've been saying attack the oil, attack the oil. They've been saying that doesn't make sense. That's not a good strategy. I actually heard the other day that attacking the oil is a bad idea because it's environmentally not sensitive. Can you believe this? Attack the oil, because what's going to happen is you're going to have fires, you're going to have smoke. And they want to do it for environmental reasons. Can you believe the incredible incompetence? OK. So I've been saying that that is a serious consideration as to why they didn't attack the oil, just to show you how stupid our leaders are. And these people want to kill all of us. So I've been saying attack the oil. Well after Paris and right at Paris, finally, and it was France that did it. Can you believe it? It was France that led the attack, which I'm I'm happy about. But they finally started attacking the oil, and only one person back there said, you know, that was Trump's idea a long time ago. And he's been saying it every time I -- every chance I got. But I said one other thing. I said attack the oil. Go in there, recapture. Get Exxonmobil. Get a couple of these great companies. They'll rebuild the infrastructure. Don't worry about the infrastructure. These companies are amazing. Half of you probably work there. They're amazing companies. They will rebuild it so fast that they're build it new and nice. We'll encircle it. We'll make a fortune. And we'll give a percentage of that money to the families of the soldiers of Iraq and other places that were killed and so badly wounded. We'll give a percentage of that money to the wounded warriors, and we'll take care of our people. But these guys don't want to do it. You know, in the old days, to the victor -- you know you're a military man. I could see it. Stands up straight. Great guy. But I can see it. To the victor belong the spoils, right? We don't do that. We don't do that. We're so dumb, we go and bomb the hell out of places, win, win, then we lose. And how about Obama? So I talked to you about the 50. But how about this one? When he gave the exact date when we're pulling out. OK. How about that? And I said, wait a minute. It must be some kind of a game. I thought maybe he's playing a game, that he didn't mean it. Because if he doesn't mean it, he'll get them by surprise. See, our country needs the word unpredictable. We're totally predictable. He announces the 50. He announces next week, we'll be bombing a certain city. In the meantime, it turns out to be hell on wheels, because they're so prepared. Because whatever he says turns out to be right. You'd think he'd be leading them. So what happens is Obama comes out, and he said, we're leaving Iraq on a certain date. And he meant it. So what happens? And believe me, they don't want to be killed. You know you read all about it going up. They don't want to be killed. They want to be killed if they can avoid it. So they pull back. They say, wait a minute this guy. How stupid is he? He's told us when he's leaving. What do we have to fight for? They're leaving soon. So they pull back. And we think we're doing great, because they pulled back. And then we leave, and then they go and do whatever they want. And by the way, ISIS came because we had no control over the people that took over Iraq. They wouldn't let ISIS have their fair share. And what happened is ISIS became more vicious, by far, than them, and more vicious than Saddam Hussein, by the way, who didn't have weapons of mass destruction. So what happens -- so what happens is we have a president that told them the exact day that we're pulling out, all right? Now you tell me how stupid is that. And now, they have. -- and now, they have a war going on where they don't know what they're doing. They're fighting Syria, but Syria's fighting ISIS, and they're fighting together. So we're fighting ISIS, and we're also fighting Syria. So Syria's now saying, wow, I can't believe it. The United States who's fighting us is killing our worst enemy, ISIS. We love the United States. And Assad is down on the side of Russia. And because we gave Iran $150 billion. We don't get our prisoners. We don't -- I don't have to go into it. Maybe the worst deal ever made ever that I've ever seen of any kind. So now, we're fighting Iran. We're potentially fighting Russia. We're fighting ISIS. ISIS is fighting Syria. Serious fight. We don't know what the hell we're doing. We have stupid people. You can't fight them both. You got to pick your guy. You got to pick your guy. And I tell you who I pick. Assad is a bad guy. We're backing the rebels, just like we did in other places. OK. We're backing the rebels to go in. Now who are the rebels? Nobody knows who they are. Some people think the rebels are ISIS. And some people think the rebels are far worse than Assad. So we're backing the rebels. Look what happened in Libya. Look what happened in Iraq. We don't back people. And we give them our equipment, and one shot's fired up in the air, and all our equipment is in the hands of the enemy. This stuff isn't going to happen if Trump gets there. Every single poll. Not going to happen. Every single poll is saying No. 1 by far in leaders -- I'm not saying leader, I'm just telling you, I'll be a great leader. But every single poll. You know why I'm going to be a great leader, because I'm going to win. You know Vince Lombardi would win. That's why he was a leader. If Vince Lombardi for the Packers lost all the time, he wouldn't have been a leader. If Coach Belichick who's a great guy -- last night, a little upset, but that's OK. But Coach Belichick is a winner. These guys -- the only way you can be a winner, you can't be a loser and be a leader. You can't. Doesn't work. Because you may get away with it for a little while, but eventually, people will say, we keep losing. We want somebody who's going to win. I win. I win. I know how to win. I know how to win. Just like now, we're driving the Republican establishment crazy, crazy, crazy. They don't know what to do. And the reason they're going crazy is because they want to have their puppets, and I'm not a puppet. And when Ford, which moved to Mexico, when they call me, I'm going to do what's right for you. I'm not going to do what's right for me, because I don't care. And I'm not going to do what's right because they were fundraisers and they gave me a lot of money. And when Nabisco, which just moved its big plant to Mexico, wants something. Oh, they're going to suffer. Oh, they're going to suffer. OK. And when the fund raisers and the lobbyists and the special interests see me about Nabisco, I'm gonna do what's right for you. So really in a nutshell. It's been great being with you tonight. It's like this all over. It's like the enthusiasm, the love the incredible everything. It's it's like this all over. We have an amazing country of people that really want to see us be great again the expression Make America Great Again. I mean, they really want to see it. We have to get out and vote. Don't believe all this stuff. I think I'm going to win the Hispanic vote. And I frankly don't think it matters. You know the fact is that if the Republicans got up and voted last time, you would have had a different president. I don't know if you know. Romney let us down. He let us down, and he didn't energize the base. People were saying, I don't care. I mean, if you don't care between Obama and Romney. That's not doing a good job. We've got to get out. We've got to be energy. If you have a broken leg, a broken back, a broken neck, you have to get up and you have to vote. You've got to go out and vote. And I'll tell you this. And I say this even more strongly now than ever, before because I've gotten to know so many people on the trail. Our country is made up of unbelievable people and spirit. Our country, with proper leadership, and I'll give you really proper, we're gonna have fun. We're going to have victories. We're going to win. We're going to win so much. We're going to do things we're going to be -- we're going to take care of our people that need it, which Republicans aren't going to ever get credit for. And we're going to do that. We have to do that. Otherwise, I wouldn't even run for office. We're going to have a big beautiful heart. But we're going to make this country not only great again, we're going to make our country greater than it's ever been before. And we can do it. We can do it. Thank you. Thank you. I love you. Thank you very much. I love you. Thank you. I love you. Thank you very much. Thank you."}