{"id":491,"author":"Donald Trump","title":"Speech: Donald Trump in Birmingham, AL","date":"2015-11-21","link":"https://factba.se/transcript/donald-trump-speech-birmingham-al-november-21-2015","paragraphs":["We love you. We love you. Birmingham, we love you. Thank you. Thank you. Thank you very much everybody. And we're going to have a lot of fun and then I'll get you out to those football games to have this many people. I'm getting you out of here. I'm getting you out. Maybe I'll go watch one of them with you.","I'll tell you I love it. And you do have great teams. You do have great football players and great things. So a lot of things have happened over the last week. A lot of bad things actually. We have a president whose represented very poorly, very, very poorly. Horribly, actually. We have a situation where ISIS has raised its ugly head again.","And we got to chop off that head like they're chopping of our people. So terrible. You know I did a lot of tweeting @realDonaldTrump, right? @realDonald Trump. And I said you can call these dopes. They're dopes. They've got IQ's that are low. Believe me. You can't call the leader of the dopes a mastermind.","You can't do it. I've been watching for a week and now I will tell you. I really was -- when I said the same thing at another speech recently. I got a lot of play. Because it's -- you know. They're taking the Internet and using it better than our country and certainly our politicians and our executives. They're using it better than anybody.","And our youth is susceptible. In all fairness they're susceptible. And you have these kids coming home and they say, \"Mom and dad, did you see the mastermind?\" The mastermind, he's a moron that by the way he's also dead. Which is great. Which is great. And I tweeted. I said don't call a mastermind. You're building them up. You're building up their image.","You know we have a president that doesn't know anything about what we're talking about. He doesn't know. In Iran he calls the head, the Supreme Leader. Yes. The supreme leader. I promise you I will never call him the supreme leader. I promise you. I'll call him, \"Hey you. Hey, how you doing? Everything good?","How you doing? Everything good?\" Guess what? We're going to renegotiate your deal. We're going to make it much better. We're going to renegotiate that sucker big league and you're going to give us back those prisoners before I take office. OK. You're going to give us back. You're going to give them back.","You're giving them back. How about that deal? How about that deal? I mean here we have Carry who doesn't have a clue. Weak, ineffective begging to make a deal and we had all the cards. We had $150 billion to negotiate with. And what happens? What happens? He is a loser. Yes. Oh, he just said he's a loser.","You know that's such a descriptive term. Some of the press said I use it too much. But there's just no better word. You know I went to Ivy League College. I know a lot of words. But somehow loser is so nice. It's such a good word. Such a good word. No, no, only in describing certain people. 'Course that's a lot of people.","It's a lot of people. But you look, $150 billion dollars going to a terrorist nation. They got everything they wanted. How about the self-inspection? They self-inspect. How about that one? OK. When they don't self-inspect, we have 24 hours. Meaning, they get 24 hours that shoots into 24 days but the 24 hours can go on forever.","Before we get the approval to start the clock ticking for the 24 days. But even if it didn't -- 24 days. We think you're doing something wrong. Oh, OK. Come back in 24 days was there. By that time I have a broom-clean I used to clean garages for my father and I always used to say broom-clean and my father would say to me, \"Son.","I want that garage in mint condition.\" He used to use the term mint condition.","Just a term he used that meant immaculate. Not like what we do nowadays. Things aren't so immaculate. But thank you. Thank you. Well I don't know. I think he said something good. Thank you. But what happens? What we need, what we need is, we need leadership so badly. We can be so great again. We're laughed at. We're scoffed at. We're robbed.","We're robbed! We're robbed! You look at the Iran deal. You look at -- and by the way, speaking of Iran, the prisoners. So you say why don't we have them back? And they said because we didn't want to complicate the deal. Do you believe it? So we have four men over there right now in the worst prison. The worst.","I met one of them, a Christian, a pastor. I met his wife twice. So lovely, cannot understand. Nobody speaks so nobody calls and nobody talks to her about the negotiation. And that should have been done early. Did you ever see a deal take so long? We're giving them all of this money. Look at that. People are still pouring in. You are so lucky to be in here, by the way.","You're so lucky. People a lot of people are outside. By the way. If you want, we can wait about an hour and get everybody in. You want to do that? I don't think so. They're going to be angry. They'll be pouring in and by the time the last one gets in I'll be saying, \"Goodbye. Make America great again. Goodbye darling.\" and they'll be pouring in. But, that deal, the Iran deal took so long to do. And one of the big magazines called me up and said, \"Tell me how long should've it taken?\" I said a day.","Maybe if you're doing poorly, two days. But give it a week. We've been negotiating this thing for years. For years! There's my man over there. Look at that book. Hold that book high. TRUMP, The Art of the deal. So he read it. You should negotiate it for us. Get me that book over there fellas. Mark , get me that book.","Bring that book over here. Bring that book over here. Mark! Come on Mark. Bring it over here. Get me that book. I'll sign it. I mean any guy. That much. We should send a copy to Obama and to Carry. Unbelievable. Unbelievable. Come here. Come here. Give me that. Who the hell signs books during his speech with me. Is this crazy.","Speaking about books, go out and get Crippled America. Believe it or not. First of all, it's doing great. But it is. I think really like the Art of the Deal was the hardest I ever worked on a book. Then I had a lot of bestsellers right after that. But it didn't work so hard. This is the second hardest I've ever worked in a book.","There it is, the second hardest. And it talks about Crippled America. I mean it talks about the problems of our country but it also talks about how to fix the problems. You know I don't like critics. I never like even movie critics, theater critics. They complain but they can't do it themselves. You know I don't like people that complain.","So we talk about fixing our country. Here, George. Thank you fellows, that's very nice. Oh this group from Alabama. I mean imagine the guys over there. \"Hi Mr. Trump would you sign the book?\" I'm making this speech. \"Would you?\" But the answer is yes. That's what happens when you're aggressive. He's an aggressive guy.","Are you looking for a job? I'll give you a job. So. So the Iran deal took so long. We didn't get anything. We lost every point. Went on forever. During intermissions they'd be celebrating in the streets of Iran. The negotiators and as Obama would say the supreme leader would stand up at the podium. And essentially say that the United States has really, really, really stupid leaders.","You know if I were doing a deal and somebody said the kinds of things that they said, Carry and Obama and all of us. Because sadly we're into the category. I mean, they're representing us. I would never go back to the table. You don't go back. Now in the case of the prisoners they should have said, \"Fellas.","We want the prisoners. Release them now.\" That was three years ago. Release them now. You don't need them you don't want them. Your people don't even know you have them. Release the prisoners now. It'll be good for the deal. It'll set a good tone. Really good tone. Release him now. They'll say, \"No, we won't do that.","And I'll say, \"Bye-bye.\" And I'll leave the room. I'll then double up or triple up the sanctions. I guarantee you within 48 hours they will call and they will say. We are going to release the prisoners but we're not doing it because of a threat. You know. Yes, OK. We're not doing it because of a threat. But we will release the prisoners.","And I'll say thank you very much. Now we start negotiating then I'd say, \"Listen, one thing you're not going to get is we're not going to give you $150. One hundred and fifty billion dollars! We're not giving up too much money. Too much money. Too much money. You know they're supplying many of the weapons that are being used against our young men and women over there.","You know that right.? The road bombs, many of the weapons that are being used are supplied by Iran. That was when they were poor. Now they're rich as hell. How stupid can we be? How stupid can we be? And that's just a look. That's just one of many. OK, so here's the story. I've been coming out and I've been talking for five months and I hate to say I'm a politician.","Would you believe it? I have very little respect for poll. I have some. Fine. But I have almost no respect. And now I'm a politician. And numbers just came out. Do we have any politicians in the room? Raise your hand. We don't. Yeah there are some in the back. Well I'm excluding them. They're fantastic leaders.","I don't know who the hell they are but I'm excluding them. They're great. They're fabulous. Anybody in the room that's a politician, I think you're fantastic. But outside of this room they don't have it, folks. They don't have it. They don't have it. So I've been doing this since June. And the pundits all said, \"Oh, he'll never run.","He'll never run. And then I ran. Then they said, \"Oh.\" They get paid money. I mean some of these guys got a half a million dollars that you watch on the various networks cable and otherwise. They're wrong. Well with me they've been wrong all the time. I'm driving them nuts. They don't know what to do. They don't know what to do. No, no they don't know what to do. I am driving them bonkers.","Guys like George Will, I swear. You know he looks smart because he has those little glasses. If you take the glasses away from him, he's a dummy. He needs those glasses. Those little spectacles you know I've seen that before. Hey, who else use glasses? Perry. Perry uses glasses. Right? They all went after me everyone but -- but these pundits.","So. They said he'll never run with such surety. You know they were so sure. So. Then they said he'll never file forme. That's where you sign your life away. It's only one page. He'll never file forme. I filed forme. Now they said well we've got problems. Then they said, \"Well he'll never file his financials.\" Because I'm a private company.","Nobody knew how well I was doing. You know they said he won't file for any of this maybe he's not as rich as people think. So what happened, it turned out that almost a hundred pages if the biggest one after me was like free. It's true. I mean forever. I'm not talking about now. I'm talking about -- so I had almost 100 pages.","I built an unbelievable company. So they say, \"He'll never file and if he does file you know you're entitled to massive delays. You could delay it forever so that nobody gets to see. You request a delay. So if he does file he'll request a delay. And the delay will take forever we'll never get to see his financials.\" And I said, \"Yeah but I built a great company.\" So not only did I not ask we have 30 days that you can have 45 days another 45 days then you can request special.","I could have taken it long after the election. The election. But they said, \"He'll ask for delays.\" So not only didn't I ask for delays, I filed and opened it up early. Early, less than 30 days and I had a team of lawyers and accountants. You wouldn't believe. And we filed this massive statement. And it showed that a much bigger, much richer, much -- much and I'm only by the way the reason I'm saying this because they'll only show that point.","They're not going to show what I'm going to see. Much bigger much stronger, much richer. The company is phenomenal. Some of the great assets of the world in Manhattan, Doral in Miami, hundreds of acres, Turnberry in Scotland. One of the great places of the world. Home of the Open Championship. One of the probably the most important golf tournament.","You know all great assets, tremendous cash, very low debt, very low debt. And I said in fact I told somebody. If I don't run, I'm going to file anyway because I want to brag about my state. So I was going to file it anyway. People don't know. You know these guys said, \"You'll never file.\" Maybe he's not as -- so it turned out much richer, much, much by two to three times what they thought.","And even a better company. So now they said, \"Well, we have a problem.\" The reason I tell you the last part is because that's the kind of thinking. That's the kind of mentality whether we'll get what's in there or not. That's the kind of thinking and mentality that we need in our country. We need that. We need that.","I didn't want to do this. You don't have a nice life. I live nicely. I have a wonderful family. Did anybody see Barbara Walters last night? How nice. How nice was she! Barbara Walters did a big special. A one hour special last night on my family and myself and it was really nice. So it was really great. It was really great.","Now they do it because it's going to get good ratings. I have to tell you. They don't do it for my health. But she was great and she's a legend. She's probably the greatest in the history of television. Greatest female, greatest woman in my opinion in the history of television. So she called. She said we'd like to do a whole big profile.","A one hour profile. So those of you that didn't get I don't know how the hell you see it's already over, right? But you'll see it. It will be around but it was great. I think it was really very successful. So what happens -- so what happens is we really need that ability because we have to take our country back.","We have to bring our jobs back. We have to bring trade back. We have to repeal Obamacare and we have to replace it with something great. We have to. We have to. We have to establish borders and we have to build a wall. We have to build a wall. We have to. And we will. And it'll be a great wall. It will be a great wall.","And believe it. I get the same reaction all over the place. And you know this is a wall. Who builds better than me? You know we have to rebuild -- nobody. We have to rebuild the infrastructure of our country. Our roads are falling apart, our bridges, 69 % of them are dangerous. Can you believe you're driving over a bridge?","You're innocently driving there, collapsing. You know in China they build bridges that make the George Washington Bridge look like peanuts. You're building them all over the place. They build them like they're peanuts. We don't do this anymore. We don't do anything. We're building a bridge in the San Francisco Bay.","You know who's building it? The Chinese are building a bridge for us. Now think of it. With massive cost overruns, massive.","They don't know what to do. And this is what's happening. So we're bringing our country back. So what's happening is until the attack in Paris. I was doing great. I was talking about trade because we're being ripped by China, Japan, Mexico, everybody and you've all heard that. You know Ford is going there.","You know Nabisco is leaving Chicago. They're moving their big factories, moving their plant where they make Oreos that I will never eat again. I'll never eat them again. I'm not eating them anymore. Which is good for a lot of reasons. But I'm not eating Oreos. No Oreos. Think of it. Nabisco is moving their big plant out of Chicago and into Mexico.","How is that good for us? It's not good for us, folks. I went to the best school. I'm trained. You don't have to go to the best school. You don't have to go to high school to know. It's not good. It's not good for us. And too many things. So I'd be talking about trade. I love talking about trade. I will be the greatest jobs president that God ever created that I could say.","That I can tell you, the best! And every poll says it. You know one day poll CNN. The one with the cameras all over the place there. Look at all those cameras. Back you believe. You know these other guys. They come up and they make a speech. First of all instead of having 10,000 people they'd have what, 40 or 50. On a football day they might have none but they'd have very few.","They would have none of these guys back there. Look at all those guys highly paid. Highly paid. Guys of which I think 25% of them are good people. OK. But look at all. No sir. Look at him. But so many things happen. And when they make a speech, nobody -- nobody cares. So they go around, make the same speech over and over and over and over and nobody cares.","And it's a different group of 30 to 100 people. I made a speech in New Hampshire recently. I had 4,500 people only determined by the size of the room. I had 4,500 people. Jeb Bush. No, no. Don't be mean. Jeb Bush was right down the road. He had 121 people. And you know what? My audience was energized. And his audience was like on some annex.","His audience was sleeping. We're doing great. It's the same. It's a message. But here's what I've been focused on. I've been focused on trade because I don't want to be ripped off anymore. And somebody we have somebody from Time magazine here. They want you to know I was on the cover recently. Now they're here again.","So I assume they're considering me for Man of the Year but it's you people. I assume. I don't know. I don't know. I say there's no way they give it to me. They can't because mentally they can't. They just can't. They can't do it even if I deserve it. They can't do it. You know when I had The Apprentice. It was the hottest show that first season, second season.","And everybody said, \"Oh, Trump is going to get the Emmy.\" It's easy. He's gonna get the Emmy for The Apprentice. And by the way they renewed it for two more years and I said I'm sorry I'm not doing it. I am. I love The Apprentice but I can't do it. But everybody said I was getting The Apprentice. And we went to the Emmy Awards.","My wife and I. And they said Ladies and gentlemen the next is for reality television. It's been a spectacular show. He's a spectacular host. It's been an amazing year. And I stood up and started walking because I think there was nobody even close and they said, \"The winner.\" I had already stood up. I felt like a schmuck.","They said the winner is Amazing Race. I said Amazing Race, that's a terrible thing. It's nothing. I killed it. But that's the way life is. Same thing with Time magazine. So who knows maybe they'll surprise us. I know one thing. They'll sell a lot more magazines and that could play into their thing. Well we'll see.","So. So I've been going around. And I've been having the biggest crowds by far, not Bernie. By the way Bernie's crowds are thanking Big League. Nobody cares. No Bernie Sanders. Was getting -- he was second I was by far first. You know in Mobile Alabama, I mean we have a lot of people. But in Mobile we had 35,000 people.","But in all fairness we didn't have football games all over the place. But Bernie Sanders, he blew it. When during the first debate he looked at Hillary and he said, \"Oh the emails. It's wonderful. It's fine.\" So he got a 20 second sound bite. He got some applause. And guess what. He's gone and now it's a whole different thing.","Which is good because honestly even as a candidate he'd be so easy to beat. He's going to be easy to beat. But I'll tell you because number one she doesn't have the strength and she doesn't have the stamina. And we need a president with unbelievable strength and stamina. And Hillary does not have it. She doesn't have the strength or the stamina.","And Bernie Sanders I mean he's over. He's over. How about the other guy O'Malley? His credentials. He's the mayor of Baltimore. OK, he did a great job in Baltimore. He's the mayor then he became the governor. He was a third-rate governor but he was the mayor of Baltimore. Now I'm going to decide to run for president.","That's what we have. These are professional politicians. All they're good at is running for office. That's all they're good at. They run. They win, they lose. They run. They just run. That's what they do. I'm against it right now. And I have to tell you. Some of the people that I'm running against, I like and respect.","Some of them I like and respect. Some of them should not be there. Some of them should not be there. You want to know who? No I don't want to do that. I want to be nice. I said to myself I'm going to be nice to them. You know I said I told a lot of the people backstage. I met some of the really great people backstage.","We're taking pictures, having a lot of fun. I said I'm going to be nice today, I'm not. I said it. I said it. I'm not going to call Jeb Bush, low energy. I'm not going to repeat it. I'm not going to say that Marco Rubio is a lightweight. I said I'm not doing it! I will not do it. I said that I will not say that Ben Carson last week was a bad week.","Because his top person and his top consultant said he's incapable of learning about foreign policy. That's a bad thing. And I won't say that he said in his book that he suffers from pathological disease. I said I'm not going to say it. So I'm not saying. And I'm not saying that he went after his mother and wanted to hit her over the head with a hammer.","Who does this? Who does this? And then he tried to stab somebody but the belt -- the belt got in the way. Oh, and the knife fell to the ground broken. And that he hit his friend in the face with a padlock. So I'm not saying any of those things about any of those people. Is that OK? All right. I mean, explain what are we doing?","So in the polls, in the polls I got by far No. 1 on the leadership. By far, by far No. 1 on the economy. It was so leadership and the economy was so off the charts like Biden. Well, CNN did it and there are other people CNN is back there. Is that right CNN? Look, I've got these cameras. If I'm telling a lie, I got problems.","You'll be reading about it tomorrow. So I killed them on leadership. I killed them on the economy, killed them on the military, and who's going to protect from ISIS? Oh I'll be so good for you. I'm going to make our military so powerful, so strong, so strong. I'm going to make it so incredibly powerful and strong that we'll never have to use it. Nobody's going to mess with us folks.","They're toying with us. Do you know how cheap it is? It's like you don't pick the fight with the guy you think you're not going to win unless you're stupid. Now there are stupid people around that do that. We're going to be so powerful. Do you know how cheap that is as opposed to fighting wars all the time when nobody respects us? We have a president that nobody respects.","We have generals. They're always on television. \"General I'd like to ask how are we doing with ISIS.\" Not good. They're very tough. They were very tough. They're very, very tough enemy. Not well. \"Well, General can we beat them?\" I don't know. Let me tell you my generals are going to kick ass. Then I go on television.","Then I go on. You know. I'm a big fan, General George Patton. Now, he was a horrible human being. He was profane, use terrible language. He had a lot of problems but he was one hell of a general. That's what I want folks. I don't want this stuff anymore. I don't want it. I'm a big fan also of General Douglas MacArthur.","Great. Very opposite. He was a man with tremendous style. The corn cob pipe, the high hat, the whole thing. He'd get out of the plane like the enemy was like to him, they were like garbage. Get them out of my way. Because he had a tremendous ego. We don't have that. We have -- I said lightweight before. We have a bunch of lightweights.","We have people that shouldn't be doing this. We have people that shouldn't be leading us. We have people -- and you know what in our services. I will find the general. I will find the admiral. I will find the guy. We have them -- we have general MacArthur, that we have General Patton. You got to know how to figure people.","We put people because we had one general who is really tough. I won't say his name. But he got fired because he was very very nasty. He wasn't politically correct. And everybody said he was our best general. And he used foul language all the time and he got fired because they interviewed him and he was cursing all over the magazine.","Bring him back and we might. Hey guy says bring him back. That's very good. But that's what we want. It's like -- again I can be more politically correct than anybody that lives on Fifth Avenue or Park Avenue much of which I built by the way. You know look I have a better education than almost all of these people.","You know I saw the other day. I think her name is Cokie Roberts. What a lightweight. She was on Morning Joe. Morning Joe was saying how well Trump is doing in the polls -- the polls. \"Well I don't know. I don't.\" And then I'm saying to myself you know they talk about these people as intellectuals. I'm much more of an intellectual.","I'm much smarter than them. I mean other people that are running aren't. I went to better schools generally. I went to the best schools. I went to -- I did well. But I'm -- and I have in my opinion a much higher aptitude. But then I say I hear them say, \"Well you know the intellectual elite of Washington.\" There's no intellect they're not even smart people most often.","They're not even smart people. And the reason I don't believe too much in political correctness because it takes too long. We don't have time to be politically correct. We've got to kick ass and get our country going again. We have to do. So and we're doing well. So last night, late. A great poll came out, Reuters.","Can't do better right? Reuters, such big stuff. They don't know me. They usually write bad things about me. They don't even like me, right? So you know, Reuters, they all write bad stuff. They love to write bad. The good stuff they don't want to write. They say -- I said, \"What about that story?\" No, no, no, we don't want to write them.","One group, Associated Press guy called, \"We're doing a story on four deals and the story is going to be this way. We're doing a negative survey. Actually there were four deals. That weren't great but I made a lot of money with them. That's not bad. So I said, \"What about the good deals? You got to do. \"No, no way . What about I made hundreds and 500 companies?","I made hundreds and hundreds of good deals. Hundreds! Even Time magazine, I was on the cover a month ago. And they put some bad deals. I said, \"Why do you do that? Why don't you put the good deals in?\" Don't want to do that stuff. I don't know why. I actually think it sells better. I make hundreds of good deals.","You build up a tremendous net worth, tremendous and they want to write about a couple of deals that weren't so good. That, I was very tough on. And I beat the banks. I beat those banks so badly they have headaches. And you know what? That's what we want. I think. And by the way, just so you understand, these bankers aren't like you know you think of the banker controlling the little old woman's money.","It's not that way. These are vicious. Sometimes vicious, terrible people. So you've got to win. So what happens is Reuters last night comes out with a poll. Trump, 38.8. Carson was honestly, he's dropping like a rock, folks. I hate it. Do we have any Carson fans here because he's dropping like a rock. Bad -- 14.7 so I'm 38.8. Now, remember that's 38.8. We have 15 people.","So how do you have 38.8%? Carson's at 14.7. Rubio is at 10 and Cruz is at seven. So we're winning. We're winning big in a place called Alabama. Big, big! Florida just came out. Trump, 37; the sitting senator, 16; and Carson, 60. We're winning all over the country. We're winning in Ohio against case which is totally overrated.","By the way we're winning all of it. Do I hear somebody over there? You know you have one guy over there shouting. We have thousands of people and you'll read about him tomorrow. They'll say that the room had a picket. You get him the hell out of here. Will you please get him. You. Throw him out. No, he had it the other day.","I got criticized. We had it the other night. I had a lot of people on one guy who was seriously obese. He complained when I mentioned that food stamps. We have a lot of people on food stamps and the guy went crazy and they said that wasn't politically correct. Who cares. We all have a way. Yes, you could get him out.","Yes get him out. Get him the hell out of here. Get him out of here. Get out! Get him out of here. Did you see Bernie Sanders? So he was politically correct. Two young women came up to the podium. They took over his microphone. I promise you that's not going to happen with me. I promise. Never gonna happen.","Not going to happen. Can't let that stuff happen. So what's happened then is I've been talking about trade-up and talking about all of the different things. Much of what you've heard and then a week ago, we had the horrible incident in Paris. And you know what? My whole speech changed and now it's about security.","It's about borders. It's about protection. It's about a lot of things. I'll take care. I'll take care of trade. I can do that out of my back pocket. I'll take care of trade. China will not be taken advantage of us any longer. Japan will not be taken advantage. We have a 400-billion-dollar trade imbalance each year with China.","Not going to happen. But what has happened is the conversation has changed. And people are now very much involved with ISIS and Al-Qaeda and all of the things that we're going through. And we're going to do things that are very smart and we -- what happened really? People said, \"I wonder will this affect Trump?\" Because you're number one.","They thought maybe this would affect me. And you know what? It has affected me. We've gone way up. We've gone way up. Because people know that I'm going to protect them. I'm going to protect them at the borders. I don't want the people from Syria coming in because we don't know who they are. We don't know who they are.","And I don't want them coming in. So, we are in a position now where, when we completed, our country is going to be greater than it's ever been. We have to move quickly. We have to move quickly. We can't afford to lose another election. We can't afford weak people. I think I'm a very nice person. I think a lot of people think that.","People that know me think I do. I pride myself on it. But this time it's not about nice. This is about real, real competence because we have to bring our country back. We have to bring it. Today, in the New York Times they had a report on the front page. It was false. Really false. That was today. Hey, you want to see something funny?","Look at those cameras that turned around. They're following the few people that are being thrown out now. Here's the story. No, no. No, no. Watch this. Look at those bloodsuckers back there. They're turned around. And they're following the people, right? Because you have a small group of people that made some noise.","They're being thrown out on their ass, right? So here's the thing. But listen to this. But look at those cameras. So they turned around. And yet whenever I speak when we have crowds like this all over the place, much bigger than this. You know we can fire the guy. You're fired. I said, \"We can't have any more people in the room.","It wasn't designed for this many people.\" So we have crowds. And my wife go home and I say, \"How was everything? Because it's on CNN it's on so many different places. It's on the , right? Oh it's very good. Good it's on all of them, FOX, everything. So I say, \"Did you see the crowd?\" She goes, \"No, I don't see what you mean.\" No, no they never showed the crowd.","They always have it fixed on your face. It's always fixed on your face. They don't want to show the cut because they're dishonest people and I'm telling you. No, they're dishonest people. The media is so dishonest. Like this story on the front page of The New York Times today, front page. I love being on the front page and I'm from New York.","New York Times front page! But it's a false story and bright Bart wrote it correctly and now the Times are suffering. But they write false stuff. And that had to do with whether or not we register people. OK. And I want those people coming in from Syria that Obama wants to let in. That people are fighting.","But the Republicans so far have been very ineffective where they're fighting. They've been, you know, it's funny. We finally win the Senate. We have the house. Nothing happens. It's always the same. We don't have the victories. We don't have the victory. So what happens is they write false stories. And in this case they got called on it by a lot of people because I mean you know you can only go so much.","OK. But these guys tell me. \"No, no we have to have it fixed\" because they can't say why. And then sometimes I'll say in Oklahoma we had 20,000 people recently in a field. It was supposed to be at a hotel, then the convention center. We had to go to a field because there were so many people. We had 20,000 people in Oklahoma.","Good football place, too, by the way. Pretty tough football place there. So what happens, I said. \"Fan the place.\" They refused to do it. The camera stays on me. I said, \"Fan them.\" They refused to every one of them. They refused to fan everyone. And now I'm looking and there's a few people that were shouting.","That got thrown out of here. And I see all the cameras are turned so they can turn the cameras. These are just lying people. They're bad people. The press is really bad. Fan the cameras over here, fellas. Fan the cameras show. Look, they don't do it. They don't do it. They don't do it. They're very dishonest people.","They tell you, \"You don't know?\" They don't do it. You'll go home. You'll watch on television. You wouldn't know if there were 10 people in this room or 10,000 people in this room. They don't do it. Fan the room fellas. Go ahead. Fan the room. Look they don't do it. They don't do it. Because they're really dishonest people.","Now, two minutes ago those cameras were turned all the way to the back of the room where the other people belong. They were terrible people. There in the back and they're fanning and they're showing it. It's disgusting. Be ashamed of yourselves, fellas. Be ashamed of yourself. So now. Now what happens is yesterday, there's some little wise guy.","He looked like he was 12 years old. He's got a camera. I'm signing autographs and I'm going like he's asking me questions talking about the wall, going to build a wall. We're going to build this and I'm signing autographs and this music playing in the background and I'm leaving. Bing! bing! bing! signing.","And this little wise guy sitting there. And he's asking me questions. It's not even important that I said, \"Who you are?\" He said, \"NBC.\" Once he said that I didn't bother answering anymore because although they did do me on Saturday Night Live and they were good. How about the other guys? How about the other guys ? They now want equal time.","OK. Like Pataki. Pataki wants equal time. Not going to help. He's got zero. They could give him 12 Saturday Night Lives an hour and a half a night. Not going to have any impact. You'll still have zero but that's what they want. So the database should get better. But they also said the wall and I said the wall.","And I was referring to the wall but database is OK. And watch lists is OK. And surveillance is OK if you don't mind. I want to be -- I want to surveil. I want surveillance of these people that are coming in the Trojan horse. I want to know who the hell they are. And the biggest story yesterday, the biggest was, \"Trump wants database on Muslims.\" I said what's happening here?","And I spoke to the reporter of the Times and I think I made it clear and I also said, \"Number one, you couldn't hear very well because just like walking over here you're not here.\" But regardless of that doesn't matter. But I do want database for those people coming in. But I also insist on the wall and it was all fine.","All of a sudden they end up with some stories I see. What are you talking about? So here's the story. Just to set it clear I want surveillance of these people. I want surveillance. If we have to and I don't care. I want it. Are you ready for this folks.? Are you ready? Oh they're going to make it such a big deal.","They're going to make it so big. He said something so politically incorrect. That's why we're going to hell because we're so politically incorrect. Such a big deal. Such a big deal. I want surveillance of certain mosques OK. If that's OK. I want surveillance. And you know what? We've had it before and we'll have it again.","Hey. I watched when the World Trade Center came tumbling down. And I watched in Jersey City, New Jersey where thousands and thousands of people were cheering as that building was coming down. Thousands of people were cheering. So something's going on. We got to find out what it is. I do want surveillance.","I will absolutely take database on the people coming in from Syria if we can't stop it. But we're going to. And if I win. I made it known. If I win, they're going back. We can't have them. They're going back. We can't have them. We can't have them. You see what happened. And you see it very clearly. A few nut jobs in Paris.","OK. A few total nuts, low lives, the guy with the dirty hat. They say they got him. I hope they got him to die. He's wearing a filthy dirty hat. That was the one they were calling for five days, the mastermind. Right, the mastermind. He is no mastermind. He's a -- he's a lowlife but they got him. But there are others out there.","We have to get him. And we have to use surveillance. Wait. We have to use surveillance. We have to be vigilant. And you know, the greatest thing is everybody in this room, everybody outside of this room, we have tremendous eyes and ears. When somebody is next to you in a house or an apartment, you can sort of see there's something going wrong.","Inform your local police. They're incredible people, the police. They're incredible people. They're incredible people. You don't have to call Washington where you're trying to figure out who the hell do I call? I just met a lot of young police right now when I came off the plane. These are incredible tough cookies.","They want to do a great job. Give them back their power and you're going to see a lot of good things happen. And sure. And by the way, you're always going to have a bad incident and a bad apple. You have that in any business no matter what. You're going to have things. But we need vigilance. When you see something going on at the next house at the next apartment, when you see certain people walking in and out all day carrying things, inform your local police.","Whether it's Birmingham or wherever it might be they will take over. They know what to do. They'll call Washington. They'll get the guys. Those guys don't have a chance but the eyes and ears. We have millions and millions and millions of eyes and ears. You can solve the problem. There's nobody like the people.","There's nobody like the people. So we are going to have surveillance. We are going to have and the most interesting thing that happened is all of the talk about the word because that was the other thing in the polls that Trump is by far, by far the best on border security. So that's why when Paris happened, the attack in Paris.","That's why I went up because people said he's the only one that says it like it is. So I went up and believe me you're going to be really secure. You're going to be more secure that even you know and you're a fan. OK. You're going to be secure. We're not playing games. We're not playing games. We will not be playing games.","When I brought up illegal immigration. It was like like a bomb dropped. Nobody was talking about the subject. I brought it up and Rush Limbaugh. Good guy. He said nobody. Good guy right? Good guy, good guy. Really a fair guy. And he says the truth. Maybe that's because he likes me I don't. But Rush said nobody has ever taken in coming.","Nobody like Donald Trump. And for two weeks I did. It was unbelievable. I said, \"Is this going to be? I can't do this for six, seven months.\" But then it died down because people started seeing I was right. And then I became the darling. And then you had a lot of bad things happen. You had Kate in San Francisco get shot in the back by a guy that came over five times probably pushed over.","Get out of here! We don't want to take care of you. Let the dummies from the United States take care of you. And he shot Kate, beautiful Kate from San Francisco in the back, holding her father's hands, looking out onto the water and she dropped, and the father. And the family will never be the same great family.","And then you had Jamiel whose son is so great. Senior and Junior and the father is the apple of the father's. A great football player getting ready to go to college was going to go on a scholarship, never had a trouble in his life. Walking home from the deli where he bought himself and his father a sandwich.","Called his father said, \"Pop, I'll be home in three to four minutes.\" And then the father heard a gunshot outside. Heard it from the house. And he knew immediately there was a problem and he ran out and his son was laying on the street, almost dead with bullet holes in his head. With his hands blown off because he was lying down going like this and his hands were blown off because it was a 45. And then you have three, four weeks ago you had a woman, a veteran, 66-year-old veteran, raped, sodomized and killed by an illegal immigrant.","Raped, sodomized and killed. Sixty six years old, and so many more. People said, \"You know Trump is right.\" Then you have the drug problem. Our cities are infested with drugs our youth is going. You should see New Hampshire has a heroin problem. The likes of which nobody can even understand. It's coming from an area that we can't stop because it's destroying our cities.","It's destroying, most importantly, is destroying our youth. It's destroying our future. And we're going to stop it. We're going to stop it. We're going to stop. So all of the other things that I usually talk about is now. But they're all very important. Don't get me wrong. Obamacare, we mentioned trade. We mentioned all of these things are all very important.","Jobs! jobs we mentioned. I'm going to create so many jobs we mentioned. But let me just tell you. But what we're going to do so is we're going to be vigilant at our borders and we're not letting people come into our country unless they come in legally. They've got to come in legally. They're going to come in legally or they're not coming in at all.","And we're not going to be the stupids anymore with the stupids we're known as the stupids with the anchor babies. A person has a baby. She walks across a line. She has the baby in the United States. Now we have the baby. Fourteenth Amendment except for one thing, they didn't read the 14th Amendment right because it doesn't say that.","It doesn't say that. It doesn't say that. And for years I've been hearing it did but for years I've been building buildings and creating jobs. I've created tens of thousands of jobs. I've been doing jobs. So I never really gave it that much thought. But now that I'm doing this. I want to make our country so great now that I'm doing this.","I said it can't be right. Now, if somebody has a baby in Mexico they walk in first if they could walk across the border. OK. They'd be out of there so fast. But if they did and you said, \"Oh my baby is now a citizen of Mexico.\" They would laugh at you. They throw you the hell out like a dog. And by the way that's true with almost every country.","But here, you have a baby. And now we have to take care of that person for 85 years or however long that but -- but it doesn't read that way. Then they said oh you need a constitutional amendment which will take years and years to get. You don't need -- you need a simple act of Congress. And in my opinion you don't even need that because if they come in illegally they're not supposed to be having a baby here.","OK. So I don't even think of it. And we're talking about hundreds of thousands of people a year. So here's what we're going to do. If I win a lot of good things are going to happen. First of all, we're going to win so much. We're going to win. We're going to win. So I sometimes joke. I like these people much better.","He says when we win. We are going to have so much victory and I joke about I say you can have wins and wins and wins you're going to get sick of winning and Dennis I can't joke because you never get sick of winning, right? Right. Your football teams. If your football team goes undefeated every year and every year you never get tired of it right?","Never. Never get them. But we're going to have great victories again. We don't win anymore as a country. We don't win. We lose on everything. We lose with ISIS, we lose with everything. We lose with trade. We lose with health care. Have you seen the premiums on Obamacare? Up 35%, 45%, 55%. It's a disaster.","And now they're saying it's a disaster and now they're saying we have to go back to Congress because in '17 it all exploded. Whoever is going to be president is not going to be easy but I'll solve the problem though. But it's not working. So just to finish off and I give you my word. I am going to work so hard.","I'm self-funding this campaign. I'm the only one. I'm the only -- I'm the only one. I don't know if that's a big deal to a lot of people. But I could have -- I could have fun. You know these super PACs are a total scam. The super PACs have all these money. They'll do negative ads on me all over the place.","A lot of them will be false. It's also but by the time I end up winning, what happens is it's too late the election's over. So what do I get? The super PACs are a scam. They have total control over the candidates. They do whatever the person that puts the money up once. If a man owns a company in China and he gives money to a super PAC, Jeb Bush was over as an example.","I don't want to keep using his name but he's so -- he's so easy. He's so easy. No. Jeb Bush was over in Germany or his people are over in Germany trying to win. Well then you'll see a German company has gotten a big approval from the United States. That's what happened, folks. Folks, I know the lobbyists.","They've worked for me. Nobody knows the game better than I do. I don't want anything. I work for you. I work for you. I work for you. I don't want it. I don't want it. We're going to do what's right for the country. We're not going to let Mexico take our car business which by the way they're going to become the car capital of the world pretty soon.","Ford is building a massive plant there. Others are building massive plants. We don't even fight. We don't even fight. You have corporate inversions which by the way, the other candidates don't even know what it is. But essentially companies are leaving the United States and going to other lands, to other countries and they're dropping thousands and tens of thousands of jobs.","And now it's starting to get bad. And under my tax plan where I'm cutting everybody's taxes big league -- big league and we're cutting corporate taxes. We're the highest tax nation in the world. Under my plan we'll be one of the lowest. And we're going to be a dynamic economy again. We're going to be dynamic.","And we're going to bring back those trillions of dollars. Trillions of dollars! Trillions that companies can't get but they can't get it back. They can't get it back because the politicians they all agree it should come back but they can't make a deal because there's gridlock in Washington. So we're gonna bring it back and that money is going to be put to work here and we're going to do it. So, what you're seeing and a friend of mine called me up. He said it's unbelievable.","What's happening? What you're seeing is a movement. This isn't about me. What you're seeing is a movement. No matter where I go it's the same thing. It's the same love. It's like love in the room. It's love in the room. No other people's love in the room. And the American dream and I say it. The American dream is dead! But we're going to make it bigger and better and stronger than ever before.","And we are going to make America great again. Thank you. I love you. Thank you. Thank you. Thank you everybody. I love you. We're going to get it done. Thank you."],"text":" We love you. We love you. Birmingham, we love you. Thank you. Thank you. Thank you very much everybody. And we're going to have a lot of fun and then I'll get you out to those football games to have this many people. I'm getting you out of here. I'm getting you out. Maybe I'll go watch one of them with you. I'll tell you I love it. And you do have great teams. You do have great football players and great things. So a lot of things have happened over the last week. A lot of bad things actually. We have a president whose represented very poorly, very, very poorly. Horribly, actually. We have a situation where ISIS has raised its ugly head again. And we got to chop off that head like they're chopping of our people. So terrible. You know I did a lot of tweeting @realDonaldTrump, right? @realDonald Trump. And I said you can call these dopes. They're dopes. They've got IQ's that are low. Believe me. You can't call the leader of the dopes a mastermind. You can't do it. I've been watching for a week and now I will tell you. I really was -- when I said the same thing at another speech recently. I got a lot of play. Because it's -- you know. They're taking the Internet and using it better than our country and certainly our politicians and our executives. They're using it better than anybody. And our youth is susceptible. In all fairness they're susceptible. And you have these kids coming home and they say, \"Mom and dad, did you see the mastermind?\" The mastermind, he's a moron that by the way he's also dead. Which is great. Which is great. And I tweeted. I said don't call a mastermind. You're building them up. You're building up their image. You know we have a president that doesn't know anything about what we're talking about. He doesn't know. In Iran he calls the head, the Supreme Leader. Yes. The supreme leader. I promise you I will never call him the supreme leader. I promise you. I'll call him, \"Hey you. Hey, how you doing? Everything good? How you doing? Everything good?\" Guess what? We're going to renegotiate your deal. We're going to make it much better. We're going to renegotiate that sucker big league and you're going to give us back those prisoners before I take office. OK. You're going to give us back. You're going to give them back. You're giving them back. How about that deal? How about that deal? I mean here we have Carry who doesn't have a clue. Weak, ineffective begging to make a deal and we had all the cards. We had $150 billion to negotiate with. And what happens? What happens? He is a loser. Yes. Oh, he just said he's a loser. You know that's such a descriptive term. Some of the press said I use it too much. But there's just no better word. You know I went to Ivy League College. I know a lot of words. But somehow loser is so nice. It's such a good word. Such a good word. No, no, only in describing certain people. 'Course that's a lot of people. It's a lot of people. But you look, $150 billion dollars going to a terrorist nation. They got everything they wanted. How about the self-inspection? They self-inspect. How about that one? OK. When they don't self-inspect, we have 24 hours. Meaning, they get 24 hours that shoots into 24 days but the 24 hours can go on forever. Before we get the approval to start the clock ticking for the 24 days. But even if it didn't -- 24 days. We think you're doing something wrong. Oh, OK. Come back in 24 days was there. By that time I have a broom-clean I used to clean garages for my father and I always used to say broom-clean and my father would say to me, \"Son. I want that garage in mint condition.\" He used to use the term mint condition. Just a term he used that meant immaculate. Not like what we do nowadays. Things aren't so immaculate. But thank you. Thank you. Well I don't know. I think he said something good. Thank you. But what happens? What we need, what we need is, we need leadership so badly. We can be so great again. We're laughed at. We're scoffed at. We're robbed. We're robbed! We're robbed! You look at the Iran deal. You look at -- and by the way, speaking of Iran, the prisoners. So you say why don't we have them back? And they said because we didn't want to complicate the deal. Do you believe it? So we have four men over there right now in the worst prison. The worst. I met one of them, a Christian, a pastor. I met his wife twice. So lovely, cannot understand. Nobody speaks so nobody calls and nobody talks to her about the negotiation. And that should have been done early. Did you ever see a deal take so long? We're giving them all of this money. Look at that. People are still pouring in. You are so lucky to be in here, by the way. You're so lucky. People a lot of people are outside. By the way. If you want, we can wait about an hour and get everybody in. You want to do that? I don't think so. They're going to be angry. They'll be pouring in and by the time the last one gets in I'll be saying, \"Goodbye. Make America great again. Goodbye darling.\" and they'll be pouring in. But, that deal, the Iran deal took so long to do. And one of the big magazines called me up and said, \"Tell me how long should've it taken?\" I said a day. Maybe if you're doing poorly, two days. But give it a week. We've been negotiating this thing for years. For years! There's my man over there. Look at that book. Hold that book high. TRUMP, The Art of the deal. So he read it. You should negotiate it for us. Get me that book over there fellas. Mark , get me that book. Bring that book over here. Bring that book over here. Mark! Come on Mark. Bring it over here. Get me that book. I'll sign it. I mean any guy. That much. We should send a copy to Obama and to Carry. Unbelievable. Unbelievable. Come here. Come here. Give me that. Who the hell signs books during his speech with me. Is this crazy. Speaking about books, go out and get Crippled America. Believe it or not. First of all, it's doing great. But it is. I think really like the Art of the Deal was the hardest I ever worked on a book. Then I had a lot of bestsellers right after that. But it didn't work so hard. This is the second hardest I've ever worked in a book. There it is, the second hardest. And it talks about Crippled America. I mean it talks about the problems of our country but it also talks about how to fix the problems. You know I don't like critics. I never like even movie critics, theater critics. They complain but they can't do it themselves. You know I don't like people that complain. So we talk about fixing our country. Here, George. Thank you fellows, that's very nice. Oh this group from Alabama. I mean imagine the guys over there. \"Hi Mr. Trump would you sign the book?\" I'm making this speech. \"Would you?\" But the answer is yes. That's what happens when you're aggressive. He's an aggressive guy. Are you looking for a job? I'll give you a job. So. So the Iran deal took so long. We didn't get anything. We lost every point. Went on forever. During intermissions they'd be celebrating in the streets of Iran. The negotiators and as Obama would say the supreme leader would stand up at the podium. And essentially say that the United States has really, really, really stupid leaders. You know if I were doing a deal and somebody said the kinds of things that they said, Carry and Obama and all of us. Because sadly we're into the category. I mean, they're representing us. I would never go back to the table. You don't go back. Now in the case of the prisoners they should have said, \"Fellas. We want the prisoners. Release them now.\" That was three years ago. Release them now. You don't need them you don't want them. Your people don't even know you have them. Release the prisoners now. It'll be good for the deal. It'll set a good tone. Really good tone. Release him now. They'll say, \"No, we won't do that. And I'll say, \"Bye-bye.\" And I'll leave the room. I'll then double up or triple up the sanctions. I guarantee you within 48 hours they will call and they will say. We are going to release the prisoners but we're not doing it because of a threat. You know. Yes, OK. We're not doing it because of a threat. But we will release the prisoners. And I'll say thank you very much. Now we start negotiating then I'd say, \"Listen, one thing you're not going to get is we're not going to give you $150. One hundred and fifty billion dollars! We're not giving up too much money. Too much money. Too much money. You know they're supplying many of the weapons that are being used against our young men and women over there. You know that right.? The road bombs, many of the weapons that are being used are supplied by Iran. That was when they were poor. Now they're rich as hell. How stupid can we be? How stupid can we be? And that's just a look. That's just one of many. OK, so here's the story. I've been coming out and I've been talking for five months and I hate to say I'm a politician. Would you believe it? I have very little respect for poll. I have some. Fine. But I have almost no respect. And now I'm a politician. And numbers just came out. Do we have any politicians in the room? Raise your hand. We don't. Yeah there are some in the back. Well I'm excluding them. They're fantastic leaders. I don't know who the hell they are but I'm excluding them. They're great. They're fabulous. Anybody in the room that's a politician, I think you're fantastic. But outside of this room they don't have it, folks. They don't have it. They don't have it. So I've been doing this since June. And the pundits all said, \"Oh, he'll never run. He'll never run. And then I ran. Then they said, \"Oh.\" They get paid money. I mean some of these guys got a half a million dollars that you watch on the various networks cable and otherwise. They're wrong. Well with me they've been wrong all the time. I'm driving them nuts. They don't know what to do. They don't know what to do. No, no they don't know what to do. I am driving them bonkers. Guys like George Will, I swear. You know he looks smart because he has those little glasses. If you take the glasses away from him, he's a dummy. He needs those glasses. Those little spectacles you know I've seen that before. Hey, who else use glasses? Perry. Perry uses glasses. Right? They all went after me everyone but -- but these pundits. So. They said he'll never run with such surety. You know they were so sure. So. Then they said he'll never file forme. That's where you sign your life away. It's only one page. He'll never file forme. I filed forme. Now they said well we've got problems. Then they said, \"Well he'll never file his financials.\" Because I'm a private company. Nobody knew how well I was doing. You know they said he won't file for any of this maybe he's not as rich as people think. So what happened, it turned out that almost a hundred pages if the biggest one after me was like free. It's true. I mean forever. I'm not talking about now. I'm talking about -- so I had almost 100 pages. I built an unbelievable company. So they say, \"He'll never file and if he does file you know you're entitled to massive delays. You could delay it forever so that nobody gets to see. You request a delay. So if he does file he'll request a delay. And the delay will take forever we'll never get to see his financials.\" And I said, \"Yeah but I built a great company.\" So not only did I not ask we have 30 days that you can have 45 days another 45 days then you can request special. I could have taken it long after the election. The election. But they said, \"He'll ask for delays.\" So not only didn't I ask for delays, I filed and opened it up early. Early, less than 30 days and I had a team of lawyers and accountants. You wouldn't believe. And we filed this massive statement. And it showed that a much bigger, much richer, much -- much and I'm only by the way the reason I'm saying this because they'll only show that point. They're not going to show what I'm going to see. Much bigger much stronger, much richer. The company is phenomenal. Some of the great assets of the world in Manhattan, Doral in Miami, hundreds of acres, Turnberry in Scotland. One of the great places of the world. Home of the Open Championship. One of the probably the most important golf tournament. You know all great assets, tremendous cash, very low debt, very low debt. And I said in fact I told somebody. If I don't run, I'm going to file anyway because I want to brag about my state. So I was going to file it anyway. People don't know. You know these guys said, \"You'll never file.\" Maybe he's not as -- so it turned out much richer, much, much by two to three times what they thought. And even a better company. So now they said, \"Well, we have a problem.\" The reason I tell you the last part is because that's the kind of thinking. That's the kind of mentality whether we'll get what's in there or not. That's the kind of thinking and mentality that we need in our country. We need that. We need that. I didn't want to do this. You don't have a nice life. I live nicely. I have a wonderful family. Did anybody see Barbara Walters last night? How nice. How nice was she! Barbara Walters did a big special. A one hour special last night on my family and myself and it was really nice. So it was really great. It was really great. Now they do it because it's going to get good ratings. I have to tell you. They don't do it for my health. But she was great and she's a legend. She's probably the greatest in the history of television. Greatest female, greatest woman in my opinion in the history of television. So she called. She said we'd like to do a whole big profile. A one hour profile. So those of you that didn't get I don't know how the hell you see it's already over, right? But you'll see it. It will be around but it was great. I think it was really very successful. So what happens -- so what happens is we really need that ability because we have to take our country back. We have to bring our jobs back. We have to bring trade back. We have to repeal Obamacare and we have to replace it with something great. We have to. We have to. We have to establish borders and we have to build a wall. We have to build a wall. We have to. And we will. And it'll be a great wall. It will be a great wall. And believe it. I get the same reaction all over the place. And you know this is a wall. Who builds better than me? You know we have to rebuild -- nobody. We have to rebuild the infrastructure of our country. Our roads are falling apart, our bridges, 69 % of them are dangerous. Can you believe you're driving over a bridge? You're innocently driving there, collapsing. You know in China they build bridges that make the George Washington Bridge look like peanuts. You're building them all over the place. They build them like they're peanuts. We don't do this anymore. We don't do anything. We're building a bridge in the San Francisco Bay. You know who's building it? The Chinese are building a bridge for us. Now think of it. With massive cost overruns, massive. They don't know what to do. And this is what's happening. So we're bringing our country back. So what's happening is until the attack in Paris. I was doing great. I was talking about trade because we're being ripped by China, Japan, Mexico, everybody and you've all heard that. You know Ford is going there. You know Nabisco is leaving Chicago. They're moving their big factories, moving their plant where they make Oreos that I will never eat again. I'll never eat them again. I'm not eating them anymore. Which is good for a lot of reasons. But I'm not eating Oreos. No Oreos. Think of it. Nabisco is moving their big plant out of Chicago and into Mexico. How is that good for us? It's not good for us, folks. I went to the best school. I'm trained. You don't have to go to the best school. You don't have to go to high school to know. It's not good. It's not good for us. And too many things. So I'd be talking about trade. I love talking about trade. I will be the greatest jobs president that God ever created that I could say. That I can tell you, the best! And every poll says it. You know one day poll CNN. The one with the cameras all over the place there. Look at all those cameras. Back you believe. You know these other guys. They come up and they make a speech. First of all instead of having 10,000 people they'd have what, 40 or 50. On a football day they might have none but they'd have very few. They would have none of these guys back there. Look at all those guys highly paid. Highly paid. Guys of which I think 25% of them are good people. OK. But look at all. No sir. Look at him. But so many things happen. And when they make a speech, nobody -- nobody cares. So they go around, make the same speech over and over and over and over and nobody cares. And it's a different group of 30 to 100 people. I made a speech in New Hampshire recently. I had 4,500 people only determined by the size of the room. I had 4,500 people. Jeb Bush. No, no. Don't be mean. Jeb Bush was right down the road. He had 121 people. And you know what? My audience was energized. And his audience was like on some annex. His audience was sleeping. We're doing great. It's the same. It's a message. But here's what I've been focused on. I've been focused on trade because I don't want to be ripped off anymore. And somebody we have somebody from Time magazine here. They want you to know I was on the cover recently. Now they're here again. So I assume they're considering me for Man of the Year but it's you people. I assume. I don't know. I don't know. I say there's no way they give it to me. They can't because mentally they can't. They just can't. They can't do it even if I deserve it. They can't do it. You know when I had The Apprentice. It was the hottest show that first season, second season. And everybody said, \"Oh, Trump is going to get the Emmy.\" It's easy. He's gonna get the Emmy for The Apprentice. And by the way they renewed it for two more years and I said I'm sorry I'm not doing it. I am. I love The Apprentice but I can't do it. But everybody said I was getting The Apprentice. And we went to the Emmy Awards. My wife and I. And they said Ladies and gentlemen the next is for reality television. It's been a spectacular show. He's a spectacular host. It's been an amazing year. And I stood up and started walking because I think there was nobody even close and they said, \"The winner.\" I had already stood up. I felt like a schmuck. They said the winner is Amazing Race. I said Amazing Race, that's a terrible thing. It's nothing. I killed it. But that's the way life is. Same thing with Time magazine. So who knows maybe they'll surprise us. I know one thing. They'll sell a lot more magazines and that could play into their thing. Well we'll see. So. So I've been going around. And I've been having the biggest crowds by far, not Bernie. By the way Bernie's crowds are thanking Big League. Nobody cares. No Bernie Sanders. Was getting -- he was second I was by far first. You know in Mobile Alabama, I mean we have a lot of people. But in Mobile we had 35,000 people. But in all fairness we didn't have football games all over the place. But Bernie Sanders, he blew it. When during the first debate he looked at Hillary and he said, \"Oh the emails. It's wonderful. It's fine.\" So he got a 20 second sound bite. He got some applause. And guess what. He's gone and now it's a whole different thing. Which is good because honestly even as a candidate he'd be so easy to beat. He's going to be easy to beat. But I'll tell you because number one she doesn't have the strength and she doesn't have the stamina. And we need a president with unbelievable strength and stamina. And Hillary does not have it. She doesn't have the strength or the stamina. And Bernie Sanders I mean he's over. He's over. How about the other guy O'Malley? His credentials. He's the mayor of Baltimore. OK, he did a great job in Baltimore. He's the mayor then he became the governor. He was a third-rate governor but he was the mayor of Baltimore. Now I'm going to decide to run for president. That's what we have. These are professional politicians. All they're good at is running for office. That's all they're good at. They run. They win, they lose. They run. They just run. That's what they do. I'm against it right now. And I have to tell you. Some of the people that I'm running against, I like and respect. Some of them I like and respect. Some of them should not be there. Some of them should not be there. You want to know who? No I don't want to do that. I want to be nice. I said to myself I'm going to be nice to them. You know I said I told a lot of the people backstage. I met some of the really great people backstage. We're taking pictures, having a lot of fun. I said I'm going to be nice today, I'm not. I said it. I said it. I'm not going to call Jeb Bush, low energy. I'm not going to repeat it. I'm not going to say that Marco Rubio is a lightweight. I said I'm not doing it! I will not do it. I said that I will not say that Ben Carson last week was a bad week. Because his top person and his top consultant said he's incapable of learning about foreign policy. That's a bad thing. And I won't say that he said in his book that he suffers from pathological disease. I said I'm not going to say it. So I'm not saying. And I'm not saying that he went after his mother and wanted to hit her over the head with a hammer. Who does this? Who does this? And then he tried to stab somebody but the belt -- the belt got in the way. Oh, and the knife fell to the ground broken. And that he hit his friend in the face with a padlock. So I'm not saying any of those things about any of those people. Is that OK? All right. I mean, explain what are we doing? So in the polls, in the polls I got by far No. 1 on the leadership. By far, by far No. 1 on the economy. It was so leadership and the economy was so off the charts like Biden. Well, CNN did it and there are other people CNN is back there. Is that right CNN? Look, I've got these cameras. If I'm telling a lie, I got problems. You'll be reading about it tomorrow. So I killed them on leadership. I killed them on the economy, killed them on the military, and who's going to protect from ISIS? Oh I'll be so good for you. I'm going to make our military so powerful, so strong, so strong. I'm going to make it so incredibly powerful and strong that we'll never have to use it. Nobody's going to mess with us folks. They're toying with us. Do you know how cheap it is? It's like you don't pick the fight with the guy you think you're not going to win unless you're stupid. Now there are stupid people around that do that. We're going to be so powerful. Do you know how cheap that is as opposed to fighting wars all the time when nobody respects us? We have a president that nobody respects. We have generals. They're always on television. \"General I'd like to ask how are we doing with ISIS.\" Not good. They're very tough. They were very tough. They're very, very tough enemy. Not well. \"Well, General can we beat them?\" I don't know. Let me tell you my generals are going to kick ass. Then I go on television. Then I go on. You know. I'm a big fan, General George Patton. Now, he was a horrible human being. He was profane, use terrible language. He had a lot of problems but he was one hell of a general. That's what I want folks. I don't want this stuff anymore. I don't want it. I'm a big fan also of General Douglas MacArthur. Great. Very opposite. He was a man with tremendous style. The corn cob pipe, the high hat, the whole thing. He'd get out of the plane like the enemy was like to him, they were like garbage. Get them out of my way. Because he had a tremendous ego. We don't have that. We have -- I said lightweight before. We have a bunch of lightweights. We have people that shouldn't be doing this. We have people that shouldn't be leading us. We have people -- and you know what in our services. I will find the general. I will find the admiral. I will find the guy. We have them -- we have general MacArthur, that we have General Patton. You got to know how to figure people. We put people because we had one general who is really tough. I won't say his name. But he got fired because he was very very nasty. He wasn't politically correct. And everybody said he was our best general. And he used foul language all the time and he got fired because they interviewed him and he was cursing all over the magazine. Bring him back and we might. Hey guy says bring him back. That's very good. But that's what we want. It's like -- again I can be more politically correct than anybody that lives on Fifth Avenue or Park Avenue much of which I built by the way. You know look I have a better education than almost all of these people. You know I saw the other day. I think her name is Cokie Roberts. What a lightweight. She was on Morning Joe. Morning Joe was saying how well Trump is doing in the polls -- the polls. \"Well I don't know. I don't.\" And then I'm saying to myself you know they talk about these people as intellectuals. I'm much more of an intellectual. I'm much smarter than them. I mean other people that are running aren't. I went to better schools generally. I went to the best schools. I went to -- I did well. But I'm -- and I have in my opinion a much higher aptitude. But then I say I hear them say, \"Well you know the intellectual elite of Washington.\" There's no intellect they're not even smart people most often. They're not even smart people. And the reason I don't believe too much in political correctness because it takes too long. We don't have time to be politically correct. We've got to kick ass and get our country going again. We have to do. So and we're doing well. So last night, late. A great poll came out, Reuters. Can't do better right? Reuters, such big stuff. They don't know me. They usually write bad things about me. They don't even like me, right? So you know, Reuters, they all write bad stuff. They love to write bad. The good stuff they don't want to write. They say -- I said, \"What about that story?\" No, no, no, we don't want to write them. One group, Associated Press guy called, \"We're doing a story on four deals and the story is going to be this way. We're doing a negative survey. Actually there were four deals. That weren't great but I made a lot of money with them. That's not bad. So I said, \"What about the good deals? You got to do. \"No, no way . What about I made hundreds and 500 companies? I made hundreds and hundreds of good deals. Hundreds! Even Time magazine, I was on the cover a month ago. And they put some bad deals. I said, \"Why do you do that? Why don't you put the good deals in?\" Don't want to do that stuff. I don't know why. I actually think it sells better. I make hundreds of good deals. You build up a tremendous net worth, tremendous and they want to write about a couple of deals that weren't so good. That, I was very tough on. And I beat the banks. I beat those banks so badly they have headaches. And you know what? That's what we want. I think. And by the way, just so you understand, these bankers aren't like you know you think of the banker controlling the little old woman's money. It's not that way. These are vicious. Sometimes vicious, terrible people. So you've got to win. So what happens is Reuters last night comes out with a poll. Trump, 38.8. Carson was honestly, he's dropping like a rock, folks. I hate it. Do we have any Carson fans here because he's dropping like a rock. Bad -- 14.7 so I'm 38.8. Now, remember that's 38.8. We have 15 people. So how do you have 38.8%? Carson's at 14.7. Rubio is at 10 and Cruz is at seven. So we're winning. We're winning big in a place called Alabama. Big, big! Florida just came out. Trump, 37; the sitting senator, 16; and Carson, 60. We're winning all over the country. We're winning in Ohio against case which is totally overrated. By the way we're winning all of it. Do I hear somebody over there? You know you have one guy over there shouting. We have thousands of people and you'll read about him tomorrow. They'll say that the room had a picket. You get him the hell out of here. Will you please get him. You. Throw him out. No, he had it the other day. I got criticized. We had it the other night. I had a lot of people on one guy who was seriously obese. He complained when I mentioned that food stamps. We have a lot of people on food stamps and the guy went crazy and they said that wasn't politically correct. Who cares. We all have a way. Yes, you could get him out. Yes get him out. Get him the hell out of here. Get him out of here. Get out! Get him out of here. Did you see Bernie Sanders? So he was politically correct. Two young women came up to the podium. They took over his microphone. I promise you that's not going to happen with me. I promise. Never gonna happen. Not going to happen. Can't let that stuff happen. So what's happened then is I've been talking about trade-up and talking about all of the different things. Much of what you've heard and then a week ago, we had the horrible incident in Paris. And you know what? My whole speech changed and now it's about security. It's about borders. It's about protection. It's about a lot of things. I'll take care. I'll take care of trade. I can do that out of my back pocket. I'll take care of trade. China will not be taken advantage of us any longer. Japan will not be taken advantage. We have a 400-billion-dollar trade imbalance each year with China. Not going to happen. But what has happened is the conversation has changed. And people are now very much involved with ISIS and Al-Qaeda and all of the things that we're going through. And we're going to do things that are very smart and we -- what happened really? People said, \"I wonder will this affect Trump?\" Because you're number one. They thought maybe this would affect me. And you know what? It has affected me. We've gone way up. We've gone way up. Because people know that I'm going to protect them. I'm going to protect them at the borders. I don't want the people from Syria coming in because we don't know who they are. We don't know who they are. And I don't want them coming in. So, we are in a position now where, when we completed, our country is going to be greater than it's ever been. We have to move quickly. We have to move quickly. We can't afford to lose another election. We can't afford weak people. I think I'm a very nice person. I think a lot of people think that. People that know me think I do. I pride myself on it. But this time it's not about nice. This is about real, real competence because we have to bring our country back. We have to bring it. Today, in the New York Times they had a report on the front page. It was false. Really false. That was today. Hey, you want to see something funny? Look at those cameras that turned around. They're following the few people that are being thrown out now. Here's the story. No, no. No, no. Watch this. Look at those bloodsuckers back there. They're turned around. And they're following the people, right? Because you have a small group of people that made some noise. They're being thrown out on their ass, right? So here's the thing. But listen to this. But look at those cameras. So they turned around. And yet whenever I speak when we have crowds like this all over the place, much bigger than this. You know we can fire the guy. You're fired. I said, \"We can't have any more people in the room. It wasn't designed for this many people.\" So we have crowds. And my wife go home and I say, \"How was everything? Because it's on CNN it's on so many different places. It's on the , right? Oh it's very good. Good it's on all of them, FOX, everything. So I say, \"Did you see the crowd?\" She goes, \"No, I don't see what you mean.\" No, no they never showed the crowd. They always have it fixed on your face. It's always fixed on your face. They don't want to show the cut because they're dishonest people and I'm telling you. No, they're dishonest people. The media is so dishonest. Like this story on the front page of The New York Times today, front page. I love being on the front page and I'm from New York. New York Times front page! But it's a false story and bright Bart wrote it correctly and now the Times are suffering. But they write false stuff. And that had to do with whether or not we register people. OK. And I want those people coming in from Syria that Obama wants to let in. That people are fighting. But the Republicans so far have been very ineffective where they're fighting. They've been, you know, it's funny. We finally win the Senate. We have the house. Nothing happens. It's always the same. We don't have the victories. We don't have the victory. So what happens is they write false stories. And in this case they got called on it by a lot of people because I mean you know you can only go so much. OK. But these guys tell me. \"No, no we have to have it fixed\" because they can't say why. And then sometimes I'll say in Oklahoma we had 20,000 people recently in a field. It was supposed to be at a hotel, then the convention center. We had to go to a field because there were so many people. We had 20,000 people in Oklahoma. Good football place, too, by the way. Pretty tough football place there. So what happens, I said. \"Fan the place.\" They refused to do it. The camera stays on me. I said, \"Fan them.\" They refused to every one of them. They refused to fan everyone. And now I'm looking and there's a few people that were shouting. That got thrown out of here. And I see all the cameras are turned so they can turn the cameras. These are just lying people. They're bad people. The press is really bad. Fan the cameras over here, fellas. Fan the cameras show. Look, they don't do it. They don't do it. They don't do it. They're very dishonest people. They tell you, \"You don't know?\" They don't do it. You'll go home. You'll watch on television. You wouldn't know if there were 10 people in this room or 10,000 people in this room. They don't do it. Fan the room fellas. Go ahead. Fan the room. Look they don't do it. They don't do it. Because they're really dishonest people. Now, two minutes ago those cameras were turned all the way to the back of the room where the other people belong. They were terrible people. There in the back and they're fanning and they're showing it. It's disgusting. Be ashamed of yourselves, fellas. Be ashamed of yourself. So now. Now what happens is yesterday, there's some little wise guy. He looked like he was 12 years old. He's got a camera. I'm signing autographs and I'm going like he's asking me questions talking about the wall, going to build a wall. We're going to build this and I'm signing autographs and this music playing in the background and I'm leaving. Bing! bing! bing! signing. And this little wise guy sitting there. And he's asking me questions. It's not even important that I said, \"Who you are?\" He said, \"NBC.\" Once he said that I didn't bother answering anymore because although they did do me on Saturday Night Live and they were good. How about the other guys? How about the other guys ? They now want equal time. OK. Like Pataki. Pataki wants equal time. Not going to help. He's got zero. They could give him 12 Saturday Night Lives an hour and a half a night. Not going to have any impact. You'll still have zero but that's what they want. So the database should get better. But they also said the wall and I said the wall. And I was referring to the wall but database is OK. And watch lists is OK. And surveillance is OK if you don't mind. I want to be -- I want to surveil. I want surveillance of these people that are coming in the Trojan horse. I want to know who the hell they are. And the biggest story yesterday, the biggest was, \"Trump wants database on Muslims.\" I said what's happening here? And I spoke to the reporter of the Times and I think I made it clear and I also said, \"Number one, you couldn't hear very well because just like walking over here you're not here.\" But regardless of that doesn't matter. But I do want database for those people coming in. But I also insist on the wall and it was all fine. All of a sudden they end up with some stories I see. What are you talking about? So here's the story. Just to set it clear I want surveillance of these people. I want surveillance. If we have to and I don't care. I want it. Are you ready for this folks.? Are you ready? Oh they're going to make it such a big deal. They're going to make it so big. He said something so politically incorrect. That's why we're going to hell because we're so politically incorrect. Such a big deal. Such a big deal. I want surveillance of certain mosques OK. If that's OK. I want surveillance. And you know what? We've had it before and we'll have it again. Hey. I watched when the World Trade Center came tumbling down. And I watched in Jersey City, New Jersey where thousands and thousands of people were cheering as that building was coming down. Thousands of people were cheering. So something's going on. We got to find out what it is. I do want surveillance. I will absolutely take database on the people coming in from Syria if we can't stop it. But we're going to. And if I win. I made it known. If I win, they're going back. We can't have them. They're going back. We can't have them. We can't have them. You see what happened. And you see it very clearly. A few nut jobs in Paris. OK. A few total nuts, low lives, the guy with the dirty hat. They say they got him. I hope they got him to die. He's wearing a filthy dirty hat. That was the one they were calling for five days, the mastermind. Right, the mastermind. He is no mastermind. He's a -- he's a lowlife but they got him. But there are others out there. We have to get him. And we have to use surveillance. Wait. We have to use surveillance. We have to be vigilant. And you know, the greatest thing is everybody in this room, everybody outside of this room, we have tremendous eyes and ears. When somebody is next to you in a house or an apartment, you can sort of see there's something going wrong. Inform your local police. They're incredible people, the police. They're incredible people. They're incredible people. You don't have to call Washington where you're trying to figure out who the hell do I call? I just met a lot of young police right now when I came off the plane. These are incredible tough cookies. They want to do a great job. Give them back their power and you're going to see a lot of good things happen. And sure. And by the way, you're always going to have a bad incident and a bad apple. You have that in any business no matter what. You're going to have things. But we need vigilance. When you see something going on at the next house at the next apartment, when you see certain people walking in and out all day carrying things, inform your local police. Whether it's Birmingham or wherever it might be they will take over. They know what to do. They'll call Washington. They'll get the guys. Those guys don't have a chance but the eyes and ears. We have millions and millions and millions of eyes and ears. You can solve the problem. There's nobody like the people. There's nobody like the people. So we are going to have surveillance. We are going to have and the most interesting thing that happened is all of the talk about the word because that was the other thing in the polls that Trump is by far, by far the best on border security. So that's why when Paris happened, the attack in Paris. That's why I went up because people said he's the only one that says it like it is. So I went up and believe me you're going to be really secure. You're going to be more secure that even you know and you're a fan. OK. You're going to be secure. We're not playing games. We're not playing games. We will not be playing games. When I brought up illegal immigration. It was like like a bomb dropped. Nobody was talking about the subject. I brought it up and Rush Limbaugh. Good guy. He said nobody. Good guy right? Good guy, good guy. Really a fair guy. And he says the truth. Maybe that's because he likes me I don't. But Rush said nobody has ever taken in coming. Nobody like Donald Trump. And for two weeks I did. It was unbelievable. I said, \"Is this going to be? I can't do this for six, seven months.\" But then it died down because people started seeing I was right. And then I became the darling. And then you had a lot of bad things happen. You had Kate in San Francisco get shot in the back by a guy that came over five times probably pushed over. Get out of here! We don't want to take care of you. Let the dummies from the United States take care of you. And he shot Kate, beautiful Kate from San Francisco in the back, holding her father's hands, looking out onto the water and she dropped, and the father. And the family will never be the same great family. And then you had Jamiel whose son is so great. Senior and Junior and the father is the apple of the father's. A great football player getting ready to go to college was going to go on a scholarship, never had a trouble in his life. Walking home from the deli where he bought himself and his father a sandwich. Called his father said, \"Pop, I'll be home in three to four minutes.\" And then the father heard a gunshot outside. Heard it from the house. And he knew immediately there was a problem and he ran out and his son was laying on the street, almost dead with bullet holes in his head. With his hands blown off because he was lying down going like this and his hands were blown off because it was a 45. And then you have three, four weeks ago you had a woman, a veteran, 66-year-old veteran, raped, sodomized and killed by an illegal immigrant. Raped, sodomized and killed. Sixty six years old, and so many more. People said, \"You know Trump is right.\" Then you have the drug problem. Our cities are infested with drugs our youth is going. You should see New Hampshire has a heroin problem. The likes of which nobody can even understand. It's coming from an area that we can't stop because it's destroying our cities. It's destroying, most importantly, is destroying our youth. It's destroying our future. And we're going to stop it. We're going to stop it. We're going to stop. So all of the other things that I usually talk about is now. But they're all very important. Don't get me wrong. Obamacare, we mentioned trade. We mentioned all of these things are all very important. Jobs! jobs we mentioned. I'm going to create so many jobs we mentioned. But let me just tell you. But what we're going to do so is we're going to be vigilant at our borders and we're not letting people come into our country unless they come in legally. They've got to come in legally. They're going to come in legally or they're not coming in at all. And we're not going to be the stupids anymore with the stupids we're known as the stupids with the anchor babies. A person has a baby. She walks across a line. She has the baby in the United States. Now we have the baby. Fourteenth Amendment except for one thing, they didn't read the 14th Amendment right because it doesn't say that. It doesn't say that. It doesn't say that. And for years I've been hearing it did but for years I've been building buildings and creating jobs. I've created tens of thousands of jobs. I've been doing jobs. So I never really gave it that much thought. But now that I'm doing this. I want to make our country so great now that I'm doing this. I said it can't be right. Now, if somebody has a baby in Mexico they walk in first if they could walk across the border. OK. They'd be out of there so fast. But if they did and you said, \"Oh my baby is now a citizen of Mexico.\" They would laugh at you. They throw you the hell out like a dog. And by the way that's true with almost every country. But here, you have a baby. And now we have to take care of that person for 85 years or however long that but -- but it doesn't read that way. Then they said oh you need a constitutional amendment which will take years and years to get. You don't need -- you need a simple act of Congress. And in my opinion you don't even need that because if they come in illegally they're not supposed to be having a baby here. OK. So I don't even think of it. And we're talking about hundreds of thousands of people a year. So here's what we're going to do. If I win a lot of good things are going to happen. First of all, we're going to win so much. We're going to win. We're going to win. So I sometimes joke. I like these people much better. He says when we win. We are going to have so much victory and I joke about I say you can have wins and wins and wins you're going to get sick of winning and Dennis I can't joke because you never get sick of winning, right? Right. Your football teams. If your football team goes undefeated every year and every year you never get tired of it right? Never. Never get them. But we're going to have great victories again. We don't win anymore as a country. We don't win. We lose on everything. We lose with ISIS, we lose with everything. We lose with trade. We lose with health care. Have you seen the premiums on Obamacare? Up 35%, 45%, 55%. It's a disaster. And now they're saying it's a disaster and now they're saying we have to go back to Congress because in '17 it all exploded. Whoever is going to be president is not going to be easy but I'll solve the problem though. But it's not working. So just to finish off and I give you my word. I am going to work so hard. I'm self-funding this campaign. I'm the only one. I'm the only -- I'm the only one. I don't know if that's a big deal to a lot of people. But I could have -- I could have fun. You know these super PACs are a total scam. The super PACs have all these money. They'll do negative ads on me all over the place. A lot of them will be false. It's also but by the time I end up winning, what happens is it's too late the election's over. So what do I get? The super PACs are a scam. They have total control over the candidates. They do whatever the person that puts the money up once. If a man owns a company in China and he gives money to a super PAC, Jeb Bush was over as an example. I don't want to keep using his name but he's so -- he's so easy. He's so easy. No. Jeb Bush was over in Germany or his people are over in Germany trying to win. Well then you'll see a German company has gotten a big approval from the United States. That's what happened, folks. Folks, I know the lobbyists. They've worked for me. Nobody knows the game better than I do. I don't want anything. I work for you. I work for you. I work for you. I don't want it. I don't want it. We're going to do what's right for the country. We're not going to let Mexico take our car business which by the way they're going to become the car capital of the world pretty soon. Ford is building a massive plant there. Others are building massive plants. We don't even fight. We don't even fight. You have corporate inversions which by the way, the other candidates don't even know what it is. But essentially companies are leaving the United States and going to other lands, to other countries and they're dropping thousands and tens of thousands of jobs. And now it's starting to get bad. And under my tax plan where I'm cutting everybody's taxes big league -- big league and we're cutting corporate taxes. We're the highest tax nation in the world. Under my plan we'll be one of the lowest. And we're going to be a dynamic economy again. We're going to be dynamic. And we're going to bring back those trillions of dollars. Trillions of dollars! Trillions that companies can't get but they can't get it back. They can't get it back because the politicians they all agree it should come back but they can't make a deal because there's gridlock in Washington. So we're gonna bring it back and that money is going to be put to work here and we're going to do it. So, what you're seeing and a friend of mine called me up. He said it's unbelievable. What's happening? What you're seeing is a movement. This isn't about me. What you're seeing is a movement. No matter where I go it's the same thing. It's the same love. It's like love in the room. It's love in the room. No other people's love in the room. And the American dream and I say it. The American dream is dead! But we're going to make it bigger and better and stronger than ever before. And we are going to make America great again. Thank you. I love you. Thank you. Thank you. Thank you everybody. I love you. We're going to get it done. Thank you."}