{"id":492,"author":"Donald Trump","title":"Speech: Donald Trump Delivers a Speech in Worcester, MA","date":"2015-11-18","link":"https://factba.se/transcript/donald-trump-speech-worcester-ma-november-18-2015","paragraphs":["And you know, sadly there are about 3,000 people outside. They're coming in now. How about waiting about an hour till they get in? Good idea? No. So we'll just say, they were late. It's their problem. Here's my great friend. My great veteran friend. Are you OK? Everything good? Good. Good. And we're gonna take care of our veterans, I want to tell you that.","Big league. Right? Big League. Big league. So a few things. We just came down and I just heard Massachusetts -- you know, they keep saying -- the press. Look at all those guys back there, with all those life cameras all the time. Boo. Boo. But -- well, actually, about 30% of them are good though. I think 30%, maybe 25%, 25%. Maybe 20%. But you know the Massachusetts poll, listen to this one, 48% for Trump; 9% for somebody else.","You know, when I used to do this. They'd come out then say, I started. And my wife said, you know, if you run, you're gonna win. I said, why do you say that? Because people want to see good things happen. And you know -- so you know -- hey, that's a good thing. That's a smart thing for a wife to say, right?","I don't know if she meant it or not. But it's very smart. But she said, you're gonna win. So anyway, I started off and I started at three and it went to six and it went to nine and it went to 16. And every time it went up, these talking heads on the different shows. They say, well, you know, he's plateaued.","He's plateaued. Well, you know, at 48%, I hope I plateaued. I want that. I want to plateau. It's been an amazing period. And I'll tell you what, this has been a movement. This isn't like a normal -- and look at the people pouring in. This has been, this has been a movement. No matter where I go and I don't even know if it's for me. It's for me, I guess, a little bit.","It's for the message. We want to win again. We want to win. We want to win. So just two minutes ago, Fox -- we like Fox, right? They came out with their poll and it's brand new, so I'll give it to you. Trump, 27; Rubio, second place, 13; Carson, 9. He's going down. He's going down. He's got to know about foreign policy.","You got to know. You got to know. Gotta study. You gotta be able to get that stuff, right? But -- and you know when you think of Rubio, in all fairness, a nice guy, stood next to me the other day at the debate. Nice, very nice, made a lot of mistakes, a lot of mistakes. And he's got the worst voting record in the United States Senate.","I'll take what, if I were from Florida, I'd be very angry. So today, he's in California, fundraising and they have voting and it's sort of interesting because it's a vote on -- and it's really more than -- almost more important. They're getting ready for homeland security issues and votes. And he's in California.","What's he doing? He's raising money. Always money with these politicians. Money, money, money. I'm still funding my own campaign. I don't have to raise. I don't have to raise money. I'm gonna raise any money. You know. It's very interesting, very, very interesting. I said to somebody the other day. I was in Iowa.","I said, what do you think he's gonna respond? So I had this great group of people and I said, you know, I feel it's just not my thing. I want to go and I want it -- can I take -- millions and millions of dollars is being offered to me all the time. I could make Jeb Bush's fund look like peanuts. I mean, think of it. Guys are offering me anything.","You know, these super PACs are a big scam. You know that. It's a big scam. And the super PACs they control all the candidates. And the people that give the super PACs money totally control the candidates. And I just about disavowed all super PACs. You know, we sent out letters. I had like 9 or 11. All these -- everybody was setting up a Trump super PAC and probably 25% were legit.","And the other 75% wanted to take the money and who the hell knows what they do with it. They live very nicely. But we disavowed. We disavowed. We don't want super PACs. We don't want it. We don't want it. And I said to the folks and it was to me very important. But I said to the folks in Iowa, OK, let's have a deal.","We can do the following and it's so important to me. I'll take millions and millions of dollars. It will come in like by the droves. And I promise, it won't affect me. Can I do it? And they went nuts. No. Because they're smart. They said, you can't do it. Because we all know that when somebody like me, I used to give fortunes.","I was like the fair haired boy. I give -- all these lobbyists that are giving the money, I know many of them. When they give $5 million, $2 million, $1 million, $10 million. Believe me, they have total control over their little politician. Total control. And they don't care about the country. Some of them represent other countries.","Some of them represent businesses from other countries that want to do business in the United States. They don't care about the country. They want to get their client the right vote. So you have special interests, you have lobbyists, you have donors, they have total control over these people that are running for office.","And nobody knows it better than me because I've been there. And you know, it's sort of funny, I've been there like nobody's been there like I have. And I was totally establishment. Can you believe it? They come to my office. $250,000 to the Republican Governors Association. $100,000 shortly thereafter again to the Republican Governors Association.","Millions of dollars you spend. And you know, when you call, they treat you so nicely. They treat you so nicely. So when you see negative stuff and I'll I'll match a bullet -- wait til you see what I do. You're gonna be so proud of me. It's gonna be so vicious. Gonna be so vicious. Because right now -- and in one way, I hate saying it. But in another way, it's smart.","So far, I've spent less money than anybody else and I have the best result, right? Right? Now, in one way, people said, well, we'd like you to spend more money. The press says it all the time. When are you gonna start spending money? I haven't had to. You know, you leading in every single poll, national.","Now Iowa just came out. I'm leading in Iowa. Leading, leading really big in New Hampshire. New Hampshire is unbelievable, big. Leading in South Carolina, the first three. Leading in Nevada. Nevada came out today. Leading in Nevada. Leading with Hispanics in Nevada. I've been saying that. I've been saying that.","Leading with African-Americans at a point at which nobody has ever gotten. The number is 25%. Somebody said, if you got 25% of the African-American vote as a Republican, don't forget, I'm a Republican. If you've got 25%, the election's over. It's over. And then they came out with polls today, North Carolina, South Carolina, other places, against Hillary, we're killing Hillary in all these states.","Killing her. Crazy. So let's talk a little bit about our country. We're just gonna have fun and those poor people. By the time we're finished. They're gonna be in. They're gonna hear probably the final sentence, which will be make America great again. Right? That's what it will be. So I was so focused on trade because I'll do -- thank you.","I love you too, darling. Look at her, how beautiful. I love her. So nice. Thank you. Thank you. I was so focused on trade for the last number of months and doing great on trade. Because you know, we're being ripped off by every country that we do business with because we have the worst negotiators. All you have to do is look at the Iran deal that was just signed.","Look at this deal. But one of your own, got it done. Carrie. Carrie. He did not read The Art of the deal, I can tell you. So Carrie goes out makes one of the worst deals that I've ever seen of any kind. Forget about nations. One of the worst deals $150 billion going to to Iran. Right? How about the self-policing aspect, is that good?","They're gonna self police. The other form of policing is 24 days, which takes a long time before you even get there. So they have like an infinite number of days before they can -- before you can inspect. And what about our prisoners? We have four prisoners. $150 billion and we don't get prisoners back. And they didn't want to do it -- think of it. They didn't want to do it because they said we don't want to complicate the negotiation.","Can you believe this? And all you had to do is say at the beginning, which, by the way, this thing is taking forever. You say at the beginning, we want our prisoners back before we start. We want them back. You don't need them. We want them. It's gonna set a good tone, right? It's gonna set a good tone. You'll end up making a better deal.","Give us your prisoners back. You don't need them. You don't want them. Your people don't even know you have them. And we didn't ask. I guarantee you that if I were negotiating that deal, even as secretary of state. I guarantee within a very short time, you'd have them. Because of the fact that I would have left the room if they said no, which they probably would have.","I would have doubled up the sanctions. And within three days, they would have called. And said, we have your prisoners here. Would you like them? Unbelievable. Unbelievable. So I've been so involved with trade because you know, when you lose -- when you have a trade imbalance with China of almost $500 billion.","You think of that. And somebody the other day -- very smart people -- I met with some smart people. I'm not gonna say who because it would be embarrassing. I think to them. They should, but you don't believe in free trade. I said, we got an imbalance of $500 billion with China. We have an imbalance of $70 billion a year with Japan.","We have an imbalance of $45 billion a year with Mexico. We will build a wall. Believe me. Believe me. We will build a wall and it will be a great wall. You know, I've been talking about the wall for a long time. We're gonna build it. It's gonna be really, a real wall. It's gonna be a wall that's going to be way up there.","Wow. It's gonna be strong. It's gonna be powerful. It's gonna look good. It's good as the wall could look. And it's gonna be -- they are so misguided. They don't get it. They don't get it. They don't get it. So we're gonna build the wall. It's gonna be a great wall and it's gonna be paid for by Mexico. Believe me. 100%. 100%. We're not paying for it. Mexico is paying for it. Believe me. Now, a lot of times when I'm on the stage with these guys that I'm running against, some are nice guys.","Hey look, Perry was very vicious. He was always very nice to me. And everybody so far that's attacked me has gone down. They've gone down badly. You remember Perry attacked me? He was at five. He went to zero. He got out. Walker attacked me very viciously and he got out. I mean, it was phew. Think of what I could do for the United States.","Somebody attacks, oh they go down. Bobby Jindal, nice guy. He was vicious to me. I never even met him. I never met him. I was watching him last night. He said, I've decided to get out of the race. Oh, that was good. So one by one, step by step, we're getting there and we're gonna turn this thing around so fast.","So fast. We're gonna turn it around so fast you're gonna be so proud of the job I do. You're gonna be so proud of yourselves. You're gonna be so proud. We're gonna win so much. We're gonna win so much. We're gonna have a military that's gonna be so strong and so powerful that nobody is gonna mess with us. Nobody.","Nobody. Thank you. Isn't a Trump rally much more exciting than these other guys? And that kind of stuff only adds to the excitement. I tell you, it's just incredible. You know, what's happening though, no matter where I go, I mean, it's incredible. We went -- the other night -- no matter where we go -- Who?","What? You can't hear. Get over here. That's terrible. That's terrible. You have lousy seats up there. You have a lousy location. In real estate, you'd go bust. Good guy, though. No, he's fine. He's good. He's good. He just can't hear. He just can't hear. Are you OK? OK. I understand. So -- and they're still coming in over there.","So it's a little bit of a problem. So all over the country, this is what's happening. This is unique. You think? But we go to Mobile, Alabama, we have 35,000 people. We go to the Mavericks arena, right, in Dallas. You saw that. 20,000. We had three days, four days to fill it up. It filled up almost like in the first day.","No matter where we go. We went to Oklahoma, we had over 20,000 people. Every place in New Hampshire is packed. You know that. Where we have extra rooms set aside. It's absolutely it's so beautiful to see. And what it is, is it's love in the room. It's like love. Now we have a couple of people that don't have so much love.","That's OK. But it's love. I'll tell you truthfully. It's love in the room. So here's what we're doing. I've been talking very, very much and very strongly about trade. When I announced it took a lot of courage to announce. I mean, you know, this is -- I've always read where if you're a very successful person, you can't run for president.","You just can't. I've always heard that. Because you get treated very badly and very unfairly and I understand that. So we get people that aren't successful running for president. That's not good. Because that's not the mentality we need to get rid of our debt. It's not the mentality we need to make great trade deals.","It's not the mentality we need. So who the hell knows what's gonna happen. But I mean, whatever it is, I'm so proud of the fact that I've done it. Because it has -- you remember the famous escalator scene, where I come down. Melania waving very gently. I'm waving like a mad man. And the press was down there.","And I announce that I'm gonna run in New York City. At Trump Tower, I announce that I'm running for president. And then there, I talked about illegal immigration that it's a tremendous problem in this country. And did I get hit so hard by the press. And you wouldn't even be talking about immigration and illegal immigration, I believe, if I didn't bring it up. It wouldn't be a big subject.","It would not be a big subject. And it turned out to be the biggest subject. And then you have in San Francisco, beautiful Kate, get shot in the back by an illegal immigrant, who's crossed the border at least five times and probably many more times. You have Jamiel, a wonderful young man, going to college on a football scholarship already and he gets shot in the face by a guy that just walked up to him and shot him in the face in front of his home.","His father's a friend of mine. He couldn't -- he said, his life is over. His son, the apple of his eye, the most beautiful young guy, and he's dead, viciously killed for no reason. Illegal immigrant. You had a woman and actually, you had a veteran. 66-year-old woman raped, sodomized and killed four weeks ago in Los Angeles.","And you have hundreds and thousands, thousands of other incidents. Terrible. They're taking jobs. But more importantly, I want people to come into the country but they have to come in legally. They have to come in through the system. They have to come in through the system. And the Hispanic people -- because we're not only talking Hispanic.","But the Hispanic people are with me like 100%. The ones that are in the country legally. They don't want their jobs taken by people that are pouring in. And Obama, we just had -- It's true. We just had a great court victory. We had a victory at the lower court and it was just upheld two to one, where Obama's Executive Order that just come on in, take our country, do whatever you want, walk right by our great -- and they are really terrific people.","I know them. Spend a lot of time with him on the border. Our border patrols stand down. They're told stand down. They're standing there. They're tough. They're strong. They want to do their job. They're not allowed to do their job. Obama has been a disaster for this country, a disaster. And unless we get going and unless we get smart, we're not gonna have a country.","You need borders to have a country. Now what's happened -- you need borders. You need borders. So if I win, lots of things are gonna happen. Lots of things are gonna happen. Number one with immigration. You know, we have gangs in Los Angeles and Chicago and other places, where they're all illegal immigrants.","These are tough dudes. They are gone before I even start the wall. They are gone. They're out of here. They're out of here. They're out of here. And I will tell you, we have some people in this country not supposed to be here. We're not putting them in our prisons so that we can take care of them for the next 45 years.","We're bringing them back where they came, they're never coming back in and let their country take care of them because we're not paying the bill. So this all blends now in because that's been one of my big points. I think trade maybe is my biggest point because I'm so tired of seeing our country lose the jobs, lose the money, lose the base, lose everything.","But right now, because of what's happening and because of what happened in Paris, I mean think of this. Think of this. Nobody wants to say it. I'm the only one that says it. I tell the truth. You know why tell the truth? Because hey, if it doesn't work, it's OK. I loved my life. I'm doing something that's I just feel it's important.","I was asked yesterday, why are you doing it? I'm not doing it for myself. I had a really nice life. I'm going around from place to place to place. But -- Thank you. I'm doing it because, first of all, we don't have much time left. But second of all, I honestly believe we can make our country greater than it's ever been.","I really believe that. With commonsense and intelligent, we can be greater than it's ever been. So what's happened on immigration is just all blending in now with the migration. The migration is a catastrophe. And you have hundreds and thousands of -- you have people want to pour into all of these countries.","Merkel, you have to see what's happening in Germany. They're having riots in Germany. What the hell is she thinking? What she thinking? They're having tremendous crime with that inhabiting. They're having villages overrun. But listen. This could be the great Trojan horse of all time. Because you look at the migration, study it, look at it. Now they'll start infiltrating with women and children.","But you look at that migration and I'm looking at it and I'm the first one to bring it up. Three weeks ago, I'm sitting. I'm saying, isn't that a shame. And then I said to myself, wow. They're all men. There were no men. You look at it. There are so few women and there are so few children. And not only are they men, they're young men and they're as strong as can be. They're tough looking cookies.","I say, what's going on here? And then you look at what, five or six people did in Paris. And we have to get smart. I just had a press conference. I said we have to get smart. They said, the mastermind, the mastermind, he's scum. He's not mastermind. He's scum. He's scum. The press plays right into their hands.","The press is calling the leader of the pack in Paris a mastermind. So all these kids are sitting home even in New York and in California and in Massachusetts, oh the mastermind. He must -- he's not a mastermind. He's a low life. This is just a low-life guy. He's a bum. He's a bum. I'll bet he doesn't have a 90 IQ. You take a look at this guy and they're talking about he's a mastermind.","I just told him at the press conference. I said, you've got to stop calling these people masterminds. We have to take back the Internet. There's so many things we have to do. We have a president that doesn't have a clue. We have a president that says ISIS is contained. He's contained. The only thing contained is us. We're contained because we have no leadership.","But we have to take back the Internet. It's ours. But they've taken over the Internet. They're using the Internet better than we do. They're using the Internet and they're recruiting people. And then the people go out to fight for ISIS. And then we let them back into the country. We let them back in. Where have you been?","I've been fighting for ISIS. Oh come on back in. Go back home to Texas. No, no how stupid are we? When they leave the country, when they go to fight for ISIS or Al-Qaida or whoever the hell they fight, they never ever come back into this country again. Ever. Ever. But we've got to take back the Internet because they are taking people.","They're literally brainwashing people. They're brainwashing our youth. And they're getting it to say like, oh, this is what they want to do. We can't let that happen. We have innocent youth and they're misguided and they're brought along. But then they hear the press talking about these people like Robin Hood.","We can't allow the press to do that. We can't allow it to happen. We have to take back our country. We have to take back our intelligence. We have to take back the Internet. We can't let this happen. Recently -- Jeb Bush. Recently -- it's over. I don't want to waste a lot of time on him because it's over.","It's over. And you know what, I think he's a nice person. Who cares. Who cares? Who cares? But recently he said, Donald Trump's tone is very tough. That's what we need. We need tough tone. And I said, we have people in the Middle East and all over having their heads cut off. James Foley, who I think was an amazing guy.","I got to know his parents. I got to know his parents. They're incredible people. Their son's head was cut off. That was the beginning. They're chopping off heads. You're a Christian, they chop off your head. They chop off heads of everybody. They drown them in cages. They -- we haven't had anything. This has never happened.","Maybe the Middle Ages, maybe Medieval Times. You used to read about it. You know you used to read about medieval times. There's never been anything like this. I said, don't go into Iraq. I was right. I said, now we got to go and we got to knock the shit out of these people. You got to do it. We've got to do it. And we can do it fast and we can do it furious.","We can do it. We can do it well. We can win there again. I watched on television. I talk about it all the time. I see our generals being interviewed on television. I don't want generals interviewed on television. I want to be unpredictable. You know, we're predictable. We're predictable. I want to be unpredictable.","You know, all the polls say, I'd be the best at the military. I'd be the best at foreign policy, which is interesting because if you read the front page of The New York Times today, they said about Ben Carson that he's unable to understand foreign policy. You know his people actually said this that he is unable to comprehend or understand foreign policy.","It was a devastating -- search all over the place. And if you watched over the weekend, you would understand exactly what they're talking about because it was devastating when you watch the interview. But he's unable to comprehend foreign policy. We can't do this. I think he's a nice guy, probably. Who knows?","I don't care. I don't care. We need somebody that sharp and tough and smart and can figure it out fast. Fast. I mean we're playing games. We're playing games. The problem we have is we're playing games. We don't have the luxury of going through what we've gone through for the last seven years with this guy.","This guy was not suited to be president of the United States. He wasn't. I mean, I talked about -- I talked about Ben the other day and I talked about his book. Somebody said, no, you're too tough. So I'll do it very quickly because I went in Iowa. I talked for 15 minutes. I said, oh that was too tough. It's not a question being tough.","He wrote a book. He said, he's got pathological disease. OK. That's a problem to me. Problem. He said, he hit or tried to hit his mother over the head with a hammer. I didn't. Me, Mary McLeod? No way. I didn't. He said, he tried to stab somebody. Hit the belt buckle. No belt buckle. Stop it. Because they're gonna twist and turn and slide and it's going in. The strong guy goes like this.","It's going in. It's not stopping. It might be detoured a little bit but it's going in. He said he hit somebody really a very good friend of his in the face really, really hard with a padlock. Boom, in his face, did a lot of damage. And that's why they want to elect him and he's trying to prove that he did it. And I'm saying, I think if I was him, I'd try and prove that I didn't do it. I don't get the whole deal.","I don't get it. I don't get it. What are we coming to? What is the country coming through? We need sharp. We need smart. We need brilliant. We need tough. We've got to get the right guy. We need Trump. Yes. So then today, they come out with a Time story and you should read it. And by the way, Times and many other papers.","Not just the Times. If it was the Times, I would say, don't believe, may be. But it's many papers, talking about he cannot comprehend what's going on. That's bad. That's real bad. Can you imagine that if somebody goes in office and then you realize that he really cannot figure it out. We got a problem. Yes, we have Obama.","That's right. He's never figured it out. And then we have others. I mean they're running. They're running but they're not the right people. They're not the right people. You know, I've made a tremendous amount of money. I've built a great company. Remember when they said, he'll never run. Then I ran. Then they said, he'll never file Form A. That's basically one page.","But basically, you're signing your life away. I signed it. They go on like, oh. Then they said, oh well, he'll never file his financials because you're giving all these -- you could file forever. You could take forever. You get all these delays and everything. They'll say, he'll ask for the longest delay.","Well, I have the longest biggest financial statement ever filed in the history of the federal elections and I filed it ahead of schedule. No, it's true. You're given 30 days to file and then you're giving many extensions and everybody said, oh he'll just keep extending and then he'll drop out because maybe he's not as rich as people thought.","Well, I filed it and it turned out I'm much richer, right? You see. Much richer. And I don't do that. You know what much richer. Oh the press was devastated. They couldn't believe the numbers. They couldn't believe it. Longest statement. I think was 98 pages, almost 100 pages. Whereas, a politician it's like one page.","They did a book and they got, you know, a couple of bucks for it, but they did something. So I did this tremendous thing -- what they don't know is that I didn't even know if I was gonna run. Because it took -- you know, when I came down, I took a deep breath I went like this to my wife. Man, look at that down there.","The press was like crazy. The whole atrium was packed with press. I said, ayayayay. And I went like this. You ever do this when you have something where you're just not 100%. And you're saying, oh should I be doing this? My whole life is gonna change. My family's life. And I went like this, let's go baby.","That's what happened. That's what happened. And we went down that famous escalator. We went down that escalator and here we are. Here we are. But what they don't know is that if I didn't run, I was gonna file the financials anyway because I'm so proud of them. They're so good. I was so proud of it. So it shows an unbelievable company, unbelievable assets, the most iconic Doral, buildings in Manhattan, 40 Wall Street, Fifth Avenue, Sixth Avenue.","All over the place. The Bank of America building a big chunk in San Francisco, one of the great buildings of the world. Many, many things. Land all over the place on the Potomac River, on the Pacific Ocean. Very little debt, tremendous cash flow. They said, oh, they were devastated. They were devastated.","They had one guy. You have boxes and you check in. It says, $1 million, $2 million, $5 million. Actually starts with $5,000. They're various boxes. $10 million. $20 million. Then they go $25 million. Then they go $50 million or more. So I have many buildings worth much more than that. So -- but you check.","$50 million or more. So I check the box. I didn't check. My accountants check, right? They checked the box. Many of these -- I think it's like 23 or 24 boxes, $50 million or more. So we have a couple of guys they added up the 50s. And that was what they said my net worth is. In other words, you have a building that's worth a billion and a half in New York City or someplace and you put -- there's no category.","It's worth more than 50. So say check. Boom. And I ended up with a net worth of all those boxes times, x 50 million times 23 or 24. And I said that's so dishonest. But it didn't matter to me because the real people understood it. And then it was also reported fortunately fairly by some. But I would have put in the financials anyway because they turned out to be great.","And the reason I talk about the financials is this. I don't care. I'm a private company. Nobody knew what it was worth because as a private company, you didn't -- you have guys write books about Trump. They don't know anything. They don't know what I'm worth. Now they'd know what I'm worth because I see this financial disclosure, which is certified and big deal.","It's a big deal. Filed with the federal government. But the reason I talk about it is not braggadocio, it's simple. We need that thinking in this country. I don't care about me. We need that thinking in the country. We need somebody that's not gonna allow an Iran deal to be made. We need somebody that's a negotiator.","I did write The Art of the Deal, but forget that. We need somebody that's -- Carl Icahn, the great businessman endorsed me the other day. We need -- Carl is a good man. A lot of you know Carl. Great. Many of the people who just -- they want me to win because they know I'm like really good at this stuff. And we need -- and I talk to you this way, I talk to you this way because that's the mentality whether I'm nice or not.","I think I'm nice actually. But whether I am or not, we've got to take our country back. We've got to turn our country around. We need that kind of thinking. Whatever that thinking is. Whatever that thinking is we need it. We can't give -- I mean, our deal, I use it all the time. It's not a financial deal though, you could say it's even financial.","But we can't get Sergeant Bergdahl, a dirty rotten traitor, and give them, and give them five of the greatest killers on Earth that they've been after for nine years. But that's the deal. So we get Bergdahl, a traitor, and we knew he was a traitor and six people, six young great people were killed going after this bum.","Six people. Now in the old days -- there's my man stand up. What do we do with Sergeant Bergdahl 50 years ago? That's right. Boom. Boom. A great veteran, boom. He's gone. He's gone. Six people killed looking for Bergdahl. And we give five people to get it back. And we knew that he was a traitor because they had a general and a colonel go and interview, all of the soldiers that he dealt with and that he was with, they said he deserted.","So they knew -- you know, it's one thing they made a mistake, but they knew. We can't do things like that anymore. And by the way, on Bergdahl, I say the other day. No time. They don't want to give me any time. They're letting them out. They're not gonna not only not shoot him. They let him out. They said, well, he's been through a lot.","Oh yeah. He's been through a lot. Six young great people died looking for him and he's recommended to get nothing. Zero. And we can't let that happen anymore. So when I talk about myself because I've had an amazing life. I mean I've had a successful life. The Apprentice became one of the great shows on television.","I left The Apprentice. I left so much. You know, it's funny. The Apprentice has been so great. Everybody watch The Apprentice. I guess, right? So NBC calls. Steve Burke, the head of Comcast, who's a great guy, came up to my office. Please, Donald do it again. Do it again, please. I said, Steve, I want to run.","I want to run. Top people at NBC, top people at Comcast, great people. And Steve is a fantastic guy. He came. He said, please do it again. They wanted me to do it again. Mark Burnett called me. Please do it again. Everybody. Everybody takes a renewal. You'll be like the only one that didn't take a renewal.","Are you crazy? I said, Mark, I really want to run because I think I can do a great job. So when I filed my financial disclosure you're not gonna believe this. I had all these guys. Well, he doesn't make much money with The Apprentice. So here's what -- certified numbers. I made $213 million doing the apprentice.","Can you believe it? No. Think of it. Think of it. $213 million because we got the ads. I own the show with Mark and the whole thing. $213 million is what I put on my statement. Now these, you know, guy, said oh you know. They didn't believe it until they saw the number that it's a certified number. One of them on MSNBC used to go. Well, he doesn't make any money with The Apprentice.","So anyway, so think of it. I made all that money. They want to extend for 28 shows. And I said, no. I'm not gonna do it. And that's the least of it. So I give up a lot. You know these guys, these politicians don't give up anything. They run, they lose. They win, they run. They keep running. It's all they do. They run.","They talk. They're nothing. They're nothing. They can't do anything. They can't bring us to the promised land. They can't do it. It's not in their genes. I talk about corporate inversions. Companies are leaving our country. They used to leave New York for Florida. They used to leave Massachusetts actually.","They used to leave -- I hate to say, they used to leave for Mexico. They did -- that was pretty stupid, I will say, but we wouldn't let that stuff happen. We wouldn't let it happen. But they used to leave. Plenty left New Hampshire plenty left, as you know, for Mexico. Plenty left Massachusetts. But now, companies are gonna leave our country with thousands and thousands of jobs left behind and abandoned because of our tax code, because of the complexity.","There's $2.5 trillion offshore outside of this country. They can't get their money back because of the complexity of the code and because of the amount they have to pay. They're leaving and they're gonna go to the money. And they're gonna leave all the jobs and they're gonna get lower taxes. We can't let this happen.","And I talk to these guys on the stand. These people on the stand. They don't even know what the hell I'm talking about. They're politicians. They're good at one thing, getting reelected. That's all they're good for. I see these people. I see them. I look at Rubio, he's a lightweight. He's a lightweight. Everyone say, oh Rubio, he's the next Reagan.","He's no Reagan, that I can tell you. No he's not a Reagan. I don't mind. Hey, he's a young guy. Maybe he'll do well. I mean my hair is better than his hair. That I can tell. And I'm a little older. I'm a little old. But now these people are not gonna bring you. They're not gonna take us where you want to go. They're not gonna do it. They're politicians.","All talk, no action. Nothing gets done. They control by special interests. It's not gonna happen, folks. It's not gonna happen. It's time. It's time to really bite the bullet and do it right. We got to do it right. We got to do it right. And I want to be tough and I want to be strong and I want to do these things.","Because if we don't do it, we're not gonna have a country left. We're just not gonna have a country left. Not gonna happen. Obamacare, a disaster. No, it's a disaster. It's a disaster. Obamacare, premiums are up 35%, 45%, 55%. Deductibles are through the roof. You don't even get to use it. The deductibles are so high.","People are getting killed. And it was all a lie. 28 times, you can keep your doctor, keep your plan, everything is wonderful. Even the Democrats were lied to because they would've never approved it. But the president kept saying, great. Everything you can have. And yet, they don't have to use it. The politicians in Washington don't have to use because they don't want it because it's no good.","We are going to repeal it and we're going to replace it with something great, with something great. So sad. So sad when you look at it. When you see that. Remember the website? Everyone forgets it. Now, you know, the one problem in politics, it's got like a two-week life. Everybody forgets how bad. Remember the website?","$5 billion web site that didn't work. Still does it work. A $5 billion web site. Those days are gone. Those days are gone. I would have gotten Microsoft. I would have gotten somebody. I would have gotten Yahoo!. I would have gotten any. I could have gotten 10 different companies that are the best in the world.","They would have done it for nothing. They would have been so honored to do it. We spend hundreds and hundreds and hundreds of millions of dollars doing a web site that doesn't work. And everybody now forgets it. Obamacare has to be repealed. You know, in '17, it's going to cost, it's going to cost our country an absolute fortune.","It's going to be useless as far as you're concerned. The deductibles will be so high you're not gonna be able to use it and the cost is gonna be prohibitive. So they're already saying they have to go back to Congress in '17 to redo it, to change it. We're gonna get rid of it. We're gonna get something good.","You know who made the money with Obamacare? Other than the fact that the people that designed the web sites were very close to you know who? Right? You know that. But you know I made the money with Obamacare? The insurance companies. They gave a tremendous amount of money to Obama. The insurance companies have made a fortune with Obamacare.","Take a look at them. Take a look at these insurance companies. They're raking in billions of dollars with Obamacare, and nobody even knows it. So we're gonna get rid of it. We're gonna come up with a plan that's so good. There's so many ideas, so many plans and it's gonna be good. And you're gonna have your doctor and you're gonna have your plan.","You're gonna have what you want. So the other day I was watching the Democrat. It's actually the Democrat debate. You know, they call it the Democratic debate because it sounds better. It's not really the -- it's called the Democrat debate. And I watched Hillary, who doesn't have the strength or the stamina to be president.","I can tell. Doesn't have this. No, doesn't have it. She doesn't have the strength or the stamina. We need very strong right now. She's exhausted, folks. She's exhausted. In fact, I think, if she pulls it off, I think her greatest achievement ever will be getting out of the email scandal. I think that will be her greatest achievement.","And I think she will do it because I think she's being totally protected by the Democrats. They've destroyed General Petraeus. They've put other people in jail for doing 5% of what she did. And I think that she's gonna get a free pass. I think the Democrats are protecting her because they think you can't vote, you can't vote for Bernie.","Did you hear that? The Paris attacks were caused by -- Did you hear this one? The Paris attacks were caused, according to Bernie Sanders, they were caused by global warming. And the other guy, he shouldn't even be on the stage, he was the mayor of Baltimore. He did a great job, OK? So we have issues. We have 93 million people out of the labor force.","Think of it. When you have 5.2%, forget it. When you add the real numbers, you probably have a 25% unemployment. And I'll tell you, this place is packed. People are still coming in. Oh, those poor people. They're gonna be so angry when I finish and they're still coming in. People -- can you believe people are still coming in? Let's give them a hand.","Give those people a hand. We love those people. They're gonna say, how did Mr. Trump do tonight? How was the speech? They're gonna say, I don't know. We never got in. So we have 93 million people out of the labor force. We have 50 million people in poverty. We have 43 million and now, it's actually gonna be probably closer to 50. 50 million people on food stamps.","And I'll tell you what, if we had a real, if we had a real -- Hello. Hello. You know, it's amazing. I mentioned food stamps and that guy, who is seriously overweight, went crazy. He went crazy. Amazing. That's an amazing sight. You know the bad part? Here's the bad thing. So we had three little protests.","Each person, I think it was one over there, one over here, one over there, right? So we had three people tonight. Three, right? Three. Three people. So we had three people and the press will say, protestor Trump. We didn't have. We got. We have 12,000 people and they're gonna take three -- with 12,000 people still coming in and they're gonna take three people, these people.","They're gonna take three people and say, oh, the protests were unbelievable. Unbelievable. You know it's like Saturday Night Live. Anybody see Saturday Night Live? Good. That was good. Well, I heard about the protests. And I said, oh, it's gonna be tough. This is gonna be tough. So I said one of my guys out and I heard every newscast, there will be major protests tonight in front of NBC at Rockefeller Center.","The protests will be unbelievable. I said, you know, we've been going through a side door. It is gonna be rough tonight. This is gonna be rough. So we look and there were like 20 people outside. I sent my guy. I said go check it again. You must be wrong. Comes back. He said, 21 people total. He found, he found one.","Then just before I went on. I said go check it again. There was no. You know why? They went home to watch Saturday Night Live. Is this crazy? Crazy. But the press, the press was reporting massive protests against Trump. It's really horrible. It's really, really horrible, really dishonest. And honestly, you're talking about three people.","One, two, three, right? Three people. They weren't even in a group because who the hell wants to be with a guy like that to be in a group? Who? Seriously? Who wants to be with him? Nobody. Nobody. Nobody will have him. Nobody. But -- so tomorrow, when you go home and tonight, when you watch your broadcast.","You're gonna hear about protests. You're gonna hear that there were protesters outside. I didn't see them. I saw thousands of people trying to come in. Thousands. That line. I never saw that line was four blocks long, five deep. But you're gonna hear about protests and just remember what I said. It's all a big lie.","It's a big lie. It's a terrible, terrible lie. It's a terrible, terrible lie. So I just want to close by saying, very shortly, you're fired. I just want to close by saying, look, I've given up a lot to do this. I've given up a tremendous amount. I've given up a lot of deals and economics and shows, a lot of other things.","But what I want to say is, we're gonna win if. I get elected, we're gonna win on trade. We're gonna win with ISIS. And boy, are we gonna win with them and we're gonna do it fast. We're gonna win with our military. We're gonna take care of our veterans. We're gonna take care of our veterans. We're gonna do great with our health care.","It's gonna be the finest in the land. The finest. And I can only say this. You have to remember this night. You are going to have something special. We are gonna bring back our country. I used to say the silent majority. It's not the silent majority. It used to be the silent majority. This is a very, very vocal majority.","You have to keep it going. But we are going to have victory. We're gonna have victories economically. We're gonna have victories on trade. We're gonna put our people back to work. We're not gonna let other countries steal our jobs. It's not gonna happen anymore. We're gonna have great health care. The American Dream is dead, but we're gonna make it bigger and better and stronger than ever, ever, ever before.","And we're gonna make America great again. I love you. I love you. I love you. Thank you. Thank you. Thank you. Thank you, everybody. I love you very much. Thank you. Thank you very much."],"text":" And you know, sadly there are about 3,000 people outside. They're coming in now. How about waiting about an hour till they get in? Good idea? No. So we'll just say, they were late. It's their problem. Here's my great friend. My great veteran friend. Are you OK? Everything good? Good. Good. And we're gonna take care of our veterans, I want to tell you that. Big league. Right? Big League. Big league. So a few things. We just came down and I just heard Massachusetts -- you know, they keep saying -- the press. Look at all those guys back there, with all those life cameras all the time. Boo. Boo. But -- well, actually, about 30% of them are good though. I think 30%, maybe 25%, 25%. Maybe 20%. But you know the Massachusetts poll, listen to this one, 48% for Trump; 9% for somebody else. You know, when I used to do this. They'd come out then say, I started. And my wife said, you know, if you run, you're gonna win. I said, why do you say that? Because people want to see good things happen. And you know -- so you know -- hey, that's a good thing. That's a smart thing for a wife to say, right? I don't know if she meant it or not. But it's very smart. But she said, you're gonna win. So anyway, I started off and I started at three and it went to six and it went to nine and it went to 16. And every time it went up, these talking heads on the different shows. They say, well, you know, he's plateaued. He's plateaued. Well, you know, at 48%, I hope I plateaued. I want that. I want to plateau. It's been an amazing period. And I'll tell you what, this has been a movement. This isn't like a normal -- and look at the people pouring in. This has been, this has been a movement. No matter where I go and I don't even know if it's for me. It's for me, I guess, a little bit. It's for the message. We want to win again. We want to win. We want to win. So just two minutes ago, Fox -- we like Fox, right? They came out with their poll and it's brand new, so I'll give it to you. Trump, 27; Rubio, second place, 13; Carson, 9. He's going down. He's going down. He's got to know about foreign policy. You got to know. You got to know. Gotta study. You gotta be able to get that stuff, right? But -- and you know when you think of Rubio, in all fairness, a nice guy, stood next to me the other day at the debate. Nice, very nice, made a lot of mistakes, a lot of mistakes. And he's got the worst voting record in the United States Senate. I'll take what, if I were from Florida, I'd be very angry. So today, he's in California, fundraising and they have voting and it's sort of interesting because it's a vote on -- and it's really more than -- almost more important. They're getting ready for homeland security issues and votes. And he's in California. What's he doing? He's raising money. Always money with these politicians. Money, money, money. I'm still funding my own campaign. I don't have to raise. I don't have to raise money. I'm gonna raise any money. You know. It's very interesting, very, very interesting. I said to somebody the other day. I was in Iowa. I said, what do you think he's gonna respond? So I had this great group of people and I said, you know, I feel it's just not my thing. I want to go and I want it -- can I take -- millions and millions of dollars is being offered to me all the time. I could make Jeb Bush's fund look like peanuts. I mean, think of it. Guys are offering me anything. You know, these super PACs are a big scam. You know that. It's a big scam. And the super PACs they control all the candidates. And the people that give the super PACs money totally control the candidates. And I just about disavowed all super PACs. You know, we sent out letters. I had like 9 or 11. All these -- everybody was setting up a Trump super PAC and probably 25% were legit. And the other 75% wanted to take the money and who the hell knows what they do with it. They live very nicely. But we disavowed. We disavowed. We don't want super PACs. We don't want it. We don't want it. And I said to the folks and it was to me very important. But I said to the folks in Iowa, OK, let's have a deal. We can do the following and it's so important to me. I'll take millions and millions of dollars. It will come in like by the droves. And I promise, it won't affect me. Can I do it? And they went nuts. No. Because they're smart. They said, you can't do it. Because we all know that when somebody like me, I used to give fortunes. I was like the fair haired boy. I give -- all these lobbyists that are giving the money, I know many of them. When they give $5 million, $2 million, $1 million, $10 million. Believe me, they have total control over their little politician. Total control. And they don't care about the country. Some of them represent other countries. Some of them represent businesses from other countries that want to do business in the United States. They don't care about the country. They want to get their client the right vote. So you have special interests, you have lobbyists, you have donors, they have total control over these people that are running for office. And nobody knows it better than me because I've been there. And you know, it's sort of funny, I've been there like nobody's been there like I have. And I was totally establishment. Can you believe it? They come to my office. $250,000 to the Republican Governors Association. $100,000 shortly thereafter again to the Republican Governors Association. Millions of dollars you spend. And you know, when you call, they treat you so nicely. They treat you so nicely. So when you see negative stuff and I'll I'll match a bullet -- wait til you see what I do. You're gonna be so proud of me. It's gonna be so vicious. Gonna be so vicious. Because right now -- and in one way, I hate saying it. But in another way, it's smart. So far, I've spent less money than anybody else and I have the best result, right? Right? Now, in one way, people said, well, we'd like you to spend more money. The press says it all the time. When are you gonna start spending money? I haven't had to. You know, you leading in every single poll, national. Now Iowa just came out. I'm leading in Iowa. Leading, leading really big in New Hampshire. New Hampshire is unbelievable, big. Leading in South Carolina, the first three. Leading in Nevada. Nevada came out today. Leading in Nevada. Leading with Hispanics in Nevada. I've been saying that. I've been saying that. Leading with African-Americans at a point at which nobody has ever gotten. The number is 25%. Somebody said, if you got 25% of the African-American vote as a Republican, don't forget, I'm a Republican. If you've got 25%, the election's over. It's over. And then they came out with polls today, North Carolina, South Carolina, other places, against Hillary, we're killing Hillary in all these states. Killing her. Crazy. So let's talk a little bit about our country. We're just gonna have fun and those poor people. By the time we're finished. They're gonna be in. They're gonna hear probably the final sentence, which will be make America great again. Right? That's what it will be. So I was so focused on trade because I'll do -- thank you. I love you too, darling. Look at her, how beautiful. I love her. So nice. Thank you. Thank you. I was so focused on trade for the last number of months and doing great on trade. Because you know, we're being ripped off by every country that we do business with because we have the worst negotiators. All you have to do is look at the Iran deal that was just signed. Look at this deal. But one of your own, got it done. Carrie. Carrie. He did not read The Art of the deal, I can tell you. So Carrie goes out makes one of the worst deals that I've ever seen of any kind. Forget about nations. One of the worst deals $150 billion going to to Iran. Right? How about the self-policing aspect, is that good? They're gonna self police. The other form of policing is 24 days, which takes a long time before you even get there. So they have like an infinite number of days before they can -- before you can inspect. And what about our prisoners? We have four prisoners. $150 billion and we don't get prisoners back. And they didn't want to do it -- think of it. They didn't want to do it because they said we don't want to complicate the negotiation. Can you believe this? And all you had to do is say at the beginning, which, by the way, this thing is taking forever. You say at the beginning, we want our prisoners back before we start. We want them back. You don't need them. We want them. It's gonna set a good tone, right? It's gonna set a good tone. You'll end up making a better deal. Give us your prisoners back. You don't need them. You don't want them. Your people don't even know you have them. And we didn't ask. I guarantee you that if I were negotiating that deal, even as secretary of state. I guarantee within a very short time, you'd have them. Because of the fact that I would have left the room if they said no, which they probably would have. I would have doubled up the sanctions. And within three days, they would have called. And said, we have your prisoners here. Would you like them? Unbelievable. Unbelievable. So I've been so involved with trade because you know, when you lose -- when you have a trade imbalance with China of almost $500 billion. You think of that. And somebody the other day -- very smart people -- I met with some smart people. I'm not gonna say who because it would be embarrassing. I think to them. They should, but you don't believe in free trade. I said, we got an imbalance of $500 billion with China. We have an imbalance of $70 billion a year with Japan. We have an imbalance of $45 billion a year with Mexico. We will build a wall. Believe me. Believe me. We will build a wall and it will be a great wall. You know, I've been talking about the wall for a long time. We're gonna build it. It's gonna be really, a real wall. It's gonna be a wall that's going to be way up there. Wow. It's gonna be strong. It's gonna be powerful. It's gonna look good. It's good as the wall could look. And it's gonna be -- they are so misguided. They don't get it. They don't get it. They don't get it. So we're gonna build the wall. It's gonna be a great wall and it's gonna be paid for by Mexico. Believe me. 100%. 100%. We're not paying for it. Mexico is paying for it. Believe me. Now, a lot of times when I'm on the stage with these guys that I'm running against, some are nice guys. Hey look, Perry was very vicious. He was always very nice to me. And everybody so far that's attacked me has gone down. They've gone down badly. You remember Perry attacked me? He was at five. He went to zero. He got out. Walker attacked me very viciously and he got out. I mean, it was phew. Think of what I could do for the United States. Somebody attacks, oh they go down. Bobby Jindal, nice guy. He was vicious to me. I never even met him. I never met him. I was watching him last night. He said, I've decided to get out of the race. Oh, that was good. So one by one, step by step, we're getting there and we're gonna turn this thing around so fast. So fast. We're gonna turn it around so fast you're gonna be so proud of the job I do. You're gonna be so proud of yourselves. You're gonna be so proud. We're gonna win so much. We're gonna win so much. We're gonna have a military that's gonna be so strong and so powerful that nobody is gonna mess with us. Nobody. Nobody. Thank you. Isn't a Trump rally much more exciting than these other guys? And that kind of stuff only adds to the excitement. I tell you, it's just incredible. You know, what's happening though, no matter where I go, I mean, it's incredible. We went -- the other night -- no matter where we go -- Who? What? You can't hear. Get over here. That's terrible. That's terrible. You have lousy seats up there. You have a lousy location. In real estate, you'd go bust. Good guy, though. No, he's fine. He's good. He's good. He just can't hear. He just can't hear. Are you OK? OK. I understand. So -- and they're still coming in over there. So it's a little bit of a problem. So all over the country, this is what's happening. This is unique. You think? But we go to Mobile, Alabama, we have 35,000 people. We go to the Mavericks arena, right, in Dallas. You saw that. 20,000. We had three days, four days to fill it up. It filled up almost like in the first day. No matter where we go. We went to Oklahoma, we had over 20,000 people. Every place in New Hampshire is packed. You know that. Where we have extra rooms set aside. It's absolutely it's so beautiful to see. And what it is, is it's love in the room. It's like love. Now we have a couple of people that don't have so much love. That's OK. But it's love. I'll tell you truthfully. It's love in the room. So here's what we're doing. I've been talking very, very much and very strongly about trade. When I announced it took a lot of courage to announce. I mean, you know, this is -- I've always read where if you're a very successful person, you can't run for president. You just can't. I've always heard that. Because you get treated very badly and very unfairly and I understand that. So we get people that aren't successful running for president. That's not good. Because that's not the mentality we need to get rid of our debt. It's not the mentality we need to make great trade deals. It's not the mentality we need. So who the hell knows what's gonna happen. But I mean, whatever it is, I'm so proud of the fact that I've done it. Because it has -- you remember the famous escalator scene, where I come down. Melania waving very gently. I'm waving like a mad man. And the press was down there. And I announce that I'm gonna run in New York City. At Trump Tower, I announce that I'm running for president. And then there, I talked about illegal immigration that it's a tremendous problem in this country. And did I get hit so hard by the press. And you wouldn't even be talking about immigration and illegal immigration, I believe, if I didn't bring it up. It wouldn't be a big subject. It would not be a big subject. And it turned out to be the biggest subject. And then you have in San Francisco, beautiful Kate, get shot in the back by an illegal immigrant, who's crossed the border at least five times and probably many more times. You have Jamiel, a wonderful young man, going to college on a football scholarship already and he gets shot in the face by a guy that just walked up to him and shot him in the face in front of his home. His father's a friend of mine. He couldn't -- he said, his life is over. His son, the apple of his eye, the most beautiful young guy, and he's dead, viciously killed for no reason. Illegal immigrant. You had a woman and actually, you had a veteran. 66-year-old woman raped, sodomized and killed four weeks ago in Los Angeles. And you have hundreds and thousands, thousands of other incidents. Terrible. They're taking jobs. But more importantly, I want people to come into the country but they have to come in legally. They have to come in through the system. They have to come in through the system. And the Hispanic people -- because we're not only talking Hispanic. But the Hispanic people are with me like 100%. The ones that are in the country legally. They don't want their jobs taken by people that are pouring in. And Obama, we just had -- It's true. We just had a great court victory. We had a victory at the lower court and it was just upheld two to one, where Obama's Executive Order that just come on in, take our country, do whatever you want, walk right by our great -- and they are really terrific people. I know them. Spend a lot of time with him on the border. Our border patrols stand down. They're told stand down. They're standing there. They're tough. They're strong. They want to do their job. They're not allowed to do their job. Obama has been a disaster for this country, a disaster. And unless we get going and unless we get smart, we're not gonna have a country. You need borders to have a country. Now what's happened -- you need borders. You need borders. So if I win, lots of things are gonna happen. Lots of things are gonna happen. Number one with immigration. You know, we have gangs in Los Angeles and Chicago and other places, where they're all illegal immigrants. These are tough dudes. They are gone before I even start the wall. They are gone. They're out of here. They're out of here. They're out of here. And I will tell you, we have some people in this country not supposed to be here. We're not putting them in our prisons so that we can take care of them for the next 45 years. We're bringing them back where they came, they're never coming back in and let their country take care of them because we're not paying the bill. So this all blends now in because that's been one of my big points. I think trade maybe is my biggest point because I'm so tired of seeing our country lose the jobs, lose the money, lose the base, lose everything. But right now, because of what's happening and because of what happened in Paris, I mean think of this. Think of this. Nobody wants to say it. I'm the only one that says it. I tell the truth. You know why tell the truth? Because hey, if it doesn't work, it's OK. I loved my life. I'm doing something that's I just feel it's important. I was asked yesterday, why are you doing it? I'm not doing it for myself. I had a really nice life. I'm going around from place to place to place. But -- Thank you. I'm doing it because, first of all, we don't have much time left. But second of all, I honestly believe we can make our country greater than it's ever been. I really believe that. With commonsense and intelligent, we can be greater than it's ever been. So what's happened on immigration is just all blending in now with the migration. The migration is a catastrophe. And you have hundreds and thousands of -- you have people want to pour into all of these countries. Merkel, you have to see what's happening in Germany. They're having riots in Germany. What the hell is she thinking? What she thinking? They're having tremendous crime with that inhabiting. They're having villages overrun. But listen. This could be the great Trojan horse of all time. Because you look at the migration, study it, look at it. Now they'll start infiltrating with women and children. But you look at that migration and I'm looking at it and I'm the first one to bring it up. Three weeks ago, I'm sitting. I'm saying, isn't that a shame. And then I said to myself, wow. They're all men. There were no men. You look at it. There are so few women and there are so few children. And not only are they men, they're young men and they're as strong as can be. They're tough looking cookies. I say, what's going on here? And then you look at what, five or six people did in Paris. And we have to get smart. I just had a press conference. I said we have to get smart. They said, the mastermind, the mastermind, he's scum. He's not mastermind. He's scum. He's scum. The press plays right into their hands. The press is calling the leader of the pack in Paris a mastermind. So all these kids are sitting home even in New York and in California and in Massachusetts, oh the mastermind. He must -- he's not a mastermind. He's a low life. This is just a low-life guy. He's a bum. He's a bum. I'll bet he doesn't have a 90 IQ. You take a look at this guy and they're talking about he's a mastermind. I just told him at the press conference. I said, you've got to stop calling these people masterminds. We have to take back the Internet. There's so many things we have to do. We have a president that doesn't have a clue. We have a president that says ISIS is contained. He's contained. The only thing contained is us. We're contained because we have no leadership. But we have to take back the Internet. It's ours. But they've taken over the Internet. They're using the Internet better than we do. They're using the Internet and they're recruiting people. And then the people go out to fight for ISIS. And then we let them back into the country. We let them back in. Where have you been? I've been fighting for ISIS. Oh come on back in. Go back home to Texas. No, no how stupid are we? When they leave the country, when they go to fight for ISIS or Al-Qaida or whoever the hell they fight, they never ever come back into this country again. Ever. Ever. But we've got to take back the Internet because they are taking people. They're literally brainwashing people. They're brainwashing our youth. And they're getting it to say like, oh, this is what they want to do. We can't let that happen. We have innocent youth and they're misguided and they're brought along. But then they hear the press talking about these people like Robin Hood. We can't allow the press to do that. We can't allow it to happen. We have to take back our country. We have to take back our intelligence. We have to take back the Internet. We can't let this happen. Recently -- Jeb Bush. Recently -- it's over. I don't want to waste a lot of time on him because it's over. It's over. And you know what, I think he's a nice person. Who cares. Who cares? Who cares? But recently he said, Donald Trump's tone is very tough. That's what we need. We need tough tone. And I said, we have people in the Middle East and all over having their heads cut off. James Foley, who I think was an amazing guy. I got to know his parents. I got to know his parents. They're incredible people. Their son's head was cut off. That was the beginning. They're chopping off heads. You're a Christian, they chop off your head. They chop off heads of everybody. They drown them in cages. They -- we haven't had anything. This has never happened. Maybe the Middle Ages, maybe Medieval Times. You used to read about it. You know you used to read about medieval times. There's never been anything like this. I said, don't go into Iraq. I was right. I said, now we got to go and we got to knock the shit out of these people. You got to do it. We've got to do it. And we can do it fast and we can do it furious. We can do it. We can do it well. We can win there again. I watched on television. I talk about it all the time. I see our generals being interviewed on television. I don't want generals interviewed on television. I want to be unpredictable. You know, we're predictable. We're predictable. I want to be unpredictable. You know, all the polls say, I'd be the best at the military. I'd be the best at foreign policy, which is interesting because if you read the front page of The New York Times today, they said about Ben Carson that he's unable to understand foreign policy. You know his people actually said this that he is unable to comprehend or understand foreign policy. It was a devastating -- search all over the place. And if you watched over the weekend, you would understand exactly what they're talking about because it was devastating when you watch the interview. But he's unable to comprehend foreign policy. We can't do this. I think he's a nice guy, probably. Who knows? I don't care. I don't care. We need somebody that sharp and tough and smart and can figure it out fast. Fast. I mean we're playing games. We're playing games. The problem we have is we're playing games. We don't have the luxury of going through what we've gone through for the last seven years with this guy. This guy was not suited to be president of the United States. He wasn't. I mean, I talked about -- I talked about Ben the other day and I talked about his book. Somebody said, no, you're too tough. So I'll do it very quickly because I went in Iowa. I talked for 15 minutes. I said, oh that was too tough. It's not a question being tough. He wrote a book. He said, he's got pathological disease. OK. That's a problem to me. Problem. He said, he hit or tried to hit his mother over the head with a hammer. I didn't. Me, Mary McLeod? No way. I didn't. He said, he tried to stab somebody. Hit the belt buckle. No belt buckle. Stop it. Because they're gonna twist and turn and slide and it's going in. The strong guy goes like this. It's going in. It's not stopping. It might be detoured a little bit but it's going in. He said he hit somebody really a very good friend of his in the face really, really hard with a padlock. Boom, in his face, did a lot of damage. And that's why they want to elect him and he's trying to prove that he did it. And I'm saying, I think if I was him, I'd try and prove that I didn't do it. I don't get the whole deal. I don't get it. I don't get it. What are we coming to? What is the country coming through? We need sharp. We need smart. We need brilliant. We need tough. We've got to get the right guy. We need Trump. Yes. So then today, they come out with a Time story and you should read it. And by the way, Times and many other papers. Not just the Times. If it was the Times, I would say, don't believe, may be. But it's many papers, talking about he cannot comprehend what's going on. That's bad. That's real bad. Can you imagine that if somebody goes in office and then you realize that he really cannot figure it out. We got a problem. Yes, we have Obama. That's right. He's never figured it out. And then we have others. I mean they're running. They're running but they're not the right people. They're not the right people. You know, I've made a tremendous amount of money. I've built a great company. Remember when they said, he'll never run. Then I ran. Then they said, he'll never file Form A. That's basically one page. But basically, you're signing your life away. I signed it. They go on like, oh. Then they said, oh well, he'll never file his financials because you're giving all these -- you could file forever. You could take forever. You get all these delays and everything. They'll say, he'll ask for the longest delay. Well, I have the longest biggest financial statement ever filed in the history of the federal elections and I filed it ahead of schedule. No, it's true. You're given 30 days to file and then you're giving many extensions and everybody said, oh he'll just keep extending and then he'll drop out because maybe he's not as rich as people thought. Well, I filed it and it turned out I'm much richer, right? You see. Much richer. And I don't do that. You know what much richer. Oh the press was devastated. They couldn't believe the numbers. They couldn't believe it. Longest statement. I think was 98 pages, almost 100 pages. Whereas, a politician it's like one page. They did a book and they got, you know, a couple of bucks for it, but they did something. So I did this tremendous thing -- what they don't know is that I didn't even know if I was gonna run. Because it took -- you know, when I came down, I took a deep breath I went like this to my wife. Man, look at that down there. The press was like crazy. The whole atrium was packed with press. I said, ayayayay. And I went like this. You ever do this when you have something where you're just not 100%. And you're saying, oh should I be doing this? My whole life is gonna change. My family's life. And I went like this, let's go baby. That's what happened. That's what happened. And we went down that famous escalator. We went down that escalator and here we are. Here we are. But what they don't know is that if I didn't run, I was gonna file the financials anyway because I'm so proud of them. They're so good. I was so proud of it. So it shows an unbelievable company, unbelievable assets, the most iconic Doral, buildings in Manhattan, 40 Wall Street, Fifth Avenue, Sixth Avenue. All over the place. The Bank of America building a big chunk in San Francisco, one of the great buildings of the world. Many, many things. Land all over the place on the Potomac River, on the Pacific Ocean. Very little debt, tremendous cash flow. They said, oh, they were devastated. They were devastated. They had one guy. You have boxes and you check in. It says, $1 million, $2 million, $5 million. Actually starts with $5,000. They're various boxes. $10 million. $20 million. Then they go $25 million. Then they go $50 million or more. So I have many buildings worth much more than that. So -- but you check. $50 million or more. So I check the box. I didn't check. My accountants check, right? They checked the box. Many of these -- I think it's like 23 or 24 boxes, $50 million or more. So we have a couple of guys they added up the 50s. And that was what they said my net worth is. In other words, you have a building that's worth a billion and a half in New York City or someplace and you put -- there's no category. It's worth more than 50. So say check. Boom. And I ended up with a net worth of all those boxes times, x 50 million times 23 or 24. And I said that's so dishonest. But it didn't matter to me because the real people understood it. And then it was also reported fortunately fairly by some. But I would have put in the financials anyway because they turned out to be great. And the reason I talk about the financials is this. I don't care. I'm a private company. Nobody knew what it was worth because as a private company, you didn't -- you have guys write books about Trump. They don't know anything. They don't know what I'm worth. Now they'd know what I'm worth because I see this financial disclosure, which is certified and big deal. It's a big deal. Filed with the federal government. But the reason I talk about it is not braggadocio, it's simple. We need that thinking in this country. I don't care about me. We need that thinking in the country. We need somebody that's not gonna allow an Iran deal to be made. We need somebody that's a negotiator. I did write The Art of the Deal, but forget that. We need somebody that's -- Carl Icahn, the great businessman endorsed me the other day. We need -- Carl is a good man. A lot of you know Carl. Great. Many of the people who just -- they want me to win because they know I'm like really good at this stuff. And we need -- and I talk to you this way, I talk to you this way because that's the mentality whether I'm nice or not. I think I'm nice actually. But whether I am or not, we've got to take our country back. We've got to turn our country around. We need that kind of thinking. Whatever that thinking is. Whatever that thinking is we need it. We can't give -- I mean, our deal, I use it all the time. It's not a financial deal though, you could say it's even financial. But we can't get Sergeant Bergdahl, a dirty rotten traitor, and give them, and give them five of the greatest killers on Earth that they've been after for nine years. But that's the deal. So we get Bergdahl, a traitor, and we knew he was a traitor and six people, six young great people were killed going after this bum. Six people. Now in the old days -- there's my man stand up. What do we do with Sergeant Bergdahl 50 years ago? That's right. Boom. Boom. A great veteran, boom. He's gone. He's gone. Six people killed looking for Bergdahl. And we give five people to get it back. And we knew that he was a traitor because they had a general and a colonel go and interview, all of the soldiers that he dealt with and that he was with, they said he deserted. So they knew -- you know, it's one thing they made a mistake, but they knew. We can't do things like that anymore. And by the way, on Bergdahl, I say the other day. No time. They don't want to give me any time. They're letting them out. They're not gonna not only not shoot him. They let him out. They said, well, he's been through a lot. Oh yeah. He's been through a lot. Six young great people died looking for him and he's recommended to get nothing. Zero. And we can't let that happen anymore. So when I talk about myself because I've had an amazing life. I mean I've had a successful life. The Apprentice became one of the great shows on television. I left The Apprentice. I left so much. You know, it's funny. The Apprentice has been so great. Everybody watch The Apprentice. I guess, right? So NBC calls. Steve Burke, the head of Comcast, who's a great guy, came up to my office. Please, Donald do it again. Do it again, please. I said, Steve, I want to run. I want to run. Top people at NBC, top people at Comcast, great people. And Steve is a fantastic guy. He came. He said, please do it again. They wanted me to do it again. Mark Burnett called me. Please do it again. Everybody. Everybody takes a renewal. You'll be like the only one that didn't take a renewal. Are you crazy? I said, Mark, I really want to run because I think I can do a great job. So when I filed my financial disclosure you're not gonna believe this. I had all these guys. Well, he doesn't make much money with The Apprentice. So here's what -- certified numbers. I made $213 million doing the apprentice. Can you believe it? No. Think of it. Think of it. $213 million because we got the ads. I own the show with Mark and the whole thing. $213 million is what I put on my statement. Now these, you know, guy, said oh you know. They didn't believe it until they saw the number that it's a certified number. One of them on MSNBC used to go. Well, he doesn't make any money with The Apprentice. So anyway, so think of it. I made all that money. They want to extend for 28 shows. And I said, no. I'm not gonna do it. And that's the least of it. So I give up a lot. You know these guys, these politicians don't give up anything. They run, they lose. They win, they run. They keep running. It's all they do. They run. They talk. They're nothing. They're nothing. They can't do anything. They can't bring us to the promised land. They can't do it. It's not in their genes. I talk about corporate inversions. Companies are leaving our country. They used to leave New York for Florida. They used to leave Massachusetts actually. They used to leave -- I hate to say, they used to leave for Mexico. They did -- that was pretty stupid, I will say, but we wouldn't let that stuff happen. We wouldn't let it happen. But they used to leave. Plenty left New Hampshire plenty left, as you know, for Mexico. Plenty left Massachusetts. But now, companies are gonna leave our country with thousands and thousands of jobs left behind and abandoned because of our tax code, because of the complexity. There's $2.5 trillion offshore outside of this country. They can't get their money back because of the complexity of the code and because of the amount they have to pay. They're leaving and they're gonna go to the money. And they're gonna leave all the jobs and they're gonna get lower taxes. We can't let this happen. And I talk to these guys on the stand. These people on the stand. They don't even know what the hell I'm talking about. They're politicians. They're good at one thing, getting reelected. That's all they're good for. I see these people. I see them. I look at Rubio, he's a lightweight. He's a lightweight. Everyone say, oh Rubio, he's the next Reagan. He's no Reagan, that I can tell you. No he's not a Reagan. I don't mind. Hey, he's a young guy. Maybe he'll do well. I mean my hair is better than his hair. That I can tell. And I'm a little older. I'm a little old. But now these people are not gonna bring you. They're not gonna take us where you want to go. They're not gonna do it. They're politicians. All talk, no action. Nothing gets done. They control by special interests. It's not gonna happen, folks. It's not gonna happen. It's time. It's time to really bite the bullet and do it right. We got to do it right. We got to do it right. And I want to be tough and I want to be strong and I want to do these things. Because if we don't do it, we're not gonna have a country left. We're just not gonna have a country left. Not gonna happen. Obamacare, a disaster. No, it's a disaster. It's a disaster. Obamacare, premiums are up 35%, 45%, 55%. Deductibles are through the roof. You don't even get to use it. The deductibles are so high. People are getting killed. And it was all a lie. 28 times, you can keep your doctor, keep your plan, everything is wonderful. Even the Democrats were lied to because they would've never approved it. But the president kept saying, great. Everything you can have. And yet, they don't have to use it. The politicians in Washington don't have to use because they don't want it because it's no good. We are going to repeal it and we're going to replace it with something great, with something great. So sad. So sad when you look at it. When you see that. Remember the website? Everyone forgets it. Now, you know, the one problem in politics, it's got like a two-week life. Everybody forgets how bad. Remember the website? $5 billion web site that didn't work. Still does it work. A $5 billion web site. Those days are gone. Those days are gone. I would have gotten Microsoft. I would have gotten somebody. I would have gotten Yahoo!. I would have gotten any. I could have gotten 10 different companies that are the best in the world. They would have done it for nothing. They would have been so honored to do it. We spend hundreds and hundreds and hundreds of millions of dollars doing a web site that doesn't work. And everybody now forgets it. Obamacare has to be repealed. You know, in '17, it's going to cost, it's going to cost our country an absolute fortune. It's going to be useless as far as you're concerned. The deductibles will be so high you're not gonna be able to use it and the cost is gonna be prohibitive. So they're already saying they have to go back to Congress in '17 to redo it, to change it. We're gonna get rid of it. We're gonna get something good. You know who made the money with Obamacare? Other than the fact that the people that designed the web sites were very close to you know who? Right? You know that. But you know I made the money with Obamacare? The insurance companies. They gave a tremendous amount of money to Obama. The insurance companies have made a fortune with Obamacare. Take a look at them. Take a look at these insurance companies. They're raking in billions of dollars with Obamacare, and nobody even knows it. So we're gonna get rid of it. We're gonna come up with a plan that's so good. There's so many ideas, so many plans and it's gonna be good. And you're gonna have your doctor and you're gonna have your plan. You're gonna have what you want. So the other day I was watching the Democrat. It's actually the Democrat debate. You know, they call it the Democratic debate because it sounds better. It's not really the -- it's called the Democrat debate. And I watched Hillary, who doesn't have the strength or the stamina to be president. I can tell. Doesn't have this. No, doesn't have it. She doesn't have the strength or the stamina. We need very strong right now. She's exhausted, folks. She's exhausted. In fact, I think, if she pulls it off, I think her greatest achievement ever will be getting out of the email scandal. I think that will be her greatest achievement. And I think she will do it because I think she's being totally protected by the Democrats. They've destroyed General Petraeus. They've put other people in jail for doing 5% of what she did. And I think that she's gonna get a free pass. I think the Democrats are protecting her because they think you can't vote, you can't vote for Bernie. Did you hear that? The Paris attacks were caused by -- Did you hear this one? The Paris attacks were caused, according to Bernie Sanders, they were caused by global warming. And the other guy, he shouldn't even be on the stage, he was the mayor of Baltimore. He did a great job, OK? So we have issues. We have 93 million people out of the labor force. Think of it. When you have 5.2%, forget it. When you add the real numbers, you probably have a 25% unemployment. And I'll tell you, this place is packed. People are still coming in. Oh, those poor people. They're gonna be so angry when I finish and they're still coming in. People -- can you believe people are still coming in? Let's give them a hand. Give those people a hand. We love those people. They're gonna say, how did Mr. Trump do tonight? How was the speech? They're gonna say, I don't know. We never got in. So we have 93 million people out of the labor force. We have 50 million people in poverty. We have 43 million and now, it's actually gonna be probably closer to 50. 50 million people on food stamps. And I'll tell you what, if we had a real, if we had a real -- Hello. Hello. You know, it's amazing. I mentioned food stamps and that guy, who is seriously overweight, went crazy. He went crazy. Amazing. That's an amazing sight. You know the bad part? Here's the bad thing. So we had three little protests. Each person, I think it was one over there, one over here, one over there, right? So we had three people tonight. Three, right? Three. Three people. So we had three people and the press will say, protestor Trump. We didn't have. We got. We have 12,000 people and they're gonna take three -- with 12,000 people still coming in and they're gonna take three people, these people. They're gonna take three people and say, oh, the protests were unbelievable. Unbelievable. You know it's like Saturday Night Live. Anybody see Saturday Night Live? Good. That was good. Well, I heard about the protests. And I said, oh, it's gonna be tough. This is gonna be tough. So I said one of my guys out and I heard every newscast, there will be major protests tonight in front of NBC at Rockefeller Center. The protests will be unbelievable. I said, you know, we've been going through a side door. It is gonna be rough tonight. This is gonna be rough. So we look and there were like 20 people outside. I sent my guy. I said go check it again. You must be wrong. Comes back. He said, 21 people total. He found, he found one. Then just before I went on. I said go check it again. There was no. You know why? They went home to watch Saturday Night Live. Is this crazy? Crazy. But the press, the press was reporting massive protests against Trump. It's really horrible. It's really, really horrible, really dishonest. And honestly, you're talking about three people. One, two, three, right? Three people. They weren't even in a group because who the hell wants to be with a guy like that to be in a group? Who? Seriously? Who wants to be with him? Nobody. Nobody. Nobody will have him. Nobody. But -- so tomorrow, when you go home and tonight, when you watch your broadcast. You're gonna hear about protests. You're gonna hear that there were protesters outside. I didn't see them. I saw thousands of people trying to come in. Thousands. That line. I never saw that line was four blocks long, five deep. But you're gonna hear about protests and just remember what I said. It's all a big lie. It's a big lie. It's a terrible, terrible lie. It's a terrible, terrible lie. So I just want to close by saying, very shortly, you're fired. I just want to close by saying, look, I've given up a lot to do this. I've given up a tremendous amount. I've given up a lot of deals and economics and shows, a lot of other things. But what I want to say is, we're gonna win if. I get elected, we're gonna win on trade. We're gonna win with ISIS. And boy, are we gonna win with them and we're gonna do it fast. We're gonna win with our military. We're gonna take care of our veterans. We're gonna take care of our veterans. We're gonna do great with our health care. It's gonna be the finest in the land. The finest. And I can only say this. You have to remember this night. You are going to have something special. We are gonna bring back our country. I used to say the silent majority. It's not the silent majority. It used to be the silent majority. This is a very, very vocal majority. You have to keep it going. But we are going to have victory. We're gonna have victories economically. We're gonna have victories on trade. We're gonna put our people back to work. We're not gonna let other countries steal our jobs. It's not gonna happen anymore. We're gonna have great health care. The American Dream is dead, but we're gonna make it bigger and better and stronger than ever, ever, ever before. And we're gonna make America great again. I love you. I love you. I love you. Thank you. Thank you. Thank you. Thank you, everybody. I love you very much. Thank you. Thank you very much."}