{"id":493,"author":"Donald Trump","title":"Speech: Donald Trump in Knoxville, TN","date":"2015-11-16","link":"https://factba.se/transcript/donald-trump-speech-knoxville-tn-november-16-2015","paragraphs":["Wow. USA. USA. USA. Wow. Thank you so much. What an unbelievable crowd. This is unbelievable. Unbelievable. We love you, people. We love you all. This is amazing. Special. Special people, special country. We're going to make it great again. We're going to make it so great. Amazing. So you know a lot of bad things have been happening over the last little while, and it's gone on and on and on. And weakness has shown that when you're weak and ineffective, bad stuff does happen.","You know that. And that's what we're seeing.","I want to start by saying I have a boy, Eric, and he's a special, special young man. I'm very proud of him. And he loves Tennessee. He spends a lot of time here. He's on the board of St. Jude's. And he's raised and given of his own money, gives a lot of the money that I get him, I'll tell you, but he does a great job.","But he gives it to St. Jude's, and he's raised over $28 million for St. Jude's, and he's so proud of it. And they take care of young children that have problems. And so many of them are now with us as opposed to not being with us. So I'm very proud of Eric Trump who spends so much time there. OK? And I had to say that.","I had to say that.","And you know I just left a certain little thing where I was watching our president talking. Boy. He does not get it. He doesn't get it. And you know you hear the term radical Islamic terrorism. He won't say it. He won't say it. And you can't solve a problem if you refuse to talk about what the problem is. And he won't talk about it. He's -- I don't know what's going on with this man.","I don't know what's going on. And you know who else won't talk about it? Hillary. She won't talk about it. Hillary. She won't talk about it. And how about Bernie? Not that he matters because it's over for him. Oh, it's over for him. It was over for him in the first debate when he refused to talk about the e-mails.","Oh no, that's not right. We should -- I mean, she broke the law. He doesn't want to say that. And he got a great sound bite that lasted for about 20 seconds. He got applause for 20 seconds. But how about this guy saying that he thought the Paris attacks had to do a lot with global warming? You wonder why our country's got problems.","When you hear people like this, it's just incredible.","But listen, radical Islamic terrorism, let's talk about it. We have no choice. This is a real problem. You know, normally, I come up, I talk about trade and how China is killing us, and they are. And I talk about how Japan and how Mexico and how everybody is just absolutely eating our lunch. And today, I'm going to be talking about something else.","It's like survival. It's like survival.","And you know, they announced -- ISIS announced they're going to attack us in Washington, which means they're going to attack us someplace else. Unlike Obama when he said we're going to remove everybody, we're sending 50 troops and they're sending 50 people in, right? Why does he have to talk about it? Right?","Why does he have to talk about it? You know the movies shoot first, talk later? Right? Right? Right? Shoot first, you talk about it later. But why does he have to do it? The Good, the Bad and the Ugly, I like that movie, right? Don't we like it? Remember the bad, boom, from the bathtub. Shoot first. The guy was doing too much talking up there, right?","Shoot first, talk later.","So he announces that he's sending 50. Now number one, that's not a great announcement because 50 doesn't sound like too many, number one. But you know the target that's on their heads right now, these young, brave people that are going over to this part of the world, and they're the best, they're the best.","You know they're sending some of our really great ones. But why do you have to tell the enemy that we're sending 50 people? Why do you have to say it? Just think about it. Just think about it. Why did we have to say that, hey, we shouldn't have been in Iraq, now we're leaving.","Why did he have to say when we're leaving, that we're leaving Iraq? And he gives a date, a time, a place we're going to be gone. So the enemy sat back, they waited, and they've caused problems, right? They've got us. It's just terrible. But we're going to solve them. We're going to be tough, but we're going to be smart.","We're going to be sharp. We're going to get other people to do a lot of the work because they should be doing the work. We're doing the work. It's always us. It's always us. You have the Gulf states, so rich, so much money, so much money. Not doing much, folks. Not doing much.","They got to do it. We protect them. We saved them. Without us, they're gone. We saved them. What do they give us? They give us nothing. But you have so many that should be doing -- let me give you an example. France. You have the horrible attack. And by the way, Paris is one of the places in the world that's toughest on guns, all right?","And France. So you had all of these people sitting in these different places, no protection whatsoever. And these animals come in and start shooting up. There was nothing anybody can do.","I know one thing. In this room, it's a whole different story, right? It's a different story. Now think. You know I take a lot of heat where I say guns, you've got to have -- I'm a big, big, big Second Amendment person. Big. Big. And I take heat from some people, but -- and I tell them. And last night I said, you know if 20 of those people, not -- you don't need more, but could have been more, could have been all of them.","But if 20 of those people that were shot viciously, and if you heard the stories, come on over. Boom. Come on over. Boom. Come here. Boom. One after another, after another, hundreds of people.","Plenty are dying and we'll be dead. Now if you had 25 people in there that had guns, OK, would have been a totally different story, folks. That would have been the shootout at the O.K. Corral, right? And you would have had deaths, but it would have been their deaths. And there could have been something, but you're talking about hundreds of people, innocent people, just gunned down.","And horrible. People that said they saw it, they said it's never going to be the same, just the sight of what took place. Never going to be the same.","So we have to remember things like that. We have to remember our schools where they had the school recently, as you know, in a gun-free zone. And they go in and they shoot and they shoot and they shoot. And in the case of the school, they had good, quick police, but still, it's just terrible. We need our Second Amendment, we need protection and we're going to have it. We're going to have it. We're going to have it.","How about the gun-free zones on military bases where our military who are trained, right? Our military trained with guns, trained with weapons and they can't use the guns that a guy walks in, start shooting. And there are -- and a couple of them were highly decorated, unbelievably talented guys dead. They're dead because they weren't allowed to have their gun.","So we're going to change things, folks.","We're going to change.","So today, I don't know, is it coincidence or incompetence or what is it. But today, as you know, President Obama, Friday, Friday, doesn't get it. Friday, five prisoners, same day. It's almost like is he doing this on purpose? Probably. I think maybe. Look at all those people pouring in over there. Look, they continue.","No, no, it's amazing. They continue to pour in. They're pouring in. There are still thousands of people outside. Should we wait? No. Right. To hell with them, right? Right? They'll get in. They'll get in. They'll get in. They'll see about half of what we had to say. Do me a favor, though, explain the rest of it to them.","They know it, anyway. But explain the rest of it to them. Boy, that's a lot of people out there. That's an amazing area. This is an amazing place.","You know what we have. We have something, all of us, in common. We love our country. We love our country. We just love our country. And we're going to see some -- we're going to see some tremendous things happen. I have an expression. You know I was being a little bit mistreated by the press. I announced that I was going to run.","And it takes courage to announce. I mean, what do I need this for, right? What the hell? I could be home relaxing. Instead, we're here together. It's a love fest, right? I really like this better. But when you think, I announced and I talked about a thing called illegal immigration. Who knew that it was going to turn out?","This is a subject that I don't even think was going to be part of the campaign. And boy, did I make it part of the campaign. And the press hit me left and right, left and right for two weeks. Rush Limbaugh said, this man has taken more incoming than any human being I've ever seen. And then he doubled down when he said, no, it's much worse than what I said.","And it is. It's a horror show. And we are going to build a wall. It's going to happen. Going to be -- it's going to be built. And it's going to be a real wall. It's not going to be one of these jobs. You ever see the walls they built at four feet tall, trucks drive over them ramps, trucks loaded up with drugs and just drive right across.","Now we're going to build a real, beautiful, big, high wall. Anybody gets to the top of that wall, they're going to be afraid to come down. It's a long way. And we're going to have a door in the wall and you've heard this before, we're going to let people come in, but they're going to come into our country legally.","They're going to come in legally.","So what happened -- and you know when I see and I watched a little while ago and when five people are released from Gitmo, think of it, on the same day as the shootings, you say, is this right? Is this possible? Is somebody trying to just like torment everybody here and everybody -- they released five people sent in a private plane back to where they can go and fight.","You know they all go back to fight, OK? They all go back. They get released to the UAE, and they're supposed to be under house arrest. Can you believe this house arrest? And they go back to fight. They go back to fight, and they're good fighters. And these are the people that they wanted. The worst to me was Bergdahl.","We get Bergdahl. They get five killers who they've wanted for nine years. And we get Sergeant Bergdahl, a dirty, rotten traitor. And we're just going to have a different country. Now I have to tell you this, we're doing really well. And you know what that means. You know those guys back there are very dishonest, many of them, some are nice.","I see a couple of them. No, actually, some -- oh, he's a nice one. But we get a lot of dishonest stuff, and they say Trump likes to talk about the polls and other people don't talk about the polls. You know why? Because they're all losing. You don't talk about polls. I talk about -- no, it's true. It's true.","I was thinking that because I heard one of them say Trump is always talking about the polls. That's because we're winning. In fact, while I was on the plane, we just had another good poll come in, a really good one. Trump, 31 or 32. Whoever it is second, like a 21 or 22. We're killing him. Great. I love it. I don't care.","By the way, I don't think this should happen. But you know I'm self-funding my campaign. We're going to -- which I think is a big deal, which I think -- other than the little things where women and people send in small amounts of money, I have to. What am I going to do, send it back? Somebody said, well, he's not really self -- because people, it's peanuts, folks.","Believe me, it's peanuts and it's little. How do I send back a woman $17? How do I send back $50 or $100? And I love them not to even bother, but they do it. And in a way, it's a great investment in the country. I mean that's the kind of stuff that I love. I love to see it.","But I'm self-funding the campaign, turning down millions and millions and millions of dollars. I feel so stupid. I feel so foolish. It's not like my life. You know my life has been accepting millions and millions of dollars, not turning it down. This is the first time I've ever turned it down, but I'm turning down a lot.","And recently, somebody said I'd love to help your campaign. You know it's amazing, when you're No. 1, everyone wants to give. And the reason they want to give is because they want things when you get elected. That's all. It's very simple. It's not me. I mean I've heard from some people that I haven't heard from a long time.","Don, congratulations, you're doing phenomenally. Listen, is there any way -- and I'm talking big money, millions of dollars, millions. When a guy gives $5 million to, let's say, Jeb Bush or $5 million to Hillary or $5 million to Rubio. Rubio, I don't get it. I don't get it. But when they give all of this money, they expect something, folks.","Don't forget, I was on the other side of the equation. I was the fair haired boy for years. Then when I said I'm actually running, I became like an interloper. I became a total interloper. But you know we've had the debate -- the debates. I love these debates. I love doing them.","The problem is, OK, so they do this polling on the debates, right? And they have Drudge who's great. He's a great guy, by the way. But they have Drudge and they have Time Magazine. I was on the cover. Other than that, I have no power with Time. Recently, a couple of times, I was on the cover, but they have Time and they have Slate, they have all these things.","And I win every one of them by a lot, right? And then I go home and I say, I want to watch, and they talk about who won the debate and they say, well, Trump was OK. I mean they don't say I was bad. That's too good. You know they say he was -- but Rubio, they say, Rubio -- he was standing there. He made a lot of mistakes.","He stuttered a lot. There was a lot of stutter. And one of Ann Coulter who wrote an excellent book, by the way, excellent book, she wrote an excellent book, right? You know the name of her book? Adios, America. Do you think she's kidding? She's not kidding. But she wrote a good book and she said she can tell before the debate who's going to win because she knows who they're going to say and it doesn't matter.","It doesn't matter. So why watch Marco? And he's up and he's saying different things about parental, parental, parental. Everything's about parental. More important is my children, more -- you know all the things that you would expect to hear. His children are more important. Everything is more important.","Parental, parental. And then he said presidential was the most important thing. And he meant parental, but he said presidential. It was a huge mistake. And I was going to correct him. Nobody said anything about it. It was a big mistake because he wanted to say parental, but his ambition got in the way when he said presidential, right, you know what I'm talking about, and there was a lot of stuttering and a lot of missteps.","And then he -- I got him and I heard he won the debate. How did you win the debate? He made mistakes. So it's a very unfair system, folks. I'll tell you, it's a very unfair system.","But here's what I've learned and more than anything else, I swear, this is true. The public is really, really smart. They're really -- they get it. More than -- and I'm surprised I'm saying it. They really, really get it. The press does not want to give certain people the fair shot, which is true. I happen to be one of them.","It's OK. For instance, I go home and my wife always says, oh, were there any people there? OK. No, it's true. They show me on television all night, they have -- look, look how many cameras are going. They're all going. They never show the crowd. They never fan and show the crowd. Show the crowd. Show the crowd.","Show the crowd. Go ahead, do it. That's a crowd. And even after I tell them to do that, sometime -- look at this room, all the way back into the quarters. I mean this isn't even meant for this. This is a convention center. Look at the crowd. But you know they don't want to do it. And even sometimes I'll say, show the crowd, and I go home, I say, I bet they show -- they don't even turn it. They don't turn it. They don't want to have people see what's happening.","What's happening here is a movement. I'm telling you it's a movement. This is not -- we are tired of stupid people running our government. We are. These stupid people. I used to say they're incompetent, but I don't really care. Either we're going to win or not win. Somebody said, what happens if you don't win?","Bye bye. I'm going. I'll go to Turnberry. I'll go someplace on a yacht, and I'll enjoy my life and that's the end of that.","I want to do something special with you, with everybody because everybody wants to make America great again. We have so many problems. We're going to make it so great. And when I say that, I really mean -- and I really believe we have this potential because the people are so incredible. When I say that, better than ever before.","I really think we have that potential. We're going to make it better than ever before. But we have to be smart and we have to be cunning and we can't have a trade imbalance of $450 billion a year with China. And we can't have a trade imbalance of $75 billion a year with Japan. And we can't have a trade imbalance of $45 billion a year with Mexico.","I love Mexico. I love the people of Mexico. I have thousands of employees. I have thousands of people, Hispanics, working for me. I'm winning polls with the Hispanics. People don't want to say that. In Nevada, I'm leading the poll by a lot. I'm leading the polls with African-Americans. If I keep going with the African-Americans, the election is going to be over.","Still, go out and vote because I had a number at 25%.","One of the announcers said, if Trump gets 25% of the African-American vote, the election's over. He wins. It's true. It's true. And I'm going to, because people understand that I'm going to bring jobs back from China. I'm going to bring jobs back from all of these places that for years have been ripping us off like we're the dumbest human beings on Earth.","And it's not you. It's not you. It's our leaders. They're so grossly -- they don't know what they're doing or they're bad people. And I actually -- maybe I'm naive. I don't think they're bad people. A lot of people are going to go, no, they're bad. They're bad. They're bad. Who cares. The bottom result is it's the same.","We're getting killed. It's not going to happen any longer.","The Iran deal. We give a country that hates us $150 billion. Somebody said they're going to work on nuclear. They don't have to. They can buy them. They don't have to work on them. How about the self-police. They're going to self-police. Iran is going to self-police. How stupid are our people? They're going to self-police.","They are going to -- then when they don't, they have 24 days. But before you get to the 24 days, it's a whole process. So they'll have forever to clean up the place. And I always say and painted battleship gray the floor, right? I always used to paint garages for my father battleship gray. Come up, pop. I like it. No, let's use a different color.","Pop, let's use battleship gray. But they're going to fix it up. I mean how crazy is it?","And how about prisoners? We don't get our prisoners back. They're still over there. Our prisoners are still over there. How can they be so ridiculous? Why aren't we getting our prisoners. We've got four men that are wonderful men. They didn't do anything wrong. They're in Iran. We just gave them the single greatest deal ever negotiated probably with a country, one of the worst deals I've ever seen negotiated of any kind.","I mean Terry doesn't know what he's doing. We just gave them, but he's got a leader. And they never even asked for the prisoners. You know the question was, what about our prisoners? The answer, we don't want to complicate the deal. You know how you say I want my prisoners back first. You don't want them.","We need them for our people because our people don't like that you're holding people in your jails, the worst jails from what I understand, there are on Earth. One of them is in jail because he's a Christian, a minister. He's a pastor. Right. Exactly. And I've met his wife a couple of times. She doesn't know what -- she's such a lovely woman, doesn't know what to do. So we have four people in prison right now that should have come out.","And I don't mean at the end of the deal. Before you start negotiating, you say fellas, fellas, fellas -- it's so sad. You say, fellas, before we start negotiating -- this is like three years ago. Do you ever see a deal take so long? You know any rip-off deal like that has to take a long time because they have so much to do that's taking so much.","We didn't get anything. But you say, fellas, before we start, got to give us our prisoners back. You don't want them. We do. It'll set a good tone for the negotiate, got to give them back. Now they'll probably say, no, we can't do that, we'll say bye bye. Bye. Now you leave, you double up the sanctions, they will call, I guarantee you, within 48 hours, probably sooner.","48 hours, you'll have your prisoners, let's start negotiating. And from there, you make a good deal.","I would have never given them back the money, by the way. The biggest problem I have that if I win, everyone goes crazy, win, win. But it is still an if. I mean I still have these ifs I have to run against. Do we agree? These politicians, I can't stand politician. I'm a politician now. Can you believe it? I can't stand it. All my life, I've dealt with politicians.","They're so easy. They're so easy to deal with. And now I'm a politician. I can't believe it. I. -- look at those people. They're still pouring in. Do you believe it? Look at them. They're still coming in. Watch this. Sorry, folks. The evening's over. Good night. No. Now I'm a politician. So it's one of those things.","It's fine. I don't think I'm going to go -- can I still say I'm in the real estate business or something? OK. You know mind, don't you? I want to negotiate like a real estate guy from New York rather than a politician, right?","So a lot of things have happened, and we're going to make this thing so great. Here's a few of the ideas. And some of the press has actually been good to me because I've had a lot of vision and you gotta get points for vision when you're running for office, right? You've got to get points. So I said, don't go into Iraq.","And I said that. In all fairness, I'm the most militaristic person in this room, although you got a couple of beauties over here with your outfits on, maybe a couple of them. Just look at this guy over here. He's pretty military. I don't know. I think I may top you though. I'm looking at some of these guys, some pretty tough people in this room.","But I'm the most -- look, I believe I want to make our military so strong, so power, so incredible, we'll never have to use it. Nobody's going to mess with us, nobody, nobody. You know General , the other day, he left the office. And about two months ago, I'm watching him on television he said, our forces are right now the least prepared that they've ever been.","I think he mentions World War II. But regardless, whether it's ever or World War II, it's probably ever. And he said that.","Then I talk all the times, we have the generals. They're always being interviewed on television. Always -- I don't want them. I want them to be unpredictable. I don't want our generals being interviewed so the other side can watch. They can watch and they can say, oh, ah, ah. You know we're not dealing with stupid people.","You know it used to be we would have a military. You'd have uniforms here, uniforms there. The one with the most uniform standing wins the war, right? It's a little different now. Now you're talking about sneaky, dirty, underhanded people that want to kill our civilians. They want to go after our civilians.","They want to kill not only our civilians all over the world. And it's going to be stopped. It's going to be stopped.","Somebody criticized me the other day because they asked me what I do, and I said, I'm going to bomb the shit out of them. It's true. I don't care. I don't care. They've got to be stopped. They've got to be stopped. And they should have been stopped a long time ago. Look -- so in Paris the other night, a horrible thing, and then all of a sudden, we attack, and France attacks, of all these different sites that they have, right?","Why didn't they do this a year ago, two years ago? Why didn't they do it? Why did they wait? They always wait for a tragedy to happen. They never forward. They're always waiting for -- so you say, oh, wow, these are training centers, camps. By the way, why did they attack? They attacked the oil. Remember, I've been saying for two years.","Attack the oil. Everybody said, oh, Trump, with the oil, Trump. But I said more than attack and I said attack it, take it and keep it. That's what I said.","So now they're attacking the oil. And a couple of the people said, you know that was really Trump's idea. I've been saying this for two years because a big source of their wealth is the oil. They're making $1 million a day. It's lot of money making $1 million a day. And I kept saying, why are we doing this?","Why aren't we doing this? They're better at the Internet than we are. And they're training people to be terrorists and killers on the Internet. And they're taking them. And then they'll go and they'll go away, which is fine. They'll go away. But then we let them come back into the country. Because nobody wants to take away their rights.","Do you believe this? It's so unbelievable. So they go and they fight for ISIS. They come back into our country and we accept them back. And at some point, they won't be going away. They'll be shooting us here. All right? They're not going to be going over to Syria. They're not going to be going over to these other places.","They'll stay right here.","And then we have a president with all of the problems. And you probably heard that at least one and probably more of the killers, the animals that did what they did in Paris came out of the migration, right? They came out of the migration. So we have a president that wants to take hundreds of thousands, hundreds of thousands of people and move them into our country.","And we don't -- now think of it. And we don't even know who they are. There's no paperwork. There's no anything. And all you have to do is look at the website for Obamacare to know that we're never going to figure it out. $5 billion for a website that still doesn't work. And by the way, Obamacare is going to be repealed.","It's gonna be replaced. It's going to be over. It's going to be over.","So we have no documentation on these people. And I said, you probably saw a couple of weeks, I'm looking at this migration, and it's a terrible thing. I have a bigger heart. I mean I have a tremendous heart. I want to take care of people. But you look at this migration, and I said to my wife the other day, I said you know, they're all -- they seem like so many men, and they're so strong.","I mean they're strong-looking guys, not as strong as you. But that's OK. No, but they're strong-looking guys. They're powerful-looking guys. So I said, why are they back fighting for their country? That was number one. Then I say, is this a Trojan horse? We all know the story of the Trojan horse.","And now you look at what's happening in Germany. So I used to be a fan of Merkel. I used to think she was terrific, a big leader, a great leader. I think what she did to Germany is a disgrace, is a disgrace. It's a total disgrace. And they walked all through Europe to get to Germany. What we should have done for a lot less money because on a humane basis, you want to do it, is do in Syria take a big swatch of land, which believe me, you get for the right price, OK? You take a big swatch and you don't destroy all of Europe.","I mean they've destroyed -- by the time this is finished, wait until you see Germany, wait -- of all places, Germany. Wait until you see what happens to Germany. They're having riots in the streets. They're having crime that they've never had before. Wait until you see the end result of what happens to Germany and Merkel.","No longer a fan. I may have to deal with her. But you know what, I'll tell you right now, no longer a fan, no longer a fan. Wait until you see what happens.","So what I like is build a safe zone in Syria, build a big, beautiful, safe zone, and you have whatever it is so people can live and they'll be happier. And one thing I noticed even with people that work for me where they come from countries that you wouldn't think are so great, I would say moving back to Syria is not the greatest thing, right?","But you know what I find, people come and they work for me legally, OK, legally. But they come, they work for me. When they retire or when they leave, what they really want, they want to go back home to their country. You know that's sort of amazing to me because a lot of the countries, I would say, why would you want to go back?","But they want to go back to their country.","Now in Syria's case, I think it's probably similar. So you keep them in Syria, you build a tremendous safe zone. It'll cost you tremendously much less, much less. And they'll be there. And the weather is the same and all of the different things. And then when this horrible situation that's so horribly run because we don't know what we're doing, when it's all over, they move back and they go back into their cities and they rebuild their cities and they start out and they start over again.","I really believe that. I mean they're going to learn German. They're going to learn all these different languages. It's ridiculous. The weather. A friend of mine lives in Minnesota, and he calls me and he says, can you imagine, it's 130 degrees in Syria, and now they want to send some up to Minnesota where it's 30 degrees.","Well, these people are going to be very, very unhappy. It's cold and beautiful, but it's cold.","So I look at what's happening worldwide and a lot of it is because we don't have the leadership at the top. We're always getting into things that we shouldn't be getting into. And if we take anybody -- you know I've heard they've already taken a few thousand people in. You've heard that, just comes in, they just come in. And I've told people and I said to anybody that's listening, anybody that's brought in to this country from the migration is going to be out.","We're not going to do it. We're not going to do it. We're not going to do it. We're not going to do it. We're going to have a country again. We're going to have borders. We're going to have a country again. Right now, we don't have a country. People are coming in, pouring in, including from that part of the world, they're pouring through our southern border.","We're told, and I was in Laredo, Texas recently, and I met with the border patrol. These are fantastic people. They're told to stand down. People walking right in front of them. They're told you can't do anything, stand down. So here, you have these great people, tough people and they're standing here like that.","They're all equipped. Everything's fine. People are walking right waving at him. You see what's happening. You see what's happening.","We need a strong president. That's right. But you know what? I'll tell you what. You said it, but let me add to it because I know what strong is. You need a strong president, he just said, but you need a smart president, too. He's got to be smart. I know a lot of strong people, but if they're not smart, that's not so good.","That's a bad combination. You need smart, you need strong, you need cunning, you need everything. Because we're being killed. Worldwide, we're being killed, and we can't do it anymore. We can't take it. We owed $19 trillion. It's now going up to $20 trillion or $21 trillion with this ridiculous budget. Did you ever see a budget pass so easily before in your life?","One of the things that disappoints me, and I'm a Republican, I'm a conservative guy, but when I look at the Republicans, you know where the Democrats are coming from. But the Republicans fold on every point. I thought when we won the Senate and we have the house, I thought it would be different. I think we're doing worse now than we've ever done.","We get nothing. We get nothing.","So with the oil, you saw it. With Osama bin Laden, in a book that I wrote in the year 2000, I said Osama bin Laden is going to come and do damage to us, and nobody believed it. And then they said, well, what does Trump know? I mean he's a real estate man. He's a successful businessman. He knows nothing about -- I know more than these politicians.","These guys don't know anything. So I write a book called The America We Deserve. Probably the only book I've ever had that wasn't a rousing success. By the way, my new book is great, Crippled America. Tough name, right? It's doing great. The worst picture of myself I've ever had up. It's the worst. Because how can you have a smiley face with Crippled America as a title?","But I don't want to be a critic. I don't want to just be a critic because what the book is, is it's all the problems and how to fix them because we don't want to just talk about the problems, we want to talk about how to fix the problems, right? We've got to talk about how to fix the problems.","So we have a country that when it's run properly and beautifully and democratically and we don't have to sign our little orders that we can't get the Democrats involved, we can't get -- what he's doing with orders -- and we had a great thing with the executive orders the other day. The courts overruled Obama.","Do you believe it? Do you believe it? Finally, two to one, a two to one decision.","But anyway, so I write a book, The America We Deserve. It was sort of a political book, and it was political for whatever reason. But I talked about the problems of the country and you know what else has changed, except the problems have gotten worse. And one of the things I said is Obama's coming in, and one of the announcers said, no way he said that.","Now the reason I said it is because I really watch and I really love studying our country and studying politics and I really love it. I think that what's going to be is I think that, that will be one of our strengths, frankly. I'll be the greatest job-producing president that God ever created.","But on leadership, I went huge on everything like 72 to two. I mean we have unbelievable numbers, so high that I say, why do we have to have an election? What do we need an election for? But our leadership on military, on the economy, on all these things, the numbers are -- the only thing I don't get so good is like do you like him?","And you know what, I think I'm a nice person, but they say, do you like him? But I think that's probably the least important thing. We want somebody that knows what the hell they're doing now, right? We need somebody that knows what they're doing. So I predicted Osama bin Laden.","So one of the guys said on one of the newscasts, no way. They said, yeah. When was it? 2000. That was a year, a year and a half before the World Trade Center came down. No way. Took the book, looked at it. Whoa, look what Trump -- Trump predicted Osama bin Laden was coming in to do damage. I don't believe it. Good guy that said it, straight shooter, couldn't believe it. Well, in my book, I talk about that.","In my book, I predicted terrorism because I can feel it. I can feel it like I feel good location, OK? In real estate, my father always used to tell people, you know he may be my son, but everything he touches turns to gold. When my father said that, that was a great comp because he was a tough cookie. But he said -- and he said he has an instinct for location.","You have an instinct about things. I really believe I have an instinct for this kind of thing, and I see what's happening. And when I said Osama bin Laden, that was a great thing. When I said terrorism in the same book. Now they really like my books much better when I talk about business and success and things like that.","That's -- those are the books that are all the best sell. This book was probably my least selling book, and yet it was, in a certain way, pretty cool. But I love that book, but I loved what the predictions are.","And a friend of mine called me up the other day and said, forget about Osama bin Laden. In that book, you predicted terrorism. Nobody knew this kind of terrorism before. But I felt it. And you have to have somebody that has an instinct to lead this country. And I know the people I'm running against, believe me, believe me. First of all, Hillary is the worst.","I mean she's terrible. She's terrible. No, no. She's terrible. Hillary is terrible. And you know she was the worst secretary of state in history, and now she wants to be president. Great idea. Great idea. Remember when she was shot down with a helicopter, she got off, bah, bah, bah, bah, bah. So many different lies, so many lies.","And frankly, the email scandal, I don't know if that's over. Probably she's being protected by the Democrats, probably.","But all I know is that people have been treated very harshly, including General Petraeus, for doing 5% of what she did, 5%. You know he was given a sentence that was an unbelievable come down for a guy that was as good a guy as he was and many others for doing a tiny fraction of what she did. But she's being -- I mean she's being protected.","So I believe probably I will get a chance to run against her. I love that. I love it. I love it. And polls already say that I'm going to win against Hillary, but I'll tell you what, I really believe that we will win. We will have such a victory.","Do you know if Mitt Romney had people like yourselves that got up and voted, right, he just said it. People don't realize it. I'm going to do great with Hispanic vote better than I think I'm going to win the Hispanic vote. But I will tell you. Had Mitt Romney who didn't do great with the Hispanic vote but had the people like yourselves got up and voted, and for some reason, there was no inspiration, there just wasn't, it was -- I don't know what it was.","He didn't get the people up. And I said -- before the whole thing was over, I said, why aren't you -- say what you want about Obama. He was on Jay Leno. He was on Letterman. He was on all these shows. I say, are you guys going to go on like do some shows? No, I think we haven't made. You know they believed what they were saying on some of the things that -- that is an election that should have been won.","But remember this, had -- some of -- many of you folks in this room tonight, have you gotten up and voted, he would have won the election. He would have won the election. They didn't -- there was no inspiration. And I'll tell you what, nobody has crowds like I'm getting. These crowds are -- look at this crowd.","I mean look at this crowd. Look at this crowd. And I guarantee everyone in this room, who is not going to vote in this room, seriously? Who is going to vote? No, I know. No, we have a whole thing.","So let's go a little further into the border, because the border has so much to do. Somebody said it, I was going to mention before, Ann Coulter, she said, Trump just became president. When she saw the problem, and you saw that quote, it was a well-known quote, because when they saw the problem in Paris, that has so much to do with what we're talking about.","So we can have a border, we can have the wall. We're going to get rid of people that we have in this country who are here illegally, some of whom are excellent, great people, but they have to come back legally. They have to. They have to come back legally. They have to. There's nothing we could do. We either have a country or we don't. They have to come back legally.","And then again, we have some people who are really bad dudes. You know that. We have gangs in Los Angeles. They're all illegal. We have gangs that are 100% illegals. We have problems in Chicago. We have -- don't even mention the drug problems, the drugs that pour across the border, so many other problems, and that causes problems.","But we have people that is so bad, they are going to be gone so fast out of this country and they're going back where they came from.","And I'll tell you something, I'm not putting them in our prisons, which are brimming now you can't even get -- we're not putting them so that we have to protect them for 45 years. We're bringing them back to the country they came from. Let that country worry about it. Let that country pay for it. We're not going to load up our prisons, our hospitals.","We're not going to do it. We're not doing it.","This is no longer going to be the stupid country that everyone thinks we are because our leaders are so dead and so pathetic. So we're taking the bad ones, and this is going to be before the wall, before the wall. We're taking the bad ones. They're out of here. They're going back and we're going to get rid of them, and they're not coming back in, folks.","They're not -- there's no way they come back in. They're not coming back. And that's going to happen as sure as you're standing there, and that's going to be one of the first things that happen.","The first thing is I'm going to take Obama's executive order where he said, everyone, just come on in. Come on in, folks. Come on in. And we're going to end it. We're going to end it. We're not going to have that. The only thing good about an executive order is the new president can come in and terminate it with just a signature.","I don't have to go to Congress. I don't have to go anywhere. It'll be terminated in the first 10 minutes of my --","And by the way, prior to entering, I guarantee you this, those four prisoners that we're talking about, prior to my taking office, I guarantee you, those prisoners are home. They're going to be sent off. They're not going to play games. They're not going to play games with us. Those four prisoners are coming home before I ever take office.","I guarantee you that. You watch. As sure as you're standing there, they're coming home or there's going to be hell to pay. It's going to be hell to pay. Believe me, there will be hell to pay.","So we're going to straighten out our country from the standpoint of immigration. We're going to make great, great trade deals. We're no longer going to be a laughing stock on trade. We're no longer going to let our jobs go out to other countries, which by the way, the immigration cost is a big, big -- you know it's not just what we're talking about, tremendous numbers of jobs lost.","And you know our real unemployment rate is at the 5.2%. That was done for political reasons by politicians that want you people to believe they're doing a good job. Our number's probably 25%. We have close to 100 million people. They look for work. They keep looking. They look. When they give up, they're considered statistically as though they're employed.","Our real number is between 20 and 25%. And I guarantee you this, if our number were really 5.2, that phony number, every time I see it, it sickens you. 5.2, unemployment is down. The people have given up looking for work. They've given up looking for work. And I guarantee you, I don't know how many people are in this room tonight, but it's a hell of a lot.","If it's 5.2, I have 15 people standing in the front row. And they're probably not going to vote for me anyway, those 50. So we're going to straighten it out. We're going to do so many things that are going to be just so, so great.","The veterans. I love the veterans. Hey, who in the room is a veteran? Raise your hand. Amazing. So our veterans are, in many cases, not treated as well as the illegals, you know that, right? They have a waitlist. The longest -- three months ago, on a Wednesday, I'll never forget, I'm reading it, the longest waitlist in the history of the Veterans Administration.","People are waiting five and six days. Can you imagine yourself -- and some of you probably have this problem. But can you imagine yourself going to a doctor's office and waiting five or six days and you're sick? And people are dying by the tens of thousands. They're dying because they're not getting the care.","Our veterans are the greatest people. They're our great people. Our veterans are our greatest people. I love them. I've gotten to know so many over the years. I go to New Hampshire. I go to Iowa. I meet so many veterans. And some of the tales are just terrible. When you hear what they go through, for simple medical care where they can be better quickly, quickly, and they can't get it.","One man was telling me, he was in the service for 22 years, fought in wars, everything, did everything, missing an arm. And he said, you know I waited and waited and waited, and after the end of five days, the doctor told me, I'm sorry, I'm going on vacation now. This is what happens though. This is what happens.","And we're going to straighten it out.","Now I put in a plan, a policy plan. You know the press wants policy. The people just want results, but the press wants policy. I put in a veteran's plan and, among other things, covers a lot of territory and has gotten fantastic reviews. But look, you have doctors, they're leaving the profession because of Obamacare, because they need more accountants and they need nurses.","But you have people -- it's true. They need more. I have a friend who's a doctor. He's going to quit. He's not an old guy. I say, why? He said because it's impossible. He said we need so much in accounting. And he said he has more accountants than he has nurses. So we're going to take our veterans. And if they have a wait, which they always do, we're going to let him go to a private doctor or a private hospital or a public hospital.","Whatever it is, we're going to pay the bill.","And you want to know something? That's going to cost us. Number one, it's going to be great for them. They love it. It's going to be great for them. But you know what else is going to be great, it's going to be great. It's going to cost us a lot less money. So if they're going to wait, they're going to go to a private doctor, the doctor is going to take care of them.","We're going to pay the bill, we'll work out some kind of a schedule so we don't get ripped too bad, because doctors do have a tendency to get a little aggressive, right? We will -- don't worry about it, folks. We'll be fair. But they're going to go out and see a doctor, see a public hospital, a private hospital, they're going to get taken care of quickly, beautifully.","Nobody is going to be dying, that shouldn't be dying. And everybody loves that plan. How did the vets feel about that? OK? Yeah. No, we've gotten like a tremendous response. All right.","So here's the story. What? I like it. I like what you just said. So what happens, what happens is the following. Amnesty. Amnesty is -- forget it. You know who is running, right? You know who's going. You know what's happening, right? Amnesty. No amnesty. They leave the country. In a nutshell, our military's going to be taken care of. Our vets are going to never be happier than they're going to be. We're going to treat them better than any vets anywhere.","Our vets are going to be treated fantastically.","We're going to win on trade. And you know I always say we don't win anymore. We just don't win. We used to win. We don't win anymore. When was the last time you saw our country win? We don't win anymore. We're going to win so much. I joke sometimes. I say we're going to win so much, you're going to get disgusted and tired and bored.","But we never get tired of winning, ever. We're going to win on trade. We're going to win on health care. We're going to win on education. And you know an education -- by the way, we're 28th in the world. Third-world countries are ahead of us. And yet we spend more per student by double than any other country.","And yet we're 28. In my campaign, I'm proud to tell you that I've spent less or just about less. I mean a couple of these clowns, how they're even running is like hard to believe, OK? They spend nothing but tacky. I mean this guy, he's got zero, spent no money. One of the worst governors in the history of New York.","He's got zero and he's running, and now he wants to try and get on Saturday Night Live because I was on. He wants equal time. So we have guys that shouldn't be under any circumstance they should be out. But think of it, I spent the least money and I have the best result. I'm No. 1. Wouldn't it be great if our country could do the same thing?","Think of it. Think of it. Now I'm going to be spending a lot of money because these characters will take out some, you know, ads that will be untrue and they'll take out ads. And I'll just say anybody that hits me gets hit ten times harder, OK? But -- so I'll be spending a lot of money. But think of the results so far.","I've spent the least amount of money and I have the best result.","So we're going to win on trade. We're going to win on everything, folks. We're going to have a country that you're going to be proud of, just like this crowd, which is so great. We are going to look around today. You're going to look around.","You're going to see each other. I'm telling you, this is something special happening. Everywhere I go -- it's not just here. I go to Iowa. I go to New Hampshire. I go to South Carolina. I go to North Carolina. I go to Texas. I was in Virginia. I was in Oklahoma. It's the same thing. The people love the country.","They want results. They want to see something great happen. They want to win again.","They want to be proud of our country. And I can only tell you this. I have never worked so hard, but I don't care because I love it. I'm staying in. We are going to win this, and we're going to turn our country around. And you're going to be so proud of your country. And you're going to be so proud of your president.","You're going to be so proud of your president because I don't care about anything, no special interests, no nothing. The insurance companies, I couldn't care less. I don't even like him. I mean they're making a fortune, by the way, on Obamacare. They were a big supporter of Obama. They are making a fortune on Obamacare.","The insurance companies, the car company, I don't care. I don't care. We're going to have our car companies stay here. We're not letting them go to Mexico so easily, where they go and build $2.5 billion plants and they take our jobs and then they sell us cars and there's no tax, no nothing. And we get nothing out of it.","You are going to be proud of your country. You're going to be proud of your president. You are going to see something that is going to take place quickly. I'm not talking about years and years and years. We can do things quickly. We'll get it done quickly. The American dream, and you know this, a lot of people have said it. The American dream is dead.","But we're going to make it bigger and better and stronger than ever before. And we are going to make America great again. And I love you all. Thank you. I love you. Thank you all."],"text":" Wow. USA. USA. USA. Wow. Thank you so much. What an unbelievable crowd. This is unbelievable. Unbelievable. We love you, people. We love you all. This is amazing. Special. Special people, special country. We're going to make it great again. We're going to make it so great. Amazing. So you know a lot of bad things have been happening over the last little while, and it's gone on and on and on. And weakness has shown that when you're weak and ineffective, bad stuff does happen. You know that. And that's what we're seeing. I want to start by saying I have a boy, Eric, and he's a special, special young man. I'm very proud of him. And he loves Tennessee. He spends a lot of time here. He's on the board of St. Jude's. And he's raised and given of his own money, gives a lot of the money that I get him, I'll tell you, but he does a great job. But he gives it to St. Jude's, and he's raised over $28 million for St. Jude's, and he's so proud of it. And they take care of young children that have problems. And so many of them are now with us as opposed to not being with us. So I'm very proud of Eric Trump who spends so much time there. OK? And I had to say that. I had to say that. And you know I just left a certain little thing where I was watching our president talking. Boy. He does not get it. He doesn't get it. And you know you hear the term radical Islamic terrorism. He won't say it. He won't say it. And you can't solve a problem if you refuse to talk about what the problem is. And he won't talk about it. He's -- I don't know what's going on with this man. I don't know what's going on. And you know who else won't talk about it? Hillary. She won't talk about it. Hillary. She won't talk about it. And how about Bernie? Not that he matters because it's over for him. Oh, it's over for him. It was over for him in the first debate when he refused to talk about the e-mails. Oh no, that's not right. We should -- I mean, she broke the law. He doesn't want to say that. And he got a great sound bite that lasted for about 20 seconds. He got applause for 20 seconds. But how about this guy saying that he thought the Paris attacks had to do a lot with global warming? You wonder why our country's got problems. When you hear people like this, it's just incredible. But listen, radical Islamic terrorism, let's talk about it. We have no choice. This is a real problem. You know, normally, I come up, I talk about trade and how China is killing us, and they are. And I talk about how Japan and how Mexico and how everybody is just absolutely eating our lunch. And today, I'm going to be talking about something else. It's like survival. It's like survival. And you know, they announced -- ISIS announced they're going to attack us in Washington, which means they're going to attack us someplace else. Unlike Obama when he said we're going to remove everybody, we're sending 50 troops and they're sending 50 people in, right? Why does he have to talk about it? Right? Why does he have to talk about it? You know the movies shoot first, talk later? Right? Right? Right? Shoot first, you talk about it later. But why does he have to do it? The Good, the Bad and the Ugly, I like that movie, right? Don't we like it? Remember the bad, boom, from the bathtub. Shoot first. The guy was doing too much talking up there, right? Shoot first, talk later. So he announces that he's sending 50. Now number one, that's not a great announcement because 50 doesn't sound like too many, number one. But you know the target that's on their heads right now, these young, brave people that are going over to this part of the world, and they're the best, they're the best. You know they're sending some of our really great ones. But why do you have to tell the enemy that we're sending 50 people? Why do you have to say it? Just think about it. Just think about it. Why did we have to say that, hey, we shouldn't have been in Iraq, now we're leaving. Why did he have to say when we're leaving, that we're leaving Iraq? And he gives a date, a time, a place we're going to be gone. So the enemy sat back, they waited, and they've caused problems, right? They've got us. It's just terrible. But we're going to solve them. We're going to be tough, but we're going to be smart. We're going to be sharp. We're going to get other people to do a lot of the work because they should be doing the work. We're doing the work. It's always us. It's always us. You have the Gulf states, so rich, so much money, so much money. Not doing much, folks. Not doing much. They got to do it. We protect them. We saved them. Without us, they're gone. We saved them. What do they give us? They give us nothing. But you have so many that should be doing -- let me give you an example. France. You have the horrible attack. And by the way, Paris is one of the places in the world that's toughest on guns, all right? And France. So you had all of these people sitting in these different places, no protection whatsoever. And these animals come in and start shooting up. There was nothing anybody can do. I know one thing. In this room, it's a whole different story, right? It's a different story. Now think. You know I take a lot of heat where I say guns, you've got to have -- I'm a big, big, big Second Amendment person. Big. Big. And I take heat from some people, but -- and I tell them. And last night I said, you know if 20 of those people, not -- you don't need more, but could have been more, could have been all of them. But if 20 of those people that were shot viciously, and if you heard the stories, come on over. Boom. Come on over. Boom. Come here. Boom. One after another, after another, hundreds of people. Plenty are dying and we'll be dead. Now if you had 25 people in there that had guns, OK, would have been a totally different story, folks. That would have been the shootout at the O.K. Corral, right? And you would have had deaths, but it would have been their deaths. And there could have been something, but you're talking about hundreds of people, innocent people, just gunned down. And horrible. People that said they saw it, they said it's never going to be the same, just the sight of what took place. Never going to be the same. So we have to remember things like that. We have to remember our schools where they had the school recently, as you know, in a gun-free zone. And they go in and they shoot and they shoot and they shoot. And in the case of the school, they had good, quick police, but still, it's just terrible. We need our Second Amendment, we need protection and we're going to have it. We're going to have it. We're going to have it. How about the gun-free zones on military bases where our military who are trained, right? Our military trained with guns, trained with weapons and they can't use the guns that a guy walks in, start shooting. And there are -- and a couple of them were highly decorated, unbelievably talented guys dead. They're dead because they weren't allowed to have their gun. So we're going to change things, folks. We're going to change. So today, I don't know, is it coincidence or incompetence or what is it. But today, as you know, President Obama, Friday, Friday, doesn't get it. Friday, five prisoners, same day. It's almost like is he doing this on purpose? Probably. I think maybe. Look at all those people pouring in over there. Look, they continue. No, no, it's amazing. They continue to pour in. They're pouring in. There are still thousands of people outside. Should we wait? No. Right. To hell with them, right? Right? They'll get in. They'll get in. They'll get in. They'll see about half of what we had to say. Do me a favor, though, explain the rest of it to them. They know it, anyway. But explain the rest of it to them. Boy, that's a lot of people out there. That's an amazing area. This is an amazing place. You know what we have. We have something, all of us, in common. We love our country. We love our country. We just love our country. And we're going to see some -- we're going to see some tremendous things happen. I have an expression. You know I was being a little bit mistreated by the press. I announced that I was going to run. And it takes courage to announce. I mean, what do I need this for, right? What the hell? I could be home relaxing. Instead, we're here together. It's a love fest, right? I really like this better. But when you think, I announced and I talked about a thing called illegal immigration. Who knew that it was going to turn out? This is a subject that I don't even think was going to be part of the campaign. And boy, did I make it part of the campaign. And the press hit me left and right, left and right for two weeks. Rush Limbaugh said, this man has taken more incoming than any human being I've ever seen. And then he doubled down when he said, no, it's much worse than what I said. And it is. It's a horror show. And we are going to build a wall. It's going to happen. Going to be -- it's going to be built. And it's going to be a real wall. It's not going to be one of these jobs. You ever see the walls they built at four feet tall, trucks drive over them ramps, trucks loaded up with drugs and just drive right across. Now we're going to build a real, beautiful, big, high wall. Anybody gets to the top of that wall, they're going to be afraid to come down. It's a long way. And we're going to have a door in the wall and you've heard this before, we're going to let people come in, but they're going to come into our country legally. They're going to come in legally. So what happened -- and you know when I see and I watched a little while ago and when five people are released from Gitmo, think of it, on the same day as the shootings, you say, is this right? Is this possible? Is somebody trying to just like torment everybody here and everybody -- they released five people sent in a private plane back to where they can go and fight. You know they all go back to fight, OK? They all go back. They get released to the UAE, and they're supposed to be under house arrest. Can you believe this house arrest? And they go back to fight. They go back to fight, and they're good fighters. And these are the people that they wanted. The worst to me was Bergdahl. We get Bergdahl. They get five killers who they've wanted for nine years. And we get Sergeant Bergdahl, a dirty, rotten traitor. And we're just going to have a different country. Now I have to tell you this, we're doing really well. And you know what that means. You know those guys back there are very dishonest, many of them, some are nice. I see a couple of them. No, actually, some -- oh, he's a nice one. But we get a lot of dishonest stuff, and they say Trump likes to talk about the polls and other people don't talk about the polls. You know why? Because they're all losing. You don't talk about polls. I talk about -- no, it's true. It's true. I was thinking that because I heard one of them say Trump is always talking about the polls. That's because we're winning. In fact, while I was on the plane, we just had another good poll come in, a really good one. Trump, 31 or 32. Whoever it is second, like a 21 or 22. We're killing him. Great. I love it. I don't care. By the way, I don't think this should happen. But you know I'm self-funding my campaign. We're going to -- which I think is a big deal, which I think -- other than the little things where women and people send in small amounts of money, I have to. What am I going to do, send it back? Somebody said, well, he's not really self -- because people, it's peanuts, folks. Believe me, it's peanuts and it's little. How do I send back a woman $17? How do I send back $50 or $100? And I love them not to even bother, but they do it. And in a way, it's a great investment in the country. I mean that's the kind of stuff that I love. I love to see it. But I'm self-funding the campaign, turning down millions and millions and millions of dollars. I feel so stupid. I feel so foolish. It's not like my life. You know my life has been accepting millions and millions of dollars, not turning it down. This is the first time I've ever turned it down, but I'm turning down a lot. And recently, somebody said I'd love to help your campaign. You know it's amazing, when you're No. 1, everyone wants to give. And the reason they want to give is because they want things when you get elected. That's all. It's very simple. It's not me. I mean I've heard from some people that I haven't heard from a long time. Don, congratulations, you're doing phenomenally. Listen, is there any way -- and I'm talking big money, millions of dollars, millions. When a guy gives $5 million to, let's say, Jeb Bush or $5 million to Hillary or $5 million to Rubio. Rubio, I don't get it. I don't get it. But when they give all of this money, they expect something, folks. Don't forget, I was on the other side of the equation. I was the fair haired boy for years. Then when I said I'm actually running, I became like an interloper. I became a total interloper. But you know we've had the debate -- the debates. I love these debates. I love doing them. The problem is, OK, so they do this polling on the debates, right? And they have Drudge who's great. He's a great guy, by the way. But they have Drudge and they have Time Magazine. I was on the cover. Other than that, I have no power with Time. Recently, a couple of times, I was on the cover, but they have Time and they have Slate, they have all these things. And I win every one of them by a lot, right? And then I go home and I say, I want to watch, and they talk about who won the debate and they say, well, Trump was OK. I mean they don't say I was bad. That's too good. You know they say he was -- but Rubio, they say, Rubio -- he was standing there. He made a lot of mistakes. He stuttered a lot. There was a lot of stutter. And one of Ann Coulter who wrote an excellent book, by the way, excellent book, she wrote an excellent book, right? You know the name of her book? Adios, America. Do you think she's kidding? She's not kidding. But she wrote a good book and she said she can tell before the debate who's going to win because she knows who they're going to say and it doesn't matter. It doesn't matter. So why watch Marco? And he's up and he's saying different things about parental, parental, parental. Everything's about parental. More important is my children, more -- you know all the things that you would expect to hear. His children are more important. Everything is more important. Parental, parental. And then he said presidential was the most important thing. And he meant parental, but he said presidential. It was a huge mistake. And I was going to correct him. Nobody said anything about it. It was a big mistake because he wanted to say parental, but his ambition got in the way when he said presidential, right, you know what I'm talking about, and there was a lot of stuttering and a lot of missteps. And then he -- I got him and I heard he won the debate. How did you win the debate? He made mistakes. So it's a very unfair system, folks. I'll tell you, it's a very unfair system. But here's what I've learned and more than anything else, I swear, this is true. The public is really, really smart. They're really -- they get it. More than -- and I'm surprised I'm saying it. They really, really get it. The press does not want to give certain people the fair shot, which is true. I happen to be one of them. It's OK. For instance, I go home and my wife always says, oh, were there any people there? OK. No, it's true. They show me on television all night, they have -- look, look how many cameras are going. They're all going. They never show the crowd. They never fan and show the crowd. Show the crowd. Show the crowd. Show the crowd. Go ahead, do it. That's a crowd. And even after I tell them to do that, sometime -- look at this room, all the way back into the quarters. I mean this isn't even meant for this. This is a convention center. Look at the crowd. But you know they don't want to do it. And even sometimes I'll say, show the crowd, and I go home, I say, I bet they show -- they don't even turn it. They don't turn it. They don't want to have people see what's happening. What's happening here is a movement. I'm telling you it's a movement. This is not -- we are tired of stupid people running our government. We are. These stupid people. I used to say they're incompetent, but I don't really care. Either we're going to win or not win. Somebody said, what happens if you don't win? Bye bye. I'm going. I'll go to Turnberry. I'll go someplace on a yacht, and I'll enjoy my life and that's the end of that. I want to do something special with you, with everybody because everybody wants to make America great again. We have so many problems. We're going to make it so great. And when I say that, I really mean -- and I really believe we have this potential because the people are so incredible. When I say that, better than ever before. I really think we have that potential. We're going to make it better than ever before. But we have to be smart and we have to be cunning and we can't have a trade imbalance of $450 billion a year with China. And we can't have a trade imbalance of $75 billion a year with Japan. And we can't have a trade imbalance of $45 billion a year with Mexico. I love Mexico. I love the people of Mexico. I have thousands of employees. I have thousands of people, Hispanics, working for me. I'm winning polls with the Hispanics. People don't want to say that. In Nevada, I'm leading the poll by a lot. I'm leading the polls with African-Americans. If I keep going with the African-Americans, the election is going to be over. Still, go out and vote because I had a number at 25%. One of the announcers said, if Trump gets 25% of the African-American vote, the election's over. He wins. It's true. It's true. And I'm going to, because people understand that I'm going to bring jobs back from China. I'm going to bring jobs back from all of these places that for years have been ripping us off like we're the dumbest human beings on Earth. And it's not you. It's not you. It's our leaders. They're so grossly -- they don't know what they're doing or they're bad people. And I actually -- maybe I'm naive. I don't think they're bad people. A lot of people are going to go, no, they're bad. They're bad. They're bad. Who cares. The bottom result is it's the same. We're getting killed. It's not going to happen any longer. The Iran deal. We give a country that hates us $150 billion. Somebody said they're going to work on nuclear. They don't have to. They can buy them. They don't have to work on them. How about the self-police. They're going to self-police. Iran is going to self-police. How stupid are our people? They're going to self-police. They are going to -- then when they don't, they have 24 days. But before you get to the 24 days, it's a whole process. So they'll have forever to clean up the place. And I always say and painted battleship gray the floor, right? I always used to paint garages for my father battleship gray. Come up, pop. I like it. No, let's use a different color. Pop, let's use battleship gray. But they're going to fix it up. I mean how crazy is it? And how about prisoners? We don't get our prisoners back. They're still over there. Our prisoners are still over there. How can they be so ridiculous? Why aren't we getting our prisoners. We've got four men that are wonderful men. They didn't do anything wrong. They're in Iran. We just gave them the single greatest deal ever negotiated probably with a country, one of the worst deals I've ever seen negotiated of any kind. I mean Terry doesn't know what he's doing. We just gave them, but he's got a leader. And they never even asked for the prisoners. You know the question was, what about our prisoners? The answer, we don't want to complicate the deal. You know how you say I want my prisoners back first. You don't want them. We need them for our people because our people don't like that you're holding people in your jails, the worst jails from what I understand, there are on Earth. One of them is in jail because he's a Christian, a minister. He's a pastor. Right. Exactly. And I've met his wife a couple of times. She doesn't know what -- she's such a lovely woman, doesn't know what to do. So we have four people in prison right now that should have come out. And I don't mean at the end of the deal. Before you start negotiating, you say fellas, fellas, fellas -- it's so sad. You say, fellas, before we start negotiating -- this is like three years ago. Do you ever see a deal take so long? You know any rip-off deal like that has to take a long time because they have so much to do that's taking so much. We didn't get anything. But you say, fellas, before we start, got to give us our prisoners back. You don't want them. We do. It'll set a good tone for the negotiate, got to give them back. Now they'll probably say, no, we can't do that, we'll say bye bye. Bye. Now you leave, you double up the sanctions, they will call, I guarantee you, within 48 hours, probably sooner. 48 hours, you'll have your prisoners, let's start negotiating. And from there, you make a good deal. I would have never given them back the money, by the way. The biggest problem I have that if I win, everyone goes crazy, win, win. But it is still an if. I mean I still have these ifs I have to run against. Do we agree? These politicians, I can't stand politician. I'm a politician now. Can you believe it? I can't stand it. All my life, I've dealt with politicians. They're so easy. They're so easy to deal with. And now I'm a politician. I can't believe it. I. -- look at those people. They're still pouring in. Do you believe it? Look at them. They're still coming in. Watch this. Sorry, folks. The evening's over. Good night. No. Now I'm a politician. So it's one of those things. It's fine. I don't think I'm going to go -- can I still say I'm in the real estate business or something? OK. You know mind, don't you? I want to negotiate like a real estate guy from New York rather than a politician, right? So a lot of things have happened, and we're going to make this thing so great. Here's a few of the ideas. And some of the press has actually been good to me because I've had a lot of vision and you gotta get points for vision when you're running for office, right? You've got to get points. So I said, don't go into Iraq. And I said that. In all fairness, I'm the most militaristic person in this room, although you got a couple of beauties over here with your outfits on, maybe a couple of them. Just look at this guy over here. He's pretty military. I don't know. I think I may top you though. I'm looking at some of these guys, some pretty tough people in this room. But I'm the most -- look, I believe I want to make our military so strong, so power, so incredible, we'll never have to use it. Nobody's going to mess with us, nobody, nobody. You know General , the other day, he left the office. And about two months ago, I'm watching him on television he said, our forces are right now the least prepared that they've ever been. I think he mentions World War II. But regardless, whether it's ever or World War II, it's probably ever. And he said that. Then I talk all the times, we have the generals. They're always being interviewed on television. Always -- I don't want them. I want them to be unpredictable. I don't want our generals being interviewed so the other side can watch. They can watch and they can say, oh, ah, ah. You know we're not dealing with stupid people. You know it used to be we would have a military. You'd have uniforms here, uniforms there. The one with the most uniform standing wins the war, right? It's a little different now. Now you're talking about sneaky, dirty, underhanded people that want to kill our civilians. They want to go after our civilians. They want to kill not only our civilians all over the world. And it's going to be stopped. It's going to be stopped. Somebody criticized me the other day because they asked me what I do, and I said, I'm going to bomb the shit out of them. It's true. I don't care. I don't care. They've got to be stopped. They've got to be stopped. And they should have been stopped a long time ago. Look -- so in Paris the other night, a horrible thing, and then all of a sudden, we attack, and France attacks, of all these different sites that they have, right? Why didn't they do this a year ago, two years ago? Why didn't they do it? Why did they wait? They always wait for a tragedy to happen. They never forward. They're always waiting for -- so you say, oh, wow, these are training centers, camps. By the way, why did they attack? They attacked the oil. Remember, I've been saying for two years. Attack the oil. Everybody said, oh, Trump, with the oil, Trump. But I said more than attack and I said attack it, take it and keep it. That's what I said. So now they're attacking the oil. And a couple of the people said, you know that was really Trump's idea. I've been saying this for two years because a big source of their wealth is the oil. They're making $1 million a day. It's lot of money making $1 million a day. And I kept saying, why are we doing this? Why aren't we doing this? They're better at the Internet than we are. And they're training people to be terrorists and killers on the Internet. And they're taking them. And then they'll go and they'll go away, which is fine. They'll go away. But then we let them come back into the country. Because nobody wants to take away their rights. Do you believe this? It's so unbelievable. So they go and they fight for ISIS. They come back into our country and we accept them back. And at some point, they won't be going away. They'll be shooting us here. All right? They're not going to be going over to Syria. They're not going to be going over to these other places. They'll stay right here. And then we have a president with all of the problems. And you probably heard that at least one and probably more of the killers, the animals that did what they did in Paris came out of the migration, right? They came out of the migration. So we have a president that wants to take hundreds of thousands, hundreds of thousands of people and move them into our country. And we don't -- now think of it. And we don't even know who they are. There's no paperwork. There's no anything. And all you have to do is look at the website for Obamacare to know that we're never going to figure it out. $5 billion for a website that still doesn't work. And by the way, Obamacare is going to be repealed. It's gonna be replaced. It's going to be over. It's going to be over. So we have no documentation on these people. And I said, you probably saw a couple of weeks, I'm looking at this migration, and it's a terrible thing. I have a bigger heart. I mean I have a tremendous heart. I want to take care of people. But you look at this migration, and I said to my wife the other day, I said you know, they're all -- they seem like so many men, and they're so strong. I mean they're strong-looking guys, not as strong as you. But that's OK. No, but they're strong-looking guys. They're powerful-looking guys. So I said, why are they back fighting for their country? That was number one. Then I say, is this a Trojan horse? We all know the story of the Trojan horse. And now you look at what's happening in Germany. So I used to be a fan of Merkel. I used to think she was terrific, a big leader, a great leader. I think what she did to Germany is a disgrace, is a disgrace. It's a total disgrace. And they walked all through Europe to get to Germany. What we should have done for a lot less money because on a humane basis, you want to do it, is do in Syria take a big swatch of land, which believe me, you get for the right price, OK? You take a big swatch and you don't destroy all of Europe. I mean they've destroyed -- by the time this is finished, wait until you see Germany, wait -- of all places, Germany. Wait until you see what happens to Germany. They're having riots in the streets. They're having crime that they've never had before. Wait until you see the end result of what happens to Germany and Merkel. No longer a fan. I may have to deal with her. But you know what, I'll tell you right now, no longer a fan, no longer a fan. Wait until you see what happens. So what I like is build a safe zone in Syria, build a big, beautiful, safe zone, and you have whatever it is so people can live and they'll be happier. And one thing I noticed even with people that work for me where they come from countries that you wouldn't think are so great, I would say moving back to Syria is not the greatest thing, right? But you know what I find, people come and they work for me legally, OK, legally. But they come, they work for me. When they retire or when they leave, what they really want, they want to go back home to their country. You know that's sort of amazing to me because a lot of the countries, I would say, why would you want to go back? But they want to go back to their country. Now in Syria's case, I think it's probably similar. So you keep them in Syria, you build a tremendous safe zone. It'll cost you tremendously much less, much less. And they'll be there. And the weather is the same and all of the different things. And then when this horrible situation that's so horribly run because we don't know what we're doing, when it's all over, they move back and they go back into their cities and they rebuild their cities and they start out and they start over again. I really believe that. I mean they're going to learn German. They're going to learn all these different languages. It's ridiculous. The weather. A friend of mine lives in Minnesota, and he calls me and he says, can you imagine, it's 130 degrees in Syria, and now they want to send some up to Minnesota where it's 30 degrees. Well, these people are going to be very, very unhappy. It's cold and beautiful, but it's cold. So I look at what's happening worldwide and a lot of it is because we don't have the leadership at the top. We're always getting into things that we shouldn't be getting into. And if we take anybody -- you know I've heard they've already taken a few thousand people in. You've heard that, just comes in, they just come in. And I've told people and I said to anybody that's listening, anybody that's brought in to this country from the migration is going to be out. We're not going to do it. We're not going to do it. We're not going to do it. We're not going to do it. We're going to have a country again. We're going to have borders. We're going to have a country again. Right now, we don't have a country. People are coming in, pouring in, including from that part of the world, they're pouring through our southern border. We're told, and I was in Laredo, Texas recently, and I met with the border patrol. These are fantastic people. They're told to stand down. People walking right in front of them. They're told you can't do anything, stand down. So here, you have these great people, tough people and they're standing here like that. They're all equipped. Everything's fine. People are walking right waving at him. You see what's happening. You see what's happening. We need a strong president. That's right. But you know what? I'll tell you what. You said it, but let me add to it because I know what strong is. You need a strong president, he just said, but you need a smart president, too. He's got to be smart. I know a lot of strong people, but if they're not smart, that's not so good. That's a bad combination. You need smart, you need strong, you need cunning, you need everything. Because we're being killed. Worldwide, we're being killed, and we can't do it anymore. We can't take it. We owed $19 trillion. It's now going up to $20 trillion or $21 trillion with this ridiculous budget. Did you ever see a budget pass so easily before in your life? One of the things that disappoints me, and I'm a Republican, I'm a conservative guy, but when I look at the Republicans, you know where the Democrats are coming from. But the Republicans fold on every point. I thought when we won the Senate and we have the house, I thought it would be different. I think we're doing worse now than we've ever done. We get nothing. We get nothing. So with the oil, you saw it. With Osama bin Laden, in a book that I wrote in the year 2000, I said Osama bin Laden is going to come and do damage to us, and nobody believed it. And then they said, well, what does Trump know? I mean he's a real estate man. He's a successful businessman. He knows nothing about -- I know more than these politicians. These guys don't know anything. So I write a book called The America We Deserve. Probably the only book I've ever had that wasn't a rousing success. By the way, my new book is great, Crippled America. Tough name, right? It's doing great. The worst picture of myself I've ever had up. It's the worst. Because how can you have a smiley face with Crippled America as a title? But I don't want to be a critic. I don't want to just be a critic because what the book is, is it's all the problems and how to fix them because we don't want to just talk about the problems, we want to talk about how to fix the problems, right? We've got to talk about how to fix the problems. So we have a country that when it's run properly and beautifully and democratically and we don't have to sign our little orders that we can't get the Democrats involved, we can't get -- what he's doing with orders -- and we had a great thing with the executive orders the other day. The courts overruled Obama. Do you believe it? Do you believe it? Finally, two to one, a two to one decision. But anyway, so I write a book, The America We Deserve. It was sort of a political book, and it was political for whatever reason. But I talked about the problems of the country and you know what else has changed, except the problems have gotten worse. And one of the things I said is Obama's coming in, and one of the announcers said, no way he said that. Now the reason I said it is because I really watch and I really love studying our country and studying politics and I really love it. I think that what's going to be is I think that, that will be one of our strengths, frankly. I'll be the greatest job-producing president that God ever created. But on leadership, I went huge on everything like 72 to two. I mean we have unbelievable numbers, so high that I say, why do we have to have an election? What do we need an election for? But our leadership on military, on the economy, on all these things, the numbers are -- the only thing I don't get so good is like do you like him? And you know what, I think I'm a nice person, but they say, do you like him? But I think that's probably the least important thing. We want somebody that knows what the hell they're doing now, right? We need somebody that knows what they're doing. So I predicted Osama bin Laden. So one of the guys said on one of the newscasts, no way. They said, yeah. When was it? 2000. That was a year, a year and a half before the World Trade Center came down. No way. Took the book, looked at it. Whoa, look what Trump -- Trump predicted Osama bin Laden was coming in to do damage. I don't believe it. Good guy that said it, straight shooter, couldn't believe it. Well, in my book, I talk about that. In my book, I predicted terrorism because I can feel it. I can feel it like I feel good location, OK? In real estate, my father always used to tell people, you know he may be my son, but everything he touches turns to gold. When my father said that, that was a great comp because he was a tough cookie. But he said -- and he said he has an instinct for location. You have an instinct about things. I really believe I have an instinct for this kind of thing, and I see what's happening. And when I said Osama bin Laden, that was a great thing. When I said terrorism in the same book. Now they really like my books much better when I talk about business and success and things like that. That's -- those are the books that are all the best sell. This book was probably my least selling book, and yet it was, in a certain way, pretty cool. But I love that book, but I loved what the predictions are. And a friend of mine called me up the other day and said, forget about Osama bin Laden. In that book, you predicted terrorism. Nobody knew this kind of terrorism before. But I felt it. And you have to have somebody that has an instinct to lead this country. And I know the people I'm running against, believe me, believe me. First of all, Hillary is the worst. I mean she's terrible. She's terrible. No, no. She's terrible. Hillary is terrible. And you know she was the worst secretary of state in history, and now she wants to be president. Great idea. Great idea. Remember when she was shot down with a helicopter, she got off, bah, bah, bah, bah, bah. So many different lies, so many lies. And frankly, the email scandal, I don't know if that's over. Probably she's being protected by the Democrats, probably. But all I know is that people have been treated very harshly, including General Petraeus, for doing 5% of what she did, 5%. You know he was given a sentence that was an unbelievable come down for a guy that was as good a guy as he was and many others for doing a tiny fraction of what she did. But she's being -- I mean she's being protected. So I believe probably I will get a chance to run against her. I love that. I love it. I love it. And polls already say that I'm going to win against Hillary, but I'll tell you what, I really believe that we will win. We will have such a victory. Do you know if Mitt Romney had people like yourselves that got up and voted, right, he just said it. People don't realize it. I'm going to do great with Hispanic vote better than I think I'm going to win the Hispanic vote. But I will tell you. Had Mitt Romney who didn't do great with the Hispanic vote but had the people like yourselves got up and voted, and for some reason, there was no inspiration, there just wasn't, it was -- I don't know what it was. He didn't get the people up. And I said -- before the whole thing was over, I said, why aren't you -- say what you want about Obama. He was on Jay Leno. He was on Letterman. He was on all these shows. I say, are you guys going to go on like do some shows? No, I think we haven't made. You know they believed what they were saying on some of the things that -- that is an election that should have been won. But remember this, had -- some of -- many of you folks in this room tonight, have you gotten up and voted, he would have won the election. He would have won the election. They didn't -- there was no inspiration. And I'll tell you what, nobody has crowds like I'm getting. These crowds are -- look at this crowd. I mean look at this crowd. Look at this crowd. And I guarantee everyone in this room, who is not going to vote in this room, seriously? Who is going to vote? No, I know. No, we have a whole thing. So let's go a little further into the border, because the border has so much to do. Somebody said it, I was going to mention before, Ann Coulter, she said, Trump just became president. When she saw the problem, and you saw that quote, it was a well-known quote, because when they saw the problem in Paris, that has so much to do with what we're talking about. So we can have a border, we can have the wall. We're going to get rid of people that we have in this country who are here illegally, some of whom are excellent, great people, but they have to come back legally. They have to. They have to come back legally. They have to. There's nothing we could do. We either have a country or we don't. They have to come back legally. And then again, we have some people who are really bad dudes. You know that. We have gangs in Los Angeles. They're all illegal. We have gangs that are 100% illegals. We have problems in Chicago. We have -- don't even mention the drug problems, the drugs that pour across the border, so many other problems, and that causes problems. But we have people that is so bad, they are going to be gone so fast out of this country and they're going back where they came from. And I'll tell you something, I'm not putting them in our prisons, which are brimming now you can't even get -- we're not putting them so that we have to protect them for 45 years. We're bringing them back to the country they came from. Let that country worry about it. Let that country pay for it. We're not going to load up our prisons, our hospitals. We're not going to do it. We're not doing it. This is no longer going to be the stupid country that everyone thinks we are because our leaders are so dead and so pathetic. So we're taking the bad ones, and this is going to be before the wall, before the wall. We're taking the bad ones. They're out of here. They're going back and we're going to get rid of them, and they're not coming back in, folks. They're not -- there's no way they come back in. They're not coming back. And that's going to happen as sure as you're standing there, and that's going to be one of the first things that happen. The first thing is I'm going to take Obama's executive order where he said, everyone, just come on in. Come on in, folks. Come on in. And we're going to end it. We're going to end it. We're not going to have that. The only thing good about an executive order is the new president can come in and terminate it with just a signature. I don't have to go to Congress. I don't have to go anywhere. It'll be terminated in the first 10 minutes of my -- And by the way, prior to entering, I guarantee you this, those four prisoners that we're talking about, prior to my taking office, I guarantee you, those prisoners are home. They're going to be sent off. They're not going to play games. They're not going to play games with us. Those four prisoners are coming home before I ever take office. I guarantee you that. You watch. As sure as you're standing there, they're coming home or there's going to be hell to pay. It's going to be hell to pay. Believe me, there will be hell to pay. So we're going to straighten out our country from the standpoint of immigration. We're going to make great, great trade deals. We're no longer going to be a laughing stock on trade. We're no longer going to let our jobs go out to other countries, which by the way, the immigration cost is a big, big -- you know it's not just what we're talking about, tremendous numbers of jobs lost. And you know our real unemployment rate is at the 5.2%. That was done for political reasons by politicians that want you people to believe they're doing a good job. Our number's probably 25%. We have close to 100 million people. They look for work. They keep looking. They look. When they give up, they're considered statistically as though they're employed. Our real number is between 20 and 25%. And I guarantee you this, if our number were really 5.2, that phony number, every time I see it, it sickens you. 5.2, unemployment is down. The people have given up looking for work. They've given up looking for work. And I guarantee you, I don't know how many people are in this room tonight, but it's a hell of a lot. If it's 5.2, I have 15 people standing in the front row. And they're probably not going to vote for me anyway, those 50. So we're going to straighten it out. We're going to do so many things that are going to be just so, so great. The veterans. I love the veterans. Hey, who in the room is a veteran? Raise your hand. Amazing. So our veterans are, in many cases, not treated as well as the illegals, you know that, right? They have a waitlist. The longest -- three months ago, on a Wednesday, I'll never forget, I'm reading it, the longest waitlist in the history of the Veterans Administration. People are waiting five and six days. Can you imagine yourself -- and some of you probably have this problem. But can you imagine yourself going to a doctor's office and waiting five or six days and you're sick? And people are dying by the tens of thousands. They're dying because they're not getting the care. Our veterans are the greatest people. They're our great people. Our veterans are our greatest people. I love them. I've gotten to know so many over the years. I go to New Hampshire. I go to Iowa. I meet so many veterans. And some of the tales are just terrible. When you hear what they go through, for simple medical care where they can be better quickly, quickly, and they can't get it. One man was telling me, he was in the service for 22 years, fought in wars, everything, did everything, missing an arm. And he said, you know I waited and waited and waited, and after the end of five days, the doctor told me, I'm sorry, I'm going on vacation now. This is what happens though. This is what happens. And we're going to straighten it out. Now I put in a plan, a policy plan. You know the press wants policy. The people just want results, but the press wants policy. I put in a veteran's plan and, among other things, covers a lot of territory and has gotten fantastic reviews. But look, you have doctors, they're leaving the profession because of Obamacare, because they need more accountants and they need nurses. But you have people -- it's true. They need more. I have a friend who's a doctor. He's going to quit. He's not an old guy. I say, why? He said because it's impossible. He said we need so much in accounting. And he said he has more accountants than he has nurses. So we're going to take our veterans. And if they have a wait, which they always do, we're going to let him go to a private doctor or a private hospital or a public hospital. Whatever it is, we're going to pay the bill. And you want to know something? That's going to cost us. Number one, it's going to be great for them. They love it. It's going to be great for them. But you know what else is going to be great, it's going to be great. It's going to cost us a lot less money. So if they're going to wait, they're going to go to a private doctor, the doctor is going to take care of them. We're going to pay the bill, we'll work out some kind of a schedule so we don't get ripped too bad, because doctors do have a tendency to get a little aggressive, right? We will -- don't worry about it, folks. We'll be fair. But they're going to go out and see a doctor, see a public hospital, a private hospital, they're going to get taken care of quickly, beautifully. Nobody is going to be dying, that shouldn't be dying. And everybody loves that plan. How did the vets feel about that? OK? Yeah. No, we've gotten like a tremendous response. All right. So here's the story. What? I like it. I like what you just said. So what happens, what happens is the following. Amnesty. Amnesty is -- forget it. You know who is running, right? You know who's going. You know what's happening, right? Amnesty. No amnesty. They leave the country. In a nutshell, our military's going to be taken care of. Our vets are going to never be happier than they're going to be. We're going to treat them better than any vets anywhere. Our vets are going to be treated fantastically. We're going to win on trade. And you know I always say we don't win anymore. We just don't win. We used to win. We don't win anymore. When was the last time you saw our country win? We don't win anymore. We're going to win so much. I joke sometimes. I say we're going to win so much, you're going to get disgusted and tired and bored. But we never get tired of winning, ever. We're going to win on trade. We're going to win on health care. We're going to win on education. And you know an education -- by the way, we're 28th in the world. Third-world countries are ahead of us. And yet we spend more per student by double than any other country. And yet we're 28. In my campaign, I'm proud to tell you that I've spent less or just about less. I mean a couple of these clowns, how they're even running is like hard to believe, OK? They spend nothing but tacky. I mean this guy, he's got zero, spent no money. One of the worst governors in the history of New York. He's got zero and he's running, and now he wants to try and get on Saturday Night Live because I was on. He wants equal time. So we have guys that shouldn't be under any circumstance they should be out. But think of it, I spent the least money and I have the best result. I'm No. 1. Wouldn't it be great if our country could do the same thing? Think of it. Think of it. Now I'm going to be spending a lot of money because these characters will take out some, you know, ads that will be untrue and they'll take out ads. And I'll just say anybody that hits me gets hit ten times harder, OK? But -- so I'll be spending a lot of money. But think of the results so far. I've spent the least amount of money and I have the best result. So we're going to win on trade. We're going to win on everything, folks. We're going to have a country that you're going to be proud of, just like this crowd, which is so great. We are going to look around today. You're going to look around. You're going to see each other. I'm telling you, this is something special happening. Everywhere I go -- it's not just here. I go to Iowa. I go to New Hampshire. I go to South Carolina. I go to North Carolina. I go to Texas. I was in Virginia. I was in Oklahoma. It's the same thing. The people love the country. They want results. They want to see something great happen. They want to win again. They want to be proud of our country. And I can only tell you this. I have never worked so hard, but I don't care because I love it. I'm staying in. We are going to win this, and we're going to turn our country around. And you're going to be so proud of your country. And you're going to be so proud of your president. You're going to be so proud of your president because I don't care about anything, no special interests, no nothing. The insurance companies, I couldn't care less. I don't even like him. I mean they're making a fortune, by the way, on Obamacare. They were a big supporter of Obama. They are making a fortune on Obamacare. The insurance companies, the car company, I don't care. I don't care. We're going to have our car companies stay here. We're not letting them go to Mexico so easily, where they go and build $2.5 billion plants and they take our jobs and then they sell us cars and there's no tax, no nothing. And we get nothing out of it. You are going to be proud of your country. You're going to be proud of your president. You are going to see something that is going to take place quickly. I'm not talking about years and years and years. We can do things quickly. We'll get it done quickly. The American dream, and you know this, a lot of people have said it. The American dream is dead. But we're going to make it bigger and better and stronger than ever before. And we are going to make America great again. And I love you all. Thank you. I love you. Thank you all."}