{"id":494,"author":"Donald Trump","title":"Speech: Donald Trump in Beaumont, TX","date":"2015-11-14","link":"https://factba.se/transcript/donald-trump-speech-beaumont-tx-november-14-2015","paragraphs":["Unbelievable. All of these happens. If it's OK. I'd like to have a moment of silence for the victims of the Paris attacks. Please. Thank you very much. Terrible, terrible. What's going on is terrible. And when you look at what happened in that case, it was just reported, one from Syria. Our president wants to take in 250,000 from Syria.","I mean, think of it. Two hundred and fifty thousand people and we all have heart. We all want people taken cared of and all of that. But with the problems our country has, to take in 250,00 people, some of whom are going to have problems -- big problems. And when you look at Paris you know the toughest gun laws in the world, Paris.","Nobody had guns but the bad guys. Nobody, nobody had guns. And they were just shooting them one by one. And then they broke in and had a big shootout and ultimately killed the terrorists. And I'll tell you what. You can say what you want. But if they had guns, if our people had guns, if they were allowed to carry, it would have been a much, much different situation.","I hear it all the time. You know you look at certain cities that have the highest violence, the highest, the highest problem with guns and shootings and killings. Chicago is an example, toughest gun laws in the United States. Nothing but problems. So our country better get smart. Because we're not smart right now.","And I don't know if you noticed. But for two years I've been saying, \"Bomb the oil fields. Right?\" Because that's the source of their wealth. That's the source of their wealth. For two years we've been saying it. Bomb the oilfields. And it's such a disgrace. So yesterday they started. Everyone's saying, \"So that's a terrible thing that Trump said.","He's so harsh.\" I always say, Jeb Bush would say, \"My tone, my tone.\" It's unbelievable. The other day I made a speech. The people in Iowa, they loved the speech. They loved it. And I talked about the deficiencies of some of the candidates and the newspapers say, \"Oh it was ranting, raving.\" I don't rant and rave.","He was so horrible in terms of what he said about. I said the truth. I didn't say anything. In one case I said what that particular person wrote about himself. It's true. That's true. And they said he was so harsh. It was a terrible thing he said. I said what he wrote about himself. It's incredible how dishonest the press is. It's incredible.","It's incredible. It's absolutely incredible. And I wanted to you know we to be talking about the wall because we're going to build a wall. It's going to be a big wall and it's gonna look beautiful because someday they'll probably end up naming it the Trump Wall. It's got to look beautiful. And people will come through the openings in that wall and we'll have a few of them and they'll come in and they're going to come in legally and to our country and that's what we want and people that are here illegally are going to have to go and you know what?","Someday they'll come back and they'll come back through the legal process and that's what we all want. And I just want to say because I'm going to bring some very, very special people on stage. But I just want to say that. When I announced that I was going to run for president. I made some statements that were very strong but very true.","Very true. I talked about illegal immigration. And I took a lot of heat that first two weeks and then people found out I was right. And I will tell you it's become a very big subject in this country. It's costing us $250 billion a year. Nobody knows it. Nobody talks about that. We'll talk about China. We'll talk about trade.","We'll talk about a lot of things later but it's costing us at least $250 billion dollars a year. Tremendous problems, tremendous crime. Tremendous crime. And nobody disputes it. When I said it they all said, \"Oh this is terrible.\" Tremendous crime. And you know what. We're going to straighten it out and we're going to have a country again.","We're going to have a country again and we're going to have borders because without borders, you don't have a country. We don't have a country. We have border patrols that are great people. I met them. I was in Laredo, Texas. And I met the Border Patrol people. They're fantastic people. They want to do their job.","They're told to stand down. They use that expression with me, \"Stand down and we want you not to do.\" and these people are walking right through. And they're standing down there holding their weapons. They're holding everything. They're amazing men and women. Stand down, people walk right into the country.","And you know in other countries, you can't do that. By the way in Mexico, and I love Mexico. It's a great place. They have strong leaders and smart leaders. They have smart people. If you want to become a citizen of Mexico, it's the hardest country in the world just about to become a citizen. But over here, \"Come on in folks, we're a bunch of dopes.","Come on in. Come on. Come on in.\" You know the whole thing about the anchor babies. You have a woman. She's pregnant, walks into the United States, has the baby. We take care of the baby for the next 85 years. So, not going to happen. And I was right about it. Fourteenth amendment doesn't say that. You walk in illegally.","You have a baby. The baby doesn't stay. And they said all you did a whole new constitutional amendment would take years and years and could never be gone. You don't need that. You know that I turned out to be right. The great legal scholars have said he's right. So you don't need it. But before we go further I just met these people backstage and they've been very nice to me because I've been very nice to them because I've been saying what's been going on and there are many others that I've met.","This is a few, the Remembrance Project. Where people's loved ones were killed by illegal immigrants. People that were violently killed. One of the men I became sort of a friend of his, Jamil. He had a son, young football player. Good. Who is applying to Stanford, he was a quarterback. Great kid, never had a problem in his life.","A great young man and he went to the deli. And he came back home and he was violently shot in the head many times and his father heard the shots outside. What are the saddest stories and he told the story, \"I was talking to my boy. And my boy said I'll be home in five minutes, Papa, I've got you a sandwich from the deli.\" And he's walking home and the father, Jamil Shaw.","The father heard shots right outside. And it was a guy shooting his son in the head. And then his son laying on the ground is like this. And he shot him through the hand with 45 which obliterated his hands, everything killed instantly. And the father laid down on the sidewalk couldn't believe what happened.","Couldn't believe it, he said, \"This couldn't happen.\" And he's just a great guy and he's not here today but other people are. And I'd just like to bring them the Remembrance Project. These are amazing people. Come on upstage folks. These are amazing people and no matter where I go I meet people that have lost a son or daughter a brother sister mothers and so many.","Recently in California, we had a veteran, a 66-year-old veteran. But we can't have this anymore. We just can't have a country like this where it's being run like the way it's being run. So come on over. Say about your boy and say about your boy and what happened.","I just realized as I was listening that is in Venezuela, OK I'm going to do just fine with Venezuela. Believe me. If I win, If I win. We will get him out fast.","You don't see that. You don't read about it in the papers. You don't read about it. You don't see it. It's just unbelievable. And I see it all the time wherever I go because I'm the only one that talks about it. It's like devastates, so hard to watch. It's devastating and you can imagine for no reason and there's so many more.","I mean I have met so many families become friends with some of them. And you just say how can it happen. The sanctuary city stuff is just unbelievable. It's unbelievable. It's unbelievable that we can allow it to happen in this country is unbelievable. You look at San Francisco with Kate same thing shot in the back.","And five times they threw this guy out of Mexico in my opinion they threw him out of Mexico. They don't want him in Mexico. They say, \"Hey, the U.S. doesn't know what it's doing. We'll send them over there.\" So the fifth -- So the fifth that well or do something very strong to him in this case because you know Kate's law.","Kate's law is a good thing they can't even get it passed. They probably won't get it passed. And it's, it's a tough thing. I see so much of it. I see so much of it because wherever I go, I want to meet the people and they're devastated. Their lives are ruined. I mean hopefully not but you see I mean it's a very -- it would be easier to say, \"Oh it's gonna be fine with time.\" It's not.","One of the parents said to me it was 10 years and one of the parents said to me it's worse now than it was 10 years ago. So you know the time thing that we all say we always like to say I don't think it really works but it's something that we're going to do something about that if I win believe me we're going to do something about it. We're going to do something about it. All right.","Let's talk about a little more pleasant situation because we have so much negative news you know wrote the new book, right? Crippled America. And I picked the worst possible picture of myself. It was terrible. But what are you going to say? it's Crippled America and it is. We have a president who just came out.","You know what he said? You made a little save and I want to say it exactly as he said it because you know what? I have such a good memory. I don't need it. But he said, \"We have ISIL.\" You ever noticed he always says ISIL. I've always said ISIS. I don't know, I like it. I don't know what but he always says ISIL.","I think he does that to maybe who knows, maybe why does he do that? He's one of the few. I say ISIS everyone seems to say ISIS. He says ISIL. But he said we have ISIL contained. Now this was yesterday a few hours before the attack. Where you had plenty of Americans involved in that too in terms of being involved on the injury side and worse than that.","But we have ISIL contained. We have leadership that doesn't know what they're doing folks. We have leadership that doesn't know what they're doing. And we have to change we have to go back. We have to go back to where we used to be years ago when we were strong and powerful and people respected us. And when you had a sergeant Bergdahl who is a traitor.","He was shot for being a traitor. He's gonna get nothing. And we trade Sergeant Bergdahl for five of the biggest killers that they want right now back on the battlefields. They're back on the battlefields. We have to go back. You have to go back in time and a little bit you know somebody would say, \"Oh you're going in the wrong direction.\" And one of the folks mentioned the words politically correct.","It's true, it's true. You know that. In terms of Remembrance fund, when I was with a group about two months ago, when they heard that one of their sons was shot and killed instantaneously the police who I love, the police are the greatest. I'm with the police so much. Their power, their power has been taken away.","And that's why you have the problems in so many of the inner city since so many of the others but they can stop it. But their power has been so taken away. They don't wanna lose their jobs. They're afraid they couldn't even talk to people anymore. Can't even talk to people but I was with them and, and they said to me everybody was so great.","They were helping me, helping me, helping me and when they found out it was an illegal immigrant everything stopped. They didn't want to get involved in solving the crime. Once they found out who it was. And they couldn't. And to this day they can't get people involved in it. In other words it's different if you shot somebody.","Review shots, they go. I mean they give you that stuff. But they found out it was an illegal immigrant. And the men and I then did research and it's so tough. The system is so tough and so against law enforcement that when they find out situations like the people that just came up when they find out about it they don't pursue that like they would in a regular situation with an American citizen doing the shooting or doing the killing.","And nobody knows why. I think I know why. I think probably because the process is so horrendous that they can't maybe they're afraid to get involved because they want to keep their jobs. Who knows. But it's -- it's very, very sad. So we're doing really well amazingly well. The Reuters poll yesterday came out.","You saw that. That was great. Trump at 34%, Gray Carson at 19%, Rubio at 9% and Cruz at 7%. He's been very nice to me by the way, Ted Cruz. He has been. In Florida, Trump 37%. How good is that? I mean, think of that. Rubio, 16%. He's the sitting senator so I'm at 37. He's at 16. That's pretty good. That's pretty good.","That one just came out. Here's what you're going to like the best. Trump is leading in Texas. Does that sound good? That's right. You know what I also like in one of the national polls? Best in foreign policy. They have me down in foreign policy as best. OK, so I wrote a book, The America We Deserve. And the book it was -- it came out in 2000. I talk about a terrorist named Osama bin Laden.","Now this is before the World Trade Center came down by a couple of years. Somebody said like 18 months. But I talk about Osama bin Laden in the book. And one of the big moderators on one of the morning shows heard about this and said, \"Let me see that book. What was it written 2000?\" Well, we read. Trump was talking about Osama bin Laden in 2000. That was before the World Trade Center came down.","He took it down. It was his people. Wow. And the guy goes, \"Wow that's amazing.\" I'm really pretty good at this stuff. I'm telling you. I'm telling you. You know another thing just happened and that's the oil. You know the way I've been saying, \"Go after the oil! Go after the oil!\" Everywhere say, \"You can't do that.","You're going to hurt the infrastructure of the oil.\" Hey, we're in Texas. I've seen what those companies at your companies can do in about 12 minutes. They'll rebuild that infrastructure so fast with you folks building it. It's incredible, so fast they'll build it so fast and so good just bombed the hell out of it and so everyone said, everyone said no. 'Cause you know.","I was seeing where they get most of their money, ISIS. They get most of their money from oil. Some in Iraq, some in Syria. So there's, \"No ,you can't bomb Iraq, that's a sovereign nation.\" Do me a favor. Bomb 'em and supplement. South sovereign nation. You know what that is. Sovereign nation, sovereign crooked nation.","They were supposed to take everyone in. They didn't take everyone in. They wanted to run it all by themselves. That's what happened. That's how ISIS formed. OK. That's what happened. And ISIS turned out to be a lot tougher than they are. So they have oil. And that's where they get most of their money. They also get it from banking sources.","And boy, am I good at banking. I would come down on those sources. Oh there's never been a presidential candidate that knows banking like Trump. Believe me. Believe me. They got a lot of money from banking. A lot of money through different channels of banking. And you can say, believe me that problem can be solved quickly.","But I said bomb the oil take away. And for two years how long I've been saying it. For two years it's almost like I stopped saying it because everyone would say to me, \"Oh you can't do that.\" \"You can't do that.\" Why? They didn't know why but they just said you can't do it. So yesterday, they started bombing the hell out of the oil.","And I said to myself. I wonder if I'm going to get any credit for that. And actually, actually a number of people called Jake Tapper, was one from CNN sort of saying, \"Wow! they did what you said they should do.\" And I had three or four big anchors call and said, \"Wow!\" I said, \"Tell me. Are you going to say it on the air or are you just saying it to me?\" You know they say it to me because they get good ratings.","They want me to go in their shows. So I said, \"Say it on the air. Don't tell me.\" So they're doing but I actually took it a step further. If you remember, I said, \"Take the oil.\" \"Don't take the oil.\" \"Take it!\" And I said take the oil. So much money. Take the oil, don't leave. We should have never gone to Iraq.","I said that right from the beginning. It's all called vision. You know people say Trump is a very tough tone. He has a very tough temper. We need a tough temperament now folks. We need -- we don't need a pathological temperament. We need a tough temperament. We have to have it. But I'll tell you we need a tough temperament.","But if you remember in 2003, 2004 I said, \"You're doing a mistake with Iraq.\" There'll be nobody tougher with military than they believe me. Nobody up on that stage. Nobody. And Hillary Clinton is a total disaster by the way. She's a disaster. She is a disaster. But you have to know when to use your military.","So just like I wrote about Osama bin Laden and these. All these people are saying I can't believe it, Trump's right. And you know the reason I wrote about it because there's so much talk about him as a bad guy. You know and people were writing about him and he said he's coming into the United States. He's going to do some real bad damage.","That's what he said. So I said, \"Knock the hell out him before he comes in.\" Then he came in. He knocked down the World Trade Center. They could have done a job on that but they didn't. But you have to know. I don't even know if he's a friendly guy or not probably. But you know what. I'll tell you. So you have to know what to do. You have to know when to do it. It's usually friendly.","The friendly ones I'd like to be nice. To the unfriendly ones, we have to be a little bit tough. So you have to know when to use it. You have to know when and the cheapest thing we can do is to build up our military and make it strong again because we'll never have to use it. We'll never have to use it. Right now we're depleted.","We're depleted. We've been fighting politically-correct wars. Everything is politically correct. We don't want to do this. We don't want to do that. How about this? We have to be unpredictable, right? And I say that all the time. Somebody said the other day and one of those vibrionic, \"Trump's unpredictable.\" That's a great compliment.","You know, I tell the story. Recently there was a story about me in a business deal and I won I really beat the hell out of these people which was fine. They weren't very nice but they interviewed the people a while ago. And they said, \"What do you think of Donald Trump?\" They say, \"He's so totally unpredictable.\" And I beat them because of unpredictability.","Now I know sometimes you want to be unpredictable for your own reasons and you it's purposely unpredictable not like you don't know what you're doing. But you got to be a little bit unpredictable in life and they said he beat us because we couldn't figure him out. He's a good poker player. We couldn't figure him out.","So here's the problem. President Obama announces last week, \"We are going to send 50 troops, our finest into Syria and into Iraq.\" We are going to send them to leave tomorrow or around 8,15. They'll be arriving. They'll be landing at a certain airport. In about 14 hours. And they should be getting off the plane.","So if you want to set up your military and your everything to try.\" They have a target on their heads. These 50 people have a target on their heads. So now all over Syria and Iraq they're looking for these 50 guys. These are the top, top, top guys. These are the top people that we have. Why does he have to say that.","First of all it sounds bad to say 50 because 50 sounds like, 50? So he didn't even get good publicity. It's sort of like either you do it you don't do it. Right. But -- but these are 50 of our absolute finest. Why does he have to say that we're sending them. Why couldn't he just send them. And they go there quietly and they do their job and there aren't people looking because nobody knows they're there.","He is so bad he is so damn bad. It's like -- we shouldn't have been in Iraq. And I should get points for vision because I'm the only one on the stage. Now I'm not a politician. Thank goodness. Although now I am. But I said don't be there. That was a long time. Reuters long time ago they sent the delegation to the White House because I was getting so much publicity on it to try and convince me. I said, \"But you know the problem is you're going to destabilize the Middle East.","You have Iran and Iraq that are the same in terms of strength. And they fight all the time. These people fight. That's what they want to do. They want to fight.\" What the hell are we doing? They fight. Iran goes this way. Four years later, Iraq pushed them this way. Ping! pong! back, forth for decades! I said if you knock out one of those elements including Iran.","But if you lock out one of those elements the other one's going to just take over. What are you doing? They're not poker players. They're not chess players. They're not anything, honestly. They're politicians that don't know what they're doing. That's what they are. So I said, \"Don't go in.\" and I was right about it. They said weapons of mass destruction that didn't exist and Saddam Hussein talked about weapons of mass destruction and he boasted.","You know why? Because he wanted to scare Iran. I made sense. He didn't want to say. So I couldn't understand because he overplayed his cards, right? They end up finding him in a pipe. He came a long way from the castles to a pipe with dirt all over his face. And he's a bad guy. But you know they end up and I figured out why he's always fighting with Iran.","And he wanted Iran to think that he had weapons of mass destruction so they would be scared and they wouldn't go all the way etc., etc. Makes sense. So he couldn't. That's why he overplayed his hand. He couldn't not say that. And then we ended up making a big mistake and we've totally destroyed the middle east and then come Barack Obama and Hillary.","And what happened there is now we're in. And he announces another time just like he did with a 50. He announces when we're leaving. We're going to leave. He got creamed all over the place just creamed. I mean they beat him all the time. You know we don't win wars and we don't win anything anymore what do we win wars anymore?","Remember, I remember when I was young we never lost a war. Right. So we lose every time. We can't beat ISIS. We can't beat anybody. We can't make. I will. Believe me. Believe me. And it'll be fast. They won't be long it'll be fast because I want to get around to rebuilding our country. Believe me. I will.","So, so you look at what happens with Obama. He announces that this is the same thing as with the 50 men. Fifty men will be going in. There is the same thing we will be leaving Iraq on October 31st at 3,30 in the afternoon. So what happens is the enemy says, \"Oh wow, they're leaving. They're leaving. That's great.","Let's pull back. What the hell do we have to get checked?\" You know you read about all the stories that they want to get killed. They don't want to get killed. They don't want to get killed. They don't want to get killed and their families. They don't want their families killed, folks. Remember that they don't want their families gone but they don't want to get killed.","So they pull back. Obama leaves. Now we've spent in Iraq $2 trillion dollars, thousands of lives wounded warriors all over the place who I love. And we're going to take care of because they're not being taken cared of. So Obama made a mistake. So he's totally predictable. He's totally predictable. We're going to -- we're going to send the 50. We're going to take him out here.","Now if he would have said, \"We'd never taken 'em out. We're going to build up. We're going to.\" Even if he didn't do it. And I know the press is going to say, \"Well Mr. Trump would tell a Fib. He would tell a Fib.\" I won't tell a Fib. Why would they ever say that we're taking the people out when they took him out.","So now the enemy would say if it were me I would say we're not going anywhere those you're going to suffer for the rest of your lives and your children your grandchild everybody. And they're going to say, \"Oh man this guy's freaking crazy. We give up. We give up. Oh, We give up.\" So Obama told the one we're leaving left and then they go in and it's a mess now.","And as sure as you're standing there you know you know the fact I mean you see the same papers and same stories that I'm saying. But Iran is taking over Iraq. ISIS is taking much of the oil which finally we're bombing, OK. We should have kept it but finally we're bombing, we really did have because mine was to keep -- mine was to bomb it and keep it. OK. Now we're bombing it and somebody else is going to get it. All right.","So sad, so pathetic. And you know what I wanted to do with the proceeds of that oil. I wanted to give a lot of it to the families that suffered and lost lives that lost their sons and daughters in Iraq. I wanted to give a lot of it. And by the way, if you gave each family a million or $2 million dollars, that's peanuts.","You'd have so much money left over. Give them more than that. But you could give them a lot of money. Because they suffered and what do we have for it? What do we have for it? So I was going to give and this was another thing people said, \"Oh you can't do that!\" Of course you can. You can do anything. You can do whatever you wanted to. You can do anything.","You could do anything. And I wanted to give that money. A lot of it to the families that lost sons and daughters and to the wounded warriors who don't have arms and legs and they're braver than all of us put together. I wanted to do it. So anyway, so just to finish off so the polls. So they said best in the military and foreign policy.","That's always a great honor for me because a lot of people think that I'll be the best in jobs by far. I will be the greatest that God ever created. Believe me I'll be good. And they have me best in the economy not like by one point by like 50 points. Like I on one of my think I was at 72 and number two was at nine.","That's a big difference. And they had me by far, by far best in leadership so I said look if I'm best on military and foreign policy if I'm best in leadership if I'm best on the economy what are we having an election for? Let's go. Right? You know a couple of things about the campaign. The one thing they did say I'm not as nice a person as some of the other people.","And I told a woman and I actually am a nice person but I told a woman who said that she said to me, \"Mr. Trump, I'm voting for you. I love you but are you nice enough to be president?\" I said, \"Let me tell you something, ma'am. I'm glad you voted for me but I am a nice person. Believe it or not I'm a nice person and I have a lot of good relationships.\" But I will tell you especially with the people I know.","We have a good relationship. But I will tell you this. I really believe it doesn't matter because I think this is going to be an election based on competence. We need somebody competent. Really. And I'm really competent. And we need people that are like Carl Icahn and he's a great businessman. He's worth a fortune, is a great negotiator, one of the great negotiators.","Other people are endorsing me being the biggest businessman. Some of them endorsed we don't even like me but they know I'm really smart. I do what I do. I built this incredible company. Remember when I filed the papers everyone said, \"Oh he'll never run because maybe his company is not as big.\" What turned out to be much bigger much better much right.","They can't believe it. You never heard anything about it since they filed. They were down there hundreds of them looking over the papers Oh my God he's really much bigger than we ever thought. He built an unbelievable company. They were down there. They say more people were down looking at those papers almost 100 pages of financials an incredible company, very low debt, tremendous cash flow.","The press was devastated, right fellas? Were you devastated? They were down. They were devastated. And I tell you that not to brag about my company because it's a private company. Nobody knows what I have. It's a private company. It's beautiful. That was really a big opening for me. I mean for me to run for president.","It's not an easy thing. All my life I've heard of your a very successful person. You can't run for president. I understand what it means because they make you. They lie. And they cheat. And they're dishonest. You know many of them. Many of them. I had a story recently. Where I went up in the polls I'm leading by a lot.","And the story was, When Will Trump Leave the Race? Like one of the commentators in the morning. Good guy Joe Scarborough. He always jokes. Well Trump going up in the polls that means I guess he's leaving the race. He's leaving. Let me tell you I'm not leaving folks. Ever. I'm not leaving. I'm not leaving we're going to win.","We're going to win. I think we're going to win. But you know these pundits who are worthless. You know George Will, the guys. I mean these guys, they're worthless. They said, \"He will never run, a lot of -- he's got the personality of that piece of concrete. Hey guys. He will not run. He will not run.\" Then I announce him running.","He will not file his paper. He will not file forme. Forme is the first filing where you sign your life away. Then I file for me. He goes, Oh well, he will not file his financials. And if he does they will never be filed on time because he's probably not as rich as people think.\" So I was one of the only ones that filed ahead of schedule.","In fact I have to be honest my financials are so good. That I hadn't really decided on running because it does take guts I have to be honest. Not that kind of guts those people had who I just brought up here not the kind of guts the wounded warriors have and the vets have. I tell you what. I don't have that guts.","Those are real guts. But it takes guts to run. It takes guts to run. But then he said he will file. So they turned out to be good. The only reason I talk about how good my company is because that's the kind of mentality we need running the country. That's it. That's the only reason. And I was actually, you know they're all saying, \"He'll never file au financials because who knows?\" They had no idea.","I was going to file them even if I didn't run. I was seriously thinking about not running too. Do you know? Did you know the famous scene of my coming down the escalator with my wife Melania? Who looked very beautiful coming down the escalator? We have this. You will have one beautiful first lady that I could tell you that and she's got a great heart and she is really smart.","But she's got a great heart but she's coming down and she's a very calm person and she's waving beautifully like this. Remember very famous scene as they played all the time coming down the escalator. I think they play it because she's in the picture not because I'm waving and she's just going like this but if you remember that famous saying well just before then.","I said I wonder if I'm going to do this. I mean I'm standing up top. The press is all over the place. The place was surrounded. They will tell you I've never seen it. It was like the Academy Awards. And I did this, I said. Because I tell you, I went, \"Let's go.\" I took a deep breath. I came down on the escalator and here we are.","Who would have known this was going to happen? Who would have known this was going to happen? You know. This guy that you know and a lot of things have happened since and a lot of great things have happened since because you know I had no idea that I do, as well as we've done thus far. Now the big thing these same characters that you know that said I wasn't going to run.","Now they're saying, \"Well, it's only a question of time before he gets out.\" Why? Why would I get out? I was interviewed by Chuck Todd of Meet the Press. He's a nice guy and he asked me the question. I was I just came out where I was leading substantially and he said, \"Well you get out of the race?\" And I said to myself.","Has that question ever been asked to a person that just took the lead? You know it's such a negative question, isn't it? And I made a mistake. I ran a pulse and people didn't want to see me anymore. So you'd have 100 people show up when you used to have 1,000 or 2,000 or 5,000 like today. Or you wouldn't do well.","Yeah I mean I'm not a masochist. I think probably I'd. I'd go out. And that was a killer answer. You know why next day, \"Trump may leave the race.\" No it was not right. Trump. I said I don't believe it. I don't believe it. And I remember Rand Paul who's like one. No, no. They asked him the question, \"Are you gonna leave the race?\" Now you're always going to leave the race.","And I have to leave the race. But they ask and I'm not knocking it. But it's political speak versus somebody that was never a politician before. I'm giving all the reasons for which I believe. But I'm doing better than I've ever done. And the question shouldn't have been asked but I give all the reasons.","And actually my wife said, \"That was a really nice answer, was such an honest answer.\" I said good things. I got killed. OK so what happened? They asked Rand Paul. He's at one or two. He's leaving Fox. He's leaving. He's got to leave. Otherwise he's not going to be senator from Kentucky. So they said, \"Will you consider leaving the race?\" Absolutely not.","I will not leave the race. There was no story. They asked a couple of other guys there at zero. Are you going to leave the race. No you know it's. There is zero and they have no money. Other than that they're doing very well. Right now they're at zero. I saw it the other day they asked Lindsey Graham. He's in two in South Carolina.","I'm at 38. He's a sitting senator. No. Think of it. They said. Senator Graham are you going to leave the race? Absolutely not. I will not leave the race. And I said that's a politician. I'm not blaming Graham. I'm not blaming Rand Paul. But there was no story. I gave an honest answer and I end up. I will not, ever leave this race.","Ever! I'm not leaving. And you know what. And I'm still number one by a lot. So that's the reason I'm not leaving. So anyway, it's just a couple of things I'm going to talk to you about a few things and I know it's a crazy day and with the tragedy yesterday that was some horrible thing. I mean people see that and they just it's -- it's so terrible to watch.","But I love this group of people. I love this area. I know this area I have friends here. These are amazing. These are the people you built the country folks you built the country. You've done an amazing job. But just so you know because this has been a lot of talk lately about stances on different things.","Without me there wouldn't be any talk of walls there wouldn't be any talk of immigration illegal immigration. Those folks would not have a voice at all they've been treated horribly they've been treated so badly probably worse than anybody. I mean you see that. And because of me and I'm very proud of it. Immigration is one of the top couple of subjects maybe the top in a lot of people's minds it's a top subject.","And when you get to Texas it's got to be a real subject because you're the ones that are really -- I mean I had such a crowd in Phoenix Arizona. They get the brunt of it. You get the brunt of it. Some people don't know it as much. But when you got in New Hampshire you know they have a tremendous heroin problem and a tremendous beyond what anything that you can believe.","And it comes over the border. So they're all of the everybody is affected. When you look at the gangs in Los Angeles a lot of those gangs are illegal immigrant visa tough dudes. By the way they will be out of there so fast. They won't be out of there so fast. They'll be out before I start the wall. I'll be starting out the wall fast.","By the way they will be out of there so fast. We have some of these tough gangs and they're all illegal immigrants. And those guys are gone and we're not going to put him in our jails. I know a lot of people say we're going to put him back we're bringing it back to the country they came from. Let them use their jails.","OK Let them use their jails. Our jails are brimming right now with people that shouldn't be in our prison system. They'll be in there for years and years and years and we'll be paying for. Not going to happen, folks. We're bringing them back where they came and went. And when a specific country sends them over to the United States because we have among the dumbest people in the world leading us and we accept their people.","OK. When they send them they're not coming through. Not with me. They're not coming through. They're not coming through. So, in 1954, General Eisenhower you've been reading about this. Nobody even knew about it until I brought it up. Is that a beard? What a handsome beard. Look at the beard on that guy. I do that but I probably couldn't get voted.","I don't know. But it looks good. But in 1954, General Eisenhower -- I like Ike. Everybody liked Ike even though he was a general. Everybody liked him but General MacArthur you know why because General MacArthur was a very special guy. Tough. A genius. The highest marks in the history of West Point General Douglas MacArthur.","Good right. And General MacArthur couldn't stand taking orders from anybody because he felt he was superior to everybody. And Ike was a less than average student at West Point and MacArthur couldn't understand it. You know to this day General Douglas MacArthur had the highest marks in the history of West Point.","Pretty good. You know I'm into the academic thing to be honest. It means something, right? And he couldn't stand it. But we have MacArthur's and we have we have General George Patton. Great. By the way, what do you think General Patton would do as he's listening to. Barack Obama say we are sending tomorrow morning at 9 o'clock, 50 people.","He would be. He's right now spinning in his grave and so is McCarty. But Eisenhower was a nice man. I like Ike. That was the slogan like mine is make America great again. Make America great again. How good is that? Is that good? Do I hit it? That hit it on the head. You know I've had guys try and copy some of the people running against me use that expression.","But I had legal rights to it. Do you believe how good -- how good am I at this time? So we put them on notice. They weren't allowed to use that. Make America great again. The plane was landing before and the pilot saying, \"Coming in, coming in. OK. You're cleared to land. Make America Great Again. This is from the control tower.\" and my pilot said, \"Mr. Trump heard that, I wanted to kiss those people.\" Make America Great Again.","But Ike was a little different. Ike was -- I like Ike because he was a lovable guy. He was a nice guy. But despite being a nice guy they had a problem with illegal immigrants. No definite changes, had a problem. So they moved out one and a half million illegal immigrants, right? They moved him out having a tremendous from which jobs, you know jobs is a big thing.","They're taking jobs from people that want to. We have 100 million people. A lot of those people want to work. This 5.2% unemployment is nonsense that was written and designed for politicians so they look good. We probably have a 25%. We probably have 25% unemployment. OK. If you look at the real numbers or I wouldn't be getting the crowds I'm getting or I wouldn't be getting the responses or the polling numbers.","We probably have 25% on the plug. So I like Ike, so Ike said a smart task force and they moved a lot of people and they took them. And they moved them right across the border and they came immediately back. And then they moved them again. And they came back. They say this isn't working. They keep coming back.","Then they move them all the way south and they never came back. You know. Now it's rough stuff. Today it's harder to do things like that. But they didn't even think about it. They said no they're here illegally. See those days. They are here illegally, illegally! Not legally, illegally! Everyone says to me Bill O'Reilly the other night.","He's a great guy but he said to me, had a little argument with me. He said the court system will take you a long time. I said you don't stand Bill they're here illegally. No, no. But the courts. So if somebody walks over the line. They bring them immediately back ,right? Now in our case we don't. But you could.","They won't go over the line you bring him back. OK. So they bring him right back. So they walk over the line a year ago. You bring them back. There's no difference if it was three years ago. They're here illegally. They're here illegally. And everybody said on the anchor baby I was wrong. They said if you have a baby here and I discussed it. And then I turned out to be right.","It's the same thing. The anchor baby you can't have a baby here if you're here illegally have a baby. Now you can have some court cases but believe me I will if I'm president. I guarantee you. I went on the anchor baby and I went on this too. Because no, I don't want to go through a court system every time you want to bring an illegal person.","I don't want to go. I know more about courts than any human being on Earth. OK. And I don't want to go through a court system with the lawyers and the problem. But they're here illegally. We're bringing them out. That's all. That's all. Now let me tell you what happened with Eisenhower because he gets mixed reviews.","Now they say I was very harsh. I'm sure I was in some cases. But let me tell you. When they started and this was serious. This wasn't like we're playing games like today where everything was so politically correct. You know everyone, \"Oh gee, well we can't do that let's start.\" This was serious stuff. They moved.","And by the way Harry Truman moved. They say millions of people out. Millions. Harry Truman before Ike. Moved millions of people. Nobody talks about this. They say what a bad guy I am. How it doesn't work. It does work. It does work. And I want them to come back by the way, just so you know. I want to make it clear.","I want them to come back. But I want them to come back legally and if we need workers for the grapes and I'll say this. Because a lot of people say the grapes. the grapes. and I don't think any of you guys are going to be picking grapes, OK? I really don't think so. You want to be picking the pockets of Wall Street but not grapes.","But if we -- need some people we can bring people in on work -- Get caught or whatever. You know what happened? They move themselves. They move themselves. They said \"Oh, wait!\" They're going to us next week. They gonna come to us in a month.\" They all move up millions of people left. Millions of illegals left.","They left of their own volition, not that stupid Romney stuff. It was self-deportation. I mean how they're going to self-deport? Oh yeah right. Vegas. Then you wonder why he lost. Right folks? But this is something were many of them once the system started and once they saw there was no games. They moved him out.","Now today we have things like e-verify. Where the employer will say I'm sorry I can't do it. I use now e-verify in most of my jobs. I have thousands and thousands of employees. I've hired tens of thousands of employees. Many Hispanic over the years. Many, many -- they're fantastic. Many from Mexico. Today many, many employees from Mexico.","They're great. But I have. And I think to me it's very important -- e-verify. So now I find out if they are they legal or not. If they can't get a job they're moving out. They're going to move out. Nobody has to -- you don't need soldiers. They're going to move out. It's so simple but a politician doesn't know this.","A politician doesn't know it. They're all talk and no action. All they know how to do is get re-elected. That's all they know how to do. When you see the remembrance folks and when you see all the problems. We're not going to have that kind of problem. We're going to have a lot of winning. We're going to be doing a lot of winning.","I'm telling you. We're going to win everything we started. We're going to win because I win, my whole life. That's why it always bothers me when they say, \"Trump's had a great time. And he's done really well. But he doesn't really want to be president.\" You think he really wants to be? No I'm doing this for my health.","OK. I came to Texas at 12 o'clock in the afternoon because I want to. I want to do this. I want the end result. Somebody said, \"Well, why are you doing it?\" And I said, \"Because I honestly believe that the American dream is dead. But I'm going to make it bigger and better and stronger than ever before.\" I really believe that.","I really believe. I really believe. So if you look at Rubio. He was a member of the Gang of Eight. And Rubio wants amnesty. Give everybody amnesty. This just so you understand. Just so you understand. These are lightweights. These are not people that can take us to the promised land. These are not people.","They're nice people. I like them very much. I stood with them the other day. Excellent person. You know, who cares? But he was a member of the Gang of Eight. The Gang of Eight. You know that was. That was a group that just wanted people to flow in. OK. Member of the Gang of Eight. And when his poll numbers went down, he all of a sudden became an unmember of the Gang of Eight.","He's not what we need. So Rubio is weak, weak on illegal immigration, weak on the amnesty, wants everybody to have amnesty. Can't do it. Carson, very, very weak on immigration. Very ,very, very weak whatever that is. He wants worse. He wants a path to citizenship for people that came into the country. Think of it. They come in illegally now they become citizens.","One of the problems with that is we have right now, we have right now. Millions of people wanting to come into the country and they've done it through legal channels. They've done it right through legal channels and we've got to be fair to those people also. So just in a nutshell on immigration because I know how important it is for Texas.","We're gonna have a wall. It's going to be a great wall. It's not going to be a wall that people can walk , over climb up. This is going to be a serious wall and it's gonna be built at the right course. Mexico is going to pay for the wall. Believe me, they're going to pay for it. They're going to pay for it. We're going to get the bad ones out really fast.","I mean, so fast and the rest is going to have to happen. And everyone's going to be happy in the end. People are going to be happy. We're gonna have jobs. We're going to do a great job. We're going to be fair and we're gonna do it with a very, very big heart. It's going to be done humanely. Remember that.","It's going to be done humanely. So just to finish off, I want to just because I wanted to really harp on that a little bit the immigration because it's so important and such a big factor and it's become such a big factor in the race. I'm proud of it. But, we are going to negotiate great deals. I mentioned Carl Icahn before.","I'm going to use the smart ass. We have the smartest people. We have the best people. We have the best minds with the best business minds. We don't use them. We use political hacks. We use people that put money into a super PAC and they end up getting jobs because they gave a couple of bucks to the super PAC.","And the super PACs, by the way, I don't have super PACs. I turned -- I said -- I don't want any super. Super PACs are controlling your senators. They are controlling every candidate. They'll only do what's right for those people that gave them money. The donors, the special interest, those are the only people believe me. They control the politicians.","Nobody is giving me any money other than the small donors where frankly, if people send in $25 or $50, I have to take the money because. it's not that -- it's a lot of money. If you send that money back, it's so -- and so how do you send it back? We don't want your money. So I take small donations -- small and I say that's fine because that's like an investment in the country.","But it's peanuts. But. so I don't take any more. I'm putting my own money. I'm funding my own campaign. I'm spending a fortune and I am spending but so far I haven't spent that much. So far, listen to this one. There's a stat that some people like and some people say maybe it doesn't sound good but I like it. The business people like it. So far I've spent less money than anybody else and I've had the best result of anybody else.","Right. Ain't that beautiful? Ain't that beautiful? Less money and the best result. And that's what I like and that's -- wouldn't it be nice if we could do that with a country. We spent less money and we have -- In education, we spend more money than any other country by double and triple per pupil. And yet we're rated number 28 in the world.","We have nations that you wouldn't believe ahead of us. We have nations that you wouldn't believe. So we're going to win on trade. We're going to take our jobs back. We're going to bring jobs into the country. We're going to beat China. We're going to beat Japan. We're going to do great with Mexico. We're going to do wonderfully with that horrible Iran pack.","I love to renegotiate deals. OK. But we're going to take that horrible deal the worst deal I've ever seen negotiated. We're going to end Obamacare. We're going to terminate it. We're going to terminate it. We're terminating Obamacare. We're going to replace it with something that's far better, far less expensive for you and for the country.","We're going to replace it with something that's really good. And the insurance companies will not like me because right now they are making a fortune. And your rates -- are you are getting your premiums are doubling and tripling. They're doubling and tripling. They're going up 45%, 55%, 60%. Nobody knows what's happening.","The insurance companies, they backed Obama. They're making a fortune. I couldn't care less about the insurance companies. OK? I couldn't care less. So we're going to start winning again. We're going to win so much. I sometimes joke, I say you're going to win so much you're going to get sick of winning. But the truth is, we never get sick of winning.","We never get sick of winning. We're going to win so much. You're going to be so proud of this country. You're going to be so proud of your president. And I love you all. Make America great again. Thank you. Thank you. Thank you. Thank you."],"text":" Unbelievable. All of these happens. If it's OK. I'd like to have a moment of silence for the victims of the Paris attacks. Please. Thank you very much. Terrible, terrible. What's going on is terrible. And when you look at what happened in that case, it was just reported, one from Syria. Our president wants to take in 250,000 from Syria. I mean, think of it. Two hundred and fifty thousand people and we all have heart. We all want people taken cared of and all of that. But with the problems our country has, to take in 250,00 people, some of whom are going to have problems -- big problems. And when you look at Paris you know the toughest gun laws in the world, Paris. Nobody had guns but the bad guys. Nobody, nobody had guns. And they were just shooting them one by one. And then they broke in and had a big shootout and ultimately killed the terrorists. And I'll tell you what. You can say what you want. But if they had guns, if our people had guns, if they were allowed to carry, it would have been a much, much different situation. I hear it all the time. You know you look at certain cities that have the highest violence, the highest, the highest problem with guns and shootings and killings. Chicago is an example, toughest gun laws in the United States. Nothing but problems. So our country better get smart. Because we're not smart right now. And I don't know if you noticed. But for two years I've been saying, \"Bomb the oil fields. Right?\" Because that's the source of their wealth. That's the source of their wealth. For two years we've been saying it. Bomb the oilfields. And it's such a disgrace. So yesterday they started. Everyone's saying, \"So that's a terrible thing that Trump said. He's so harsh.\" I always say, Jeb Bush would say, \"My tone, my tone.\" It's unbelievable. The other day I made a speech. The people in Iowa, they loved the speech. They loved it. And I talked about the deficiencies of some of the candidates and the newspapers say, \"Oh it was ranting, raving.\" I don't rant and rave. He was so horrible in terms of what he said about. I said the truth. I didn't say anything. In one case I said what that particular person wrote about himself. It's true. That's true. And they said he was so harsh. It was a terrible thing he said. I said what he wrote about himself. It's incredible how dishonest the press is. It's incredible. It's incredible. It's absolutely incredible. And I wanted to you know we to be talking about the wall because we're going to build a wall. It's going to be a big wall and it's gonna look beautiful because someday they'll probably end up naming it the Trump Wall. It's got to look beautiful. And people will come through the openings in that wall and we'll have a few of them and they'll come in and they're going to come in legally and to our country and that's what we want and people that are here illegally are going to have to go and you know what? Someday they'll come back and they'll come back through the legal process and that's what we all want. And I just want to say because I'm going to bring some very, very special people on stage. But I just want to say that. When I announced that I was going to run for president. I made some statements that were very strong but very true. Very true. I talked about illegal immigration. And I took a lot of heat that first two weeks and then people found out I was right. And I will tell you it's become a very big subject in this country. It's costing us $250 billion a year. Nobody knows it. Nobody talks about that. We'll talk about China. We'll talk about trade. We'll talk about a lot of things later but it's costing us at least $250 billion dollars a year. Tremendous problems, tremendous crime. Tremendous crime. And nobody disputes it. When I said it they all said, \"Oh this is terrible.\" Tremendous crime. And you know what. We're going to straighten it out and we're going to have a country again. We're going to have a country again and we're going to have borders because without borders, you don't have a country. We don't have a country. We have border patrols that are great people. I met them. I was in Laredo, Texas. And I met the Border Patrol people. They're fantastic people. They want to do their job. They're told to stand down. They use that expression with me, \"Stand down and we want you not to do.\" and these people are walking right through. And they're standing down there holding their weapons. They're holding everything. They're amazing men and women. Stand down, people walk right into the country. And you know in other countries, you can't do that. By the way in Mexico, and I love Mexico. It's a great place. They have strong leaders and smart leaders. They have smart people. If you want to become a citizen of Mexico, it's the hardest country in the world just about to become a citizen. But over here, \"Come on in folks, we're a bunch of dopes. Come on in. Come on. Come on in.\" You know the whole thing about the anchor babies. You have a woman. She's pregnant, walks into the United States, has the baby. We take care of the baby for the next 85 years. So, not going to happen. And I was right about it. Fourteenth amendment doesn't say that. You walk in illegally. You have a baby. The baby doesn't stay. And they said all you did a whole new constitutional amendment would take years and years and could never be gone. You don't need that. You know that I turned out to be right. The great legal scholars have said he's right. So you don't need it. But before we go further I just met these people backstage and they've been very nice to me because I've been very nice to them because I've been saying what's been going on and there are many others that I've met. This is a few, the Remembrance Project. Where people's loved ones were killed by illegal immigrants. People that were violently killed. One of the men I became sort of a friend of his, Jamil. He had a son, young football player. Good. Who is applying to Stanford, he was a quarterback. Great kid, never had a problem in his life. A great young man and he went to the deli. And he came back home and he was violently shot in the head many times and his father heard the shots outside. What are the saddest stories and he told the story, \"I was talking to my boy. And my boy said I'll be home in five minutes, Papa, I've got you a sandwich from the deli.\" And he's walking home and the father, Jamil Shaw. The father heard shots right outside. And it was a guy shooting his son in the head. And then his son laying on the ground is like this. And he shot him through the hand with 45 which obliterated his hands, everything killed instantly. And the father laid down on the sidewalk couldn't believe what happened. Couldn't believe it, he said, \"This couldn't happen.\" And he's just a great guy and he's not here today but other people are. And I'd just like to bring them the Remembrance Project. These are amazing people. Come on upstage folks. These are amazing people and no matter where I go I meet people that have lost a son or daughter a brother sister mothers and so many. Recently in California, we had a veteran, a 66-year-old veteran. But we can't have this anymore. We just can't have a country like this where it's being run like the way it's being run. So come on over. Say about your boy and say about your boy and what happened. Thank you Mr. Trump. My name is Laura Wilkerson. My son, Joshua was 18. He was asked for a ride home by someone we found out later was illegal. He beat him in the head with a closet rod. He strangled him. Let him go. Strangle him. Let him go. He kicked him in the stomach so hard that he sliced his spleen in two. And after that he finally murdered him. He tied him up like an animal. Threw him in a field and set him on fire. It's something you don't want to live through. The list is on and on. Thank you Mr. Trump for bringing it out and the media is finally picking up on it. It happens every single day. It happens every day. I want to say just one thing. Don't forget Brandon Mendoza, Dominic Darden and Drew Rosenberg. They're not here today but they -- there's a long list of names. Thank you. Hi. My name is Carrie Ruiz and my husband Lou. And this is our daughter Felicia. She was murdered by an illegal alien in '99. She was ambushed, beaten. Her throat was cut and she was stabbed over thirty nine times and we have been 16 years trying to catch this fugitive and he's hiding in Venezuela. We know that much and they refuse to let us have him. They know he's guilty for murder in the United States. And we just hope that someday the U.S. Marshals will be able to bring him out. Marshal Cameron Welch is the marshal on our daughter's case. We just want justice for our daughter. So I'm a little nervous up here. But please. We need someone like Mr. Trump for president so he can stop all this. Please. I just realized as I was listening that is in Venezuela, OK I'm going to do just fine with Venezuela. Believe me. If I win, If I win. We will get him out fast. Hi! My name is Rhonda. Where's my son? It's Kendrick Owens. He was killed March 6, 2010 by an illegal immigrant drunk driver while he was walking down the road with his best friend. I want to thank you Mr. Trump for everything you're doing and your only hope. We love you. We love you. My name is Debbie. My brother David was killed in March by a drunk illegal immigrant. It was a hit-and-run. The accident severed his legs and the body was lodged in the windshield. The driver dumped the body in an apartment parking lot and then drove away and tried to run from the police. They did catch him and we did have a trial. But he's serving 10 years probation. My name is Dan Golvach, the father of Spencer Golvach. This is my son. He was 25 years old. January 31st this year, he was sitting at a red light in the neighborhood that I grew up in. An illegal alien from Mexico that had been deported four times had a rap sheet that included felonies, assaults and burglaries. And had been in our federal prison system for five and a half years pulled up to a red light, randomly picked my son out, blew his brains out and went on and shot four more people. This is the result of politically correct politics. They will -- - they have no problem sacrificing your loved one, your child for the advancement of their own little agenda. But they will PC you into the ground. And I want to thank Mr. Trump for standing up and saying the things that need to be said that no one else is saying. You don't see that. You don't read about it in the papers. You don't read about it. You don't see it. It's just unbelievable. And I see it all the time wherever I go because I'm the only one that talks about it. It's like devastates, so hard to watch. It's devastating and you can imagine for no reason and there's so many more. I mean I have met so many families become friends with some of them. And you just say how can it happen. The sanctuary city stuff is just unbelievable. It's unbelievable. It's unbelievable that we can allow it to happen in this country is unbelievable. You look at San Francisco with Kate same thing shot in the back. And five times they threw this guy out of Mexico in my opinion they threw him out of Mexico. They don't want him in Mexico. They say, \"Hey, the U.S. doesn't know what it's doing. We'll send them over there.\" So the fifth -- So the fifth that well or do something very strong to him in this case because you know Kate's law. Kate's law is a good thing they can't even get it passed. They probably won't get it passed. And it's, it's a tough thing. I see so much of it. I see so much of it because wherever I go, I want to meet the people and they're devastated. Their lives are ruined. I mean hopefully not but you see I mean it's a very -- it would be easier to say, \"Oh it's gonna be fine with time.\" It's not. One of the parents said to me it was 10 years and one of the parents said to me it's worse now than it was 10 years ago. So you know the time thing that we all say we always like to say I don't think it really works but it's something that we're going to do something about that if I win believe me we're going to do something about it. We're going to do something about it. All right. Let's talk about a little more pleasant situation because we have so much negative news you know wrote the new book, right? Crippled America. And I picked the worst possible picture of myself. It was terrible. But what are you going to say? it's Crippled America and it is. We have a president who just came out. You know what he said? You made a little save and I want to say it exactly as he said it because you know what? I have such a good memory. I don't need it. But he said, \"We have ISIL.\" You ever noticed he always says ISIL. I've always said ISIS. I don't know, I like it. I don't know what but he always says ISIL. I think he does that to maybe who knows, maybe why does he do that? He's one of the few. I say ISIS everyone seems to say ISIS. He says ISIL. But he said we have ISIL contained. Now this was yesterday a few hours before the attack. Where you had plenty of Americans involved in that too in terms of being involved on the injury side and worse than that. But we have ISIL contained. We have leadership that doesn't know what they're doing folks. We have leadership that doesn't know what they're doing. And we have to change we have to go back. We have to go back to where we used to be years ago when we were strong and powerful and people respected us. And when you had a sergeant Bergdahl who is a traitor. He was shot for being a traitor. He's gonna get nothing. And we trade Sergeant Bergdahl for five of the biggest killers that they want right now back on the battlefields. They're back on the battlefields. We have to go back. You have to go back in time and a little bit you know somebody would say, \"Oh you're going in the wrong direction.\" And one of the folks mentioned the words politically correct. It's true, it's true. You know that. In terms of Remembrance fund, when I was with a group about two months ago, when they heard that one of their sons was shot and killed instantaneously the police who I love, the police are the greatest. I'm with the police so much. Their power, their power has been taken away. And that's why you have the problems in so many of the inner city since so many of the others but they can stop it. But their power has been so taken away. They don't wanna lose their jobs. They're afraid they couldn't even talk to people anymore. Can't even talk to people but I was with them and, and they said to me everybody was so great. They were helping me, helping me, helping me and when they found out it was an illegal immigrant everything stopped. They didn't want to get involved in solving the crime. Once they found out who it was. And they couldn't. And to this day they can't get people involved in it. In other words it's different if you shot somebody. Review shots, they go. I mean they give you that stuff. But they found out it was an illegal immigrant. And the men and I then did research and it's so tough. The system is so tough and so against law enforcement that when they find out situations like the people that just came up when they find out about it they don't pursue that like they would in a regular situation with an American citizen doing the shooting or doing the killing. And nobody knows why. I think I know why. I think probably because the process is so horrendous that they can't maybe they're afraid to get involved because they want to keep their jobs. Who knows. But it's -- it's very, very sad. So we're doing really well amazingly well. The Reuters poll yesterday came out. You saw that. That was great. Trump at 34%, Gray Carson at 19%, Rubio at 9% and Cruz at 7%. He's been very nice to me by the way, Ted Cruz. He has been. In Florida, Trump 37%. How good is that? I mean, think of that. Rubio, 16%. He's the sitting senator so I'm at 37. He's at 16. That's pretty good. That's pretty good. That one just came out. Here's what you're going to like the best. Trump is leading in Texas. Does that sound good? That's right. You know what I also like in one of the national polls? Best in foreign policy. They have me down in foreign policy as best. OK, so I wrote a book, The America We Deserve. And the book it was -- it came out in 2000. I talk about a terrorist named Osama bin Laden. Now this is before the World Trade Center came down by a couple of years. Somebody said like 18 months. But I talk about Osama bin Laden in the book. And one of the big moderators on one of the morning shows heard about this and said, \"Let me see that book. What was it written 2000?\" Well, we read. Trump was talking about Osama bin Laden in 2000. That was before the World Trade Center came down. He took it down. It was his people. Wow. And the guy goes, \"Wow that's amazing.\" I'm really pretty good at this stuff. I'm telling you. I'm telling you. You know another thing just happened and that's the oil. You know the way I've been saying, \"Go after the oil! Go after the oil!\" Everywhere say, \"You can't do that. You're going to hurt the infrastructure of the oil.\" Hey, we're in Texas. I've seen what those companies at your companies can do in about 12 minutes. They'll rebuild that infrastructure so fast with you folks building it. It's incredible, so fast they'll build it so fast and so good just bombed the hell out of it and so everyone said, everyone said no. 'Cause you know. I was seeing where they get most of their money, ISIS. They get most of their money from oil. Some in Iraq, some in Syria. So there's, \"No ,you can't bomb Iraq, that's a sovereign nation.\" Do me a favor. Bomb 'em and supplement. South sovereign nation. You know what that is. Sovereign nation, sovereign crooked nation. They were supposed to take everyone in. They didn't take everyone in. They wanted to run it all by themselves. That's what happened. That's how ISIS formed. OK. That's what happened. And ISIS turned out to be a lot tougher than they are. So they have oil. And that's where they get most of their money. They also get it from banking sources. And boy, am I good at banking. I would come down on those sources. Oh there's never been a presidential candidate that knows banking like Trump. Believe me. Believe me. They got a lot of money from banking. A lot of money through different channels of banking. And you can say, believe me that problem can be solved quickly. But I said bomb the oil take away. And for two years how long I've been saying it. For two years it's almost like I stopped saying it because everyone would say to me, \"Oh you can't do that.\" \"You can't do that.\" Why? They didn't know why but they just said you can't do it. So yesterday, they started bombing the hell out of the oil. And I said to myself. I wonder if I'm going to get any credit for that. And actually, actually a number of people called Jake Tapper, was one from CNN sort of saying, \"Wow! they did what you said they should do.\" And I had three or four big anchors call and said, \"Wow!\" I said, \"Tell me. Are you going to say it on the air or are you just saying it to me?\" You know they say it to me because they get good ratings. They want me to go in their shows. So I said, \"Say it on the air. Don't tell me.\" So they're doing but I actually took it a step further. If you remember, I said, \"Take the oil.\" \"Don't take the oil.\" \"Take it!\" And I said take the oil. So much money. Take the oil, don't leave. We should have never gone to Iraq. I said that right from the beginning. It's all called vision. You know people say Trump is a very tough tone. He has a very tough temper. We need a tough temperament now folks. We need -- we don't need a pathological temperament. We need a tough temperament. We have to have it. But I'll tell you we need a tough temperament. But if you remember in 2003, 2004 I said, \"You're doing a mistake with Iraq.\" There'll be nobody tougher with military than they believe me. Nobody up on that stage. Nobody. And Hillary Clinton is a total disaster by the way. She's a disaster. She is a disaster. But you have to know when to use your military. So just like I wrote about Osama bin Laden and these. All these people are saying I can't believe it, Trump's right. And you know the reason I wrote about it because there's so much talk about him as a bad guy. You know and people were writing about him and he said he's coming into the United States. He's going to do some real bad damage. That's what he said. So I said, \"Knock the hell out him before he comes in.\" Then he came in. He knocked down the World Trade Center. They could have done a job on that but they didn't. But you have to know. I don't even know if he's a friendly guy or not probably. But you know what. I'll tell you. So you have to know what to do. You have to know when to do it. It's usually friendly. The friendly ones I'd like to be nice. To the unfriendly ones, we have to be a little bit tough. So you have to know when to use it. You have to know when and the cheapest thing we can do is to build up our military and make it strong again because we'll never have to use it. We'll never have to use it. Right now we're depleted. We're depleted. We've been fighting politically-correct wars. Everything is politically correct. We don't want to do this. We don't want to do that. How about this? We have to be unpredictable, right? And I say that all the time. Somebody said the other day and one of those vibrionic, \"Trump's unpredictable.\" That's a great compliment. You know, I tell the story. Recently there was a story about me in a business deal and I won I really beat the hell out of these people which was fine. They weren't very nice but they interviewed the people a while ago. And they said, \"What do you think of Donald Trump?\" They say, \"He's so totally unpredictable.\" And I beat them because of unpredictability. Now I know sometimes you want to be unpredictable for your own reasons and you it's purposely unpredictable not like you don't know what you're doing. But you got to be a little bit unpredictable in life and they said he beat us because we couldn't figure him out. He's a good poker player. We couldn't figure him out. So here's the problem. President Obama announces last week, \"We are going to send 50 troops, our finest into Syria and into Iraq.\" We are going to send them to leave tomorrow or around 8,15. They'll be arriving. They'll be landing at a certain airport. In about 14 hours. And they should be getting off the plane. So if you want to set up your military and your everything to try.\" They have a target on their heads. These 50 people have a target on their heads. So now all over Syria and Iraq they're looking for these 50 guys. These are the top, top, top guys. These are the top people that we have. Why does he have to say that. First of all it sounds bad to say 50 because 50 sounds like, 50? So he didn't even get good publicity. It's sort of like either you do it you don't do it. Right. But -- but these are 50 of our absolute finest. Why does he have to say that we're sending them. Why couldn't he just send them. And they go there quietly and they do their job and there aren't people looking because nobody knows they're there. He is so bad he is so damn bad. It's like -- we shouldn't have been in Iraq. And I should get points for vision because I'm the only one on the stage. Now I'm not a politician. Thank goodness. Although now I am. But I said don't be there. That was a long time. Reuters long time ago they sent the delegation to the White House because I was getting so much publicity on it to try and convince me. I said, \"But you know the problem is you're going to destabilize the Middle East. You have Iran and Iraq that are the same in terms of strength. And they fight all the time. These people fight. That's what they want to do. They want to fight.\" What the hell are we doing? They fight. Iran goes this way. Four years later, Iraq pushed them this way. Ping! pong! back, forth for decades! I said if you knock out one of those elements including Iran. But if you lock out one of those elements the other one's going to just take over. What are you doing? They're not poker players. They're not chess players. They're not anything, honestly. They're politicians that don't know what they're doing. That's what they are. So I said, \"Don't go in.\" and I was right about it. They said weapons of mass destruction that didn't exist and Saddam Hussein talked about weapons of mass destruction and he boasted. You know why? Because he wanted to scare Iran. I made sense. He didn't want to say. So I couldn't understand because he overplayed his cards, right? They end up finding him in a pipe. He came a long way from the castles to a pipe with dirt all over his face. And he's a bad guy. But you know they end up and I figured out why he's always fighting with Iran. And he wanted Iran to think that he had weapons of mass destruction so they would be scared and they wouldn't go all the way etc., etc. Makes sense. So he couldn't. That's why he overplayed his hand. He couldn't not say that. And then we ended up making a big mistake and we've totally destroyed the middle east and then come Barack Obama and Hillary. And what happened there is now we're in. And he announces another time just like he did with a 50. He announces when we're leaving. We're going to leave. He got creamed all over the place just creamed. I mean they beat him all the time. You know we don't win wars and we don't win anything anymore what do we win wars anymore? Remember, I remember when I was young we never lost a war. Right. So we lose every time. We can't beat ISIS. We can't beat anybody. We can't make. I will. Believe me. Believe me. And it'll be fast. They won't be long it'll be fast because I want to get around to rebuilding our country. Believe me. I will. So, so you look at what happens with Obama. He announces that this is the same thing as with the 50 men. Fifty men will be going in. There is the same thing we will be leaving Iraq on October 31st at 3,30 in the afternoon. So what happens is the enemy says, \"Oh wow, they're leaving. They're leaving. That's great. Let's pull back. What the hell do we have to get checked?\" You know you read about all the stories that they want to get killed. They don't want to get killed. They don't want to get killed. They don't want to get killed and their families. They don't want their families killed, folks. Remember that they don't want their families gone but they don't want to get killed. So they pull back. Obama leaves. Now we've spent in Iraq $2 trillion dollars, thousands of lives wounded warriors all over the place who I love. And we're going to take care of because they're not being taken cared of. So Obama made a mistake. So he's totally predictable. He's totally predictable. We're going to -- we're going to send the 50. We're going to take him out here. Now if he would have said, \"We'd never taken 'em out. We're going to build up. We're going to.\" Even if he didn't do it. And I know the press is going to say, \"Well Mr. Trump would tell a Fib. He would tell a Fib.\" I won't tell a Fib. Why would they ever say that we're taking the people out when they took him out. So now the enemy would say if it were me I would say we're not going anywhere those you're going to suffer for the rest of your lives and your children your grandchild everybody. And they're going to say, \"Oh man this guy's freaking crazy. We give up. We give up. Oh, We give up.\" So Obama told the one we're leaving left and then they go in and it's a mess now. And as sure as you're standing there you know you know the fact I mean you see the same papers and same stories that I'm saying. But Iran is taking over Iraq. ISIS is taking much of the oil which finally we're bombing, OK. We should have kept it but finally we're bombing, we really did have because mine was to keep -- mine was to bomb it and keep it. OK. Now we're bombing it and somebody else is going to get it. All right. So sad, so pathetic. And you know what I wanted to do with the proceeds of that oil. I wanted to give a lot of it to the families that suffered and lost lives that lost their sons and daughters in Iraq. I wanted to give a lot of it. And by the way, if you gave each family a million or $2 million dollars, that's peanuts. You'd have so much money left over. Give them more than that. But you could give them a lot of money. Because they suffered and what do we have for it? What do we have for it? So I was going to give and this was another thing people said, \"Oh you can't do that!\" Of course you can. You can do anything. You can do whatever you wanted to. You can do anything. You could do anything. And I wanted to give that money. A lot of it to the families that lost sons and daughters and to the wounded warriors who don't have arms and legs and they're braver than all of us put together. I wanted to do it. So anyway, so just to finish off so the polls. So they said best in the military and foreign policy. That's always a great honor for me because a lot of people think that I'll be the best in jobs by far. I will be the greatest that God ever created. Believe me I'll be good. And they have me best in the economy not like by one point by like 50 points. Like I on one of my think I was at 72 and number two was at nine. That's a big difference. And they had me by far, by far best in leadership so I said look if I'm best on military and foreign policy if I'm best in leadership if I'm best on the economy what are we having an election for? Let's go. Right? You know a couple of things about the campaign. The one thing they did say I'm not as nice a person as some of the other people. And I told a woman and I actually am a nice person but I told a woman who said that she said to me, \"Mr. Trump, I'm voting for you. I love you but are you nice enough to be president?\" I said, \"Let me tell you something, ma'am. I'm glad you voted for me but I am a nice person. Believe it or not I'm a nice person and I have a lot of good relationships.\" But I will tell you especially with the people I know. We have a good relationship. But I will tell you this. I really believe it doesn't matter because I think this is going to be an election based on competence. We need somebody competent. Really. And I'm really competent. And we need people that are like Carl Icahn and he's a great businessman. He's worth a fortune, is a great negotiator, one of the great negotiators. Other people are endorsing me being the biggest businessman. Some of them endorsed we don't even like me but they know I'm really smart. I do what I do. I built this incredible company. Remember when I filed the papers everyone said, \"Oh he'll never run because maybe his company is not as big.\" What turned out to be much bigger much better much right. They can't believe it. You never heard anything about it since they filed. They were down there hundreds of them looking over the papers Oh my God he's really much bigger than we ever thought. He built an unbelievable company. They were down there. They say more people were down looking at those papers almost 100 pages of financials an incredible company, very low debt, tremendous cash flow. The press was devastated, right fellas? Were you devastated? They were down. They were devastated. And I tell you that not to brag about my company because it's a private company. Nobody knows what I have. It's a private company. It's beautiful. That was really a big opening for me. I mean for me to run for president. It's not an easy thing. All my life I've heard of your a very successful person. You can't run for president. I understand what it means because they make you. They lie. And they cheat. And they're dishonest. You know many of them. Many of them. I had a story recently. Where I went up in the polls I'm leading by a lot. And the story was, When Will Trump Leave the Race? Like one of the commentators in the morning. Good guy Joe Scarborough. He always jokes. Well Trump going up in the polls that means I guess he's leaving the race. He's leaving. Let me tell you I'm not leaving folks. Ever. I'm not leaving. I'm not leaving we're going to win. We're going to win. I think we're going to win. But you know these pundits who are worthless. You know George Will, the guys. I mean these guys, they're worthless. They said, \"He will never run, a lot of -- he's got the personality of that piece of concrete. Hey guys. He will not run. He will not run.\" Then I announce him running. He will not file his paper. He will not file forme. Forme is the first filing where you sign your life away. Then I file for me. He goes, Oh well, he will not file his financials. And if he does they will never be filed on time because he's probably not as rich as people think.\" So I was one of the only ones that filed ahead of schedule. In fact I have to be honest my financials are so good. That I hadn't really decided on running because it does take guts I have to be honest. Not that kind of guts those people had who I just brought up here not the kind of guts the wounded warriors have and the vets have. I tell you what. I don't have that guts. Those are real guts. But it takes guts to run. It takes guts to run. But then he said he will file. So they turned out to be good. The only reason I talk about how good my company is because that's the kind of mentality we need running the country. That's it. That's the only reason. And I was actually, you know they're all saying, \"He'll never file au financials because who knows?\" They had no idea. I was going to file them even if I didn't run. I was seriously thinking about not running too. Do you know? Did you know the famous scene of my coming down the escalator with my wife Melania? Who looked very beautiful coming down the escalator? We have this. You will have one beautiful first lady that I could tell you that and she's got a great heart and she is really smart. But she's got a great heart but she's coming down and she's a very calm person and she's waving beautifully like this. Remember very famous scene as they played all the time coming down the escalator. I think they play it because she's in the picture not because I'm waving and she's just going like this but if you remember that famous saying well just before then. I said I wonder if I'm going to do this. I mean I'm standing up top. The press is all over the place. The place was surrounded. They will tell you I've never seen it. It was like the Academy Awards. And I did this, I said. Because I tell you, I went, \"Let's go.\" I took a deep breath. I came down on the escalator and here we are. Who would have known this was going to happen? Who would have known this was going to happen? You know. This guy that you know and a lot of things have happened since and a lot of great things have happened since because you know I had no idea that I do, as well as we've done thus far. Now the big thing these same characters that you know that said I wasn't going to run. Now they're saying, \"Well, it's only a question of time before he gets out.\" Why? Why would I get out? I was interviewed by Chuck Todd of Meet the Press. He's a nice guy and he asked me the question. I was I just came out where I was leading substantially and he said, \"Well you get out of the race?\" And I said to myself. Has that question ever been asked to a person that just took the lead? You know it's such a negative question, isn't it? And I made a mistake. I ran a pulse and people didn't want to see me anymore. So you'd have 100 people show up when you used to have 1,000 or 2,000 or 5,000 like today. Or you wouldn't do well. Yeah I mean I'm not a masochist. I think probably I'd. I'd go out. And that was a killer answer. You know why next day, \"Trump may leave the race.\" No it was not right. Trump. I said I don't believe it. I don't believe it. And I remember Rand Paul who's like one. No, no. They asked him the question, \"Are you gonna leave the race?\" Now you're always going to leave the race. And I have to leave the race. But they ask and I'm not knocking it. But it's political speak versus somebody that was never a politician before. I'm giving all the reasons for which I believe. But I'm doing better than I've ever done. And the question shouldn't have been asked but I give all the reasons. And actually my wife said, \"That was a really nice answer, was such an honest answer.\" I said good things. I got killed. OK so what happened? They asked Rand Paul. He's at one or two. He's leaving Fox. He's leaving. He's got to leave. Otherwise he's not going to be senator from Kentucky. So they said, \"Will you consider leaving the race?\" Absolutely not. I will not leave the race. There was no story. They asked a couple of other guys there at zero. Are you going to leave the race. No you know it's. There is zero and they have no money. Other than that they're doing very well. Right now they're at zero. I saw it the other day they asked Lindsey Graham. He's in two in South Carolina. I'm at 38. He's a sitting senator. No. Think of it. They said. Senator Graham are you going to leave the race? Absolutely not. I will not leave the race. And I said that's a politician. I'm not blaming Graham. I'm not blaming Rand Paul. But there was no story. I gave an honest answer and I end up. I will not, ever leave this race. Ever! I'm not leaving. And you know what. And I'm still number one by a lot. So that's the reason I'm not leaving. So anyway, it's just a couple of things I'm going to talk to you about a few things and I know it's a crazy day and with the tragedy yesterday that was some horrible thing. I mean people see that and they just it's -- it's so terrible to watch. But I love this group of people. I love this area. I know this area I have friends here. These are amazing. These are the people you built the country folks you built the country. You've done an amazing job. But just so you know because this has been a lot of talk lately about stances on different things. Without me there wouldn't be any talk of walls there wouldn't be any talk of immigration illegal immigration. Those folks would not have a voice at all they've been treated horribly they've been treated so badly probably worse than anybody. I mean you see that. And because of me and I'm very proud of it. Immigration is one of the top couple of subjects maybe the top in a lot of people's minds it's a top subject. And when you get to Texas it's got to be a real subject because you're the ones that are really -- I mean I had such a crowd in Phoenix Arizona. They get the brunt of it. You get the brunt of it. Some people don't know it as much. But when you got in New Hampshire you know they have a tremendous heroin problem and a tremendous beyond what anything that you can believe. And it comes over the border. So they're all of the everybody is affected. When you look at the gangs in Los Angeles a lot of those gangs are illegal immigrant visa tough dudes. By the way they will be out of there so fast. They won't be out of there so fast. They'll be out before I start the wall. I'll be starting out the wall fast. By the way they will be out of there so fast. We have some of these tough gangs and they're all illegal immigrants. And those guys are gone and we're not going to put him in our jails. I know a lot of people say we're going to put him back we're bringing it back to the country they came from. Let them use their jails. OK Let them use their jails. Our jails are brimming right now with people that shouldn't be in our prison system. They'll be in there for years and years and years and we'll be paying for. Not going to happen, folks. We're bringing them back where they came and went. And when a specific country sends them over to the United States because we have among the dumbest people in the world leading us and we accept their people. OK. When they send them they're not coming through. Not with me. They're not coming through. They're not coming through. So, in 1954, General Eisenhower you've been reading about this. Nobody even knew about it until I brought it up. Is that a beard? What a handsome beard. Look at the beard on that guy. I do that but I probably couldn't get voted. I don't know. But it looks good. But in 1954, General Eisenhower -- I like Ike. Everybody liked Ike even though he was a general. Everybody liked him but General MacArthur you know why because General MacArthur was a very special guy. Tough. A genius. The highest marks in the history of West Point General Douglas MacArthur. Good right. And General MacArthur couldn't stand taking orders from anybody because he felt he was superior to everybody. And Ike was a less than average student at West Point and MacArthur couldn't understand it. You know to this day General Douglas MacArthur had the highest marks in the history of West Point. Pretty good. You know I'm into the academic thing to be honest. It means something, right? And he couldn't stand it. But we have MacArthur's and we have we have General George Patton. Great. By the way, what do you think General Patton would do as he's listening to. Barack Obama say we are sending tomorrow morning at 9 o'clock, 50 people. He would be. He's right now spinning in his grave and so is McCarty. But Eisenhower was a nice man. I like Ike. That was the slogan like mine is make America great again. Make America great again. How good is that? Is that good? Do I hit it? That hit it on the head. You know I've had guys try and copy some of the people running against me use that expression. But I had legal rights to it. Do you believe how good -- how good am I at this time? So we put them on notice. They weren't allowed to use that. Make America great again. The plane was landing before and the pilot saying, \"Coming in, coming in. OK. You're cleared to land. Make America Great Again. This is from the control tower.\" and my pilot said, \"Mr. Trump heard that, I wanted to kiss those people.\" Make America Great Again. But Ike was a little different. Ike was -- I like Ike because he was a lovable guy. He was a nice guy. But despite being a nice guy they had a problem with illegal immigrants. No definite changes, had a problem. So they moved out one and a half million illegal immigrants, right? They moved him out having a tremendous from which jobs, you know jobs is a big thing. They're taking jobs from people that want to. We have 100 million people. A lot of those people want to work. This 5.2% unemployment is nonsense that was written and designed for politicians so they look good. We probably have a 25%. We probably have 25% unemployment. OK. If you look at the real numbers or I wouldn't be getting the crowds I'm getting or I wouldn't be getting the responses or the polling numbers. We probably have 25% on the plug. So I like Ike, so Ike said a smart task force and they moved a lot of people and they took them. And they moved them right across the border and they came immediately back. And then they moved them again. And they came back. They say this isn't working. They keep coming back. Then they move them all the way south and they never came back. You know. Now it's rough stuff. Today it's harder to do things like that. But they didn't even think about it. They said no they're here illegally. See those days. They are here illegally, illegally! Not legally, illegally! Everyone says to me Bill O'Reilly the other night. He's a great guy but he said to me, had a little argument with me. He said the court system will take you a long time. I said you don't stand Bill they're here illegally. No, no. But the courts. So if somebody walks over the line. They bring them immediately back ,right? Now in our case we don't. But you could. They won't go over the line you bring him back. OK. So they bring him right back. So they walk over the line a year ago. You bring them back. There's no difference if it was three years ago. They're here illegally. They're here illegally. And everybody said on the anchor baby I was wrong. They said if you have a baby here and I discussed it. And then I turned out to be right. It's the same thing. The anchor baby you can't have a baby here if you're here illegally have a baby. Now you can have some court cases but believe me I will if I'm president. I guarantee you. I went on the anchor baby and I went on this too. Because no, I don't want to go through a court system every time you want to bring an illegal person. I don't want to go. I know more about courts than any human being on Earth. OK. And I don't want to go through a court system with the lawyers and the problem. But they're here illegally. We're bringing them out. That's all. That's all. Now let me tell you what happened with Eisenhower because he gets mixed reviews. Now they say I was very harsh. I'm sure I was in some cases. But let me tell you. When they started and this was serious. This wasn't like we're playing games like today where everything was so politically correct. You know everyone, \"Oh gee, well we can't do that let's start.\" This was serious stuff. They moved. And by the way Harry Truman moved. They say millions of people out. Millions. Harry Truman before Ike. Moved millions of people. Nobody talks about this. They say what a bad guy I am. How it doesn't work. It does work. It does work. And I want them to come back by the way, just so you know. I want to make it clear. I want them to come back. But I want them to come back legally and if we need workers for the grapes and I'll say this. Because a lot of people say the grapes. the grapes. and I don't think any of you guys are going to be picking grapes, OK? I really don't think so. You want to be picking the pockets of Wall Street but not grapes. But if we -- need some people we can bring people in on work -- Get caught or whatever. You know what happened? They move themselves. They move themselves. They said \"Oh, wait!\" They're going to us next week. They gonna come to us in a month.\" They all move up millions of people left. Millions of illegals left. They left of their own volition, not that stupid Romney stuff. It was self-deportation. I mean how they're going to self-deport? Oh yeah right. Vegas. Then you wonder why he lost. Right folks? But this is something were many of them once the system started and once they saw there was no games. They moved him out. Now today we have things like e-verify. Where the employer will say I'm sorry I can't do it. I use now e-verify in most of my jobs. I have thousands and thousands of employees. I've hired tens of thousands of employees. Many Hispanic over the years. Many, many -- they're fantastic. Many from Mexico. Today many, many employees from Mexico. They're great. But I have. And I think to me it's very important -- e-verify. So now I find out if they are they legal or not. If they can't get a job they're moving out. They're going to move out. Nobody has to -- you don't need soldiers. They're going to move out. It's so simple but a politician doesn't know this. A politician doesn't know it. They're all talk and no action. All they know how to do is get re-elected. That's all they know how to do. When you see the remembrance folks and when you see all the problems. We're not going to have that kind of problem. We're going to have a lot of winning. We're going to be doing a lot of winning. I'm telling you. We're going to win everything we started. We're going to win because I win, my whole life. That's why it always bothers me when they say, \"Trump's had a great time. And he's done really well. But he doesn't really want to be president.\" You think he really wants to be? No I'm doing this for my health. OK. I came to Texas at 12 o'clock in the afternoon because I want to. I want to do this. I want the end result. Somebody said, \"Well, why are you doing it?\" And I said, \"Because I honestly believe that the American dream is dead. But I'm going to make it bigger and better and stronger than ever before.\" I really believe that. I really believe. I really believe. So if you look at Rubio. He was a member of the Gang of Eight. And Rubio wants amnesty. Give everybody amnesty. This just so you understand. Just so you understand. These are lightweights. These are not people that can take us to the promised land. These are not people. They're nice people. I like them very much. I stood with them the other day. Excellent person. You know, who cares? But he was a member of the Gang of Eight. The Gang of Eight. You know that was. That was a group that just wanted people to flow in. OK. Member of the Gang of Eight. And when his poll numbers went down, he all of a sudden became an unmember of the Gang of Eight. He's not what we need. So Rubio is weak, weak on illegal immigration, weak on the amnesty, wants everybody to have amnesty. Can't do it. Carson, very, very weak on immigration. Very ,very, very weak whatever that is. He wants worse. He wants a path to citizenship for people that came into the country. Think of it. They come in illegally now they become citizens. One of the problems with that is we have right now, we have right now. Millions of people wanting to come into the country and they've done it through legal channels. They've done it right through legal channels and we've got to be fair to those people also. So just in a nutshell on immigration because I know how important it is for Texas. We're gonna have a wall. It's going to be a great wall. It's not going to be a wall that people can walk , over climb up. This is going to be a serious wall and it's gonna be built at the right course. Mexico is going to pay for the wall. Believe me, they're going to pay for it. They're going to pay for it. We're going to get the bad ones out really fast. I mean, so fast and the rest is going to have to happen. And everyone's going to be happy in the end. People are going to be happy. We're gonna have jobs. We're going to do a great job. We're going to be fair and we're gonna do it with a very, very big heart. It's going to be done humanely. Remember that. It's going to be done humanely. So just to finish off, I want to just because I wanted to really harp on that a little bit the immigration because it's so important and such a big factor and it's become such a big factor in the race. I'm proud of it. But, we are going to negotiate great deals. I mentioned Carl Icahn before. I'm going to use the smart ass. We have the smartest people. We have the best people. We have the best minds with the best business minds. We don't use them. We use political hacks. We use people that put money into a super PAC and they end up getting jobs because they gave a couple of bucks to the super PAC. And the super PACs, by the way, I don't have super PACs. I turned -- I said -- I don't want any super. Super PACs are controlling your senators. They are controlling every candidate. They'll only do what's right for those people that gave them money. The donors, the special interest, those are the only people believe me. They control the politicians. Nobody is giving me any money other than the small donors where frankly, if people send in $25 or $50, I have to take the money because. it's not that -- it's a lot of money. If you send that money back, it's so -- and so how do you send it back? We don't want your money. So I take small donations -- small and I say that's fine because that's like an investment in the country. But it's peanuts. But. so I don't take any more. I'm putting my own money. I'm funding my own campaign. I'm spending a fortune and I am spending but so far I haven't spent that much. So far, listen to this one. There's a stat that some people like and some people say maybe it doesn't sound good but I like it. The business people like it. So far I've spent less money than anybody else and I've had the best result of anybody else. Right. Ain't that beautiful? Ain't that beautiful? Less money and the best result. And that's what I like and that's -- wouldn't it be nice if we could do that with a country. We spent less money and we have -- In education, we spend more money than any other country by double and triple per pupil. And yet we're rated number 28 in the world. We have nations that you wouldn't believe ahead of us. We have nations that you wouldn't believe. So we're going to win on trade. We're going to take our jobs back. We're going to bring jobs into the country. We're going to beat China. We're going to beat Japan. We're going to do great with Mexico. We're going to do wonderfully with that horrible Iran pack. I love to renegotiate deals. OK. But we're going to take that horrible deal the worst deal I've ever seen negotiated. We're going to end Obamacare. We're going to terminate it. We're going to terminate it. We're terminating Obamacare. We're going to replace it with something that's far better, far less expensive for you and for the country. We're going to replace it with something that's really good. And the insurance companies will not like me because right now they are making a fortune. And your rates -- are you are getting your premiums are doubling and tripling. They're doubling and tripling. They're going up 45%, 55%, 60%. Nobody knows what's happening. The insurance companies, they backed Obama. They're making a fortune. I couldn't care less about the insurance companies. OK? I couldn't care less. So we're going to start winning again. We're going to win so much. I sometimes joke, I say you're going to win so much you're going to get sick of winning. But the truth is, we never get sick of winning. We never get sick of winning. We're going to win so much. You're going to be so proud of this country. You're going to be so proud of your president. And I love you all. Make America great again. Thank you. Thank you. Thank you. Thank you."}