{"id":496,"author":"Donald Trump","title":"Speech: Donald Trump Holds a Town Hall-Style Event in Sioux City, IA","date":"2015-10-27","link":"https://factba.se/transcript/donald-trump-speech-sioux-city-ia-october-27-2015","paragraphs":["We've had some amazing results and they continue to come in, get a little shakeup in Iowa. I don't know what's going on. Somebody said are you going straight to New Hampshire? Now, I love New Hampshire. We've got great numbers 38 to 12. That's good. But we fell a little behind in Iowa and some people are saying how can it be? And I come out, I was just telling a group.","We have the biggest crowds. We have the most enthusiastic crowds. Everybody said and it's very true. I mean look at this. No, but somebody else would come that have like 50 people and they wouldn't need this room. Believe me. But everybody said without question in every poll, this isn't just here, that the people that are with Trump are with Trump.","They don't go anywhere, they're staying. It's true. I see it. I see it. And we've seen it. You know a couple of times I say, well, that could be the end. Then they do something, I'm 10 points up. It's the craziest thing, right? But we'll take it. But they say the people are with -- we have the most loyal people by far and everybody says it. The other thing they say is for leadership, number one, very important, right?","Don't you think? Leadership. I mean when leadership is number one, they say on the economy without question, number one, and by a lot. So you know it's, it's great. I thought I'd talk a little bit and I want to take some questions. You know we could do a little question and answer, right? We have all these cameras going back here.","And you know it's always tough when you're on live television all the time. Look, we have 10 topics, right? How many topics, 10? How many different ways can you talk about the 10 topics? The bottom line is we want results. We want to get it done. But when you're on live television all the time, all those people back there, and the cameras are on, and then you're talking about immigration, and you're talking about the wall because we can have a wall and we get to stop illegal immigration.","But we talk about trade and we talk about repealing Obamacare. We talk about all the things that we talk about, but you know, you have these points and we can talk about them in different forms, in different ways, and give different examples. But in the end, it's really about results, isn't it? Right. It's really about results.","And you can only talk about the same subjects on live television in so many different ways. I talk about the industry. I talk about commerce. I talk about how we're losing our jobs to all of these different countries. And I give different examples but it's still going to be a certain number of subjects. I talk about Second Amendment.","I talk about the 14th Amendment. We talk about Amendments. You know that Second Amendment, they want to take it away from you. They really want to do things and it's not going to happen. It's not going to happen, at least with me, it's not going to happen that I can tell you. So I said today, you know, we'll talk for a little while but I want to do some questions and answers.","I want you people to excite me for a change is that, OK? I want to be excited. And so we're going to have some fun. So we're going to do that. A few things, I want to bring up a few new subjects too. So immigration, we're going to be doing a very strong number. It's killing us. It's killing us and it's bad for the economy, it's bad for -- all of this illegal immigration.","And I have to tell you, legal you come in, and we're going to have a good time, and you're going to be there, and you're going to do great, and visas, maybe work, maybe there are cases where you need people in, and we'll do something. We're not going to hurt our economy in any way, shape or form. We're going to make our economy much, much stronger.","But we're also going to get jobs for people that are here, people with us. They're -- we're going to get jobs. We're going to get jobs. But the illegal immigration, you know, I did this and I made my determination. I took a deep breath because I'll tell you what, it takes courage to say I'm going to run for President.","It really does. Especially in my case where I have a great business and I love my business. I love doing it. I may never even see -- I mean, I own some of the great properties in the world. Doral in Miami. I may never see it again. Turnberry. Thank you. I love you. Look at her. Turnberry in Scotland, one of the greatest home of the British Open and all that.","I may never see it again. All of these incredible places that I have but more than that, it takes courage because when you do it, you're putting yourself out there beyond anything that anybody's done. And it even takes courage for a politician to do it. Now at some point, some of these guys have to leave.","Don't we agree? It's getting ridiculous because like tomorrow night we're having a debate and I wish we had more time for the debate. I wish we had not, in terms of three hours, because who wants three hours? I -- you know and I could stand up for 20 hours if I had to but who wants to watch that long? Hillary's debate essentially lasted for an hour and a half and I was huh, it was, you couldn't watch it. You have Hillary against a socialist slash Communist and nobody knows him.","And honestly, he's not going to win just so you understand. I mean, is all kidding you -- he's not going to win and neither is she. You're right. Long term. Well, she is being totally protected because in theory she shouldn't even be allowed to run. It's true. She's being protected.","It's a tough game, it's a nasty game but she is being totally protected. But she's going to beat him and you still have one more of these guys. Oh, O'Malley, so he'll be out quickly, I guess. I don't know. What's he doing? What do they do when they have zero? We have -- they zero. And I wouldn't say it against our folks but they've treated me -- some of them, some of the zeroes have treated me so nastily, right?","Because they want to start a controversy and they want to try and pick up some points. And you know what, I'm not even going to mention names. I usually do I love doing it. But everybody that's hit me so far has gone down, they've gone down, and they've gone down big league. But -- and a couple of the ones and zeroes, they're the ones that hit the hardest.","I mean, they're like desperate people but they hit -- one of them has a zero with an arrow pointing to the left. That means less than zero and I don't understand. What does it mean? I assume it's a typo but maybe not. But when you look at the things that are happening with our country, the trade situation with not just China.","I talk about China all the time because that's the main abuser. That's the biggest abuser. The numbers are astronomical, almost $400 billion a year in terms of imbalance. Think of it, $400 billion a year. And they send stuff over here but we can't send stuff over there. They tax us, big tax. A friend of mine can't get his stuff over there.","The tax is so big. Big tax. Somebody bought an airplane in China, here. Can't get it over there. It's a spoiled guy, rich guy, bought a beautiful plane. Can't get it over there because the tax is so massive. That now he's selling it in this country because China won't let him have the plane and he has to pay a tax.","I won't even tell you what the tax is. It's so astronomical that I don't even believe it myself. So I'm not going to say it because those guys will say, well, he was wrong. All I can tell you is, all I can tell you is, it's a massive tax like you don't buy planes here. Because if you do you won't be able to get them back in. And here we accept all of their products.","So we have almost $400 billion trade imbalance with China. We have a $70 billion trade imbalance with Japan. We have a -- you know with all that's going on now in the South China Sea and you look, well, we have a destroyer. A relatively small ship over there. I don't know if I'd want to be the captain of that ship right now.","But they're being sort of mocked and scorned and a lot of, lot of bad things can happen. But you know, we have an agreement with Japan, and I love Japan. I love China. I love all these people but their leaders are killing us. Because they're smarter, sharper, more cunning. The leaders of Mexico are killing us at the border and in trade.","They've taken so many of our companies even Nabisco, my Oreos, they're taking Nabisco, right? I'm never eating Oreos, I tell it all the time. They had some Oreos before in the plane. I said I don't want to touch them. Bring them back. Are you allowed to bring them back? Bring them back, right? But I'm not happy.","They're leaving Chicago and they're moving their big plant to Mexico. So when you see this happening we have to stop it. And I'm not going -- look, I'm not going to beat around the bush, and oh, let's talk and let's be nice, and let's save it. Nobody can do it like I do it. Nobody. Honestly, nobody. We can -- I'm not saying I'm perfect because I'm not perfect.","Nobody's perfect but thank you. I love this guy, handsome guy. I like him, very good. Now, but nobody's perfect. But I'll tell you when it comes to that stuff. I'm really -- there's nobody better. Carl Icahn endorsed me the other day. He's one of the great traders, one of the great dealmakers, he says Trump, Trump.","You know and he's not somebody that just do it. He wants somebody that knows what they're doing. He understands. You talk about corporate inversions and all of the things that are going on. Corporate inversions you know, many of the companies in this country have trillions of dollars accumulatively. They take $2.5 trillion overseas right now.","They can't get it in and everybody agrees that we should bring it in. The Democrats and the Republicans. They've agreed for years. They can't make a deal because they have no leader. It's not like, oh gee, we disagree on Obamacare or we disagree on something else. Although I must tell you, many of the Democrats that I speak to, because I'm friendly with all of them.","I'm friendly with like Republicans, I get along with everybody. You know, everyone said oh, you won't be a unifier. I'll be the greatest unifier of all. Why? Is Obama a unifier? But I will tell you, many of the Democrats that voted for Obamacare would never have done it now, and they were lied to 28 times, right?","You can keep your doctor, keep your plan, keep you this, everything's going to be great. Turned out to be a total lie, 28 different times that they know of, and they wouldn't have done it. But when you look at what's happening with corporations and the highest tax -- we pay the highest tax anywhere in the world of any country but they have trillions of dollars overseas, and these are great companies in many cases, they have thousands of employees.","They can't get their money back and the reason is bureaucracy. It's very hard and also a big reason, the tax is too high. They don't want to bring $1 million back and pay $300,000 or $350,000 tax. They'd rather leave it over there. And if they bring it back, they'll be using it to invest in our country. I mean a lot of good things will happen.","I happen to believe it's more than $2.5 trillion. But here's the thing and I use it because it's so incredible. Here's the thing. It's not controversial. It's not like you have the Republicans here you -- everybody agrees. They've agreed you know that for two and a half, three years. They can't make a deal.","And now what's happening, and you'll -- this will be the next great story is companies are leaving the United States to two reasons: lower taxes but also they get their money. They've got billions of dollars overseas. They're leaving our country in order to get their money and in order to pay lower tax. And you're talking about one company I know of. I don't know how much they've written about it but you're talking about 6,000 jobs.","Just one company. You're talking about potentially thousands of companies and I say it, in the old days, they'd leave New York people would move down, and companies would move down to Florida or they'd moved to Texas or they'd leave New Jersey where taxes are quite high, and they'd move to another location, right?","Now they leave our country and they go to other countries. That's what's happened in the world of the Internet and the world of very fast jets. It's a different world out there. And there's no loyalty. They're paid a lot of money to make a lot of money for their shareholders and some of them actually are foreign.","They'd like to move back to these countries. They bring in executives that are from Ireland, from other places, and they don't mind. They have no loyalty to the United States. So my plan, my tax plan is something I'm very proud of. We're going to solve corporate inversion. I'll tell you what we will have that money back.","If I get elected President that money will be back so fast your head will spin. Nobody else will be able to do it. Nobody. Honestly, nobody else even knows about it. The other candidates, most often don't even know about it. It's not, it's not their wheelhouse. OK, it's just not. It's not their thing. It's not their thing.","Their thing is getting re-elected. That's what they're good at. They get re-elected and they make promises and they're all talk and they're no action. And it's say -- the same thing happens with these politicians. It's always the same. So we have so many different things and what I've done with our tax plan, which something I'm very proud of, we've brought it down into a few groups because right now you have to go out -- people that aren't doing well, go out and hire companies to help them with their tax plans.","They'll pay $500, $1,000 because it's so complicated and we're going to make it nice and simple. And we're getting rid of carried interest which is something that a lot of rich, hedge fund guys love. But we're getting rid of it. They don't love me so much anymore. But I don't care and we're getting rid of a lot of things.","So we get a nice simple tax return. Somebody said oh, why aren't -- why isn't everybody paying? You know 40%, a big percentage, will not pay any tax at all. People that are doing badly they said, well, I won't use the candidate's name, because I don't want to insult any candidates when they can't defend themselves, but they said we want everybody to pay at least something.","And I said I agree. Here's the problem. From the standpoint of bookkeeping, from the standpoint of bureaucracy, you're talking about millions and millions of returns. You're talking about building the IRS even bigger and it's a, it's a monster. And I could cut it down way down. And the money that you're talking about is far less than the administrative costs.","So I said I agree. Except for one thing, from a practical standpoint, it's too much. Most of these people are paying anyway. What I want to do is bring our jobs back from China. Bring our jobs back from Mexico. Bring fairness to our deals, as an example, with Japan. I was in Los Angeles, ships the biggest ships you've ever seen, cars are pouring off into this country made in Japan.","We give them practically nothing. The balance is so bad, the imbalances is so bad. You say how -- and then we have all the strike. See what our people don't know and only somebody that wrote The Art of the deal or does this stuff, right? It's natural. It's like a great athlete like a Jack Nicklaus, he always was able to sink that putt, right?","You know, he's just better. And you have athletes very few but there are some people that have a certain ability. A lot of people don't even know. We have all the power, we have all the power with China. You know, we owe right now, China and Japan equally, $1.5 trillion, think of this, trillion dollars, $1.5 trillion.","So think of it. They take our business, in the case of Japan mostly cars, but they take our business. They take our jobs. Factories close down all over the place and we owe them money, right? It's a magic act for them not for us. For us it's a horror show. It's going to end. It's going to end. And people like Carl Icahn and people like the best nego -- I know the best negotiators in the world.","Some of them I think are horrible people. I'll be honest with you. I don't care. Do you care if their horrible people? We want -- now Carl happens to be an actually a very nice guy. But he's a brilliant negotiator and a tough cookie and he's built a fortune. He doesn't want money. He doesn't want to say oh, give me $200,000 a year in government money.","As I said, he wants to do it. He's proud to do it. He wants to help the country and it's so easy for him. For instance, if I said Carl, do me a favor. The trade deal we have with China is so unfair. We're losing $400 billion a year, Carl. Do me a favor. Make it fair. I don't have to give him a big speech.","I don't have to give him a big speech. I mean I can tell you that within a very, very short period of time things will straighten out. I mean things straighten out. And it's going to be to our benefit. But think of it, if we're losing that kind of money, that imbalance. It's an imbalance. Some people would say that's not really a loss.","It is a loss. If we have that kind of an imbalance and supposing you brought it back to zero or even if we lost $1 billion a year that's all a lot of money. Believe me, I couldn't sleep it. If I brought it to $100 billion a year. Get rid of me in four years all, right? But supposing we brought it back to $100 billion or we brought it back to zero.","Do you know what that means for this country? Do you know the kind of money you're talking about? Then, jobs would start coming back. Lots of good things would happen. Lots of great things would happen. And maybe our babies, who have all these toys all over the place, maybe they'll have 75%, and maybe you'll like them better.","Maybe, they'll be better and they'll be manufactured here. Whenever I order television sets, I order thousands and thousands of television sets a year for different jobs, and whenever I order them they all come from South Korea. They make all the tele -- other than Sony but Sony has sort of lost its way a little bit.","But Sony is Japan. But South Korea, LG, Samsung, I don't get bids from America. I'd love to. I'd love to. George Wills said there's a company in South Carolina that makes television. I said where are they? I'd like to have a good name too, by the way, it's important. You know when somebody is paying you a fortune for a hotel room, it's nice to see a good name, right?","Do we agree? Right? Well, it was a company in South Carolina but they don't really make them, they assemble them. In other words, the parts come in, they assemble them but much different. But I'd love it if we made them. But you take South Korea. We defend South Korea for essentially nothing. You have the maniac over North Korea that nobody ever talks about by the way.","Now, he really has nuclear weapons and we don't talk about him. We made the worst deal ever made with Iran, right? The worst. No, no, these are the people that represent -- these people are incompetent or stupid. You know, somebody said you shouldn't say stupid, but it's true. It's stupid. I think. I mean I think.","Unless I don't know, is there's something going on that we all don't know about? Think of it, point after point, we lost. We lost everything. We're giving them $150 billion. It's hard to believe. They're going to have all that -- they don't have to develop them. I tell somebody they don't have to develop nuclear they can buy it. What the hell do we -- why, why should they develop it? They can buy it. And now all of a sudden, they're going into Syria.","They go -- they've got so much money. They are a terrorist state. They're going into all of these different places. We're fighting them in Yemen. And yet we're making a deal with them. So why don't you say, hey, Yemen out. Our prisoners I want them back. I want them back. I don't want them over there. I want them back.","And all we have to do, very simple. It's if you have the right messenger. I'm the right messenger. You know, I've gotten to a point where I have to be braggadocios, it's terrible, right? Because I can't be so nice and say we can all do a wonderful job. People can't do this kind of stuff. For instance the wall, I said no, no, I said I guarantee you that we're going to build a wall.","It's going to be a real wall. We're going to have people come through but they're going to come through legally or they're going to come through with visas which is the same thing. If we need them. And, and we want people to come through. I want people to come through. I don't want to say no. But we have at least 11 million, you know the scariest and nobody has any idea how many, you know we've been hearing that number for years like 11 million, 11 million.","We have no idea. I spoke to one of the top people, they had no idea. Might be 5 million, might also be 32 million, nobody -- could be 50, where is he? Stand up. He might be close to anybody else, he probably is but we have to get them out. We have to -- look it's harsh, Dwight Eisenhower. We all like Dwight, right?","Remember the expression, right? Dwight, I go remember this time he got elected, I like Ike. How can he be bad? All right. And I think he was a nicer General than MacArthur and Patton and I like Ike as a President. But I loved Patton and I love General MacArthur. I love them. Now, we're going to find yourself a Patton and we're going to find ourselves -- because we have a lot of smart guys in our military and women.","We're going to find ourselves a Patton. Yeah, right here. I'll be the Patton. But we're going to find a Patton and we're going to find a MacArthur and I'm really good at that. We're going to find great people because and I've told this story, where I watch these Generals go on television.","They shouldn't be on television. They shouldn't be talking you know. They shouldn't be talking. They should be doing. And they asked a certain General, I'm not going to insult them, it was like a month and a half ago on our show, a talk show. I said here's General so-and-so, one of the top, top, top people.","I could even say the top. So what's he doing in television? And he's saying, well, ISIS is very tough. You know they spread out, by the way, they took the oil that I said take. Remember I said take the oil? Always. Take the oil. They're being funded by the oil that I said take. I don't want their damn oil.","But you know what? It turned out to be another benefit of having it. Take the oil. And we didn't do it. We shouldn't have been in Iraq in the first place and I said that in 2003. We shouldn't have been there. We totally destabilized the Middle East. We totally blew it. But we were there. Then Obama announces because he's so predictable, we are leaving on a certain date in a year, right?","I couldn't believe it. I'm sitting there saying, did he really say that? He said we will have all troops out by a certain day, right? Did he say that? And I said no, no, tell me please because I'm sort of a natural. Like things like I'm a very smart guy but I know a lot of smart guys wouldn't pick that up. I pick it up. I say oh, you know another one I got high marks on from every poll?","Military. They think I'll be the best in the military because they say it's -- I will be -- you know I always say, I'll be the greatest jobs President that God ever created. I will. But everybody knows that especially God, everybody knows that. But you know what I'll be? I'll be great at the military. I'll be so good and I'll know when and I'll build our military so strong, so tough, so incredible.","Nobody's going to mess around. We're never going to have to use it. We're never going to have to use it. And I'm going to take care of our vets. Believe me. They're our greatest people and our vets are not being treated as well as illegal immigrants. I'm going to take care of our vet, so go back so, the word is unpredictable.","I made a business deal a year ago and a guy, oh, I beat him so badly. It was so beautiful. It's a beautiful thing it's like a picture. For me, it's like a picture. That's my own problem I guess. But to me, it's like a painting when you can do something like that. So I made this deal and it was great. And they call, they did a story on me recently, and it was a nice story.","And I said oh, I hope they don't call this guy. They end up calling this guy. What do you think about Trump? And he said but in a respectful way, he said he won because he was so damn unpredictable. We didn't know what the hell he was going to do. That's a positive. That's a positive. I mean if you're a poker player and you're predictable you're not going home with much money, OK? But it was really I said that's not nice what he said.","First I said that's not nice. I'm unpredict -- then I said wait a minute, he meant that as a compliment. And I called him, I said What did you mean by that? He said I think that's the greatest compliment I can pay. We could not figure you out. You came at us from 15 different angles. So with Obama when he announces that we're leaving Iraq on a certain date.","We shouldn't have been there. But once you announce, the bad guys, remember they said the surge worked. Do you know why the surge worked? You know why? Because the bad guys all moved back. They said hey, what do we have to get killed for? These people don't mind being killed. Can you believe it? But they say we don't have to, let's not.","So they move back and they say, hey, they're leaving and what -- what was the date? Do you remember the date? Specific date to the day. We will have all the troops out. I am a great President. So the bad guys, meaning the opponents, whatever you want to call them. They just said oh, they're leaving in a year, they're going to have all the troops out.","Let's go back. What do we have to be shot at for the next year? And what do we have to do? Because if we do well, maybe he'll change his mind and say, so let's let him think he had this great victory with the surge, right? The surge worked, didn't work. What happened is everybody pulled back. They said let's wait.","Now, we leave because of a lack of leadership, we leave and boom, it comes apart. That's what happened. That was the surge. Everybody talked so much, oh, the surge was so great. The surge was great because everybody knew, they knew what was happening. They knew it was going to happen. They knew we were leaving.","Even through Bush, I mean honestly, they knew we were leaving. We were fed up. So they pull back and they say let's get them out. Everybody wanted to leave. Now, I would have done it differently. Even if I wanted to leave and I might or might not. I won't even say. People say, Mr. Trump, what's your attitude on ISIS?","When will you attack them? When? I say you know, I don't want it -- I have a real chance of winning. I don't really want to tell you what my attitude. I don't -- I want them to guess. I don't really want to tell you. I mean the one bad thing about our system, we have a system that's got flaws, let's face it. Hey, look at our leadership.","It's got flaws. But you know the one bad thing? When I give that answer, they say, although some people, I see it here. Some people say we love that, we love that. But when they give that answer, people say oh, Trump doesn't know. He doesn't know. He didn't give an answer as to exactly what he's going to do. Exactly.","What is he going to do? And I know exactly what I'm going to do. And eventually, after I was asked a question by 10 different reporters, all of whom are here tonight by the way, I said you know, here's the problem. If I don't give the answer I'm not going to win. Because they write so incredibly negatively.","So if I don't give the answer. I'm not going to win. They're going to say Trump wouldn't give us the answer. They don't know its unpredictability. They don't know its strategy. And I said it for a period of time like a month, I would say, I don't want to tell you because I actually have a chance. Because from the time I announced, I've been at the top of the polls, almost at the top -- you know we're doing well.","Iowa will you get your numbers up, please. Hey, when you get these numbers up, I promise you I will do such a good job. First of all, I am a great Christian and I am. I am. Remember that. And I do well with the Evangelicals. But the Evangelicals left me down a little bit this list but I don't know what I did.","But I am a great Christian. I'm a believer and I believe in the Bible and I even brought my Bible a month ago to a group signed by my mother, Mary and with the address and the date. I won't tell you what date it was because you popped -- possibly you think I'm younger than that. But she didn't want anybody taking my Bible because that was very important to her.","So it has the -- I was so cute. She has the address, has to date but I said to myself. You know, so by the way, before I forget, will you get the numbers up, Iowa, please? This is ridiculous. I mean, what is my competition? In all fairness, in all fair -- what, what is my competition? Do you think these guys -- I'm not going to say, Carson.","I'm not going to say Rubio who really is way down. I mean, I am second it's not like terrible. But I don't like being sec -- second is terrible to me. But, but do you think that Ben is going to beat -- go to China? These guys are fierce? Like they come into your office -- I made many deals with China. I've had great victories in terms of deals with China.","They come into your office there's no hello, how are you? It's a wonderful day. It's been -- they come in. We want deal. There's no games. I do this for a living. I'm really good at it, folks, really good. And you know, when you talk about energy, I'll tell you one thing everybody agrees. Ooh, do I have energy, ooh, I toss and turn thinking about how I'm going to make the best deal for you, folks.","I'll be tossing and turning. I will be tossing and turning. You're going to have so many deals that are so good for you. We're going to have numbers that are going to be so good. I always joke. You may get tired of it but then I always take that back because nobody gets tired of winning. We don't win anymore.","You know, think about it. Do we win at all, ever? We lose with the military, ISIS beats us, everybody. We lose with trade. When are we going to come back and say we beat China on a deal? When are we going to come back, we beat Japan? Do you know that everybody said oh, Japan, they have so power over us. They have so much power because we owe them $1.5 trillion, and they send all those cars and we don't have -- they have no power.","If we ever say listen, if you're not going to treat us fairly, we don't want your cars anymore. They go out of business, folks. They're gone. The same thing with China. China is not even doing that well but they just lowered, they just devalued their currency, the biggest in two decades. And the reason they did it, they could never thought, but we have so many other problems.","That they felt. Oh wow, we can get away with this, and it's going to make it impossible. Did you see the results the other day of Caterpillar Tractor? Horrible because they're not getting stuff out. Because everybody, Japan and China, in particular, is devaluing their currency. That's the number one weapon and this stupid trade deal that we're making doesn't even cover it. That's their number one weapon and the trade deal that we're making doesn't cover.","So I only say this, and you know what people might say, it's terrible. He's a terrible person, a terrible human being, he should -- but I didn't vote for him anyway. OK. That's fine. I'm actually a nice person. I only say this, nobody can do this stuff better than me, and I know all the guys I'm running against.","They're wonderful people and some of them I really like but who cares? I was talking to one of the candidates the other day. I was talking about corporate inversions and they didn't even know what the hell I was talking -- they had no idea. It's not their thing. And unless we stop all of the things that are going with other countries and unless we make great trade deals, we're being eaten alive.","That's why when you look at the phony numbers, we have 100 million people in our workforce that aren't working. Our real unemployment rate is probably 30%. It's not 5.3% that was done for politicians so they look good. It's not 5.3%. How can you have 5.3% when you have 100 million people. You look for a job, If that young guy that handsome young guy with the red hair right there, if he comes out and looks for a job, that's right, I'm talking about you.","His, his mom is very happy. But if he comes out and he goes into the workforce and he looks for a job and he goes to college and all he does well and then he can't get a job and when he gives up because at some point, after months, you give up. They essentially consider you employed. It's the most ridiculous thing.","We have a tremendous, tens of millions of people in that position. They can't find jobs. They're good people. They want to work. They can't but it's not reflected in the real numbers because the politicians want to look good. So let me just -- before we take some questions. I'm going to talk about something I never really talked about on stage but we should talk about it. It's called Super PACs.","It's one of the great scams of all time. It's one of the great scams. So we sent out, I think, I had -- it's not me, people set him up. And I don't know, maybe they're setting up for my benefit. Let's take me, OK? Sees me, likes me, sets up a super PAC. I don't talk to him. I don't do anything, but we -- I think we had either nine or five or 11. We don't even know.","They're all over the place. Trump, Trump. One of them called it The Art of the Deal PAC, after the book. They have all these PACs. And the money comes in. What do they do with the money? I don't know. And we aren't supposed to call them or anything. OK. So we wrote a letter, a legal letter to, I think, either nine or 11 last week saying we don't want the money.","Send it back. Because I don't -- again, what do they do with it? If some guy that's having a hard time, all of a sudden there's $2 million sitting in the super PAC. Do you think he's going to take ads for Trump? Maybe. And maybe not. So we sent them money back. It's a scam. Super PACs, a scam. It's a disgrace that we have.","A disgrace. And -- and I'll tell you, you know, I read a number with -- with as an example, Ben. Ben is paying $0.70 to almost $0.80 on the dollar to raise money. So when you read he has all this money. He's paying a lot of money and that's not reflected yet. So when you hear they raised $20 million. They're paying -- now think of it, who pays?","The number I actually heard was $0.79. But you know, these guys will check-up. So I'm telling you, it may be off but you all know it's a lot. I think they said $0.79 on the dollar. Think of it, to raise the money, they take $0.79 before they get to use the money for the -- what it's supposed to be. Someone is making a fortune.","I know in Romney's campaign a couple of guys walked away with millions and millions of dollars, millions. He became rich raising money. It's better than being a real estate broker for the people in real estate brokers, they take these massive percentages of the money they raise. It's a scam. It's a scam.","Now in Ben's case, his super PAC is running Iowa. And let me tell you, the people that are running that super PAC, even if it comes in in small donations, those are the real bosses. Those are the bosses. In the case of Jeb Bush, you're not supposed to deal with your super PAC, right? So it was in the Wall Street Journal the other day.","He has a super PAC fundraiser or something, in a hotel. And right next to it he had his campaign. Ballrooms, did you read that? Two ballrooms, one here, one here, right next to each other, by coincidence, of course. There are not supposed to be coordination. There are not supposed to be talk. They're right next to each other.","And that's nothing compared to what some of them are doing. It's a scam. And it should be stopped. And it's unfair to somebody like me that is spending my own money. And what happened, and I haven't talked about this before, but I mean, I'm seeing what's going on. It's horrible what's going on. What happened is last time when they had the super PACs, I actually think that was sort of a wall.","You know, they call it the wall. And this is a wall, too. It won't be as good as the wall I'm going to build but there's a wall. But -- but there was a wall and they didn't deal. I mean, even though like Bush has a friend of his running a Super PAC, I'm sure they never talk. I'm sure. What do you think the chances are that they talk?","100% or 99%. 100%. I'd say 100%. I'd say 100%. Only a foolish person would say 99%, but whatever. They're not supposed to. But they put a friend in there. They put other people in there. They put whoever. And that's the way it works. And in some cases, I hear in Ben's case, I hear in other cases, they're literally running.","I mean, had Walker done this, in all fairness, because he had money on a super PAC but he had no money in his campaign. And he was unable to figure out this is what they're all doing. That's why he's out of the race. Because you couldn't figure it out. But the whole thing with Super PACs is a horrible, horrible scam.","So I sent letters last week to as many as we could find. They're all over the place. We want you to close a super PAC. We want nothing to do with it. We don't want to get advertisers. We don't want any of the money. Go home and ideally give the money back. They don't even have to give the money back. It's from what I understand.","They never take -- they can keep it. They'll probably if they actually raise money for me, they'll say, what a horrible thing he just said. I think we're going to support somebody else, they could do that. But the super PACs have total control over the people running for office. Total nothing over me. Nothing.","I feel -- I feel it's very unfair. I mean, I feel it's a very unfair situation. If they want, they could have full disclosure and everything else. Let the candidates get everything. But what are they doing with this whole thing? And I think it makes dishonest people out of people that might be honest. But the super PACs are controlling your candidates, some more than others.","Some are unbelievable. And what the press should really do is take a look at how much money is left. When you read that Ben raised $1, how much is left after he pays all of the consultants and all of these people? How much is left to spend in the campaign? You'll be amazed. I mean, it's a little. Bush, the same thing and I'll go over -- there are other names.","I know every one of them. But it's -- it's a horrible thing that's taking place. And again, last cycle, at least they went through the motions. Now they're not even going through the motions. They're not even gone through. And just remember, when I have to negotiate with companies to keep them in this country so they build jobs here and they build their plants here and their factories here, and they do all of the things here.","When I have to do that, you know, John Deere, I've paid them tens of millions of dollars. You can even check. I said to John Deere, I wanted an endorsement. I don't know if they're giving me endorsement. I'll tell you if they don't, they're not so smart. You know, I guarantee no other -- no other person gave John Deere, I mean, I bought probably more than $10 million worth of John Deere.","I love it. You know why? Iowa, Iowa. I love it. I love it. I like -- I love it. When we can, and it's -- by the way, it's a great company. It's a great company. But I buy a lot of stuff from John Deere because I have a lot of big developments that really require John Deere-type equipment. I don't have to buy from them, I could buy from others but I want to steer it to them when I can.","But we have to do something to clean up this political mess because it's crooked stuff. It's crooked stuff. And it's got to stop and it's very unfair to people that go out and do it the way you're supposed to do it, including me where I put up my -- I think I'm the only one -- I know I'm the only one that self-fund.","I'm the only one I'm putting up my own money. Other than I always preface it people write into donaldjtrump.com or whatever. And they send me checks like $20. I keep saying about the woman for $7.50, $50, $100 because if you say -- I don't want their money. But if you send it back, it's totally insulting.","I mean, they always write letters, too. They write these beautiful letters. It's, Mr. Trump, I can't afford much but -- and I know you don't need it, but I'm sending in $50 because it's so important what you're saying about the country and it's beautiful. I mean, I've seen such beautiful letters. And if I sent it back, there is no letter I can write that's not going to be insulting to those people, really.","Dear, Mr. so-and-so or Mrs. so-and-so, I don't need your money and thanks a lot. But we're going to do it ourselves. It's like if I got that back, I'd say, who the hell does he think he is? So we take that. And it's -- it's something that I think is important. So I always preface it by saying I don't consider that funding.","But I'm self-funding my campaign, and I'm getting ready to put up millions, millions. Something I'm very proud of that I think is great. And it's been really great. It hasn't been gotten very much publicity, hasn't gotten much publicity, but I have spent less money than any other candidate, OK? By far, I think.","I don't know, probably a couple of guys have nothing. So they just go around from -- but, but I was told I spent a less. And I had the best result because in most polls, I'm number one. Now until Iowa came along, I said every poll, and then Iowa -- what the hell are you people doing to me? You know, you know I'm telling you, they said why don't you skip Iowa?","They've told me that. Everybody said skip Iowa. All of the political geniuses, a man just interviewed me back there, he's a great reporter. He's actually a great reporter. Chris, if he writes a bad story, I won't say that, bud. Then I -- but he is, he's a great reporter. And he said, would you ever think of maybe skipping Iowa, going right to, you know, right to New Hampshire.","And then you go to South Carolina where I'm -- I'm leading by massive, you know, you've got to see the rallies we have, they're incredible. But you go to New Hampshire, you go to South Carolina, you go to Nevada, you do the SCC. And skip -- I say, I can't do that because I have such an unbelievable relationship with the people from Iowa that I think we're going to win.","I really do. I believe it, I believe it. And I don't want to skip Iowa. I think we're going to do well. I think we're going to do great with Evangelicals. I think a lot of things are going to come out over the next period of time that are not going to be so good for opponents, honestly. And I think I'm going to do great with the Evangelicals because I am the real deal.","I will tell you that I'm the real deal. So I told these political pros, you know, I hate to say it but the last long number of elections on the Republican circuit, the person that won Iowa did not get the nomination, OK? I want to take away some of your mustard. You understand that. So could we do -- and please do me a favor, let me win, Iowa.","And then I'm going to win. I'm going to win. I'm telling you, we're going to win New Hampshire and we're going to win -- we're going to win South Carolina. A great poll just came out of North Carolina just a little while, PPP poll, it was great. Some of you saw that, but great poll. But we're going to go on. We're going to win.","We're going to win. And they actually -- one of the, one of the pundits, because you have some smart pundits and some very, very dumb pundits, a lot of the pundits that said he'll never run. He's not going to run, not going to run now, they're still trying to recover. But one of the very smart ones said if Trump wins Iowa, it's over.","It's interesting because it will go right through. Because everywhere else, it's so great. And I thought it was good here. Come on. OK. So that's the end of that. But I want to tell you, will you -- I refuse to say get your asses in gear. I will not say that. I will not say it. I will not say it because I don't want to use anything that's even a little bit off.","So will you please do me a favor and work with my people and go out on February 1st and vote and give us a victory? And -- and if I win, Iowa, we're going to run the whole table. And we are going to make such great deals and we're going to have such a great military. And we're going to take care of our healthcare without that crazy Obamacare that's a nightmare.","So I'm sticking with you people. I'm going to spend money here. I'm going to have -- I have a great team over here. And I will tell you, I'm going to spend a lot of time here and I really want to win Iowa. And I think we should. And it's so important. And you know, it's about time that Iowa could have a victory and let that person go into a total victory, OK? Not like over the last, right?","OK. So I love you all. I mean, we're having fun but I love you. But I do mean it. I'm going to stay here. We're going to work really hard. When I heard the poll today they said, what are you going to do? I said I'm going to work harder in Iowa. I'm not leaving Iowa. I'm not leaving my Iowa. Now if lose Iowa, I will never speak to you people again, that I could do. OK. Let's do a couple of questions, right?","God. Where's your mic? Where's that mic? Nice questions. Vicious ques -- I don't care. You can ask me anything you want. OK. Come on. You know Tana? Tana, Tana from The Apprentice.","Go ahead. Go ahead. How are you?","Yeah, it's a great question. You know, we have now -- we have now, I mean, and the numbers, they just came out. We have 50 million people in poverty in this country, 50 million. Now, you look like you're doing pretty well, in all fairness, but still, we have 50 million we. Have 46 million people and they're getting food stamps, 46 million.","Think of it, you know, we talk about how well we're doing. So we have 50 million, almost 50 million each between poverty, food stamps and it's got to end. One of the problems, we don't have enough jobs in this country. It's very simple. You know, it's so simple when you think about it. Our jobs have been taken away.","And I'll tell you what else, middle-income folks, their salaries haven't gone up in 12 years. People are making less wages now than they were 12 years ago. And other things have gone up. So they're really doing much worse than they were doing 12 years ago. But that's an amazing stat. That people -- and one of the reasons they say I'm doing so well because I let people know.","We're going to bring jobs back. We're going to bring industry and plants. We're going to bring it all back. And nobody else can say that we're going to bring it back because a lot of the folks in this room are doing worse than they did 12 years ago. And they're working. Then the other thing, you have a lot of part-time jobs.","I have some people that I know very well and they've had a job for 20 years in the same place. All of a sudden they're working part-time because of Obamacare, because from an accounting standpoint, it just works better. They love the owner. The stores and things, they love the owner, they think the owners are great.","But the owners forced them to make part-time -- they have part-time jobs. They work all their life, they have a wonderful company that they're working for, and now all of a sudden they're cut into part-time jobs because of Obamacare. Because of the rulings of Obamacare. And you all know what I'm talking about.","So they end up being part-time workers, and they don't want to be part-time workers. They don't even like the psychology of being called a part-time worker. And we're not going to have that stuff anymore. We're not going to have it anymore. We're going to have real jobs and the numbers are going to go up, believe me. The numbers are right now worse than 12 years ago and that's a shame.","Go ahead. Another question.","Hey, Todd.","These are our greatest people the Wounded Warriors. These are the greatest, the best. Great, Todd.","Is that your daughter?","Wow. She's so beautiful. Wife? Wow, beautiful. What a family. Good. OK. I want to come to show -- I got to say hello to Todd. Look at this guy.","What a look. Hold it. Wait.","Is the VA not doing the job?","You're going to write out your card.","You're going to write out your card. And I am going to put pressure on the VA like you won't believe. Let's see if we can get that, right? Look how beautiful -- look how beautiful. OK. So we're going to have, you know. Hey, I tell you what, as President, I can guarantee it. As Trump, I can say I'll probably be able to pull it off anyway.","Because -- because they know it won't stop. It'll be easier to take Todd and just say, look, we're going to work with you Todd, OK? So will you get me that number and everything and we'll make sure that everything get -- and somebody else, who else over here? You had problems with the VA also, huh? Terrible?","I hear only -- I just hear terrible. And we're going to solve that problem. You know, it can be solved because the waits now for the VA are longer than they've ever been. Oh, it's nice to see you people back there. It's about time. What am I doing now? Why didn't you give me this? But the waits now are worse than they've ever been.","Thousands of people dying waiting for a doctor, OK, dying. And you find the same thing. You say -- you have to use your own because they won't do anything. So we're going to take care of our vets and we're going to take care of the VA and it's going to be one of the things we're going to be releasing pretty soon.","But one of the things we're going to do with the VA, we have a lot of hospitals that aren't doing any business. We have a lot of private doctors that could do more business. We're losing a lot of our doctors because of Obamacare. They're retiring. They're leaving. One of them, a friend of mine, said I have more nurses working for me now than ever before but I have more accountants.","And the end result is a disaster, he's getting out of the business. He's got nurses but he's got more accountants and he has dirt because the paperwork is so crazy. So one of the things we're going to do is, if Todd or if you or if somebody has problems because of the waits because the waits are unbelievable, five, six, seven days sometimes.","They're going to go to a private doctor, they're going to go to a private hospital or a public hospital that's in the area. And we're going to pay for that and it's going to cost less money. It's going to cost less money than the system we have now. And you're going to end up getting much better care. It's going to cost less and you get better care.","So, anyway, Todd, we're going to take -- great family. Great.","So the Keystone Pipeline, first of all, I'd approve it because it's thousands of jobs, OK? I would approve it so fast, so fast. And Hillary should have approved it. You know, Hillary wanted to approve it but she's been dragged so far left that she's, you know, forget it. It's a disaster. So I would approve it. But with that being said, I may want to make a better deal.","Because you know what, we're bringing oil from Canada, right? I may say I want 10%. We'll be going to approve it. But I want 10%, 15% because the truth is that the Keystone Pipeline was better a while ago than it is now because we have so much, because of new technology, we have so much energy underneath our own feet.","With the fracking and all of the other things that have emerged over the last five years. We have so much energy and it's great stuff. We have really great quality, higher than in Canada. You know they have the tar sands which is a problem for them. Very expensive to get it out. We have great stuff. So I would approve it because I love the jobs of building it. I love the jobs of building it, but I may just say maybe we should get 10%, 15%, maybe 20% as that oil flows through our land.","You know, maybe we should do that. So I'm going to look into that. But when I approve it, I'll tell you what, when I approve it, it'll be a great deal for the United States. It won't be like -- because right now what we're doing is we're approving it. We're not really getting anything. They're putting it underground and that's good.","And that's actually good environmentally, better than having trucks going down the roads, everything else. But that's good environmentally. But we're not getting, we're not getting anything much for it. When I get finished with the Keystone, they'll be happy. And we'll be happy, OK? So it'll be good. OK. Question, Tana?","Yeah, go ahead, Tana.","I love this people with the shirt. Look at those beautiful shirts. Look, look how handsome he is with that. Looks like he's 20 years old now. OK. Go ahead.","Well, I'll tell you, in all fairness, Ben Carson said yesterday or the other day that he wants to abolish Medicare, OK? And you know what a disaster that is. Now I'm sure at some point he'll take it back. But he said he wants to abolish Medicare. And one thing, people do like their Medicare. They do like it. And you are bringing up a point that I've heard before and we're going to be looking at a lot of different things but we're going to save Social Security, we're going to save Medicare and that's the way it is, OK? We're not abolishing like other people.","OK. Go ahead. Next.","Good point, by the way.","Hello.","OK. It's a lot of people. But you know what, it's costing us $200 billion a year, immigration in this country right now. And Dwight Eisenhower was going to say, he moved 1.5 million people in the 1950s, early 1950s, moved them out. We had tremendous illegal immigration problems. Dwight Eisenhower, nice guy, he moved 1.5 million people out of the United States.","And you know what happened? He moved them right across the border and they came back, and they moved him again and they came back. They moved him a third time, they came right back. And then, you know, they were tougher in those days. They moved them all the way south, all the way south, and they didn't come back.","Now we have to do it. We have no choice. We either have a country or we don't. And I want them to come back but I want them to come back with papers. I want them to come back legally. I want them to come back, the good ones, the good ones, but only the good ones. We got some bad ones, you remember the heat I took with illegal immigration?","Remember that heat? For two weeks Rush Limbaugh said he has received more incoming than any human being I've ever seen. And then he doubled down. He thought it was pretty good and he's good, really good. But you know what, I took a lot of heat. And then you had Kate in San Francisco, killed, shot in the back.","And so many others. And people started looking. And let me tell you, we have some wonderful people over here and they're here illegally but they're wonderful people, OK? And we'll try to get them back really soon and we'll do it through a legal process. But we also have some really bad gang members. You know, some of the gangs in L.A., they're made up of illegal immigrants.","And we have unbelievable police forces that don't get the respect that they should get. They don't get it. I mean, what they go through, a tumble, if they're afraid to talk to anybody, they don't want to lose their job, they don't want to lose their pension. They can't talk. Now let me just tell you something, you can always have bad apples.","In this room, we have a couple of bad apples, OK? I don't know who they are, where they are, but you do. Probably mostly back there in the press. But the police do an unbelievable job and they know the gangs. You go to L.A., the L.A. cops, you go to Chicago, Chicago cops. These people are amazing people.","If they would be allowed to do their job but they're not allowed to do their job. And we're going to get the bad ones out of here so fast and they're not coming back. And I don't want to put them in our jails because I don't want to -- I don't want to subsidize these various countries where they come from for the next 45 years.","I don't want them in our jails. We have hundreds of thousands right now in our jails. I don't want them in our jails. I heard a couple of these candidates saying, well, they have this -- uh, they don't know. Uh, they're such babies. But you know what, they're talking about putting them in jail. Well, I don't want it. Our jails are over-brimming.","I want to use our jails for people that are supposed to be there, OK? And I don't want to put these really bad dudes, I mean, they are bad. I don't want to have to pay for them for the next 45 years. OK? And we're going to deal very humanely with the good people in there, mostly good people. But we got some real bad ones and they're out there.","Your head will spin probably. Somebody said the other day what's the first thing you're going to do? Well, we're going to work immediately on repealing Obamacare. I'm going to -- you know, the one good thing about executive orders, the one good thing -- you know, Obama signed an executive order where everybody just come in, come in. We have great border patrol people.","I got to know them a couple of months ago when I went down to Texas, to the border. They're great people. They're not allowed to do their job. They stand there and watch people walk right in front of them smiling at them. They want to do their job. They're not allowed to. So the executive order that President Obama signed, the one good thing about an executive order, in the first minute in office I will counter-sign and revoke those executive orders.","Would be only good. It's actually the only good thing about an executive order, is the new President can just do a signature and that's the end of that. So we're going to clean up our border. We're going to make it fantastic. We're going to be proud to be a country again and a lot of good things are going to happen.","OK. Do one or two more, Tana, and we're up.","We will support Israel 1,000%. Israel feels so left alone and I know Bibi and I know a lot of -- a lot of my friends are from Israel, and they feel so left out. And so many people say, you know, I have so many Jewish friends where they say why did I support Obama? I think he's the worst thing that's ever happened to Israel.","And we will support Israel beyond anything they've ever had before. OK? That's an easy one. That's the easiest question of the night, OK? Go ahead, Tana.","OK. Hello.","It is. It's more. But -- the wall is a big factor at 60%, 70%. The drugs are a great question. We're going to stop drugs. Look, I told you before, Mexico $45 billion to $50 billion, that's not including the drugs. The drugs that are coming across the border are beyond belief. Did you see the picture last week where they had a little wall this big, and they built a ramp for trucks to go over with drugs?","Did you see the picture? They think we're playing games. And Mexico is not helping us. Mexico's not helping. You know, if you want to become a citizen of Mexico -- I love the Mexican people, I have many Mexican people and Hispanics working for me. In Nevada, I'm number one. I'm rated number one in the polls with the Hispanics.","Everyone's shocked because the Hispanics that are here legally, those people, they want me -- they know I'm going to bring jobs and everything else. They don't want people pouring in. But I will tell you, Mexico has got to help us. You know, if you want to become a citizen of Mexico, if Todd wants to become a -- you can't get a more beautiful family.","If any of us -- if me, if I want to become a citizen of Mexico. Well, me, I know they won't take. OK. I was going to say I'm pretty good at getting in. This is what I mean. Do you know it's one of the hardest countries in the world to become a citizen of and yet people pour right through into us, into us. They call us the dumb Americans.","That's what they call us because of our leaders. They call us the dumb Americans. If you want to become a citizen of Mexico you could take the best person in this room, the most qualified, you're not going to do it. They don't do that. And if you're there illegally and if you overstay you're bound, you're not going to be there illegally.","But if you have a pass for two weeks and you overstay your bound, you have cops waiting for you. They have police that say, you know, you have one day left. I hear it's unbelievable. I'm impressed actually. Because to a certain extent, that's the way it's supposed to be. But if you want to become a citizen of Mexico, it's impossible.","They don't have anchor babies in Mexico. You're born a baby in Mexico. It's like bye-bye. Here, you're born over here, oh, congratulations. We're taking care of the baby for 85 years. Not going to happen, it's not going to happen. No, it's not going to happen. And by the way -- by the way, this is important.","I sort of lucked into this one. The 14th Amendment it says right there. You know, everybody said you have to go through a whole process. It'll take many years. You have to go through every state. You have to do another amendment, it's wrong. 14th Amendment covers it. And some of the best legal minds knows that Trump is right.","I said, what, I am? I didn't know. I lucked into it. Every once in a while you're lucky. The fact is somebody comes in illegally. And they have a baby. We're not responsible. Now we may have a court case, we're going to win it. And a simple act of Congress gets rid of it. And a lot of people didn't know that, OK? And the reason I said it can't be possible because nobody could be foolish enough to allow a thing like that.","How could it be possible? And we're one of the only countries where that takes place. And honestly, I used Mexico as an example because they're so tough. If that happens in Mexico they don't even know what you're talking about. What are you talking about? But with us, no good. Not going to happen anymore.","OK. Let's do one more question. Make it vicious, violent, make it crazy.","OK. That would make it nice. Go ahead. If I don't like it, we'll do another one. You know, you always like to leave on a good -- hey, did you ever see like Elton. He does a final and the song is so great and everyone's gone crazy. And then they're screaming more or more. And Elton will come back and he'll do three more.","And the less songs, Obama. And you walk out like this. You always like to leave in a high. So if it's a bad question, we'll do another one. OK. Let's go.","Well, say it again?","Well, you know, the amazing thing is that the politicians in this country live by a whole different standard when it comes to healthcare when it comes to everything they have, including what you just said in terms of social security. Our politicians live by a different standard. And I think that shouldn't happen.","And some of them tried to do it.","They live by a different standard. And that's not going to happen. Everybody's going to live by the same standard. They're going to have the same standard as the poorest person in this room. That's the way it's going to be. I do want more questions. Tana, do one more question.","Go ahead, Tana.","By the way, isn't Tana great?","She's great.","You know who's also great? Shawn Johnson, right? I love Shawn. Shawn Johnson is great. Go ahead.","OK. It's a good question. But it's -- you know, if I answer that question we'd have a big, big story. You know that. You know, I'll tell you, it is a question that says a lot. I know a lot of good people. A couple of people on the stage that I really respect and I've gotten to respect, but the truth is, too early.","I'd like to get things done first. We've got to close the deal. I don't want to think about it. There are a lot of good people, there a lot of good people. We got to close the deal. We got to get it done. And to get it done, I want Iowa. So good luck, everybody. Thank you very much. I love you. I love you.","Thank you. And we'll be back. Thank you. Thank you. Thank you, everybody."],"text":" We've had some amazing results and they continue to come in, get a little shakeup in Iowa. I don't know what's going on. Somebody said are you going straight to New Hampshire? Now, I love New Hampshire. We've got great numbers 38 to 12. That's good. But we fell a little behind in Iowa and some people are saying how can it be? And I come out, I was just telling a group. We have the biggest crowds. We have the most enthusiastic crowds. Everybody said and it's very true. I mean look at this. No, but somebody else would come that have like 50 people and they wouldn't need this room. Believe me. But everybody said without question in every poll, this isn't just here, that the people that are with Trump are with Trump. They don't go anywhere, they're staying. It's true. I see it. I see it. And we've seen it. You know a couple of times I say, well, that could be the end. Then they do something, I'm 10 points up. It's the craziest thing, right? But we'll take it. But they say the people are with -- we have the most loyal people by far and everybody says it. The other thing they say is for leadership, number one, very important, right? Don't you think? Leadership. I mean when leadership is number one, they say on the economy without question, number one, and by a lot. So you know it's, it's great. I thought I'd talk a little bit and I want to take some questions. You know we could do a little question and answer, right? We have all these cameras going back here. And you know it's always tough when you're on live television all the time. Look, we have 10 topics, right? How many topics, 10? How many different ways can you talk about the 10 topics? The bottom line is we want results. We want to get it done. But when you're on live television all the time, all those people back there, and the cameras are on, and then you're talking about immigration, and you're talking about the wall because we can have a wall and we get to stop illegal immigration. But we talk about trade and we talk about repealing Obamacare. We talk about all the things that we talk about, but you know, you have these points and we can talk about them in different forms, in different ways, and give different examples. But in the end, it's really about results, isn't it? Right. It's really about results. And you can only talk about the same subjects on live television in so many different ways. I talk about the industry. I talk about commerce. I talk about how we're losing our jobs to all of these different countries. And I give different examples but it's still going to be a certain number of subjects. I talk about Second Amendment. I talk about the 14th Amendment. We talk about Amendments. You know that Second Amendment, they want to take it away from you. They really want to do things and it's not going to happen. It's not going to happen, at least with me, it's not going to happen that I can tell you. So I said today, you know, we'll talk for a little while but I want to do some questions and answers. I want you people to excite me for a change is that, OK? I want to be excited. And so we're going to have some fun. So we're going to do that. A few things, I want to bring up a few new subjects too. So immigration, we're going to be doing a very strong number. It's killing us. It's killing us and it's bad for the economy, it's bad for -- all of this illegal immigration. And I have to tell you, legal you come in, and we're going to have a good time, and you're going to be there, and you're going to do great, and visas, maybe work, maybe there are cases where you need people in, and we'll do something. We're not going to hurt our economy in any way, shape or form. We're going to make our economy much, much stronger. But we're also going to get jobs for people that are here, people with us. They're -- we're going to get jobs. We're going to get jobs. But the illegal immigration, you know, I did this and I made my determination. I took a deep breath because I'll tell you what, it takes courage to say I'm going to run for President. It really does. Especially in my case where I have a great business and I love my business. I love doing it. I may never even see -- I mean, I own some of the great properties in the world. Doral in Miami. I may never see it again. Turnberry. Thank you. I love you. Look at her. Turnberry in Scotland, one of the greatest home of the British Open and all that. I may never see it again. All of these incredible places that I have but more than that, it takes courage because when you do it, you're putting yourself out there beyond anything that anybody's done. And it even takes courage for a politician to do it. Now at some point, some of these guys have to leave. Don't we agree? It's getting ridiculous because like tomorrow night we're having a debate and I wish we had more time for the debate. I wish we had not, in terms of three hours, because who wants three hours? I -- you know and I could stand up for 20 hours if I had to but who wants to watch that long? Hillary's debate essentially lasted for an hour and a half and I was huh, it was, you couldn't watch it. You have Hillary against a socialist slash Communist and nobody knows him. And honestly, he's not going to win just so you understand. I mean, is all kidding you -- he's not going to win and neither is she. You're right. Long term. Well, she is being totally protected because in theory she shouldn't even be allowed to run. It's true. She's being protected. It's a tough game, it's a nasty game but she is being totally protected. But she's going to beat him and you still have one more of these guys. Oh, O'Malley, so he'll be out quickly, I guess. I don't know. What's he doing? What do they do when they have zero? We have -- they zero. And I wouldn't say it against our folks but they've treated me -- some of them, some of the zeroes have treated me so nastily, right? Because they want to start a controversy and they want to try and pick up some points. And you know what, I'm not even going to mention names. I usually do I love doing it. But everybody that's hit me so far has gone down, they've gone down, and they've gone down big league. But -- and a couple of the ones and zeroes, they're the ones that hit the hardest. I mean, they're like desperate people but they hit -- one of them has a zero with an arrow pointing to the left. That means less than zero and I don't understand. What does it mean? I assume it's a typo but maybe not. But when you look at the things that are happening with our country, the trade situation with not just China. I talk about China all the time because that's the main abuser. That's the biggest abuser. The numbers are astronomical, almost $400 billion a year in terms of imbalance. Think of it, $400 billion a year. And they send stuff over here but we can't send stuff over there. They tax us, big tax. A friend of mine can't get his stuff over there. The tax is so big. Big tax. Somebody bought an airplane in China, here. Can't get it over there. It's a spoiled guy, rich guy, bought a beautiful plane. Can't get it over there because the tax is so massive. That now he's selling it in this country because China won't let him have the plane and he has to pay a tax. I won't even tell you what the tax is. It's so astronomical that I don't even believe it myself. So I'm not going to say it because those guys will say, well, he was wrong. All I can tell you is, all I can tell you is, it's a massive tax like you don't buy planes here. Because if you do you won't be able to get them back in. And here we accept all of their products. So we have almost $400 billion trade imbalance with China. We have a $70 billion trade imbalance with Japan. We have a -- you know with all that's going on now in the South China Sea and you look, well, we have a destroyer. A relatively small ship over there. I don't know if I'd want to be the captain of that ship right now. But they're being sort of mocked and scorned and a lot of, lot of bad things can happen. But you know, we have an agreement with Japan, and I love Japan. I love China. I love all these people but their leaders are killing us. Because they're smarter, sharper, more cunning. The leaders of Mexico are killing us at the border and in trade. They've taken so many of our companies even Nabisco, my Oreos, they're taking Nabisco, right? I'm never eating Oreos, I tell it all the time. They had some Oreos before in the plane. I said I don't want to touch them. Bring them back. Are you allowed to bring them back? Bring them back, right? But I'm not happy. They're leaving Chicago and they're moving their big plant to Mexico. So when you see this happening we have to stop it. And I'm not going -- look, I'm not going to beat around the bush, and oh, let's talk and let's be nice, and let's save it. Nobody can do it like I do it. Nobody. Honestly, nobody. We can -- I'm not saying I'm perfect because I'm not perfect. Nobody's perfect but thank you. I love this guy, handsome guy. I like him, very good. Now, but nobody's perfect. But I'll tell you when it comes to that stuff. I'm really -- there's nobody better. Carl Icahn endorsed me the other day. He's one of the great traders, one of the great dealmakers, he says Trump, Trump. You know and he's not somebody that just do it. He wants somebody that knows what they're doing. He understands. You talk about corporate inversions and all of the things that are going on. Corporate inversions you know, many of the companies in this country have trillions of dollars accumulatively. They take $2.5 trillion overseas right now. They can't get it in and everybody agrees that we should bring it in. The Democrats and the Republicans. They've agreed for years. They can't make a deal because they have no leader. It's not like, oh gee, we disagree on Obamacare or we disagree on something else. Although I must tell you, many of the Democrats that I speak to, because I'm friendly with all of them. I'm friendly with like Republicans, I get along with everybody. You know, everyone said oh, you won't be a unifier. I'll be the greatest unifier of all. Why? Is Obama a unifier? But I will tell you, many of the Democrats that voted for Obamacare would never have done it now, and they were lied to 28 times, right? You can keep your doctor, keep your plan, keep you this, everything's going to be great. Turned out to be a total lie, 28 different times that they know of, and they wouldn't have done it. But when you look at what's happening with corporations and the highest tax -- we pay the highest tax anywhere in the world of any country but they have trillions of dollars overseas, and these are great companies in many cases, they have thousands of employees. They can't get their money back and the reason is bureaucracy. It's very hard and also a big reason, the tax is too high. They don't want to bring $1 million back and pay $300,000 or $350,000 tax. They'd rather leave it over there. And if they bring it back, they'll be using it to invest in our country. I mean a lot of good things will happen. I happen to believe it's more than $2.5 trillion. But here's the thing and I use it because it's so incredible. Here's the thing. It's not controversial. It's not like you have the Republicans here you -- everybody agrees. They've agreed you know that for two and a half, three years. They can't make a deal. And now what's happening, and you'll -- this will be the next great story is companies are leaving the United States to two reasons: lower taxes but also they get their money. They've got billions of dollars overseas. They're leaving our country in order to get their money and in order to pay lower tax. And you're talking about one company I know of. I don't know how much they've written about it but you're talking about 6,000 jobs. Just one company. You're talking about potentially thousands of companies and I say it, in the old days, they'd leave New York people would move down, and companies would move down to Florida or they'd moved to Texas or they'd leave New Jersey where taxes are quite high, and they'd move to another location, right? Now they leave our country and they go to other countries. That's what's happened in the world of the Internet and the world of very fast jets. It's a different world out there. And there's no loyalty. They're paid a lot of money to make a lot of money for their shareholders and some of them actually are foreign. They'd like to move back to these countries. They bring in executives that are from Ireland, from other places, and they don't mind. They have no loyalty to the United States. So my plan, my tax plan is something I'm very proud of. We're going to solve corporate inversion. I'll tell you what we will have that money back. If I get elected President that money will be back so fast your head will spin. Nobody else will be able to do it. Nobody. Honestly, nobody else even knows about it. The other candidates, most often don't even know about it. It's not, it's not their wheelhouse. OK, it's just not. It's not their thing. It's not their thing. Their thing is getting re-elected. That's what they're good at. They get re-elected and they make promises and they're all talk and they're no action. And it's say -- the same thing happens with these politicians. It's always the same. So we have so many different things and what I've done with our tax plan, which something I'm very proud of, we've brought it down into a few groups because right now you have to go out -- people that aren't doing well, go out and hire companies to help them with their tax plans. They'll pay $500, $1,000 because it's so complicated and we're going to make it nice and simple. And we're getting rid of carried interest which is something that a lot of rich, hedge fund guys love. But we're getting rid of it. They don't love me so much anymore. But I don't care and we're getting rid of a lot of things. So we get a nice simple tax return. Somebody said oh, why aren't -- why isn't everybody paying? You know 40%, a big percentage, will not pay any tax at all. People that are doing badly they said, well, I won't use the candidate's name, because I don't want to insult any candidates when they can't defend themselves, but they said we want everybody to pay at least something. And I said I agree. Here's the problem. From the standpoint of bookkeeping, from the standpoint of bureaucracy, you're talking about millions and millions of returns. You're talking about building the IRS even bigger and it's a, it's a monster. And I could cut it down way down. And the money that you're talking about is far less than the administrative costs. So I said I agree. Except for one thing, from a practical standpoint, it's too much. Most of these people are paying anyway. What I want to do is bring our jobs back from China. Bring our jobs back from Mexico. Bring fairness to our deals, as an example, with Japan. I was in Los Angeles, ships the biggest ships you've ever seen, cars are pouring off into this country made in Japan. We give them practically nothing. The balance is so bad, the imbalances is so bad. You say how -- and then we have all the strike. See what our people don't know and only somebody that wrote The Art of the deal or does this stuff, right? It's natural. It's like a great athlete like a Jack Nicklaus, he always was able to sink that putt, right? You know, he's just better. And you have athletes very few but there are some people that have a certain ability. A lot of people don't even know. We have all the power, we have all the power with China. You know, we owe right now, China and Japan equally, $1.5 trillion, think of this, trillion dollars, $1.5 trillion. So think of it. They take our business, in the case of Japan mostly cars, but they take our business. They take our jobs. Factories close down all over the place and we owe them money, right? It's a magic act for them not for us. For us it's a horror show. It's going to end. It's going to end. And people like Carl Icahn and people like the best nego -- I know the best negotiators in the world. Some of them I think are horrible people. I'll be honest with you. I don't care. Do you care if their horrible people? We want -- now Carl happens to be an actually a very nice guy. But he's a brilliant negotiator and a tough cookie and he's built a fortune. He doesn't want money. He doesn't want to say oh, give me $200,000 a year in government money. As I said, he wants to do it. He's proud to do it. He wants to help the country and it's so easy for him. For instance, if I said Carl, do me a favor. The trade deal we have with China is so unfair. We're losing $400 billion a year, Carl. Do me a favor. Make it fair. I don't have to give him a big speech. I don't have to give him a big speech. I mean I can tell you that within a very, very short period of time things will straighten out. I mean things straighten out. And it's going to be to our benefit. But think of it, if we're losing that kind of money, that imbalance. It's an imbalance. Some people would say that's not really a loss. It is a loss. If we have that kind of an imbalance and supposing you brought it back to zero or even if we lost $1 billion a year that's all a lot of money. Believe me, I couldn't sleep it. If I brought it to $100 billion a year. Get rid of me in four years all, right? But supposing we brought it back to $100 billion or we brought it back to zero. Do you know what that means for this country? Do you know the kind of money you're talking about? Then, jobs would start coming back. Lots of good things would happen. Lots of great things would happen. And maybe our babies, who have all these toys all over the place, maybe they'll have 75%, and maybe you'll like them better. Maybe, they'll be better and they'll be manufactured here. Whenever I order television sets, I order thousands and thousands of television sets a year for different jobs, and whenever I order them they all come from South Korea. They make all the tele -- other than Sony but Sony has sort of lost its way a little bit. But Sony is Japan. But South Korea, LG, Samsung, I don't get bids from America. I'd love to. I'd love to. George Wills said there's a company in South Carolina that makes television. I said where are they? I'd like to have a good name too, by the way, it's important. You know when somebody is paying you a fortune for a hotel room, it's nice to see a good name, right? Do we agree? Right? Well, it was a company in South Carolina but they don't really make them, they assemble them. In other words, the parts come in, they assemble them but much different. But I'd love it if we made them. But you take South Korea. We defend South Korea for essentially nothing. You have the maniac over North Korea that nobody ever talks about by the way. Now, he really has nuclear weapons and we don't talk about him. We made the worst deal ever made with Iran, right? The worst. No, no, these are the people that represent -- these people are incompetent or stupid. You know, somebody said you shouldn't say stupid, but it's true. It's stupid. I think. I mean I think. Unless I don't know, is there's something going on that we all don't know about? Think of it, point after point, we lost. We lost everything. We're giving them $150 billion. It's hard to believe. They're going to have all that -- they don't have to develop them. I tell somebody they don't have to develop nuclear they can buy it. What the hell do we -- why, why should they develop it? They can buy it. And now all of a sudden, they're going into Syria. They go -- they've got so much money. They are a terrorist state. They're going into all of these different places. We're fighting them in Yemen. And yet we're making a deal with them. So why don't you say, hey, Yemen out. Our prisoners I want them back. I want them back. I don't want them over there. I want them back. And all we have to do, very simple. It's if you have the right messenger. I'm the right messenger. You know, I've gotten to a point where I have to be braggadocios, it's terrible, right? Because I can't be so nice and say we can all do a wonderful job. People can't do this kind of stuff. For instance the wall, I said no, no, I said I guarantee you that we're going to build a wall. It's going to be a real wall. We're going to have people come through but they're going to come through legally or they're going to come through with visas which is the same thing. If we need them. And, and we want people to come through. I want people to come through. I don't want to say no. But we have at least 11 million, you know the scariest and nobody has any idea how many, you know we've been hearing that number for years like 11 million, 11 million. We have no idea. I spoke to one of the top people, they had no idea. Might be 5 million, might also be 32 million, nobody -- could be 50, where is he? Stand up. He might be close to anybody else, he probably is but we have to get them out. We have to -- look it's harsh, Dwight Eisenhower. We all like Dwight, right? Remember the expression, right? Dwight, I go remember this time he got elected, I like Ike. How can he be bad? All right. And I think he was a nicer General than MacArthur and Patton and I like Ike as a President. But I loved Patton and I love General MacArthur. I love them. Now, we're going to find yourself a Patton and we're going to find ourselves -- because we have a lot of smart guys in our military and women. We're going to find ourselves a Patton. Yeah, right here. I'll be the Patton. But we're going to find a Patton and we're going to find a MacArthur and I'm really good at that. We're going to find great people because and I've told this story, where I watch these Generals go on television. They shouldn't be on television. They shouldn't be talking you know. They shouldn't be talking. They should be doing. And they asked a certain General, I'm not going to insult them, it was like a month and a half ago on our show, a talk show. I said here's General so-and-so, one of the top, top, top people. I could even say the top. So what's he doing in television? And he's saying, well, ISIS is very tough. You know they spread out, by the way, they took the oil that I said take. Remember I said take the oil? Always. Take the oil. They're being funded by the oil that I said take. I don't want their damn oil. But you know what? It turned out to be another benefit of having it. Take the oil. And we didn't do it. We shouldn't have been in Iraq in the first place and I said that in 2003. We shouldn't have been there. We totally destabilized the Middle East. We totally blew it. But we were there. Then Obama announces because he's so predictable, we are leaving on a certain date in a year, right? I couldn't believe it. I'm sitting there saying, did he really say that? He said we will have all troops out by a certain day, right? Did he say that? And I said no, no, tell me please because I'm sort of a natural. Like things like I'm a very smart guy but I know a lot of smart guys wouldn't pick that up. I pick it up. I say oh, you know another one I got high marks on from every poll? Military. They think I'll be the best in the military because they say it's -- I will be -- you know I always say, I'll be the greatest jobs President that God ever created. I will. But everybody knows that especially God, everybody knows that. But you know what I'll be? I'll be great at the military. I'll be so good and I'll know when and I'll build our military so strong, so tough, so incredible. Nobody's going to mess around. We're never going to have to use it. We're never going to have to use it. And I'm going to take care of our vets. Believe me. They're our greatest people and our vets are not being treated as well as illegal immigrants. I'm going to take care of our vet, so go back so, the word is unpredictable. I made a business deal a year ago and a guy, oh, I beat him so badly. It was so beautiful. It's a beautiful thing it's like a picture. For me, it's like a picture. That's my own problem I guess. But to me, it's like a painting when you can do something like that. So I made this deal and it was great. And they call, they did a story on me recently, and it was a nice story. And I said oh, I hope they don't call this guy. They end up calling this guy. What do you think about Trump? And he said but in a respectful way, he said he won because he was so damn unpredictable. We didn't know what the hell he was going to do. That's a positive. That's a positive. I mean if you're a poker player and you're predictable you're not going home with much money, OK? But it was really I said that's not nice what he said. First I said that's not nice. I'm unpredict -- then I said wait a minute, he meant that as a compliment. And I called him, I said What did you mean by that? He said I think that's the greatest compliment I can pay. We could not figure you out. You came at us from 15 different angles. So with Obama when he announces that we're leaving Iraq on a certain date. We shouldn't have been there. But once you announce, the bad guys, remember they said the surge worked. Do you know why the surge worked? You know why? Because the bad guys all moved back. They said hey, what do we have to get killed for? These people don't mind being killed. Can you believe it? But they say we don't have to, let's not. So they move back and they say, hey, they're leaving and what -- what was the date? Do you remember the date? Specific date to the day. We will have all the troops out. I am a great President. So the bad guys, meaning the opponents, whatever you want to call them. They just said oh, they're leaving in a year, they're going to have all the troops out. Let's go back. What do we have to be shot at for the next year? And what do we have to do? Because if we do well, maybe he'll change his mind and say, so let's let him think he had this great victory with the surge, right? The surge worked, didn't work. What happened is everybody pulled back. They said let's wait. Now, we leave because of a lack of leadership, we leave and boom, it comes apart. That's what happened. That was the surge. Everybody talked so much, oh, the surge was so great. The surge was great because everybody knew, they knew what was happening. They knew it was going to happen. They knew we were leaving. Even through Bush, I mean honestly, they knew we were leaving. We were fed up. So they pull back and they say let's get them out. Everybody wanted to leave. Now, I would have done it differently. Even if I wanted to leave and I might or might not. I won't even say. People say, Mr. Trump, what's your attitude on ISIS? When will you attack them? When? I say you know, I don't want it -- I have a real chance of winning. I don't really want to tell you what my attitude. I don't -- I want them to guess. I don't really want to tell you. I mean the one bad thing about our system, we have a system that's got flaws, let's face it. Hey, look at our leadership. It's got flaws. But you know the one bad thing? When I give that answer, they say, although some people, I see it here. Some people say we love that, we love that. But when they give that answer, people say oh, Trump doesn't know. He doesn't know. He didn't give an answer as to exactly what he's going to do. Exactly. What is he going to do? And I know exactly what I'm going to do. And eventually, after I was asked a question by 10 different reporters, all of whom are here tonight by the way, I said you know, here's the problem. If I don't give the answer I'm not going to win. Because they write so incredibly negatively. So if I don't give the answer. I'm not going to win. They're going to say Trump wouldn't give us the answer. They don't know its unpredictability. They don't know its strategy. And I said it for a period of time like a month, I would say, I don't want to tell you because I actually have a chance. Because from the time I announced, I've been at the top of the polls, almost at the top -- you know we're doing well. Iowa will you get your numbers up, please. Hey, when you get these numbers up, I promise you I will do such a good job. First of all, I am a great Christian and I am. I am. Remember that. And I do well with the Evangelicals. But the Evangelicals left me down a little bit this list but I don't know what I did. But I am a great Christian. I'm a believer and I believe in the Bible and I even brought my Bible a month ago to a group signed by my mother, Mary and with the address and the date. I won't tell you what date it was because you popped -- possibly you think I'm younger than that. But she didn't want anybody taking my Bible because that was very important to her. So it has the -- I was so cute. She has the address, has to date but I said to myself. You know, so by the way, before I forget, will you get the numbers up, Iowa, please? This is ridiculous. I mean, what is my competition? In all fairness, in all fair -- what, what is my competition? Do you think these guys -- I'm not going to say, Carson. I'm not going to say Rubio who really is way down. I mean, I am second it's not like terrible. But I don't like being sec -- second is terrible to me. But, but do you think that Ben is going to beat -- go to China? These guys are fierce? Like they come into your office -- I made many deals with China. I've had great victories in terms of deals with China. They come into your office there's no hello, how are you? It's a wonderful day. It's been -- they come in. We want deal. There's no games. I do this for a living. I'm really good at it, folks, really good. And you know, when you talk about energy, I'll tell you one thing everybody agrees. Ooh, do I have energy, ooh, I toss and turn thinking about how I'm going to make the best deal for you, folks. I'll be tossing and turning. I will be tossing and turning. You're going to have so many deals that are so good for you. We're going to have numbers that are going to be so good. I always joke. You may get tired of it but then I always take that back because nobody gets tired of winning. We don't win anymore. You know, think about it. Do we win at all, ever? We lose with the military, ISIS beats us, everybody. We lose with trade. When are we going to come back and say we beat China on a deal? When are we going to come back, we beat Japan? Do you know that everybody said oh, Japan, they have so power over us. They have so much power because we owe them $1.5 trillion, and they send all those cars and we don't have -- they have no power. If we ever say listen, if you're not going to treat us fairly, we don't want your cars anymore. They go out of business, folks. They're gone. The same thing with China. China is not even doing that well but they just lowered, they just devalued their currency, the biggest in two decades. And the reason they did it, they could never thought, but we have so many other problems. That they felt. Oh wow, we can get away with this, and it's going to make it impossible. Did you see the results the other day of Caterpillar Tractor? Horrible because they're not getting stuff out. Because everybody, Japan and China, in particular, is devaluing their currency. That's the number one weapon and this stupid trade deal that we're making doesn't even cover it. That's their number one weapon and the trade deal that we're making doesn't cover. So I only say this, and you know what people might say, it's terrible. He's a terrible person, a terrible human being, he should -- but I didn't vote for him anyway. OK. That's fine. I'm actually a nice person. I only say this, nobody can do this stuff better than me, and I know all the guys I'm running against. They're wonderful people and some of them I really like but who cares? I was talking to one of the candidates the other day. I was talking about corporate inversions and they didn't even know what the hell I was talking -- they had no idea. It's not their thing. And unless we stop all of the things that are going with other countries and unless we make great trade deals, we're being eaten alive. That's why when you look at the phony numbers, we have 100 million people in our workforce that aren't working. Our real unemployment rate is probably 30%. It's not 5.3% that was done for politicians so they look good. It's not 5.3%. How can you have 5.3% when you have 100 million people. You look for a job, If that young guy that handsome young guy with the red hair right there, if he comes out and looks for a job, that's right, I'm talking about you. His, his mom is very happy. But if he comes out and he goes into the workforce and he looks for a job and he goes to college and all he does well and then he can't get a job and when he gives up because at some point, after months, you give up. They essentially consider you employed. It's the most ridiculous thing. We have a tremendous, tens of millions of people in that position. They can't find jobs. They're good people. They want to work. They can't but it's not reflected in the real numbers because the politicians want to look good. So let me just -- before we take some questions. I'm going to talk about something I never really talked about on stage but we should talk about it. It's called Super PACs. It's one of the great scams of all time. It's one of the great scams. So we sent out, I think, I had -- it's not me, people set him up. And I don't know, maybe they're setting up for my benefit. Let's take me, OK? Sees me, likes me, sets up a super PAC. I don't talk to him. I don't do anything, but we -- I think we had either nine or five or 11. We don't even know. They're all over the place. Trump, Trump. One of them called it The Art of the Deal PAC, after the book. They have all these PACs. And the money comes in. What do they do with the money? I don't know. And we aren't supposed to call them or anything. OK. So we wrote a letter, a legal letter to, I think, either nine or 11 last week saying we don't want the money. Send it back. Because I don't -- again, what do they do with it? If some guy that's having a hard time, all of a sudden there's $2 million sitting in the super PAC. Do you think he's going to take ads for Trump? Maybe. And maybe not. So we sent them money back. It's a scam. Super PACs, a scam. It's a disgrace that we have. A disgrace. And -- and I'll tell you, you know, I read a number with -- with as an example, Ben. Ben is paying $0.70 to almost $0.80 on the dollar to raise money. So when you read he has all this money. He's paying a lot of money and that's not reflected yet. So when you hear they raised $20 million. They're paying -- now think of it, who pays? The number I actually heard was $0.79. But you know, these guys will check-up. So I'm telling you, it may be off but you all know it's a lot. I think they said $0.79 on the dollar. Think of it, to raise the money, they take $0.79 before they get to use the money for the -- what it's supposed to be. Someone is making a fortune. I know in Romney's campaign a couple of guys walked away with millions and millions of dollars, millions. He became rich raising money. It's better than being a real estate broker for the people in real estate brokers, they take these massive percentages of the money they raise. It's a scam. It's a scam. Now in Ben's case, his super PAC is running Iowa. And let me tell you, the people that are running that super PAC, even if it comes in in small donations, those are the real bosses. Those are the bosses. In the case of Jeb Bush, you're not supposed to deal with your super PAC, right? So it was in the Wall Street Journal the other day. He has a super PAC fundraiser or something, in a hotel. And right next to it he had his campaign. Ballrooms, did you read that? Two ballrooms, one here, one here, right next to each other, by coincidence, of course. There are not supposed to be coordination. There are not supposed to be talk. They're right next to each other. And that's nothing compared to what some of them are doing. It's a scam. And it should be stopped. And it's unfair to somebody like me that is spending my own money. And what happened, and I haven't talked about this before, but I mean, I'm seeing what's going on. It's horrible what's going on. What happened is last time when they had the super PACs, I actually think that was sort of a wall. You know, they call it the wall. And this is a wall, too. It won't be as good as the wall I'm going to build but there's a wall. But -- but there was a wall and they didn't deal. I mean, even though like Bush has a friend of his running a Super PAC, I'm sure they never talk. I'm sure. What do you think the chances are that they talk? 100% or 99%. 100%. I'd say 100%. I'd say 100%. Only a foolish person would say 99%, but whatever. They're not supposed to. But they put a friend in there. They put other people in there. They put whoever. And that's the way it works. And in some cases, I hear in Ben's case, I hear in other cases, they're literally running. I mean, had Walker done this, in all fairness, because he had money on a super PAC but he had no money in his campaign. And he was unable to figure out this is what they're all doing. That's why he's out of the race. Because you couldn't figure it out. But the whole thing with Super PACs is a horrible, horrible scam. So I sent letters last week to as many as we could find. They're all over the place. We want you to close a super PAC. We want nothing to do with it. We don't want to get advertisers. We don't want any of the money. Go home and ideally give the money back. They don't even have to give the money back. It's from what I understand. They never take -- they can keep it. They'll probably if they actually raise money for me, they'll say, what a horrible thing he just said. I think we're going to support somebody else, they could do that. But the super PACs have total control over the people running for office. Total nothing over me. Nothing. I feel -- I feel it's very unfair. I mean, I feel it's a very unfair situation. If they want, they could have full disclosure and everything else. Let the candidates get everything. But what are they doing with this whole thing? And I think it makes dishonest people out of people that might be honest. But the super PACs are controlling your candidates, some more than others. Some are unbelievable. And what the press should really do is take a look at how much money is left. When you read that Ben raised $1, how much is left after he pays all of the consultants and all of these people? How much is left to spend in the campaign? You'll be amazed. I mean, it's a little. Bush, the same thing and I'll go over -- there are other names. I know every one of them. But it's -- it's a horrible thing that's taking place. And again, last cycle, at least they went through the motions. Now they're not even going through the motions. They're not even gone through. And just remember, when I have to negotiate with companies to keep them in this country so they build jobs here and they build their plants here and their factories here, and they do all of the things here. When I have to do that, you know, John Deere, I've paid them tens of millions of dollars. You can even check. I said to John Deere, I wanted an endorsement. I don't know if they're giving me endorsement. I'll tell you if they don't, they're not so smart. You know, I guarantee no other -- no other person gave John Deere, I mean, I bought probably more than $10 million worth of John Deere. I love it. You know why? Iowa, Iowa. I love it. I love it. I like -- I love it. When we can, and it's -- by the way, it's a great company. It's a great company. But I buy a lot of stuff from John Deere because I have a lot of big developments that really require John Deere-type equipment. I don't have to buy from them, I could buy from others but I want to steer it to them when I can. But we have to do something to clean up this political mess because it's crooked stuff. It's crooked stuff. And it's got to stop and it's very unfair to people that go out and do it the way you're supposed to do it, including me where I put up my -- I think I'm the only one -- I know I'm the only one that self-fund. I'm the only one I'm putting up my own money. Other than I always preface it people write into donaldjtrump.com or whatever. And they send me checks like $20. I keep saying about the woman for $7.50, $50, $100 because if you say -- I don't want their money. But if you send it back, it's totally insulting. I mean, they always write letters, too. They write these beautiful letters. It's, Mr. Trump, I can't afford much but -- and I know you don't need it, but I'm sending in $50 because it's so important what you're saying about the country and it's beautiful. I mean, I've seen such beautiful letters. And if I sent it back, there is no letter I can write that's not going to be insulting to those people, really. Dear, Mr. so-and-so or Mrs. so-and-so, I don't need your money and thanks a lot. But we're going to do it ourselves. It's like if I got that back, I'd say, who the hell does he think he is? So we take that. And it's -- it's something that I think is important. So I always preface it by saying I don't consider that funding. But I'm self-funding my campaign, and I'm getting ready to put up millions, millions. Something I'm very proud of that I think is great. And it's been really great. It hasn't been gotten very much publicity, hasn't gotten much publicity, but I have spent less money than any other candidate, OK? By far, I think. I don't know, probably a couple of guys have nothing. So they just go around from -- but, but I was told I spent a less. And I had the best result because in most polls, I'm number one. Now until Iowa came along, I said every poll, and then Iowa -- what the hell are you people doing to me? You know, you know I'm telling you, they said why don't you skip Iowa? They've told me that. Everybody said skip Iowa. All of the political geniuses, a man just interviewed me back there, he's a great reporter. He's actually a great reporter. Chris, if he writes a bad story, I won't say that, bud. Then I -- but he is, he's a great reporter. And he said, would you ever think of maybe skipping Iowa, going right to, you know, right to New Hampshire. And then you go to South Carolina where I'm -- I'm leading by massive, you know, you've got to see the rallies we have, they're incredible. But you go to New Hampshire, you go to South Carolina, you go to Nevada, you do the SCC. And skip -- I say, I can't do that because I have such an unbelievable relationship with the people from Iowa that I think we're going to win. I really do. I believe it, I believe it. And I don't want to skip Iowa. I think we're going to do well. I think we're going to do great with Evangelicals. I think a lot of things are going to come out over the next period of time that are not going to be so good for opponents, honestly. And I think I'm going to do great with the Evangelicals because I am the real deal. I will tell you that I'm the real deal. So I told these political pros, you know, I hate to say it but the last long number of elections on the Republican circuit, the person that won Iowa did not get the nomination, OK? I want to take away some of your mustard. You understand that. So could we do -- and please do me a favor, let me win, Iowa. And then I'm going to win. I'm going to win. I'm telling you, we're going to win New Hampshire and we're going to win -- we're going to win South Carolina. A great poll just came out of North Carolina just a little while, PPP poll, it was great. Some of you saw that, but great poll. But we're going to go on. We're going to win. We're going to win. And they actually -- one of the, one of the pundits, because you have some smart pundits and some very, very dumb pundits, a lot of the pundits that said he'll never run. He's not going to run, not going to run now, they're still trying to recover. But one of the very smart ones said if Trump wins Iowa, it's over. It's interesting because it will go right through. Because everywhere else, it's so great. And I thought it was good here. Come on. OK. So that's the end of that. But I want to tell you, will you -- I refuse to say get your asses in gear. I will not say that. I will not say it. I will not say it because I don't want to use anything that's even a little bit off. So will you please do me a favor and work with my people and go out on February 1st and vote and give us a victory? And -- and if I win, Iowa, we're going to run the whole table. And we are going to make such great deals and we're going to have such a great military. And we're going to take care of our healthcare without that crazy Obamacare that's a nightmare. So I'm sticking with you people. I'm going to spend money here. I'm going to have -- I have a great team over here. And I will tell you, I'm going to spend a lot of time here and I really want to win Iowa. And I think we should. And it's so important. And you know, it's about time that Iowa could have a victory and let that person go into a total victory, OK? Not like over the last, right? OK. So I love you all. I mean, we're having fun but I love you. But I do mean it. I'm going to stay here. We're going to work really hard. When I heard the poll today they said, what are you going to do? I said I'm going to work harder in Iowa. I'm not leaving Iowa. I'm not leaving my Iowa. Now if lose Iowa, I will never speak to you people again, that I could do. OK. Let's do a couple of questions, right? God. Where's your mic? Where's that mic? Nice questions. Vicious ques -- I don't care. You can ask me anything you want. OK. Come on. You know Tana? Tana, Tana from The Apprentice. Yes. All right. You've got a good one for him? All right. Go ahead. Go ahead. How are you? Good. Thank you. It's going to take just a second to preface this. I want you to know I'm married. I've got eight children. My wife stays at home. I'm a pretty average income, OK? What I want to know is, in the war on poverty we spent $20 trillion, about the same as our national debt, yet the poverty lines are the same. I made good choices. A lot of people make good choices. We pay for people who make bad choices. What are you going to do to cut some of that out to stop the fall? Yeah, it's a great question. You know, we have now -- we have now, I mean, and the numbers, they just came out. We have 50 million people in poverty in this country, 50 million. Now, you look like you're doing pretty well, in all fairness, but still, we have 50 million we. Have 46 million people and they're getting food stamps, 46 million. Think of it, you know, we talk about how well we're doing. So we have 50 million, almost 50 million each between poverty, food stamps and it's got to end. One of the problems, we don't have enough jobs in this country. It's very simple. You know, it's so simple when you think about it. Our jobs have been taken away. And I'll tell you what else, middle-income folks, their salaries haven't gone up in 12 years. People are making less wages now than they were 12 years ago. And other things have gone up. So they're really doing much worse than they were doing 12 years ago. But that's an amazing stat. That people -- and one of the reasons they say I'm doing so well because I let people know. We're going to bring jobs back. We're going to bring industry and plants. We're going to bring it all back. And nobody else can say that we're going to bring it back because a lot of the folks in this room are doing worse than they did 12 years ago. And they're working. Then the other thing, you have a lot of part-time jobs. I have some people that I know very well and they've had a job for 20 years in the same place. All of a sudden they're working part-time because of Obamacare, because from an accounting standpoint, it just works better. They love the owner. The stores and things, they love the owner, they think the owners are great. But the owners forced them to make part-time -- they have part-time jobs. They work all their life, they have a wonderful company that they're working for, and now all of a sudden they're cut into part-time jobs because of Obamacare. Because of the rulings of Obamacare. And you all know what I'm talking about. So they end up being part-time workers, and they don't want to be part-time workers. They don't even like the psychology of being called a part-time worker. And we're not going to have that stuff anymore. We're not going to have it anymore. We're going to have real jobs and the numbers are going to go up, believe me. The numbers are right now worse than 12 years ago and that's a shame. Go ahead. Another question. Yes. Mr. Trump, you're going to love meeting Todd. He's a Wounded Warrior and I told him how much you love the vets. Todd, what is your question? Hey, Todd. Hey, how are you? These are our greatest people the Wounded Warriors. These are the greatest, the best. Great, Todd. Love what you put in thought there. Is that your daughter? It is. Wow. She's so beautiful. Wife? Wow, beautiful. What a family. Good. OK. I want to come to show -- I got to say hello to Todd. Look at this guy. I know. I told him -- I told him you love him. What a look. Hold it. Wait. Didn't I tell you? Didn't I tell you how much he loves his vets? I told him about you. That's a perfect family, beautiful family. Go ahead, Todd. I just wanted to ask, one of the real struggles after 21 years of active Army service, especially with the 101st Airborne that deployed constantly. What else -- with the current administration, Warrior Care is lacking, to say the least. And especially after the -- post-service. My wife, April here, is my full-time caregiver compensated by the VA I don't work anymore since I was told I was leaving the army. Is there -- is there -- what else can -- will the Trump administration do better than the Obama administration? Is the VA not doing the job? My wife could help you with that one. Right now he needs some more treatment. And I'm being told from the VA that you had to go through this new Choice Program but it's -- we can't get the appointment, like, he's not all the time in the wheelchair but -- You're going to write out your card. Oh, yeah. You're going to write out your card. And I am going to put pressure on the VA like you won't believe. Let's see if we can get that, right? Look how beautiful -- look how beautiful. OK. So we're going to have, you know. Hey, I tell you what, as President, I can guarantee it. As Trump, I can say I'll probably be able to pull it off anyway. Because -- because they know it won't stop. It'll be easier to take Todd and just say, look, we're going to work with you Todd, OK? So will you get me that number and everything and we'll make sure that everything get -- and somebody else, who else over here? You had problems with the VA also, huh? Terrible? I hear only -- I just hear terrible. And we're going to solve that problem. You know, it can be solved because the waits now for the VA are longer than they've ever been. Oh, it's nice to see you people back there. It's about time. What am I doing now? Why didn't you give me this? But the waits now are worse than they've ever been. Thousands of people dying waiting for a doctor, OK, dying. And you find the same thing. You say -- you have to use your own because they won't do anything. So we're going to take care of our vets and we're going to take care of the VA and it's going to be one of the things we're going to be releasing pretty soon. But one of the things we're going to do with the VA, we have a lot of hospitals that aren't doing any business. We have a lot of private doctors that could do more business. We're losing a lot of our doctors because of Obamacare. They're retiring. They're leaving. One of them, a friend of mine, said I have more nurses working for me now than ever before but I have more accountants. And the end result is a disaster, he's getting out of the business. He's got nurses but he's got more accountants and he has dirt because the paperwork is so crazy. So one of the things we're going to do is, if Todd or if you or if somebody has problems because of the waits because the waits are unbelievable, five, six, seven days sometimes. They're going to go to a private doctor, they're going to go to a private hospital or a public hospital that's in the area. And we're going to pay for that and it's going to cost less money. It's going to cost less money than the system we have now. And you're going to end up getting much better care. It's going to cost less and you get better care. So, anyway, Todd, we're going to take -- great family. Great. Thank you. Hold on one second. Hold on one second. We can't wait till Melania puts class back into the First Lady. We can't wait. And my question -- I heard you talk about -- she's beautiful. And we can't wait to see class. I love to be her. What's your question? My question is you talk oil. We have people, refineries, new refineries that have not been built. We haven't had new refineries in the United States since the 70s. Keystone Pipeline, what will you do with that? So the Keystone Pipeline, first of all, I'd approve it because it's thousands of jobs, OK? I would approve it so fast, so fast. And Hillary should have approved it. You know, Hillary wanted to approve it but she's been dragged so far left that she's, you know, forget it. It's a disaster. So I would approve it. But with that being said, I may want to make a better deal. Because you know what, we're bringing oil from Canada, right? I may say I want 10%. We'll be going to approve it. But I want 10%, 15% because the truth is that the Keystone Pipeline was better a while ago than it is now because we have so much, because of new technology, we have so much energy underneath our own feet. With the fracking and all of the other things that have emerged over the last five years. We have so much energy and it's great stuff. We have really great quality, higher than in Canada. You know they have the tar sands which is a problem for them. Very expensive to get it out. We have great stuff. So I would approve it because I love the jobs of building it. I love the jobs of building it, but I may just say maybe we should get 10%, 15%, maybe 20% as that oil flows through our land. You know, maybe we should do that. So I'm going to look into that. But when I approve it, I'll tell you what, when I approve it, it'll be a great deal for the United States. It won't be like -- because right now what we're doing is we're approving it. We're not really getting anything. They're putting it underground and that's good. And that's actually good environmentally, better than having trucks going down the roads, everything else. But that's good environmentally. But we're not getting, we're not getting anything much for it. When I get finished with the Keystone, they'll be happy. And we'll be happy, OK? So it'll be good. OK. Question, Tana? Yeah, go ahead, Tana. You got one in the back. In the back on the bleachers. I love this people with the shirt. Look at those beautiful shirts. Look, look how handsome he is with that. Looks like he's 20 years old now. OK. Go ahead. What do we got? So on with the question. We've got the mic. I'll hold it. I'm a physician. And when somebody's going to realize that you can put the insurance companies out of business by slowly lowering the age for Social -- for Medicare. And once everybody gets to Medicare they'll love it. That would put the insurance companies out of business. We'd have one system. Why doesn't anybody have enough guts to talk about that? Well, I'll tell you, in all fairness, Ben Carson said yesterday or the other day that he wants to abolish Medicare, OK? And you know what a disaster that is. Now I'm sure at some point he'll take it back. But he said he wants to abolish Medicare. And one thing, people do like their Medicare. They do like it. And you are bringing up a point that I've heard before and we're going to be looking at a lot of different things but we're going to save Social Security, we're going to save Medicare and that's the way it is, OK? We're not abolishing like other people. OK. Go ahead. Next. You got another one? Good point, by the way. OK, great. Hello. OK. Hi, so what is your plan for the budget? And how do you plan to finance immigration reform? It's a lot of people. OK. It's a lot of people. But you know what, it's costing us $200 billion a year, immigration in this country right now. And Dwight Eisenhower was going to say, he moved 1.5 million people in the 1950s, early 1950s, moved them out. We had tremendous illegal immigration problems. Dwight Eisenhower, nice guy, he moved 1.5 million people out of the United States. And you know what happened? He moved them right across the border and they came back, and they moved him again and they came back. They moved him a third time, they came right back. And then, you know, they were tougher in those days. They moved them all the way south, all the way south, and they didn't come back. Now we have to do it. We have no choice. We either have a country or we don't. And I want them to come back but I want them to come back with papers. I want them to come back legally. I want them to come back, the good ones, the good ones, but only the good ones. We got some bad ones, you remember the heat I took with illegal immigration? Remember that heat? For two weeks Rush Limbaugh said he has received more incoming than any human being I've ever seen. And then he doubled down. He thought it was pretty good and he's good, really good. But you know what, I took a lot of heat. And then you had Kate in San Francisco, killed, shot in the back. And so many others. And people started looking. And let me tell you, we have some wonderful people over here and they're here illegally but they're wonderful people, OK? And we'll try to get them back really soon and we'll do it through a legal process. But we also have some really bad gang members. You know, some of the gangs in L.A., they're made up of illegal immigrants. And we have unbelievable police forces that don't get the respect that they should get. They don't get it. I mean, what they go through, a tumble, if they're afraid to talk to anybody, they don't want to lose their job, they don't want to lose their pension. They can't talk. Now let me just tell you something, you can always have bad apples. In this room, we have a couple of bad apples, OK? I don't know who they are, where they are, but you do. Probably mostly back there in the press. But the police do an unbelievable job and they know the gangs. You go to L.A., the L.A. cops, you go to Chicago, Chicago cops. These people are amazing people. If they would be allowed to do their job but they're not allowed to do their job. And we're going to get the bad ones out of here so fast and they're not coming back. And I don't want to put them in our jails because I don't want to -- I don't want to subsidize these various countries where they come from for the next 45 years. I don't want them in our jails. We have hundreds of thousands right now in our jails. I don't want them in our jails. I heard a couple of these candidates saying, well, they have this -- uh, they don't know. Uh, they're such babies. But you know what, they're talking about putting them in jail. Well, I don't want it. Our jails are over-brimming. I want to use our jails for people that are supposed to be there, OK? And I don't want to put these really bad dudes, I mean, they are bad. I don't want to have to pay for them for the next 45 years. OK? And we're going to deal very humanely with the good people in there, mostly good people. But we got some real bad ones and they're out there. Your head will spin probably. Somebody said the other day what's the first thing you're going to do? Well, we're going to work immediately on repealing Obamacare. I'm going to -- you know, the one good thing about executive orders, the one good thing -- you know, Obama signed an executive order where everybody just come in, come in. We have great border patrol people. I got to know them a couple of months ago when I went down to Texas, to the border. They're great people. They're not allowed to do their job. They stand there and watch people walk right in front of them smiling at them. They want to do their job. They're not allowed to. So the executive order that President Obama signed, the one good thing about an executive order, in the first minute in office I will counter-sign and revoke those executive orders. Would be only good. It's actually the only good thing about an executive order, is the new President can just do a signature and that's the end of that. So we're going to clean up our border. We're going to make it fantastic. We're going to be proud to be a country again and a lot of good things are going to happen. OK. Do one or two more, Tana, and we're up. We'll get another one in the -- on the bleachers. Going to foreign affairs, what is your stance on Israel and supporting them? We will support Israel 1,000%. Israel feels so left alone and I know Bibi and I know a lot of -- a lot of my friends are from Israel, and they feel so left out. And so many people say, you know, I have so many Jewish friends where they say why did I support Obama? I think he's the worst thing that's ever happened to Israel. And we will support Israel beyond anything they've ever had before. OK? That's an easy one. That's the easiest question of the night, OK? Go ahead, Tana. OK. We've got a young adult. OK. Hello. Hi, my question is, it goes back to immigration reform, why -- why is your answer then not to strengthen regulations on drug traffic -- drug trafficking, inside trafficking and yeah, because I think every issue with the big problems, the big issues on Capitol Hill are very comprehensive. And so I think it's more than building a wall. And I think it's the one you should help more. It is. It's more. But -- the wall is a big factor at 60%, 70%. The drugs are a great question. We're going to stop drugs. Look, I told you before, Mexico $45 billion to $50 billion, that's not including the drugs. The drugs that are coming across the border are beyond belief. Did you see the picture last week where they had a little wall this big, and they built a ramp for trucks to go over with drugs? Did you see the picture? They think we're playing games. And Mexico is not helping us. Mexico's not helping. You know, if you want to become a citizen of Mexico -- I love the Mexican people, I have many Mexican people and Hispanics working for me. In Nevada, I'm number one. I'm rated number one in the polls with the Hispanics. Everyone's shocked because the Hispanics that are here legally, those people, they want me -- they know I'm going to bring jobs and everything else. They don't want people pouring in. But I will tell you, Mexico has got to help us. You know, if you want to become a citizen of Mexico, if Todd wants to become a -- you can't get a more beautiful family. If any of us -- if me, if I want to become a citizen of Mexico. Well, me, I know they won't take. OK. I was going to say I'm pretty good at getting in. This is what I mean. Do you know it's one of the hardest countries in the world to become a citizen of and yet people pour right through into us, into us. They call us the dumb Americans. That's what they call us because of our leaders. They call us the dumb Americans. If you want to become a citizen of Mexico you could take the best person in this room, the most qualified, you're not going to do it. They don't do that. And if you're there illegally and if you overstay you're bound, you're not going to be there illegally. But if you have a pass for two weeks and you overstay your bound, you have cops waiting for you. They have police that say, you know, you have one day left. I hear it's unbelievable. I'm impressed actually. Because to a certain extent, that's the way it's supposed to be. But if you want to become a citizen of Mexico, it's impossible. They don't have anchor babies in Mexico. You're born a baby in Mexico. It's like bye-bye. Here, you're born over here, oh, congratulations. We're taking care of the baby for 85 years. Not going to happen, it's not going to happen. No, it's not going to happen. And by the way -- by the way, this is important. I sort of lucked into this one. The 14th Amendment it says right there. You know, everybody said you have to go through a whole process. It'll take many years. You have to go through every state. You have to do another amendment, it's wrong. 14th Amendment covers it. And some of the best legal minds knows that Trump is right. I said, what, I am? I didn't know. I lucked into it. Every once in a while you're lucky. The fact is somebody comes in illegally. And they have a baby. We're not responsible. Now we may have a court case, we're going to win it. And a simple act of Congress gets rid of it. And a lot of people didn't know that, OK? And the reason I said it can't be possible because nobody could be foolish enough to allow a thing like that. How could it be possible? And we're one of the only countries where that takes place. And honestly, I used Mexico as an example because they're so tough. If that happens in Mexico they don't even know what you're talking about. What are you talking about? But with us, no good. Not going to happen anymore. OK. Let's do one more question. Make it vicious, violent, make it crazy. And we have it. Back there on the bleachers, actually. OK. That would make it nice. Go ahead. If I don't like it, we'll do another one. You know, you always like to leave on a good -- hey, did you ever see like Elton. He does a final and the song is so great and everyone's gone crazy. And then they're screaming more or more. And Elton will come back and he'll do three more. And the less songs, Obama. And you walk out like this. You always like to leave in a high. So if it's a bad question, we'll do another one. OK. Let's go. I used to live down the street from Harry Truman in the late 60s. I want to leave you with a Trumanism and then ask a question. Give them hell, Donald. What will you do about the money, the politician, government owes social security? Well, say it again? What will you do about the money, the politicians/government owes Social Security? Well, you know, the amazing thing is that the politicians in this country live by a whole different standard when it comes to healthcare when it comes to everything they have, including what you just said in terms of social security. Our politicians live by a different standard. And I think that shouldn't happen. And some of them tried to do it. You know the story on Obamacare. They don't have to take it. They live by a different standard. And that's not going to happen. Everybody's going to live by the same standard. They're going to have the same standard as the poorest person in this room. That's the way it's going to be. I do want more questions. Tana, do one more question. Oh, one more. Go ahead, Tana. I can't get over there, I'm right here with the mic. Who do we got? OK. A youn -- By the way, isn't Tana great? Oh, thank you. You're sweet. She's great. We have a young adult. You know who's also great? Shawn Johnson, right? I love Shawn. Shawn Johnson is great. Go ahead. Hi, I was just wondering who you're considering to be like your running mate or your Vice President. OK. It's a good question. But it's -- you know, if I answer that question we'd have a big, big story. You know that. You know, I'll tell you, it is a question that says a lot. I know a lot of good people. A couple of people on the stage that I really respect and I've gotten to respect, but the truth is, too early. I'd like to get things done first. We've got to close the deal. I don't want to think about it. There are a lot of good people, there a lot of good people. We got to close the deal. We got to get it done. And to get it done, I want Iowa. So good luck, everybody. Thank you very much. I love you. I love you. Thank you. And we'll be back. Thank you. Thank you. Thank you, everybody."}