{"id":497,"author":"Donald Trump","title":"Speech: Donald Trump in Miami, FL","date":"2015-10-23","link":"https://factba.se/transcript/donald-trump-speech-miami-fl-october-23-2015","paragraphs":["That's amazing. Great. Wow. Wow. Beautiful. Thank you. Thank you. Man, this is something special. You know I said to all of my managers, I just want to do it here. I said you may not be able to get the cars. I don't care. The place is 100% full. And I know a lot of you had to walk a long distance to have you here is great.","Thank you. Thank you, unbelievable. You know, thank you. I want to start by thanking the fire department. They have a lot of people in here, I have to tell you. And I want to really thank the fire department and the police and they're here someplace. Hey fellas, come up here. Come up. Come up here. Come here.","Get up here. These guys have been so incredible today with the traffic and everything. And I just want to thank our police department. They have been absolutely incredible. Look at these guys. Look at these guys. Nobody going to mess with them. Look at this. Thank you very much, fellas. They don't want to leave the stage.","They'll never leave. And the fire department likewise, they've been incredible. So thank you very much. You know, what a crowd, is there nothing like Miami. Nothing. Nothing. Nothing like Miami. Incredible. So when I was a little boy, my father always loved Doral, always. And he said come on son. And he didn't play golf.","He was a worker. He didn't want to play golf. He didn't have time to play golf. And he had a beautiful swing actually. But he played very little, almost never. But he used to love coming here, and it was the hottest resort in the country. This was a long time ago, I won't say how many years because I like to think I'm a very young person, but a long time ago, at the beginning.","And he would say let's go and we'd walk around. And who would have ever thought that someday I'd own this place, right? Who would ever thought it? Who would ever thought, but what happened is Doral is very interesting. It had five courses, almost 800 acres right smack in the middle of Miami. Incredible location right near the airport.","You're ten minutes away and always did well. It was always one of the top places. And then sadly, Wall Street got a hold of it, the original developer, boo, boo, boo, boo. Oh they're going to pay tax. Don't worry about it. Their friends of mine, but they'll pay. They're going to pay. Don't worry. But you know, you know, what happened is, it became a money thing.","And it was like playing cards, bing, bing, bing, and they traded every year and every three years somebody would make a lot of money. It was like musical chairs like this and they'd sell it. Then somebody would own it for three or four or five years. Wall Street and they'd sell it. Make a lot of money. Always made a lot of money.","Everybody made a lot of money with Doral except for the last group that I bought it for. You know, it was like musical chairs. And I bought it. And when I bought it, I bought it from a smart group, but the market had crashed. You know all about the crash. And I got it for the right price. I signed for x dollars.","Lot of money, $170 million, but then, I said you know maybe I can make a better deal before I close. So I went into closing with Ivanka. We know Ivanka. We love Ivanka, right? Right? I went in with Ivanka and I said, watch Ivanka. Let's see if we can make $20 million. It's true. So I have a contract for one hundred -- I never told this story actually.","I have a contract for $170 million or suspenders without the jacket, right? You know the jackets were behind the seat. They were all like Tom Cruise, and you couldn't get better central casting. In fact, all of that media, look at that media back there. Look at these people. Wow. No, they're all right. I'm going to tell you some media stories.","So no, but they're central casting the red suspenders, handsome, beautiful, smart, top schools. They will go to Harvard. They go to Wharton. They go to Stanford and I said, I want to show off to my daughter. Does that make sense? You know I have this great daughter so I go in and she said Dad they're not going to cut, you have contract for $170 million.","Well, I said that's right. So does Iran have a contract that doesn't mean we can't make it much better. You know, right? So, so what happens, I tell these guys there's no way I'm paying the $170 million. I'm not doing it. I'm not doing it. They said you have to pay it. You have to pay it. Beautiful guys.","You have to pay it. You really have to. And I said there's no way. That's all right. Don't hurt him. Don't hurt him. Don't hurt him. You can get him out, but don't hurt him. We don't want to you know that. You know that. Great. Great life. It's a great life. It's a great life.","That's all right. That's what the country is all about. I mean, we've got to be able to speak and every once in a while will be a little bit disrupted, but it doesn't take long. It doesn't take long. So let me just finish the story. Thank you. Too bad we had to throw him out, but sometimes you have to throw people out, right?","You have to do it. At the door. Look at that sign. Look at the size of that sign. Can you believe that? Wow, thank you. Beautiful. I think I'll tell my people. Let's bring that home. And by the way, we have plenty of time tonight. It's going to be -- I'm here all night. You know, you know, tomorrow night we're in Jacksonville Florida.","We have at least 15,000 people, probably 20,000 people tomorrow night. So it's going to be great because things are happening. So anyway, so let me tell you because it has to do with the country. So I go into that room, I say fellas, the contract is not right. This place is in much worse shape than you told me. I've gone all of -- you have to have it signed first before you can do this.","I've gone all over and it's not fair. What you're selling me, you shouldn't be selling. I'm not closing this deal. I'll give you $100 million. Remember, I want to impress my daughter. The Art of the Deal and I meant it, nothing wrong. I said it wasn't in the shape that you're supposed to be in you know.","So I ranted and raved like a lunatic for about five minutes about condition. And they said we're never going to cut $0.10, within about two minutes I said, would you take $20 million off. They said, would you agree to $20 million, Mr. Trump? I said no way, you've got to do it less. So within about four minutes, I saved $25 million, I cut the price.","Can you believe? No, can you believe? And they said and I'm only telling the strikers, we should be doing the same thing for our country, right? Right? Right? So my daughter was very impressed. And I mean, the whole thing took less than five minutes. And the actual number after tax -- I actually saved, would you -- I actually saved $20 million.","And I just said Ivanka, we just bought the furniture. That's very nice, right? So then I had a decision to make. We have this great place. I had a decision. Legendary place and the decision was do we fix it? Do we fix it? You know, by the way, you know the saddest part? You have people like that.","There's a total of probably three over there and five over there, and they'll be the story tomorrow, not the thousands of people that love our country. It's amazing. It's amazing. No, no. The sad part, I had an incident like this two weeks ago. We had 9,000 people in an arena and we had five people protesting.","They became the story, it's too bad. All right they're gone. You know, we have -- we'll have little pockets. Little pockets but it is a shame. I mean it just shows, so we have thousands of people. And you'll have three or four people protest. And tomorrow morning protesters at Trump. It's one of them. So then I had a decision to make.","And the decision was, do we give it the B job, the C job, the A job? What do we do? And we gave it the A plus job and we built something that we love. We built something that we love, really love. And what happened, let them get out. Go ahead, get them out. See the first group, I was nice. Oh, take your time.","The second group, I was pretty nice. The third group, I'll be a little more violent. And the fourth group, I'll say get the hell out of here. So, so I had to make a decision. What do we do with Doral? Do we give it the really best job and basically rip it down and build a new magnificent place because it was really old, really tired, the bones were tired, the whole place.","You people know, a lot of you are from the area. And I said, we got to do it right. We got to do it right. And we basically, as you know, new clubhouses, this room knew. This room is one of the great ballrooms. We have five ballrooms. We have 700 rooms. We have the golf courses are world class, and we wanted to do it right.","And a man just came up to me outside. He hadn't been here in 25 years and it was very interesting. I won't say he was an older fellow, but he was an older fellow. And he said, you know Mr. Trump, this place is magnificent. And by the way, David Fader wherever the hell you are. David where are you, David?","David Fader is our president and general manager. He has done some incredible job. And this is now the hottest resort of its kind anywhere in the United States. It's bringing tremendous business to the Miami area and the Doral area, and it's become the hottest place. So it's really good. In fact, the PGA Tour just gave us a 10-year extension on the tournament which they never do. So that's how good it -- they never do that.","So it's become a really, really, successful place. But this gentleman came up to me and he said, and it was so simple and yet it was so beautiful. He said, Mr. Trump I haven't been back here in 25 years. It was in very, very bad shape. I actually bought it out of bankruptcies from some people that I know very well.","That are killers but they didn't really know what they were doing in this case. And I said, well, that's very nice that -- you know Mr. Trump, if you could do the same for the United States as you did here, it would be unbelievable. Unbelievable. True. But it was great. I thought it was great. I thought it was great.","And you know in its own way, doing it for the United States might be easier than what we had to do here. As crazy as it sounds. So, and that's what we have to do. We owe $19 trillion. We're desperate. Our infrastructure is is in such trouble, such trouble. Hey, isn't this more fun than having like a normal deal, right?","Right? I mean, supposing we had like a normal speech, we talk and talk and talk. The evening ends, we go home, go to sleep. This is more fun, right? You know? You know they used to call it the silent majority but they don't use that anymore because frankly. It's no longer silent because we're not going to take this crap anymore.","We're not going to take it anymore. We are not going to take it anymore. So it is true. You know for years, you haven't heard that term silent majority. I don't know, it was a long time ago and people thought it was politically incorrect, and I started using it. But then I started realizing, honestly, it's not silent.","There's nothing silent. Everywhere I go we have the biggest crowds. I mean, we left Oklahoma 15,000 -- 20,000. Dallas Texas' Mark Cuban's arena where the Mavericks play, we had 20,000. Moby, Alabama we had 35,000. I go to Iowa. I go to New Hampshire, no matter where -- South Carolina. Unbelievable crowds all over.","And there's love in the room. There's just love in the room. It's incredible. It's incredible. And you know -- and there's nothing silent about it. We're sick and tired of incompetent people running our government. So I did something today that was quite exciting, although, I think actually owning Doral is more exciting, but that's OK. But I did something today that was interesting and it got a lot of press.","I see it's got a lot of press. They have these things called super PACs. Nobody knows what the hell they are, what they mean. It's the dumbest thing I've ever seen. And all of the candidates have super PACs and they're controlled to a large extent by investors, they're controlled by lobbyists, special interests, countries, countries.","You know, when you wonder why our politicians make such bad deals with foreign countries and with other deals, it's because they're totally controlled by people that benefit even if our country doesn't benefit. It's true. It's true. And the super PACs are a disaster. You have Jeb Bush. Did anybody ever hear of Jeb Bush?","You have Jeb Bush, has $125 million. I honestly -- I don't think it's going to help him. I'll be honest. If it helps him then I can't figure the whole deal out. Hey, look I used to be one of those guys that would like give a lot of money, a lot of money. I know the lobbyists. And you know when they come up to me and say we want to give you money.","When you go to No. 1, everybody wants to give you money. It's incredible. But they don't care so much about anything other than the companies they represent. They don't care so much and some do, but most don't. They want influence, they want power, they want to take these people like little puppets, and they want to say you do as I told you because I gave you $5 million and you better do it. Well, nobody's giving me anything, OK? Anything.","Nothing. And so what happened is, I noticed over the last couple of weeks, everybody's forming a Trump super PAC. I'm not forming. They're all over the place. I thought we had four. Then I heard we had five. Then I heard we had eight. Then I heard we had nine or ten. Now, I don't know. Are they good or is it a scam?","Because you know, some of them, some of them seriously, some of them I assume are like legitimate people. They love Trump, they want to do things, they'll go and do whatever they're supposed to do. And you don't talk to them, you know, they're supposed to be like independent. And others, I would imagine they probably pay themselves salaries and who the hell knows what happens with all the money.","So we did something today. That was very -- well, all I know is I haven't gotten any of this money. None of it. I feel guilty about that. I feel a little foolish actually. And we wrote notices and notifications sent them all to the government, to the people, to everybody. That we don't want super PACs. That we don't want anything to do with them.","To close them up ideally, hopefully, to give the money back whatever money is raised. I mean, I saw it the other day on one of the programs, two young nice looking guys, big fans of Trump, I think. And they opened an art of the deal. I think it's called The art of the deal super PAC, after my book, right?","And by the way, we're having a new book come out on November 3rd. I think it's going to be great. I think it's going to be great. But the art of the deal super PAC and they look very good, and they talk about we love Trump, where they're going to do this. And you know, probably, it's true. I don't want to take any -- I don't want it. I don't want any help.","I don't want -- the one I do -- the one thing we do, people send in small donations like small ones for -- a woman $7.50 with about a 4-page letter. Another woman $50, $30, $90, $250. But that I love because number one, you can't send it back. How do you send a letter back to a woman who loves the country, who's giving a lot of money.","That's like giving $1 million to a rich person. How do you send a $7.50 back? You can't. You can't. There's no letter you can write. It's true. There's no letter that you can write to that woman to say, we don't want your money. OK. So that's the only stuff and we take it and it comes in and that's the only stuff we want.","But we don't want any of the, you know, the big money. We don't want any big money. And so today, I did something, started getting big press actually this evening because nobody's ever done it. I disclaimed and disavowed all super PACs. I don't want any of -- I don't want they're money. I don't want anything.","And I said very strongly when we wrote the letter, and I told my attorneys and everybody that I think every candidate running right now for the presidency should disavow their super PACs. They should disavow their super PAC. You know -- and these super PACs are really running the campaigns. They're running the campaigns.","For instance, I hear in Iowa, that there's going to be a merger of Ben Carson and I like him he's a nice guy, they're going to merge the super PAC. He's got two of them. And they're going to run and they've been running his campaign, and he doesn't hardly have to go there. And I'm saying what am I? Why? Am I not allowed to do anything?","It's really unfair. But I think, they shouldn't be allowed to do that. I don't know if they're allowed to do that. But how do you have super PACs running campaigns. Now and then when you think of it, so you have these super PACs with millions and millions of dollars and they're running a campaign. Do you think those people that are running those super PACs and those people those super PACs and those people that are giving tremendous money to the super PACs, do you think they control those candidates 100%? The answer is yes.","And I don't want any confusion. And I said it, I don't want it to confuse you. People are calling. Well, you have all these super PACs. Therefore, I said, I don't even know who these people are. So here's what's happening, all candidates disavow your super PACs. Run for office and be proud, but disavow your super PACs.","Drop them. Drop them. And ideally, give the money back to the people that put it up there. That's what you should do. So we'll see what happens. We'll see what happens. But to me it's very important. This Super PAC thing is a terrible thing that's happening in this country. It's a terrible, terrible thing and it's controlling our politicians.","They're puppets. It's controlling our politicians. I mean, Bush had somebody the other day going to Berlin, Germany to pick up money. Berlin, Germany. What do you think Germany gets out of that one, OK? Other people have tremendous amounts of money put up and we can't have it anymore. We have to bring honesty back to politics, folks.","Got to do it. Got to do it. So -- Uh, thank you. Thank you. Thank you. So a very interesting thing happened, very sad today. Very, very sad because you know the press is very dishonest, right? We know. Not all of them. Not all of them, but we have more back there. Look at those cameras, look at those suckers, boy.","They are all covering, they are all covering, they are covering Trump, and they're covering you, and they'll all be with us tomorrow night in Jacksonville. And by the way, if you can, it's going to be wild, come back up. It's going to be -- So it's going to be wild. So a crazy thing happened. I love polls.","Everybody knows I love polls and they said I wonder what would happen if Trump wasn't No. 1 in the poll. And somebody said oh, if he wasn't No. 1 maybe he'd drop out of the race. Believe me, I'm not dropping out of anything. That I can tell you. Never ever. I'm not dropping out of anything. So poll came out, big one, ABC Washington Post that has to be killing everybody.","It's a national poll that was on Friday. We're killing 32. Think of it, 32, you know, every -- you notice every week I started at three. First when I was slightly before I ran, but -- because nobody thought I was going to run. Nobody thought I was going to run. You know they all said he's never going to run.","If he runs, it doesn't matter. What does he know about politics, right? I've only dealt in politics all my life. That's all. But -- so it started at three, it went to eight, went to 12, went to 16, went to -- now as of Friday nationally, 32, and then another one came out. Another one came out last week, Reuters.","Listen to this one, 33 to 15, 15 is Ben Carson. He's in second place, but they kept saying, oh, if Trump ever lose because you know what? I mean, I'm getting spoiled. From the time I ran and from the time I went up -- when I was at 12, they said all right, his peak, his peak. You know you're hearing the same crap, right?","Then it goes to 16, 17 the next. Oh, that's his plateau. He's plateaued. The word plateau. They love that word. So he's plateaued. Then the next week it went to 21. Well, that's it. That's it. By the way, 21 is not bad when you have 17 people, right? 21. You know, if I'm a card player, I will rest on 21 with 17 people.","I'm not losing. So I was No. 1 at 21. Then it went to 25, oh, this is it. You know these talking heads. These are among the dumbest human beings I've ever seen. That's true. It's true. Some of them, some of them are true, and some of them are coming along. I mean, some of them were so terrible and so nasty and now they're coming along.","I mean, they're becoming like, I don't know about fans, but they're saying a poll just came out we're 81% to win. I mean, can you believe it? I didn't know that, 81%. Who would have thought this? Rasmussen, Rasmussen, the Rasmussen I saw -- I'm walking up here one of my people stopped me, I said excuse me, I got to make a speech.","Oh no, I'd like to talk to you. I said what do you want to talk about? They're introducing me and Rasmussen just said nationally, I'm beating Hillary. Just came out, just came out. Just came out. Hey, what's the big? So now I said, I'm glad they stopped me, right? I'm glad they stopped me. So anyway, but a bad thing happened, bad.","So look, I mean, I just wrote down a few of them, and then I'll tell you what was bad. So I'm winning New Hampshire by like 22 points. New Hampshire's unbelievable, great. I'm winning New Jersey by a lot, a lot. And Chris Christie is a friend of mine. But I'm a 29, he's at five. That's a lot, that's a big difference.","I'm winning Florida. I'm beating Bush and Rubio, right? Right? I'm winning Nevada by a fortune, but here's what I like the best. Nevada tremendous Hispanic population. I'm winning with the Hispanics. Big winning with this base and I keep telling everybody. I'm going to win with Hispanics. I say it to everybody.","I love the Hispanic. I have thousands of Hispanics. Thank you. I love you too. I love you too. True. I have thousands of Hispanics working for me all over, you know, in this place. I have, you know, 1,800 -- 1,900 employees and many Hispanics. They're unbelievable people, unbelievable workers.","I love them. I love them. I love them and they know. They're smart. They know I'm bringing jobs back from China, from Japan, from all these countries. I'm bringing them back and nobody else can do that. I know the people I'm running against, including Hillary, No, they can't do that. They can't do that. They can't do that.","I mean honestly, Ben Carson cannot do that, folks. I hate to tell you. They cannot do it, can't do it. They're not going to do it. So here's the story. So winning in Florida, winning in Texas, OK? Winning in Texas, big. Winning in South Carolina, winning in North Carolina. Winning in Ohio against Kasich which is interesting.","And he's a good man. He's a good man. But I'm winning in Ohio against Kasich. I'm winning in Massachusetts. Listen to this one. This is one I love. Maybe, I don't even know why Massachusetts. I'm at 48, 48, 48. And second place is 12. Boy, I'm going to have to do a really, really bad crash to blow that one.","So what happens? Let me give you the bad news, right? And that's been going on now for 100 days. Did you sell -- they were celebrating on television, one hundred days on the top of every poll. Thank you. One hundred days on the top of every single poll, national and state. OK. That's the good news, right?","Let me give you the bad news. The press was so happy. You had -- oh, the press. I love Iowa. And I honestly think those polls are wrong. I'm Presbyterian. I'm a great Christian. It's true. True. They say in the poll, I'm the best leader. They say in the poll, I'm the best on the economy by far. It's not like a by two points, like by triple.","How, how important is the economy, right? Remember, it's the economy. Remember that? Is the economy stupid? I mean it's the economy. So I'm leading on the economy. I'm leading with men big league. I'm not doing as well with women. Will you help me? What's going on? What is -- which I don't -- look, nobody respects women more than me. Greatest person ever was my mother.","Believe me, the greatest. Nobody's going to be better or do more for women than Donald Trump, that I can tell you. That I can tell you. And I think they know it. I'd rather do well with women than with men. With men, I'm doing great. I'm killing everybody. With women, nah, I'm not terrible but I could do better.","So, so what happens, what happens is the poll comes out, right? And the press was so happy. Headline. Now just so you understand, if I were in first place, it wouldn't even be discussed. Nobody would mention it. But here it is all day long. Oh, my head. I turn on the television, headline, bigger than Hillary's talk yesterday on Benghazi.","So headline, here's the headline, headline. The biggest story -- you see it. Am I right? Trump falls to second place in Iowa. I said, no way. The press was going crazy. They loved it. They were so happy. I won't mention the names but you know some of them. You know some of them. We have a breaking story, Donald Trump has fallen to second place behind Ben Carson.","We informed Ben but he was sleeping. Now, Donald Trump has fallen to second place. You know it's funny. You got all these guys -- two people dropped out, right? Perry, you know about that. And you know the governor of Wisconsin, very nice guy, right? Walker, they both dropped out. They became so vicious to me. They -- Perry he was such a nice guy like two months ago.","He couldn't have been nice. He went to Washington to make a speech about me. It was so vicious that those that loved me started crying. Maybe that. That was vicious. It sent -- then and we had so many. You had Lindsey Graham. I don't even know the guy. The only time I know him is when he calls me constantly asking for campaign contributions.","So he became so vicious and violent, I mean, and every time they get more and more vicious and violent, they go down, down, down. Fact, Lindsey Graham was at five and he hit me as hard as you can be hit. He said I don't know anything about the military, what do I know about foreign affairs except one thing.","I wrote a book in 2000, right? And Joe Scarborough yesterday covered it. I wrote a book in 2000, before the World Trade Center came down and I said that there's going to be a big attack in this country. And I said, probably by somebody they said it's going to be much worse. You remember the first attack which was a horrible attack, but it was a small attack by comparison obviously, to the second one which was horrendous.","The worst attack in the history of our country worse than Pearl Harbor. At least with Pearl Harbor, they were attacking the military. They weren't attacking innocent civilians of which many thousands died, and are still, are still living in pain and suffering. Not to mention the fire departments, the police departments, and all the guys that had to breathe that air for long periods of time.","So thank you. So I have it in the book. Watch Osama bin Laden and Scarborough goes whoa, when was that book written? Before the World Trade Center. Whoa and he's a good guy. He was like, he couldn't believe it. And I don't get any credit. They don't give me any credit for it. And then I have Jeb Bush saying, then I have Jeb Bush saying, what does Donald Trump know about the military?","I'm like a smart guy, you know, I'm really smart. But it's amazing. People are talking about it. They should talk about it more because if you read the book, it says Osama bin Laden, the guy. And the reason was, he was a terrorist that was getting a lot of notoriety. He made very vicious statements toward our country, and I said you better watch that guy.","And what happened, I think, it was 19 months after that he came back and knocked down and attacked viciously with the lives of the World Trade Center. So in the debate which every polls that I won by the way, but these are minor details. Forget it. The second debate and the first debate, Drudge, Time Magazine, Slate.","Everybody. Every single poll, online polls, they all -- believe me I'm not calling up hundreds of thousands of people I can tell you. But Jeb said my brother left us safe. And I'm OK with it, but then I said to him what about the World Trade Center, the biggest attack ever. They should have known about it and they could have known about it. And I'm not blaming George Bush.","I'm not blaming anybody. I could also blame Clinton, right? No, because in all fairness to Bush, he was only president for about nine months, in all fairness. And Bill Clinton gave a speech and he knew Osama bin Laden just like I did, and he gave a speech talking about Osama bin Laden so we can blame Bush.","We can blame everybody. I will say this. You know the expression the buck stops here. You're president, the buck stops here. That's the way it is. And it's one of the reasons that I say, and I mean this so strongly, we owe a lot of money $19 trillion, I told you. But we've got to build up our military, so big, so strong, so powerful.","Got to do it. We've got to do it. We've got to do it. So powerful that nobody is going to mess with us. Nobody. I don't want to use it. I don't want to use it. Nobody, nobody is going to mess -- you know we're working on an aeroplane right now. I don't know if you've been reading about it. Billions and billions of dollars for one plane and a test pilot.","Did you read this story? I love the test pilots. These are great guys. These are seriously good flyers. Do we agree? And they came out of the plane, billions of dollars. And they say, this thing doesn't hold a candle to the old one that we used to fly. It doesn't maneuver as well. It doesn't work. We're talking billions and billions.","What are we doing, folks? What are we doing? What are we doing? What are we doing? So, so we need a special leader. We need a special leader. We need a special -- so let me just say, so the headlines blared. I don't believe those polls by the way because both of those pollsters do not like me. I'm telling you.","Now I'm not saying anything that goes on illicitly with polling, OK? I would never ever say that. But both of those polling groups do not like me at all. And I disagree. I don't believe it. I was just interviewed -- where is Jake Tapper is he here? Jake, where's Jake? What happened to Jake? No, he's a good man.","He just interviewed me. Watch me 9:00, Sunday morning, Jake Tapper on CNN. What the hell happened to Jake? He's here someplace. He's here someplace. He's a good man. Oh, he's -- maybe he's shy but he's here so -- but it's good, it's here -- it's 9 O'clock on Sunday morning, CNN. But I think we're going to do great in Iowa.","I think we're going to do really great. But here's the story, I have never seen such press. I mean, my wife called she said Are you OK darling? How bad is it? How bad is it? They made it sound like it's the greatest defeat in history. And the bad part is, is that I wanted -- it wouldn't have even been mentioned.","It wouldn't be a story. But then I said to myself look, I have to talk. I'm going to be nice. I'm going to be nice because I have to I have to talk about -- Ben Carson. Thank you. Thank you. Ben Carson is the one that's leading Iowa supposedly, OK? And I said, I got to talk about him.","A friend of mine who happens to be a great, great athlete. He happens to be African-American. He calls himself black. He said I'm black. I said I can't say that it's not politically correct. It's true. He said, Donald you're the greatest trash talker that ever lived. And I never thought -- he says this to me. He said and I never thought I'd say it about a white guy.","Can you believe this. And I said I don't know if that's true or not because I refuse to go -- he said when you said low energy for Bush, you defined him so incredibly, it was over. He can have $125 million in the bank, Donald. It's over. It was just defined. But I said, but Ben Carson is super low energy, right?","Super low. He's super low. Super low energy. We need tremendous energy. We need tremendous energy. We need energy. So Hillary Clinton the other day. She said I don't like Donald Trump's tone. I don't like his tone. Tone, can you imagine? My tone, my tone. Think of it. She doesn't like my tone.","We have people. They're Christians and their heads are being chopped off in the Middle East. We have people that are dying by the thousands all over this country. We have people that are being drowned in cages. It hasn't been like this since medieval times, it's true. Who would ever think? And she's talking about my tone.","Think of it. Think of it. We have to be politically correct so they can chop off the heads of an American Christian. And we can't waterboard, it's not fair. No, it's not fair. No, no, think of it. Think of how -- think of how crazy and how lopsided our country has become. Think of what's going on. Think of what's going on. Think of why we're not respected.","Think about Sergeant Bergdahl, a traitor, a traitor. Think of it. He's a dirty, rotten traitor. Six people died going after him. They died, six young, incredible, brave people died. The deal is we get traitor Bergdahl, they get five of the best people that they have that they've been after for 10 years. They get five killers that are right now leading and back on the battlefield trying to kill everybody, including you.","And we get Bergdahl, a traitor. We get Bergdahl. And then, two days ago it came out that Bergdahl, they didn't want to put him in jail. You know in the old days, boom, firing squad. No, it's true. I love the Second Amendment. I love the second. So two days ago, it comes out that Sergeant Bergdahl won't even have to go to jail.","Well, think of it. Where have we gone? Where have we gone? What's going on with our country, OK? I'll tell you one thing. If I win, it's not going to be my most important job. Not if, we have to say, hey look, look, they're all going. Not if, when. All right. All right. OK. I have a -- you know what?","The word should be, you know what? They're going crazy up here. They're saying when, when, when. So when. OK, when. When and I hope so because I tell you we can make our country so great again. We'll make it so great again. But I promise you, we will be reopening that Bergdahl disaster. We will be reopening it. It's going to be -- a lot of things are going to be reopened.","There are a lot of things going to be reopened. You're going to have a lot of things Rio. So I went to my people and just like Doral, I got it for $170 million, everyone thinks it's done. I say let's make it $150 million. They say how can you do that? You signed a contract. I did, but the place just like that.","We have deals with China. Get it done. Somebody said well they're signed. I said that's OK. They violated every deal we ever made. Well, they violated. That means they're in default. That means they're in default, OK? So I said to my people, two weeks ago I said, go back and tell me what is our trade imbalance with -- I picked three countries, China, Japan and Mexico.","I just want to find out. I'm just curious. I'm just curious. So Mexico and I love Mexico and I love the Mexican people, but their leaders are too smart for our leaders, Ay yay yay. Our leaders are so stupid. They're so stupid. So with Mexico, we lose about $45 billion a year. Would you say that's a lot? But that's OK because that's peanuts compared when you hear -- Japan, we have an imbalance of $70 billion a year, $70 billion.","It's -- most people don't even know what that is. What does it mean? The number is so massive, it's not even recoverable. But I can recover. But here's the beauty and I love China. They buy my apartments, they give me $25 million. I do them like hotcakes. Bob. But China's the most unfair because well, Japan's right there.","You know Japan sells those, they just devalue the hell out of their currency. You saw that Japan, but China gave the biggest, greatest devaluation in the last two decades, meaning 20 years. The biggest devaluation. So I said what's the trade imbalance. They told me Mexico first. I said well, that's a lot of money.","Then they said Japan, I said well, that's even more money. I said give it to me with China. Almost $400 billion a year we lose. How stupid are we? How? We should be ashamed of ourselves. How stupid are we? And I don't blame China. I don't blame them at all. I have friends from China. They used to come up and see me, say oh Donald, we can't believe, we can't believe that we get away with this.","It's unbelievable. Your people, they are incompetent. Then I said I'm running for president, they called me, no, we were only kidding, you're actually amazing. They had no idea I'd be revealing their conversation. They can't even believe they got away. First of all, when China sends us their goods, there's no tax there's no nothing.","When we send China, number one, they won't accept them. If they do accept them they have massive taxes and tariffs. It's a one way street. It's a one way street. A friend of mine, great manufacturer. Can't get his goods in and he manufactures great stuff. Can't get his goods in China. He calls me, I can't, I can't deal with these people.","Then finally he gets them in, they charged him a tax that was so high, I can't tell you because nobody's going to believe how high it was. These are smart people but I have people that are smarter. I have people, true. I have people. I mean, I have some of the great business people -- They're all calling me. These guys, friends of mine, some enemies.","I even have enemies calling. I have guys that are so smart and some I don't like. Some I can't stand. Some are horrible people. Actually, I know one that's so bad as a human being. He's the worst human being I've ever met, but he's an unbelievable negotiator. I said Irving come on you're going with us. And these are wealthy people.","These are really wealthy people, and they're all calling me. They all want to get involved. I have a great guy, really great, great businessman, great everything. Carl Icahn. He called. I want to get involved. I want to help. He doesn't want money. He doesn't want a salary. You know all these people representing us, they want salary.","They give $2000 to somebody and now they're supposed to be paid for the next eight years by some stupid politician, OK? No, no. Carl Icahn wants to represent the country for nothing. Now if I say -- and he's a great guy, and he's a great -- I don't care if he's a great. He's a great guy but I don't care.","Because I have others that aren't great guys, but they're great and what they do. I know the great ones. I know the bad ones. I know the guys that are overrated. You've got some overrated. You've got some that are highly overrated. I won't use them. I have some that nobody ever heard of that are better than all of them.","They're great. We have the most talented people there are. This isn't going to be political. This isn't going to be political hacks. Now, if I tell Carl go watch over China for me Carl. Just watch over China. Trust me. Good things are going to happen for us. Believe me, really good things are going to happen.","I mean, we have a thing right now going on, it's called corporate inversion. Nobody knows what it is, but companies have trillions of dollars in other countries. And we can't get it back into this country. You know that, right? You've been hearing about it. Trillions. They know the number is $2.5 trillion.","I say it's much higher than that, nobody really knows. I think it's right. So at least $2.5 trillion is offshore, all these different countries, and what we're doing is our companies are going to and they've already started leaving the United States. A lot of it's luck. So what happens is, the Democrats and the Republicans both agree that we should bring them home -- who cannot agree for three and a half years they've agreed, and they still can't make a deal.","It's gridlocked in Washington. It's lack of leadership in Washington. And we're going to stop it. We're going to stop it, OK? We're going to stop it. The other day -- and it's going to be amazing. We're going to have a dynamic, a really dynamic country. The other day, I watched the General being interviewed.","And I said to a group before. Why the hell is a General being interviewed on television? I don't want my generals being interviewed. I don't want them telling what we're doing, where we're going? Can you imagine General George Patton who used to walk in a room with blood pouring out of his eyes. Do you think this guy's going to be interviewed on CNN?","I don't think so. I mean, I'm watching this General be interviewed and the first thing is that -- I love great generals. I love General MacArthur. You know, to this day, he had the highest marks. I'm a big fan of academics believe it or not. But he had the highest marks in the history of West Point, highest average.","That's a smart guy. But his biggest problem is, he hated to listen to Dwight Eisenhower because Dwight who is a great guy, but he was at the lower part of his class and MacArthur was the smartest guy probably ever at West Point at least according to Acade -- and he couldn't believe that he had to take orders from Ike.","I mean, there's so many interesting stories, but could you imagine, could you imagine General Douglas MacArthur being on television saying the following. The question was by a very good man asking the questions said what do you think of ISIS? Can we win? And the General looked at him said, oh, it's going to be very tough.","It's going to be very, very tough. I don't know. It's going to take a very, very long time. And I looked at this guy and I said No. 1, he's a weak person. I -- you know I'm very good. You know deals aren't deals, deals are people. When you do deals, it's people not deals. Everybody always says deals, deals are people remember it. I tell kids, deals are not deals, deals are people.","But I looked at this General. I said I don't want him. I don't want him. I will find the smartest and smart is very important. Toughest, you know, we got rid of a very smart one. I'm not going to mention names, but we got rid of a guy, remember? Because he was using foul language to a magazine. He was tough and mean and nasty.","And the troops really was -- and we got rid of him because he was tough. I will find the General MacArthur. I will find the General George Patton. We got him. We got him. They may not be politically correct -- Who cares. Who cares, but we're going to find them and we're going to clean things up, and we're going to -- we're going to have a great country again.","We're going to have a great, great and respected. We're going to have a respected country. So we have a lot to do. We will build the wall. We will build wall. We have no choice. And by the way, people will come into our country, but they're going to come in legally, legally. You know, I appreciate whoever the hell yelled out will you build the wall.","Because to be honest in this group, I wasn't so sure I should be talking about walls. Does that make sense? See tomorrow. Tomorrow in Jacksonville, I can talk about walls believe me. But in this one, I was a little hesitant to talk about it. Thank you. Thank you. By the way, I say this all the time and people bear it out.","A radio host Hispanic show in New York said you know, he was interviewed two weeks ago. He said you know, my audience is all Hispanic. They love Trump. They love Trump. And let me tell you, let me tell you. Who wants to stop illegal immigration more than anybody, the Hispanics that are in our country legally, it's true.","It's true. So just to finish up, our country doesn't win anymore. You know that, right? Am I right? We don't win. When was the last time we had victory? We lose with China on trade. We lose with ISIS. We lose with Iraq. We don't know what we're doing. Iran just made the single greatest contract I have ever seen anybody make.","We were represented by a man that should be ashamed of himself. A man, Secretary Kerry that should get the hell off a bicycle. Here's a guy, falls off his bicycle during the negotiation, breaks his leg. We were represented by incompetent people and it's not going to happen anymore, folks. Not going to happen anymore.","And let me tell you something, if and when I win, I'm not -- so if and when I win, we are going to have so many victories. It's going to be so nice. It's going to be so nice. We're going to win on trade. We're going to win at everything. We're going to terminate Obamacare. We're going to be terminated. It's going to be replaced with something much better and much less expensive for you and for the country.","Let me tell you, Obamacare was a dream for the insurance companies, they'd made a fortune with Obamacare. They've made a fortune. And your premiums are up 40%, 50%, 55%, your deductibles are through the roof. You'll never even be able to use it. It is so bad, we're going to repeal it and replace it with something great.","Great. We are going to bring back the American dream. And we -- and this is as sure as you're standing here tonight and look around, folks because this is a movement. This is something very special and it's happening all over the country, not just here in Miami. It's happening all over the country. You'll see it tomorrow in Jacksonville.","It happens all over the country. We are going to make America great again. Thank you. Thank you very much."],"text":" That's amazing. Great. Wow. Wow. Beautiful. Thank you. Thank you. Man, this is something special. You know I said to all of my managers, I just want to do it here. I said you may not be able to get the cars. I don't care. The place is 100% full. And I know a lot of you had to walk a long distance to have you here is great. Thank you. Thank you, unbelievable. You know, thank you. I want to start by thanking the fire department. They have a lot of people in here, I have to tell you. And I want to really thank the fire department and the police and they're here someplace. Hey fellas, come up here. Come up. Come up here. Come here. Get up here. These guys have been so incredible today with the traffic and everything. And I just want to thank our police department. They have been absolutely incredible. Look at these guys. Look at these guys. Nobody going to mess with them. Look at this. Thank you very much, fellas. They don't want to leave the stage. They'll never leave. And the fire department likewise, they've been incredible. So thank you very much. You know, what a crowd, is there nothing like Miami. Nothing. Nothing. Nothing like Miami. Incredible. So when I was a little boy, my father always loved Doral, always. And he said come on son. And he didn't play golf. He was a worker. He didn't want to play golf. He didn't have time to play golf. And he had a beautiful swing actually. But he played very little, almost never. But he used to love coming here, and it was the hottest resort in the country. This was a long time ago, I won't say how many years because I like to think I'm a very young person, but a long time ago, at the beginning. And he would say let's go and we'd walk around. And who would have ever thought that someday I'd own this place, right? Who would ever thought it? Who would ever thought, but what happened is Doral is very interesting. It had five courses, almost 800 acres right smack in the middle of Miami. Incredible location right near the airport. You're ten minutes away and always did well. It was always one of the top places. And then sadly, Wall Street got a hold of it, the original developer, boo, boo, boo, boo. Oh they're going to pay tax. Don't worry about it. Their friends of mine, but they'll pay. They're going to pay. Don't worry. But you know, you know, what happened is, it became a money thing. And it was like playing cards, bing, bing, bing, and they traded every year and every three years somebody would make a lot of money. It was like musical chairs like this and they'd sell it. Then somebody would own it for three or four or five years. Wall Street and they'd sell it. Make a lot of money. Always made a lot of money. Everybody made a lot of money with Doral except for the last group that I bought it for. You know, it was like musical chairs. And I bought it. And when I bought it, I bought it from a smart group, but the market had crashed. You know all about the crash. And I got it for the right price. I signed for x dollars. Lot of money, $170 million, but then, I said you know maybe I can make a better deal before I close. So I went into closing with Ivanka. We know Ivanka. We love Ivanka, right? Right? I went in with Ivanka and I said, watch Ivanka. Let's see if we can make $20 million. It's true. So I have a contract for one hundred -- I never told this story actually. I have a contract for $170 million or suspenders without the jacket, right? You know the jackets were behind the seat. They were all like Tom Cruise, and you couldn't get better central casting. In fact, all of that media, look at that media back there. Look at these people. Wow. No, they're all right. I'm going to tell you some media stories. So no, but they're central casting the red suspenders, handsome, beautiful, smart, top schools. They will go to Harvard. They go to Wharton. They go to Stanford and I said, I want to show off to my daughter. Does that make sense? You know I have this great daughter so I go in and she said Dad they're not going to cut, you have contract for $170 million. Well, I said that's right. So does Iran have a contract that doesn't mean we can't make it much better. You know, right? So, so what happens, I tell these guys there's no way I'm paying the $170 million. I'm not doing it. I'm not doing it. They said you have to pay it. You have to pay it. Beautiful guys. You have to pay it. You really have to. And I said there's no way. That's all right. Don't hurt him. Don't hurt him. Don't hurt him. You can get him out, but don't hurt him. We don't want to you know that. You know that. Great. Great life. It's a great life. It's a great life. That's all right. That's what the country is all about. I mean, we've got to be able to speak and every once in a while will be a little bit disrupted, but it doesn't take long. It doesn't take long. So let me just finish the story. Thank you. Too bad we had to throw him out, but sometimes you have to throw people out, right? You have to do it. At the door. Look at that sign. Look at the size of that sign. Can you believe that? Wow, thank you. Beautiful. I think I'll tell my people. Let's bring that home. And by the way, we have plenty of time tonight. It's going to be -- I'm here all night. You know, you know, tomorrow night we're in Jacksonville Florida. We have at least 15,000 people, probably 20,000 people tomorrow night. So it's going to be great because things are happening. So anyway, so let me tell you because it has to do with the country. So I go into that room, I say fellas, the contract is not right. This place is in much worse shape than you told me. I've gone all of -- you have to have it signed first before you can do this. I've gone all over and it's not fair. What you're selling me, you shouldn't be selling. I'm not closing this deal. I'll give you $100 million. Remember, I want to impress my daughter. The Art of the Deal and I meant it, nothing wrong. I said it wasn't in the shape that you're supposed to be in you know. So I ranted and raved like a lunatic for about five minutes about condition. And they said we're never going to cut $0.10, within about two minutes I said, would you take $20 million off. They said, would you agree to $20 million, Mr. Trump? I said no way, you've got to do it less. So within about four minutes, I saved $25 million, I cut the price. Can you believe? No, can you believe? And they said and I'm only telling the strikers, we should be doing the same thing for our country, right? Right? Right? So my daughter was very impressed. And I mean, the whole thing took less than five minutes. And the actual number after tax -- I actually saved, would you -- I actually saved $20 million. And I just said Ivanka, we just bought the furniture. That's very nice, right? So then I had a decision to make. We have this great place. I had a decision. Legendary place and the decision was do we fix it? Do we fix it? You know, by the way, you know the saddest part? You have people like that. There's a total of probably three over there and five over there, and they'll be the story tomorrow, not the thousands of people that love our country. It's amazing. It's amazing. No, no. The sad part, I had an incident like this two weeks ago. We had 9,000 people in an arena and we had five people protesting. They became the story, it's too bad. All right they're gone. You know, we have -- we'll have little pockets. Little pockets but it is a shame. I mean it just shows, so we have thousands of people. And you'll have three or four people protest. And tomorrow morning protesters at Trump. It's one of them. So then I had a decision to make. And the decision was, do we give it the B job, the C job, the A job? What do we do? And we gave it the A plus job and we built something that we love. We built something that we love, really love. And what happened, let them get out. Go ahead, get them out. See the first group, I was nice. Oh, take your time. The second group, I was pretty nice. The third group, I'll be a little more violent. And the fourth group, I'll say get the hell out of here. So, so I had to make a decision. What do we do with Doral? Do we give it the really best job and basically rip it down and build a new magnificent place because it was really old, really tired, the bones were tired, the whole place. You people know, a lot of you are from the area. And I said, we got to do it right. We got to do it right. And we basically, as you know, new clubhouses, this room knew. This room is one of the great ballrooms. We have five ballrooms. We have 700 rooms. We have the golf courses are world class, and we wanted to do it right. And a man just came up to me outside. He hadn't been here in 25 years and it was very interesting. I won't say he was an older fellow, but he was an older fellow. And he said, you know Mr. Trump, this place is magnificent. And by the way, David Fader wherever the hell you are. David where are you, David? David Fader is our president and general manager. He has done some incredible job. And this is now the hottest resort of its kind anywhere in the United States. It's bringing tremendous business to the Miami area and the Doral area, and it's become the hottest place. So it's really good. In fact, the PGA Tour just gave us a 10-year extension on the tournament which they never do. So that's how good it -- they never do that. So it's become a really, really, successful place. But this gentleman came up to me and he said, and it was so simple and yet it was so beautiful. He said, Mr. Trump I haven't been back here in 25 years. It was in very, very bad shape. I actually bought it out of bankruptcies from some people that I know very well. That are killers but they didn't really know what they were doing in this case. And I said, well, that's very nice that -- you know Mr. Trump, if you could do the same for the United States as you did here, it would be unbelievable. Unbelievable. True. But it was great. I thought it was great. I thought it was great. And you know in its own way, doing it for the United States might be easier than what we had to do here. As crazy as it sounds. So, and that's what we have to do. We owe $19 trillion. We're desperate. Our infrastructure is is in such trouble, such trouble. Hey, isn't this more fun than having like a normal deal, right? Right? I mean, supposing we had like a normal speech, we talk and talk and talk. The evening ends, we go home, go to sleep. This is more fun, right? You know? You know they used to call it the silent majority but they don't use that anymore because frankly. It's no longer silent because we're not going to take this crap anymore. We're not going to take it anymore. We are not going to take it anymore. So it is true. You know for years, you haven't heard that term silent majority. I don't know, it was a long time ago and people thought it was politically incorrect, and I started using it. But then I started realizing, honestly, it's not silent. There's nothing silent. Everywhere I go we have the biggest crowds. I mean, we left Oklahoma 15,000 -- 20,000. Dallas Texas' Mark Cuban's arena where the Mavericks play, we had 20,000. Moby, Alabama we had 35,000. I go to Iowa. I go to New Hampshire, no matter where -- South Carolina. Unbelievable crowds all over. And there's love in the room. There's just love in the room. It's incredible. It's incredible. And you know -- and there's nothing silent about it. We're sick and tired of incompetent people running our government. So I did something today that was quite exciting, although, I think actually owning Doral is more exciting, but that's OK. But I did something today that was interesting and it got a lot of press. I see it's got a lot of press. They have these things called super PACs. Nobody knows what the hell they are, what they mean. It's the dumbest thing I've ever seen. And all of the candidates have super PACs and they're controlled to a large extent by investors, they're controlled by lobbyists, special interests, countries, countries. You know, when you wonder why our politicians make such bad deals with foreign countries and with other deals, it's because they're totally controlled by people that benefit even if our country doesn't benefit. It's true. It's true. And the super PACs are a disaster. You have Jeb Bush. Did anybody ever hear of Jeb Bush? You have Jeb Bush, has $125 million. I honestly -- I don't think it's going to help him. I'll be honest. If it helps him then I can't figure the whole deal out. Hey, look I used to be one of those guys that would like give a lot of money, a lot of money. I know the lobbyists. And you know when they come up to me and say we want to give you money. When you go to No. 1, everybody wants to give you money. It's incredible. But they don't care so much about anything other than the companies they represent. They don't care so much and some do, but most don't. They want influence, they want power, they want to take these people like little puppets, and they want to say you do as I told you because I gave you $5 million and you better do it. Well, nobody's giving me anything, OK? Anything. Nothing. And so what happened is, I noticed over the last couple of weeks, everybody's forming a Trump super PAC. I'm not forming. They're all over the place. I thought we had four. Then I heard we had five. Then I heard we had eight. Then I heard we had nine or ten. Now, I don't know. Are they good or is it a scam? Because you know, some of them, some of them seriously, some of them I assume are like legitimate people. They love Trump, they want to do things, they'll go and do whatever they're supposed to do. And you don't talk to them, you know, they're supposed to be like independent. And others, I would imagine they probably pay themselves salaries and who the hell knows what happens with all the money. So we did something today. That was very -- well, all I know is I haven't gotten any of this money. None of it. I feel guilty about that. I feel a little foolish actually. And we wrote notices and notifications sent them all to the government, to the people, to everybody. That we don't want super PACs. That we don't want anything to do with them. To close them up ideally, hopefully, to give the money back whatever money is raised. I mean, I saw it the other day on one of the programs, two young nice looking guys, big fans of Trump, I think. And they opened an art of the deal. I think it's called The art of the deal super PAC, after my book, right? And by the way, we're having a new book come out on November 3rd. I think it's going to be great. I think it's going to be great. But the art of the deal super PAC and they look very good, and they talk about we love Trump, where they're going to do this. And you know, probably, it's true. I don't want to take any -- I don't want it. I don't want any help. I don't want -- the one I do -- the one thing we do, people send in small donations like small ones for -- a woman $7.50 with about a 4-page letter. Another woman $50, $30, $90, $250. But that I love because number one, you can't send it back. How do you send a letter back to a woman who loves the country, who's giving a lot of money. That's like giving $1 million to a rich person. How do you send a $7.50 back? You can't. You can't. There's no letter you can write. It's true. There's no letter that you can write to that woman to say, we don't want your money. OK. So that's the only stuff and we take it and it comes in and that's the only stuff we want. But we don't want any of the, you know, the big money. We don't want any big money. And so today, I did something, started getting big press actually this evening because nobody's ever done it. I disclaimed and disavowed all super PACs. I don't want any of -- I don't want they're money. I don't want anything. And I said very strongly when we wrote the letter, and I told my attorneys and everybody that I think every candidate running right now for the presidency should disavow their super PACs. They should disavow their super PAC. You know -- and these super PACs are really running the campaigns. They're running the campaigns. For instance, I hear in Iowa, that there's going to be a merger of Ben Carson and I like him he's a nice guy, they're going to merge the super PAC. He's got two of them. And they're going to run and they've been running his campaign, and he doesn't hardly have to go there. And I'm saying what am I? Why? Am I not allowed to do anything? It's really unfair. But I think, they shouldn't be allowed to do that. I don't know if they're allowed to do that. But how do you have super PACs running campaigns. Now and then when you think of it, so you have these super PACs with millions and millions of dollars and they're running a campaign. Do you think those people that are running those super PACs and those people those super PACs and those people that are giving tremendous money to the super PACs, do you think they control those candidates 100%? The answer is yes. And I don't want any confusion. And I said it, I don't want it to confuse you. People are calling. Well, you have all these super PACs. Therefore, I said, I don't even know who these people are. So here's what's happening, all candidates disavow your super PACs. Run for office and be proud, but disavow your super PACs. Drop them. Drop them. And ideally, give the money back to the people that put it up there. That's what you should do. So we'll see what happens. We'll see what happens. But to me it's very important. This Super PAC thing is a terrible thing that's happening in this country. It's a terrible, terrible thing and it's controlling our politicians. They're puppets. It's controlling our politicians. I mean, Bush had somebody the other day going to Berlin, Germany to pick up money. Berlin, Germany. What do you think Germany gets out of that one, OK? Other people have tremendous amounts of money put up and we can't have it anymore. We have to bring honesty back to politics, folks. Got to do it. Got to do it. So -- Uh, thank you. Thank you. Thank you. So a very interesting thing happened, very sad today. Very, very sad because you know the press is very dishonest, right? We know. Not all of them. Not all of them, but we have more back there. Look at those cameras, look at those suckers, boy. They are all covering, they are all covering, they are covering Trump, and they're covering you, and they'll all be with us tomorrow night in Jacksonville. And by the way, if you can, it's going to be wild, come back up. It's going to be -- So it's going to be wild. So a crazy thing happened. I love polls. Everybody knows I love polls and they said I wonder what would happen if Trump wasn't No. 1 in the poll. And somebody said oh, if he wasn't No. 1 maybe he'd drop out of the race. Believe me, I'm not dropping out of anything. That I can tell you. Never ever. I'm not dropping out of anything. So poll came out, big one, ABC Washington Post that has to be killing everybody. It's a national poll that was on Friday. We're killing 32. Think of it, 32, you know, every -- you notice every week I started at three. First when I was slightly before I ran, but -- because nobody thought I was going to run. Nobody thought I was going to run. You know they all said he's never going to run. If he runs, it doesn't matter. What does he know about politics, right? I've only dealt in politics all my life. That's all. But -- so it started at three, it went to eight, went to 12, went to 16, went to -- now as of Friday nationally, 32, and then another one came out. Another one came out last week, Reuters. Listen to this one, 33 to 15, 15 is Ben Carson. He's in second place, but they kept saying, oh, if Trump ever lose because you know what? I mean, I'm getting spoiled. From the time I ran and from the time I went up -- when I was at 12, they said all right, his peak, his peak. You know you're hearing the same crap, right? Then it goes to 16, 17 the next. Oh, that's his plateau. He's plateaued. The word plateau. They love that word. So he's plateaued. Then the next week it went to 21. Well, that's it. That's it. By the way, 21 is not bad when you have 17 people, right? 21. You know, if I'm a card player, I will rest on 21 with 17 people. I'm not losing. So I was No. 1 at 21. Then it went to 25, oh, this is it. You know these talking heads. These are among the dumbest human beings I've ever seen. That's true. It's true. Some of them, some of them are true, and some of them are coming along. I mean, some of them were so terrible and so nasty and now they're coming along. I mean, they're becoming like, I don't know about fans, but they're saying a poll just came out we're 81% to win. I mean, can you believe it? I didn't know that, 81%. Who would have thought this? Rasmussen, Rasmussen, the Rasmussen I saw -- I'm walking up here one of my people stopped me, I said excuse me, I got to make a speech. Oh no, I'd like to talk to you. I said what do you want to talk about? They're introducing me and Rasmussen just said nationally, I'm beating Hillary. Just came out, just came out. Just came out. Hey, what's the big? So now I said, I'm glad they stopped me, right? I'm glad they stopped me. So anyway, but a bad thing happened, bad. So look, I mean, I just wrote down a few of them, and then I'll tell you what was bad. So I'm winning New Hampshire by like 22 points. New Hampshire's unbelievable, great. I'm winning New Jersey by a lot, a lot. And Chris Christie is a friend of mine. But I'm a 29, he's at five. That's a lot, that's a big difference. I'm winning Florida. I'm beating Bush and Rubio, right? Right? I'm winning Nevada by a fortune, but here's what I like the best. Nevada tremendous Hispanic population. I'm winning with the Hispanics. Big winning with this base and I keep telling everybody. I'm going to win with Hispanics. I say it to everybody. I love the Hispanic. I have thousands of Hispanics. Thank you. I love you too. I love you too. True. I have thousands of Hispanics working for me all over, you know, in this place. I have, you know, 1,800 -- 1,900 employees and many Hispanics. They're unbelievable people, unbelievable workers. I love them. I love them. I love them and they know. They're smart. They know I'm bringing jobs back from China, from Japan, from all these countries. I'm bringing them back and nobody else can do that. I know the people I'm running against, including Hillary, No, they can't do that. They can't do that. They can't do that. I mean honestly, Ben Carson cannot do that, folks. I hate to tell you. They cannot do it, can't do it. They're not going to do it. So here's the story. So winning in Florida, winning in Texas, OK? Winning in Texas, big. Winning in South Carolina, winning in North Carolina. Winning in Ohio against Kasich which is interesting. And he's a good man. He's a good man. But I'm winning in Ohio against Kasich. I'm winning in Massachusetts. Listen to this one. This is one I love. Maybe, I don't even know why Massachusetts. I'm at 48, 48, 48. And second place is 12. Boy, I'm going to have to do a really, really bad crash to blow that one. So what happens? Let me give you the bad news, right? And that's been going on now for 100 days. Did you sell -- they were celebrating on television, one hundred days on the top of every poll. Thank you. One hundred days on the top of every single poll, national and state. OK. That's the good news, right? Let me give you the bad news. The press was so happy. You had -- oh, the press. I love Iowa. And I honestly think those polls are wrong. I'm Presbyterian. I'm a great Christian. It's true. True. They say in the poll, I'm the best leader. They say in the poll, I'm the best on the economy by far. It's not like a by two points, like by triple. How, how important is the economy, right? Remember, it's the economy. Remember that? Is the economy stupid? I mean it's the economy. So I'm leading on the economy. I'm leading with men big league. I'm not doing as well with women. Will you help me? What's going on? What is -- which I don't -- look, nobody respects women more than me. Greatest person ever was my mother. Believe me, the greatest. Nobody's going to be better or do more for women than Donald Trump, that I can tell you. That I can tell you. And I think they know it. I'd rather do well with women than with men. With men, I'm doing great. I'm killing everybody. With women, nah, I'm not terrible but I could do better. So, so what happens, what happens is the poll comes out, right? And the press was so happy. Headline. Now just so you understand, if I were in first place, it wouldn't even be discussed. Nobody would mention it. But here it is all day long. Oh, my head. I turn on the television, headline, bigger than Hillary's talk yesterday on Benghazi. So headline, here's the headline, headline. The biggest story -- you see it. Am I right? Trump falls to second place in Iowa. I said, no way. The press was going crazy. They loved it. They were so happy. I won't mention the names but you know some of them. You know some of them. We have a breaking story, Donald Trump has fallen to second place behind Ben Carson. We informed Ben but he was sleeping. Now, Donald Trump has fallen to second place. You know it's funny. You got all these guys -- two people dropped out, right? Perry, you know about that. And you know the governor of Wisconsin, very nice guy, right? Walker, they both dropped out. They became so vicious to me. They -- Perry he was such a nice guy like two months ago. He couldn't have been nice. He went to Washington to make a speech about me. It was so vicious that those that loved me started crying. Maybe that. That was vicious. It sent -- then and we had so many. You had Lindsey Graham. I don't even know the guy. The only time I know him is when he calls me constantly asking for campaign contributions. So he became so vicious and violent, I mean, and every time they get more and more vicious and violent, they go down, down, down. Fact, Lindsey Graham was at five and he hit me as hard as you can be hit. He said I don't know anything about the military, what do I know about foreign affairs except one thing. I wrote a book in 2000, right? And Joe Scarborough yesterday covered it. I wrote a book in 2000, before the World Trade Center came down and I said that there's going to be a big attack in this country. And I said, probably by somebody they said it's going to be much worse. You remember the first attack which was a horrible attack, but it was a small attack by comparison obviously, to the second one which was horrendous. The worst attack in the history of our country worse than Pearl Harbor. At least with Pearl Harbor, they were attacking the military. They weren't attacking innocent civilians of which many thousands died, and are still, are still living in pain and suffering. Not to mention the fire departments, the police departments, and all the guys that had to breathe that air for long periods of time. So thank you. So I have it in the book. Watch Osama bin Laden and Scarborough goes whoa, when was that book written? Before the World Trade Center. Whoa and he's a good guy. He was like, he couldn't believe it. And I don't get any credit. They don't give me any credit for it. And then I have Jeb Bush saying, then I have Jeb Bush saying, what does Donald Trump know about the military? I'm like a smart guy, you know, I'm really smart. But it's amazing. People are talking about it. They should talk about it more because if you read the book, it says Osama bin Laden, the guy. And the reason was, he was a terrorist that was getting a lot of notoriety. He made very vicious statements toward our country, and I said you better watch that guy. And what happened, I think, it was 19 months after that he came back and knocked down and attacked viciously with the lives of the World Trade Center. So in the debate which every polls that I won by the way, but these are minor details. Forget it. The second debate and the first debate, Drudge, Time Magazine, Slate. Everybody. Every single poll, online polls, they all -- believe me I'm not calling up hundreds of thousands of people I can tell you. But Jeb said my brother left us safe. And I'm OK with it, but then I said to him what about the World Trade Center, the biggest attack ever. They should have known about it and they could have known about it. And I'm not blaming George Bush. I'm not blaming anybody. I could also blame Clinton, right? No, because in all fairness to Bush, he was only president for about nine months, in all fairness. And Bill Clinton gave a speech and he knew Osama bin Laden just like I did, and he gave a speech talking about Osama bin Laden so we can blame Bush. We can blame everybody. I will say this. You know the expression the buck stops here. You're president, the buck stops here. That's the way it is. And it's one of the reasons that I say, and I mean this so strongly, we owe a lot of money $19 trillion, I told you. But we've got to build up our military, so big, so strong, so powerful. Got to do it. We've got to do it. We've got to do it. So powerful that nobody is going to mess with us. Nobody. I don't want to use it. I don't want to use it. Nobody, nobody is going to mess -- you know we're working on an aeroplane right now. I don't know if you've been reading about it. Billions and billions of dollars for one plane and a test pilot. Did you read this story? I love the test pilots. These are great guys. These are seriously good flyers. Do we agree? And they came out of the plane, billions of dollars. And they say, this thing doesn't hold a candle to the old one that we used to fly. It doesn't maneuver as well. It doesn't work. We're talking billions and billions. What are we doing, folks? What are we doing? What are we doing? What are we doing? So, so we need a special leader. We need a special leader. We need a special -- so let me just say, so the headlines blared. I don't believe those polls by the way because both of those pollsters do not like me. I'm telling you. Now I'm not saying anything that goes on illicitly with polling, OK? I would never ever say that. But both of those polling groups do not like me at all. And I disagree. I don't believe it. I was just interviewed -- where is Jake Tapper is he here? Jake, where's Jake? What happened to Jake? No, he's a good man. He just interviewed me. Watch me 9:00, Sunday morning, Jake Tapper on CNN. What the hell happened to Jake? He's here someplace. He's here someplace. He's a good man. Oh, he's -- maybe he's shy but he's here so -- but it's good, it's here -- it's 9 O'clock on Sunday morning, CNN. But I think we're going to do great in Iowa. I think we're going to do really great. But here's the story, I have never seen such press. I mean, my wife called she said Are you OK darling? How bad is it? How bad is it? They made it sound like it's the greatest defeat in history. And the bad part is, is that I wanted -- it wouldn't have even been mentioned. It wouldn't be a story. But then I said to myself look, I have to talk. I'm going to be nice. I'm going to be nice because I have to I have to talk about -- Ben Carson. Thank you. Thank you. Ben Carson is the one that's leading Iowa supposedly, OK? And I said, I got to talk about him. A friend of mine who happens to be a great, great athlete. He happens to be African-American. He calls himself black. He said I'm black. I said I can't say that it's not politically correct. It's true. He said, Donald you're the greatest trash talker that ever lived. And I never thought -- he says this to me. He said and I never thought I'd say it about a white guy. Can you believe this. And I said I don't know if that's true or not because I refuse to go -- he said when you said low energy for Bush, you defined him so incredibly, it was over. He can have $125 million in the bank, Donald. It's over. It was just defined. But I said, but Ben Carson is super low energy, right? Super low. He's super low. Super low energy. We need tremendous energy. We need tremendous energy. We need energy. So Hillary Clinton the other day. She said I don't like Donald Trump's tone. I don't like his tone. Tone, can you imagine? My tone, my tone. Think of it. She doesn't like my tone. We have people. They're Christians and their heads are being chopped off in the Middle East. We have people that are dying by the thousands all over this country. We have people that are being drowned in cages. It hasn't been like this since medieval times, it's true. Who would ever think? And she's talking about my tone. Think of it. Think of it. We have to be politically correct so they can chop off the heads of an American Christian. And we can't waterboard, it's not fair. No, it's not fair. No, no, think of it. Think of how -- think of how crazy and how lopsided our country has become. Think of what's going on. Think of what's going on. Think of why we're not respected. Think about Sergeant Bergdahl, a traitor, a traitor. Think of it. He's a dirty, rotten traitor. Six people died going after him. They died, six young, incredible, brave people died. The deal is we get traitor Bergdahl, they get five of the best people that they have that they've been after for 10 years. They get five killers that are right now leading and back on the battlefield trying to kill everybody, including you. And we get Bergdahl, a traitor. We get Bergdahl. And then, two days ago it came out that Bergdahl, they didn't want to put him in jail. You know in the old days, boom, firing squad. No, it's true. I love the Second Amendment. I love the second. So two days ago, it comes out that Sergeant Bergdahl won't even have to go to jail. Well, think of it. Where have we gone? Where have we gone? What's going on with our country, OK? I'll tell you one thing. If I win, it's not going to be my most important job. Not if, we have to say, hey look, look, they're all going. Not if, when. All right. All right. OK. I have a -- you know what? The word should be, you know what? They're going crazy up here. They're saying when, when, when. So when. OK, when. When and I hope so because I tell you we can make our country so great again. We'll make it so great again. But I promise you, we will be reopening that Bergdahl disaster. We will be reopening it. It's going to be -- a lot of things are going to be reopened. There are a lot of things going to be reopened. You're going to have a lot of things Rio. So I went to my people and just like Doral, I got it for $170 million, everyone thinks it's done. I say let's make it $150 million. They say how can you do that? You signed a contract. I did, but the place just like that. We have deals with China. Get it done. Somebody said well they're signed. I said that's OK. They violated every deal we ever made. Well, they violated. That means they're in default. That means they're in default, OK? So I said to my people, two weeks ago I said, go back and tell me what is our trade imbalance with -- I picked three countries, China, Japan and Mexico. I just want to find out. I'm just curious. I'm just curious. So Mexico and I love Mexico and I love the Mexican people, but their leaders are too smart for our leaders, Ay yay yay. Our leaders are so stupid. They're so stupid. So with Mexico, we lose about $45 billion a year. Would you say that's a lot? But that's OK because that's peanuts compared when you hear -- Japan, we have an imbalance of $70 billion a year, $70 billion. It's -- most people don't even know what that is. What does it mean? The number is so massive, it's not even recoverable. But I can recover. But here's the beauty and I love China. They buy my apartments, they give me $25 million. I do them like hotcakes. Bob. But China's the most unfair because well, Japan's right there. You know Japan sells those, they just devalue the hell out of their currency. You saw that Japan, but China gave the biggest, greatest devaluation in the last two decades, meaning 20 years. The biggest devaluation. So I said what's the trade imbalance. They told me Mexico first. I said well, that's a lot of money. Then they said Japan, I said well, that's even more money. I said give it to me with China. Almost $400 billion a year we lose. How stupid are we? How? We should be ashamed of ourselves. How stupid are we? And I don't blame China. I don't blame them at all. I have friends from China. They used to come up and see me, say oh Donald, we can't believe, we can't believe that we get away with this. It's unbelievable. Your people, they are incompetent. Then I said I'm running for president, they called me, no, we were only kidding, you're actually amazing. They had no idea I'd be revealing their conversation. They can't even believe they got away. First of all, when China sends us their goods, there's no tax there's no nothing. When we send China, number one, they won't accept them. If they do accept them they have massive taxes and tariffs. It's a one way street. It's a one way street. A friend of mine, great manufacturer. Can't get his goods in and he manufactures great stuff. Can't get his goods in China. He calls me, I can't, I can't deal with these people. Then finally he gets them in, they charged him a tax that was so high, I can't tell you because nobody's going to believe how high it was. These are smart people but I have people that are smarter. I have people, true. I have people. I mean, I have some of the great business people -- They're all calling me. These guys, friends of mine, some enemies. I even have enemies calling. I have guys that are so smart and some I don't like. Some I can't stand. Some are horrible people. Actually, I know one that's so bad as a human being. He's the worst human being I've ever met, but he's an unbelievable negotiator. I said Irving come on you're going with us. And these are wealthy people. These are really wealthy people, and they're all calling me. They all want to get involved. I have a great guy, really great, great businessman, great everything. Carl Icahn. He called. I want to get involved. I want to help. He doesn't want money. He doesn't want a salary. You know all these people representing us, they want salary. They give $2000 to somebody and now they're supposed to be paid for the next eight years by some stupid politician, OK? No, no. Carl Icahn wants to represent the country for nothing. Now if I say -- and he's a great guy, and he's a great -- I don't care if he's a great. He's a great guy but I don't care. Because I have others that aren't great guys, but they're great and what they do. I know the great ones. I know the bad ones. I know the guys that are overrated. You've got some overrated. You've got some that are highly overrated. I won't use them. I have some that nobody ever heard of that are better than all of them. They're great. We have the most talented people there are. This isn't going to be political. This isn't going to be political hacks. Now, if I tell Carl go watch over China for me Carl. Just watch over China. Trust me. Good things are going to happen for us. Believe me, really good things are going to happen. I mean, we have a thing right now going on, it's called corporate inversion. Nobody knows what it is, but companies have trillions of dollars in other countries. And we can't get it back into this country. You know that, right? You've been hearing about it. Trillions. They know the number is $2.5 trillion. I say it's much higher than that, nobody really knows. I think it's right. So at least $2.5 trillion is offshore, all these different countries, and what we're doing is our companies are going to and they've already started leaving the United States. A lot of it's luck. So what happens is, the Democrats and the Republicans both agree that we should bring them home -- who cannot agree for three and a half years they've agreed, and they still can't make a deal. It's gridlocked in Washington. It's lack of leadership in Washington. And we're going to stop it. We're going to stop it, OK? We're going to stop it. The other day -- and it's going to be amazing. We're going to have a dynamic, a really dynamic country. The other day, I watched the General being interviewed. And I said to a group before. Why the hell is a General being interviewed on television? I don't want my generals being interviewed. I don't want them telling what we're doing, where we're going? Can you imagine General George Patton who used to walk in a room with blood pouring out of his eyes. Do you think this guy's going to be interviewed on CNN? I don't think so. I mean, I'm watching this General be interviewed and the first thing is that -- I love great generals. I love General MacArthur. You know, to this day, he had the highest marks. I'm a big fan of academics believe it or not. But he had the highest marks in the history of West Point, highest average. That's a smart guy. But his biggest problem is, he hated to listen to Dwight Eisenhower because Dwight who is a great guy, but he was at the lower part of his class and MacArthur was the smartest guy probably ever at West Point at least according to Acade -- and he couldn't believe that he had to take orders from Ike. I mean, there's so many interesting stories, but could you imagine, could you imagine General Douglas MacArthur being on television saying the following. The question was by a very good man asking the questions said what do you think of ISIS? Can we win? And the General looked at him said, oh, it's going to be very tough. It's going to be very, very tough. I don't know. It's going to take a very, very long time. And I looked at this guy and I said No. 1, he's a weak person. I -- you know I'm very good. You know deals aren't deals, deals are people. When you do deals, it's people not deals. Everybody always says deals, deals are people remember it. I tell kids, deals are not deals, deals are people. But I looked at this General. I said I don't want him. I don't want him. I will find the smartest and smart is very important. Toughest, you know, we got rid of a very smart one. I'm not going to mention names, but we got rid of a guy, remember? Because he was using foul language to a magazine. He was tough and mean and nasty. And the troops really was -- and we got rid of him because he was tough. I will find the General MacArthur. I will find the General George Patton. We got him. We got him. They may not be politically correct -- Who cares. Who cares, but we're going to find them and we're going to clean things up, and we're going to -- we're going to have a great country again. We're going to have a great, great and respected. We're going to have a respected country. So we have a lot to do. We will build the wall. We will build wall. We have no choice. And by the way, people will come into our country, but they're going to come in legally, legally. You know, I appreciate whoever the hell yelled out will you build the wall. Because to be honest in this group, I wasn't so sure I should be talking about walls. Does that make sense? See tomorrow. Tomorrow in Jacksonville, I can talk about walls believe me. But in this one, I was a little hesitant to talk about it. Thank you. Thank you. By the way, I say this all the time and people bear it out. A radio host Hispanic show in New York said you know, he was interviewed two weeks ago. He said you know, my audience is all Hispanic. They love Trump. They love Trump. And let me tell you, let me tell you. Who wants to stop illegal immigration more than anybody, the Hispanics that are in our country legally, it's true. It's true. So just to finish up, our country doesn't win anymore. You know that, right? Am I right? We don't win. When was the last time we had victory? We lose with China on trade. We lose with ISIS. We lose with Iraq. We don't know what we're doing. Iran just made the single greatest contract I have ever seen anybody make. We were represented by a man that should be ashamed of himself. A man, Secretary Kerry that should get the hell off a bicycle. Here's a guy, falls off his bicycle during the negotiation, breaks his leg. We were represented by incompetent people and it's not going to happen anymore, folks. Not going to happen anymore. And let me tell you something, if and when I win, I'm not -- so if and when I win, we are going to have so many victories. It's going to be so nice. It's going to be so nice. We're going to win on trade. We're going to win at everything. We're going to terminate Obamacare. We're going to be terminated. It's going to be replaced with something much better and much less expensive for you and for the country. Let me tell you, Obamacare was a dream for the insurance companies, they'd made a fortune with Obamacare. They've made a fortune. And your premiums are up 40%, 50%, 55%, your deductibles are through the roof. You'll never even be able to use it. It is so bad, we're going to repeal it and replace it with something great. Great. We are going to bring back the American dream. And we -- and this is as sure as you're standing here tonight and look around, folks because this is a movement. This is something very special and it's happening all over the country, not just here in Miami. It's happening all over the country. You'll see it tomorrow in Jacksonville. It happens all over the country. We are going to make America great again. Thank you. Thank you very much."}