{"id":498,"author":"Donald Trump","title":"Speech: Donald Trump in Burlington, IA","date":"2015-10-21","link":"https://factba.se/transcript/donald-trump-speech-burlington-ia-october-21-2015","paragraphs":["What a great crowd. Let's straighten that thing out. I like this -- I like this uniform look. She was a little crooked. I want that straight. Like we're going to straighten out our country. We're going to straighten out our country, believe me. Wow this is some crowd. This is a record crowd for this building.","I know it's structurally sound. It was built a long time ago. It's good and strong. We need it. Thank you. Thank you, everybody. Thank you. Thank you. So we had some news today that Biden is not running. And I think he did the smart thing because, frankly, I don't know that he would have won. He wouldn't have gotten the nomination.","I don't think he probably would have. And frankly, I really want to run against Hillary. I really do. That's the one. That's the one I've been -- you know, when you sort of like if you have a baseball team or a football team you sort of get your heart set on something. That's the one we want to go against because you go against that record -- you go against that record, you're just going to win.","We're going to win. We're going to win big. So many mistakes. You know, you look at the world. The world is a tinderbox. It's falling apart. It's blowing up. We are a mess. What's happened to this country between the Iran deal and the Bergdahl, five for one. I call him Mr. Five-for-one. We get a traitor.","Right. What did we used to do to traitors? Who was -- boy, that guy's got -- crazy. You know, they came out with a report. They don't think he goes to jail. They don't think anything -- six people died going after him and nothing's going to -- can you believe this? This is what's happened, but let me just explain.","So I get up in the morning and I turn on television. First thing I see is big, big results. Washington Post ABC comes out with a poll, right? Do we love these polls? Somebody said, \"You love polls.\" I said, \"That's only because I've been winning every single one of them.\" Right? Right? Every single poll.","In fact, they were saying for 100 days. Today's the 100th day. Look at I love that guy. Today is the 100th day that we've been No. 1 in every single poll, think of it. And we're increasing our lead and you know, it's been -- it's really been amazing. We've been increasing the lead but Washington Post today comes out 32% for Trump.","And that's -- you've got to understand. We're talking about 15 people. Used to be 17. A couple have dropped out. They're going to start falling, I think, like flies now. You know when some of these guys have a zero for weeks. It's almost like somebody said they do it for their brand. How is it good for your brand?","One of them Pataki. He had a zero with an arrow going left. That means less than zero. I said, \"Is that a mistake? Is that a mistake?\" So I don't know what they do but they're going to -- a lot of people going to start dropping out,which is good. You get a much better discussion going. Instead of having all these folks around and the whole thing is ridiculous.","But we're at 32%. We're leading everybody by a lot. The closest is 10% next. We had another one Boston Herald in New Hampshire just came out, 28% second is 16%. Think of that, 16%. We have -- oh, I love this one. And by the way, the people in Iowa, the people in New Hampshire, people in South Carolina first have been so unbelievable.","The South Carolina poll is unbelievable. But we'll get to that. Morning Consult, this is the one I love. This is -- you know what's interesting? They do these polls. They take like 300 people. I'm saying, \"How can you do 300 people?\" Morning Consult, that's one of the big online polls. 41%, 41 think of that, 41. You almost say how do you get 41%, think of it, when you have 15 people?","If you had 41% with, like, three people, you have it made, right? But with 15 people, 41% highly respected poll, second is 14%. So it's 41-14, so that sounds good. Now, and you know we're winning very importantly in Iowa. We're winning and we're winning big. We're winning big. Here's one that I love Ohio -- because I like Casey.","I think he's a good guy. In Ohio, we're 27% and Casey, she's at 12.5%. Good governor, good guy, everything. I don't like his view on Common Core. I don't like a couple of his views, which is, you know, but he's a good guy and he is a good guy. 27% and Casey is the governor. The sitting governor is at 12.5%. That just came.","Another one that is incredible is Connecticut, big state, Quinnipiac poll 34-14. 34-14 to second. I love this one. By the way, a couple of the -- beating Hillary nationwide. You love that? That, I love. That, I love. Beating Hillary in numerous states and very substantially. And one just came out two days ago, beating Hillary in the state of Florida, which I love, which I love.","Now the other thing I love, beating the governor of Florida, beating the sitting senator of Florida, who has the highest -- well, think of this, has the highest lack of attendance. We'll say lack of attendance in the Senate. I mean, he's a go. You got to -- you can't talk about working if you don't go to vote and you're a senator, right?","Doesn't that make sense? But in Florida, I'm at 29% and they're -- I won't say but they're really low. They're in the teens and less than the teens. And I tell the story where Rubio actually was a little below and then he went a little above the governor, and they're in the 12s. And I tell the story all the time.","I'm at 29. and the headline said, \"Rubio surges.\" I said, \"Oh, what happened to Florida?\" It's true. I said, \"What happened to Florida? I was doing so well and then I read the article. It says, \"While Trump is at 29, Rubio surged past the governor.\" Big deal. OK? Oh, boy. We have won here. 35 -- and by the way, Pennsylvania beating everybody.","OAN, 35%. Great company, great poll, 35 to 17. I mean, we are just -- I love these polls. And I say to people when they always say, \"You love to mention the polls. Nobody else does.\" I say, \"That's because they are losing. They're not stupid people.\" Right. They're losing. Oh, I could talk about these suckers all night long.","I love them. I could talk about them all night long. So New Jersey, great. Now Jersey -- and I like Chris. Chris is a good guy but I'm at 32, he's at five, which is a big -- Reuters, 33-15. South Carolina, 36%. I'm leading by 18 points, 18 points. That's a lot. You know, in golf they say he's looking for the clubhouse, Johnny.","He's just looking for the -- a lot of truth. We understand -- the golfers understand that. We just want to get in. Get this election going. I wish, you know, like some countries that can call an election, right. They can call it. I want to call it an election. Can we have it, like, tomorrow? I want to do it now.","I want to do it now. South Carolina, 36%, 36%. Lindsey Graham, the sitting senator, three. He had another one where he did better. He was five, but the three has superseded it, and he was nasty. Wasn't he nasty? He's so nasty to me. Why? Why? He was fine. Everything was fine. Then one day they told him, you know, the pollsters.","A lot of these politicians they won't do anything without their pollster. I don't have any pollsters. What do I need pollsters for? They give me hundreds and hundreds of pages when CNN, who's back there, when all of these cameras, they give you -- they spend millions on polls and then these guys spend hundreds of thousands of dollars on polls, so why do you need a pollster?","All you have to do is get the polls after the networks pay for them. But they don't make a move, honestly, and I've seen it. The politicians don't make a move without their pollster. And they're paralyzed from the pollster and the pollsters are tough smart people and they know how to deal. You know, they get paid hundreds of thousands of dollars and they get angry.","I've seen it where somebody was walking off the debate stage. He didn't do that well, and the pollster was screaming at him. I said, \"Don't scream at the guy like that. Who are you? What are you doing?\" They're afraid of their own pollsters because the pollsters are tough and they're smart. That's how they make all this money.","OK. It's like some coaches but they're not as talented in many cases. And what they're doing is the candidate is so often afraid. Totally -- they're totally afraid to talk. And that's why you see a \"We'll get back to you. We'll get -- \" It's always we'll get back to you, and they're not doing well.\" It's not like, \"Oh, gee.","That's working.\" And I speak from the brain but I speak from the heart. It's both. It's got to be to be both. And -- thank you. So nice. But I -- you know, look, we have to get moving. Political correctness, all of that. We've been hearing about that. I mean, political. It's true. I can't. See now? I love that.","If I said that they're going to be writing horrible stories about me all the time. It's so good that he said it. I love that. Feel free to interject. I love that. I can't -- \"Hey. Believe me, I'm thinking the same thing.\" I say, \"Can I say it?\" Beautiful, good. And I didn't tell you to do that, right.\" You know, the word Christmas.","I was saying Christmas. I love Christmas. Do we love Christmas? You go to Macy's and you go to these -- Macy's was very disloyal to me, by the way, you know, their little conflict when I talk -- talking about illegal immigration. They thought it might not be politically correct. And now they don't sell my ties anymore.","Big deal. They were very disloyal, very disloyal. And by the way, I know one thing. They wish they didn't do that because they would be selling more ties right now. OK? Not a big deal. But you know, you got to find out -- you have to find out who your friends, who's loyal, who's not. I love to find things.","It's like a testing period. But when I mentioned the words illegal immigration I was hit so hard by the media. Like Rush Limbaugh said he's never seen anything like it. It was unbelievable. He used the word incoming. I've told you this. He used the word incoming and I know what he meant because there has never been anything like it. And then they found out I was right.","They found out I was right. And it's a huge subject. I mean, the whole thing with illegal immigration is a huge subject and I love Mexico and I love the Mexican people. I have thousands of Hispanics working for me and they're great and they do a great job. And I'm winning in polls. Nevada just gave me the poll.","Not only am I winning in Nevada, I'm winning with the Hispanics in Nevada easily against everybody. You know what I love? A poll came out the other day that I'm winning 25%, think of this, as a Republican, as a Republican. It's unheard of. Usually it's 7%, 5%, 4%, 9%. 25%, you know they're going to say African-American.","They say if you get 25% African-American, the election's over. You're going to win the election. No, it's true. It's true. And my relationship with the African-Americans, my relationship with Hispanics, you watch, I think I'm going to win with the Hispanics because they they know what I'm gonna do. I'm bringing back the jobs.","I'm bringing -- from China. I'm bringing back from all over. We're bringing back - we're bringing back the jobs. But we have to stop the nonsense where our people are so grossly incompetent, our leaders, our representatives, our negotiators are so incompetent that it makes you just sick to think -- I mean, think of these deals.","I mentioned the Iran deal. Who would do a deal like this? Who would do a deal like this where they're saying Obama -- you know, you have the greatest great man of all -- this is the greatest -- these guys -- and so far, I've only heard the guys. I haven't heard the women. But so far, I've hear three guys -- they are right -- and I like the women better OK? Boy, they are right on cue.","These people are fantastic, but who would negotiate deals like this? I mean why and where and how do we -- how does that happen? So I have great relationships with foreign countries. I'm doing deals. I do deals all over the world. We do great. We built a great company. You know, they said he wouldn't run and you know, it takes guts to run.","It really does. It takes guts. It's not easy. It's not easy. But they all said he wouldn't run. And I looked at it last time. Romney let us down. He should've won that election and he let us down. I mean, him he choked. He choked. What happened? He went away for a month before the election. He starts building a garage for nine cars in California.","I said could you have done that like, you know, after the election? You had to do it -- and they had a picture. Remember the nine-car garage? That wasn't so good. That doesn't play well for the election, but something happened to him. And I backed McCain and that I understand but you had a hard time with that one because lots of bad things were happening and I backed Romney.","And that's one that should have been won and he failed. He failed us very simply, and I'm not happy about it. And this time I said I'm not going to let it happen again. I'm going to do it myself, right? I'm going to do it myself. Do you ever, like, have a problem -- I see the people in the audience, workers, hard workers like me. I'm a worker but hard workers and a lot of times you know you kill people and you say, \"Do it, do it, do it.\" It doesn't get done right.","Then finally say, \"OK now I'm just doing it myself.\" That's what I'm doing here. I'm doing it. I'm going to do it myself. I'm spending my own money. I'm spending my own money. You know, today today Bush has one of his top people in Berlin Germany raising funds. Can you believe that? In Berlin -- what -- what are we going to give to Germany for this?","Remember this, all of these people that are putting up money, all of them, they're getting a lot for it. I know these people better than I know anybody. The lobbyists, I've hired many of them. Some are great, some are very talented. They get whatever they want. They give millions and millions of dollars and they're going to spend hundreds of millions of dollars against me. And frankly, I just hope people understand when you see these attack ads -- they call them attack ads.","They're trying to demean, they lie, they're lies. But by the time you have, you know, end up telling the people it's a lie, the election's over. It's really unfair stuff. But they're going to spend hundreds of millions of dollars because this wasn't supposed to happen. Nobody controls me. I'm controlled by you people.","I'm controlled by the people in the country. Nobody controls -- and I mean, you look at you look at Jeb and Rubio and all of them. They all have all this money and they spend it and they're going to spend it. A lot of them. I mean, I'm reading these articles. I don't know. So far everyone's attack me has gone ping but -- and maybe that'll keep happening.","But I've never had $150 million spent on me saying bad things. OK. I've never had that happen. I will tell you I'm a good Christian. OK. Remember that and I told you about Christmas. And I guarantee if I become president, we're going to be saying merry Christmas at every store. We're not going to be doing -- every store, every store.","The Happy Holiday, you can leave that over in the corner. Happy holiday, everybody. Enjoy it. But I'm saying Merry Christmas to whoever the hell wants to hear it. And that's not to knock anybody else. Other religions can do what they want. I think it's great there's room for everyone. There's room for everybody.","But for them to take away the word Christmas, and they're going further. You can't have the scenes, you can't have -- you can't have anything anymore. It's again it becomes like the gentleman said, \"It becomes politically correct not to use the word Christmas.\" That's not going to happen anymore folks. It's not going to happen.","But when I tell people I'm Presbyterian, everyone says, \"You've got to be kidding. Are you really?\" They like me more. It's always a nice thing to say. Usually, I bring up the communion picture and I bring up a whole -- a whole . So I love it. I actually walked on the stage last time with a Bible.","People liked me much better. And it was my bible signed by my mother with my address on it. And what they don't know is those days, it was -- everything was so nice. Nobody took anything. Today you need addresses and things. Yeah, it's a little different. It's a little different out there. So we're going to do things differently.","Here's one that I'm so happy about. Look, who is going to be the next president and who is expected to win? Look at those charts. How beautiful. Now, look at that. 42% say Donald Trump is going to win. OK, 42%, 42%. Oh, I love it because we can do so much. We can do so much. So just to finish, hundreds of millions of dollars is out there.","It's a terrible system. We have a terrible complex system. Nobody even knows what it represents. The laws are so complicated. Nobody has any idea what it's all representing but tremendous amounts of money are up there and it's going to be spent and it's going to be spent unfairly. It's going to be spent -- I mean, it already is. It's being spent, you know, and I'm doing something different now.","The last time I was in Iowa, we had a tremendous crowd like this. And I said to the crowd, \"Do you want me to spend money -- \" because I feel badly. You know, when people want to give tremendous amounts of money and I'm turning it down, that hasn't been my history. You know, I don't turn down money. My whole thing was I take -- I take.","I take all of the money but I said to the crowd, \"Supposing I took everything and they put money in packs and they put money all over the place and supposedly took it, and I promise I won't do anything.\" They all stood up said, \"Don't do it. Don't do it,\" because they understand it. They understand. When somebody gives $5 million to Hillary or $5 million to Jeb, who is doing very poorly in the polls -- I'm just -- no, I just looked at this poll, 5%. I think I'm going to stop talking about him.","I you know I've sort of thought he was like going to be sort of a favorite. He's not doing so well. Who should I start talking about I'm going to have to start hitting somebody else. I don't know. Maybe Rubio. Well, Rubio I talk about. Look, I always say I have never seen a young person sweat like Rubio.","Do we agree? I've never seen -- he drinks more water. It's like -- he's like a machine. Drinks water, water, water, sweat, it pours. Gives a speech. Remember the state of the Union? He gave the retort. And he said, \"Huh.\" And you know, it was bad if he had a glass. But this was a bottle of like Mountain Dew or something it's on national -- everyone's -- and I said -- to my wife, I said, \"Did that just happen?\" And then I think and I think about like think of Putin, pretty tough cookie, right, who is the best to deal with Putin, Trump or Hillary?","I mean, give me a break. And I say to people yeah, I mean give me a -- can you imagine Jeb or Putin? Would that be easy for Putin. Putin is, you know, he's drooling OK. He's drooling because he wants it so bad. But I think Rubio, so I'm saying, you have to be cool. You have to really be cool. And Putin sitting and Rubio is going to meet him and Rubio walks in and he's sweating and he's pouring down.","Putin's going to look at him and say, \"What the hell's wrong with this guy?\" It's true. He's not a good poker player, right? He wouldn't be good at poker. Hey, look, I'm sure he's a nice guy. I really don't know him but I'm sure he's a very nice person but we -- we're beyond nice people. We -- and I think I'm a nice person.","I think I am. I'm a nice person. A woman said to me at a rally where we had -- I think 9,000 people. It was incredible. It was in New Hampshire. She said, \"Mr. Trump, I'm voting for you. I love you. You're really the guy. But do you think you're nice enough to be president.\" And I said, \"This is an election that's going to be -- \" And first of all, I said I'm really nice but this is going to be an election based on competence not niceness.","We have enough, we have enough, we have enough -- we have to, we need people of extraordinary competence and we have them in our country. We have them in this room. We have people that are negotiating trade deals with us and for us that are political hacks. They're ambassadors. They're nice people. Some are nice people but they're not talented at what they do. I have the greatest business minds in the world because we have them in this country.","I don't want to have -- I don't want to have a nice -- I want to have a really smart -- I want I'm a killer. I don't care. I want to have people with China. We're going to lose almost $400 billion this year in trade, think of it. That's our trade imbalance. I said do me a favor. Find out what's the imbalance, $400 -- almost $400 billion.","It's been that way for many years. How long you can you keep doing this? And you want to trade with China? It's impossible. And you people know it because you deal with it from Iowa. You deal with it and you know that. That's very hard. And when it comes to us, they send their stuff in. When it comes to us, we go that way.","Taxes, tariffs. They don't like to use the word tax, they call it tariff. And some of the tariffs are so onerous you can't do business. A friend of mine is a great manufacturer. He can't deal with China because they charge him so much. Now I don't knock China. I have my tenants from China. I have people buy apartments for $35 million, $40 million in Manhattan from China.","What am I going to dislike them? I like them. The largest bank in the world is a tenant of mine from China. I mean, I respect them. I wish our leaders would be able to do the same thing. I wish -- I would love -- I mean, I'd be so proud if our leaders could take those deals and make them great deals, even good deals, even break even deals.","Why would it be if instead of having an imbalance of $350 billion, we broke even? Do you not know -- no, non. Do you know what that would mean? Do you know what that would mean for our country? Do you have any idea what that would mean, the kind of numbers we're talking about? Somebody said, \"You can't do that.","It's going to take -- \" I saw proposals from some of the candidates we're running against. They want to balance the budget within the next 25 years. I said, \"Excuse me. 25 years. 25 years? What are you talking about? What are you talking about?\" We have people that just don't get it. They don't have it. You know, it's like a great athlete.","They have great athletes. For some reason that Dan Gable, great wrestler, right, right? I watched him for so long. He weigh, I think it was like 189 and like practically like nothing. But whatever it is, I mean, nobody even knows. He works hard but a lot of people work hard. But some people have -- the same thing with business, same thing with negotiation.","I want to have the greatest negotiators. I know most of them. I come from an area of great negotiators. It's called Wall Street. I want these tough guys -- seriously. I want to put him to work for us. They don't want any money. They don't want money. I'm getting calls, you know, now that I'm leading all the time, all these guys are calling -- the biggest guys, the best.","Some good, some not-so-good. Some want to get involved. Carly, I wouldn't want. I mean, what you did to that company. I'm not interested in Carly, to be honest with you. But no, seriously. I have the best negotiators in the world calling. Carl Icahn, great. He's made a fortune. He doesn't want money. He just wants to do it. I said, Carl, handle China.","Good. I'll do it. Guess what? Lots of good things are going to happen, folks. Lots of very good things. But we have great people and we don't use them. I always say in Japan we have Carolyn Kennedy. What does she know? And you know the story -- has anyone heard the story about Caroline Kennedy, right, from 60 Minutes?","I was on 60 Minutes the other night. By the way, my stable mate was Putin, right? And they got the highest ratings they've had in a long time, 60 Minutes. So I'm taking full credit for that. I'm not giving it at none. They had a huge -- and then I'm doing Saturday Night Live next week. That's going to be great.","You better watch. It'll be interesting. You better watch. I did it eleven years ago. The Apprentice hit No. 1 and they said, \"Would you do Saturday?\" And here I am doing it again and this time -- so it's been -- you know, I mean it's been an amazing -- It's been an amazing period of time but we need our best people.","And I tell the story about Carolyn Kennedy. People love the story, but it's it's true. It was on 60 Minutes. She came in and they're doing a profile of her because she's the ambassador to Japan and they come in and they have the cameras on her and they say, \"How did you get the job?\" \"Well, I didn't have anything to do.\" And by the way, a friend of mine said he actually went to the tape and he said, \"You're imitation is almost exactly right.\" So I'm saying, you know, saying pretty much right.","Well, I came in, \"You're fired.\" I came in. I came to the White House. You know, well, she's obviously very close with Obama. I came into the White House. I said, \"I'd love to help out is there anything I can do?\" Very nicely, very meekly. Very nice. And my my daughter likes her so she has to be a nice person, you know, Ivanka.","We love Ivanka. I could have her do some negotiating for us, believe me. She is tough. She is tough but she's good. She's got a great heart. But Carolyn Kennedy comes up and she goes, \"Well,\" I said, \"Do you have anything for me to do. I have just nothing to do. Do you have anything to do.\" They said, \"Would you like to be the ambassador to Japan?\" She goes, \"Really?","You mean that?\" She couldn't believe it. So now she is the ambassador to Japan and they have her in 60 Minutes where she's being wined and dined by Abe, who's a killer. You know, he's a great leader. He's the best leader Japan's had a long time. They're doing big devaluations of their currency. They're killing us they're killing us, and she's our negotiator.","I don't want that. I want Carl Icahn. I want Henry Kravis. I want these guys. I want the right people. I want the right people. I don't want that. With Japan last year, $70 billion -- this is in one year. How do you lose $70 billion and then say, \"Oh, let's have dinner. Let's have dinner. They come over.","We give them a White House fret. We give him a beautiful White House dinner.\" With China, they come over the other day and we have this beautiful tent on the lawn. They put a tent. You know why? They turned down my offer. You know I offered to build a ballroom. You know that. I offered to build a ballroom and I called up the Obama administration, spoke to a very nice guy, David Axelrod.","I like David Axelrod but it's OK. Got to speak to somebody, right? But I spoke to David Axelrod and I said, \"David, you know what, I see you have tents and it's not even safe.\" You know, it's cloth. It's not good. I said, \"If you want, we'll get five of the top architects only in the United States.\" We're only -- we're not interested in the foreign architect for the White House.","Do we agree? Makes sense right? We'll get some great architects and we're going to design five ballrooms, big ones. It's going to cost me $100 million to do it properly.\" Like I'm doing at the old post office site, which is going to be great. \"We're going to design five ballrooms by five different architects.","Put all your people in charge. I will pay for it 100% and we'll get just the right -- we'll go out to the critics. We'll get one that everybody loves. We'll put them together. We'll do whatever we have to do. It'll be so beautiful. It'll be great.\" I never heard from them. Nobody ever called me. Nobody ever called -- I was going to give them $100 million gift more.","I want to spend more although I can probably do it for much less, to be honest with you. I'm good at that. Good. Believe me, I'm good. But I never heard back from David. He never called me back. He never called me back. And I said -- I didn't mind. You know, I don't mind saving $100 million or something but I said, I said -- I was just in this mood.","I said, \"You know, it doesn't make sense.\" You have these big state dinners and they're intense. And I guarantee you, the guy that owns the tent because I don't think it's owned by the White House folks, meaning us. The guy that owns the tent is making a fortune. OK. Can you imagine? There's no negotiation.","How much is it? Well, that'll be $3 million for the weekend. Oh, that's OK. You know, the tent is rotted out. It's old, it's falling down. It's worth $10, probably gets a fortune. You know, the -- I'll tell you now this is a story that they deny but I don't deny it. So you know in the Capitol, the rotunda there, they're doing a big scaffolding job, right.","My real estate friends would love this because to me -- now they're denying it, so let's assume they're correct, right? But I think I talked them into it. So I heard they were going to take -- I have pretty good authority. You know I'm building a big, big building on Pennsylvania Avenue, the old post office.","And I said, \"How did I ever get that property?\" The most sought-after property. \"How did how did Obama get it to me?\" Everybody wanted it, including the Pritzker family and that's a good negotiator, right? And I got it for the right price. I didn't overpay. But here's the thing, going to be a great hotel.","It's going to be fantastic, it's going to be great but -- so the rotunda, they put this unbelievable scaffold. It's been up there for about two years. They've got to fix up some -- they've got a point. You know what point is? It's a bing, bing, bing. Ten minutes later, you take it down. It's finished, right.","So they have the scaffolding up. Beautiful job, cost millions of dollars, millions but they're worried that they won't make the inauguration because they don't want to have the scaffolding up for the next president, which hopefully is going to be me. Wouldn't that be great? Wouldn't that be great? So I was told -- and then after they heard, there was a panic and they denied it and they said -- but I was told that they're not going to have the work done and they want to take the scaffolding down because, you know, that ceremony is magnificent.","And they want to take the scaffolding down for the event for the ceremony, have the ceremony and then two days later start putting it back up again. So I said, \"I have two ideas. Number one, if you can't do it leave it up. I'll be OK with it. OK. Leave it up. Don't take it, please. Please, don't take it down.\" It's amazing what these photographers can do. We can erase it for $2, right?","They can erase it, take the scaffolding off. But even if you leave it -- but I said, \"Do me a favor. Don't touch it, just leave it.\" But I have a better idea. Have them work faster and get it finished. Wouldn't that be great? You know, OK. Let them work faster and get it finished. So they deny this and get it finished.","So they deny it. They said, \"Oh, no. It'll be done in time.\" I guarantee you it wouldn't have been, and I have it from a very good source. It would not have been but now I'll bet you because of what I've been doing because I've been using that and I've been telling people about that and people find it terrible.","I think they'll probably get it done. I can imagine what they're paying in overtime. Wouldn't that be terrible? OK. Let me let me check out that bill. Oh, these contractors, the money they make, the money they make. So we're a country with 93 million people out of the labor force. I mean, you know, we've got 93 million people.","Many of those people want to work. They can't. And then we hear, yes, the unemployment rate is down to 5.2, 5.3. I'll tell you what, if it was really 5.2 or 5.3, I probably wouldn't be up here tonight. And if I was -- there'd be three people in this room instead of thousands. There'd be three people. So we have 93 and if you really superimpose, I was always pretty good at this stuff, you could very well have.","I mean, you can have a 30% unemployment rate, real rate. I'm talking about a real rate. You know, the story. You look for a job, you keep looking, looking, looking. Three months later, you say, \"I can't do I anymore. I can't look. I've got to take a rest. You go home, you stop looking.\" You're now considered statistically employed.","And the reason that is, is because it's for politicians. They always want to look good. What does that have to do with unemployment? So I think you have actually an economist and a very smart guy, two weeks ago, said the real number is 42%. So let's say that's high but let's say it's 30 or 25 or 20 or 15. One thing we know, it's not 5.2, 5.3, about 100 million people close.","We have 50 million people in poverty and with no hope of getting out because there's no incentive, there's no drive. We're run by the great divider. He divides everybody. And I thought actually when Obama won, I thought that he would be a unifier. One thing I thought. I said, \"I don't know if he's going to be good.\" And I would love him to be a great president.","By the way, speaking again, I would love him if he would be a great president. I'd be very happy. I don't mind staying in my business, running my business, having fun, doing what I'm doing. I would love him. I know it's not nice for me to say I'm a Republican I'm conservative. I don't want to say it. But if he would do a great job if he were happy so would most of the people in this room.","It's not working that way, folks, and it's not going to happen. It's not going to happen. So we have 50 million people in poverty. We have 46 million people on food stamps. We've got tremendous problems with Obamacare. You know, your premiums in case you haven't noticed are up 45%, 38%. Some person said, \"Well, it wasn't 45%, Mr. Trump,\" shouted out from the audience.","I think maybe an Obama fan but shouted out from the audience, \"Wasn't 45.\" I said, \"Oh, yeah.\" I said maybe I'm in trouble. What is it? \"It's 38%, sir.\" Oh, fine. That's fine, 38%. And some of them were up 50%, 50. Your deductibles are through the roof. Your deductibles are through the roof. Unless you get hit with a Komatsu tractor because Komatsu is doing very well because, you know, what happened with Japan.","They've devalued their currency. Caterpillar is having a very hard time. You know that right? They're having a very, very hard time. Very, very hard time. But unless you get hit by a Komatsu tractor, coming right out of Japan, the deductible is so high. It's never going to -- never going to you -- have to die.","And then it doesn't work because that's not what deductibles are supposed to do. So you've got huge increases and we have to repeal and replace Obamacare with something great. We have to do it. We have to do it. A country isn't a country unless we have a border. Do we agree? We're going to have a border and people are going to come into the country but they're coming in legally.","They're not coming in illegally. They're coming in legally and we're going to build a wall. It's going to be a great wall. It's going to be a wall that really is effective. Walls do work. You can look at Israel. You can look at different places walls do work but you can't have walls that are fences this tall.","Did you see the picture? Did you see the picture in Time magazine a couple of weeks ago where they're driving drug trucks over a little wall. They built ramps and the trucks are going over back and forth carrying drugs and things. I mean, what are we? What's going on? What's going on? We have tremendous drug traffic coming into this country and they just come in unabated.","I mean, it's just unbelievable and we allow it to happen. We're going to have a wall. We're going to have a great wall and Mexico's going to pay for it. And remember I said that, just remember I said. And just so you understand I love Mexico. I love the Mexican people. I respect the Mexican leaders but they're much smarter than our leaders, much smarter.","They're getting away with murder. They tell me that they tell me that. China, I have the richest people in China. They're friends of mine. They tell me everything. Of course, now they're not being so open now. I was only kidding a year ago. They didn't I was running for president. It's true. They didn't know I was running for president.","But Mexico, if you don't think they send people in. Kate, beautiful Kate, from San Francisco shot in the back by a man that was pushed in, in my opinion pushed in five times maybe six times, maybe eight times. Nobody even knows. But he should -- he wasn't supposed to be here and he shot her in the back. Three weeks ago, you had a woman raped in California.","A 66-year-old woman, a veteran. And by the way, we're going to take such great care of our veterans because they are treated so badly, so badly. We're going to build our military stronger than ever before, so strong that nobody's messing with us, nobody. Nobody's messing with us and we're going to take care of our veterans who, by the way, are not treated as well as the illegal immigrants.","They're treated better. The illegal immigrants are treated better. They're treated better. So we're going to change things and we're going to change them so fast and we're going to change them so good. And you're going to have victories. You're going to have so many victories. When was the last time, and I say it. I love saying it because it's so sad but it gets the point across.","We don't have victories anymore. We don't win anymore. When was the last time we won? We lose to China to every place. I mean, does anybody come from any exotic country because I guarantee we lose to them because we lose to everybody. But you look at Japan with the cars, they just pour off these massive boats.","I was in Los Angeles three or four weeks ago. I never saw ships as big. And cars are just pouring off the ships, pouring off like a long -- they go so fast. Boom, boom, boom. No tax, no nothing. Not going to happen anymore. It's not going to happen. It's unfair. It's unfair. It's incompetent. You don't even know.","I mean, some people think there's evil intention because how can anybody be that stupid? I don't think it's evil intention. I really don't. I mean, other -- I know people in this room think it's evil intention but how can they do it? How can they allow it to happen? We give them beef, Japan. And then they send the beef back, which is not good for the quality of the beef, by the way, back and forth.","And you people know it because you do trading and you do some -- it's so hard. They don't want our product and yet we take their product. No tax, just come on in. I tell the story and I love this story. And I could use different -- because there's so many different companies I could use. You know in Tennessee, a big car factory was gonna be built.","They decided to go instead, as you probably have heard, to Mexico. Big, big, massive plant. In Nabisco, I have some property, a beautiful property in Chicago. Nabisco is moving its plant out. They make Oreos. They're moving its plant out of Chicago. They're putting it in Mexico. How does that help us with our trade deals, our brilliant trade deals?","We're losing everything. We're losing our jobs. The one I love to talk about is Ford though. They're building a $2.5 billion factory, $2.5 billion. You know what that is? It's a one-story building. You know what $2.5 billion means? You go forever. It's massive. They're going to sell cars, trucks, and parts, and they're going to sell them into our country.","Now they're taking and they're going to close places in Michigan and all over the country, and I don't want that. And I said, \"Supposing I was president, I can tell you what I'd do.\" But now take Hillary. Let's say she's president. Do you think she's even going to know that it's happened? She's not going to know.","And if she thought it were wrong, if she thought -- she's not gonna have a clue. Look, nothing but trouble. She's not going to have a clue. But take Hillary, so she says, \"You know what, that's not good. We're losing all these -- \" Do you know how many plants that is to build $2.5 billion one big monster plant?","That's a lot of jobs, and they're not going to us. So Hillary would say, \"Well we don't like that. I don't want it.\" She would be hit by the lobbyists. She would hit -- immediately she would be hit by Ford lobbyists. She would hit by Ford special interests and Ford donors and people that own Ford stock. And within 10 minutes she'll say, \"Oh, it's OK.\" I'll be hit by people but they won't even call me because they don't have a chance.","It's over. It's over. It's over. It's over. And I would tell the people at Ford. I don't want you to do that. I don't want you to close your plants. I want you to build new plants. You don't have to have the old ones. And I don't care -- it can be anywhere but it's got to be in the United States. And if you're not -- and if you're not going to build them, then we're not going to allow cars and trucks and parts to cross the border with zero tax after what we've suffered through.","We're not going to allow it. We're not going to allow it. I mean, the way our country is run, if it doesn't happen to be me that wins, you know what's going to happen? They're going to build a plant and illegals are going to drive those cars right over the border. I'm telling you. It's going to cost them nothing.","Right over the border and then I'll probably end up stealing the car and that'll be the end of it. We have got to get smart. We have got to get smart. Now I would say the following I would say to the head of Ford. Here's the story and this is what you're going to do. Here's the story. We're not going to let you do this.","We want you to build but if you don't want to that's OK. We're charging you a 35% tax. Then we'll charge you. By the way, I'm a free trader. I believe in free trade. I don't want to be isolated. I believe totally in free trade. But I say this is what we want to do I want something out of it. We don't get anything out of it even, by the way, the Keystone pipeline.","You know what, stuff comes from Canada and that's fine. It's all good and I liked the Keystone. I think it's good. We got to get a piece of it. I want a piece of the action if we're going to let them build. OK. If we're going to let them build because, you know, it turns out that we have so much natural under our feet with the new technology.","It's incredible. So we're competing against ourselves but we got to -- we have to have people with deals. So here's what's going to happen. I will be called by people and I will say I'm sorry. And I guarantee you that by the end of the day, the head of Ford will call me, might take an extra day if they want to play tough and they will say, \"Mr. President we really don't think that's fair.","We don't want to pay taxes.\" That's OK. By bing. OK. No. That's it. And then by the end of the day, I guarantee you. I get a call and they will say, \"Mr. President, we're moving back to the United States. We're going to build that plant in the United States.\" OK. I guarantee it. And by the way that went so easy I wouldn't even waste the time of my negotiators to be it. That was too easy.","OK. That one, believe me. It's so easy to say with Nabisco. And again Mexico great. I just don't want them taking all our business. You look at what happened to New England. I mean, the business that poured out of New England. With all of that happened, the business that poured out is unbelievable. You see factories all over the place.","Some are converted to apartments and they converted to other things but the apartments don't bring in the rate that's for sure. We need jobs. We don't need apartments. We don't need apartments. I have apartments. We need jobs. We need production. We need factories. We need our jobs back. Now China, they devalue their currency.","They're killing us. It's impossible for our companies to compete. Three weeks ago, they did the biggest devaluation of their currency in 20 years. They say in two decades. And that wasn't supposed to happen because they've been devaluing it all along. And they are just absolutely destroying us. A friend of mine bought a plane.","OK. He wanted it to be sent to China. He had to pay a massive tax. He ended up losing a share. I was happy because he's a rich guy. I don't care. I couldn't care. He had to pay to get the plane into China. He had to pay a fantastically large tax tariff. He had to pay. You couldn't believe it. I won't even say the number because I still can't believe it was.","It was a number that was so large it wouldn't make any economic sense because they don't want planes that are built here. They don't want other things that are built here. They charge. You can't get your stuff in there tax free. You can't even get in there. But if you do, you can't -- it's unfair and that's why we're losing almost $400 billion a year.","And they look at us and they say, \"They are the dumbest human beings on Earth.\" That's true. That's not going to happen anymore. Boeing just placed a big order. They're buying 300 Boeings, beautiful plane. I have one so I like it but it's a plane, 300 planes. But you know what they're doing. They want all their technology.","They want them to build factories in China. They want the plane's manufacturer over there. Boeing is going to start building massive plane assembly plants and factories for the production of aircraft in China. Why? Why? That's not good. In South Carolina, they have Boeing. In Seattle, they have Boeing. I want them to expand here.","I don't want them to do that. I don't want them to do that. So I passed a tax bill and we put it through everybody and everyone loves it. We're lowering taxes substantially. You know, we're the highest tax nation in the world. We're bringing corporate taxes and small business taxes down 15 -- we're bringing them down to 15%. That's right.","We're simplifying. The tax code. We're going to have four tranches. It's going to be so beautiful. It's going to be so dynamic. It's gotten some great reviews. You know, you always have somebody that doesn't like it. We don't like it but we have to do it. You have corporate inversion. Nobody knows what it is. Companies big companies have trillions of dollars, $2.5 trillion offshore, out of the country.","They can't get the money back in. And to show you how paralyzed Washington is the Democrats and the Republicans want to bring that money back. That's been going on for four years. They can't pass it but everybody agrees. I mean, they want to bring the money back. It's too complicated and it's too expensive because the tax is so high.","I want the money to come back. It's part of what I'm doing. And that money, trillions of dollars. Now the $2.5 trillion, I think, is a low number. Nobody even knows what the number is. It's massive. But a lot of companies are going to be leaving the United States to go get that money. They are going to now move out of the United -- and these are big, strong, powerful companies with thousands and thousands of jobs, and they're also going to get a better tax deal.","So they're going to Ireland and they go into lots of different places and it's called corporate inversion. You have to -- it's going to be the biggest problem unless we have competent leadership. And the amazing thing about this one is everybody agrees but they can't get it signed. They can't get a deal and they all agree, and this is what we have.","We have total gridlock in Washington. We have people that just don't have it. They shouldn't be doing it. And you know, the amazing thing, and you've seen it, people get elected. And they're strong and they're tough. Then they go to Washington and they're very conservative. Now we're going to get rid of Obamacare and we're going to get rid of this and that and we're going to bring the money back into -- and they go to Washington and all of a sudden they're in this gorgeous building, maybe even nicer than this one.","They're in this gorgeous beautiful columns, the beautiful ceilings, everything is so beautiful. They look at their wife or they look at their husband and say, \"Oh, this is incredible. We've made it. Look at this.\" And they've become nothing. They get elected to make things right And they get to Washington and they become -- he said it wimps.","They become -- something happens to them, something happens to them. So we're -- they want to stay there. You know what happens? They get good at getting re-elected. That's all they care about. One thing I can tell you, I get to Washington, it's not going to happen to Trump. It's not going to happen to Trump.","It's not going to happen to Trump. So we're going to take care of women's health issues. You know, women have lots of issues where they have the health -- a tremendous health care issues, tremendous, that people don't even talk about. We're going to take care of women and women's health care issues. We're going to take care of so many different things.","We are going to make our country rich again. We have to make it rich. Somebody said to me, \"But that's not really nice to say rich.\" Well unless we get it -- right, we owe $19 trillion dollars. We're third world. You look at our airports, our roads. You look at everything. We're third world. I go to Qatar.","I go to these places. These incredible exotic places. I see airports. We don't have anything in our country like it by a factor of 10. You see airports in Dubai. You see airports in China. You see airports in Saudi Arabia. You've never seen anything like it. We come home. We land at LaGuardia with the potholes in the runway.","It's true. They say, \"You can't land, sir. They're fixing the potholes.\" It's true. It's a disgrace. We used to be emulated. We used to be the ones that people would look up to. We have the greatest resources. What we have is the people. We have really smart people. We have great people. We don't use our best people.","We don't use them. But the bottom line and I think the reason, and you know what, we have a full packed house tonight, thousands of people. But honestly, everywhere I go. And I don't know it's me. I think it's not me. I hope it's not me. It's the message. There's a movement going on. There's actually a movement going on. It's a strong movement.","It's a strong movement. You know, they used to call it the silent majority. It's not silent. It doesn't work. The term doesn't work because I have seen -- I go to Dallas. OK. Mark Cuban calls, good guy calls me. Do you want to use the stadium for the Mavericks. Yeah. When? I call. So Thursday, we go there on Monday.","We have 20,000 people. We had 35,000 people in Mobile, Alabama. We had 20,000 people in Oklahoma. Every place we go to in Iowa were packed. You know that. People standing outside trying to get in. It's been an amazing moment for me. A friend of mine is a very successful guy said, \"How many people are you speaking tonight?\" I don't know.","4,000 people. A lot. He said -- and that's a small group. It becomes -- like 4,000 is a small group. He said, \"How do you do that? You write speeches?\" I said, \"No, I have a great memory.\" But I said I more more than memory though, much more. I have a heart. I know what we have to do. I don't need teleprompters to tell us what we have to do. I don't need it, you know.","We come into this room and, you know, people they come up and I see it all the time. I see the people I'm competing against. They get up and they're more worried about the teleprompter angle. You have the angle. Then they get up. Good morning ladies and gentlemen. Everyone's falling asleep. It's brutal. It's good.","But that's what we have. We can't have that. We have a teleprompter president. We can't have that. We need somebody. We need somebody that could do the job. A friend of mine just got back from Shanghai. He's in Shanghai. He said, \"Donald, I've never seen anything like it. What they're doing there is unbelievable.","He sends me pictures of cranes on every corner.\" I mean, everybody going crazy. There's nothing like it, and I could name so many other places. It's not happening with us. It's not happening. It's the opposite with us. Everything's leaving. Everybody's laughing at us because we're led by people that don't have it and it's not going to happen any longer.","And that's why I'm doing this folks. That's why I'm doing it, believe me. And I will tell you I will be the greatest jobs president that God has ever created, that I can tell you. That I can tell you. God will be very proud of me because he wants good. I will be the greatest jobs president that God has ever created.","And I mean it's so much it's so easy. You know in one of the polls, actually a CNN poll, they did all these things and I was No. 1 in leadership, in jobs, and this. And I said, \"Why -- let's -- I mean, that -- those are important things.\" We will do something that's going to be so spectacular. Now I always say and the whole theme of what I'm doing is make America great again.","And you know I'd say the American dream is dead but I'm gonna make it bigger and stronger and better than ever before, and I mean that. The American dream is dead. It really is with the regulations and the problems and all of the problems that this country has. And I'm gonna make it bigger and better and stronger than ever before.","We're gonna be so proud of our country. We are going to have so much victory. You may get angry at me because you're going to say this is boring winning so much. This is boring. But you know what, that's never going to happen. We're going to win so much. We're gonna have so many victories. We're going to win on trade.","We're going to win with the military. We're going to have -- think of it. I watched the other night, a general being interviewed, said he's leaving, he's retiring. What do you think of ISIS? Oh, it's very tough. It's very tough, very tough. ISIS is very tough. 50,000 people. Very, very tough. I said, \"Boy, that's sad.\" Even if it was tough, he shouldn't be saying that.","Besides that what's the general doing on television being interviewed? Why is a general being interviewed? I want my generals being interviewed. I want my generals kicking ass. I mean, no suit. I don't want them being interviewed. I will find the General Patton or I will find the General MacArthur. We have them.","We have them. They're probably not politically -- remember we got rid of -- I won't use his name. We got rid of a very good general because he was too rough and he used foul language and it was rough at his men all loved him. You know who I'm talking about, right? Right. He was a rough guy. That's what we want.","I want smart. No. 1 smart, but we want tough. We want people. So when I see, as an example, President Obama. We will be leaving Iraq -- we should have never gone in, in all fairness. OK. We spent $2 trillion, thousands of lives, wounded warriors, who I love all over the place. We had nothing. We took nothing.","Remember I said, look, you shouldn't have gone in because you destabilize the Middle East. But now you're getting out keep the oil. You know who has the oil now? Iran and ISIS has the oil. Remember I said how mean I was because I said keep the oil? Remember, they said -- everybody. All the pundits, the great geniuses on television.","Well, Trump will run but he won't do very well. He should be out within one week. Well, you know, I've been on top a long time folks, a long time. But these same geniuses, these same pundits, I call them the talking heads, right, these same pundits on television. They said, \"Well, you know, you can't keep the oil because this is a sovereign country, Iraq.\" Iraq is a sovereign company.","It's broken up. Nobody knows what the hell. There is no Iraq. You know what's happening to Iraq. Iran is taking over Iraq because we were so stupid. We -- we ruined it. And what happens now, Iran goes over takes the oil, takes all the resources, takes everything. We get nothing. Now they go into Syria with Russia.","We're sitting here like a bunch of dopes. We're run by people that are totally and grossly incompetent. It's not going to happen anymore. It's not going to happen anymore. It's not going to happen anymore. Believe me, we're going to win this election. We're going to win the primaries. We're going to win the election.","We're going to beat Hillary. Hillary has done a horrible job. She's not worthy of being president. And we're going to make this country great again. Thank you. Thank you. Thank you. Thank you."],"text":" What a great crowd. Let's straighten that thing out. I like this -- I like this uniform look. She was a little crooked. I want that straight. Like we're going to straighten out our country. We're going to straighten out our country, believe me. Wow this is some crowd. This is a record crowd for this building. I know it's structurally sound. It was built a long time ago. It's good and strong. We need it. Thank you. Thank you, everybody. Thank you. Thank you. So we had some news today that Biden is not running. And I think he did the smart thing because, frankly, I don't know that he would have won. He wouldn't have gotten the nomination. I don't think he probably would have. And frankly, I really want to run against Hillary. I really do. That's the one. That's the one I've been -- you know, when you sort of like if you have a baseball team or a football team you sort of get your heart set on something. That's the one we want to go against because you go against that record -- you go against that record, you're just going to win. We're going to win. We're going to win big. So many mistakes. You know, you look at the world. The world is a tinderbox. It's falling apart. It's blowing up. We are a mess. What's happened to this country between the Iran deal and the Bergdahl, five for one. I call him Mr. Five-for-one. We get a traitor. Right. What did we used to do to traitors? Who was -- boy, that guy's got -- crazy. You know, they came out with a report. They don't think he goes to jail. They don't think anything -- six people died going after him and nothing's going to -- can you believe this? This is what's happened, but let me just explain. So I get up in the morning and I turn on television. First thing I see is big, big results. Washington Post ABC comes out with a poll, right? Do we love these polls? Somebody said, \"You love polls.\" I said, \"That's only because I've been winning every single one of them.\" Right? Right? Every single poll. In fact, they were saying for 100 days. Today's the 100th day. Look at I love that guy. Today is the 100th day that we've been No. 1 in every single poll, think of it. And we're increasing our lead and you know, it's been -- it's really been amazing. We've been increasing the lead but Washington Post today comes out 32% for Trump. And that's -- you've got to understand. We're talking about 15 people. Used to be 17. A couple have dropped out. They're going to start falling, I think, like flies now. You know when some of these guys have a zero for weeks. It's almost like somebody said they do it for their brand. How is it good for your brand? One of them Pataki. He had a zero with an arrow going left. That means less than zero. I said, \"Is that a mistake? Is that a mistake?\" So I don't know what they do but they're going to -- a lot of people going to start dropping out,which is good. You get a much better discussion going. Instead of having all these folks around and the whole thing is ridiculous. But we're at 32%. We're leading everybody by a lot. The closest is 10% next. We had another one Boston Herald in New Hampshire just came out, 28% second is 16%. Think of that, 16%. We have -- oh, I love this one. And by the way, the people in Iowa, the people in New Hampshire, people in South Carolina first have been so unbelievable. The South Carolina poll is unbelievable. But we'll get to that. Morning Consult, this is the one I love. This is -- you know what's interesting? They do these polls. They take like 300 people. I'm saying, \"How can you do 300 people?\" Morning Consult, that's one of the big online polls. 41%, 41 think of that, 41. You almost say how do you get 41%, think of it, when you have 15 people? If you had 41% with, like, three people, you have it made, right? But with 15 people, 41% highly respected poll, second is 14%. So it's 41-14, so that sounds good. Now, and you know we're winning very importantly in Iowa. We're winning and we're winning big. We're winning big. Here's one that I love Ohio -- because I like Casey. I think he's a good guy. In Ohio, we're 27% and Casey, she's at 12.5%. Good governor, good guy, everything. I don't like his view on Common Core. I don't like a couple of his views, which is, you know, but he's a good guy and he is a good guy. 27% and Casey is the governor. The sitting governor is at 12.5%. That just came. Another one that is incredible is Connecticut, big state, Quinnipiac poll 34-14. 34-14 to second. I love this one. By the way, a couple of the -- beating Hillary nationwide. You love that? That, I love. That, I love. Beating Hillary in numerous states and very substantially. And one just came out two days ago, beating Hillary in the state of Florida, which I love, which I love. Now the other thing I love, beating the governor of Florida, beating the sitting senator of Florida, who has the highest -- well, think of this, has the highest lack of attendance. We'll say lack of attendance in the Senate. I mean, he's a go. You got to -- you can't talk about working if you don't go to vote and you're a senator, right? Doesn't that make sense? But in Florida, I'm at 29% and they're -- I won't say but they're really low. They're in the teens and less than the teens. And I tell the story where Rubio actually was a little below and then he went a little above the governor, and they're in the 12s. And I tell the story all the time. I'm at 29. and the headline said, \"Rubio surges.\" I said, \"Oh, what happened to Florida?\" It's true. I said, \"What happened to Florida? I was doing so well and then I read the article. It says, \"While Trump is at 29, Rubio surged past the governor.\" Big deal. OK? Oh, boy. We have won here. 35 -- and by the way, Pennsylvania beating everybody. OAN, 35%. Great company, great poll, 35 to 17. I mean, we are just -- I love these polls. And I say to people when they always say, \"You love to mention the polls. Nobody else does.\" I say, \"That's because they are losing. They're not stupid people.\" Right. They're losing. Oh, I could talk about these suckers all night long. I love them. I could talk about them all night long. So New Jersey, great. Now Jersey -- and I like Chris. Chris is a good guy but I'm at 32, he's at five, which is a big -- Reuters, 33-15. South Carolina, 36%. I'm leading by 18 points, 18 points. That's a lot. You know, in golf they say he's looking for the clubhouse, Johnny. He's just looking for the -- a lot of truth. We understand -- the golfers understand that. We just want to get in. Get this election going. I wish, you know, like some countries that can call an election, right. They can call it. I want to call it an election. Can we have it, like, tomorrow? I want to do it now. I want to do it now. South Carolina, 36%, 36%. Lindsey Graham, the sitting senator, three. He had another one where he did better. He was five, but the three has superseded it, and he was nasty. Wasn't he nasty? He's so nasty to me. Why? Why? He was fine. Everything was fine. Then one day they told him, you know, the pollsters. A lot of these politicians they won't do anything without their pollster. I don't have any pollsters. What do I need pollsters for? They give me hundreds and hundreds of pages when CNN, who's back there, when all of these cameras, they give you -- they spend millions on polls and then these guys spend hundreds of thousands of dollars on polls, so why do you need a pollster? All you have to do is get the polls after the networks pay for them. But they don't make a move, honestly, and I've seen it. The politicians don't make a move without their pollster. And they're paralyzed from the pollster and the pollsters are tough smart people and they know how to deal. You know, they get paid hundreds of thousands of dollars and they get angry. I've seen it where somebody was walking off the debate stage. He didn't do that well, and the pollster was screaming at him. I said, \"Don't scream at the guy like that. Who are you? What are you doing?\" They're afraid of their own pollsters because the pollsters are tough and they're smart. That's how they make all this money. OK. It's like some coaches but they're not as talented in many cases. And what they're doing is the candidate is so often afraid. Totally -- they're totally afraid to talk. And that's why you see a \"We'll get back to you. We'll get -- \" It's always we'll get back to you, and they're not doing well.\" It's not like, \"Oh, gee. That's working.\" And I speak from the brain but I speak from the heart. It's both. It's got to be to be both. And -- thank you. So nice. But I -- you know, look, we have to get moving. Political correctness, all of that. We've been hearing about that. I mean, political. It's true. I can't. See now? I love that. If I said that they're going to be writing horrible stories about me all the time. It's so good that he said it. I love that. Feel free to interject. I love that. I can't -- \"Hey. Believe me, I'm thinking the same thing.\" I say, \"Can I say it?\" Beautiful, good. And I didn't tell you to do that, right.\" You know, the word Christmas. I was saying Christmas. I love Christmas. Do we love Christmas? You go to Macy's and you go to these -- Macy's was very disloyal to me, by the way, you know, their little conflict when I talk -- talking about illegal immigration. They thought it might not be politically correct. And now they don't sell my ties anymore. Big deal. They were very disloyal, very disloyal. And by the way, I know one thing. They wish they didn't do that because they would be selling more ties right now. OK? Not a big deal. But you know, you got to find out -- you have to find out who your friends, who's loyal, who's not. I love to find things. It's like a testing period. But when I mentioned the words illegal immigration I was hit so hard by the media. Like Rush Limbaugh said he's never seen anything like it. It was unbelievable. He used the word incoming. I've told you this. He used the word incoming and I know what he meant because there has never been anything like it. And then they found out I was right. They found out I was right. And it's a huge subject. I mean, the whole thing with illegal immigration is a huge subject and I love Mexico and I love the Mexican people. I have thousands of Hispanics working for me and they're great and they do a great job. And I'm winning in polls. Nevada just gave me the poll. Not only am I winning in Nevada, I'm winning with the Hispanics in Nevada easily against everybody. You know what I love? A poll came out the other day that I'm winning 25%, think of this, as a Republican, as a Republican. It's unheard of. Usually it's 7%, 5%, 4%, 9%. 25%, you know they're going to say African-American. They say if you get 25% African-American, the election's over. You're going to win the election. No, it's true. It's true. And my relationship with the African-Americans, my relationship with Hispanics, you watch, I think I'm going to win with the Hispanics because they they know what I'm gonna do. I'm bringing back the jobs. I'm bringing -- from China. I'm bringing back from all over. We're bringing back - we're bringing back the jobs. But we have to stop the nonsense where our people are so grossly incompetent, our leaders, our representatives, our negotiators are so incompetent that it makes you just sick to think -- I mean, think of these deals. I mentioned the Iran deal. Who would do a deal like this? Who would do a deal like this where they're saying Obama -- you know, you have the greatest great man of all -- this is the greatest -- these guys -- and so far, I've only heard the guys. I haven't heard the women. But so far, I've hear three guys -- they are right -- and I like the women better OK? Boy, they are right on cue. These people are fantastic, but who would negotiate deals like this? I mean why and where and how do we -- how does that happen? So I have great relationships with foreign countries. I'm doing deals. I do deals all over the world. We do great. We built a great company. You know, they said he wouldn't run and you know, it takes guts to run. It really does. It takes guts. It's not easy. It's not easy. But they all said he wouldn't run. And I looked at it last time. Romney let us down. He should've won that election and he let us down. I mean, him he choked. He choked. What happened? He went away for a month before the election. He starts building a garage for nine cars in California. I said could you have done that like, you know, after the election? You had to do it -- and they had a picture. Remember the nine-car garage? That wasn't so good. That doesn't play well for the election, but something happened to him. And I backed McCain and that I understand but you had a hard time with that one because lots of bad things were happening and I backed Romney. And that's one that should have been won and he failed. He failed us very simply, and I'm not happy about it. And this time I said I'm not going to let it happen again. I'm going to do it myself, right? I'm going to do it myself. Do you ever, like, have a problem -- I see the people in the audience, workers, hard workers like me. I'm a worker but hard workers and a lot of times you know you kill people and you say, \"Do it, do it, do it.\" It doesn't get done right. Then finally say, \"OK now I'm just doing it myself.\" That's what I'm doing here. I'm doing it. I'm going to do it myself. I'm spending my own money. I'm spending my own money. You know, today today Bush has one of his top people in Berlin Germany raising funds. Can you believe that? In Berlin -- what -- what are we going to give to Germany for this? Remember this, all of these people that are putting up money, all of them, they're getting a lot for it. I know these people better than I know anybody. The lobbyists, I've hired many of them. Some are great, some are very talented. They get whatever they want. They give millions and millions of dollars and they're going to spend hundreds of millions of dollars against me. And frankly, I just hope people understand when you see these attack ads -- they call them attack ads. They're trying to demean, they lie, they're lies. But by the time you have, you know, end up telling the people it's a lie, the election's over. It's really unfair stuff. But they're going to spend hundreds of millions of dollars because this wasn't supposed to happen. Nobody controls me. I'm controlled by you people. I'm controlled by the people in the country. Nobody controls -- and I mean, you look at you look at Jeb and Rubio and all of them. They all have all this money and they spend it and they're going to spend it. A lot of them. I mean, I'm reading these articles. I don't know. So far everyone's attack me has gone ping but -- and maybe that'll keep happening. But I've never had $150 million spent on me saying bad things. OK. I've never had that happen. I will tell you I'm a good Christian. OK. Remember that and I told you about Christmas. And I guarantee if I become president, we're going to be saying merry Christmas at every store. We're not going to be doing -- every store, every store. The Happy Holiday, you can leave that over in the corner. Happy holiday, everybody. Enjoy it. But I'm saying Merry Christmas to whoever the hell wants to hear it. And that's not to knock anybody else. Other religions can do what they want. I think it's great there's room for everyone. There's room for everybody. But for them to take away the word Christmas, and they're going further. You can't have the scenes, you can't have -- you can't have anything anymore. It's again it becomes like the gentleman said, \"It becomes politically correct not to use the word Christmas.\" That's not going to happen anymore folks. It's not going to happen. But when I tell people I'm Presbyterian, everyone says, \"You've got to be kidding. Are you really?\" They like me more. It's always a nice thing to say. Usually, I bring up the communion picture and I bring up a whole -- a whole . So I love it. I actually walked on the stage last time with a Bible. People liked me much better. And it was my bible signed by my mother with my address on it. And what they don't know is those days, it was -- everything was so nice. Nobody took anything. Today you need addresses and things. Yeah, it's a little different. It's a little different out there. So we're going to do things differently. Here's one that I'm so happy about. Look, who is going to be the next president and who is expected to win? Look at those charts. How beautiful. Now, look at that. 42% say Donald Trump is going to win. OK, 42%, 42%. Oh, I love it because we can do so much. We can do so much. So just to finish, hundreds of millions of dollars is out there. It's a terrible system. We have a terrible complex system. Nobody even knows what it represents. The laws are so complicated. Nobody has any idea what it's all representing but tremendous amounts of money are up there and it's going to be spent and it's going to be spent unfairly. It's going to be spent -- I mean, it already is. It's being spent, you know, and I'm doing something different now. The last time I was in Iowa, we had a tremendous crowd like this. And I said to the crowd, \"Do you want me to spend money -- \" because I feel badly. You know, when people want to give tremendous amounts of money and I'm turning it down, that hasn't been my history. You know, I don't turn down money. My whole thing was I take -- I take. I take all of the money but I said to the crowd, \"Supposing I took everything and they put money in packs and they put money all over the place and supposedly took it, and I promise I won't do anything.\" They all stood up said, \"Don't do it. Don't do it,\" because they understand it. They understand. When somebody gives $5 million to Hillary or $5 million to Jeb, who is doing very poorly in the polls -- I'm just -- no, I just looked at this poll, 5%. I think I'm going to stop talking about him. I you know I've sort of thought he was like going to be sort of a favorite. He's not doing so well. Who should I start talking about I'm going to have to start hitting somebody else. I don't know. Maybe Rubio. Well, Rubio I talk about. Look, I always say I have never seen a young person sweat like Rubio. Do we agree? I've never seen -- he drinks more water. It's like -- he's like a machine. Drinks water, water, water, sweat, it pours. Gives a speech. Remember the state of the Union? He gave the retort. And he said, \"Huh.\" And you know, it was bad if he had a glass. But this was a bottle of like Mountain Dew or something it's on national -- everyone's -- and I said -- to my wife, I said, \"Did that just happen?\" And then I think and I think about like think of Putin, pretty tough cookie, right, who is the best to deal with Putin, Trump or Hillary? I mean, give me a break. And I say to people yeah, I mean give me a -- can you imagine Jeb or Putin? Would that be easy for Putin. Putin is, you know, he's drooling OK. He's drooling because he wants it so bad. But I think Rubio, so I'm saying, you have to be cool. You have to really be cool. And Putin sitting and Rubio is going to meet him and Rubio walks in and he's sweating and he's pouring down. Putin's going to look at him and say, \"What the hell's wrong with this guy?\" It's true. He's not a good poker player, right? He wouldn't be good at poker. Hey, look, I'm sure he's a nice guy. I really don't know him but I'm sure he's a very nice person but we -- we're beyond nice people. We -- and I think I'm a nice person. I think I am. I'm a nice person. A woman said to me at a rally where we had -- I think 9,000 people. It was incredible. It was in New Hampshire. She said, \"Mr. Trump, I'm voting for you. I love you. You're really the guy. But do you think you're nice enough to be president.\" And I said, \"This is an election that's going to be -- \" And first of all, I said I'm really nice but this is going to be an election based on competence not niceness. We have enough, we have enough, we have enough -- we have to, we need people of extraordinary competence and we have them in our country. We have them in this room. We have people that are negotiating trade deals with us and for us that are political hacks. They're ambassadors. They're nice people. Some are nice people but they're not talented at what they do. I have the greatest business minds in the world because we have them in this country. I don't want to have -- I don't want to have a nice -- I want to have a really smart -- I want I'm a killer. I don't care. I want to have people with China. We're going to lose almost $400 billion this year in trade, think of it. That's our trade imbalance. I said do me a favor. Find out what's the imbalance, $400 -- almost $400 billion. It's been that way for many years. How long you can you keep doing this? And you want to trade with China? It's impossible. And you people know it because you deal with it from Iowa. You deal with it and you know that. That's very hard. And when it comes to us, they send their stuff in. When it comes to us, we go that way. Taxes, tariffs. They don't like to use the word tax, they call it tariff. And some of the tariffs are so onerous you can't do business. A friend of mine is a great manufacturer. He can't deal with China because they charge him so much. Now I don't knock China. I have my tenants from China. I have people buy apartments for $35 million, $40 million in Manhattan from China. What am I going to dislike them? I like them. The largest bank in the world is a tenant of mine from China. I mean, I respect them. I wish our leaders would be able to do the same thing. I wish -- I would love -- I mean, I'd be so proud if our leaders could take those deals and make them great deals, even good deals, even break even deals. Why would it be if instead of having an imbalance of $350 billion, we broke even? Do you not know -- no, non. Do you know what that would mean? Do you know what that would mean for our country? Do you have any idea what that would mean, the kind of numbers we're talking about? Somebody said, \"You can't do that. It's going to take -- \" I saw proposals from some of the candidates we're running against. They want to balance the budget within the next 25 years. I said, \"Excuse me. 25 years. 25 years? What are you talking about? What are you talking about?\" We have people that just don't get it. They don't have it. You know, it's like a great athlete. They have great athletes. For some reason that Dan Gable, great wrestler, right, right? I watched him for so long. He weigh, I think it was like 189 and like practically like nothing. But whatever it is, I mean, nobody even knows. He works hard but a lot of people work hard. But some people have -- the same thing with business, same thing with negotiation. I want to have the greatest negotiators. I know most of them. I come from an area of great negotiators. It's called Wall Street. I want these tough guys -- seriously. I want to put him to work for us. They don't want any money. They don't want money. I'm getting calls, you know, now that I'm leading all the time, all these guys are calling -- the biggest guys, the best. Some good, some not-so-good. Some want to get involved. Carly, I wouldn't want. I mean, what you did to that company. I'm not interested in Carly, to be honest with you. But no, seriously. I have the best negotiators in the world calling. Carl Icahn, great. He's made a fortune. He doesn't want money. He just wants to do it. I said, Carl, handle China. Good. I'll do it. Guess what? Lots of good things are going to happen, folks. Lots of very good things. But we have great people and we don't use them. I always say in Japan we have Carolyn Kennedy. What does she know? And you know the story -- has anyone heard the story about Caroline Kennedy, right, from 60 Minutes? I was on 60 Minutes the other night. By the way, my stable mate was Putin, right? And they got the highest ratings they've had in a long time, 60 Minutes. So I'm taking full credit for that. I'm not giving it at none. They had a huge -- and then I'm doing Saturday Night Live next week. That's going to be great. You better watch. It'll be interesting. You better watch. I did it eleven years ago. The Apprentice hit No. 1 and they said, \"Would you do Saturday?\" And here I am doing it again and this time -- so it's been -- you know, I mean it's been an amazing -- It's been an amazing period of time but we need our best people. And I tell the story about Carolyn Kennedy. People love the story, but it's it's true. It was on 60 Minutes. She came in and they're doing a profile of her because she's the ambassador to Japan and they come in and they have the cameras on her and they say, \"How did you get the job?\" \"Well, I didn't have anything to do.\" And by the way, a friend of mine said he actually went to the tape and he said, \"You're imitation is almost exactly right.\" So I'm saying, you know, saying pretty much right. Well, I came in, \"You're fired.\" I came in. I came to the White House. You know, well, she's obviously very close with Obama. I came into the White House. I said, \"I'd love to help out is there anything I can do?\" Very nicely, very meekly. Very nice. And my my daughter likes her so she has to be a nice person, you know, Ivanka. We love Ivanka. I could have her do some negotiating for us, believe me. She is tough. She is tough but she's good. She's got a great heart. But Carolyn Kennedy comes up and she goes, \"Well,\" I said, \"Do you have anything for me to do. I have just nothing to do. Do you have anything to do.\" They said, \"Would you like to be the ambassador to Japan?\" She goes, \"Really? You mean that?\" She couldn't believe it. So now she is the ambassador to Japan and they have her in 60 Minutes where she's being wined and dined by Abe, who's a killer. You know, he's a great leader. He's the best leader Japan's had a long time. They're doing big devaluations of their currency. They're killing us they're killing us, and she's our negotiator. I don't want that. I want Carl Icahn. I want Henry Kravis. I want these guys. I want the right people. I want the right people. I don't want that. With Japan last year, $70 billion -- this is in one year. How do you lose $70 billion and then say, \"Oh, let's have dinner. Let's have dinner. They come over. We give them a White House fret. We give him a beautiful White House dinner.\" With China, they come over the other day and we have this beautiful tent on the lawn. They put a tent. You know why? They turned down my offer. You know I offered to build a ballroom. You know that. I offered to build a ballroom and I called up the Obama administration, spoke to a very nice guy, David Axelrod. I like David Axelrod but it's OK. Got to speak to somebody, right? But I spoke to David Axelrod and I said, \"David, you know what, I see you have tents and it's not even safe.\" You know, it's cloth. It's not good. I said, \"If you want, we'll get five of the top architects only in the United States.\" We're only -- we're not interested in the foreign architect for the White House. Do we agree? Makes sense right? We'll get some great architects and we're going to design five ballrooms, big ones. It's going to cost me $100 million to do it properly.\" Like I'm doing at the old post office site, which is going to be great. \"We're going to design five ballrooms by five different architects. Put all your people in charge. I will pay for it 100% and we'll get just the right -- we'll go out to the critics. We'll get one that everybody loves. We'll put them together. We'll do whatever we have to do. It'll be so beautiful. It'll be great.\" I never heard from them. Nobody ever called me. Nobody ever called -- I was going to give them $100 million gift more. I want to spend more although I can probably do it for much less, to be honest with you. I'm good at that. Good. Believe me, I'm good. But I never heard back from David. He never called me back. He never called me back. And I said -- I didn't mind. You know, I don't mind saving $100 million or something but I said, I said -- I was just in this mood. I said, \"You know, it doesn't make sense.\" You have these big state dinners and they're intense. And I guarantee you, the guy that owns the tent because I don't think it's owned by the White House folks, meaning us. The guy that owns the tent is making a fortune. OK. Can you imagine? There's no negotiation. How much is it? Well, that'll be $3 million for the weekend. Oh, that's OK. You know, the tent is rotted out. It's old, it's falling down. It's worth $10, probably gets a fortune. You know, the -- I'll tell you now this is a story that they deny but I don't deny it. So you know in the Capitol, the rotunda there, they're doing a big scaffolding job, right. My real estate friends would love this because to me -- now they're denying it, so let's assume they're correct, right? But I think I talked them into it. So I heard they were going to take -- I have pretty good authority. You know I'm building a big, big building on Pennsylvania Avenue, the old post office. And I said, \"How did I ever get that property?\" The most sought-after property. \"How did how did Obama get it to me?\" Everybody wanted it, including the Pritzker family and that's a good negotiator, right? And I got it for the right price. I didn't overpay. But here's the thing, going to be a great hotel. It's going to be fantastic, it's going to be great but -- so the rotunda, they put this unbelievable scaffold. It's been up there for about two years. They've got to fix up some -- they've got a point. You know what point is? It's a bing, bing, bing. Ten minutes later, you take it down. It's finished, right. So they have the scaffolding up. Beautiful job, cost millions of dollars, millions but they're worried that they won't make the inauguration because they don't want to have the scaffolding up for the next president, which hopefully is going to be me. Wouldn't that be great? Wouldn't that be great? So I was told -- and then after they heard, there was a panic and they denied it and they said -- but I was told that they're not going to have the work done and they want to take the scaffolding down because, you know, that ceremony is magnificent. And they want to take the scaffolding down for the event for the ceremony, have the ceremony and then two days later start putting it back up again. So I said, \"I have two ideas. Number one, if you can't do it leave it up. I'll be OK with it. OK. Leave it up. Don't take it, please. Please, don't take it down.\" It's amazing what these photographers can do. We can erase it for $2, right? They can erase it, take the scaffolding off. But even if you leave it -- but I said, \"Do me a favor. Don't touch it, just leave it.\" But I have a better idea. Have them work faster and get it finished. Wouldn't that be great? You know, OK. Let them work faster and get it finished. So they deny this and get it finished. So they deny it. They said, \"Oh, no. It'll be done in time.\" I guarantee you it wouldn't have been, and I have it from a very good source. It would not have been but now I'll bet you because of what I've been doing because I've been using that and I've been telling people about that and people find it terrible. I think they'll probably get it done. I can imagine what they're paying in overtime. Wouldn't that be terrible? OK. Let me let me check out that bill. Oh, these contractors, the money they make, the money they make. So we're a country with 93 million people out of the labor force. I mean, you know, we've got 93 million people. Many of those people want to work. They can't. And then we hear, yes, the unemployment rate is down to 5.2, 5.3. I'll tell you what, if it was really 5.2 or 5.3, I probably wouldn't be up here tonight. And if I was -- there'd be three people in this room instead of thousands. There'd be three people. So we have 93 and if you really superimpose, I was always pretty good at this stuff, you could very well have. I mean, you can have a 30% unemployment rate, real rate. I'm talking about a real rate. You know, the story. You look for a job, you keep looking, looking, looking. Three months later, you say, \"I can't do I anymore. I can't look. I've got to take a rest. You go home, you stop looking.\" You're now considered statistically employed. And the reason that is, is because it's for politicians. They always want to look good. What does that have to do with unemployment? So I think you have actually an economist and a very smart guy, two weeks ago, said the real number is 42%. So let's say that's high but let's say it's 30 or 25 or 20 or 15. One thing we know, it's not 5.2, 5.3, about 100 million people close. We have 50 million people in poverty and with no hope of getting out because there's no incentive, there's no drive. We're run by the great divider. He divides everybody. And I thought actually when Obama won, I thought that he would be a unifier. One thing I thought. I said, \"I don't know if he's going to be good.\" And I would love him to be a great president. By the way, speaking again, I would love him if he would be a great president. I'd be very happy. I don't mind staying in my business, running my business, having fun, doing what I'm doing. I would love him. I know it's not nice for me to say I'm a Republican I'm conservative. I don't want to say it. But if he would do a great job if he were happy so would most of the people in this room. It's not working that way, folks, and it's not going to happen. It's not going to happen. So we have 50 million people in poverty. We have 46 million people on food stamps. We've got tremendous problems with Obamacare. You know, your premiums in case you haven't noticed are up 45%, 38%. Some person said, \"Well, it wasn't 45%, Mr. Trump,\" shouted out from the audience. I think maybe an Obama fan but shouted out from the audience, \"Wasn't 45.\" I said, \"Oh, yeah.\" I said maybe I'm in trouble. What is it? \"It's 38%, sir.\" Oh, fine. That's fine, 38%. And some of them were up 50%, 50. Your deductibles are through the roof. Your deductibles are through the roof. Unless you get hit with a Komatsu tractor because Komatsu is doing very well because, you know, what happened with Japan. They've devalued their currency. Caterpillar is having a very hard time. You know that right? They're having a very, very hard time. Very, very hard time. But unless you get hit by a Komatsu tractor, coming right out of Japan, the deductible is so high. It's never going to -- never going to you -- have to die. And then it doesn't work because that's not what deductibles are supposed to do. So you've got huge increases and we have to repeal and replace Obamacare with something great. We have to do it. We have to do it. A country isn't a country unless we have a border. Do we agree? We're going to have a border and people are going to come into the country but they're coming in legally. They're not coming in illegally. They're coming in legally and we're going to build a wall. It's going to be a great wall. It's going to be a wall that really is effective. Walls do work. You can look at Israel. You can look at different places walls do work but you can't have walls that are fences this tall. Did you see the picture? Did you see the picture in Time magazine a couple of weeks ago where they're driving drug trucks over a little wall. They built ramps and the trucks are going over back and forth carrying drugs and things. I mean, what are we? What's going on? What's going on? We have tremendous drug traffic coming into this country and they just come in unabated. I mean, it's just unbelievable and we allow it to happen. We're going to have a wall. We're going to have a great wall and Mexico's going to pay for it. And remember I said that, just remember I said. And just so you understand I love Mexico. I love the Mexican people. I respect the Mexican leaders but they're much smarter than our leaders, much smarter. They're getting away with murder. They tell me that they tell me that. China, I have the richest people in China. They're friends of mine. They tell me everything. Of course, now they're not being so open now. I was only kidding a year ago. They didn't I was running for president. It's true. They didn't know I was running for president. But Mexico, if you don't think they send people in. Kate, beautiful Kate, from San Francisco shot in the back by a man that was pushed in, in my opinion pushed in five times maybe six times, maybe eight times. Nobody even knows. But he should -- he wasn't supposed to be here and he shot her in the back. Three weeks ago, you had a woman raped in California. A 66-year-old woman, a veteran. And by the way, we're going to take such great care of our veterans because they are treated so badly, so badly. We're going to build our military stronger than ever before, so strong that nobody's messing with us, nobody. Nobody's messing with us and we're going to take care of our veterans who, by the way, are not treated as well as the illegal immigrants. They're treated better. The illegal immigrants are treated better. They're treated better. So we're going to change things and we're going to change them so fast and we're going to change them so good. And you're going to have victories. You're going to have so many victories. When was the last time, and I say it. I love saying it because it's so sad but it gets the point across. We don't have victories anymore. We don't win anymore. When was the last time we won? We lose to China to every place. I mean, does anybody come from any exotic country because I guarantee we lose to them because we lose to everybody. But you look at Japan with the cars, they just pour off these massive boats. I was in Los Angeles three or four weeks ago. I never saw ships as big. And cars are just pouring off the ships, pouring off like a long -- they go so fast. Boom, boom, boom. No tax, no nothing. Not going to happen anymore. It's not going to happen. It's unfair. It's unfair. It's incompetent. You don't even know. I mean, some people think there's evil intention because how can anybody be that stupid? I don't think it's evil intention. I really don't. I mean, other -- I know people in this room think it's evil intention but how can they do it? How can they allow it to happen? We give them beef, Japan. And then they send the beef back, which is not good for the quality of the beef, by the way, back and forth. And you people know it because you do trading and you do some -- it's so hard. They don't want our product and yet we take their product. No tax, just come on in. I tell the story and I love this story. And I could use different -- because there's so many different companies I could use. You know in Tennessee, a big car factory was gonna be built. They decided to go instead, as you probably have heard, to Mexico. Big, big, massive plant. In Nabisco, I have some property, a beautiful property in Chicago. Nabisco is moving its plant out. They make Oreos. They're moving its plant out of Chicago. They're putting it in Mexico. How does that help us with our trade deals, our brilliant trade deals? We're losing everything. We're losing our jobs. The one I love to talk about is Ford though. They're building a $2.5 billion factory, $2.5 billion. You know what that is? It's a one-story building. You know what $2.5 billion means? You go forever. It's massive. They're going to sell cars, trucks, and parts, and they're going to sell them into our country. Now they're taking and they're going to close places in Michigan and all over the country, and I don't want that. And I said, \"Supposing I was president, I can tell you what I'd do.\" But now take Hillary. Let's say she's president. Do you think she's even going to know that it's happened? She's not going to know. And if she thought it were wrong, if she thought -- she's not gonna have a clue. Look, nothing but trouble. She's not going to have a clue. But take Hillary, so she says, \"You know what, that's not good. We're losing all these -- \" Do you know how many plants that is to build $2.5 billion one big monster plant? That's a lot of jobs, and they're not going to us. So Hillary would say, \"Well we don't like that. I don't want it.\" She would be hit by the lobbyists. She would hit -- immediately she would be hit by Ford lobbyists. She would hit by Ford special interests and Ford donors and people that own Ford stock. And within 10 minutes she'll say, \"Oh, it's OK.\" I'll be hit by people but they won't even call me because they don't have a chance. It's over. It's over. It's over. It's over. And I would tell the people at Ford. I don't want you to do that. I don't want you to close your plants. I want you to build new plants. You don't have to have the old ones. And I don't care -- it can be anywhere but it's got to be in the United States. And if you're not -- and if you're not going to build them, then we're not going to allow cars and trucks and parts to cross the border with zero tax after what we've suffered through. We're not going to allow it. We're not going to allow it. I mean, the way our country is run, if it doesn't happen to be me that wins, you know what's going to happen? They're going to build a plant and illegals are going to drive those cars right over the border. I'm telling you. It's going to cost them nothing. Right over the border and then I'll probably end up stealing the car and that'll be the end of it. We have got to get smart. We have got to get smart. Now I would say the following I would say to the head of Ford. Here's the story and this is what you're going to do. Here's the story. We're not going to let you do this. We want you to build but if you don't want to that's OK. We're charging you a 35% tax. Then we'll charge you. By the way, I'm a free trader. I believe in free trade. I don't want to be isolated. I believe totally in free trade. But I say this is what we want to do I want something out of it. We don't get anything out of it even, by the way, the Keystone pipeline. You know what, stuff comes from Canada and that's fine. It's all good and I liked the Keystone. I think it's good. We got to get a piece of it. I want a piece of the action if we're going to let them build. OK. If we're going to let them build because, you know, it turns out that we have so much natural under our feet with the new technology. It's incredible. So we're competing against ourselves but we got to -- we have to have people with deals. So here's what's going to happen. I will be called by people and I will say I'm sorry. And I guarantee you that by the end of the day, the head of Ford will call me, might take an extra day if they want to play tough and they will say, \"Mr. President we really don't think that's fair. We don't want to pay taxes.\" That's OK. By bing. OK. No. That's it. And then by the end of the day, I guarantee you. I get a call and they will say, \"Mr. President, we're moving back to the United States. We're going to build that plant in the United States.\" OK. I guarantee it. And by the way that went so easy I wouldn't even waste the time of my negotiators to be it. That was too easy. OK. That one, believe me. It's so easy to say with Nabisco. And again Mexico great. I just don't want them taking all our business. You look at what happened to New England. I mean, the business that poured out of New England. With all of that happened, the business that poured out is unbelievable. You see factories all over the place. Some are converted to apartments and they converted to other things but the apartments don't bring in the rate that's for sure. We need jobs. We don't need apartments. We don't need apartments. I have apartments. We need jobs. We need production. We need factories. We need our jobs back. Now China, they devalue their currency. They're killing us. It's impossible for our companies to compete. Three weeks ago, they did the biggest devaluation of their currency in 20 years. They say in two decades. And that wasn't supposed to happen because they've been devaluing it all along. And they are just absolutely destroying us. A friend of mine bought a plane. OK. He wanted it to be sent to China. He had to pay a massive tax. He ended up losing a share. I was happy because he's a rich guy. I don't care. I couldn't care. He had to pay to get the plane into China. He had to pay a fantastically large tax tariff. He had to pay. You couldn't believe it. I won't even say the number because I still can't believe it was. It was a number that was so large it wouldn't make any economic sense because they don't want planes that are built here. They don't want other things that are built here. They charge. You can't get your stuff in there tax free. You can't even get in there. But if you do, you can't -- it's unfair and that's why we're losing almost $400 billion a year. And they look at us and they say, \"They are the dumbest human beings on Earth.\" That's true. That's not going to happen anymore. Boeing just placed a big order. They're buying 300 Boeings, beautiful plane. I have one so I like it but it's a plane, 300 planes. But you know what they're doing. They want all their technology. They want them to build factories in China. They want the plane's manufacturer over there. Boeing is going to start building massive plane assembly plants and factories for the production of aircraft in China. Why? Why? That's not good. In South Carolina, they have Boeing. In Seattle, they have Boeing. I want them to expand here. I don't want them to do that. I don't want them to do that. So I passed a tax bill and we put it through everybody and everyone loves it. We're lowering taxes substantially. You know, we're the highest tax nation in the world. We're bringing corporate taxes and small business taxes down 15 -- we're bringing them down to 15%. That's right. We're simplifying. The tax code. We're going to have four tranches. It's going to be so beautiful. It's going to be so dynamic. It's gotten some great reviews. You know, you always have somebody that doesn't like it. We don't like it but we have to do it. You have corporate inversion. Nobody knows what it is. Companies big companies have trillions of dollars, $2.5 trillion offshore, out of the country. They can't get the money back in. And to show you how paralyzed Washington is the Democrats and the Republicans want to bring that money back. That's been going on for four years. They can't pass it but everybody agrees. I mean, they want to bring the money back. It's too complicated and it's too expensive because the tax is so high. I want the money to come back. It's part of what I'm doing. And that money, trillions of dollars. Now the $2.5 trillion, I think, is a low number. Nobody even knows what the number is. It's massive. But a lot of companies are going to be leaving the United States to go get that money. They are going to now move out of the United -- and these are big, strong, powerful companies with thousands and thousands of jobs, and they're also going to get a better tax deal. So they're going to Ireland and they go into lots of different places and it's called corporate inversion. You have to -- it's going to be the biggest problem unless we have competent leadership. And the amazing thing about this one is everybody agrees but they can't get it signed. They can't get a deal and they all agree, and this is what we have. We have total gridlock in Washington. We have people that just don't have it. They shouldn't be doing it. And you know, the amazing thing, and you've seen it, people get elected. And they're strong and they're tough. Then they go to Washington and they're very conservative. Now we're going to get rid of Obamacare and we're going to get rid of this and that and we're going to bring the money back into -- and they go to Washington and all of a sudden they're in this gorgeous building, maybe even nicer than this one. They're in this gorgeous beautiful columns, the beautiful ceilings, everything is so beautiful. They look at their wife or they look at their husband and say, \"Oh, this is incredible. We've made it. Look at this.\" And they've become nothing. They get elected to make things right And they get to Washington and they become -- he said it wimps. They become -- something happens to them, something happens to them. So we're -- they want to stay there. You know what happens? They get good at getting re-elected. That's all they care about. One thing I can tell you, I get to Washington, it's not going to happen to Trump. It's not going to happen to Trump. It's not going to happen to Trump. So we're going to take care of women's health issues. You know, women have lots of issues where they have the health -- a tremendous health care issues, tremendous, that people don't even talk about. We're going to take care of women and women's health care issues. We're going to take care of so many different things. We are going to make our country rich again. We have to make it rich. Somebody said to me, \"But that's not really nice to say rich.\" Well unless we get it -- right, we owe $19 trillion dollars. We're third world. You look at our airports, our roads. You look at everything. We're third world. I go to Qatar. I go to these places. These incredible exotic places. I see airports. We don't have anything in our country like it by a factor of 10. You see airports in Dubai. You see airports in China. You see airports in Saudi Arabia. You've never seen anything like it. We come home. We land at LaGuardia with the potholes in the runway. It's true. They say, \"You can't land, sir. They're fixing the potholes.\" It's true. It's a disgrace. We used to be emulated. We used to be the ones that people would look up to. We have the greatest resources. What we have is the people. We have really smart people. We have great people. We don't use our best people. We don't use them. But the bottom line and I think the reason, and you know what, we have a full packed house tonight, thousands of people. But honestly, everywhere I go. And I don't know it's me. I think it's not me. I hope it's not me. It's the message. There's a movement going on. There's actually a movement going on. It's a strong movement. It's a strong movement. You know, they used to call it the silent majority. It's not silent. It doesn't work. The term doesn't work because I have seen -- I go to Dallas. OK. Mark Cuban calls, good guy calls me. Do you want to use the stadium for the Mavericks. Yeah. When? I call. So Thursday, we go there on Monday. We have 20,000 people. We had 35,000 people in Mobile, Alabama. We had 20,000 people in Oklahoma. Every place we go to in Iowa were packed. You know that. People standing outside trying to get in. It's been an amazing moment for me. A friend of mine is a very successful guy said, \"How many people are you speaking tonight?\" I don't know. 4,000 people. A lot. He said -- and that's a small group. It becomes -- like 4,000 is a small group. He said, \"How do you do that? You write speeches?\" I said, \"No, I have a great memory.\" But I said I more more than memory though, much more. I have a heart. I know what we have to do. I don't need teleprompters to tell us what we have to do. I don't need it, you know. We come into this room and, you know, people they come up and I see it all the time. I see the people I'm competing against. They get up and they're more worried about the teleprompter angle. You have the angle. Then they get up. Good morning ladies and gentlemen. Everyone's falling asleep. It's brutal. It's good. But that's what we have. We can't have that. We have a teleprompter president. We can't have that. We need somebody. We need somebody that could do the job. A friend of mine just got back from Shanghai. He's in Shanghai. He said, \"Donald, I've never seen anything like it. What they're doing there is unbelievable. He sends me pictures of cranes on every corner.\" I mean, everybody going crazy. There's nothing like it, and I could name so many other places. It's not happening with us. It's not happening. It's the opposite with us. Everything's leaving. Everybody's laughing at us because we're led by people that don't have it and it's not going to happen any longer. And that's why I'm doing this folks. That's why I'm doing it, believe me. And I will tell you I will be the greatest jobs president that God has ever created, that I can tell you. That I can tell you. God will be very proud of me because he wants good. I will be the greatest jobs president that God has ever created. And I mean it's so much it's so easy. You know in one of the polls, actually a CNN poll, they did all these things and I was No. 1 in leadership, in jobs, and this. And I said, \"Why -- let's -- I mean, that -- those are important things.\" We will do something that's going to be so spectacular. Now I always say and the whole theme of what I'm doing is make America great again. And you know I'd say the American dream is dead but I'm gonna make it bigger and stronger and better than ever before, and I mean that. The American dream is dead. It really is with the regulations and the problems and all of the problems that this country has. And I'm gonna make it bigger and better and stronger than ever before. We're gonna be so proud of our country. We are going to have so much victory. You may get angry at me because you're going to say this is boring winning so much. This is boring. But you know what, that's never going to happen. We're going to win so much. We're gonna have so many victories. We're going to win on trade. We're going to win with the military. We're going to have -- think of it. I watched the other night, a general being interviewed, said he's leaving, he's retiring. What do you think of ISIS? Oh, it's very tough. It's very tough, very tough. ISIS is very tough. 50,000 people. Very, very tough. I said, \"Boy, that's sad.\" Even if it was tough, he shouldn't be saying that. Besides that what's the general doing on television being interviewed? Why is a general being interviewed? I want my generals being interviewed. I want my generals kicking ass. I mean, no suit. I don't want them being interviewed. I will find the General Patton or I will find the General MacArthur. We have them. We have them. They're probably not politically -- remember we got rid of -- I won't use his name. We got rid of a very good general because he was too rough and he used foul language and it was rough at his men all loved him. You know who I'm talking about, right? Right. He was a rough guy. That's what we want. I want smart. No. 1 smart, but we want tough. We want people. So when I see, as an example, President Obama. We will be leaving Iraq -- we should have never gone in, in all fairness. OK. We spent $2 trillion, thousands of lives, wounded warriors, who I love all over the place. We had nothing. We took nothing. Remember I said, look, you shouldn't have gone in because you destabilize the Middle East. But now you're getting out keep the oil. You know who has the oil now? Iran and ISIS has the oil. Remember I said how mean I was because I said keep the oil? Remember, they said -- everybody. All the pundits, the great geniuses on television. Well, Trump will run but he won't do very well. He should be out within one week. Well, you know, I've been on top a long time folks, a long time. But these same geniuses, these same pundits, I call them the talking heads, right, these same pundits on television. They said, \"Well, you know, you can't keep the oil because this is a sovereign country, Iraq.\" Iraq is a sovereign company. It's broken up. Nobody knows what the hell. There is no Iraq. You know what's happening to Iraq. Iran is taking over Iraq because we were so stupid. We -- we ruined it. And what happens now, Iran goes over takes the oil, takes all the resources, takes everything. We get nothing. Now they go into Syria with Russia. We're sitting here like a bunch of dopes. We're run by people that are totally and grossly incompetent. It's not going to happen anymore. It's not going to happen anymore. It's not going to happen anymore. Believe me, we're going to win this election. We're going to win the primaries. We're going to win the election. We're going to beat Hillary. Hillary has done a horrible job. She's not worthy of being president. And we're going to make this country great again. Thank you. Thank you. Thank you. Thank you."}