{"id":499,"author":"Donald Trump","title":"Speech: Donald Trump in Richmond, VA","date":"2015-10-14","link":"https://factba.se/transcript/donald-trump-speech-richmond-va-october-14-2015","paragraphs":["What a place, I love Virginia, man. What a place. What a place. You know I have a lot of people that work really hard. I pay them a lot of money. Probably, too much money, but that's okay, right? And I have the vineyards in Charlottesville. You know about that. And in Loudoun County I have Trump National, which is a tremendous success, right along the Potomac River.","Probably, no piece of land like it, it's phenomenal. And we've had tremendous success in Virginia. We have a lot of people that worked for me. We have a lot of people. Frankly, I work for them the way I look at it because the truth is they're so good. That I actually need them more than they need me. Does that make sense?","So it's one of those things. And you know what I did? Where is Carrie? Where is Carrie? She -- Get up here Carrie, come on. She's so incredible. She runs the vineyards -- Trump Vineyards. You know what it is. A lot of people go in fact, one of the drivers was telling me, he goes there back and forth all the time bringing in people, but Carrie Willard runs it and she has done such an incredible job.","We took it over. About four years ago, it was, to put it mildly and serious trouble. It's close to 2,000 acres and it's one of the most beautiful. The largest, actually the largest vineyards on the east coast of this country. The largest and It's become an incredible -- incredible tourist attraction. And Carrie has, literally from day one, I mean she's taken it and it's with love and with pride and I'm proud because you know one of the things, and I have to say this, that Ivanka said you have to say it, my wife said you have to say it. And I think you'll confirm it Carrie.","But I have more women in high executive positions. In fact, it's true. Its true. In fact, the men in my company are all complaining. Is that OK? The hell with them right? But I have so many women -- Carrie just say a word. Tell them, do you like Trump?","Thank you. Thank you. She has done such an incredible job. Thank you Carrie. You know what I have a place and it's usually I have a lot of them but when I go to certain areas and if I have something that I'm very proud of I like to bring the employees we have some of our employees here today from the vineyards.","But I like to bring the employees up because it's so important especially when you're looking at what's going on with a country where our jobs are being taken away. They're going to other places, as you know, like many other countries. I mean, you can name the country. We don't make good deals anymore. We just don't. And so when I'm around one of my places I love to bring my people up. I love it. You know we had some big news today because, I -- I just have to talk about it. We get such -- such a -- you know in the old days would cause misinformation.","Do we agree? And we're going to talk about the debate. Anybody watch it last night? Yeah. And I tweeted. I tweeted. Can you believe? And I made a commitment I said, \"I tweet. So I couldn't turn it off. I had to tweet this thing.\" And somebody said on one of the networks the winner was Trump because we picked up a hundred and sixty thousand followers, you believe it? Hundreds of -- And second place was a lot less.","I will tell you that, one of the folks on the stage, but you know so today CNN came out with a poll. And the poll was in the state of Nevada. They came out with another poll in South Carolina, which is incredible place, both incredible places. I said I have to read some of these because this is wild. So we're in first place everywhere.","I mean -- you're right. That's true. Actually true. That was good. You could -- you really helped. He said, \"Everywhere.\" I said, \"Yeah, you're right it is everywhere.\" I mean it's Texas. Where in New Hampshire, where in Iowa, we're in first place everywhere. But the polls just came out. And as you, know a couple of weeks ago we had Florida and we're just killing in Florida.","So you have a governor and you have a sitting senator. And it's not even close. We're at 28, 29. They're in the teens, low teens. And we want to keep it that way. We're actually, we're going up. I'm not even happy with what I hear, 29 now. I'm saying we should do better because here's what just happened.","So in Nevada we're at 38. Think of it, 38. Second place is 22, I won't even bother telling you it doesn't make any difference because when you have 38, you're almost doubling it up. But here's the thing that I loved about the poll, again, done by CNN, South Carolina where 36 to 18, you believe that? Connecticut just came out, 34 to 14. But here's what I really like.","Which candidate can best handle the economy? OK. Well that one's big, 67% to Trump. Can you believe? Now you gotta remember, you know, if we had two people running and you had 67% that would be a landslide right? That's a landslide. If you won with 67% the press, look at all those cameras going back, there's so many.","So many. And look at all the red lights. Show the crowd everybody, show the crowd. Show the crowd. And you got a lot of people outside that the fire marshal would not let in. So it's one of those things. But I will tell you that when you have 67% in a two-person race, that's called landslide, that's called massive victory.","I don't think there's ever been a victory. And here we have, on a thing called, the economy would you say that's important? I think so right? So 67% are in favor for Trump. OK. We won the state by a lot, meaning in the polls, by a lot. Now, a couple of these categories I have to read them; Illegal immigration, important.","We're going to build the wall. OK. Believe me, we're going to build the wall. Hundred percent. And you know, so we're going to build it. It will be paid for. Who is going to pay for the wall? Who is going to pay for the wall? So the next category -- the next category. Which is so important. That's okay.","` That's all right. That's why we have freedom of speech folks. You know? And I'll tell you -- I'll tell you how dishonest the press is. We have thousands of people in this room 6- 7,000. I think 7,200 people. We have about 10 people over there. They'll get the headline, you won't. That's pretty disgusting.","Pretty disgusting. But that's the way it goes. So illegal immigration. 55% want Trump, 13% to second place. That tells you something right there 13% -- 13%. On social issues, Trump is first, on foreign policy. Thank you very much. That's great. Thank you very much. But it is true.","I see a couple of cameras for about four people and they're going wild, the cameras, you know. It's so disgusting, but that's all right. On foreign policy, Trump number One, 34%. On ISIS, who's going to handle ISIS? Trump, 46. We're not going to play games. We're not playing games. We're not playing games.","on the change on how we do in Washington, on the change. How are we going to change Washington? Who's going to do the most effective job? Trump, 60%. 60 -- 60%. Here's an important one, best chance of winning in November, Trump number one, 47%. Amazing. So win number one at 42nd and then you get into 16 and 10. That's a big difference.","So we've all come a long way together. We've all come and you know we have a lot of bad people out there they want to stop progress and you see it all the time. And I use the statement, the silent majority, the silent majority is back folks. The silent majority is back. The silent majority is back. So over the last period of time.","We have had a very interesting thing happen. We've seen our country where we don't win anymore. And we're going to start winning so much, we're going to win left, we're going to right -- win right, we're going to win everything. We have unbelievable people in this country. And nothing is going to stop us from starting to win again.","You look at what's happening with foreign countries. You look at how they're taking our jobs, how they're taking our base, how they're taking everything we have including our many. You look at what's going on with the foreign, no matter what country you're talking about, they beat the United States. It's not going to happen any more.","It's not. Our trade deficit with China is almost $400 billion. $400 billion a year. A year. And then I see our president entertaining the heads of China and talking about our great trading partners. Yeah, they're a great trading partner for China not for us. Our deficit with Japan is $70 billion a year. The cars pour in, we don't know what we're doing.","We sell them practically nothing, relatively speaking, while we sell them is beef. Beef. They sell us cars, you go out to Los Angeles, you see these ships. The biggest ships you've ever seen and the cars are pouring off. And they have no respect for us. And our trade deficit with Japan is almost 70 million.","Think of this -- think of this, Japan $70 billion which is absolutely crazy. Now we go to Mexico, I love the people of Mexico. I love Mexico. They're great people. I have thousands and thousands of Hispanics working for me. Thousands. Thousands of Hispanics. And in fact, in Nevada, the same poll I win with the Hispanics, which everyone's surprise.","I win with the Hispanic. So our trading deficit with Mexico is $45 billion a year. 45 billion. Now, I'm going to build a wall that's going to be really a wall. It's going to be something special. Nobody's coming in other than if you come in legally. But here's the thing. Everybody said, \"You can't build a wall.\" And I say, \"Mexico's going to pay for it.\" They say, \"You can't do that.","You can't do that.\" How can they do that. So if the wall cost $6 billion to build and you know we're talking about a thousand miles. It's 2,000 but you need it on a thousand. The Great Wall of China, think of it, is 13,000 miles who was built 2,000 years ago. We have a wall that has to be built. We have problems coming in like nobody has ever seen before.","It has to be built. Has to be built. Whatever anybody said, just remember this, almost everybody wanted this wall built 10 years ago, 12 years ago, 15 years ago. The Liberals, the Conservatives, everybody wanted it. One of the reasons it wasn't built is because they couldn't get an environmental impact statement approved.","You believe this? All right. We're going to build the wall. Mexico's going to pay for it. Now the people, the stupid people, say Mexico will pay for it. We give Mexico billions of dollars. We have that trading deficit of almost $50 billion. We're talking about a five, to six, to seven if you go Rolls Royce you go. We're talking about from $5 -$7 billion.","Who couldn't get that money? They're going to pay us so gladly, they're going to pay it so gladly. And I will say this, I speak with our politicians and I speak to them all the time. But I speak to them loud and clear and I know who I'm dealing with. And a lot of them are nice people but they say, \"Donald you'll never be able to get them to pay.\" And I realize they're not the right people to do the job because with the right messenger, they will pay so happily, so gladly.","They're taking advantage of us at the border. They're taking advantage of us with trade. They're very good people but their leaders are smarter than our leaders our leaders don't have a clue. They don't have a clue. We have -- we have a situation, where a mother is pregnant she goes to the border, she walks across the border right in front of our border patrol, who are great people, but they're not allowed to do their job.","She lies down, she has a baby, that they call anchor babies, she has a baby. Now we're responsible for that baby for 85 years. OK. I don't think so -- I don't think so. I don't think so. We can't do it. We owe $19 trillion. We owe a number that's almost inconceivable when you think about it. So we owe $19 trillion, we can't be in a position where we're doing, what we're doing anymore.","We just can't. We have to rebuild our country. We have to rebuild our infrastructure. We have to repeal and replace Obamacare. Have to do it -- have to do it. Obamacare is going to cost us more money than anybody would have ever dreamt. And it's no good. It doesn't work. Your premiums are going up 55%, 45%, 60%. Your deductibles are through the roof.","You can be dead and never get any of the money. Your deductibles are so high. So we're going to repeal Obamacare. We're going to replace it with something that's going to be terrific and It's going to be terrific. It's going to cost our country very little. And people are going to be able to have their doctor have their plan pay less money.","If they're sick they're not going to have to worry about a deductible being so high that nothing works unless you get hit by a tractor. So we're going to do that. We're going to do so many different things. We're going to make our country great again. We're going to make it so great. Immigrants.","They're suggesting, listen to this, they're suggesting Social Security for illegal immigrants. So we're going to straighten things out. We're going to do it the right way. We're going to bring immigration under control. We're not going to have a situation like Kate, beautiful Kate, in San Francisco. This guy comes in five different times.","It could have been much more than that. After the fifth time, she gets shot in the back. We're not going to have it anymore we're going to have a situation that's going to be rational reasonable. We're going to keep in the country when somebody goes through a -- a long process with college. They go to Harvard, they go to Yale, they go to a great college University of Virginia, great college right.","Great, that is right next to our property. We love them. That's a great college. But they go to University of Virginia. They do fantastic. They do and they do just great. And they're so proud and they're from another country. But they want to stay here and we tell them, \"Get out.\" You stayed here. You have to go home.","And then the case in India, where a man opened a company, wanted to stay here he ends up opening the country in India. He now has five thousand employees it's one of the hottest companies in the world. And he would've been here. You would have been here. And that's what we want. We want to keep people here we want people to come in legally and I say -- I say, and so importantly and I'm saying it all the time, we want to have a big door.","We want to have a big beautiful door right in the middle of that wall. And we want those people to come in. They've got to do it through a legal process. If we don't have a border -- if we don't have a border and we have people all over this country we have no idea where they're coming from. We don't have a country.","We no longer have a country. It's very simple. And we're going to do it with heart and we're going to get along with people and everything's going to be great. But we're going to have a country again, we're going to take back our country and we're going to start doing things properly. When when we have countries, like the ones I named, and many others and we have people that take advantage of our leaders because they're not smart, they're incompetent, they're stupid or they don't care, that's going to end.","I have the greatest minds on Wall Street, I have already lined up. They're calling me, these are the greatest negotiators in the world. They're calling me. Carl Icahn, Great. I have all of them. I have the best in the world. They don't want money. They don't want salaries. They're rich, they made it because they're great negotiators.","They want to come and they want to see our country be great again. They're proud of our country. Some are nice people, some aren't, I don't care. I want the greatest and I know the best, I know the smartest, the sharpest. I know people that are overrated, I know people that are better than all of them. And we're going to bring them in and we're going to bring them in and they're going to be in charge of; one, China.","Let let me tell you about China, first of all I love China, the people are great. They buy my apartments for $50 million all the time how could I dislike them right? I tell it to everybody. I have the largest bank in the world and one of my buildings it's from China. I mean, there's a bank that makes Citibank look like this big.","I love China but they've taken advantage. I -- I wish you were turned around. I wish our representatives took advantage of them. I think that will be great -- I think that would be great. But it's a one-way street. It's a one-way street to poverty, for us, poverty. We can't do it. We're in a bubble right now, believe me, we are in a bubble.","We have a phony statistic on jobs. We have a hundred million people in the workforce, they want to work. We have a hundred million people. We have tremendous levels of poverty. We have welfare all over the place. And these are people, in many cases, they want to go out and get a great job and be proud and take home a lot of money.","But we can't because we're losing all our jobs. We're losing them to other nations. We're losing them to stupid policies. This trade pact, Trans-Pacific Partnership, it's -- it's, believe me -- believe me, I -- if it was good I'd say, \"I don't care if Obama proposed it.\" If it were good, I wish Obama were a great president, I don't care.","Then I wouldn't have to run I love what I was doing. It's true. I love it. I love it. So true. I'd love if he were a great president where I say, \"Wow. he's a great president. I'd vote, I'd be his greatest fan.\" I don't care because what I want is what's good for the country. I don't want to be doing this.","I'm actually having fun because I'm so energized I go to these crowds. You know we went to Dallas, we had 20,000 people where the Mavericks play, 20,000 people. We go to Oklahoma, two weeks ago, we 20,000 people in a park. We go no matter where we go. We went to Mobile Alabama, we had 35,000 people. No matter where we go, we go up to New Hampshire, we have the biggest crowds.","Iowa, the biggest crowd, South Carolina. We had something two weeks ago. It was unbelievable. It was unbelievable. A friend of mine actually said, \"How do you do that? How do you make speeches in front of so many people and you don't have teleprompters done. And I notice you don't.\" I don't want a teleprompter, I don't want, right?","I don't -- I don't, it would be so much easier. It would be. Think of it. You have your teleprompter, \"Hello ladies and gentlemen. It's wonderful to be in Virginia where you have. All sorts of great people.\" And you do. By the way when you talk you really have the Hall of Fame. You know, it's true that you have the Hall of Fame.","You know I told my guys I said, \"Look I'm here I employ a lot of people I have a lot of property it's great.\" but just a couple of things, I mean, you have this is a real hall of fame. Patrick Henry give me liberty or give me death. How good, right? How good is that. I want to come up with a slogan as good as that.","How about make America great again? I don't know, you know. It's great. It's great. But I still like give me liberty or give me death. That's great. See I want to get the word again off that eventually. You know, I want to get the word he just said you will, I will. It's not even going to be that hard.","It's not all it -- it takes common sense. It takes business ability and way to treat people well. You know, I say I'm a conservative with heart because we're going to have that great health care program. But we're going to take care of everyone, we're going to take care of people. And people are going to pay much less and get it so good.","We're going to take care of so many things. But I like to say, conservative with heart because a lot of people think, if you're a Republican, you don't have heart. You're mean, you're horrible people. Doesn't work that way. I've got over my plans and somebody said, \"Oh well, that's not conservative.\" You know it's sort of interesting.","You have a company -- group called Club for Growth. I talk about it, Club for -- I never even heard of it. This guy comes up to my office, right, and he sits down. Nice guy, I think he's an ex-congressman so he knows how to talk. That's all they do is talk. They're all talk no action, except for the politicians currently in this room of which we have plenty, they're great.","In fact, Dave Brat, where's Dave Brat? He's great. I was just with his family and his children and his wife. And I tell you, he's done a great job. There's a guy he shows you you can do things. I mean who would've thought that -- that's never happened before what he did. So I give him -- I just give him a lot of -- just a lot of credit.","But I have to go. OK, so Patrick Henry we talk great. Right. Then you have Thomas Jefferson that's pretty good right? Thomas Jefferson. Then you have James Madison, principal author of the Constitution, that's pretty good. And then you have George Washington, that's pretty good right? George Washington, you know.","It's pretty amazing, you know, when you think of Virginia just pretty amazing. So I tell the stories and I love these stories because it shows how important it is. I'm self funding my campaign. OK. I'm the only one and I see all of the guys that are competing with me and some of them are nice although some of them that hit me really hard.","I mean, you know, they're asking me for contributions and then as soon as I run, it's like a couple of them, like Perry, he went what? He was a nice guy. Governor Perry didn't work out too well for him but he really hit me. And then Lindsey Graham, I thought he was a nice guy but he hit me, he went made speeches about Trump because they want to get their numbers up not working.","And every case has gone down. They've all gone down. Man, can you imagine if I'm president everybody that plays tough with us they're all going down right? That's nice right? But I look at what's going on and I see so much and I see the way the politicians are controlled. Don't forget. I was -- I was the perfect person.","I was like central casting because before I ran, I was on the A-list. I contributed a tremendous amount. I got along well with Democrats, with, Liberals, with Conservatives, with -- That was my job. Somebody said, \"But you gave money to a Democrat.\" Of course, I did. I get along with everybody. One of the magazines said, \"He's a world class businessman.\" You can't have fights , you've got to get along.","I was told by Hillary in a speech recently. I was told same day by Jeb that we don't like his tone, his tone, his tone. I built this incredible company. And I built it and you'll see because a book comes out on November 3rd, which is your election day by the way, so go out and vote. Make sure the right people get it, so important.","It actually comes out, it comes out on election it's got to be great. Actually, tough name crippled America, it's a tough name but it tells you how we're going to fix it and how we're going to go about it. But I'm self funding, it's so important. I was in Iowa a few weeks ago and I said to the people I feel so foolish these people want to give me millions and millions of dollars.","And you know, it's sort of like anti-me, it's like, why wouldn't I take it? I always take money when -- that's what I do, I take money. That's how you become rich right, these guys know, millions of dollars. So I said to the group in Iowa I we have 5,000 people in an auditorium like this. I said Look here's the story.","I feel a little bit stupid when I don't take all this money. I said supposing I take it just supposing and I promise I won't do anything for them. And they all sit up and they said no no. I couldn't believe it. I thought I talked him into it. But the truth is I love what I'm doing. I love that I'm self funding because I'm not controlled by anybody.","I'm not controlled, controlled by you. I'm really, I mean, I'm controlled by you. I'm going to do the right thing. And you've heard me talking about the Ford plan, have you heard that story? The Ford plant, because I love it, but Ford, you want it again, should I do it again? I just think it's good. So Ford closes a lot of plants.","They're building a two and a half billion dollar plant in Mexico. It's all right. Except what do we get out of it? And they're going to make cars and trucks and parts and they're going to send them into the United States and other places. How does that help us? We all go to good, I went to Wharton, you all went to good schools, and if you didn't go to good schools if you never graduated from high school you know, it's not good for us. And a two and a half billion dollar plant in Mexico, that's a big plant.","So they're going to suck our jobs away. They're going to make cars, trucks and parts in Mexico. And I said to myself, \"What would happen if a Rubio or a Bush or -- or a Hillary were President?\" So here's what happens, they would know it's no good. They would all know it's no good. And they say no, no, no we can't let that happen.","And the following hour, they'd be called by a lobbyist who gave them five million. They'd be called by the special interests that gave them 10 million. They'd be called by one of their donors who own stock in Ford or whatever who gave them a million. And let's say, \"Mr. President you can't do that.They were very helpful in your campaign to become president.","You can't do that.\" And you know what's going to happen? He'll say or she'll say, \"I have to do it.\" and they'll say, \"No, no you can't do it.\" and he'll say, \"OK I won't.\" And the plant is going to be built. Now let's do the other alternative, Trump is president, they haven't given me anything. OK, let's assume.","Let's assume. So I called the head of Ford I say, I wouldn't even use my guys for this. This is too easy. This is too -- honestly, it's too easy. So I call the head of Ford I say, \"You're building a plant. You can employ thousands of people but you're not employing people in the United States. You're employing other people.","And I think that's fine. But tell me how we benefit? He'll be unable to explain it. Believe me, he cannot explain, Not to me, he can't. Believe me. I'll say, \"Listen, I want you to build a plant in Michigan or I want you to build a plan here or I want you -- I don't care. I want it in the United States. I don't want to lose, I'm tired of the jobs with NAFTA and all of these crazy deals we make.","I'm tired of these jobs the new one that we're just trying to approve. I'm tired of these jobs like a vacuum cleaner. They suck the jobs out of the country. They suck our money out of the country. We have nothing -- we have nothing. We're like a third world country. Our airports, our roads, our bridges are falling down.","61% of our bridges are in trouble, do you believe this? We drive over a bridge, it's in trouble. So I would say to him the following, I won't use his name because he happens to be a very good guy, but I would say, \"Let me just tell you something. I want you to build it. In the United States. I don't want you leaving.","And if you do leave and if you insist on leaving, you're not bringing those cars over free. You're not, you're not. Remember the trade deficit. Remember here we're talking $45-$50 billion a year. You're not bringing those guys over free. We're going to charge you a 35% tax on every car, truck and part that you bring over.","Now, I believe in free trade. I'm a free trader. But I also want smart trade and I want fair trade. It's got to be fair trade free is good, all over I want, but it's got to be fair so we can compete. So what happens is the following; He will call up and say, \"No, no, no we won't do that Mr. President.\" I will then be hit by every person I know in Washington, all of whom have given me nothing.","Fact, I've given most of them, you know, the lobbyists said they work -- I know all these people. But now they'll call and I'll say, \"No, no, no we've got to do the right thing.\" Then I'll be called by everybody else but I haven't taken their money. I owe them nothing. I only owe you people. I owe you in particular with that wonderful location, right?","And I'll say -- and I'll say the following. I'm saying, \"No, we want you to build that plant in the United States. It's going to be built in the United States. They'll say, \"No.\" I guarantee you within 24 hours, probably by five o'clock that afternoon, assuming it's made at 12. You know, they like to call around lunch time so they can have a drink and convince the politicians what to do. Assuming the call is made it up probably by five o'clock they will say, \"Yes, Mr. President we've agreed we're going to build in the United States.\" The only thing that could change is they're pretty tough negotiators so it may take an extra day.","They may wait till five o'clock the following. That's the only thing. They can't do anything. We have the cards. See what people don't realize. Obama thinks that they have the cards. We have the cards. China has created one of the greatest thefts in the history of the world. It's true. They have sunk our economy dry.","And if you want to do business in China and I have many friends that are manufacturers. And I love these guys and they're great manufacturers. And they call me all the time, they can not get their product into China. They can't do it. And when they do there's a big tax and we're like the dummies, \"I'll bring it in. Just flooded in. Come on in.\" And then they do their currency manipulation which is one of the reasons that the trade pact doesn't work.","Hillary Clinton was listening to my speech. She was in favor of it 44 times. And then yesterday, two days ago, she came out against the trade pact. You know why? Because if she has to debate me she knows she's going to get killed on that pack. Killed. And I have to hand it to Hillary Clinton. I have to -- hey, you know I'll be angry.","I have to hand it to her. It took great courage for her to go against President Obama on the trade pact. You know why? Because maybe she gets indicted. Because -- because she is being totally protected by the Democrats because what she did is illegal. And you look at General Petraeus, he did 5%, a friend of mine, very familiar with the whole subject with e-mails.","General Petraeus did 5% of what she did and they've destroyed his life. Other people have done far less and the life is destroyed. So the Democrats are just protecting her. There's no reason for this. Now I'd wanted to go a fair investigation. Let everything be fair. But what's happened is absolutely crazy.","So let's see if she she might have done OK last night. She did. She did. OK. Because nobody attacked her. Nobody attacked her. There was no attack. You know in my debate, I hate to say because we're live on CNN they're going to want it, but in my debate they said, \"Mr. Trump what do you think of this. That the man next to you said.\" and then they go to him and they said, \"Donald Trump called you a horrible human being.","How do you respond?\" That was like it was like a reality television job. Whereas last night, they'd ask a question, they get an answer, that ask a question. With me everything was an attack. It's crazy. And yet every poll that I won that debate so I'm very happy with that. But, every poll -- every poll. Drugs, time magazine, Slate.","Every poll. But it was a whole -- it was a whole different story. So we have to do something about that. Let me give you one other quick story. Nabisco, Oreos, right? Nabisco, right? Oreos. They're closing their big plant in Chicago. They're moving it to Mexico. I'll never eat another Oreo again, ever. Ever.","So I'm going to talk to them, I mean, I don't want their cookies made and sold -- I just don't want it. It's unfair to us. Chicago is losing this large plant. It's going to another country. We have a thing called corporate inversion. That's where companies have trillions and trillions of dollars outside of the United States, OK. Trillions.","They think minimum two and a half trillion, I think it's much more than that. It's covered in my tax plan, Corporate inversion. We have people and we have companies. You know in the old days that moved from New York to Florida, from New Jersey to Texas, whatever. Now they move from the United States to foreign countries.","They take all those jobs and -- Charles O. Finley, the great Charles O Finley right? The Oakland A's. He had the lowest payroll in baseball. The lowest payroll and he won the World Series three times. He had Reggie Jackson sold him to the Yankees. He had Catfish Hunter sold him to the Yankees.","George Steinbrenner, who was one of my best friends and a great, guy, he said, \"This guy's brutal. Donald he doesn't spend any money and he's killing us.\" And George will always buy his players but he bought them at the top, you know. But George said just fine, George is great. George was great. But here's a guy, the lowest payroll, they'll think of it by far -- by far in baseball.","And yet he had the best team and he won three World Series. I think in a row right, Charles O. Finley. There's something beautiful about that, to me. To me, there's something beautiful about that. So we'll spend whatever we have to spend. I mean, one of the things that happened that's so incredible, I did meet the press.","Nice, Chuck Todd. He had his highest ratings in four and a half years. He called up our office he said, \"Thank you.\" Can you believe it? I saved his job. Its true. And I did the same -- I did this week with George Stephanopoulos. They got tremendous ratings the other shows were dying -- they were dying. This is two weeks ago.","But they asked me a question just to show you. It's so terrible. They said, \"Mr. Trump.\" now you've got to say, \"Leading all the polls, getting the biggest crowds, everybody's gone crazy.\" they said, \"Mr. Trump. Is there any way that you'd get out of the race.\" And I said to myself, now think of it, who would be asked that question?","One of the commentators said, \"Who would be -- .\" if you're in first place. Would anybody else but me be asked that question? Is that terrible? So they said, \"Is there any way that you get out of the race.\" I said this strange question but I thought I'd give a very honest answer. And I said very, very honestly, \"Look, we're number one but if we weren't and if everything went down, the polls, the crowds, if you don't call anymore because you don't want interviews because it's over like some of the guys we're running against.\" I mean honestly -- I mean honestly, if I was some of those guys.","What's the purpose. I don't know, do they gain something by having zero. Do they gain something and going into a debate? They call it the children's debate. Guys like Pataki, he's got zero. Guys like Rand -- I hate to say it. he attacked me. He was much higher when he attacked right? But he went down, I mean, so many.","I don't want to use them, I don't know. I refuse to embarrass anybody, OK. But so I said to him, so if for some reason everything just tanked and I went down, I'd certainly consider it. Next day, headlines, Trump considerate leaving -- it's so dishonest. And actually it took a couple of unbelievable polls to stop it. It took a couple of unbelievable polls, which I get all the time.","I said, \"Wait a minute I didn't say that.\" but they put out stuff and it's so false and so disgusting. And remember this, much of the press today that I've met have been terrific people, an honorable people. I've met some amazing people, like 30% OK, then you have 30% who are OK and, you know, they do their job.","But you have I'd say 10 to 15 to 20% who are truly bad people they're dishonest, they're horrible human beings. They know it's not a question of being lazy or if they actually go out of their way to write false stories. And somebody asked me today, I did an interview today, and they said, \"What's been your biggest surprise.\" I said, \"I don't know.","My biggest surprise but my most pleasant surprise is how brilliant the public is they get it.\" The public gets it. They really get it. But it's been tremendous fun. I was going to tell you before. So friend of mine said, \"How do you do that how do you speak. No teleprompters No there's no that. And you just speak.\" I say, \"It's amazing.","And by the way, no disrespect. But every place I go, you would love these people whether it's Alabama, whether it's Dallas, whether it's all of the Oklahoma. It's like all the same. They're incredible people you're incredible people.\" They want to say it's true. It's true. They want to see our country be great again.","They know it can be. They want to see it happen. They want to see victories. We don't win with anything. We don't win with ISIS. We don't win with Iraq. We don't win with Libya. We don't win with Yemen. Where do you see that? And they are going into Saudi Arabia folks, in case you had it. And by the way, we will defend Saudi Arabia and we will defend them for nothing.","Even though they make a billion dollars a day. Those days are going to stop. I ordered 4,000 television sets recently. They come from South Korea. South Korea makes a fortune as a country, a fortune. We defend that we have sent 28,000 soldiers on the line. And we have this maniac on the other side, we have our soldiers right between.","They pay us like, nothing. We defend Germany, a lot of people don't even know, we defend Germany. They're a behemoth economically, a behemoth. We defend them. We defend Japan. Free, -- they give us nothing. Relatively, they give us, like virtually nothing. We defend them. Then you say to yourself why? And here's the thing, interesting -- I love Japan.","It's great -- its work. But works up now. Help us out. Give us something. We can get rid of all these deficits. We can make -- we can make. True. And then you have the stupid people say, \"Oh, you can ask for that. They're a sovereign nation.\" Sure they are, they're going to help us out. But here's the deal we have with Japan, we will defend them with our lives, with our money, we will defend them to the death.","If they get attacked, we will fight. We have to fight. If we get attacked, they don't have to do anything. That's right. Just like Sergeant Bergdahl. We got a guy, it's true. No, it's true. We have a guy, six young people, great people, were killed looking for him. We get Bergdahl, they get five of the great killers that they've wanted for 10 years right.","These are the deals that we make. Because we have leadership that doesn't know, what the hell it's doing. Now, in the old days, with Bergdahl, who was a traitor, it was treason. You shoot him. You get shot. You've been reading . They think he won't even get jail time anymore. Well, you know he had some psychological difficulty.","They don't really know what happened, wasn't feeling so good. We are just heading in the wrong direction. So you look around at all the people that are here tonight and you remember because it's happening, things are happening. It's a movement. It's a movement. It's absolutely a movement. I get calls and I got -- I was gonna tell you, from a highly respected guy, who said, \"Mr. Trump can I ask you one question?\" Reporter, one of the biggest, \"How does it feel?\" I said, \"What feel?\" \"What you've done has never been done before in politics.","You're an outsider. You came in.\" They call it, the summer of Trump. Right. I hear that. I mean it's, you know. Right. They said it's never been done. And this is a top -- the top guy, he said never been done. How does it feel? I said, I'll be honest, \"To me it doesn't feel anything because unless we win.","I've wasted my time.\" And he said \"No you haven't. What you've done is incredible.\" By the way, that was a while ago. He still hasn't written the story. I think he's afraid to write the story. You want to know the truth. But -- but he said, \"What you've done is incredible.\" And I said, \"I understand what you're saying but, I'm telling you, unless I win\" Meaning, unless we win in the primaries and we can't have these politicians any longer.","We just can't do it. We can't do it. We can't do it. All talk, no action. No ability. They've got one ability, they've got an ability to get re-elected. That's their only ability. That's what they have to do. They have to get re-elected. So I said, \"If we\" and I told him, \"If I don't win. I consider it to be a massive failure.\" That means primaries, that means, win the election.","Because, otherwise, hey, we've all had a lot of fun but nothing's going to happen. I watched Hillary last night with we're going to give this, we're going to give that, we're going to give that. She's the poor woman. She's got to give everything away because this maniac, that was standing on her right, is giving everything away.","So she's following. That's what's happening. This socialist slash communist, okay. Nobody wants to say it. You know, in all fairness to her, she's standing here listening to this guy. He's going to tax you people at 90%, going to take everything. And nobody's heard the term communist. But you know, what I call him a socialist slash communist.","OK. Because that's what he is. So then you see her stand up, now it's her turn. And she goes, \"Oh I'm going to do that too.I'm going to do that too. I'm going to do that.\" Because you got to win. Because she's not doing so well. And in a head to head poll, they just did that. I beat her by five or six points.","I love it. I love it. But we have to be careful so here's the story, you look around, you're gonna remember this night. Because as a very important person told me, this is not just crowds guy, this is a movement. There's a movement going on . When you're leading by 20 and 25 points in all these states, when you're leading in South Carolina by 20. When you're leading in all of these places, Nevada.","And leading with the Hispanics. Leading with the Hispanics, because they know I create jobs. And they're here legally. And they don't want people taking their houses and running all over. But they want -- they want what they have. And they wanted to get better and they want jobs. So when we're leading by 20 points, 25. One of the polls had us 40% above everybody else.","That's a massive number. Those are massive numbers. And this person said, this is a movement. This is no longer we're playing games. This is a movement. You know, they all said, \"Oh he's never going to run he's got a wonderful life.\" Yeah, I do. I do. But they said, \"He's never going to run.\" that he'll never file form A. Form A is where you sign your life away.","I signed form A. Then they say, \"Oh, he'll never put in his financials because he's probably not as wealthy as people thought.\" Right. So I have almost a hundred pages of financials. Then they said, \"Oh, he'll put them in but he'll put them in way late.\" So I put him in ahead of schedule. I could have had many months after that.","By the way, some of these guys that I'm running against. They put him in late, it's a one-page. And they're late. They needed extensions. True story. But they say he'll never put in his financials. And I was so happy to put him in. Fact, if I didn't run I might have put him in because I'd like to tell -- I really -- I did a good job.","You know. I did a good job. So I put in my financials and all of these guys, the pundits, I call them the Talking Heads. You know, they get paid, they don't know what the hell they're doing. Many of them. So they're all devastated because they said he wasn't running and he'll never -- he'll never file, he'll never this, he'll never do that.","So I put in my financials and it turns out that my company is much bigger, better, stronger, better. Like much bigger than anyone ever thought. It's fantastic. Like we even come down here. We have the biggest winery on the East Coast. We have the great land on the Potomac River. They don't know that. You people know it because you're from Virginia but no matter where I go, I have property coming out of my years.","It's true. And I have very little debt, great cash flow. And I'm not saying that to brag, I'm saying that because that's the kind of thinking we need in the country. It's true. That's the kind of thinking. Thank you. If you think of some of the countries we talked about. If you think of let's say instead of losing, in terms of China, let's say instead of losing 350 to 400 billion a year in trade deficits let's say we broke even.","OK. Do you know what that means. Does anyone have any idea what that means? Let's say instead of losing with Japan. $75 billion a year. Let's say we broke even. Let's say they agreed to take more of our product so we can equalize. Not that it's a one-way street. That is easy. And we have the cards because we can say, \"We don't want you cards anymore I'm sorry we have all the cash.\" They wouldn't -- they wouldn't know what to do. So we're going to do a job.","I give you my word. I don't care about my company. It's peanuts compared to what we saw -- This is so much more, I have wonderful children Ivanka, Don, Eric. My kids are wonderful, my wife is wonderful. But my three older kids that I just mentioned they'll run it with my executives. It -- it doesn't mean anything to me anymore.","It doesn't mean. It's peanuts. I want to save this, I wanted to do such a great job. I want to make you people so proud of this country again. So proud. So proud. So look around at all the people here. Look around at the people next to you. Because this is a special night. We are going to make America great again.","Thank you. Thank you. We will make America great again."],"text":" What a place, I love Virginia, man. What a place. What a place. You know I have a lot of people that work really hard. I pay them a lot of money. Probably, too much money, but that's okay, right? And I have the vineyards in Charlottesville. You know about that. And in Loudoun County I have Trump National, which is a tremendous success, right along the Potomac River. Probably, no piece of land like it, it's phenomenal. And we've had tremendous success in Virginia. We have a lot of people that worked for me. We have a lot of people. Frankly, I work for them the way I look at it because the truth is they're so good. That I actually need them more than they need me. Does that make sense? So it's one of those things. And you know what I did? Where is Carrie? Where is Carrie? She -- Get up here Carrie, come on. She's so incredible. She runs the vineyards -- Trump Vineyards. You know what it is. A lot of people go in fact, one of the drivers was telling me, he goes there back and forth all the time bringing in people, but Carrie Willard runs it and she has done such an incredible job. We took it over. About four years ago, it was, to put it mildly and serious trouble. It's close to 2,000 acres and it's one of the most beautiful. The largest, actually the largest vineyards on the east coast of this country. The largest and It's become an incredible -- incredible tourist attraction. And Carrie has, literally from day one, I mean she's taken it and it's with love and with pride and I'm proud because you know one of the things, and I have to say this, that Ivanka said you have to say it, my wife said you have to say it. And I think you'll confirm it Carrie. But I have more women in high executive positions. In fact, it's true. Its true. In fact, the men in my company are all complaining. Is that OK? The hell with them right? But I have so many women -- Carrie just say a word. Tell them, do you like Trump? Yes. If you want someone who inspires greatness and demands excellence This is your man. Thank you. Thank you. She has done such an incredible job. Thank you Carrie. You know what I have a place and it's usually I have a lot of them but when I go to certain areas and if I have something that I'm very proud of I like to bring the employees we have some of our employees here today from the vineyards. But I like to bring the employees up because it's so important especially when you're looking at what's going on with a country where our jobs are being taken away. They're going to other places, as you know, like many other countries. I mean, you can name the country. We don't make good deals anymore. We just don't. And so when I'm around one of my places I love to bring my people up. I love it. You know we had some big news today because, I -- I just have to talk about it. We get such -- such a -- you know in the old days would cause misinformation. Do we agree? And we're going to talk about the debate. Anybody watch it last night? Yeah. And I tweeted. I tweeted. Can you believe? And I made a commitment I said, \"I tweet. So I couldn't turn it off. I had to tweet this thing.\" And somebody said on one of the networks the winner was Trump because we picked up a hundred and sixty thousand followers, you believe it? Hundreds of -- And second place was a lot less. I will tell you that, one of the folks on the stage, but you know so today CNN came out with a poll. And the poll was in the state of Nevada. They came out with another poll in South Carolina, which is incredible place, both incredible places. I said I have to read some of these because this is wild. So we're in first place everywhere. I mean -- you're right. That's true. Actually true. That was good. You could -- you really helped. He said, \"Everywhere.\" I said, \"Yeah, you're right it is everywhere.\" I mean it's Texas. Where in New Hampshire, where in Iowa, we're in first place everywhere. But the polls just came out. And as you, know a couple of weeks ago we had Florida and we're just killing in Florida. So you have a governor and you have a sitting senator. And it's not even close. We're at 28, 29. They're in the teens, low teens. And we want to keep it that way. We're actually, we're going up. I'm not even happy with what I hear, 29 now. I'm saying we should do better because here's what just happened. So in Nevada we're at 38. Think of it, 38. Second place is 22, I won't even bother telling you it doesn't make any difference because when you have 38, you're almost doubling it up. But here's the thing that I loved about the poll, again, done by CNN, South Carolina where 36 to 18, you believe that? Connecticut just came out, 34 to 14. But here's what I really like. Which candidate can best handle the economy? OK. Well that one's big, 67% to Trump. Can you believe? Now you gotta remember, you know, if we had two people running and you had 67% that would be a landslide right? That's a landslide. If you won with 67% the press, look at all those cameras going back, there's so many. So many. And look at all the red lights. Show the crowd everybody, show the crowd. Show the crowd. And you got a lot of people outside that the fire marshal would not let in. So it's one of those things. But I will tell you that when you have 67% in a two-person race, that's called landslide, that's called massive victory. I don't think there's ever been a victory. And here we have, on a thing called, the economy would you say that's important? I think so right? So 67% are in favor for Trump. OK. We won the state by a lot, meaning in the polls, by a lot. Now, a couple of these categories I have to read them; Illegal immigration, important. We're going to build the wall. OK. Believe me, we're going to build the wall. Hundred percent. And you know, so we're going to build it. It will be paid for. Who is going to pay for the wall? Who is going to pay for the wall? So the next category -- the next category. Which is so important. That's okay. ` That's all right. That's why we have freedom of speech folks. You know? And I'll tell you -- I'll tell you how dishonest the press is. We have thousands of people in this room 6- 7,000. I think 7,200 people. We have about 10 people over there. They'll get the headline, you won't. That's pretty disgusting. Pretty disgusting. But that's the way it goes. So illegal immigration. 55% want Trump, 13% to second place. That tells you something right there 13% -- 13%. On social issues, Trump is first, on foreign policy. Thank you very much. That's great. Thank you very much. But it is true. I see a couple of cameras for about four people and they're going wild, the cameras, you know. It's so disgusting, but that's all right. On foreign policy, Trump number One, 34%. On ISIS, who's going to handle ISIS? Trump, 46. We're not going to play games. We're not playing games. We're not playing games. on the change on how we do in Washington, on the change. How are we going to change Washington? Who's going to do the most effective job? Trump, 60%. 60 -- 60%. Here's an important one, best chance of winning in November, Trump number one, 47%. Amazing. So win number one at 42nd and then you get into 16 and 10. That's a big difference. So we've all come a long way together. We've all come and you know we have a lot of bad people out there they want to stop progress and you see it all the time. And I use the statement, the silent majority, the silent majority is back folks. The silent majority is back. The silent majority is back. So over the last period of time. We have had a very interesting thing happen. We've seen our country where we don't win anymore. And we're going to start winning so much, we're going to win left, we're going to right -- win right, we're going to win everything. We have unbelievable people in this country. And nothing is going to stop us from starting to win again. You look at what's happening with foreign countries. You look at how they're taking our jobs, how they're taking our base, how they're taking everything we have including our many. You look at what's going on with the foreign, no matter what country you're talking about, they beat the United States. It's not going to happen any more. It's not. Our trade deficit with China is almost $400 billion. $400 billion a year. A year. And then I see our president entertaining the heads of China and talking about our great trading partners. Yeah, they're a great trading partner for China not for us. Our deficit with Japan is $70 billion a year. The cars pour in, we don't know what we're doing. We sell them practically nothing, relatively speaking, while we sell them is beef. Beef. They sell us cars, you go out to Los Angeles, you see these ships. The biggest ships you've ever seen and the cars are pouring off. And they have no respect for us. And our trade deficit with Japan is almost 70 million. Think of this -- think of this, Japan $70 billion which is absolutely crazy. Now we go to Mexico, I love the people of Mexico. I love Mexico. They're great people. I have thousands and thousands of Hispanics working for me. Thousands. Thousands of Hispanics. And in fact, in Nevada, the same poll I win with the Hispanics, which everyone's surprise. I win with the Hispanic. So our trading deficit with Mexico is $45 billion a year. 45 billion. Now, I'm going to build a wall that's going to be really a wall. It's going to be something special. Nobody's coming in other than if you come in legally. But here's the thing. Everybody said, \"You can't build a wall.\" And I say, \"Mexico's going to pay for it.\" They say, \"You can't do that. You can't do that.\" How can they do that. So if the wall cost $6 billion to build and you know we're talking about a thousand miles. It's 2,000 but you need it on a thousand. The Great Wall of China, think of it, is 13,000 miles who was built 2,000 years ago. We have a wall that has to be built. We have problems coming in like nobody has ever seen before. It has to be built. Has to be built. Whatever anybody said, just remember this, almost everybody wanted this wall built 10 years ago, 12 years ago, 15 years ago. The Liberals, the Conservatives, everybody wanted it. One of the reasons it wasn't built is because they couldn't get an environmental impact statement approved. You believe this? All right. We're going to build the wall. Mexico's going to pay for it. Now the people, the stupid people, say Mexico will pay for it. We give Mexico billions of dollars. We have that trading deficit of almost $50 billion. We're talking about a five, to six, to seven if you go Rolls Royce you go. We're talking about from $5 -$7 billion. Who couldn't get that money? They're going to pay us so gladly, they're going to pay it so gladly. And I will say this, I speak with our politicians and I speak to them all the time. But I speak to them loud and clear and I know who I'm dealing with. And a lot of them are nice people but they say, \"Donald you'll never be able to get them to pay.\" And I realize they're not the right people to do the job because with the right messenger, they will pay so happily, so gladly. They're taking advantage of us at the border. They're taking advantage of us with trade. They're very good people but their leaders are smarter than our leaders our leaders don't have a clue. They don't have a clue. We have -- we have a situation, where a mother is pregnant she goes to the border, she walks across the border right in front of our border patrol, who are great people, but they're not allowed to do their job. She lies down, she has a baby, that they call anchor babies, she has a baby. Now we're responsible for that baby for 85 years. OK. I don't think so -- I don't think so. I don't think so. We can't do it. We owe $19 trillion. We owe a number that's almost inconceivable when you think about it. So we owe $19 trillion, we can't be in a position where we're doing, what we're doing anymore. We just can't. We have to rebuild our country. We have to rebuild our infrastructure. We have to repeal and replace Obamacare. Have to do it -- have to do it. Obamacare is going to cost us more money than anybody would have ever dreamt. And it's no good. It doesn't work. Your premiums are going up 55%, 45%, 60%. Your deductibles are through the roof. You can be dead and never get any of the money. Your deductibles are so high. So we're going to repeal Obamacare. We're going to replace it with something that's going to be terrific and It's going to be terrific. It's going to cost our country very little. And people are going to be able to have their doctor have their plan pay less money. If they're sick they're not going to have to worry about a deductible being so high that nothing works unless you get hit by a tractor. So we're going to do that. We're going to do so many different things. We're going to make our country great again. We're going to make it so great. Immigrants. They're suggesting, listen to this, they're suggesting Social Security for illegal immigrants. So we're going to straighten things out. We're going to do it the right way. We're going to bring immigration under control. We're not going to have a situation like Kate, beautiful Kate, in San Francisco. This guy comes in five different times. It could have been much more than that. After the fifth time, she gets shot in the back. We're not going to have it anymore we're going to have a situation that's going to be rational reasonable. We're going to keep in the country when somebody goes through a -- a long process with college. They go to Harvard, they go to Yale, they go to a great college University of Virginia, great college right. Great, that is right next to our property. We love them. That's a great college. But they go to University of Virginia. They do fantastic. They do and they do just great. And they're so proud and they're from another country. But they want to stay here and we tell them, \"Get out.\" You stayed here. You have to go home. And then the case in India, where a man opened a company, wanted to stay here he ends up opening the country in India. He now has five thousand employees it's one of the hottest companies in the world. And he would've been here. You would have been here. And that's what we want. We want to keep people here we want people to come in legally and I say -- I say, and so importantly and I'm saying it all the time, we want to have a big door. We want to have a big beautiful door right in the middle of that wall. And we want those people to come in. They've got to do it through a legal process. If we don't have a border -- if we don't have a border and we have people all over this country we have no idea where they're coming from. We don't have a country. We no longer have a country. It's very simple. And we're going to do it with heart and we're going to get along with people and everything's going to be great. But we're going to have a country again, we're going to take back our country and we're going to start doing things properly. When when we have countries, like the ones I named, and many others and we have people that take advantage of our leaders because they're not smart, they're incompetent, they're stupid or they don't care, that's going to end. I have the greatest minds on Wall Street, I have already lined up. They're calling me, these are the greatest negotiators in the world. They're calling me. Carl Icahn, Great. I have all of them. I have the best in the world. They don't want money. They don't want salaries. They're rich, they made it because they're great negotiators. They want to come and they want to see our country be great again. They're proud of our country. Some are nice people, some aren't, I don't care. I want the greatest and I know the best, I know the smartest, the sharpest. I know people that are overrated, I know people that are better than all of them. And we're going to bring them in and we're going to bring them in and they're going to be in charge of; one, China. Let let me tell you about China, first of all I love China, the people are great. They buy my apartments for $50 million all the time how could I dislike them right? I tell it to everybody. I have the largest bank in the world and one of my buildings it's from China. I mean, there's a bank that makes Citibank look like this big. I love China but they've taken advantage. I -- I wish you were turned around. I wish our representatives took advantage of them. I think that will be great -- I think that would be great. But it's a one-way street. It's a one-way street to poverty, for us, poverty. We can't do it. We're in a bubble right now, believe me, we are in a bubble. We have a phony statistic on jobs. We have a hundred million people in the workforce, they want to work. We have a hundred million people. We have tremendous levels of poverty. We have welfare all over the place. And these are people, in many cases, they want to go out and get a great job and be proud and take home a lot of money. But we can't because we're losing all our jobs. We're losing them to other nations. We're losing them to stupid policies. This trade pact, Trans-Pacific Partnership, it's -- it's, believe me -- believe me, I -- if it was good I'd say, \"I don't care if Obama proposed it.\" If it were good, I wish Obama were a great president, I don't care. Then I wouldn't have to run I love what I was doing. It's true. I love it. I love it. So true. I'd love if he were a great president where I say, \"Wow. he's a great president. I'd vote, I'd be his greatest fan.\" I don't care because what I want is what's good for the country. I don't want to be doing this. I'm actually having fun because I'm so energized I go to these crowds. You know we went to Dallas, we had 20,000 people where the Mavericks play, 20,000 people. We go to Oklahoma, two weeks ago, we 20,000 people in a park. We go no matter where we go. We went to Mobile Alabama, we had 35,000 people. No matter where we go, we go up to New Hampshire, we have the biggest crowds. Iowa, the biggest crowd, South Carolina. We had something two weeks ago. It was unbelievable. It was unbelievable. A friend of mine actually said, \"How do you do that? How do you make speeches in front of so many people and you don't have teleprompters done. And I notice you don't.\" I don't want a teleprompter, I don't want, right? I don't -- I don't, it would be so much easier. It would be. Think of it. You have your teleprompter, \"Hello ladies and gentlemen. It's wonderful to be in Virginia where you have. All sorts of great people.\" And you do. By the way when you talk you really have the Hall of Fame. You know, it's true that you have the Hall of Fame. You know I told my guys I said, \"Look I'm here I employ a lot of people I have a lot of property it's great.\" but just a couple of things, I mean, you have this is a real hall of fame. Patrick Henry give me liberty or give me death. How good, right? How good is that. I want to come up with a slogan as good as that. How about make America great again? I don't know, you know. It's great. It's great. But I still like give me liberty or give me death. That's great. See I want to get the word again off that eventually. You know, I want to get the word he just said you will, I will. It's not even going to be that hard. It's not all it -- it takes common sense. It takes business ability and way to treat people well. You know, I say I'm a conservative with heart because we're going to have that great health care program. But we're going to take care of everyone, we're going to take care of people. And people are going to pay much less and get it so good. We're going to take care of so many things. But I like to say, conservative with heart because a lot of people think, if you're a Republican, you don't have heart. You're mean, you're horrible people. Doesn't work that way. I've got over my plans and somebody said, \"Oh well, that's not conservative.\" You know it's sort of interesting. You have a company -- group called Club for Growth. I talk about it, Club for -- I never even heard of it. This guy comes up to my office, right, and he sits down. Nice guy, I think he's an ex-congressman so he knows how to talk. That's all they do is talk. They're all talk no action, except for the politicians currently in this room of which we have plenty, they're great. In fact, Dave Brat, where's Dave Brat? He's great. I was just with his family and his children and his wife. And I tell you, he's done a great job. There's a guy he shows you you can do things. I mean who would've thought that -- that's never happened before what he did. So I give him -- I just give him a lot of -- just a lot of credit. But I have to go. OK, so Patrick Henry we talk great. Right. Then you have Thomas Jefferson that's pretty good right? Thomas Jefferson. Then you have James Madison, principal author of the Constitution, that's pretty good. And then you have George Washington, that's pretty good right? George Washington, you know. It's pretty amazing, you know, when you think of Virginia just pretty amazing. So I tell the stories and I love these stories because it shows how important it is. I'm self funding my campaign. OK. I'm the only one and I see all of the guys that are competing with me and some of them are nice although some of them that hit me really hard. I mean, you know, they're asking me for contributions and then as soon as I run, it's like a couple of them, like Perry, he went what? He was a nice guy. Governor Perry didn't work out too well for him but he really hit me. And then Lindsey Graham, I thought he was a nice guy but he hit me, he went made speeches about Trump because they want to get their numbers up not working. And every case has gone down. They've all gone down. Man, can you imagine if I'm president everybody that plays tough with us they're all going down right? That's nice right? But I look at what's going on and I see so much and I see the way the politicians are controlled. Don't forget. I was -- I was the perfect person. I was like central casting because before I ran, I was on the A-list. I contributed a tremendous amount. I got along well with Democrats, with, Liberals, with Conservatives, with -- That was my job. Somebody said, \"But you gave money to a Democrat.\" Of course, I did. I get along with everybody. One of the magazines said, \"He's a world class businessman.\" You can't have fights , you've got to get along. I was told by Hillary in a speech recently. I was told same day by Jeb that we don't like his tone, his tone, his tone. I built this incredible company. And I built it and you'll see because a book comes out on November 3rd, which is your election day by the way, so go out and vote. Make sure the right people get it, so important. It actually comes out, it comes out on election it's got to be great. Actually, tough name crippled America, it's a tough name but it tells you how we're going to fix it and how we're going to go about it. But I'm self funding, it's so important. I was in Iowa a few weeks ago and I said to the people I feel so foolish these people want to give me millions and millions of dollars. And you know, it's sort of like anti-me, it's like, why wouldn't I take it? I always take money when -- that's what I do, I take money. That's how you become rich right, these guys know, millions of dollars. So I said to the group in Iowa I we have 5,000 people in an auditorium like this. I said Look here's the story. I feel a little bit stupid when I don't take all this money. I said supposing I take it just supposing and I promise I won't do anything for them. And they all sit up and they said no no. I couldn't believe it. I thought I talked him into it. But the truth is I love what I'm doing. I love that I'm self funding because I'm not controlled by anybody. I'm not controlled, controlled by you. I'm really, I mean, I'm controlled by you. I'm going to do the right thing. And you've heard me talking about the Ford plan, have you heard that story? The Ford plant, because I love it, but Ford, you want it again, should I do it again? I just think it's good. So Ford closes a lot of plants. They're building a two and a half billion dollar plant in Mexico. It's all right. Except what do we get out of it? And they're going to make cars and trucks and parts and they're going to send them into the United States and other places. How does that help us? We all go to good, I went to Wharton, you all went to good schools, and if you didn't go to good schools if you never graduated from high school you know, it's not good for us. And a two and a half billion dollar plant in Mexico, that's a big plant. So they're going to suck our jobs away. They're going to make cars, trucks and parts in Mexico. And I said to myself, \"What would happen if a Rubio or a Bush or -- or a Hillary were President?\" So here's what happens, they would know it's no good. They would all know it's no good. And they say no, no, no we can't let that happen. And the following hour, they'd be called by a lobbyist who gave them five million. They'd be called by the special interests that gave them 10 million. They'd be called by one of their donors who own stock in Ford or whatever who gave them a million. And let's say, \"Mr. President you can't do that.They were very helpful in your campaign to become president. You can't do that.\" And you know what's going to happen? He'll say or she'll say, \"I have to do it.\" and they'll say, \"No, no you can't do it.\" and he'll say, \"OK I won't.\" And the plant is going to be built. Now let's do the other alternative, Trump is president, they haven't given me anything. OK, let's assume. Let's assume. So I called the head of Ford I say, I wouldn't even use my guys for this. This is too easy. This is too -- honestly, it's too easy. So I call the head of Ford I say, \"You're building a plant. You can employ thousands of people but you're not employing people in the United States. You're employing other people. And I think that's fine. But tell me how we benefit? He'll be unable to explain it. Believe me, he cannot explain, Not to me, he can't. Believe me. I'll say, \"Listen, I want you to build a plant in Michigan or I want you to build a plan here or I want you -- I don't care. I want it in the United States. I don't want to lose, I'm tired of the jobs with NAFTA and all of these crazy deals we make. I'm tired of these jobs the new one that we're just trying to approve. I'm tired of these jobs like a vacuum cleaner. They suck the jobs out of the country. They suck our money out of the country. We have nothing -- we have nothing. We're like a third world country. Our airports, our roads, our bridges are falling down. 61% of our bridges are in trouble, do you believe this? We drive over a bridge, it's in trouble. So I would say to him the following, I won't use his name because he happens to be a very good guy, but I would say, \"Let me just tell you something. I want you to build it. In the United States. I don't want you leaving. And if you do leave and if you insist on leaving, you're not bringing those cars over free. You're not, you're not. Remember the trade deficit. Remember here we're talking $45-$50 billion a year. You're not bringing those guys over free. We're going to charge you a 35% tax on every car, truck and part that you bring over. Now, I believe in free trade. I'm a free trader. But I also want smart trade and I want fair trade. It's got to be fair trade free is good, all over I want, but it's got to be fair so we can compete. So what happens is the following; He will call up and say, \"No, no, no we won't do that Mr. President.\" I will then be hit by every person I know in Washington, all of whom have given me nothing. Fact, I've given most of them, you know, the lobbyists said they work -- I know all these people. But now they'll call and I'll say, \"No, no, no we've got to do the right thing.\" Then I'll be called by everybody else but I haven't taken their money. I owe them nothing. I only owe you people. I owe you in particular with that wonderful location, right? And I'll say -- and I'll say the following. I'm saying, \"No, we want you to build that plant in the United States. It's going to be built in the United States. They'll say, \"No.\" I guarantee you within 24 hours, probably by five o'clock that afternoon, assuming it's made at 12. You know, they like to call around lunch time so they can have a drink and convince the politicians what to do. Assuming the call is made it up probably by five o'clock they will say, \"Yes, Mr. President we've agreed we're going to build in the United States.\" The only thing that could change is they're pretty tough negotiators so it may take an extra day. They may wait till five o'clock the following. That's the only thing. They can't do anything. We have the cards. See what people don't realize. Obama thinks that they have the cards. We have the cards. China has created one of the greatest thefts in the history of the world. It's true. They have sunk our economy dry. And if you want to do business in China and I have many friends that are manufacturers. And I love these guys and they're great manufacturers. And they call me all the time, they can not get their product into China. They can't do it. And when they do there's a big tax and we're like the dummies, \"I'll bring it in. Just flooded in. Come on in.\" And then they do their currency manipulation which is one of the reasons that the trade pact doesn't work. Hillary Clinton was listening to my speech. She was in favor of it 44 times. And then yesterday, two days ago, she came out against the trade pact. You know why? Because if she has to debate me she knows she's going to get killed on that pack. Killed. And I have to hand it to Hillary Clinton. I have to -- hey, you know I'll be angry. I have to hand it to her. It took great courage for her to go against President Obama on the trade pact. You know why? Because maybe she gets indicted. Because -- because she is being totally protected by the Democrats because what she did is illegal. And you look at General Petraeus, he did 5%, a friend of mine, very familiar with the whole subject with e-mails. General Petraeus did 5% of what she did and they've destroyed his life. Other people have done far less and the life is destroyed. So the Democrats are just protecting her. There's no reason for this. Now I'd wanted to go a fair investigation. Let everything be fair. But what's happened is absolutely crazy. So let's see if she she might have done OK last night. She did. She did. OK. Because nobody attacked her. Nobody attacked her. There was no attack. You know in my debate, I hate to say because we're live on CNN they're going to want it, but in my debate they said, \"Mr. Trump what do you think of this. That the man next to you said.\" and then they go to him and they said, \"Donald Trump called you a horrible human being. How do you respond?\" That was like it was like a reality television job. Whereas last night, they'd ask a question, they get an answer, that ask a question. With me everything was an attack. It's crazy. And yet every poll that I won that debate so I'm very happy with that. But, every poll -- every poll. Drugs, time magazine, Slate. Every poll. But it was a whole -- it was a whole different story. So we have to do something about that. Let me give you one other quick story. Nabisco, Oreos, right? Nabisco, right? Oreos. They're closing their big plant in Chicago. They're moving it to Mexico. I'll never eat another Oreo again, ever. Ever. So I'm going to talk to them, I mean, I don't want their cookies made and sold -- I just don't want it. It's unfair to us. Chicago is losing this large plant. It's going to another country. We have a thing called corporate inversion. That's where companies have trillions and trillions of dollars outside of the United States, OK. Trillions. They think minimum two and a half trillion, I think it's much more than that. It's covered in my tax plan, Corporate inversion. We have people and we have companies. You know in the old days that moved from New York to Florida, from New Jersey to Texas, whatever. Now they move from the United States to foreign countries. They take all those jobs and -- Charles O. Finley, the great Charles O Finley right? The Oakland A's. He had the lowest payroll in baseball. The lowest payroll and he won the World Series three times. He had Reggie Jackson sold him to the Yankees. He had Catfish Hunter sold him to the Yankees. George Steinbrenner, who was one of my best friends and a great, guy, he said, \"This guy's brutal. Donald he doesn't spend any money and he's killing us.\" And George will always buy his players but he bought them at the top, you know. But George said just fine, George is great. George was great. But here's a guy, the lowest payroll, they'll think of it by far -- by far in baseball. And yet he had the best team and he won three World Series. I think in a row right, Charles O. Finley. There's something beautiful about that, to me. To me, there's something beautiful about that. So we'll spend whatever we have to spend. I mean, one of the things that happened that's so incredible, I did meet the press. Nice, Chuck Todd. He had his highest ratings in four and a half years. He called up our office he said, \"Thank you.\" Can you believe it? I saved his job. Its true. And I did the same -- I did this week with George Stephanopoulos. They got tremendous ratings the other shows were dying -- they were dying. This is two weeks ago. But they asked me a question just to show you. It's so terrible. They said, \"Mr. Trump.\" now you've got to say, \"Leading all the polls, getting the biggest crowds, everybody's gone crazy.\" they said, \"Mr. Trump. Is there any way that you'd get out of the race.\" And I said to myself, now think of it, who would be asked that question? One of the commentators said, \"Who would be -- .\" if you're in first place. Would anybody else but me be asked that question? Is that terrible? So they said, \"Is there any way that you get out of the race.\" I said this strange question but I thought I'd give a very honest answer. And I said very, very honestly, \"Look, we're number one but if we weren't and if everything went down, the polls, the crowds, if you don't call anymore because you don't want interviews because it's over like some of the guys we're running against.\" I mean honestly -- I mean honestly, if I was some of those guys. What's the purpose. I don't know, do they gain something by having zero. Do they gain something and going into a debate? They call it the children's debate. Guys like Pataki, he's got zero. Guys like Rand -- I hate to say it. he attacked me. He was much higher when he attacked right? But he went down, I mean, so many. I don't want to use them, I don't know. I refuse to embarrass anybody, OK. But so I said to him, so if for some reason everything just tanked and I went down, I'd certainly consider it. Next day, headlines, Trump considerate leaving -- it's so dishonest. And actually it took a couple of unbelievable polls to stop it. It took a couple of unbelievable polls, which I get all the time. I said, \"Wait a minute I didn't say that.\" but they put out stuff and it's so false and so disgusting. And remember this, much of the press today that I've met have been terrific people, an honorable people. I've met some amazing people, like 30% OK, then you have 30% who are OK and, you know, they do their job. But you have I'd say 10 to 15 to 20% who are truly bad people they're dishonest, they're horrible human beings. They know it's not a question of being lazy or if they actually go out of their way to write false stories. And somebody asked me today, I did an interview today, and they said, \"What's been your biggest surprise.\" I said, \"I don't know. My biggest surprise but my most pleasant surprise is how brilliant the public is they get it.\" The public gets it. They really get it. But it's been tremendous fun. I was going to tell you before. So friend of mine said, \"How do you do that how do you speak. No teleprompters No there's no that. And you just speak.\" I say, \"It's amazing. And by the way, no disrespect. But every place I go, you would love these people whether it's Alabama, whether it's Dallas, whether it's all of the Oklahoma. It's like all the same. They're incredible people you're incredible people.\" They want to say it's true. It's true. They want to see our country be great again. They know it can be. They want to see it happen. They want to see victories. We don't win with anything. We don't win with ISIS. We don't win with Iraq. We don't win with Libya. We don't win with Yemen. Where do you see that? And they are going into Saudi Arabia folks, in case you had it. And by the way, we will defend Saudi Arabia and we will defend them for nothing. Even though they make a billion dollars a day. Those days are going to stop. I ordered 4,000 television sets recently. They come from South Korea. South Korea makes a fortune as a country, a fortune. We defend that we have sent 28,000 soldiers on the line. And we have this maniac on the other side, we have our soldiers right between. They pay us like, nothing. We defend Germany, a lot of people don't even know, we defend Germany. They're a behemoth economically, a behemoth. We defend them. We defend Japan. Free, -- they give us nothing. Relatively, they give us, like virtually nothing. We defend them. Then you say to yourself why? And here's the thing, interesting -- I love Japan. It's great -- its work. But works up now. Help us out. Give us something. We can get rid of all these deficits. We can make -- we can make. True. And then you have the stupid people say, \"Oh, you can ask for that. They're a sovereign nation.\" Sure they are, they're going to help us out. But here's the deal we have with Japan, we will defend them with our lives, with our money, we will defend them to the death. If they get attacked, we will fight. We have to fight. If we get attacked, they don't have to do anything. That's right. Just like Sergeant Bergdahl. We got a guy, it's true. No, it's true. We have a guy, six young people, great people, were killed looking for him. We get Bergdahl, they get five of the great killers that they've wanted for 10 years right. These are the deals that we make. Because we have leadership that doesn't know, what the hell it's doing. Now, in the old days, with Bergdahl, who was a traitor, it was treason. You shoot him. You get shot. You've been reading . They think he won't even get jail time anymore. Well, you know he had some psychological difficulty. They don't really know what happened, wasn't feeling so good. We are just heading in the wrong direction. So you look around at all the people that are here tonight and you remember because it's happening, things are happening. It's a movement. It's a movement. It's absolutely a movement. I get calls and I got -- I was gonna tell you, from a highly respected guy, who said, \"Mr. Trump can I ask you one question?\" Reporter, one of the biggest, \"How does it feel?\" I said, \"What feel?\" \"What you've done has never been done before in politics. You're an outsider. You came in.\" They call it, the summer of Trump. Right. I hear that. I mean it's, you know. Right. They said it's never been done. And this is a top -- the top guy, he said never been done. How does it feel? I said, I'll be honest, \"To me it doesn't feel anything because unless we win. I've wasted my time.\" And he said \"No you haven't. What you've done is incredible.\" By the way, that was a while ago. He still hasn't written the story. I think he's afraid to write the story. You want to know the truth. But -- but he said, \"What you've done is incredible.\" And I said, \"I understand what you're saying but, I'm telling you, unless I win\" Meaning, unless we win in the primaries and we can't have these politicians any longer. We just can't do it. We can't do it. We can't do it. All talk, no action. No ability. They've got one ability, they've got an ability to get re-elected. That's their only ability. That's what they have to do. They have to get re-elected. So I said, \"If we\" and I told him, \"If I don't win. I consider it to be a massive failure.\" That means primaries, that means, win the election. Because, otherwise, hey, we've all had a lot of fun but nothing's going to happen. I watched Hillary last night with we're going to give this, we're going to give that, we're going to give that. She's the poor woman. She's got to give everything away because this maniac, that was standing on her right, is giving everything away. So she's following. That's what's happening. This socialist slash communist, okay. Nobody wants to say it. You know, in all fairness to her, she's standing here listening to this guy. He's going to tax you people at 90%, going to take everything. And nobody's heard the term communist. But you know, what I call him a socialist slash communist. OK. Because that's what he is. So then you see her stand up, now it's her turn. And she goes, \"Oh I'm going to do that too.I'm going to do that too. I'm going to do that.\" Because you got to win. Because she's not doing so well. And in a head to head poll, they just did that. I beat her by five or six points. I love it. I love it. But we have to be careful so here's the story, you look around, you're gonna remember this night. Because as a very important person told me, this is not just crowds guy, this is a movement. There's a movement going on . When you're leading by 20 and 25 points in all these states, when you're leading in South Carolina by 20. When you're leading in all of these places, Nevada. And leading with the Hispanics. Leading with the Hispanics, because they know I create jobs. And they're here legally. And they don't want people taking their houses and running all over. But they want -- they want what they have. And they wanted to get better and they want jobs. So when we're leading by 20 points, 25. One of the polls had us 40% above everybody else. That's a massive number. Those are massive numbers. And this person said, this is a movement. This is no longer we're playing games. This is a movement. You know, they all said, \"Oh he's never going to run he's got a wonderful life.\" Yeah, I do. I do. But they said, \"He's never going to run.\" that he'll never file form A. Form A is where you sign your life away. I signed form A. Then they say, \"Oh, he'll never put in his financials because he's probably not as wealthy as people thought.\" Right. So I have almost a hundred pages of financials. Then they said, \"Oh, he'll put them in but he'll put them in way late.\" So I put him in ahead of schedule. I could have had many months after that. By the way, some of these guys that I'm running against. They put him in late, it's a one-page. And they're late. They needed extensions. True story. But they say he'll never put in his financials. And I was so happy to put him in. Fact, if I didn't run I might have put him in because I'd like to tell -- I really -- I did a good job. You know. I did a good job. So I put in my financials and all of these guys, the pundits, I call them the Talking Heads. You know, they get paid, they don't know what the hell they're doing. Many of them. So they're all devastated because they said he wasn't running and he'll never -- he'll never file, he'll never this, he'll never do that. So I put in my financials and it turns out that my company is much bigger, better, stronger, better. Like much bigger than anyone ever thought. It's fantastic. Like we even come down here. We have the biggest winery on the East Coast. We have the great land on the Potomac River. They don't know that. You people know it because you're from Virginia but no matter where I go, I have property coming out of my years. It's true. And I have very little debt, great cash flow. And I'm not saying that to brag, I'm saying that because that's the kind of thinking we need in the country. It's true. That's the kind of thinking. Thank you. If you think of some of the countries we talked about. If you think of let's say instead of losing, in terms of China, let's say instead of losing 350 to 400 billion a year in trade deficits let's say we broke even. OK. Do you know what that means. Does anyone have any idea what that means? Let's say instead of losing with Japan. $75 billion a year. Let's say we broke even. Let's say they agreed to take more of our product so we can equalize. Not that it's a one-way street. That is easy. And we have the cards because we can say, \"We don't want you cards anymore I'm sorry we have all the cash.\" They wouldn't -- they wouldn't know what to do. So we're going to do a job. I give you my word. I don't care about my company. It's peanuts compared to what we saw -- This is so much more, I have wonderful children Ivanka, Don, Eric. My kids are wonderful, my wife is wonderful. But my three older kids that I just mentioned they'll run it with my executives. It -- it doesn't mean anything to me anymore. It doesn't mean. It's peanuts. I want to save this, I wanted to do such a great job. I want to make you people so proud of this country again. So proud. So proud. So look around at all the people here. Look around at the people next to you. Because this is a special night. We are going to make America great again. Thank you. Thank you. We will make America great again."}