{"id":500,"author":"Donald Trump","title":"Speech: Donald Trump Delivers Remarks at a No Labels Event in Manchester, NH","date":"2015-10-12","link":"https://factba.se/transcript/donald-trump-speech-manchester-nh-october-12-2015","paragraphs":["Hi, thank you very much everybody. That's so nice. Wow. No Labels, it's right. I'm a believer. You know, John and Joe called and they said, \"Would you do it?\" This is about two months ago. And I said, \"Well, I think I will be able to explain what No Labels represented.\" We all know that that's where we have to go in this country because we're getting nothing done, whatsoever.","So I said, \"I think so, I have to get out. I'm pretty sure I'm going to be able to do it.\" So they then -- the next day, they announce I will be there without question, right? They're tough negotiators. So I had another problem. We had another speech someplace who's actually quite a bit of a problem, and I told him, \"I wouldn't do it.\" See, they were solvers.","They were problem solvers. And they went nuts. They were not happy. Is that right, Joe and John? They were not happy people. And ultimately, I said, \"You know what, I may have gone a little over that 50% level.\" And so here I am, right? Here I am. And I love New Hampshire. And as Joe said, you know, the latest poll came out, 32 -- 32 to 14 or 13 or so. I think it's 13. And I have the 32, which is even better.","Somebody said, \"Why do you talk about the polls?\" I said, \"Because I'm winning.\" They go, \"But nobody else ever talks about the polls.\" That's because they do lousy in the polls. Nobody else talks about the polls. They don't do well in the poll. Believe me, if they were doing well, they'd be talking about the polls.","But we had 32 to 13. And that's a big gap. And that's in New Hampshire. And -- and we've been here a lot. I know so many people, I have so many friends in New Hampshire. They're amazing people, amazing. So thank you all. I really appreciate it. So when we talk about No Labels and we talk about getting along, and I'm not going to say it too much because Tip O'Neill and Ronald Reagan, you probably hear it every -- every speaker, but I look at that as the ultimate where two people, different views, different everything, and they liked each other and they get along and they got things done.","And they had a leader in Ronald Reagan. Because ultimately, it is about the President. It is. Much more so about the President than you can imagine. And if the President is a leader -- if he's a real leader or she is a real leader, you'll get things done. But you need the leadership to come from the very pinnacle, from the very top.","And if it doesn't, it's not going to happen. And that's not happening now. It's not happening now. People aren't getting together, and I see it. You know, I've been actually doing this for a long time. A lot of people say, , I was very establishment. I was the ultimate. I gave more money than anybody.","I might -- we give so much money. I was all establishment when I gave contributions, right? When I decided to run, I was anti-establishment. Can you believe this? But we can't take a chance at a loss. I mean, I watched previously two -- in particular, two, and last time I was seriously thinking about doing it, I decided not to because I thought it was a race that could have been won, should have been won, and I don't want that to happen again.","I don't want it to happen again because I think it's really -- if you look at what happened four years ago, boy, timing was right, everything was right, and it should have been done. Well, it's going to be done this time, and hopefully, it's going to be done by me and I think we're going to have a result that's going to be great.","We're going to turn the country around, we're going to make America great again, and that's what's going to happen. That's what's going to happen. I looked at a couple of things that I thought would be appropriate, and I'm thinking back of my career. And on my career, when I was young -- a young man in New York, we had a problem called the skating rink.","It took eight years. Everyone knows, the Wollman Skating Rink. They now study it in all the business schools. They're all nodding their heads. We all studied it. I didn't study it, but I did it. But it's in all the business schools about what private enterprise can do. And we had a rink stay -- I mean, wasn't such a little deal.","It was a 80,000 foot rink. It's a very big rink. And the government under Mayor Ed Koch couldn't -- they couldn't get it built. They were trying. It was actually a renovation, wasn't even building. And after eight years -- and I have a daughter growing up, she kept saying, \"Dad, I want to go ice skating.\" And for year after year, I'd say to Ivanka -- anybody ever hear of Ivanka, right?","She's great. But she said, \"Can I go ice skating, dad?\" And for years -- for seven years, I said, \"I can't.\" There's no ice. And I'd go over to the rink and I'd see the men and that workers and they'd be sitting down. They had lunch breaks. It would take like four -- five hours. They'd be hundreds of guys sitting down on the rink.","I said, \"Boy, that's terrible.\" And I pass it. And after the seventh year, I went to Koch, and I said, \"Ed, I got it. I could do this thing fast.\" This is ridiculous.They're not working. They're using the wrong everything. And I met with the unions. I met with people that do refrigeration. They were doing refrigeration.","The engineer was based in Miami, Florida. I said -- it's true. And they were using Freon. And Freon, that means if you have a little tiny hole in 30 miles of pipe -- little tiny hole, it's not going to work. Guess, it'll go out. And I said, \"It doesn't sound good, but why do we want a guy -- \" So I called up the Montreal Canadiens ice hockey team.","I said, \"Can I ask you a question? Who does your rinks?\" \"We have somebody excellent. He's based right here in Montreal.\" I said, \"Now we're talking.\" And he came in. Great guy. Came in. He looked at what was happening. He immediately said, \"You can't use Freon, it won't work. It'll freeze, it'll this -- it won't work.","You have to use brine.\" You know what brine is? It's water with salt in it. How simple could that get? So on top of everything else, it was much less expensive. Anyway, I got to town. Ed Koch said, \"Will you do it?\" Because it was a very huge embarrassment for the New York people. They all know what I'm talking about.","And we had cement mixers because it was a massive pour. They were pouring little sections like 10 feet by 10 feet. You can imagine this massive rink, like take the biggest office floor you know and double and triple it and then pour a little section and then another little section and then the vandals would come in at night and steal all the copper.","Because the Freon you have to use the copper. So I said, \"This is not good.\" So -- and you want one contiguous pour. So I had trucks based from -- literally from the rink, all the way back to Harlem -- all the way up -- way up to a 125th Street, cement mixers, and we poured it all in one day. It was 24 hours, they were pouring during the day, during the night.","It was 26 hours and 25 minutes. And we poured one contiguous pour. It healed beautifully. When the city did it, it was like this. So they had on one side a foot and a half of water, and on the other side, they didn't have any water. So they couldn't make ice for a lot of reasons. So -- and actually, you know, when I talk about the price, the biggest problem I had was demolition.","That was the biggest cost. I had to demolish everything that was done. So I got it done. I got everybody together and we got it done. And to this day, it's the most successful ice skating rink. I still run it. I run it. Nobody -- every time it comes up, the city want -- they want me to -- they don't want to take any chances.","But I've run it for many years and it's the number one in the world and it does great. And it's sort of -- I was just thinking about it coming up because we're talking about No Labels. I was talking to John. I was talking to Joe, and we're talking about getting together. I got together with everybody, the city, the council.","Everything had to be done fast. The beauty is I did it in four months. This is after eight years. I did it in four months. I did it for $1.8 million. The city had spent over 20 million. And I always say, most of it was demolition. OK? That's what happens. And you can do that with this country. You can do it with the country.","And believe me, you can do things that people have no idea. Construction-wise, our roads are falling apart, our bridges, our tunnels, our airports. I just left LaGuardia Airport. It's like a third world airport. No, it's third world. I mean, it's t -- it's horrible. You look at it. You go out to the runways, it's horrible.","And I go to places because I travel all over the world. I have so many different relationships and partnerships and very complicated stuff. And I meet the -- the richest people, the richest companies in the world, and I'm partners with many of them in different parts. And you go to Qatar and you go to all of the different places and -- by the way, all over China -- all over China.","You go to Bahrain, you go to Saudi Arabia, you see airports you've never seen anything like it. You've never seen anything like it. They built temporary airports while they're building the big one that are 100 times nicer than anything we have in this country. We -- we're just -- it's -- it's -- we've lost it. We've lost it. Another deal that just happened, and this was, again, getting everybody together.","The city of New York in the Bronx, right outside of Manhattan, and most of you have read about it. They had a 350 acre piece of land on the water on the East River. The East River is great. People have apartments in the East River, right? He knows what I'm going to say. And it was 350 and expandable into 550 acres.","This is like five minutes outside of Manhattan. I'd say right off the Manhattan ramp. And they've been building a golf course I think for 30 years. I think. Somebody said it's really not 30. It's 21 years. OK, it's 21. So whether it's 20, 21 or 30 -- but I think it's 30, it's been under construction for many, many years.","We believe the cost is over $300 million. In fact, the mayor said to me, \"What do you think it should have cost? I said, \"About seven\". But I believe the cost is over 300 million, and they couldn't get it done. And Mayor Bloomberg said, \"You've got to help us. Please, you've got to help us.\" So they went to an RFP, I got they're RFP, so I have a long term deal.","And I took it over. I got it done in less than a year, for peanuts. It's beautiful. It's getting all rave reviews. I had to get the city together. I had to get all the unions together. I had to get everybody together, and we got it done and they worked so hard. And now, it's open and setting every record because of its location, it's phenomenal.","I mean, to be right next to Manhattan and on the river, it's unbelievable. So you can do these things, but it's about leadership. You have to get people together. And frankly, if I had somebody that worked for me who was good, it wouldn't be good enough, it had to come from me because I needed the mayor's help, I needed the city council's help, I needed a lot -- it's -- and the case we're talking about is -- comes from the President, has to come from the President.","And I'll give you something that to me is so big, corporate inversion. You know, I -- I look at your different things that you have, things that you want to do. Create 25 million jobs. This is the organization that you want to do. Balance the Federal budget by 2030 -- 2030. That's an easy one. 2000 -- actually, you know, I looked at -- because they gave me this note.","I said -- I said, \"I think there's a typo.\" 2030. Secure Social Security, they have to do it. People have a contract. We all have a contract. I don't need mine by the way. And by the way, I think if somebody doesn't want it, give it up, but it's got to be that person's decision. OK? It's got to be that person -- you know, I have friends that are worth hundreds of millions and billions of dollars, they get Social Security.","They don't even know the check comes in. They'll never see the check. I -- you know, there are a lot of -- lot of people would give it up, I mean, for the good of the country. It's almost like give it up. I want to do that. I don't know if anybody's even talked about it. I've never heard it, but I have friends and they all say, \"We don't want it, let's give it up.\" You have a lot of people would do it, and you do it on the basis of spirit for the country because we have to keep Social Security for the people that really need it. So important.","And make America energy secure by 2024. I mean, it's -- it's almost energy secure now. We have so much because of technology. What we have in the ground is enormous, but we're not allowed to export it. And we have more than anybody. You know, we have more really good stuff. I have friends, Harold Hamm and some other people, they're oil people, they're great people.","We have the best stuff. The really best stuff. I'm not talking about the tar sands. What you find, but it's very expensive to -- to get the oil, very, very expensive, and it costs a lot of money. You have to heat it and you have to cool it and you have to do all sorts, it's expensive. We have the best stuff, we have prime.","We have prime and we don't use it. And yet, we're not allowed to use coal anymore. And yet, we export coal to China. And then we say China has to go under the agreement, but they don't have to go under for 25 and 35 years. So we're doing it now, they're doing it in 35 years. I mean, how stupid are we? How stupid do they think we are?","OK? How stupid do they think we are? It's like our military. I love the military. I love our vets. I will take such great care of our vets. Believe me. I have a lot of my friends here. A lot of my friends are here, the vets. Our vets are being treated worse -- I'm telling you, worse than illegal immigrants coming into this country.","They're being treated worse, and they're our greatest people and our wounded warriors. They're not being treated fairly. And we'll take care of that. But when you look at all of the difficulties -- I watched President Obama last night on television. He bombed, very simply. And it was not easy for him because Steve Kroft was doing the night.","They were much nicer to me two weeks ago. Don't we agree? I was on with Putin. Can you believe that, Putin and Trump? Nice table mates, very nice. Putin and Trump. But Obama was on last night and I thought, you know, after about 10 -- 15 minutes, I said, \"You know, every single thing is negative.\" ISIS, Syria, Iraq, Afghanistan, the economy.","A 100 million people in the labor force. A 100 million. Think of it. They're not going to get jobs. You know, the statistic of 5.4%? It's a phony statistic. Doesn't mean anything. Other than the politicians in this room, they don't count because they're fabulous. These are fabulous people. I hate to insult people when they're sitting there with their wives.","You know, it's there. So these are great people. But other than them, that statistic was made up by politicians because you always look good. Guy looks for a job. He can't find one, or a woman. They go back home they say, \"I can't find one. I've looked now for months, I can't find one.\" They go back. They're considered essentially employed.","Whoever heard of this? We have a 100 million people -- a 100 million people out of the workforce. It's the highest number it's ever been. You know, somebody said, a very, very talented person said our unemployment rate -- and I'm going to -- I'm not going to take this number, but actually, he said our unemployment rate is 42%. Think of it. And if you really add it up, it is. So I only say 20, 21, 22 because I want to be nice to the President.","OK? But it's a disaster. We have to create jobs. We have to take jobs back from all of these countries that are ripping us. We have to bring them back. We have to bring them back home. So what happens and what has to happen is we will get into a situation where, hopefully, when the next president is interviewed by 60 Minutes or whoever, they can say, \"Wow, you've really made some unbelievable strides with trade deals.\" I mean, I have Carl Icahn lined up. I have the -- the smartest, toughest negotiators in the world lined up. They don't want anything for it, just like I don't want a salary.","If I win, I don't want -- somebody said to me the other day, \"Will you want your salary if you become President?\" I said -- never thought of it.\" I said, \"No, I don't want it. I don't want it.\" These guys don't want anything. They actually want to help. They want to do something. And I know -- I know people that are so tough and smart.","You don't just need tough. I was saying the other day, they said, \"You want tough in terms of Speaker. You want tough.\" No, I said, \"No, I don't want tough. I want tough and smart.\" Tough is no good. I know too many tough people, they're not smart. You need the combination, right? Right. But you need the combination.","We need smart, tough people. We got to bring our country back because we can't go on like this. We can't go on like this. We cannot -- we cannot continue to lose. You know, our trade deficit -- U.S. trade deficit with China. I had it looked up. It's almost $400 billion a year. And last year was the same thing, and then I went back five years, it was almost -- it gets worse.","It gets worse. Now, if you want to do business with China, you can't. I have friends that are manufacturers. They can't get their product in. And if they do, they get a huge tariff. They have to pay a huge tariff. A man that I'm very close to him -- by the way, I love the Chinese, I think they're great, but their leaders are too smart.","I love Mexico. I love the Mexican people. They're great, but their leaders are too smart for our leaders. They're killing us at the border, they're killing us with trade. Nabisco is moving into Mexico. Can you believe it? Their big plant. They're leaving Chicago. Which means I'm never going to eat another Oreo again, nobody's -- I'm serious.","Never, never. Ford is building a two and a half billion dollar plant in Mexico. How does that help us? They're closing in Michigan all these plant, and they've got to build this massive plant -- explain. I went to the Wharton School of Finance. Why -- why is this good for us? Why? In Tennessee, they're all set to announce a big plant and the -- the company announced very quickly, very ruthlessly, they've decided to go to Mexico instead.","So now, they're going to Mexico instead. Not going to happen. It's not going to happen. We're going to keep our jobs in the United States. You want to do business with some of these countries, they charge you tax. We don't charge them tax because we're stupid. We don't charge them. It's not fair. So we need problem solvers.","We need leaders. And you can't have leadership unless you know how to -- you know, let's -- we're going to make our country rich again. A woman came up to me. She said, \"Mr. Trump, I like you.\" She's from New Hampshire. \"I like you so much, but are you a nice enough person to be President?\" Can you believe?","I said, \"I think I'm nice. I love people.\" But it's not -- I told her. I said, \"I'm nice, believe me, and I'm going to take care of people. I'm going to take care of women. I'm going to take care of men. I'm going to take care of the African-Americans.\" Look at their employment rates. It's a record. African-American youth -- you look at what's going on in the inner cities.","African-American youth, they can't get jobs at all, 60, 70% unemployment. I'm going to take care of people. But I said to her, \"I don't think -- I really don't believe this is going to be about am I a nice person. I think people are fed up with incompetent politicians that don't get things done.\" I'm telling you.","I think they're fed up. And I think this is going to be an election that's going to be largely based on competence because we want our country back. We want to take it back. We want our country back. So it's really an honor to be with you. It's an incredible -- it's an incredible group. Behind me is the future.","Except for a couple of people in the audience that I know, forget them. But this is the future. And I thought I'd take a couple of questions. They were asking would I be able to take a couple of questions. So it'd be my honor. Go ahead, sir. Yes. Go ahead, sure.","Wait, wait.","You look healthy to me. Go ahead.","Well, I like committing to all of those things. Those are great things, Alzheimer's, AIDS, so many different -- you know, we're close on some of them. On some of them, honestly, with all of the work that's been done, which hasn't been enough, we're not very close. But the answer is yes, I believe so strongly in that and we're going to lead the way.","We're going to lead the way on that. OK, yes, sir.","That's good. Thank you.","Go ahead.","OK. Well, let me just tell you, the word compromise is not a bad word to me as a negotiator and having written the art of the deal and having made deals all my life, and I'm coming out with a book in three weeks. It's a rough title. Does anyone know the title of the book? It's a rough title, Crippled America.","You know, I tell you, it's -- it's a very sad title because Simon and Schuster called me. They said, \"We'd love to do a book.\" And I said -- I started writing and I worked with a group, and they're great people. And I realized how much negativity is going on.","And I said that, and then they set this great photographer on, and they took these beautiful pictures of me smiling. I'm smiling, it's so happy, you know, I'm smiling. I -- I looked nice. My wife said, \"You look really good here. Great.\" But I didn't use that picture. I used the worst picture in the whole group.","And it's mean, it's angry because I'm angry about what's happened to the country. And I put it right on the cover of the book. It's the worst picture we chose, I don't have as much ego as -- it's a horrible picture. But I like the word compromise. We need compromise. There's nothing wrong with compromise, but it's always good to compromise and win.","Meaning, let's compromise and win.","Now, as far as taxes are concerned, you know, I put out a plan where I'm reducing taxes very substantially. In fact, we -- we're bringing corporate down to 15%. We're bringing tremendous tax reductions to virtually everybody. We're getting rid of a lot of the deductions like carried interest which is meant for the hedge fund guys.","I mean, these are hedge fund deduction. We're getting rid of them. The hedge fund guys don't want to talk to me anymore. They wanted to give me millions. I'm self-funding my campaign. I'm not taking money from hedge funds or anybody else. They want to give me millions of dollars. I don't want it. Because if I take it, I've got to be like Jeb Bush, I got to be like Rubio, I got to be like all these guys, and I got to do what they tell me to do. Because believe me, they're puppets.","Believe me, they are puppets. So I'm self-funding my campaign, but we have asked for a very major tax reduction and a major, major simplification. So I think you'll be very happy. And the word compromise is absolutely fine. But if you're going to compromise, ask for about three times more than you want. Do you understand?","So that when you compromise, you get what you want. OK. Yes, go ahead. Go ahead. She doesn't have a mic. Who's got a mic back there? OK. Go, look who we have good. Good. Good.","In particular.","All right. Well, what we're going to do -- I mean, we do -- and by the way, it's not 18 trillion, it's now $19 trillion. So we have now $19 trillion in deficits, 19, 20. You know, if you look, we owe. When I say that, we owe. This is what you're talking about. We owe 19 trillion as a count -- as a country and we're going to knock it down and we're going to bring it down big league, and quickly, we're going to bring jobs back.","We're going to bring business back. We're going to -- we're going to stop our deficits. We're going to stop our deficits. We're going to do it very quickly. How? Are you ready? Number one, we have tremendous cutting to do. You have a Department of Education that is totally out of control, massive costs. And you know, most of the -- and some of the Republican candidates like Common Core.","I'm totally against Common Core. I want local education. When I'm in New Hampshire and Iowa and South Carolina, I want -- so important. So we're going to have that. We're going to save on Department of Environmental Protection because they're not doing it. They're not doing their job and they're making it impossible for our country to compete.","And many, many other things. Hundreds of billions of dollars is going to be saved just in terms of running government. In addition to that, I'm going to bring millions of jobs back into this country. OK, darling? Thank you. OK, question. Yes, ma'am.","I have to say what I do. You know what -- I mean, I understand. I understand. It's OK. We -- I went to Ivy League schools, I know what's divisive, I know what's not divisive in all fairness, and what you do -- I don't want to necessarily be politically correct all the way down the line because I'm seeing people -- I see people, they can't even function.","I see politicians, they're afraid to say anything because it's not politically correct. And they know the answers and they refuse to give them because they're afraid it's not going to be politically correct. And I am going to have to be who I am. Now, at the same time, I'm running against a lot of people.","It was 16. Now, it's 15. As you know, one dropped out. Many are going to be dropping out I think very soon. If they're smart, they're going to be dropping out, many -- too many people -- too many people. When it becomes a different kind of a situation, you'll see I'm going to be much less divisive. But always remember this, I never start anything.","I never start. I said before, counterpunch. I don't start. They start. They get very nasty. I mean, whether it's Lindsey Graham, whether it's Perry from Texas, I get along great. Then all of a sudden, they start -- because they're dying, they're -- they're doing so badly. They're doing so badly that they figure -- I don't think anybody in this room wants to have somebody that's not going to fight back.","The problem we have in this country is we have people now that don't fight back. They don't fight back. And the country is -- is tremendous -- the country is being hurt tremendously by it. OK. Another question. Yeah, go ahead. Go ahead. Go ahead.","Where are you? Where are you?","OK, go ahead. We'll do you right after.","So important.","Yeah, so important, and that's got to be worked on. The one thing I get maybe more than any other question is student loans. I'm getting it from the students. They go out. They get an education from great colleges -- many great colleges. They become the best student in their class. Everything's great. And then they can't get a job.","The best way to solve it is to create jobs, but they can't get jobs. The students are going out, they're in hock. They're borrowing money all over the place. They borrowed their student loan money, which is by the way, one of the only agencies in government that makes a lot of money, which is that's the one place maybe we shouldn't be making so much money.","But it's a question I get more than any other question. We are going to be cutting that down. We're going to give people incentive to go out and get an education, but most -- at a much lower price. Don't forget, these schools, because they get so much money from the government through the student, they're raising their fees to a point that's ridiculous.","They don't need to get that kind of money. They don't need to get that kind of money. Because of the fact that the government is giving out so much money. You take a look at what's happened to the cost of education. And believe me, it hasn't gone up that much. So we're going to do a number, we're going to get those numbers down, and also, we're going to have jobs.","So when you graduate, you're going to end up getting a nice job. We're very happy. OK? Thank you. Great question. Go ahead. Go ahead.","But I love the Tea Party.","I do. I love the Tea Party.","You know what, the -- the Tea Party -- I'll tell you about the Tea Party. These are people -- in all fairness, because you can't really -- these are people that love this country. They do love this country, and they want the country to be great. I mean, it's very important. Go ahead.","But that's their point --","Yeah, well --","Well, they don't want Planned Parenthood funded, and I -- and -- and I think a lot of people understand that including me. They don't want it funded. I mean, I understand that. So I mean, you do have that. A lot of people -- a lot of people feel that. Go ahead.","I know I shouldn't have picked her. I knew I shouldn't pick her. All right. So let me give you that answer right now. I respect women incredibly. I have had women working for me in positions that they've never worked in terms of -- in terms of so many different jobs. I had a woman who was in charge of the building of Trump Tower many years ago before it was even thought -- before anybody would have even thought of it, and did a fantastic job.","I have given women more opportunity than I would say virtually anybody in the construction industry. I have a daughter named Ivanka and a wife named Melania, who constantly want me to talk about women's health issues because they know how I feel about it and they h -- know how I feel about women. I respect women.","I love women. I cherish women. You know, Hillary Clinton said, \"He shouldn't cherish.\" Why, I said, \"I do cherish. I cherish women.\" My mother was one of the great people of the world, maybe the greatest ever, my mother. I respect women and I'm going to take care of women. You know, Jeb Bush didn't want to fund women's health issues.","You read that, you saw that. And then he took it back later. I will take care of women and I have great respect for women and I -- I do cherish women, and I will take care of women and I'll take care of us. Also, from the enemy, meaning the enemy on different shores that's looking to come in and do numbers, believe me, I will take care of the people in this country far better than any of the folks that you're looking at right now.","That I can tell you. OK. Yeah, go ahead. Go ahead. Go ahead. I thought it was finished.","You're going to make the same if you do as good a job -- you're going to make the same if you do as good a job, and I happen to be pro-life. OK? I'm pro-life. OK. Question. Any other questions? Yes, go ahead. Go ahead. You have the mic back there? Yeah. Go ahead. You have a mic? Go ahead. Go ahead. Shout it out.","Come on, let's go, shoot. He's joking. Come on. Harvard, you go to Harvard?","How are you?","Sure, right.","Are you from South Korea?","Which is peanuts compared to what it's costing.","Excuse me. Excuse me. It's peanuts compared -- it's peanuts compared to what it's costing. It's peanuts. And by the way, they're a very -- they are a very wealthy country. Part of the problem when we talk about like your question about deficits and about losing and why can't we do, we're defending Germany, we're defending Japan, we're defending South Korea, we're defending so many countries.","We get peanuts, we get nothing. We get -- you know, you're right. We're getting small payment. It's a fraction, a tiny fraction. And I talk -- I -- I say all the time about South Korea. I ordered 4,000 television sets recently for a big project. They all come from South Korea. My only bidder was South Korea except for Sony, which is in Japan, and they lost their way, OK? My only bidder -- whether it's LG or whether it's Samsung.","These are wealthy countries. We have 28,000 soldiers on the border of South Korea. So we defend Germany, which is sending cars and everything over there, making it's an economic behemoth. We're defending Japan. So here's the deals that we make. We defend Japan and we have to defend them with our lives. If anybody attacks Japan, we have an agreement.","We have to go and attack and fight and die and spend. But if anybody attacks us, Japan doesn't have to do a thing. That's the way we run things. It's not going to happen with me, folks. It's not going to happen with me. And if we're defending people that are far richer than us, they're going to have to pay for it. We want to help them.","But why are we defending Germany, why are we defending South Korea, why are we defending Japan and they don't do anything for us? We're going to have great relationships. But why do we pay the costs of defending the world? And you know, when you look at your military budget. Yeah, it -- it's far higher than anybody else's. But you know why it's higher?","Because we're defending all these countries, it's not helping us. So we are going to change things around and we're going to make America great again. Believe me. Thank you all very much. Thank you. Thank you."],"text":" Hi, thank you very much everybody. That's so nice. Wow. No Labels, it's right. I'm a believer. You know, John and Joe called and they said, \"Would you do it?\" This is about two months ago. And I said, \"Well, I think I will be able to explain what No Labels represented.\" We all know that that's where we have to go in this country because we're getting nothing done, whatsoever. So I said, \"I think so, I have to get out. I'm pretty sure I'm going to be able to do it.\" So they then -- the next day, they announce I will be there without question, right? They're tough negotiators. So I had another problem. We had another speech someplace who's actually quite a bit of a problem, and I told him, \"I wouldn't do it.\" See, they were solvers. They were problem solvers. And they went nuts. They were not happy. Is that right, Joe and John? They were not happy people. And ultimately, I said, \"You know what, I may have gone a little over that 50% level.\" And so here I am, right? Here I am. And I love New Hampshire. And as Joe said, you know, the latest poll came out, 32 -- 32 to 14 or 13 or so. I think it's 13. And I have the 32, which is even better. Somebody said, \"Why do you talk about the polls?\" I said, \"Because I'm winning.\" They go, \"But nobody else ever talks about the polls.\" That's because they do lousy in the polls. Nobody else talks about the polls. They don't do well in the poll. Believe me, if they were doing well, they'd be talking about the polls. But we had 32 to 13. And that's a big gap. And that's in New Hampshire. And -- and we've been here a lot. I know so many people, I have so many friends in New Hampshire. They're amazing people, amazing. So thank you all. I really appreciate it. So when we talk about No Labels and we talk about getting along, and I'm not going to say it too much because Tip O'Neill and Ronald Reagan, you probably hear it every -- every speaker, but I look at that as the ultimate where two people, different views, different everything, and they liked each other and they get along and they got things done. And they had a leader in Ronald Reagan. Because ultimately, it is about the President. It is. Much more so about the President than you can imagine. And if the President is a leader -- if he's a real leader or she is a real leader, you'll get things done. But you need the leadership to come from the very pinnacle, from the very top. And if it doesn't, it's not going to happen. And that's not happening now. It's not happening now. People aren't getting together, and I see it. You know, I've been actually doing this for a long time. A lot of people say, , I was very establishment. I was the ultimate. I gave more money than anybody. I might -- we give so much money. I was all establishment when I gave contributions, right? When I decided to run, I was anti-establishment. Can you believe this? But we can't take a chance at a loss. I mean, I watched previously two -- in particular, two, and last time I was seriously thinking about doing it, I decided not to because I thought it was a race that could have been won, should have been won, and I don't want that to happen again. I don't want it to happen again because I think it's really -- if you look at what happened four years ago, boy, timing was right, everything was right, and it should have been done. Well, it's going to be done this time, and hopefully, it's going to be done by me and I think we're going to have a result that's going to be great. We're going to turn the country around, we're going to make America great again, and that's what's going to happen. That's what's going to happen. I looked at a couple of things that I thought would be appropriate, and I'm thinking back of my career. And on my career, when I was young -- a young man in New York, we had a problem called the skating rink. It took eight years. Everyone knows, the Wollman Skating Rink. They now study it in all the business schools. They're all nodding their heads. We all studied it. I didn't study it, but I did it. But it's in all the business schools about what private enterprise can do. And we had a rink stay -- I mean, wasn't such a little deal. It was a 80,000 foot rink. It's a very big rink. And the government under Mayor Ed Koch couldn't -- they couldn't get it built. They were trying. It was actually a renovation, wasn't even building. And after eight years -- and I have a daughter growing up, she kept saying, \"Dad, I want to go ice skating.\" And for year after year, I'd say to Ivanka -- anybody ever hear of Ivanka, right? She's great. But she said, \"Can I go ice skating, dad?\" And for years -- for seven years, I said, \"I can't.\" There's no ice. And I'd go over to the rink and I'd see the men and that workers and they'd be sitting down. They had lunch breaks. It would take like four -- five hours. They'd be hundreds of guys sitting down on the rink. I said, \"Boy, that's terrible.\" And I pass it. And after the seventh year, I went to Koch, and I said, \"Ed, I got it. I could do this thing fast.\" This is ridiculous.They're not working. They're using the wrong everything. And I met with the unions. I met with people that do refrigeration. They were doing refrigeration. The engineer was based in Miami, Florida. I said -- it's true. And they were using Freon. And Freon, that means if you have a little tiny hole in 30 miles of pipe -- little tiny hole, it's not going to work. Guess, it'll go out. And I said, \"It doesn't sound good, but why do we want a guy -- \" So I called up the Montreal Canadiens ice hockey team. I said, \"Can I ask you a question? Who does your rinks?\" \"We have somebody excellent. He's based right here in Montreal.\" I said, \"Now we're talking.\" And he came in. Great guy. Came in. He looked at what was happening. He immediately said, \"You can't use Freon, it won't work. It'll freeze, it'll this -- it won't work. You have to use brine.\" You know what brine is? It's water with salt in it. How simple could that get? So on top of everything else, it was much less expensive. Anyway, I got to town. Ed Koch said, \"Will you do it?\" Because it was a very huge embarrassment for the New York people. They all know what I'm talking about. And we had cement mixers because it was a massive pour. They were pouring little sections like 10 feet by 10 feet. You can imagine this massive rink, like take the biggest office floor you know and double and triple it and then pour a little section and then another little section and then the vandals would come in at night and steal all the copper. Because the Freon you have to use the copper. So I said, \"This is not good.\" So -- and you want one contiguous pour. So I had trucks based from -- literally from the rink, all the way back to Harlem -- all the way up -- way up to a 125th Street, cement mixers, and we poured it all in one day. It was 24 hours, they were pouring during the day, during the night. It was 26 hours and 25 minutes. And we poured one contiguous pour. It healed beautifully. When the city did it, it was like this. So they had on one side a foot and a half of water, and on the other side, they didn't have any water. So they couldn't make ice for a lot of reasons. So -- and actually, you know, when I talk about the price, the biggest problem I had was demolition. That was the biggest cost. I had to demolish everything that was done. So I got it done. I got everybody together and we got it done. And to this day, it's the most successful ice skating rink. I still run it. I run it. Nobody -- every time it comes up, the city want -- they want me to -- they don't want to take any chances. But I've run it for many years and it's the number one in the world and it does great. And it's sort of -- I was just thinking about it coming up because we're talking about No Labels. I was talking to John. I was talking to Joe, and we're talking about getting together. I got together with everybody, the city, the council. Everything had to be done fast. The beauty is I did it in four months. This is after eight years. I did it in four months. I did it for $1.8 million. The city had spent over 20 million. And I always say, most of it was demolition. OK? That's what happens. And you can do that with this country. You can do it with the country. And believe me, you can do things that people have no idea. Construction-wise, our roads are falling apart, our bridges, our tunnels, our airports. I just left LaGuardia Airport. It's like a third world airport. No, it's third world. I mean, it's t -- it's horrible. You look at it. You go out to the runways, it's horrible. And I go to places because I travel all over the world. I have so many different relationships and partnerships and very complicated stuff. And I meet the -- the richest people, the richest companies in the world, and I'm partners with many of them in different parts. And you go to Qatar and you go to all of the different places and -- by the way, all over China -- all over China. You go to Bahrain, you go to Saudi Arabia, you see airports you've never seen anything like it. You've never seen anything like it. They built temporary airports while they're building the big one that are 100 times nicer than anything we have in this country. We -- we're just -- it's -- it's -- we've lost it. We've lost it. Another deal that just happened, and this was, again, getting everybody together. The city of New York in the Bronx, right outside of Manhattan, and most of you have read about it. They had a 350 acre piece of land on the water on the East River. The East River is great. People have apartments in the East River, right? He knows what I'm going to say. And it was 350 and expandable into 550 acres. This is like five minutes outside of Manhattan. I'd say right off the Manhattan ramp. And they've been building a golf course I think for 30 years. I think. Somebody said it's really not 30. It's 21 years. OK, it's 21. So whether it's 20, 21 or 30 -- but I think it's 30, it's been under construction for many, many years. We believe the cost is over $300 million. In fact, the mayor said to me, \"What do you think it should have cost? I said, \"About seven\". But I believe the cost is over 300 million, and they couldn't get it done. And Mayor Bloomberg said, \"You've got to help us. Please, you've got to help us.\" So they went to an RFP, I got they're RFP, so I have a long term deal. And I took it over. I got it done in less than a year, for peanuts. It's beautiful. It's getting all rave reviews. I had to get the city together. I had to get all the unions together. I had to get everybody together, and we got it done and they worked so hard. And now, it's open and setting every record because of its location, it's phenomenal. I mean, to be right next to Manhattan and on the river, it's unbelievable. So you can do these things, but it's about leadership. You have to get people together. And frankly, if I had somebody that worked for me who was good, it wouldn't be good enough, it had to come from me because I needed the mayor's help, I needed the city council's help, I needed a lot -- it's -- and the case we're talking about is -- comes from the President, has to come from the President. And I'll give you something that to me is so big, corporate inversion. You know, I -- I look at your different things that you have, things that you want to do. Create 25 million jobs. This is the organization that you want to do. Balance the Federal budget by 2030 -- 2030. That's an easy one. 2000 -- actually, you know, I looked at -- because they gave me this note. I said -- I said, \"I think there's a typo.\" 2030. Secure Social Security, they have to do it. People have a contract. We all have a contract. I don't need mine by the way. And by the way, I think if somebody doesn't want it, give it up, but it's got to be that person's decision. OK? It's got to be that person -- you know, I have friends that are worth hundreds of millions and billions of dollars, they get Social Security. They don't even know the check comes in. They'll never see the check. I -- you know, there are a lot of -- lot of people would give it up, I mean, for the good of the country. It's almost like give it up. I want to do that. I don't know if anybody's even talked about it. I've never heard it, but I have friends and they all say, \"We don't want it, let's give it up.\" You have a lot of people would do it, and you do it on the basis of spirit for the country because we have to keep Social Security for the people that really need it. So important. And make America energy secure by 2024. I mean, it's -- it's almost energy secure now. We have so much because of technology. What we have in the ground is enormous, but we're not allowed to export it. And we have more than anybody. You know, we have more really good stuff. I have friends, Harold Hamm and some other people, they're oil people, they're great people. We have the best stuff. The really best stuff. I'm not talking about the tar sands. What you find, but it's very expensive to -- to get the oil, very, very expensive, and it costs a lot of money. You have to heat it and you have to cool it and you have to do all sorts, it's expensive. We have the best stuff, we have prime. We have prime and we don't use it. And yet, we're not allowed to use coal anymore. And yet, we export coal to China. And then we say China has to go under the agreement, but they don't have to go under for 25 and 35 years. So we're doing it now, they're doing it in 35 years. I mean, how stupid are we? How stupid do they think we are? OK? How stupid do they think we are? It's like our military. I love the military. I love our vets. I will take such great care of our vets. Believe me. I have a lot of my friends here. A lot of my friends are here, the vets. Our vets are being treated worse -- I'm telling you, worse than illegal immigrants coming into this country. They're being treated worse, and they're our greatest people and our wounded warriors. They're not being treated fairly. And we'll take care of that. But when you look at all of the difficulties -- I watched President Obama last night on television. He bombed, very simply. And it was not easy for him because Steve Kroft was doing the night. They were much nicer to me two weeks ago. Don't we agree? I was on with Putin. Can you believe that, Putin and Trump? Nice table mates, very nice. Putin and Trump. But Obama was on last night and I thought, you know, after about 10 -- 15 minutes, I said, \"You know, every single thing is negative.\" ISIS, Syria, Iraq, Afghanistan, the economy. A 100 million people in the labor force. A 100 million. Think of it. They're not going to get jobs. You know, the statistic of 5.4%? It's a phony statistic. Doesn't mean anything. Other than the politicians in this room, they don't count because they're fabulous. These are fabulous people. I hate to insult people when they're sitting there with their wives. You know, it's there. So these are great people. But other than them, that statistic was made up by politicians because you always look good. Guy looks for a job. He can't find one, or a woman. They go back home they say, \"I can't find one. I've looked now for months, I can't find one.\" They go back. They're considered essentially employed. Whoever heard of this? We have a 100 million people -- a 100 million people out of the workforce. It's the highest number it's ever been. You know, somebody said, a very, very talented person said our unemployment rate -- and I'm going to -- I'm not going to take this number, but actually, he said our unemployment rate is 42%. Think of it. And if you really add it up, it is. So I only say 20, 21, 22 because I want to be nice to the President. OK? But it's a disaster. We have to create jobs. We have to take jobs back from all of these countries that are ripping us. We have to bring them back. We have to bring them back home. So what happens and what has to happen is we will get into a situation where, hopefully, when the next president is interviewed by 60 Minutes or whoever, they can say, \"Wow, you've really made some unbelievable strides with trade deals.\" I mean, I have Carl Icahn lined up. I have the -- the smartest, toughest negotiators in the world lined up. They don't want anything for it, just like I don't want a salary. If I win, I don't want -- somebody said to me the other day, \"Will you want your salary if you become President?\" I said -- never thought of it.\" I said, \"No, I don't want it. I don't want it.\" These guys don't want anything. They actually want to help. They want to do something. And I know -- I know people that are so tough and smart. You don't just need tough. I was saying the other day, they said, \"You want tough in terms of Speaker. You want tough.\" No, I said, \"No, I don't want tough. I want tough and smart.\" Tough is no good. I know too many tough people, they're not smart. You need the combination, right? Right. But you need the combination. We need smart, tough people. We got to bring our country back because we can't go on like this. We can't go on like this. We cannot -- we cannot continue to lose. You know, our trade deficit -- U.S. trade deficit with China. I had it looked up. It's almost $400 billion a year. And last year was the same thing, and then I went back five years, it was almost -- it gets worse. It gets worse. Now, if you want to do business with China, you can't. I have friends that are manufacturers. They can't get their product in. And if they do, they get a huge tariff. They have to pay a huge tariff. A man that I'm very close to him -- by the way, I love the Chinese, I think they're great, but their leaders are too smart. I love Mexico. I love the Mexican people. They're great, but their leaders are too smart for our leaders. They're killing us at the border, they're killing us with trade. Nabisco is moving into Mexico. Can you believe it? Their big plant. They're leaving Chicago. Which means I'm never going to eat another Oreo again, nobody's -- I'm serious. Never, never. Ford is building a two and a half billion dollar plant in Mexico. How does that help us? They're closing in Michigan all these plant, and they've got to build this massive plant -- explain. I went to the Wharton School of Finance. Why -- why is this good for us? Why? In Tennessee, they're all set to announce a big plant and the -- the company announced very quickly, very ruthlessly, they've decided to go to Mexico instead. So now, they're going to Mexico instead. Not going to happen. It's not going to happen. We're going to keep our jobs in the United States. You want to do business with some of these countries, they charge you tax. We don't charge them tax because we're stupid. We don't charge them. It's not fair. So we need problem solvers. We need leaders. And you can't have leadership unless you know how to -- you know, let's -- we're going to make our country rich again. A woman came up to me. She said, \"Mr. Trump, I like you.\" She's from New Hampshire. \"I like you so much, but are you a nice enough person to be President?\" Can you believe? I said, \"I think I'm nice. I love people.\" But it's not -- I told her. I said, \"I'm nice, believe me, and I'm going to take care of people. I'm going to take care of women. I'm going to take care of men. I'm going to take care of the African-Americans.\" Look at their employment rates. It's a record. African-American youth -- you look at what's going on in the inner cities. African-American youth, they can't get jobs at all, 60, 70% unemployment. I'm going to take care of people. But I said to her, \"I don't think -- I really don't believe this is going to be about am I a nice person. I think people are fed up with incompetent politicians that don't get things done.\" I'm telling you. I think they're fed up. And I think this is going to be an election that's going to be largely based on competence because we want our country back. We want to take it back. We want our country back. So it's really an honor to be with you. It's an incredible -- it's an incredible group. Behind me is the future. Except for a couple of people in the audience that I know, forget them. But this is the future. And I thought I'd take a couple of questions. They were asking would I be able to take a couple of questions. So it'd be my honor. Go ahead, sir. Yes. Go ahead, sure. Wait, wait. Mr. Trump. You look healthy to me. Go ahead. I -- I would like to thank you for continuing this constructive conversation. As you probably know, President -- sorry, President Bush started PEPFAR, which has been an incredible fund, the President's Emergency Plan For AIDS Relief. It has really been incredibly effective and good about AIDS treatment globally. And while I, as well as -- with a group of college students across the country, really want to ask you is if you would commit to doubling the number of people on treatment to 30 million people by the year 2020? Well, I like committing to all of those things. Those are great things, Alzheimer's, AIDS, so many different -- you know, we're close on some of them. On some of them, honestly, with all of the work that's been done, which hasn't been enough, we're not very close. But the answer is yes, I believe so strongly in that and we're going to lead the way. We're going to lead the way on that. OK, yes, sir. Michael here in New Hampshire. And I am impressed that you are here in person. I have to admit. That's good. Thank you. I'm going to throw a question at you and I think it's going to be a hard one for you to answer. Go ahead. So here's the challenge. Compromise has become a dirty word. If the other side said we will do this, this, and that and all they asked for you was for a tax increase -- a specific tax increase or getting rid of a tax deduction. What could you offer at the table, again, as a gesture of compromise? OK. Well, let me just tell you, the word compromise is not a bad word to me as a negotiator and having written the art of the deal and having made deals all my life, and I'm coming out with a book in three weeks. It's a rough title. Does anyone know the title of the book? It's a rough title, Crippled America. You know, I tell you, it's -- it's a very sad title because Simon and Schuster called me. They said, \"We'd love to do a book.\" And I said -- I started writing and I worked with a group, and they're great people. And I realized how much negativity is going on. I can -- And I said that, and then they set this great photographer on, and they took these beautiful pictures of me smiling. I'm smiling, it's so happy, you know, I'm smiling. I -- I looked nice. My wife said, \"You look really good here. Great.\" But I didn't use that picture. I used the worst picture in the whole group. And it's mean, it's angry because I'm angry about what's happened to the country. And I put it right on the cover of the book. It's the worst picture we chose, I don't have as much ego as -- it's a horrible picture. But I like the word compromise. We need compromise. There's nothing wrong with compromise, but it's always good to compromise and win. Meaning, let's compromise and win. You got to choose this. Now, as far as taxes are concerned, you know, I put out a plan where I'm reducing taxes very substantially. In fact, we -- we're bringing corporate down to 15%. We're bringing tremendous tax reductions to virtually everybody. We're getting rid of a lot of the deductions like carried interest which is meant for the hedge fund guys. I mean, these are hedge fund deduction. We're getting rid of them. The hedge fund guys don't want to talk to me anymore. They wanted to give me millions. I'm self-funding my campaign. I'm not taking money from hedge funds or anybody else. They want to give me millions of dollars. I don't want it. Because if I take it, I've got to be like Jeb Bush, I got to be like Rubio, I got to be like all these guys, and I got to do what they tell me to do. Because believe me, they're puppets. Believe me, they are puppets. So I'm self-funding my campaign, but we have asked for a very major tax reduction and a major, major simplification. So I think you'll be very happy. And the word compromise is absolutely fine. But if you're going to compromise, ask for about three times more than you want. Do you understand? So that when you compromise, you get what you want. OK. Yes, go ahead. Go ahead. She doesn't have a mic. Who's got a mic back there? OK. Go, look who we have good. Good. Good. I'm Allie Nault. I'm Miss America's Outstanding Teen and I travel across the country and teach kids about saving money, which is hard. Our government doesn't -- isn't even fiscally responsible. So I'm asking every single candidate and I've been waiting to ask you -- In particular. I spe -- yeah, of course. So specifically, what are you going to do about the $18 trillion deficit? All right. Well, what we're going to do -- I mean, we do -- and by the way, it's not 18 trillion, it's now $19 trillion. So we have now $19 trillion in deficits, 19, 20. You know, if you look, we owe. When I say that, we owe. This is what you're talking about. We owe 19 trillion as a count -- as a country and we're going to knock it down and we're going to bring it down big league, and quickly, we're going to bring jobs back. We're going to bring business back. We're going to -- we're going to stop our deficits. We're going to stop our deficits. We're going to do it very quickly. How? Are you ready? Number one, we have tremendous cutting to do. You have a Department of Education that is totally out of control, massive costs. And you know, most of the -- and some of the Republican candidates like Common Core. I'm totally against Common Core. I want local education. When I'm in New Hampshire and Iowa and South Carolina, I want -- so important. So we're going to have that. We're going to save on Department of Environmental Protection because they're not doing it. They're not doing their job and they're making it impossible for our country to compete. And many, many other things. Hundreds of billions of dollars is going to be saved just in terms of running government. In addition to that, I'm going to bring millions of jobs back into this country. OK, darling? Thank you. OK, question. Yes, ma'am. Mr. Trump, my name is Makaila O'Connery, and in the spirit of problem solving, I'm wondering if you're at all concerned that some of the divisive language you use on the campaign trail undermines your ability to solve problems. I have to say what I do. You know what -- I mean, I understand. I understand. It's OK. We -- I went to Ivy League schools, I know what's divisive, I know what's not divisive in all fairness, and what you do -- I don't want to necessarily be politically correct all the way down the line because I'm seeing people -- I see people, they can't even function. I see politicians, they're afraid to say anything because it's not politically correct. And they know the answers and they refuse to give them because they're afraid it's not going to be politically correct. And I am going to have to be who I am. Now, at the same time, I'm running against a lot of people. It was 16. Now, it's 15. As you know, one dropped out. Many are going to be dropping out I think very soon. If they're smart, they're going to be dropping out, many -- too many people -- too many people. When it becomes a different kind of a situation, you'll see I'm going to be much less divisive. But always remember this, I never start anything. I never start. I said before, counterpunch. I don't start. They start. They get very nasty. I mean, whether it's Lindsey Graham, whether it's Perry from Texas, I get along great. Then all of a sudden, they start -- because they're dying, they're -- they're doing so badly. They're doing so badly that they figure -- I don't think anybody in this room wants to have somebody that's not going to fight back. The problem we have in this country is we have people now that don't fight back. They don't fight back. And the country is -- is tremendous -- the country is being hurt tremendously by it. OK. Another question. Yeah, go ahead. Go ahead. Go ahead. Mr. Trump, thank you. I -- my name's Kyle Smith. I'm a student leader with . Where are you? Where are you? I'm over here, sir. OK, go ahead. We'll do you right after. All right. So I just want to say thank you first of all. And I was wondering what your plan is in working across the aisle to increase civic engagement among millennials, getting college students -- So important. -- and namely, also, student loans. Yeah, so important, and that's got to be worked on. The one thing I get maybe more than any other question is student loans. I'm getting it from the students. They go out. They get an education from great colleges -- many great colleges. They become the best student in their class. Everything's great. And then they can't get a job. The best way to solve it is to create jobs, but they can't get jobs. The students are going out, they're in hock. They're borrowing money all over the place. They borrowed their student loan money, which is by the way, one of the only agencies in government that makes a lot of money, which is that's the one place maybe we shouldn't be making so much money. But it's a question I get more than any other question. We are going to be cutting that down. We're going to give people incentive to go out and get an education, but most -- at a much lower price. Don't forget, these schools, because they get so much money from the government through the student, they're raising their fees to a point that's ridiculous. They don't need to get that kind of money. They don't need to get that kind of money. Because of the fact that the government is giving out so much money. You take a look at what's happened to the cost of education. And believe me, it hasn't gone up that much. So we're going to do a number, we're going to get those numbers down, and also, we're going to have jobs. So when you graduate, you're going to end up getting a nice job. We're very happy. OK? Thank you. Great question. Go ahead. Go ahead. I'm curious what your perspective is on the Freedom Caucus or aka, I guess, the Tea Party which, of course, has been at -- at -- at the heart of -- But I love the Tea Party. OK. I do. I love the Tea Party. I guess it's good. You know what, the -- the Tea Party -- I'll tell you about the Tea Party. These are people -- in all fairness, because you can't really -- these are people that love this country. They do love this country, and they want the country to be great. I mean, it's very important. Go ahead. Yeah. You know, the issue is for -- for example, I see and not -- not -- not to offend anyone, but quite frankly, I see the Planned Parenthood as it's a deck chair on the Titanic. So it -- that -- that's -- that's where I'm coming from. But that's their point -- They're -- they're short, but to -- to shut down the entire government over it is -- is -- Yeah, well -- -- the -- the kind of the small world mindset . Well, they don't want Planned Parenthood funded, and I -- and -- and I think a lot of people understand that including me. They don't want it funded. I mean, I understand that. So I mean, you do have that. A lot of people -- a lot of people feel that. Go ahead. OK. OK. So maybe I'm wrong, maybe you can prove me wrong, but I don't think that you're a friend to woman. How -- wa -- it -- I know I shouldn't have picked her. I knew I shouldn't pick her. All right. So let me give you that answer right now. I respect women incredibly. I have had women working for me in positions that they've never worked in terms of -- in terms of so many different jobs. I had a woman who was in charge of the building of Trump Tower many years ago before it was even thought -- before anybody would have even thought of it, and did a fantastic job. I have given women more opportunity than I would say virtually anybody in the construction industry. I have a daughter named Ivanka and a wife named Melania, who constantly want me to talk about women's health issues because they know how I feel about it and they h -- know how I feel about women. I respect women. I love women. I cherish women. You know, Hillary Clinton said, \"He shouldn't cherish.\" Why, I said, \"I do cherish. I cherish women.\" My mother was one of the great people of the world, maybe the greatest ever, my mother. I respect women and I'm going to take care of women. You know, Jeb Bush didn't want to fund women's health issues. You read that, you saw that. And then he took it back later. I will take care of women and I have great respect for women and I -- I do cherish women, and I will take care of women and I'll take care of us. Also, from the enemy, meaning the enemy on different shores that's looking to come in and do numbers, believe me, I will take care of the people in this country far better than any of the folks that you're looking at right now. That I can tell you. OK. Yeah, go ahead. Go ahead. Go ahead. I thought it was finished. I want -- is it on? OK. I want to get paid the same as a man and I think you understand that. So if you become President, will a woman make the same as a man and do I get to choose what I do with my body? You're going to make the same if you do as good a job -- you're going to make the same if you do as good a job, and I happen to be pro-life. OK? I'm pro-life. OK. Question. Any other questions? Yes, go ahead. Go ahead. You have the mic back there? Yeah. Go ahead. You have a mic? Go ahead. Go ahead. Shout it out. Come on, let's go, shoot. He's joking. Come on. Harvard, you go to Harvard? Hi, Mr. Trump. How are you? Thank you so much for -- sorry. Thank you so much for coming to speak to us today. I saw a really quick question about something you said earlier this summer about -- basically, you said that South Korea takes advantage the United States in terms of the defense spending on the Korean Peninsula. Sure, right. You said they don't pay anything. How about -- I just want to get the facts straight . Are you from South Korea? I'm not. I was born in Texas, raised in Colorado. But I just want to say -- I just want to say that, you know, no matter where I'm from, I just like to get my facts straight and I want to tell you that that's not true. South Korea paid $861 million. Which is peanuts compared to what it's costing. Yeah, but the Unites States all political -- Excuse me. Excuse me. It's peanuts compared -- it's peanuts compared to what it's costing. It's peanuts. And by the way, they're a very -- they are a very wealthy country. Part of the problem when we talk about like your question about deficits and about losing and why can't we do, we're defending Germany, we're defending Japan, we're defending South Korea, we're defending so many countries. We get peanuts, we get nothing. We get -- you know, you're right. We're getting small payment. It's a fraction, a tiny fraction. And I talk -- I -- I say all the time about South Korea. I ordered 4,000 television sets recently for a big project. They all come from South Korea. My only bidder was South Korea except for Sony, which is in Japan, and they lost their way, OK? My only bidder -- whether it's LG or whether it's Samsung. These are wealthy countries. We have 28,000 soldiers on the border of South Korea. So we defend Germany, which is sending cars and everything over there, making it's an economic behemoth. We're defending Japan. So here's the deals that we make. We defend Japan and we have to defend them with our lives. If anybody attacks Japan, we have an agreement. We have to go and attack and fight and die and spend. But if anybody attacks us, Japan doesn't have to do a thing. That's the way we run things. It's not going to happen with me, folks. It's not going to happen with me. And if we're defending people that are far richer than us, they're going to have to pay for it. We want to help them. But why are we defending Germany, why are we defending South Korea, why are we defending Japan and they don't do anything for us? We're going to have great relationships. But why do we pay the costs of defending the world? And you know, when you look at your military budget. Yeah, it -- it's far higher than anybody else's. But you know why it's higher? Because we're defending all these countries, it's not helping us. So we are going to change things around and we're going to make America great again. Believe me. Thank you all very much. Thank you. Thank you."}