{"id":501,"author":"Donald Trump","title":"Speech: Donald Trump in Franklin, TN","date":"2015-10-03","link":"https://factba.se/transcript/donald-trump-speech-franklin-tn-october-3-2015","paragraphs":["So fantastic. Unbelievable. unbelievable. Ah, beautiful.","Thank you, thank you. Thank you, thank you, everybody. That's so nice, thank you. Wow.","It's such a nice feeling, it's crazy what's going on, right? It's crazy. This is incredible. We are going to make our country great again. Unbelievable beautiful .","Thank you, everybody. That's. So nice thank you. Wow, it's such a warm feeling, it's crazy, what's going on, right, it's crazy, you know what it's raining, it's miserable.","There are people outside. I hate to say this maybe thousands, right? Outside and I was just doing a lot of selfies, a woman said I've been here, Mr. Trump in the rain for four hours, could I have a selfie and my people said, no, no, no, I said, absolutely you can. So I'm soaking wet now from standing in the rain, but that's okay, right.","What the hell, what difference does it make? I just want to thank you. I mean this weather and all that's going on it's amazing to have these kinds of crowds and we'll have it -- Oh, my hair looks good, oh, he's, my friend, he's my friend, yeah, looks good. Yeah, it's so -- and it is my hair actually I have to -- you always know if it's gonna be a wise guy reporter when they say it's not, you know then you... You're off to a bad start. But I will tell you, it is such an honor not only here all over the country, what's going on.","We have there's a movement going on here, they're tired, they're tired. I mean I didn't need this. I wanted to -- I would be very happy, honestly, I'd be very happy if Barack Obama were a great president and things were going great. I really would I'd be very happy I'd be very happy you understand when I say that, I love what I'm doing.","I love my business. I built a great company. I have tremendous fans, have thousands and thousands of employees. I've hired tens of thousands of people over the years.","I love doing it. Doral, The Old Post Office on Pennsylvania Avenue, so many buildings and just loving it. But I had to do this, I had to do this, I didn't want to do this. I had to do it.","You know, forty years ago Mitt Romney let us down, and prior to that, John McCain tried hard, but there was a big implosion prior. In all fairness, nobody could have done that I think Abraham Lincoln couldn't have done it at that point. But last time we should have won that election. We should have won that election easily and I backed him big, big league, I backed and I backed John McCain big league, but the last time he's won and I said you know what we're not gonna let that happen again, we're not because we're not gonna lose this time, we're not losing and so many things have taken place that have just gotten worse and you hear, you know, we have almost 100 million people that basically they're out of work and then you hear about we're down to 5.2% It's a totally phoney statistic, so if you look for a job, many people are looking for jobs.","If you look for a job, you can't get it, you stop looking for a little while to recuperate, they consider you employed, okay? This country has tremendous, tremendous problems and we're gonna solve them and you know I actually have been saying it lately over the last few weeks because I see the spirit. I see the great people. These are great people in this room. We went to Dallas, Texas.","The Mark Cuban said you can use the arena that's where the Mavericks play the American Airlines Center. Then I had like three days, I think it was on a Friday or Thursday. We were speaking on a Monday and it was a holiday and I had a few days to fill it up and we filled it up was 20,000 people so quickly in Dallas. We went to Mobile, Alabama, we at 35,000 people, you know, we started at a football arena, you know that we started because we had no choice we're in a hotel 500 seats.","A friend of mine said, from Mobile, is a great guy. He said, could you come down and speak in Mobile, I said yeah, it's great I'll do that. So he had a set up in a hotel, nice hotel, good people and it was 500 seats. He called me about a minute after we announced he said it sold out, so we're gonna move it to the convention center.","Do you mind that held 10,000 and he calls me about three hours later. He said the Convention Center can't hold it it's too big. So they took us to a football stadium, which was beautiful and we had 35,000 people and I was a short just this short little period of time. And then last week you saw that we were in Oklahoma and we had legit 20,000 people, I say more.","We had a band shell and we had a big park in front, a big, big park and it's funny because the Pope was there at the same time and he was in New York and then he was in Philadelphia. And this is crazy. They had helicopters circling over the over Oklahoma when we were speaking. So it's a bandshell thousands of people behind the bandshell.","We couldn't even see. I mean, I said what are they doing? They can't see, but there was no room in the park. So they had the helicopters circling over and it was beautiful to see and they had the helicopters circling over Philadelphia where the Pope was. Now they said the Pope had a million people and I had 20,000 and it looked like I had more, it's crazy.","Crazy. But no matter where we go and it's because it's real. Thank you. Thank you.","Thank you, everybody. So incredible. And you know the reason is that people are just tired of being ripped off we're just being ripped off every single thing, every single thing we don't have victories anymore. We don't win anymore.","We don't win, you know, years ago prior to Vietnam, we never lost a war, right? We never lost the war. Vietnam was a loss, nothing else you can call it. And then after that we now we don't even think about winning. We were losing Iraq, we lose with ISIS, we move, I see a general, the other day being interviewed and they said to him, nice guy.","I don't really want a nice general, you know, generals bring back Patton. This was such a nice guy. I like MacArthur, you know, McArthur in the history of West Point. He had the highest marks, I'm very much into the world of academics, believe it or not, and he had the best marks in the history of it.","You know, I want these guys he gets off his plane with a corncob pipe in the high hat and it says Here I am you mess with me go ahead mess with me, you know it's different. So today they... They're interviewing recently. This general on television. First, we shouldn't be on television doing an interview right, right? You're supposed to be unpredictable I've been using that term.","They said I did this great deal recently and it was a great business deal and my other side and and they were tough, but I beat him and badly and they said they were interviewing this other side and they were nice. They said, you know, we don't like Donald Trump, but I have to tell you is really tough to beat because he's so damn unpredictable. We couldn't predict what his moves were and I said to myself, I didn't even know that I don't think of myself and I said to myself, our country has to be unpredictable. You know how about with like Iraq.","A number of years ago when Obama said we are leaving on whatever date October 1st in one year, we are let. So the enemy says I can't believe it, you know a big part of the enemy is ISIS and all. So they just went away, they said, why should we fight now we'll wait. So the day we leave, they go in and they just knock the hell out of everybody it's, unbelievable, how do you announce it? And frankly, he should have said we're never leaving.","We will destroy them, we are never ever going to leave. I never wanted to get into Iraq. You know, I was the one I'm the only one I didn't want to get in. I said you got to destabilize the Middle East.","Now with that being said, I'm the most military either there's, nobody that will build a bigger, stronger, better military than me. but you have to know when to use it. I hope never to use it. You know, I want it to be so strong nobody's gonna mess with us, they gonna say just leave them.Let's play around let's do this, but... But it's so -- when I -- when I see what we've done, so I said in '03 and '04, there was an article in fact in in Reuters and it was '04, and it said, don't go in, and it's not my normal thing.","Don't go in, usually, I'm the first one in. I don't go into Iraq because you're going to destabilize the entire Middle East because Iraq and Iran were the same thing in terms of power and they fight all the time. They were fighting that's what they do that's, why they fight it and guess what they're gonna be fighting, whether we're there, whether were -- they're gonna fight, that's what they do, they fight, okay.","All right. So they're fighting they're fighting and Syria is gonna be another beauty they'll be there for 29 years, fighting. Everybody fights ever. Lett's rebuild our country, you know, I mean it's time, but I said to him, I said if you go into Iraq, you're, gonna destabilize -- and the White House actually could, because I get a disproportionate amount of publicity, which is true.","In fact, tomorrow I might meet the press and this week with George Stephanopoulos, so we have Chuck Todd, good guy, he likes me much better now. He's looking at my poll numbers and now they all like, everybody likes me now because of what we just had a poll come out, Oh, ah, in well we're 35 or 36 that's high, that's high. Don't forget don't, forget that's with 16 people and I'm not a politician, thank goodness. No, no.","Of course, now I guess I have to say I'm a politician, but I'm certainly not. And yesterday the new poll came out, which is a big one and I was 25, way ahead of everybody. Way, way ahead. And the pundits will say, what's going on? We don't understand, what's going -- they're going crazy, you know, because I'm not in their wheelhouse, they always pick these senators who were worthless.","They pick all of these people. You remember what I was on the stage, and Rick Perry, who was a governor of Texas, with the glasses, you remember? And he was a nice guy, he was such a nice guy, then he became vicious. They all become vicious toward me and they start hitting me hard. I never hit first and they start hitting me and hitting me.","I said, what happened? He was such a nice guy two weeks ago. Well, maybe she just said some -- you're probably right, but he was such a nice guy and then all of a sudden they hit and hit because they need something 'cause, they're going down and they're at 5 % and then they go down to nothing when they hit me, it's the craziest thing, I wish I could sell that power, that's what we have to do to our enemies, right? That's what we have to our enemies . But, but it's been amazing. The polls have just gone up and they've been constantly going up and the press hates to report it.","I mean they hate truth. I don't want to sound like you know, but they Kate to report it. We had a case in think of this Florida, Florida. So you have a governor, Bush, who's in favor of Common Core, by the way, he wants Common Core.","How do you win an election? When you want your children in Tennessee, in South Carolina, in Iowa, in New Hampshire, in every place, educated by bureaucrats from Washington, how do you win? So you have Jeb Bush and you have Marco Rubio. So he's, a sitting senator and the others are governor from Florida and the poll just came out and I'm at 29 or 30 and they're much, much lower, one's at like 14 ones at 11 and I'm at floor while there actually and the new one for I Won't even mention that because that's like an above once at four in the new one, right? So you know, so here's, the headline Rubio surging past, think of this Rubio, who's at like 13, 14 in Florida, I'm at 30. Rubio, at the headline in the paper, will be a surging past Bush I said, damn it, I guess, now it's true I said, I guess I can't be doing too well in Florida 'cause I thought I -- you know, in Florida they love me. I love Florida I'm there a lot it's a great place, beautiful sunshine, but -- but you know what, so it says Rubio surging past Bush in the Florida, Paul, so I say, uh, damn, well, get me the poll, let me see if this is too bad.","I wonder where I am, I wonder how low. So, I'm at 30. So in the second paragraph they said well, Donald Trump is winning and I'm not even in the title and I'm killing these both guys it's crazy, but that's, the press they're very dishonest. I have to say they're very, they are very -- there are some good ones, but they're generally very dishonest.","So now what's happening is this, this is called political speak, which I hate -- I hate I had to sign an application the other day I had it said profession and I said I can't put down the word politician. So I said real estate, I just said, hey, you know, but so we have a situation now which is interesting because Rubio was mentored by Bush, right? We heard that. And everybody, you know, six months ago they said Rubio will never ever run. He won't do it.","And he's loyal to Bush because Bush was older and he was -- the Governor -- Rubio was a younger guy and you know it's the whole thing is so -- Who has better hair, Trump or Rubio? You tell me. Tell me. So that's not a close one. So here's what happens.","So he was, you know, mentored and everybody said, well, he'll never run because we don't know, we know politicians, right, loyalty doesn't mean once by the way, where are the Gatlin's, where the hell are they those guys come here, Larry. Come here before, I'll tell you this crazy story, the second get up here this man just so you understand he's great and all that stuff and he's great with the singing of the voice and he's happily married, but before that, the women used to love him. But he used to live, can you believe it? He used to live in Trump Tower, made a great deal. I sold him a unit and he sold it for much more, which doesn't make me feel too smart.","I feel like some of these guys that they talk about all the time, but I sold him a unit in Trump Tower. He lived there for years and we became friends, he's a really great guy. And I want to thank you because I heard you put on a fantastic show before I got here.","And your brothers, they are friend -- Where are they, Larry? They are great. That will you? Thank them all for me, plays the whole group, what a group. Thank you very much. And here's, a friend of mine who's, a guy he's the New York slicker, would you believe that, huh? So anyway, so with Bush and with Libya, so what happens and very interesting, I said, well, you know, I would say he won't run, but I know how disloyal politicians are and they're all-talk-no-action.","So maybe he'll run, but I don't know who knows. So it ends up that Rubio announces. And then I see Bush and I see Rubio now Bush is absolutely furious. Rubio is, you know, doesn't care about Bush, couldn't care less even though without Bush, maybe he wouldn't be there.","And what happens. And by the way, Rubio is the worst voting record in the United States Senate, hears they go for luck now he says, well, I'm running for it well. But you have other senators running and they do just fine, right, including Ted Cruz and others. But they're doing, you know, they're going back in voting.","So he's there was one, right? But forget that I don't want even mentioned it, pretend I didn't, hey, pretend I didn't say it right, pretend that is. So Rubio, so what happens now I say, but they don't like each other and everyone saying no, no, their dear friends. Then I see Bush and they're asking, well, are you upset with Marco Rubio? You mentored him. I -no.","He's, a dear friend, he's a dear dear friend, that's the politician's bacon. Then they said to Rubio. What do you think of Bush? No, he's a dear, dear friend. I love him very much he's a dear friend and I'm saying to myself, I won't use a bad word, 'cause every time he used a bad word, they say Trump cursed, right? They all say use, please.","I can't. You know the sir is not as good without a little extra emphasis, you know, but I want to do it. Because CNN -- every time I use a bad word, CNN, and ABC that did such a phone, oh, Donald Trump use the bad word, the bad word. You know, the bad word, there was nothing, it was nothing it's what they use every night at home, believe me.","So anyway, so they go. So they go and I'm saying, look at this, look what's happening, they're starting to get and all of a sudden the last week they're really going at it. Folks, I love to watch it, I love to watch it. So now they're going and they don't like, but see it's, it's really politicians, all talk, no action, they talk, talk, I love him very much.","I love him very much. They hate each other be honest, okay. You know one of the reasons we're doing so well. When I heard I heard is that true Bush was down to four in the poll.","Wow, that's, that's, that's a low number, that's a good poll, that's a good that's a good one. That's a big poll that's actually you know it's actually too bad, that's a... That's a big drop. So what happens is there now and they have to go after each other. They don't want to go after me because everybody that's gone after me is down the tube.","So they're not going to do that, they want to wait. They want to be the last man stands to be the last man standing to take on Trump, okay. I look so forward to finding out who I'm ultimately going to face, I look so forward to it. So, you know, we're going to see and it's going to be very interesting, but the world of politics is a different place.","And you know I've always I was the fair-haired, boy, nobody knows more about it than me. They say, what do you know about politics? I've contributed to everybody, Democrats, Republicans, everybody love -- Marsha's here, she loves me, they all love me, everybody because that was my job to be loved. I'm actually one of the -- one of the magazine's said Donald Trump's a world-class businessman, which is a very nice thing. It's true.","I happened to be, but you know what, you have an obligation to your company, to your employees, to your family. You have to get along with everybody. You get along with everybody. But they sort of said, what do you know about politics? I was the fair-haired boy, prior to running, once I ran, I was on like what's he doing, running he's, supposed to be handing money to everybody, he's supposed to giving campaign contributions.","Why is he running? Why? But it was interesting and now I'm becoming a little mainstream because I've been on the top of the polls, how many weeks? The guy who said 4%, he really knows, many weeks, right months actually.","So I've been up there months and actually, they thought two weeks ago the numbers may be slipping. You know I went up here's a great story, I love these stories. Do you like these? So as we can get -- yep, I was interviewed by very nice woman. Savannah Guthrie and I had a really good NBC poll.","I was like a 25 or 26 and I went to 29 now that was NBC I'm being interviewed by NBC. CNN had a poll that I went down two points. Why, do you remember that? And every other poll has gone up, but the NBC was really nice that went up like a nice percentage. I was up almost to 30.","So she said in the CNN poll, I say, women, you saw the interview. I said why can use it you'll, NBC, why usually CNN that you CNN because the poll wasn't quite as good. I was still leading by a lot, right? But the poll isn't good. Now what happens is, so we had the OAN poll, which is, listen to this one almost 35, 35, 35 and that's a great poll that's a very sophisticated poll, you know when I hear 35 and that's 35 with 16 people.","So when I hear 35, you know what I want to do, I want to be one of these countries where they can call for the election the following week, you know, wouldn't that be great? You wait till you have a good week and you say, ladies and gentlemen, we are calling for an election tomorrow, let's see. I wish we could do that. But 35 when you have so many people running is an amazing thing. Do you ever notice the pundits? So I start, and my wife said to me and my daughter, Ivanka, did anyone ever hear of Ivanka? Yes, her shoes, everything, she's great, but my wife and my daughter said, they said, thank you.","My wife and my daughter, they said, you know, if you run you're going to win, I said, why do you say that? Because people really love you, they get tired of these incompetent people. They know you're good at what you do it's interesting, and I didn't really -- you know, I thought about it last time and I didn't do it. I thought about it very seriously. I was leading in the polls last time and I just said you know what and I renewed The Apprentice and they... Top people from actually Comcast and NBC, they came up to my office this year just before I announced and great people.","Steve Burke and Paul led me the head of reality television for NBC. They came up to my office and they wanted me to do more than one more season, seasons. But they put because you know we've been having. We had a great run right, but I'm not allowed if I run for president because of what's called equal time you're not allowed to do a show.","So I said I'm not doing it fellas. I want to make our country great again. I really think I could win and I turned down tremendous, you know, tens of millions of dollars. Why I do that? You know, nobody Mark Burnett called me says, I can't believe you're turning down an extension.","Nobody turns down biggest actors, they don't turn down an extension. I mean, look, who took my place on a Schwarzenegger, he's good, right? I really do. That's not a good sign. I think he's doing, he's a good guy.","So let's say, I mean you never know honestly, you never know how will anybody do when they signed me for The Apprentice. They send me for one season because they figured I'd be on for a few nights and they would fade. And you know, we've had the 15 copies, 15 copies, all of them failed, but they signed me, they didn't have any extension rights. You know why they don't want to waste the ink.","They figured up here and they all said, well, women will never watch. And if you don't have women watching a show, you can't have a success. It can't be successful. Women have to watch because if you don't have the women, they shell ratings, I've become like a ratings maven, okay? I've become the king of ratings.","So I said, I read this one horrible reviewer, nasty guy, he said the show, this is 12 years ago when I first went on, he said The Apprentice willl never be successful because why will women want to watch Donald Trump? Can you believe this? It's very embarrassing. Everybody, my kids look, my daughter, my wife, they all look on that's, so bad if my husband so sad it's so sad, so sad. So we go on the shows number 10, and then number eight, and then number six and then number two, and then number one. And you remember the finale was 28 million people.","It was like the biggest show. I actually wrote that critic back. I said, I want you to take it back, you know, but so, but you never really know what's gonna happen and then it was a success for many years and it was great and they wanted me to extend and I said, I can't do it and they didn't, believe me, so at the up-front, were they announced their programs, they went out and they announced that we are going to renew the apprentice with Donald Trump. They still didn't believe me, I said you don't understand I'm running and they renewed it and actually was confusing because a lot of people that wanted me to run said, what are you doing? They renewed the apprentice, you are doing it and what are you doing? I said I'm not doing it, I'm not doing it.","And then finally, I had to make a decision and I will tell you, a couple of people told me this Mark Cuban told me this. A lot of people told me and Mark's been really nice. And so many people have been nice, but it takes guts to run. It really does.","And I said to my wife, you know, I'm gonna do it and I'll never forget standing on the famous escalator, you know the escalator, right. Remember the scene with Melania in front of me waving very elegantly and Trump coming down, waving less elegantly, but I just took a deep breath and I said, let's go do it let's make this country great because it takes guts, it takes guts. And I'm so glad I did it. But the pundits were all saying, you know, I started off at six then I went to eight, then went to ten, and every week would go up and now I'm leaning by a lot what in one poll I'm leading by 20 points.","And the person that second who happens to be a very good guy, Dr. Carson who's a nice guy, really is a nice guy. But they said Carson, surging and I said, but I'm leading by 20 points. They don't, they never mentioned me it's like an incredible thing, I'm like the invisible man, everybody's surging, you know I'm leading, but everybody's surging.","So you know it's one of those things. But I tell you one thing I'll tell you one thing I'm really glad I did it because I have been received so warmly. I came in with a group of friends from New York actually and they said, Donald, are you nervous making the speech? I said no because there's such love in the rooms, all of them it's not like it's -- it's like it's sort of easy, you know, it's sort of easy. Now they said that and he was asking sits, you know, he's a friend who is a very successful guy.","And he said to me, man, he couldn't, he said he could never do it. He wouldn't sleep for months if you had to do that. And I said, you know it's, funny there's such energy and I mean, in Texas, in Florida, in New Hampshire, the other night we had 4,000 people. It was incredible.","In fact Bush had 100 people, I had four -- No, it's true, 4,000 and CNN covered both. And you couldn't tell the difference because they had it against the wall, we're here with Bush, more and then they go we're here at the Trump too. But they didn't say how many people, it's just so disgusting, but that's, okay. But everybody in the room knows is tremendous energy.","And I said to my friends, I said, you know, when you get up in front of that, many people there's like love, and it's love because they want to see something happen they want to see -- So you know, I'll give you a couple of examples quickies, but you look at the horrible Aranda now we all know it's horrible at 24 hours, but it's not really 24, it's 24 days it's not really 24 days because before you get there, you have to go through a whole process, okay, the one I think is the greatest is self-inspection where Iran does self-inspection, then there's another one where nobody really knows what it means. But if Israel attacks, Iran we're supposed to protect Iran, do you believe this? no, no. Think of it, but I look at it and you know doing The Art of the Deal, if so many people aren't coming in they're all wanting me to sign The At of the Deal and what happens is I look and I see and I see the incompetence and I watch Kerry, he has no clue what he's doing then they would have doubled up the sanctions and sat back for about two weeks. They would have been called and they would have been begging to make a deal, but they don't ask for the hostages they don't ask.","They didn't it wasn't that they didn't get him, they never even asked and they said we didn't want to complicate the deal. Now if it's me I say, listen before we start fellas let's do this. He had four hostages by the way used to be three. Now it's four, they took somebody in the meantime, a journalist, we have one over there because he's, a Christian he's, a pastor, he's, a good guy, I've met his wife twice, she's, terrific she's waiting for her husband to come home.","He did nothing wrong he's a Christian, that's why he's over there? The whole thing is crazy. So listen to this, so I would have said, fellas, before we start, he got four prisoners, meaning three, meaning now fou, you got to do us a favor, get him out, let him out good for you, good for us. Nobody wants them over there. You don't need him, you don't want him there.","In the worst prisons, I hear the worst, the worst places like people can't even imagine they've been there for years now. I would have said you got to get him out, you get him out now, you get him out fast, and you know what they would have done it. Yeah, it's the messenger, somebody else, somebody -- it's true, it's the messenger, I hate to say some, somebody else could say the same words and the answer's no, but I'm a good messenger I'm a very, oh they're not gonna play games with me. Believe me, I guarantee you one thing I guarantee and they're already down to go see because I've said this a number of times, if I win, you know there's a little gap between winning and going in and doing a good job.","If I win, they will be back so fast after that election night, you -- you watch Iran will say, ah, we've decided to release the prisoners, we've decided, I guarantee and I say that and I say that and they're watching and everybody's watching and you have an all these live television, all these cameras back there, but I'm watching and they're watching and let me tell you something, they will be home very quickly after that election. If I win that, I can tell you because Iran knows it's gonna be a whole different ball game, it's gonna be a whole different ballgame. So, so the other day, which was so sad, so they should have been back. The deal was horrible we're giving them $150 billion.","All the other things that you've heard a hundred different times, but we're giving them $150 billion. Now they're going over to Syria to help Russia that the one all said they're a rich nation, they got plenty of ammunition, believe me, and they're smart and they're great negotiators. So I heard the other day not for -- even though we have four, they want to make a deal for three they're going to let three go, but they want 19 people, they want 19 and they want many other things, no don't think of it. So they don't want three for three, four for four, we have four over there, they're not gonna give us three of the four they're gonna give us three of the four and they want 19 and they want as they said and many other things.","How do we take it? No, no that's why? Yeah, that's why these rooms are all packed that's why we have thousands of people standing outside, that's why. You just -- you just -- you just can't take it anymore. You just can't it's so incompetent and we negotiate in good faith and they'll get 12 or 14 or 15 people and we'll give them billions of dollars more and shit have been part of the deal. She's been part of the deal for nothing, zero, should have been part of the deal.","You got a -- you got great people over there. You got great people over there, they're waiting to be released and they don't come out and nobody knows what's going on. But that's the new thing, I heard 19 for three and we're not gonna get the fourth and they want many things beyond the 19 and we're negotiating. It's just sickening to see what's happening, just sickening, alright.","So we'll get off that subject, but it's just you know what it's emblematic of what's happening. Here's a quick weather one Bergdahl, you know Bergdahl, right, traitor, he's, a traitor, Sergeant Bergdahl. So he leaves he deserts, he's a deserter, remember the old days in the old days being deserters. Bob, in the old day's deserters we shot, right.","Well, I knew something was up when I saw his father being interviewed, I said whoa, whoa, whoa. What have we here? Whoa, whoa. Well, it's a whole deal, but anyone that was before I saw Bergdahl, but you know what? So Bergdahl comes out and Bergdahl, he leaves, he deserts, pure and simple.","The generals that went in to interview his group, the people that were with him all knew before they made the deal, that I figured. Maybe they didn't know, they knew that a colonel, they had a general, they interviewed all of these great guys, these great young soldiers. They said he deserted six people were killed, looking for him, right? They went out, they wanted to get him back. They didn't know he deserted at that time.","So they went out. They want to get him back. They were killed six of them. They say five, but it was probably six, young, incredible, courageous people killed, killed, probably killed viciously as bad as it can be.","You can imagine they were killed looking for this guy. So we get them back. Where do we get them back for? We give up five for one, so we get a traitor they get the five guys that they've wanted for 10 years that are right now out on the battlefield trying to kill everybody including us, okay, that's what we get and that's the way we negotiate. We have incompetent people in Washington, we have a president that doesn't have a clue. He doesn't have a clue.","And just to top that one off the other day I'm watching television and I see the newscast that Bergdahl -- Well, he may have some psychological problems and we don't expect that he'll be getting any prison time. Do you believe this? No, do you believe this? No, that and that's why that's what's happening that's and I say this is a movement, you know, they used to use the word, silent majority, and it sort of disappeared and they have different reasons. But we're not even a silent majority, we're like a noisy majority, it's noisy, there's, nothing silent and that's what's happening. All right? A couple of things, and maybe I'm gonna sound as exciting right now because that was really -- I mean, every time I talk about it, I just can't believe what we're doing, I can't believe and it's so big, it's, so important.","Nuclear, so important, we should have made a great deal and we blew it. We had a chance to make -- we had a chance yet we'll get him, don't worry I'll get him. You know, I made a lot of money purposely buying bad contracts for a very little I've had friends that they weren't bad and they had a lot of bad contracts I'd buy that. And I would make a lot of money with bad contracts.","Believe me, it's called to renegotiation it's called beyond renegotiation, we'll get them don't worry we'll be fine, we'll be fine. But God, so we're gonna talk for a couple of seconds about a few other things and maybe we'll take a couple of questions if we can. I don't know it's not set up, but who the hell knows? I have all day. I don't care.","So immigration, when I first announced I took a lot of heat Rush Limbaugh actually said, I have never seen anyone takes so much in coming because I brought up the subject of illegal immigration, illegal immigration. And I said, and I mean it 'cause I'm really good at building things. You got to see what I have in New York and Chicago and different places. That's what I do, I'm building right now, The Old Post Office in Washington believe it or another Pennsylvania Avenue, right near the White House.","Somebody said, will he move into the White House? The answer is yes, okay, yes. Right between Congress, right, between the Capitol and The White House and it's an incredible building, I'm, building Doral and building all this stuff. I know how to build and I hear about the wall. A lot of people agree, you know, about 12 years ago everybody wanted the wall and then listen to this one.","One of the reasons they couldn't build it because they couldn't get their environmental impact statements. Do you believe it's true? I've done a lot of research. They couldn't get environmental impact statements. You know, there was a snail or a daughter or something or a snake that was in the way that was nesting.","There was a snake that was nesting in the area, you know, within 153 feet of the wall, uh, our country what we're doing to ourselves? And Mexico, and Mexico they're friends of mine, they can't believe how stupid we are. They can't believe it, they can't believe it. And not only will we build a wall and it will be a real wall, did you see last week they had a truck going over the wall. They have a little wall it's about this size and they built a ramp, right, and they had a truck loaded up with drugs loaded up with drugs, a pickup.","Didn't even need a strong engine, had the small engine, not the big -- and they had a little ramp going up and down when they have the truck going back and forth like the craziest thing. Now my walls don't work that way, my walls a wall and you know we let's work go to Israel, you'll see that walls work, nobody comes to it. No, no. Walls work.","So we're, gonna build a wall and it's going to be impenetrable, it will be a real wall and we're gonna take care of our Border Patrol people because they are great and they're not allowed to do their job. They're not allowed to do their job. I met with them that's why the white hat does so well, right the white hat that was one. And then when I met in New Yorker and the red hat, no, I was in Iowa with the Red Hat and now the red hats doing so well.","So it's a crazy thing and it says make America great, right, that's what it's all about. But so we're, gonna have, oh, there, it is right there, but we're gonna have a real wall and then they say, oh, the wall can't be built it's too expensive. Well, first of all, in China, the Great Wall of China built 2,000 years ago is 13,000 miles. This one you need really a thousand miles it's almost 2,000, but there are a lot of natural problems.","So you have, Jerusalem's a point, and that's why I say in Israel you have a wall that absolutely works, you talk to them, believe me, it works, and the walls work. If they're properly built, not walls this height that offenses and did you have that you can Sit that he actually break him down and walk right over them, okay. And our Border Patrol's not allowed to do anything and then you have the Anchor babies, you have a woman, she gets pregnant, she's nine months, walks over to the United States has the baby, congratulations. The United States, you take care of that baby for 85 years, okay.","And then -- and then the 14th amendment and then what happens is they also know you can't do that because you'll have to have a constitutional amendment, will take years. It doesn't it doesn't. I turned out to be right. I was a little lucky on this subject, to be honest with you because -- but then the great constitutional said, no, no they're having the baby it's an illegal person having the baby you don't have to do it and we will win in court.","But a simple act, listen to this, this a simple act and we have hundreds of thousands of people coming to the country that way. And I'm not only talking about from South America, from Mexico or Latin America, I'm talking about from China, they come from all over the world. They sit down to have a baby right there and we have them for the next 85 years or hopefully, they live a long time. We have them.","Our country is crazy. Do you know if you want to become a citizen of Mexico, it's virtually impossible, okay? Over here, they just walk in now Mexico, they're too smart. Their leaders are too smart for our leaders, that's all it is they're too smart, they're smart, they're cunning, they're sharp. They send people right through trains, go right through them and nobody gets off no hold.","Nobody, you go right into the United States and then we send them all over the country and we have all sorts of problems. Now we have a problem with a migration and I said I'm -- it's a terrible problem, the migration from Syria and other places, in my opinion. So I'm asked the other day, what do you do what a couple of weeks I said? Well, I guess you got to help you know on a humane basis, you feel badly, right? It's terrible. But then over the last couple of weeks have been watching and I say wow, that's really something because Obama now wants to take you and listen to this one.","You know they were talking about 3,000 and 5,000 and 10,000 it's a lot of people, 200,000, the new number is no, no think of it that's, you know, 200,000 that's like, that's, like an army, you know when you get two. So now I'm looking the other day and other people have noticed too and they're all men it's like where are the women now, not all, but there are mostly men, right? And they're also very strongly men, these are not people. And that first thing I said is these are men, strong, strong men, why did they're back fighting for their country? And then I said and it is true. Take a look when they show of course now the press is gonna show different sections where you know. But -- but no, I mean if you look at a random, you know, as they call it in polling if you random sampling you'll see tremendous numbers of young strong men.","So I don't want to say that's for sure and probably it's not, but that could be ISIS. That could be the enemy. You took it about hundreds of thousands of people coming into this country. We know nothing about them, there's no documentation, there's no papers.","They don't know, as he said, they're already and some are already. And by the way, hate to tell you. But there's, no documentation there's, no paper, they say, yes, I am so-and-so and I'm from Syria. Oh, well come on into the United States.","We have no idea what we're doing. Number one, it will cost billions of dollars to take care of him to get him over. You know, one of the great's I said, I will and I mean this and the reason I say it early because I want people to know and I even want them to know because it's all over the world what I said it was pretty controversial it's all Over the words, they know everybody knows, you know that's. The one thing about today, modern-day communication, I said, if they come in and if I win and somebody's going win win, you know, look I'm running against politicians and they are good at one thing trying to get into office that's about it, no that's it they're not good at anything else, they're not gonna create jobs, no, no they're, not gonna create jobs, they're, not gonna create anything else to put it they're good at talking they're good at getting into office, that's about it and after they get there, they fall asleep for four years or two years or whatever of my paper and that's what's gonna happen and I said, and I said very strong way I said, look, if they come in and if I win they're going back, they're going back they're going back, they're going back.","So ABC television, network, ABC, this reporter all mentions, then he doesn't say the whole thing, you know I give a thing, they could be ISIS they're all... All men. So many men, strong, young men, they go, they leave all that out. They have just one clip. If they come here, they will go back, I look like the worst human being on earth, right? They really it's it's, so unfair, it's, so unfair, but let me just tell you if they come in and if I win, they are going back, they are going back.","Okay, the amazing thing is and you know they have like so many people, so many different lines. They said well, you can't send it back. How would you ever get them back? I said, how did they ever come here? It's, unbelievable. They're talking about bringing them from Syria, so they can bring them, no problem.","We cannot get them back, it's terrible. And what I do like is a safe-zone. I do you take a big area in Syria, there's, plenty of land that's... One thing you have over there is no real estate problem it's, not a lot of people investing in Syria right now.","You get a big piece of land, safe, get a big piece of land, let Germany let all these other countries including the Gulf States, Saudi Arabia, Bahrain, Qatar, unbelievable wealth, by the way, they're not taking anybody, anybody they're not taking anybody. The Gulf states, I have so many friends in the Gulf states, they buy my apartments like crazy, I love them, okay, but there's one, they're not taking anybody. Now we're taking 200 thousand, but the Gulf states, next door, are taking nobody and they're not putting up much Money if any, if any, but what I would say is that you get the Gulf states, Saudi Arabia makes a billion dollars a day. You get the Gulf states, you get Germany because Germany, I mean they she... They're having riots over there.","Now Merkel was strong, now all of a sudden they want to get rid of her that's going to end up in not in a good situation, but you get these countries that are going through hell right now with a migration and they all feel guilty. You get them all to chip-in and you built a safe zone and then ultimately when that whole mess ends, whenever it ends and who knows, it could go on for a long time. But ultimately you let them go back to their homes, you let them go back, where they actually probably want to go. You know, if they probably want to go.","I mean, you know I have -- I have employees that work in different parts of Latin America, South America, Mexico, in parts of Europe that actually are not doing well. And I say what are you gonna do when you retire? Oh, Mr. Trump, I'm going back home. Really? You are -- They'll leave like, great areas.","They want to go back home because it's home, it's very interesting, isn't it? They want to go back home it's, ravaged in some cases, but when they leave their big thing is to go back home, it's very interesting. And these people didn't want to go back home sort of natural, right, it's sort of a natural thing. So we have to help them in that sense, but we don't have to help them where we take them into our country and we are going to give them documentation that's in Arabic we're going to give them all sorts of documentation. The whole thing is just, just crazy, so we're gonna help because we do have a heart, but we can't take them in the country.","Ad there is a... A problem. You could have a Trojan horse situation, you could -- this could be the ultimate Trojan horse. I don't think it is, it probably isn't, but the word probably is unacceptable, right? It's probably, I mean this one could be written about for a long time and you know they know how stupid our leaders are. They know how dumb our leaders are.","So they probably figure, boy, this is going to be easy we'll send a lot of people and a big percentage of them is going to be great fighters and ISIS or whatever enemy it may be because we got plenty between ISIS and Al-Qaeda and all of them. So where big percentage could be that and probably isn't, but it could be. It's not gonna happen, we get them out, okay. And I hope they don't come in.","I hope they don't come in. They shouldn't be allowed to come in, it shouldn't happen, that part of the world has to take care -- We can't take care of everybody. We can't do it . We can't do it.","We just can't do it anymore. We owe $19 trillion. You know last time I was here, I was in Nashville about a month ago, we had an amazing crowd, amazing crowd heroes who was at that event. Yeah, we had a lot of people, but we had an amazing crowd and like today, I mean incredible, and we were talking about 18 trillion and now it's 19 trillion it just goes up.","It's only gone up. And when Obamacare kicks in, which is really in 16, Obama is going to be playing golf on some of my golf courses, I think, okay, hippie guy, he won't care, when Obamacare kicks in, do you see what's happening to your premiums they're going up 40, 50%. You see what's going on when Obamacare kicks in, it's going to be unbelievable for our country, unbelievably bad, so expensive. So we're, gonna repeal Obamacare replace it with something much, much fun, so bad.","But the fact is what 19 trillion, we owe 19 trillion. We owe 1.5 trillion to China can you believe it, they take our jobs, they take our base, they take our money and we owe them one point five trillion. How does that work? I always told a magic act how about Japan. We are Japan the exact same amount.","We are Japan $1.5 trillion, 1.5 trillion. They sell us cars, we send them beef and they send it back. They don't want it. Their farmers don't want it, you know, okay, I blame them.","They want to do their own stuff, what do they want the United States for. So we send cars, the numbers are massively different. We send cars, they cut, they bring these cars over. We send a car over to Tokyo, right, like one Chevrolet, they send it back.","I bet you don't have a Chevrolet in all of Japan. Okay, so they send us, I see boats in Los Angeles, the biggest ships I've ever seen loaded up with cars, load it up from Japan and they're coming up there. Just one. It looks like a highway.","It looks like the Long Island Expressway just pouring out of the ships pouring out. We are them $1.5 trillion I'll think of it. We do this tremendous imbalance and we have a huge imbalance with Japan by close to $70 billion a year. We have almost $400 billion a year imbalance with China, 400 billion.","I mean how stupid are our leaders, how stupid are they? We can't go on that way. Now with China, we open our country, oh, free trade, free trade, it's wonderful, it's wonderful and I'm a free trader. I like free trade. The problem with free trade is you need smart people.","If you don't have smart represented free trade's a disaster. And I have Carl Icahn lined up, you probably heard, Carl's a great business genius and I have -- I have other the biggest, the smartest people, I know all of them. I know the good ones, the bad ones, the overrated ones, the ones that nobody heard that are better than everybody. I have guys lined up and believe me, we'll put them in those rooms gonna be a whole different ballgame, whole different ball game, you know 'cause, you know ultimately it is really a sophisticated it's, a sophisticated chess match, but I have the best people lined up.","I mean, think of it think if we can bring that down a lot and even break even, just break even, you saw there before. Do you know what that does to us? Do you know how that makes us? Essentially you're losing $400 billion a year? Okay? Think what I could do, you know, they all said, I came out with my tax plan and I was gonna read it to you, but you've all heard it right. You've all heard it. But -- but the truth is people said to me, well, I don't know it's a very steep tax cut and it is for the middle class, especially for the middle class.","And they said it's a very steep cut. Can you balance the budget balance, the budget there's so much waste and fraud in Washington when you start cutting... When you start cutting you're gonna balance the budget, believe me, you're gonna balance the budget. So we have that. Then we have our military we're gonna build it up, we're gonna make it great and we are gonna take care of our veterans, our veterans, our veterans.","Our veterans are being treated like third-class citizens, and they're our best people. Our wounded warriors are the greatest, I see them, so I love these are incredible people. They went over there and they've been let down they've been let down by the politicians, the politicians don't have a -- you know, right now Iraq is negotiated just as I said, 2003, 2004 read the articles they wanted me to shut up. I said you make it a mistake, but just as we're talking right now, Iraq is negotiating with Iran to take over.","Iran is gonna merge in with Iraq. I said that was going to happen and Iraq has among the top three oil reserves in the world. Iran is saying thank you, United States we didn't have to fire a shot you're so stupid and nice a LAN is going to take over all of those reserves. They're gonna take over Iraq and Iraq is already going like come on in, come on in.","Please come on in it's, so sad it's so said the level of incompetence you have Syria going and you have Russia in there. Now if you remember Russia, Russia was the Soviet Union, right, and they went into a place called Afghanistan and they went bust it. They went bankrupt, they were fighting it for years. The Afghans are great soldiers, very smart, very smart fact I'm waiting for Obama to give an exact date when he's gonna leave, then doesn't just go away for a little while.","Then they'll come that's what happened in Iraq, we are leaving in 14 months, October 13th, we will be leaving the enemy says, hey, this is great news. Now think of this, by the way, think of this, even if you didn't mean it okay, because think of General Patton Burgher, think about what they're doing, they're spinning and a great -- they can't believe this. Think of Obama said the following: We're never leaving, we're gonna be there forever, forever and we're gonna destroy them and we're gonna do this, and we're, gonna do that, even if he didn't mean it. Then what he said, oh, I've had enough, let's get the hell out of these people are crazy, these people are crazy.","So now we have the same situation and that's gonna be a big bog down that's gonna be bogged down. And I can see already what's gonna happen with Russia and they think it's gonna be easy, it's not going to be easy and Russia doesn't want ISIS. I know they're hitting the other targets right now too, and we're supposed to be fighting, fighting for the rebels, but nobody knows who the rebels are, right. Remember Libya and how bad Qaddafi was and we're gonna fight for the rebels, well, then the rebels killed our ambassador in the worst way.","What happened to him and three other people and many other people, by the way, okay, remember that. Perhaps thanks to Hillary Clinton, correct, correct, correct, but -- but do you remember that and then you have Iraq with Saddam Hussein. I mean he was vicious, he was a violent guy, but you know what, there were no terrorists in Iraq that was that now it's the Harvard University of terrorism that's where they study terrorism right now. Anyway, you had no tell, you know what he used to do to the tears, a one-day trial, I'd shoot him, okay, that was -- and the one-day trial usually lasted about five minutes.","All right, right? You see it there's no terrorism there, there was no -- And remember this, when the World Trade Center came down, they didn't go back to Iraq. You know that, right, the families, the families got deposited on airplanes to go home because the husbands are going to do a great deed, they're gonna knock down the World Trade Center they're going for the Pentagon and they were going for other locations, okay. And you know where they went to another place, correct? They didn't go to Iraq, didn't go to Iraq? So we shouldn't have been in and then the way Obama got us out, we shouldn't a garden now that was the wrong way to get out. We shouldn't have been there and we shouldn't have gotten out the way we got out.","So there are a lot of -- lot of stupid people in Washington it's one of those things. But I just want to tell you that and I was gonna read the plan and I was also gonna read the Second Amendment to you because we have a Second Amendment plan that's great because I was gonna read it. I was gonna do a whole thing and I was gonna come up and read the Second Amendment and we have an incredible policy. You know they all wanted me to do policy and I kept saying needed.","I can -- dare it. I'll start off should I start off, really? So I put in Donald J. Trump, etcetera, etcetera. Protecting our Second Amendment rights, will make America great again and strong again, right.","The Second Amendment to our Constitution is clear. Now, this is in light of what's gone on with Oregon. You know, every time something happens, they blame, they don't blame mental illness that our mental health care is out of whack and all of the other problems. And by the way, it was a gun-free zone.","I will tell you if you had a couple of the teachers or somebody with guns in that room, you would have been a hell of a lot better off... It's really sad and we can say that with respect to a number of places where that happens. But you have a gun how about the military event that took place three or four months ago where you had these highly decorated soldiers in a military area within not allowed. And this one soldier was like one of the highest decorate and they weren't allowed to have the guns and this whack job walks into such hearing them. Why are we having -- why are we having gun-free zones in a military camp? Okay.","So the Second Amendment to our Constitution is clear, the right of the people, to keep and bear arms shall not be infringed upon period, period, period. The Second Amendment guarantees a fundamental right that belongs to all law-abiding Americans, right, I wrote this. The Constitution doesn't create that right, It ensures that the government can't take it away, right? Can't, they're doing all sorts of moves to try and take it away. Our founding fathers knew and our Supreme Court has upheld that.","The Second Amendment purpose is to guarantee our right to defend ourselves and our families. We need that. Like I have a license to carry in New York. Can you believe that? Nobody knows that, somebody attacks, somebody attacks me, oh, they're gonna be shot.","Can you imagine? Somebody says, oh, it is Trump piece easy pickings what do you say? Right? Oh, boy. What was the famous movie? No. Remember, no remember where he went around and he sort of after his wife was hurt so badly and kill. What? I -- Honestly, Yeah, right, it's true, but you have many of them.","You have many of them. Charles Bronson right the late great Charles Bronson name of the movie come on. Death Wish, remember that? Ah, we're gonna cut you up, sir, we're gonna cut you up, uh-huh, B. One of the great movies.","Today you can't make that movie because it's not politically correct, right? It's not politically correct. But could you imagine what Trump? Somebody says, oh, all these big monsters aren't around he's easy pickings and then shoot. So this is about self-defense, plain and simple. It's been said that the Second Amendment is America's first freedom, that's because the right to keep and bear arms protects all of our rights, which is so true we're the only country in the world that has a Second Amendment protecting that freedom is imperative, absolutely imperative.","And I do a whole paper on it. I do a whole paper and it's gotten fantastic reviews, its enforced the laws in the books, it's fix our broken mental health system. All of these people, it's not the guns it's the people that these sick people. Defend the rights of law-abiding and it's important because they're trying to take your rights away, they say we only want a couple of bullets in the magazines.","Maybe you shouldn't have magazines, have a gun that fires one bullet. Have nothing defend the rights of law... Gun owners and that doesn't happen. So we have to do that. They, you know, they have background checks already in place and that was done in 1998 and people slipped through and our government's not doing a great job.","You have a national light to carry and you have the military bases. I mean, when you think about the military bases, so we laid out this policy I'm a very, very big Second Amendment person it's very important to me, it's very, very important.So you know, one other thing I want to say, I met with a lot of ministers and pastors the other day and I brought up one point that has been bothering me for a long time and it's the word Christmas. When kids say -- Do you ever go to a store now? Where it's just Happy Holiday and I say to the owner where -- where is the Christmas, and no, no, we don't do that. We don't do that anymore.","You can't use, you think of it, you can't use Christmas anymore. Okay. I will tell you one thing if I win you're gonna be using Merry Christmas all the time so it's an incredible honor to be here it's incredible to see the kind of numbers you have in this room and way outside. We have speakers set up for them, but it's you know obviously not the same thing, but it's it's an honor that they showed up and they're standing out there in the rain.","But I just want to tell you that we are going to do something special. There's, something special that's happening, there's something special and I see it everywhere. There is something special that's happening and look around at the people that are next to you. And just remember, we are going to do something that's going to surprise the world we're going to win and we're going to turn this around and we're not only going to make America great again, we're going to make it better than ever before and we can do It better than ever before, and I just want to thank you and I love you all.","Thank you. Thank you very much. Thank you. Thank you, everybody.","Thank you."],"text":" So fantastic. Unbelievable. unbelievable. Ah, beautiful. Thank you, thank you. Thank you, thank you, everybody. That's so nice, thank you. Wow. It's such a nice feeling, it's crazy what's going on, right? It's crazy. This is incredible. We are going to make our country great again. Unbelievable beautiful . Thank you, everybody. That's. So nice thank you. Wow, it's such a warm feeling, it's crazy, what's going on, right, it's crazy, you know what it's raining, it's miserable. There are people outside. I hate to say this maybe thousands, right? Outside and I was just doing a lot of selfies, a woman said I've been here, Mr. Trump in the rain for four hours, could I have a selfie and my people said, no, no, no, I said, absolutely you can. So I'm soaking wet now from standing in the rain, but that's okay, right. What the hell, what difference does it make? I just want to thank you. I mean this weather and all that's going on it's amazing to have these kinds of crowds and we'll have it -- Oh, my hair looks good, oh, he's, my friend, he's my friend, yeah, looks good. Yeah, it's so -- and it is my hair actually I have to -- you always know if it's gonna be a wise guy reporter when they say it's not, you know then you... You're off to a bad start. But I will tell you, it is such an honor not only here all over the country, what's going on. We have there's a movement going on here, they're tired, they're tired. I mean I didn't need this. I wanted to -- I would be very happy, honestly, I'd be very happy if Barack Obama were a great president and things were going great. I really would I'd be very happy I'd be very happy you understand when I say that, I love what I'm doing. I love my business. I built a great company. I have tremendous fans, have thousands and thousands of employees. I've hired tens of thousands of people over the years. I love doing it. Doral, The Old Post Office on Pennsylvania Avenue, so many buildings and just loving it. But I had to do this, I had to do this, I didn't want to do this. I had to do it. You know, forty years ago Mitt Romney let us down, and prior to that, John McCain tried hard, but there was a big implosion prior. In all fairness, nobody could have done that I think Abraham Lincoln couldn't have done it at that point. But last time we should have won that election. We should have won that election easily and I backed him big, big league, I backed and I backed John McCain big league, but the last time he's won and I said you know what we're not gonna let that happen again, we're not because we're not gonna lose this time, we're not losing and so many things have taken place that have just gotten worse and you hear, you know, we have almost 100 million people that basically they're out of work and then you hear about we're down to 5.2% It's a totally phoney statistic, so if you look for a job, many people are looking for jobs. If you look for a job, you can't get it, you stop looking for a little while to recuperate, they consider you employed, okay? This country has tremendous, tremendous problems and we're gonna solve them and you know I actually have been saying it lately over the last few weeks because I see the spirit. I see the great people. These are great people in this room. We went to Dallas, Texas. The Mark Cuban said you can use the arena that's where the Mavericks play the American Airlines Center. Then I had like three days, I think it was on a Friday or Thursday. We were speaking on a Monday and it was a holiday and I had a few days to fill it up and we filled it up was 20,000 people so quickly in Dallas. We went to Mobile, Alabama, we at 35,000 people, you know, we started at a football arena, you know that we started because we had no choice we're in a hotel 500 seats. A friend of mine said, from Mobile, is a great guy. He said, could you come down and speak in Mobile, I said yeah, it's great I'll do that. So he had a set up in a hotel, nice hotel, good people and it was 500 seats. He called me about a minute after we announced he said it sold out, so we're gonna move it to the convention center. Do you mind that held 10,000 and he calls me about three hours later. He said the Convention Center can't hold it it's too big. So they took us to a football stadium, which was beautiful and we had 35,000 people and I was a short just this short little period of time. And then last week you saw that we were in Oklahoma and we had legit 20,000 people, I say more. We had a band shell and we had a big park in front, a big, big park and it's funny because the Pope was there at the same time and he was in New York and then he was in Philadelphia. And this is crazy. They had helicopters circling over the over Oklahoma when we were speaking. So it's a bandshell thousands of people behind the bandshell. We couldn't even see. I mean, I said what are they doing? They can't see, but there was no room in the park. So they had the helicopters circling over and it was beautiful to see and they had the helicopters circling over Philadelphia where the Pope was. Now they said the Pope had a million people and I had 20,000 and it looked like I had more, it's crazy. Crazy. But no matter where we go and it's because it's real. Thank you. Thank you. Thank you, everybody. So incredible. And you know the reason is that people are just tired of being ripped off we're just being ripped off every single thing, every single thing we don't have victories anymore. We don't win anymore. We don't win, you know, years ago prior to Vietnam, we never lost a war, right? We never lost the war. Vietnam was a loss, nothing else you can call it. And then after that we now we don't even think about winning. We were losing Iraq, we lose with ISIS, we move, I see a general, the other day being interviewed and they said to him, nice guy. I don't really want a nice general, you know, generals bring back Patton. This was such a nice guy. I like MacArthur, you know, McArthur in the history of West Point. He had the highest marks, I'm very much into the world of academics, believe it or not, and he had the best marks in the history of it. You know, I want these guys he gets off his plane with a corncob pipe in the high hat and it says Here I am you mess with me go ahead mess with me, you know it's different. So today they... They're interviewing recently. This general on television. First, we shouldn't be on television doing an interview right, right? You're supposed to be unpredictable I've been using that term. They said I did this great deal recently and it was a great business deal and my other side and and they were tough, but I beat him and badly and they said they were interviewing this other side and they were nice. They said, you know, we don't like Donald Trump, but I have to tell you is really tough to beat because he's so damn unpredictable. We couldn't predict what his moves were and I said to myself, I didn't even know that I don't think of myself and I said to myself, our country has to be unpredictable. You know how about with like Iraq. A number of years ago when Obama said we are leaving on whatever date October 1st in one year, we are let. So the enemy says I can't believe it, you know a big part of the enemy is ISIS and all. So they just went away, they said, why should we fight now we'll wait. So the day we leave, they go in and they just knock the hell out of everybody it's, unbelievable, how do you announce it? And frankly, he should have said we're never leaving. We will destroy them, we are never ever going to leave. I never wanted to get into Iraq. You know, I was the one I'm the only one I didn't want to get in. I said you got to destabilize the Middle East. Now with that being said, I'm the most military either there's, nobody that will build a bigger, stronger, better military than me. but you have to know when to use it. I hope never to use it. You know, I want it to be so strong nobody's gonna mess with us, they gonna say just leave them.Let's play around let's do this, but... But it's so -- when I -- when I see what we've done, so I said in '03 and '04, there was an article in fact in in Reuters and it was '04, and it said, don't go in, and it's not my normal thing. Don't go in, usually, I'm the first one in. I don't go into Iraq because you're going to destabilize the entire Middle East because Iraq and Iran were the same thing in terms of power and they fight all the time. They were fighting that's what they do that's, why they fight it and guess what they're gonna be fighting, whether we're there, whether were -- they're gonna fight, that's what they do, they fight, okay. All right. So they're fighting they're fighting and Syria is gonna be another beauty they'll be there for 29 years, fighting. Everybody fights ever. Lett's rebuild our country, you know, I mean it's time, but I said to him, I said if you go into Iraq, you're, gonna destabilize -- and the White House actually could, because I get a disproportionate amount of publicity, which is true. In fact, tomorrow I might meet the press and this week with George Stephanopoulos, so we have Chuck Todd, good guy, he likes me much better now. He's looking at my poll numbers and now they all like, everybody likes me now because of what we just had a poll come out, Oh, ah, in well we're 35 or 36 that's high, that's high. Don't forget don't, forget that's with 16 people and I'm not a politician, thank goodness. No, no. Of course, now I guess I have to say I'm a politician, but I'm certainly not. And yesterday the new poll came out, which is a big one and I was 25, way ahead of everybody. Way, way ahead. And the pundits will say, what's going on? We don't understand, what's going -- they're going crazy, you know, because I'm not in their wheelhouse, they always pick these senators who were worthless. They pick all of these people. You remember what I was on the stage, and Rick Perry, who was a governor of Texas, with the glasses, you remember? And he was a nice guy, he was such a nice guy, then he became vicious. They all become vicious toward me and they start hitting me hard. I never hit first and they start hitting me and hitting me. I said, what happened? He was such a nice guy two weeks ago. Well, maybe she just said some -- you're probably right, but he was such a nice guy and then all of a sudden they hit and hit because they need something 'cause, they're going down and they're at 5 % and then they go down to nothing when they hit me, it's the craziest thing, I wish I could sell that power, that's what we have to do to our enemies, right? That's what we have to our enemies . But, but it's been amazing. The polls have just gone up and they've been constantly going up and the press hates to report it. I mean they hate truth. I don't want to sound like you know, but they Kate to report it. We had a case in think of this Florida, Florida. So you have a governor, Bush, who's in favor of Common Core, by the way, he wants Common Core. How do you win an election? When you want your children in Tennessee, in South Carolina, in Iowa, in New Hampshire, in every place, educated by bureaucrats from Washington, how do you win? So you have Jeb Bush and you have Marco Rubio. So he's, a sitting senator and the others are governor from Florida and the poll just came out and I'm at 29 or 30 and they're much, much lower, one's at like 14 ones at 11 and I'm at floor while there actually and the new one for I Won't even mention that because that's like an above once at four in the new one, right? So you know, so here's, the headline Rubio surging past, think of this Rubio, who's at like 13, 14 in Florida, I'm at 30. Rubio, at the headline in the paper, will be a surging past Bush I said, damn it, I guess, now it's true I said, I guess I can't be doing too well in Florida 'cause I thought I -- you know, in Florida they love me. I love Florida I'm there a lot it's a great place, beautiful sunshine, but -- but you know what, so it says Rubio surging past Bush in the Florida, Paul, so I say, uh, damn, well, get me the poll, let me see if this is too bad. I wonder where I am, I wonder how low. So, I'm at 30. So in the second paragraph they said well, Donald Trump is winning and I'm not even in the title and I'm killing these both guys it's crazy, but that's, the press they're very dishonest. I have to say they're very, they are very -- there are some good ones, but they're generally very dishonest. So now what's happening is this, this is called political speak, which I hate -- I hate I had to sign an application the other day I had it said profession and I said I can't put down the word politician. So I said real estate, I just said, hey, you know, but so we have a situation now which is interesting because Rubio was mentored by Bush, right? We heard that. And everybody, you know, six months ago they said Rubio will never ever run. He won't do it. And he's loyal to Bush because Bush was older and he was -- the Governor -- Rubio was a younger guy and you know it's the whole thing is so -- Who has better hair, Trump or Rubio? You tell me. Tell me. So that's not a close one. So here's what happens. So he was, you know, mentored and everybody said, well, he'll never run because we don't know, we know politicians, right, loyalty doesn't mean once by the way, where are the Gatlin's, where the hell are they those guys come here, Larry. Come here before, I'll tell you this crazy story, the second get up here this man just so you understand he's great and all that stuff and he's great with the singing of the voice and he's happily married, but before that, the women used to love him. But he used to live, can you believe it? He used to live in Trump Tower, made a great deal. I sold him a unit and he sold it for much more, which doesn't make me feel too smart. I feel like some of these guys that they talk about all the time, but I sold him a unit in Trump Tower. He lived there for years and we became friends, he's a really great guy. And I want to thank you because I heard you put on a fantastic show before I got here. What he did was he rented this -- the apartment for a nice number and we moved out and he tripled it because I had lived there that's how it worked. That's right and he's right about that. And your brothers, they are friend -- Where are they, Larry? They are great. That will you? Thank them all for me, plays the whole group, what a group. Thank you very much. And here's, a friend of mine who's, a guy he's the New York slicker, would you believe that, huh? So anyway, so with Bush and with Libya, so what happens and very interesting, I said, well, you know, I would say he won't run, but I know how disloyal politicians are and they're all-talk-no-action. So maybe he'll run, but I don't know who knows. So it ends up that Rubio announces. And then I see Bush and I see Rubio now Bush is absolutely furious. Rubio is, you know, doesn't care about Bush, couldn't care less even though without Bush, maybe he wouldn't be there. And what happens. And by the way, Rubio is the worst voting record in the United States Senate, hears they go for luck now he says, well, I'm running for it well. But you have other senators running and they do just fine, right, including Ted Cruz and others. But they're doing, you know, they're going back in voting. So he's there was one, right? But forget that I don't want even mentioned it, pretend I didn't, hey, pretend I didn't say it right, pretend that is. So Rubio, so what happens now I say, but they don't like each other and everyone saying no, no, their dear friends. Then I see Bush and they're asking, well, are you upset with Marco Rubio? You mentored him. I -no. He's, a dear friend, he's a dear dear friend, that's the politician's bacon. Then they said to Rubio. What do you think of Bush? No, he's a dear, dear friend. I love him very much he's a dear friend and I'm saying to myself, I won't use a bad word, 'cause every time he used a bad word, they say Trump cursed, right? They all say use, please. I can't. You know the sir is not as good without a little extra emphasis, you know, but I want to do it. Because CNN -- every time I use a bad word, CNN, and ABC that did such a phone, oh, Donald Trump use the bad word, the bad word. You know, the bad word, there was nothing, it was nothing it's what they use every night at home, believe me. So anyway, so they go. So they go and I'm saying, look at this, look what's happening, they're starting to get and all of a sudden the last week they're really going at it. Folks, I love to watch it, I love to watch it. So now they're going and they don't like, but see it's, it's really politicians, all talk, no action, they talk, talk, I love him very much. I love him very much. They hate each other be honest, okay. You know one of the reasons we're doing so well. When I heard I heard is that true Bush was down to four in the poll. Wow, that's, that's, that's a low number, that's a good poll, that's a good that's a good one. That's a big poll that's actually you know it's actually too bad, that's a... That's a big drop. So what happens is there now and they have to go after each other. They don't want to go after me because everybody that's gone after me is down the tube. So they're not going to do that, they want to wait. They want to be the last man stands to be the last man standing to take on Trump, okay. I look so forward to finding out who I'm ultimately going to face, I look so forward to it. So, you know, we're going to see and it's going to be very interesting, but the world of politics is a different place. And you know I've always I was the fair-haired, boy, nobody knows more about it than me. They say, what do you know about politics? I've contributed to everybody, Democrats, Republicans, everybody love -- Marsha's here, she loves me, they all love me, everybody because that was my job to be loved. I'm actually one of the -- one of the magazine's said Donald Trump's a world-class businessman, which is a very nice thing. It's true. I happened to be, but you know what, you have an obligation to your company, to your employees, to your family. You have to get along with everybody. You get along with everybody. But they sort of said, what do you know about politics? I was the fair-haired boy, prior to running, once I ran, I was on like what's he doing, running he's, supposed to be handing money to everybody, he's supposed to giving campaign contributions. Why is he running? Why? But it was interesting and now I'm becoming a little mainstream because I've been on the top of the polls, how many weeks? The guy who said 4%, he really knows, many weeks, right months actually. So I've been up there months and actually, they thought two weeks ago the numbers may be slipping. You know I went up here's a great story, I love these stories. Do you like these? So as we can get -- yep, I was interviewed by very nice woman. Savannah Guthrie and I had a really good NBC poll. I was like a 25 or 26 and I went to 29 now that was NBC I'm being interviewed by NBC. CNN had a poll that I went down two points. Why, do you remember that? And every other poll has gone up, but the NBC was really nice that went up like a nice percentage. I was up almost to 30. So she said in the CNN poll, I say, women, you saw the interview. I said why can use it you'll, NBC, why usually CNN that you CNN because the poll wasn't quite as good. I was still leading by a lot, right? But the poll isn't good. Now what happens is, so we had the OAN poll, which is, listen to this one almost 35, 35, 35 and that's a great poll that's a very sophisticated poll, you know when I hear 35 and that's 35 with 16 people. So when I hear 35, you know what I want to do, I want to be one of these countries where they can call for the election the following week, you know, wouldn't that be great? You wait till you have a good week and you say, ladies and gentlemen, we are calling for an election tomorrow, let's see. I wish we could do that. But 35 when you have so many people running is an amazing thing. Do you ever notice the pundits? So I start, and my wife said to me and my daughter, Ivanka, did anyone ever hear of Ivanka? Yes, her shoes, everything, she's great, but my wife and my daughter said, they said, thank you. My wife and my daughter, they said, you know, if you run you're going to win, I said, why do you say that? Because people really love you, they get tired of these incompetent people. They know you're good at what you do it's interesting, and I didn't really -- you know, I thought about it last time and I didn't do it. I thought about it very seriously. I was leading in the polls last time and I just said you know what and I renewed The Apprentice and they... Top people from actually Comcast and NBC, they came up to my office this year just before I announced and great people. Steve Burke and Paul led me the head of reality television for NBC. They came up to my office and they wanted me to do more than one more season, seasons. But they put because you know we've been having. We had a great run right, but I'm not allowed if I run for president because of what's called equal time you're not allowed to do a show. So I said I'm not doing it fellas. I want to make our country great again. I really think I could win and I turned down tremendous, you know, tens of millions of dollars. Why I do that? You know, nobody Mark Burnett called me says, I can't believe you're turning down an extension. Nobody turns down biggest actors, they don't turn down an extension. I mean, look, who took my place on a Schwarzenegger, he's good, right? I really do. That's not a good sign. I think he's doing, he's a good guy. So let's say, I mean you never know honestly, you never know how will anybody do when they signed me for The Apprentice. They send me for one season because they figured I'd be on for a few nights and they would fade. And you know, we've had the 15 copies, 15 copies, all of them failed, but they signed me, they didn't have any extension rights. You know why they don't want to waste the ink. They figured up here and they all said, well, women will never watch. And if you don't have women watching a show, you can't have a success. It can't be successful. Women have to watch because if you don't have the women, they shell ratings, I've become like a ratings maven, okay? I've become the king of ratings. So I said, I read this one horrible reviewer, nasty guy, he said the show, this is 12 years ago when I first went on, he said The Apprentice willl never be successful because why will women want to watch Donald Trump? Can you believe this? It's very embarrassing. Everybody, my kids look, my daughter, my wife, they all look on that's, so bad if my husband so sad it's so sad, so sad. So we go on the shows number 10, and then number eight, and then number six and then number two, and then number one. And you remember the finale was 28 million people. It was like the biggest show. I actually wrote that critic back. I said, I want you to take it back, you know, but so, but you never really know what's gonna happen and then it was a success for many years and it was great and they wanted me to extend and I said, I can't do it and they didn't, believe me, so at the up-front, were they announced their programs, they went out and they announced that we are going to renew the apprentice with Donald Trump. They still didn't believe me, I said you don't understand I'm running and they renewed it and actually was confusing because a lot of people that wanted me to run said, what are you doing? They renewed the apprentice, you are doing it and what are you doing? I said I'm not doing it, I'm not doing it. And then finally, I had to make a decision and I will tell you, a couple of people told me this Mark Cuban told me this. A lot of people told me and Mark's been really nice. And so many people have been nice, but it takes guts to run. It really does. And I said to my wife, you know, I'm gonna do it and I'll never forget standing on the famous escalator, you know the escalator, right. Remember the scene with Melania in front of me waving very elegantly and Trump coming down, waving less elegantly, but I just took a deep breath and I said, let's go do it let's make this country great because it takes guts, it takes guts. And I'm so glad I did it. But the pundits were all saying, you know, I started off at six then I went to eight, then went to ten, and every week would go up and now I'm leaning by a lot what in one poll I'm leading by 20 points. And the person that second who happens to be a very good guy, Dr. Carson who's a nice guy, really is a nice guy. But they said Carson, surging and I said, but I'm leading by 20 points. They don't, they never mentioned me it's like an incredible thing, I'm like the invisible man, everybody's surging, you know I'm leading, but everybody's surging. So you know it's one of those things. But I tell you one thing I'll tell you one thing I'm really glad I did it because I have been received so warmly. I came in with a group of friends from New York actually and they said, Donald, are you nervous making the speech? I said no because there's such love in the rooms, all of them it's not like it's -- it's like it's sort of easy, you know, it's sort of easy. Now they said that and he was asking sits, you know, he's a friend who is a very successful guy. And he said to me, man, he couldn't, he said he could never do it. He wouldn't sleep for months if you had to do that. And I said, you know it's, funny there's such energy and I mean, in Texas, in Florida, in New Hampshire, the other night we had 4,000 people. It was incredible. In fact Bush had 100 people, I had four -- No, it's true, 4,000 and CNN covered both. And you couldn't tell the difference because they had it against the wall, we're here with Bush, more and then they go we're here at the Trump too. But they didn't say how many people, it's just so disgusting, but that's, okay. But everybody in the room knows is tremendous energy. And I said to my friends, I said, you know, when you get up in front of that, many people there's like love, and it's love because they want to see something happen they want to see -- So you know, I'll give you a couple of examples quickies, but you look at the horrible Aranda now we all know it's horrible at 24 hours, but it's not really 24, it's 24 days it's not really 24 days because before you get there, you have to go through a whole process, okay, the one I think is the greatest is self-inspection where Iran does self-inspection, then there's another one where nobody really knows what it means. But if Israel attacks, Iran we're supposed to protect Iran, do you believe this? no, no. Think of it, but I look at it and you know doing The Art of the Deal, if so many people aren't coming in they're all wanting me to sign The At of the Deal and what happens is I look and I see and I see the incompetence and I watch Kerry, he has no clue what he's doing then they would have doubled up the sanctions and sat back for about two weeks. They would have been called and they would have been begging to make a deal, but they don't ask for the hostages they don't ask. They didn't it wasn't that they didn't get him, they never even asked and they said we didn't want to complicate the deal. Now if it's me I say, listen before we start fellas let's do this. He had four hostages by the way used to be three. Now it's four, they took somebody in the meantime, a journalist, we have one over there because he's, a Christian he's, a pastor, he's, a good guy, I've met his wife twice, she's, terrific she's waiting for her husband to come home. He did nothing wrong he's a Christian, that's why he's over there? The whole thing is crazy. So listen to this, so I would have said, fellas, before we start, he got four prisoners, meaning three, meaning now fou, you got to do us a favor, get him out, let him out good for you, good for us. Nobody wants them over there. You don't need him, you don't want him there. In the worst prisons, I hear the worst, the worst places like people can't even imagine they've been there for years now. I would have said you got to get him out, you get him out now, you get him out fast, and you know what they would have done it. Yeah, it's the messenger, somebody else, somebody -- it's true, it's the messenger, I hate to say some, somebody else could say the same words and the answer's no, but I'm a good messenger I'm a very, oh they're not gonna play games with me. Believe me, I guarantee you one thing I guarantee and they're already down to go see because I've said this a number of times, if I win, you know there's a little gap between winning and going in and doing a good job. If I win, they will be back so fast after that election night, you -- you watch Iran will say, ah, we've decided to release the prisoners, we've decided, I guarantee and I say that and I say that and they're watching and everybody's watching and you have an all these live television, all these cameras back there, but I'm watching and they're watching and let me tell you something, they will be home very quickly after that election. If I win that, I can tell you because Iran knows it's gonna be a whole different ball game, it's gonna be a whole different ballgame. So, so the other day, which was so sad, so they should have been back. The deal was horrible we're giving them $150 billion. All the other things that you've heard a hundred different times, but we're giving them $150 billion. Now they're going over to Syria to help Russia that the one all said they're a rich nation, they got plenty of ammunition, believe me, and they're smart and they're great negotiators. So I heard the other day not for -- even though we have four, they want to make a deal for three they're going to let three go, but they want 19 people, they want 19 and they want many other things, no don't think of it. So they don't want three for three, four for four, we have four over there, they're not gonna give us three of the four they're gonna give us three of the four and they want 19 and they want as they said and many other things. How do we take it? No, no that's why? Yeah, that's why these rooms are all packed that's why we have thousands of people standing outside, that's why. You just -- you just -- you just can't take it anymore. You just can't it's so incompetent and we negotiate in good faith and they'll get 12 or 14 or 15 people and we'll give them billions of dollars more and shit have been part of the deal. She's been part of the deal for nothing, zero, should have been part of the deal. You got a -- you got great people over there. You got great people over there, they're waiting to be released and they don't come out and nobody knows what's going on. But that's the new thing, I heard 19 for three and we're not gonna get the fourth and they want many things beyond the 19 and we're negotiating. It's just sickening to see what's happening, just sickening, alright. So we'll get off that subject, but it's just you know what it's emblematic of what's happening. Here's a quick weather one Bergdahl, you know Bergdahl, right, traitor, he's, a traitor, Sergeant Bergdahl. So he leaves he deserts, he's a deserter, remember the old days in the old days being deserters. Bob, in the old day's deserters we shot, right. Well, I knew something was up when I saw his father being interviewed, I said whoa, whoa, whoa. What have we here? Whoa, whoa. Well, it's a whole deal, but anyone that was before I saw Bergdahl, but you know what? So Bergdahl comes out and Bergdahl, he leaves, he deserts, pure and simple. The generals that went in to interview his group, the people that were with him all knew before they made the deal, that I figured. Maybe they didn't know, they knew that a colonel, they had a general, they interviewed all of these great guys, these great young soldiers. They said he deserted six people were killed, looking for him, right? They went out, they wanted to get him back. They didn't know he deserted at that time. So they went out. They want to get him back. They were killed six of them. They say five, but it was probably six, young, incredible, courageous people killed, killed, probably killed viciously as bad as it can be. You can imagine they were killed looking for this guy. So we get them back. Where do we get them back for? We give up five for one, so we get a traitor they get the five guys that they've wanted for 10 years that are right now out on the battlefield trying to kill everybody including us, okay, that's what we get and that's the way we negotiate. We have incompetent people in Washington, we have a president that doesn't have a clue. He doesn't have a clue. And just to top that one off the other day I'm watching television and I see the newscast that Bergdahl -- Well, he may have some psychological problems and we don't expect that he'll be getting any prison time. Do you believe this? No, do you believe this? No, that and that's why that's what's happening that's and I say this is a movement, you know, they used to use the word, silent majority, and it sort of disappeared and they have different reasons. But we're not even a silent majority, we're like a noisy majority, it's noisy, there's, nothing silent and that's what's happening. All right? A couple of things, and maybe I'm gonna sound as exciting right now because that was really -- I mean, every time I talk about it, I just can't believe what we're doing, I can't believe and it's so big, it's, so important. Nuclear, so important, we should have made a great deal and we blew it. We had a chance to make -- we had a chance yet we'll get him, don't worry I'll get him. You know, I made a lot of money purposely buying bad contracts for a very little I've had friends that they weren't bad and they had a lot of bad contracts I'd buy that. And I would make a lot of money with bad contracts. Believe me, it's called to renegotiation it's called beyond renegotiation, we'll get them don't worry we'll be fine, we'll be fine. But God, so we're gonna talk for a couple of seconds about a few other things and maybe we'll take a couple of questions if we can. I don't know it's not set up, but who the hell knows? I have all day. I don't care. So immigration, when I first announced I took a lot of heat Rush Limbaugh actually said, I have never seen anyone takes so much in coming because I brought up the subject of illegal immigration, illegal immigration. And I said, and I mean it 'cause I'm really good at building things. You got to see what I have in New York and Chicago and different places. That's what I do, I'm building right now, The Old Post Office in Washington believe it or another Pennsylvania Avenue, right near the White House. Somebody said, will he move into the White House? The answer is yes, okay, yes. Right between Congress, right, between the Capitol and The White House and it's an incredible building, I'm, building Doral and building all this stuff. I know how to build and I hear about the wall. A lot of people agree, you know, about 12 years ago everybody wanted the wall and then listen to this one. One of the reasons they couldn't build it because they couldn't get their environmental impact statements. Do you believe it's true? I've done a lot of research. They couldn't get environmental impact statements. You know, there was a snail or a daughter or something or a snake that was in the way that was nesting. There was a snake that was nesting in the area, you know, within 153 feet of the wall, uh, our country what we're doing to ourselves? And Mexico, and Mexico they're friends of mine, they can't believe how stupid we are. They can't believe it, they can't believe it. And not only will we build a wall and it will be a real wall, did you see last week they had a truck going over the wall. They have a little wall it's about this size and they built a ramp, right, and they had a truck loaded up with drugs loaded up with drugs, a pickup. Didn't even need a strong engine, had the small engine, not the big -- and they had a little ramp going up and down when they have the truck going back and forth like the craziest thing. Now my walls don't work that way, my walls a wall and you know we let's work go to Israel, you'll see that walls work, nobody comes to it. No, no. Walls work. So we're, gonna build a wall and it's going to be impenetrable, it will be a real wall and we're gonna take care of our Border Patrol people because they are great and they're not allowed to do their job. They're not allowed to do their job. I met with them that's why the white hat does so well, right the white hat that was one. And then when I met in New Yorker and the red hat, no, I was in Iowa with the Red Hat and now the red hats doing so well. So it's a crazy thing and it says make America great, right, that's what it's all about. But so we're, gonna have, oh, there, it is right there, but we're gonna have a real wall and then they say, oh, the wall can't be built it's too expensive. Well, first of all, in China, the Great Wall of China built 2,000 years ago is 13,000 miles. This one you need really a thousand miles it's almost 2,000, but there are a lot of natural problems. So you have, Jerusalem's a point, and that's why I say in Israel you have a wall that absolutely works, you talk to them, believe me, it works, and the walls work. If they're properly built, not walls this height that offenses and did you have that you can Sit that he actually break him down and walk right over them, okay. And our Border Patrol's not allowed to do anything and then you have the Anchor babies, you have a woman, she gets pregnant, she's nine months, walks over to the United States has the baby, congratulations. The United States, you take care of that baby for 85 years, okay. And then -- and then the 14th amendment and then what happens is they also know you can't do that because you'll have to have a constitutional amendment, will take years. It doesn't it doesn't. I turned out to be right. I was a little lucky on this subject, to be honest with you because -- but then the great constitutional said, no, no they're having the baby it's an illegal person having the baby you don't have to do it and we will win in court. But a simple act, listen to this, this a simple act and we have hundreds of thousands of people coming to the country that way. And I'm not only talking about from South America, from Mexico or Latin America, I'm talking about from China, they come from all over the world. They sit down to have a baby right there and we have them for the next 85 years or hopefully, they live a long time. We have them. Our country is crazy. Do you know if you want to become a citizen of Mexico, it's virtually impossible, okay? Over here, they just walk in now Mexico, they're too smart. Their leaders are too smart for our leaders, that's all it is they're too smart, they're smart, they're cunning, they're sharp. They send people right through trains, go right through them and nobody gets off no hold. Nobody, you go right into the United States and then we send them all over the country and we have all sorts of problems. Now we have a problem with a migration and I said I'm -- it's a terrible problem, the migration from Syria and other places, in my opinion. So I'm asked the other day, what do you do what a couple of weeks I said? Well, I guess you got to help you know on a humane basis, you feel badly, right? It's terrible. But then over the last couple of weeks have been watching and I say wow, that's really something because Obama now wants to take you and listen to this one. You know they were talking about 3,000 and 5,000 and 10,000 it's a lot of people, 200,000, the new number is no, no think of it that's, you know, 200,000 that's like, that's, like an army, you know when you get two. So now I'm looking the other day and other people have noticed too and they're all men it's like where are the women now, not all, but there are mostly men, right? And they're also very strongly men, these are not people. And that first thing I said is these are men, strong, strong men, why did they're back fighting for their country? And then I said and it is true. Take a look when they show of course now the press is gonna show different sections where you know. But -- but no, I mean if you look at a random, you know, as they call it in polling if you random sampling you'll see tremendous numbers of young strong men. So I don't want to say that's for sure and probably it's not, but that could be ISIS. That could be the enemy. You took it about hundreds of thousands of people coming into this country. We know nothing about them, there's no documentation, there's no papers. They don't know, as he said, they're already and some are already. And by the way, hate to tell you. But there's, no documentation there's, no paper, they say, yes, I am so-and-so and I'm from Syria. Oh, well come on into the United States. We have no idea what we're doing. Number one, it will cost billions of dollars to take care of him to get him over. You know, one of the great's I said, I will and I mean this and the reason I say it early because I want people to know and I even want them to know because it's all over the world what I said it was pretty controversial it's all Over the words, they know everybody knows, you know that's. The one thing about today, modern-day communication, I said, if they come in and if I win and somebody's going win win, you know, look I'm running against politicians and they are good at one thing trying to get into office that's about it, no that's it they're not good at anything else, they're not gonna create jobs, no, no they're, not gonna create jobs, they're, not gonna create anything else to put it they're good at talking they're good at getting into office, that's about it and after they get there, they fall asleep for four years or two years or whatever of my paper and that's what's gonna happen and I said, and I said very strong way I said, look, if they come in and if I win they're going back, they're going back they're going back, they're going back. So ABC television, network, ABC, this reporter all mentions, then he doesn't say the whole thing, you know I give a thing, they could be ISIS they're all... All men. So many men, strong, young men, they go, they leave all that out. They have just one clip. If they come here, they will go back, I look like the worst human being on earth, right? They really it's it's, so unfair, it's, so unfair, but let me just tell you if they come in and if I win, they are going back, they are going back. Okay, the amazing thing is and you know they have like so many people, so many different lines. They said well, you can't send it back. How would you ever get them back? I said, how did they ever come here? It's, unbelievable. They're talking about bringing them from Syria, so they can bring them, no problem. We cannot get them back, it's terrible. And what I do like is a safe-zone. I do you take a big area in Syria, there's, plenty of land that's... One thing you have over there is no real estate problem it's, not a lot of people investing in Syria right now. You get a big piece of land, safe, get a big piece of land, let Germany let all these other countries including the Gulf States, Saudi Arabia, Bahrain, Qatar, unbelievable wealth, by the way, they're not taking anybody, anybody they're not taking anybody. The Gulf states, I have so many friends in the Gulf states, they buy my apartments like crazy, I love them, okay, but there's one, they're not taking anybody. Now we're taking 200 thousand, but the Gulf states, next door, are taking nobody and they're not putting up much Money if any, if any, but what I would say is that you get the Gulf states, Saudi Arabia makes a billion dollars a day. You get the Gulf states, you get Germany because Germany, I mean they she... They're having riots over there. Now Merkel was strong, now all of a sudden they want to get rid of her that's going to end up in not in a good situation, but you get these countries that are going through hell right now with a migration and they all feel guilty. You get them all to chip-in and you built a safe zone and then ultimately when that whole mess ends, whenever it ends and who knows, it could go on for a long time. But ultimately you let them go back to their homes, you let them go back, where they actually probably want to go. You know, if they probably want to go. I mean, you know I have -- I have employees that work in different parts of Latin America, South America, Mexico, in parts of Europe that actually are not doing well. And I say what are you gonna do when you retire? Oh, Mr. Trump, I'm going back home. Really? You are -- They'll leave like, great areas. They want to go back home because it's home, it's very interesting, isn't it? They want to go back home it's, ravaged in some cases, but when they leave their big thing is to go back home, it's very interesting. And these people didn't want to go back home sort of natural, right, it's sort of a natural thing. So we have to help them in that sense, but we don't have to help them where we take them into our country and we are going to give them documentation that's in Arabic we're going to give them all sorts of documentation. The whole thing is just, just crazy, so we're gonna help because we do have a heart, but we can't take them in the country. Ad there is a... A problem. You could have a Trojan horse situation, you could -- this could be the ultimate Trojan horse. I don't think it is, it probably isn't, but the word probably is unacceptable, right? It's probably, I mean this one could be written about for a long time and you know they know how stupid our leaders are. They know how dumb our leaders are. So they probably figure, boy, this is going to be easy we'll send a lot of people and a big percentage of them is going to be great fighters and ISIS or whatever enemy it may be because we got plenty between ISIS and Al-Qaeda and all of them. So where big percentage could be that and probably isn't, but it could be. It's not gonna happen, we get them out, okay. And I hope they don't come in. I hope they don't come in. They shouldn't be allowed to come in, it shouldn't happen, that part of the world has to take care -- We can't take care of everybody. We can't do it . We can't do it. We just can't do it anymore. We owe $19 trillion. You know last time I was here, I was in Nashville about a month ago, we had an amazing crowd, amazing crowd heroes who was at that event. Yeah, we had a lot of people, but we had an amazing crowd and like today, I mean incredible, and we were talking about 18 trillion and now it's 19 trillion it just goes up. It's only gone up. And when Obamacare kicks in, which is really in 16, Obama is going to be playing golf on some of my golf courses, I think, okay, hippie guy, he won't care, when Obamacare kicks in, do you see what's happening to your premiums they're going up 40, 50%. You see what's going on when Obamacare kicks in, it's going to be unbelievable for our country, unbelievably bad, so expensive. So we're, gonna repeal Obamacare replace it with something much, much fun, so bad. But the fact is what 19 trillion, we owe 19 trillion. We owe 1.5 trillion to China can you believe it, they take our jobs, they take our base, they take our money and we owe them one point five trillion. How does that work? I always told a magic act how about Japan. We are Japan the exact same amount. We are Japan $1.5 trillion, 1.5 trillion. They sell us cars, we send them beef and they send it back. They don't want it. Their farmers don't want it, you know, okay, I blame them. They want to do their own stuff, what do they want the United States for. So we send cars, the numbers are massively different. We send cars, they cut, they bring these cars over. We send a car over to Tokyo, right, like one Chevrolet, they send it back. I bet you don't have a Chevrolet in all of Japan. Okay, so they send us, I see boats in Los Angeles, the biggest ships I've ever seen loaded up with cars, load it up from Japan and they're coming up there. Just one. It looks like a highway. It looks like the Long Island Expressway just pouring out of the ships pouring out. We are them $1.5 trillion I'll think of it. We do this tremendous imbalance and we have a huge imbalance with Japan by close to $70 billion a year. We have almost $400 billion a year imbalance with China, 400 billion. I mean how stupid are our leaders, how stupid are they? We can't go on that way. Now with China, we open our country, oh, free trade, free trade, it's wonderful, it's wonderful and I'm a free trader. I like free trade. The problem with free trade is you need smart people. If you don't have smart represented free trade's a disaster. And I have Carl Icahn lined up, you probably heard, Carl's a great business genius and I have -- I have other the biggest, the smartest people, I know all of them. I know the good ones, the bad ones, the overrated ones, the ones that nobody heard that are better than everybody. I have guys lined up and believe me, we'll put them in those rooms gonna be a whole different ballgame, whole different ball game, you know 'cause, you know ultimately it is really a sophisticated it's, a sophisticated chess match, but I have the best people lined up. I mean, think of it think if we can bring that down a lot and even break even, just break even, you saw there before. Do you know what that does to us? Do you know how that makes us? Essentially you're losing $400 billion a year? Okay? Think what I could do, you know, they all said, I came out with my tax plan and I was gonna read it to you, but you've all heard it right. You've all heard it. But -- but the truth is people said to me, well, I don't know it's a very steep tax cut and it is for the middle class, especially for the middle class. And they said it's a very steep cut. Can you balance the budget balance, the budget there's so much waste and fraud in Washington when you start cutting... When you start cutting you're gonna balance the budget, believe me, you're gonna balance the budget. So we have that. Then we have our military we're gonna build it up, we're gonna make it great and we are gonna take care of our veterans, our veterans, our veterans. Our veterans are being treated like third-class citizens, and they're our best people. Our wounded warriors are the greatest, I see them, so I love these are incredible people. They went over there and they've been let down they've been let down by the politicians, the politicians don't have a -- you know, right now Iraq is negotiated just as I said, 2003, 2004 read the articles they wanted me to shut up. I said you make it a mistake, but just as we're talking right now, Iraq is negotiating with Iran to take over. Iran is gonna merge in with Iraq. I said that was going to happen and Iraq has among the top three oil reserves in the world. Iran is saying thank you, United States we didn't have to fire a shot you're so stupid and nice a LAN is going to take over all of those reserves. They're gonna take over Iraq and Iraq is already going like come on in, come on in. Please come on in it's, so sad it's so said the level of incompetence you have Syria going and you have Russia in there. Now if you remember Russia, Russia was the Soviet Union, right, and they went into a place called Afghanistan and they went bust it. They went bankrupt, they were fighting it for years. The Afghans are great soldiers, very smart, very smart fact I'm waiting for Obama to give an exact date when he's gonna leave, then doesn't just go away for a little while. Then they'll come that's what happened in Iraq, we are leaving in 14 months, October 13th, we will be leaving the enemy says, hey, this is great news. Now think of this, by the way, think of this, even if you didn't mean it okay, because think of General Patton Burgher, think about what they're doing, they're spinning and a great -- they can't believe this. Think of Obama said the following: We're never leaving, we're gonna be there forever, forever and we're gonna destroy them and we're gonna do this, and we're, gonna do that, even if he didn't mean it. Then what he said, oh, I've had enough, let's get the hell out of these people are crazy, these people are crazy. So now we have the same situation and that's gonna be a big bog down that's gonna be bogged down. And I can see already what's gonna happen with Russia and they think it's gonna be easy, it's not going to be easy and Russia doesn't want ISIS. I know they're hitting the other targets right now too, and we're supposed to be fighting, fighting for the rebels, but nobody knows who the rebels are, right. Remember Libya and how bad Qaddafi was and we're gonna fight for the rebels, well, then the rebels killed our ambassador in the worst way. What happened to him and three other people and many other people, by the way, okay, remember that. Perhaps thanks to Hillary Clinton, correct, correct, correct, but -- but do you remember that and then you have Iraq with Saddam Hussein. I mean he was vicious, he was a violent guy, but you know what, there were no terrorists in Iraq that was that now it's the Harvard University of terrorism that's where they study terrorism right now. Anyway, you had no tell, you know what he used to do to the tears, a one-day trial, I'd shoot him, okay, that was -- and the one-day trial usually lasted about five minutes. All right, right? You see it there's no terrorism there, there was no -- And remember this, when the World Trade Center came down, they didn't go back to Iraq. You know that, right, the families, the families got deposited on airplanes to go home because the husbands are going to do a great deed, they're gonna knock down the World Trade Center they're going for the Pentagon and they were going for other locations, okay. And you know where they went to another place, correct? They didn't go to Iraq, didn't go to Iraq? So we shouldn't have been in and then the way Obama got us out, we shouldn't a garden now that was the wrong way to get out. We shouldn't have been there and we shouldn't have gotten out the way we got out. So there are a lot of -- lot of stupid people in Washington it's one of those things. But I just want to tell you that and I was gonna read the plan and I was also gonna read the Second Amendment to you because we have a Second Amendment plan that's great because I was gonna read it. I was gonna do a whole thing and I was gonna come up and read the Second Amendment and we have an incredible policy. You know they all wanted me to do policy and I kept saying needed. I can -- dare it. I'll start off should I start off, really? So I put in Donald J. Trump, etcetera, etcetera. Protecting our Second Amendment rights, will make America great again and strong again, right. The Second Amendment to our Constitution is clear. Now, this is in light of what's gone on with Oregon. You know, every time something happens, they blame, they don't blame mental illness that our mental health care is out of whack and all of the other problems. And by the way, it was a gun-free zone. I will tell you if you had a couple of the teachers or somebody with guns in that room, you would have been a hell of a lot better off... It's really sad and we can say that with respect to a number of places where that happens. But you have a gun how about the military event that took place three or four months ago where you had these highly decorated soldiers in a military area within not allowed. And this one soldier was like one of the highest decorate and they weren't allowed to have the guns and this whack job walks into such hearing them. Why are we having -- why are we having gun-free zones in a military camp? Okay. So the Second Amendment to our Constitution is clear, the right of the people, to keep and bear arms shall not be infringed upon period, period, period. The Second Amendment guarantees a fundamental right that belongs to all law-abiding Americans, right, I wrote this. The Constitution doesn't create that right, It ensures that the government can't take it away, right? Can't, they're doing all sorts of moves to try and take it away. Our founding fathers knew and our Supreme Court has upheld that. The Second Amendment purpose is to guarantee our right to defend ourselves and our families. We need that. Like I have a license to carry in New York. Can you believe that? Nobody knows that, somebody attacks, somebody attacks me, oh, they're gonna be shot. Can you imagine? Somebody says, oh, it is Trump piece easy pickings what do you say? Right? Oh, boy. What was the famous movie? No. Remember, no remember where he went around and he sort of after his wife was hurt so badly and kill. What? I -- Honestly, Yeah, right, it's true, but you have many of them. You have many of them. Charles Bronson right the late great Charles Bronson name of the movie come on. Death Wish, remember that? Ah, we're gonna cut you up, sir, we're gonna cut you up, uh-huh, B. One of the great movies. Today you can't make that movie because it's not politically correct, right? It's not politically correct. But could you imagine what Trump? Somebody says, oh, all these big monsters aren't around he's easy pickings and then shoot. So this is about self-defense, plain and simple. It's been said that the Second Amendment is America's first freedom, that's because the right to keep and bear arms protects all of our rights, which is so true we're the only country in the world that has a Second Amendment protecting that freedom is imperative, absolutely imperative. And I do a whole paper on it. I do a whole paper and it's gotten fantastic reviews, its enforced the laws in the books, it's fix our broken mental health system. All of these people, it's not the guns it's the people that these sick people. Defend the rights of law-abiding and it's important because they're trying to take your rights away, they say we only want a couple of bullets in the magazines. Maybe you shouldn't have magazines, have a gun that fires one bullet. Have nothing defend the rights of law... Gun owners and that doesn't happen. So we have to do that. They, you know, they have background checks already in place and that was done in 1998 and people slipped through and our government's not doing a great job. You have a national light to carry and you have the military bases. I mean, when you think about the military bases, so we laid out this policy I'm a very, very big Second Amendment person it's very important to me, it's very, very important.So you know, one other thing I want to say, I met with a lot of ministers and pastors the other day and I brought up one point that has been bothering me for a long time and it's the word Christmas. When kids say -- Do you ever go to a store now? Where it's just Happy Holiday and I say to the owner where -- where is the Christmas, and no, no, we don't do that. We don't do that anymore. You can't use, you think of it, you can't use Christmas anymore. Okay. I will tell you one thing if I win you're gonna be using Merry Christmas all the time so it's an incredible honor to be here it's incredible to see the kind of numbers you have in this room and way outside. We have speakers set up for them, but it's you know obviously not the same thing, but it's it's an honor that they showed up and they're standing out there in the rain. But I just want to tell you that we are going to do something special. There's, something special that's happening, there's something special and I see it everywhere. There is something special that's happening and look around at the people that are next to you. And just remember, we are going to do something that's going to surprise the world we're going to win and we're going to turn this around and we're not only going to make America great again, we're going to make it better than ever before and we can do It better than ever before, and I just want to thank you and I love you all. Thank you. Thank you very much. Thank you. Thank you, everybody. Thank you. "}