{"id":503,"author":"Donald Trump","title":"Speech: Donald Trump in Oklahoma City, OK","date":"2015-09-25","link":"https://factba.se/transcript/donald-trump-speech-oklahoma-city-ok-september-25-2015","paragraphs":["Unbelievable, unbelievable. This is incredible. We are going to make our country great again. We are going to, we are going to.","Thank you very much. We had no idea, they said we're coming to the state fair, and I said I love the people of Oklahoma, we're going to have some fun, but this is a crowd that is massive, that helicopter's all over the place shooting down. Thank you all very much. This is incredible. \"","So, our country doesn't have victories anymore. We don't win, we don't win at anything. Think of it. We don't win with ISIS, we don't win with China, Japan, Mexico.","We don't win with anybody, we don't win and we're going to start winning so much that you're going to be sick and tired of winning you're going to get bored with winning. But you know what? We're going to keep winning anyway, right? Right, right? He knows. We have many difficulties. Our biggest difficulty is our politicians are all talk and no action, all talk, no action, they keep working.","They just want one thing, they want their job renewed every two years or four years. They don't do the job they're, not doing it and they're appointing people that are hacks and we have hacks negotiating against China, negotiating against the greatest countries and the smartest countries in the world. We protect Germany, we protect Germany, Germany is a money machine. It's an economic behemoth and we protect, we get nothing.","We protect Saudi Arabia. With Saudi Arabia, makes a billion dollars a day. We protect it. We protected.","Nothing wrong, but they got to help us out folks. They got to help us out. We have now, if you think about it, a trade deficit with China of almost $400 billion a year and that's what's reported, because if they report that we know it's much more with Japan with the cars that are pouring and they pour in the biggest ships, I've ever seen loaded with cars, we lose $75 billion a year. Think you are, we crazy? Is it crazy? Is it crazy? Mexico, you know, we're going to build and I love Mexico.","I love the Mexican people. I love them. Thousands work for me, thousands. I love Mexico, but we've got to build a wall on the border.","Who's got to we're going to build a wall and we're going to have a door in the world where people that want to come in can come in legally, legally. And we're going to have to do this. But you know a lot of the gangs when you see the gangs all throughout this country, Los Angeles, Chicago, Baltimore. You have a lot of illegal immigrants, bad dudes in those gangs, they're out of here, they're gone, they're gone, they're gone.","You know. I just left New York and we have a gentleman in New York right now. In fact, I'm competing with them and he's very hard to compete with because I like them, might not agree with the global warming stuff so much but that's okay. We have the Pope in New York and you know he really is, he's a unifier.","He wants to bring people together and I think that's a great thing. That's what we have to do. We have to bring people together, the country is divided, the world is divided. We don't get along with anybody, we don't get along with Russia, we don't get along with China, we don't get along with Mexico, we don't get along with anybody, and yet every one of those countries rips us off, takes our money takes our jobs.","We don't know what we're doing. We don't know what we're doing. If I win, I will tell you this when, when, when alright, when, when, how about this, if and when we got to take a little, you know I mean, who knows, don't forget, listen to this. Listen to this, when I first came up with this, you know for years.","I've been thinking about it, especially the last time. Mitt Romney let us down. He let us down something happened to him to last the last month he choked he choked like a golfer, uh, uh, can't sink that last part. We all know, right.","Something happened to him. That was an election that should have been won. And before that, I backed very strongly John McCain, and that was a tough one because, frankly, in all fairness, things weren't going so good for the Republicans then -- and that was a tough one, but we backed became. He didn't make it at all.","We then backed Romney, something happened to him in the end. He stayed in his cabin and I don't know he was building a garage for cars. Did you see that? He was building like this car garage for his luxury cars? He's supposed to be running for office, he got one month, but I backed him. He lost.","I said this time, we're not taking a chance, I'm doing it myself. No more, true, true. So I told people that I might do it and my wife said to me, you know if you actually announced and actually run you're gonna win. I said how do you know? No, how do you know and Ivanka, did anyone ever hear of Ivanka? My daughter, she's great, and Ivanka said the same thing.","So I've Melania, I had Ivanka and they both said, Dad and Darling, I have two of them, one's Darling, one's Dad, right? and they said if you actually run you're going to win, but nobody believes you're going to run. You have this great company, you built, you have a great life. You know it's hard, this running stuff, you're dealing with the press with all those cameras up there, they're all live most of them are live. I'll tell you what, you're dealing with the press and the distortion that they write is so unbelievable.","I mean I can see why people don't want to do it. No, no. I can see, for instance, today I don't know I've heard 15 to 20,000. People have to be, they have people wrapped all around.","I don't know how are the people behind the stage? What are they doing back there? There's thousands of people back there, but they'll say tomorrow, Mr. Trump, do a nice crowd of six or 700 people. Yes, like gotta, be how many people do we have here 2018, something but they'll say we had a thousand people, I mean they really do distort and and they are terrible people not all of them. But many of them -- and I have to say this -- I have to say this -- it's sort of doesn't matter because the one thing I found look at that look.","What this crowd goes to hey cameras. Can you do our us a favor instead of just you know, they'll just pan on me and they won't say. Do me a favor, take the cameras off me and pan the crowd. Okay, go ahead, pan it.","Pan it and be honest, be honest. Go ahead. Pan it. You're not panning it, they don't want to pan it.","They don't want to pan it. Turn those cameras, no, no, turn them all the way back. No, no, turn them all the way back there come on. All right, come on, watch tonight, you won't see anybody.","You'll see me speaking, they always show my head, they don't show what's happening and this is happening all over the place. I go to New Hampshire. I go to Iowa, no matter where I go. I go to South Carolina, no matter where I go.","We have these incredible crowds, something is happening, that's amazing. It's amazing. You know, they used to say, it's the silent majority. Remember the name? They don't use it so much anymore because a lot of the silent majority gave up.","They gave up, we're all the silent majority, but they gave up, they actually gave up and we are not giving up this time. So, interestingly, you know when the pollsters do the polls and I'm leading every poll, I'm leaving every poll. Listen to this one. I'm leading every poll nationwide I'm leaving right and I'm leaving every state, I'm leading I stroke we're leading in Iowa we're leading in New Hampshire, we're leading in South Carolina we're leading everywhere we're leaving in Florida.","How about Florida? Hey, how about, oh we're leaving big in Oklahoma? That's right. Thank you. Did you see that? That's right, we have like 32% in Oklahoma, which is smashing everybody. Thank you.","I love that. I thank you. I'm glad you reminded me, we're leading in Florida, so Florida, here's what you have a governor and you have a sitting senator who's a lightweight by the way, but these are minor detail, but we have a sitting senator from Florida who, by the way, don't show up to vote, he's never showing up. We want people that want to show up.","We want people that are going to make our country great. To that you have to show up, so, so we have a sitting senator we have a governor of Florida and Trump is much higher than both of them. And I'll tell you, I'll tell you here's what happens, so the other day there was an article. Essentially, it said, Bush and Rubio doing well in Florida.","That was the headline. Listen to this, voicing Rubio doing -- Oh. That's too bad. I guess I'm not doing well in Florida, then the first sentence said while Donald Trump is leading by a landslide.","Can you believe it? And they don't put my name in the title, and I'm killing them? So a lot of things are happening and I want you to look around and look at the people you with, because we're going to take our country back we're going to make this country so amazing, we're going to make it amazing. I'll tell you a couple of stories, and I love telling these stories. You know, Nabisco is leaving Chicago. You know that I don't need Oreos anymore.","I don't need them anymore and they're moving to Mexico. Now, we need a border, we need a wall, but I don't mean one of those walls where you go to Home Depot and buy a ladder. It was. I mean a wall, much higher, that's peanuts, that's peanuts.","No, no. No much higher, much higher. The kind that, if they ever do get to the top, you don't get down, they'll, say whoa whoa, whoa, whoa whoa. This is too much I mean I see where they actually on these roads.","Did you see it? The other day was in the paper. They have a wall and they built a ramp for trucks to bring the drugs over. Did you see that they built a ramp on the wall going up? They go up down and they're in the United States. How about, how about this is to me the greatest, and by the way, I found out legally, I'm right, I'm very good legally.","I really do -- I'd done really good, legally. You know I'm really good with that stuff. So, for years I've been hearing that and it's I don't mean Mexico and you just from anywhere a woman is pregnant. She's nine months, she's getting ready to have a baby.","They bring her over to the border. They walked right past our patrols, which, by the way, our border patrols, are great people, but they're not allowed to do the job. I have -- their friends of mine. They stand there like this.","They can't do anything. People walking right in front of them walking right into the country, so they're standing there they're getting ready to have a baby. They go across the border, they have the baby in the United States and we have to pay for that baby for 85 years, okay. Give me a break, give me a break, so everybody said, oh, they can't do anything.","You need a constitutional amendment. Every state has to approve everything, and these are the guys in television, The moron pundits that don't know what they're doing, that by the way all said, I'd never run, I'd, never run, remember they said, he'll never run. Then they said he'll never file his original initial form, where basically it's a one-pager. Were you signing your life away? They said he'll never do that.","So I did that. Then I announced I'm running. They said well what's going on here, this is very confusing. They get paid a fortune to talk on FOXand CNN and MSNBC, and most of them are morons, okay.","So what happens so now they're confused? Then they said, oh, gee, well, he'll never file his financial statement because maybe he's not as rich as people think, so I filed. It was almost a hundred pages long and now they go and check it and the company is not only, is it bigger, it's much bigger, much stronger, a phenomenal company, some of the greatest assets in the world, and I tell you that not in a braggadocious way, because I don't care, it's private, I'm a private company. Nobody knows what I have, but I had a file. I had to open up everything and the company is amazing.","I tell you because that's the kind of mentality you need running this country, that's what you need. You need this kind of a head, whether it's good, bad or indifferent. I don't say I'm the great -- I'd looked at that I'm really good and that's what we need. You know, I had a woman I was with a woman who was a wonderful person at a big group in New Hampshire and she said, Mr.","Trump, I'm voting for you and CNN did a poll and I'm number one in leadership. That's a pretty important thing, right, but I don't mean number one like by a little bit, I mean like by two or three -- it's so much. CNN's back there someplace and they can tell you, but by many times. So, I'm number one on leadership, I'm number one on the economy number one in job-creating, I'm number one on all these categories.","At the one thing I wasn't so good, they said. Is he a nice person? I didn't do as good. I didn't do as good. I mean you know, think.","And this woman stood up she said, you know Mr. Trump I'll tell you, I love you and I'm going to vote for you no matter what, but do you think you're nice enough? Do you think you're nice enough to win? I said, I said, you know what I really think. I'm a nice person. I love people.","I have great friendships. I -- I want to help people, I want to help women with women's health issues. Nobody's going to be able to do it like me, I want to help every, I'm gonna help the country. I'm going to keep the country safe, but I said to her, you know what, this time, people are so fed up.","I don't think they care whether I'm nice or not. I don't think they do. They're, tired, they're, sick and tired of incompetent politicians that make the Iran deal. Think of it.","The Iran deal, which is going -- The Iran deal, forget about deals between countries. This is one of the dumbest contracts I've ever seen of any kind. This was done by extremely stupid people, extremely stupid, and it's very sad, it's very, very sad. So they have 24 days to inspect.","They actually have one of the great clauses of all time. They do some self-inspections. You hear about this one just came up. A couple of weeks they actually self-inspect, Iran is going to self -- Can you believe this? They self-inspect.","Now we have four prisoners. We, it was three, it should have been done before they even started the negotiation, but we have four prisoners. One of them is there because he's a Christian he's, a Christian minister, good guy, his wife is devastated, he's in horrible shape. They won't let him go he's a Christian.","That's why he's there? So we had three, we now have four. So let's say I'm in charge of this negotiation right? Right. The first thing I do is, I say, fellas, you got four prisoners, and this is early when we actually had three, but we're so stupid, so weak, so pathetic. Since then, they took another one, a journalist, so now they have sort of every profession, right, they feel good and they're tweaking us, they're tweaking us.","I would say two years or did you ever see a negotiation, by the way, takes so long? They were not sending rockets to the moon. Did you ever see a negotiation that lasted this long and our chief negotiator decides he wants to be a professional bicycle rider? He goes into a race. No, no, he has the clothing he's got the stickers, he's, got the whole deal and he's going around to turn and he crashes and he breaks his leg, and this is our negotiator. This is our negation so he's out for three weeks, and then he walks in with crutches and the Persians who are great negotiators, by the way, the Iranians, the Persians are known as great, great negotiators.","They look at him like how dumb is this guy he's 73 years old, he falls off a bicycle breaks his leg, and this is our negotiator. I promise you as president. I will never be in a bicycle race. I promise I promise.","I give you my word. So we have a deal and I would say, fellas, you don't need them, you don't want them, we do want them. It would send a great signal to the people of Oklahoma, but it will send a great signal to the people of the United States. Do us a favor, let these four guys go, they're coming, please let them go.","Let him go now you're going to have problems if you don't. We're going to kick your ass, if you don't, let them go, let them go, we want them to go now. You need the right messages because I've seen I've done so many deals. That's what I do The Art of the Deal, that's what I do, whether they liked me or not.","Everybody says I'm really good at that stuff, and you know what, I know the best people in the world. I know the best. I know guys that are overrated. I know people that aren't good, but people think they are.","I know people that you've never heard of that is better than all of them. I got the best in the world. I got Carl Icahn, one of the best. He wants to come in and take China.","I'll give -- I'll say, Carl, congratulations, you take China. Guess what? We win, we win. Right now we have political hacks negotiating it against stuff. That's why we lose almost 400 billion a year.","We have hacks, we have people that don't have a clue so we're going to bring in the best in the world, but I'd say to the Iranians, let him go, let him go now. I don't mean at the end of -- I mean before the negotiations. No, no. Hey, it's too late.","Now, it's too late. So what happens? They don't do it. When John Kerry was asked about it and when President Obama remember he was very upset that they asked him this question. Oh, don't worry, he's only going to be there for a short period now.","We'll bring it back, no we'll bring it back, but when they asked John Kerry and they asked President Obama honestly, they gave this answer, we didn't want to complicate the nuclear negotiation. Is that correct? They didn't want to complicate the negotiation. Now, can you imagine that? What the hell is complicated about saying, fellas, before we start, let our prisoners go, it'll be good for you, it'll be good for us. It'll set a nice tone, tone.","You know, tone. Remember when Bush said to me, I don't like his tone. He's too tough. His tone isn't good, they're cutting off Christians heads.","ISIS is cutting off heads, they're, dunking them and drowning them in cages and Bush says to me and Hillary Clinton said, I don't like Donald Trump's tone, we need tough tone, we need it, it's so sad. I mean, it's so sad. We have people that are just so pathetic. We have people running, some of whom I really respect.","I have to tell you, but some of whom, which is what are they doing? What are they doing? You know every single poll after the debate last week, where, by the way, they had 23 million people, which is the largest in the history of CNN, is that correct CNN? Is that correct? Where the hell is CNN? Twenty-three, they had 23 million people a few weeks before that Fox had 24 million people and the only reason CNN had 23 was they made in an extra hour to sucker the advertisers out of advertising because they sold out their advertising for thousands of percent increase, thousands. They were going to get 4,000 for a 30-second ad. They ended up getting, I think, $250 thousand, all because of me, me, I mean sure as hell isn't because of a guy like a Marco Rubio and these characters, they did it because of me, and they said honestly, all of the news that they also gave me credit. What does it do? What do I get? Hey, if I don't win this thing, what a waste of time.","Okay, what a waste of time. So I tell these people from Iran. I want those prisoners back and we want a deal, and what we should have done is doubled up and tripled up the sanctions they would have called in two days. They would have said, how do we make a deal? Please, please.","Instead, they're dancing in the streets of our end, they think we're the dumbest people on earth, we're giving them $150 billion in order to create terror all over the world. We're fighting them in Yemen and if you think they want to stop at Yemen, but they don't want Yemen, but they want Saudi Arabia because they want the oil, they want the oil, take a look at Yemen, take a look at the border. They want to go into Saudi Arabia, then I get criticized. Listen to this, so every poll, every single poll.","Time Magazine, Grudge, Slate, I think the six or seven of them they have me winning the debate. No, not everyone. Hey. I think I did fine.","I think it did good for every poll. Every single poll, everyone. You know when you call up who did the best right, bing bing, hundreds of thousands of people. They don't want to report that I get on.","I see these characters that were so wrong. Will he run? Oh, no, he's not gonna run. Well now, they're saying oh, he didn't do so well in the debate. I want every poll, I want every poll, then I hear some real lightweight today say well in the last 27 minutes he didn't speak.","You know why, 'cause they didn't ask many questions. You know they ask you a question, you give him an answer right, so I heard one of these real dopes. It actually happens to be Senator Rubio who's got the worst attendance record in all of the Senate. He said Donald Trump didn't answer questions in the last 27 minutes.","They didn't ask me any, they didn't ask me anything, you know it's one thing, they ask you give an answer, but they don't know. I could be rude and I could start jumping all over the place like Carly she's, jumping all over the place. You know I could, but that's not what we need. These people are not going to get you to the promised land.","These are lightweights. These are lightweights. They're not going to get you to the promised land. We need tough, smart negotiators, we have to get our country back.","We have to pay off our 18 trillion, which, by the way, is now $19 trillion. We have to get it paid off. We have to open up oil and gas, that's one of the greatest ways we can do it. No, we have to do it.","We have to do it. By the way, I don't want to break this up this -- this is going good, Where's Willie, where the hell is Willie. Willie get off. Look at this guy.","Look at this guy Willie. Do you love Trump?","You take care of yourself. Willie, everybody, great guy. Now you know I got to know because he was on one of the shows on FOX little while ago, and they said who do you like? I love Trump. I love Trump.","I said I like this guy. You know anybody that likes me, I like, okay, when they like me, call it insecurity, right, but when they like me, I like them, but he's been great and he's a great guy. So we're going to take our country back we're gonna get the greatest negotiators in the world. Let me ask you a little simple question, we have to negotiate with the toughest people in the world.","Smart. Right now we have the head of China in Washington, he's being feted to the most magnificent dinners. He's, uh. It's so sad to watch.","Obama is feeding him. Taking care he's, ripping us off. Be nice, but you gotta negotiate. This isn't about dinner.","This isn't about it. We are going to get the greatest people. Let me give you a couple of things, and some of you have heard me say it, but I love. I love the whole thing I love talking about it.","You know Michigan's having a lot of problems right, they're, losing the automobile industry. Tennessee, a great state. Tennessee was going to have a massive plant there, auto plant, all set to go and Mexico took it away before, right. Front page Wall Street Journal Mexico took it away a little while ago, so they've taken this massive automobile plant Michigan wants plants you want for everybody wants for who doesn't want plants, whether it's automobiles or not.","So this is Ford, so Ford announces they're going to build a two and a half billion dollar plant in Mexico. Okay. Now let me ask you so I was a very good student at the best school, the Wharton School of Finance, great business school, and I really understand this stuff and I'm trying to figure. Let's see, how does that help us they're gonna close factories all over the United States, they're building, who the hell ever heard of a $2 billion, that is a big plan.","You know you're talking about a one-story building for $2.5 billion. This is the building that never stops so they're going to build a two and a half billion. Now here's what happens. Let's say, a guy like a Marco Rubio is president, right, Marco Rubio as president, lightweight he's a lightweight, he doesn't negotiate.","I mean he can't even pay his own credit cards. So let's say Marco Rubio's president or let's say Jeb Bush is president. First of all, no no. First of all, you got to be nice, got to be respectful, see I'm a respectful person, but first of all guys like this, they have packs and those packs are funded by killers, many of whom I know, I used to be one of them.","I used to be I used to be like total establishment. I was a great giver. I give 250 thousand 35 thousand to the governor's associated. I give a lot of money, but let's say that these packs have total control.","Believe me, damn when I say total, you know how about 99% not necessarily thought 99%. Now, when Ford happens and let's say it's a bush, so Ford happens right and he knows it's no good for this country. So let's say he wants to come out and end the deal. He'll severe are in debt to you, I'm not gonna.","Let it happen the following minute, he'll get a call from one of his donors, one of his special interest people that gave millions or from a lobbyist that gave him f$4 million. You know the guys got 150 million. He may have nowhere in the poll, but when you have a nothing in the poll's about five or six or seven, but when you have nothing in the poll, but you have $150 million out there to give yourself ads, that's tough. You know things can happen.","I guess I don't know and then I got accused of being nasty because I called them low energy, but you need high energy people. You need high energy. Okay, so let's say it's for sure, let's say it's Rubio lightweights. Let's say it's, let's say it's Hillary, that's the ultimate lightweight.","No, no, let's say it's Hillary. It could be any one of these honestly. Can I be honest, they're all interchangeable. Nobody knows politicians, nobody knows politicians like Trump they're, all interchangeable and they will all heal.","So let me just tell you so it's them, so somebody calls and they say you know we're not going to let that deal. Thales call up what they'll say, we're not going to let board will call their lobbyists. The lobbyists will call Rubio, Bush, Clinton whatever the hell it is and say, you know, you can't do that. My client gave you $5 million and you know what they're going to do, uh, you're right, you're, right, you're right.","Well, I'm a self-funder, I'm, putting up my own money, okay. And I feel foolish because I'm turning down millions of dollars, I feel like such a jerk. You know it's like it's sort of like the opposite of my life. I'm turning down.","People want to put up millions of dollars, I'm self-funding my campaign, so which is nice, so they call up these guys and these guys end up saying, okay, they can stay in Mexico. Okay, now its President Trump right -- and I say -- and I say I don't like that -- deal with Ford -- I don't like it. That's no good we're taking jobs out of the United States. What the hell are we getting? What are these things? No jobs, no taxes.","No. Nothing, okay, you don't have to go to business school, you don't have to you -- You don't have to know anything? We get nothing. So I would say I don't like that deal and I don't like to deal that they took from Tennessee and by the way, they're going to make cars and trucks and parts and they're going to send them over the border, no tax, zero. They call it free trade.","Now I like free trade, the problem with free trade is, you need smart negotiators on your side when you have stupid people like we do free trades, no good, so good you better off without it. If we're going to continue to lose. Almost 400 billion with China, if we're going to continue to lose 50 billion with Mexico and all these other places, we lose with everybody. What's the purpose, if you have a company, that's losing all that money, you shudder it up.","You say, let's take the walls, and just get out, So what happens is they call me and they say, Mr. President, it's so important that we allow Ford to build in Mexico. I say, really tell me why. They won't be able to explain it.","Trust me. I say no, no, no. I don't want to do that. No and I'll say I want them to move back to the United States I'll say well, we won't do that.","They say we won't do that. I say yes, you will they say we won't. I say here's what's going to happen. We are going to throw a 35% tax on every product, every car, every truck, every single truck that comes into the United States when it attacks you and we're going to tax you at about 35%, which we could do much more by the way China.","You got to see you know, we talk free trade with China, you got to see the taxes, they call them tariffs. It's a tariff sounds a little bit better right. They call it a tariff. You do business with China, they dump their self.","Here we do business. I am friends, they do business with China, they can't number one get their product in and when they do, they pay a fortune in tax. Okay. So that's not free.","That's called dumb trade. I call it dumb tray and I like free trade, but we need smart people so I'll, say you're going to do the following. You are going to pay a 35% he's going to say no, no, no, no we're not going to do that. So that's it.","You're. Gonna do that good luck enjoy your plant in Mexico have a good time with your plant in Mexico. That's the story right, okay. So here's what's going to happen.","Here's what's going to happen within about an hour if they're tough, no wait till the following day, but I don't think so. They will call me and they'll try once more, please Mr... And I'll say no and they'll say. Mr.","President, we've decided that we're gonna build our $2.5 billion plant in the United States. Right? It's, it's easy and I don't need my killers. I don't need my Wall Street geniuses. I don't need all of these great negotiators that will be working for our country, free I'll, be working for our country free.","I don't want any salary. I've already said I turned down my salary. I don't even know what the help the salary is, but I don't want the salary and we're going to have our plant built in the United States. Okay, and it's going to be a beautiful plant and it's going to produce jobs.","And it's going to be just great, so we're going to shore up our border, we're going to do something special with our veterans. Are veterans are treated so bad. You know when I arrived today, I had many veterans greet me. Some were wounded warriors right.","You saw it, you were there, a lot of veterans greeted me and they're desperate for help. These are the greatest people in our country, the wounded warriors. These are the greatest people. These are the greatest.","How they do it. I don't know I don't know. They're getting treated like third-class citizens, the illegal immigrants in Los Angeles who now apply for driver's licenses, 50% of the licenses in Los Angeles go to illegal immigrants. These are people that come over illegally and when I took -- and I will tell you this when I announced him running for president a week -- went by no problem, then all of a sudden somebody said you know, maybe, maybe he said something a little tough.","I did. I said illegal immigration is killing this country. I want legal, I want legal immigration, I want great people to come in. I want legal immigration and I'm going to do great with Hispanics by because most Hispanics, you know in Nevada, they just did a poll I'm leading with Hispanics.","They did another poll recently, I'm leading with the African Americans with a number, that's so big and so much higher than any Republican has shown that if I got that number the elections over nobody reports it and remember this -- remember this about the election, because, ultimately, it's Very important we get somebody that's going to win this done. We've energized the base with Romney there was no energy if the people that's at home and didn't vote for whatever reason they just didn't have the feeling for Romney. Who knows why? I don't know good-looking guy, but nothing else worked. He had to look.","He had nothing else, okay, but they didn't, they weren't energized and millions and millions of people stayed home because people say we have to get the Hispanic vote. We have to get this. The truth is that, if the people that are here tonight with this I mean, this is probably the biggest rally they've ever had here. Would you say this is the record? I think so? So if the people that are here tonight -- and it's all over the country like this, no matter where I go, it's all over the country -- if the people that are here tonight are energized and actually go out and vote you're gonna win, you're going to win And we're going to get a good slice of the Hispanic and, by the way, the Hispanics that are here legally called me and raped me there's a show in New York.","It's a Hispanic show, it's got all calling it and the announcers, a friend of mine, the man who does the show. So I can't believe it all. These people call him. They love you because they're here legally, they don't want people flowing across the border, the Hispanic, but they don't want people falling .","If the people were energized in the last election, Romney would have won, but they weren't energized they're energized. Now we have them energized. Now we have an unbelievably energized, and all you have to do is look behind this big stage and there's thousands of people behind there. They can't see anything.","They can't see. Look at this look at these people dead, real estate. I call it they made a bad deal, they were late, they made a bad deal, you have crime, real estate, but I love them just as much so we are so energized and it's going so good and I tell you what my supporters are so loyal. You know they said, Oh, Trump just blew it he's going to be out, he's going to be out that he just blew it.","He said something I won't go into it because there are somewhat controversial all over. Oh, he did this. He did that. Oh, he's out he's going to be out and then the polls come out and I go up.","Nobody said, oh my god. Oh, sure it's true, I mean four or five occasions because look I'm not politically correct. I don't want to be politically correct. We don't have time, you don't have time to be politically correct.","I was telling you about the Anchor babies and a look I was with -- I was actually in New Hampshire and one of the people standing up there tonight said to me, why do you use the term Anchor baby? I said what term would you use -- and he gave me an eight-word definition -- the children of undocumented workers who happen to be in the United States, pa-pa. I said, no thanks, I'm going to go. Anchor babies, but think of this, think of this. Just think of this, and I turned out to be right, as I was telling you, we don't have to support the law is on our side. Nobody knew that all we need is a simple amendment in Congress and we might not even need that.","Let me tell you we're about the only country they're very few, and people come from Asia and people come from Mexico and from all over South America, Latin America and they come into the United States and they have the baby. Now we take care of that baby 85 years, right, not gonna happen any longer, not gonna happen any -- look not going to happen. So here's what we're going to do. Here's what we're going to do we're going to be so smart, we're going to be so tough.","If you want to be a citizen of Mexico, it's one of the hardest countries in the world to be a citizen of Mexico is almost impossible. I can't be a citizen because they don't like wasps, they don't like white Anglo-Saxon Protestants, I think. They don't want me. I don't think I could become a citizen of Mexico and they love me and they love me.","So Mexico, very tough, most countries very tough. You know why because they're smart, they're smart, so when I gave my speech at Trump Tower, I talked about the crime and everybody said all and Rush Limbaugh who's great. He said nobody, nobody has taken more incoming than Donald Trump and then he goes -- and then he has a news conference and he doubles down and then it turned out. I was talking about illegal immigration and then it turned out.","I'm right you had the problem in San Francisco, beautiful Kate was killed by an illegal immigrant, came into the country. Five times shot her in the back. You had Jameel in Los Angeles. You had a woman three weeks ago, a veteran 66 years old she was raped, she was sodomized and she was killed by an illegal immigrant, and these are thousands of problems.","We're going to straighten it out. We're going to make our country safe we're going to get our jobs back. We're going to stop the drug trafficking over our borders, which is massive, which is massive, we're going to make our military so strong, so strong. Nobody is going to mess with us they're not going to mess with us we're not going to use our military.","You know in 2003, 2004, I said, don't go into wrecked, I'm the most militant person here, I'm the most militaristic person you'll ever meet, I believe in the military strongly, but I didn't want to see us invade Iraq because you have these two countries that are equal. They fight all the time the veterans understand and they're weak, or will we decapitate one? I said you're going to ruin the balance you're going to break it up in the Middle East. That's what happened, and I said if you go back to Reuters 2004 July, I said very simply. I said it's going to take place.","You're going to see Iran take over Iraq, which is happening. We spent $2 trillion. Thousands of lives wounded warriors all over the place, who I love, by the way, all over the place. We got nothing, we don't -- We can't even go there and right now, as you are standing here, Iraq is negotiating with Iran they're gonna merge and Iran is going to get the oil.","Everything that I said and the one that's going to get the rest of it is going to be ISIS. So, after all of that effort and all of that money and all of those lives, we have nothing because we're stupid. We have stupid people, it's not going to happen anymore. It's not going to happen anymore.","When I was asked a question -- and I thought it, I think it's a very fair question, but I don't want to tell, you know, I have a good chance of winning. I mean, I have a good chance of winning, so so when they asked me a question, I don't want to say well, if I were president, I would do this. I would do that. I would go here.","I would attack here, I would hook over here. No, I don't want to do that. I really don't. I don't want them to know what I'm thinking, does that make sense? I want people to be guessing.","I want -- there was a great article about me and recently, and they said in business, I'm very hard to figure out to me. That was a great compliment. It was meant as a compliment that was given by an enemy who I absolutely beat by the way and by the way, I went 60 minutes on Sunday, night, 60 minutes okay. Why? But I don't want people to figure me out.","I don't want people to know what my plan is. I have plans, I have plans, but I don't want to do it. Then they said. Oh, he doesn't know foreign policy.","These people are crazy. They're given everything. If I'm president, I will engage the 6th fleet. I will do this.","I will do that. I will attack Russia in Syria. This is what they say. They want to start World War.","Three office area give me a break. You know Russia. Once you get ISIS right, we want to get ices rushes in Syria. Maybe we should let them do it.","Let them do it the hell. Are we crazy? Are we crazy, so we're gonna be out there, we're gonna run, we're going to win? I really think we're going to win. You are going to be so proud.","Obamacare will be over, we're going to have a much better we're going to have something that's so tremendous, you know, remember the great lie, 27 times a lie. Remember that? your doctor, over and over you'll have your doctor. You have your plan. How about the premiums on Obamacare they're going up 45 and 50% and it doesn't even kick in really till 16 when you have a new president and Obama is going to be out on one of my golf courses playing golf.","I think I'll let him play, right. I mean, why not, but they'll think of it think of it, but we are going to do so many things, we are going to have so many victories. You are going to be so proud of your country, and hopefully you're going to be so proud of your president, we're going to win, win, win and we are going to make our country great again. Thank you, everybody. Thank you."],"text":" Unbelievable, unbelievable. This is incredible. We are going to make our country great again. We are going to, we are going to. Thank you very much. We had no idea, they said we're coming to the state fair, and I said I love the people of Oklahoma, we're going to have some fun, but this is a crowd that is massive, that helicopter's all over the place shooting down. Thank you all very much. This is incredible. \" So, our country doesn't have victories anymore. We don't win, we don't win at anything. Think of it. We don't win with ISIS, we don't win with China, Japan, Mexico. We don't win with anybody, we don't win and we're going to start winning so much that you're going to be sick and tired of winning you're going to get bored with winning. But you know what? We're going to keep winning anyway, right? Right, right? He knows. We have many difficulties. Our biggest difficulty is our politicians are all talk and no action, all talk, no action, they keep working. They just want one thing, they want their job renewed every two years or four years. They don't do the job they're, not doing it and they're appointing people that are hacks and we have hacks negotiating against China, negotiating against the greatest countries and the smartest countries in the world. We protect Germany, we protect Germany, Germany is a money machine. It's an economic behemoth and we protect, we get nothing. We protect Saudi Arabia. With Saudi Arabia, makes a billion dollars a day. We protect it. We protected. Nothing wrong, but they got to help us out folks. They got to help us out. We have now, if you think about it, a trade deficit with China of almost $400 billion a year and that's what's reported, because if they report that we know it's much more with Japan with the cars that are pouring and they pour in the biggest ships, I've ever seen loaded with cars, we lose $75 billion a year. Think you are, we crazy? Is it crazy? Is it crazy? Mexico, you know, we're going to build and I love Mexico. I love the Mexican people. I love them. Thousands work for me, thousands. I love Mexico, but we've got to build a wall on the border. Who's got to we're going to build a wall and we're going to have a door in the world where people that want to come in can come in legally, legally. And we're going to have to do this. But you know a lot of the gangs when you see the gangs all throughout this country, Los Angeles, Chicago, Baltimore. You have a lot of illegal immigrants, bad dudes in those gangs, they're out of here, they're gone, they're gone, they're gone. You know. I just left New York and we have a gentleman in New York right now. In fact, I'm competing with them and he's very hard to compete with because I like them, might not agree with the global warming stuff so much but that's okay. We have the Pope in New York and you know he really is, he's a unifier. He wants to bring people together and I think that's a great thing. That's what we have to do. We have to bring people together, the country is divided, the world is divided. We don't get along with anybody, we don't get along with Russia, we don't get along with China, we don't get along with Mexico, we don't get along with anybody, and yet every one of those countries rips us off, takes our money takes our jobs. We don't know what we're doing. We don't know what we're doing. If I win, I will tell you this when, when, when alright, when, when, how about this, if and when we got to take a little, you know I mean, who knows, don't forget, listen to this. Listen to this, when I first came up with this, you know for years. I've been thinking about it, especially the last time. Mitt Romney let us down. He let us down something happened to him to last the last month he choked he choked like a golfer, uh, uh, can't sink that last part. We all know, right. Something happened to him. That was an election that should have been won. And before that, I backed very strongly John McCain, and that was a tough one because, frankly, in all fairness, things weren't going so good for the Republicans then -- and that was a tough one, but we backed became. He didn't make it at all. We then backed Romney, something happened to him in the end. He stayed in his cabin and I don't know he was building a garage for cars. Did you see that? He was building like this car garage for his luxury cars? He's supposed to be running for office, he got one month, but I backed him. He lost. I said this time, we're not taking a chance, I'm doing it myself. No more, true, true. So I told people that I might do it and my wife said to me, you know if you actually announced and actually run you're gonna win. I said how do you know? No, how do you know and Ivanka, did anyone ever hear of Ivanka? My daughter, she's great, and Ivanka said the same thing. So I've Melania, I had Ivanka and they both said, Dad and Darling, I have two of them, one's Darling, one's Dad, right? and they said if you actually run you're going to win, but nobody believes you're going to run. You have this great company, you built, you have a great life. You know it's hard, this running stuff, you're dealing with the press with all those cameras up there, they're all live most of them are live. I'll tell you what, you're dealing with the press and the distortion that they write is so unbelievable. I mean I can see why people don't want to do it. No, no. I can see, for instance, today I don't know I've heard 15 to 20,000. People have to be, they have people wrapped all around. I don't know how are the people behind the stage? What are they doing back there? There's thousands of people back there, but they'll say tomorrow, Mr. Trump, do a nice crowd of six or 700 people. Yes, like gotta, be how many people do we have here 2018, something but they'll say we had a thousand people, I mean they really do distort and and they are terrible people not all of them. But many of them -- and I have to say this -- I have to say this -- it's sort of doesn't matter because the one thing I found look at that look. What this crowd goes to hey cameras. Can you do our us a favor instead of just you know, they'll just pan on me and they won't say. Do me a favor, take the cameras off me and pan the crowd. Okay, go ahead, pan it. Pan it and be honest, be honest. Go ahead. Pan it. You're not panning it, they don't want to pan it. They don't want to pan it. Turn those cameras, no, no, turn them all the way back. No, no, turn them all the way back there come on. All right, come on, watch tonight, you won't see anybody. You'll see me speaking, they always show my head, they don't show what's happening and this is happening all over the place. I go to New Hampshire. I go to Iowa, no matter where I go. I go to South Carolina, no matter where I go. We have these incredible crowds, something is happening, that's amazing. It's amazing. You know, they used to say, it's the silent majority. Remember the name? They don't use it so much anymore because a lot of the silent majority gave up. They gave up, we're all the silent majority, but they gave up, they actually gave up and we are not giving up this time. So, interestingly, you know when the pollsters do the polls and I'm leading every poll, I'm leaving every poll. Listen to this one. I'm leading every poll nationwide I'm leaving right and I'm leaving every state, I'm leading I stroke we're leading in Iowa we're leading in New Hampshire, we're leading in South Carolina we're leading everywhere we're leaving in Florida. How about Florida? Hey, how about, oh we're leaving big in Oklahoma? That's right. Thank you. Did you see that? That's right, we have like 32% in Oklahoma, which is smashing everybody. Thank you. I love that. I thank you. I'm glad you reminded me, we're leading in Florida, so Florida, here's what you have a governor and you have a sitting senator who's a lightweight by the way, but these are minor detail, but we have a sitting senator from Florida who, by the way, don't show up to vote, he's never showing up. We want people that want to show up. We want people that are going to make our country great. To that you have to show up, so, so we have a sitting senator we have a governor of Florida and Trump is much higher than both of them. And I'll tell you, I'll tell you here's what happens, so the other day there was an article. Essentially, it said, Bush and Rubio doing well in Florida. That was the headline. Listen to this, voicing Rubio doing -- Oh. That's too bad. I guess I'm not doing well in Florida, then the first sentence said while Donald Trump is leading by a landslide. Can you believe it? And they don't put my name in the title, and I'm killing them? So a lot of things are happening and I want you to look around and look at the people you with, because we're going to take our country back we're going to make this country so amazing, we're going to make it amazing. I'll tell you a couple of stories, and I love telling these stories. You know, Nabisco is leaving Chicago. You know that I don't need Oreos anymore. I don't need them anymore and they're moving to Mexico. Now, we need a border, we need a wall, but I don't mean one of those walls where you go to Home Depot and buy a ladder. It was. I mean a wall, much higher, that's peanuts, that's peanuts. No, no. No much higher, much higher. The kind that, if they ever do get to the top, you don't get down, they'll, say whoa whoa, whoa, whoa whoa. This is too much I mean I see where they actually on these roads. Did you see it? The other day was in the paper. They have a wall and they built a ramp for trucks to bring the drugs over. Did you see that they built a ramp on the wall going up? They go up down and they're in the United States. How about, how about this is to me the greatest, and by the way, I found out legally, I'm right, I'm very good legally. I really do -- I'd done really good, legally. You know I'm really good with that stuff. So, for years I've been hearing that and it's I don't mean Mexico and you just from anywhere a woman is pregnant. She's nine months, she's getting ready to have a baby. They bring her over to the border. They walked right past our patrols, which, by the way, our border patrols, are great people, but they're not allowed to do the job. I have -- their friends of mine. They stand there like this. They can't do anything. People walking right in front of them walking right into the country, so they're standing there they're getting ready to have a baby. They go across the border, they have the baby in the United States and we have to pay for that baby for 85 years, okay. Give me a break, give me a break, so everybody said, oh, they can't do anything. You need a constitutional amendment. Every state has to approve everything, and these are the guys in television, The moron pundits that don't know what they're doing, that by the way all said, I'd never run, I'd, never run, remember they said, he'll never run. Then they said he'll never file his original initial form, where basically it's a one-pager. Were you signing your life away? They said he'll never do that. So I did that. Then I announced I'm running. They said well what's going on here, this is very confusing. They get paid a fortune to talk on FOXand CNN and MSNBC, and most of them are morons, okay. So what happens so now they're confused? Then they said, oh, gee, well, he'll never file his financial statement because maybe he's not as rich as people think, so I filed. It was almost a hundred pages long and now they go and check it and the company is not only, is it bigger, it's much bigger, much stronger, a phenomenal company, some of the greatest assets in the world, and I tell you that not in a braggadocious way, because I don't care, it's private, I'm a private company. Nobody knows what I have, but I had a file. I had to open up everything and the company is amazing. I tell you because that's the kind of mentality you need running this country, that's what you need. You need this kind of a head, whether it's good, bad or indifferent. I don't say I'm the great -- I'd looked at that I'm really good and that's what we need. You know, I had a woman I was with a woman who was a wonderful person at a big group in New Hampshire and she said, Mr. Trump, I'm voting for you and CNN did a poll and I'm number one in leadership. That's a pretty important thing, right, but I don't mean number one like by a little bit, I mean like by two or three -- it's so much. CNN's back there someplace and they can tell you, but by many times. So, I'm number one on leadership, I'm number one on the economy number one in job-creating, I'm number one on all these categories. At the one thing I wasn't so good, they said. Is he a nice person? I didn't do as good. I didn't do as good. I mean you know, think. And this woman stood up she said, you know Mr. Trump I'll tell you, I love you and I'm going to vote for you no matter what, but do you think you're nice enough? Do you think you're nice enough to win? I said, I said, you know what I really think. I'm a nice person. I love people. I have great friendships. I -- I want to help people, I want to help women with women's health issues. Nobody's going to be able to do it like me, I want to help every, I'm gonna help the country. I'm going to keep the country safe, but I said to her, you know what, this time, people are so fed up. I don't think they care whether I'm nice or not. I don't think they do. They're, tired, they're, sick and tired of incompetent politicians that make the Iran deal. Think of it. The Iran deal, which is going -- The Iran deal, forget about deals between countries. This is one of the dumbest contracts I've ever seen of any kind. This was done by extremely stupid people, extremely stupid, and it's very sad, it's very, very sad. So they have 24 days to inspect. They actually have one of the great clauses of all time. They do some self-inspections. You hear about this one just came up. A couple of weeks they actually self-inspect, Iran is going to self -- Can you believe this? They self-inspect. Now we have four prisoners. We, it was three, it should have been done before they even started the negotiation, but we have four prisoners. One of them is there because he's a Christian he's, a Christian minister, good guy, his wife is devastated, he's in horrible shape. They won't let him go he's a Christian. That's why he's there? So we had three, we now have four. So let's say I'm in charge of this negotiation right? Right. The first thing I do is, I say, fellas, you got four prisoners, and this is early when we actually had three, but we're so stupid, so weak, so pathetic. Since then, they took another one, a journalist, so now they have sort of every profession, right, they feel good and they're tweaking us, they're tweaking us. I would say two years or did you ever see a negotiation, by the way, takes so long? They were not sending rockets to the moon. Did you ever see a negotiation that lasted this long and our chief negotiator decides he wants to be a professional bicycle rider? He goes into a race. No, no, he has the clothing he's got the stickers, he's, got the whole deal and he's going around to turn and he crashes and he breaks his leg, and this is our negotiator. This is our negation so he's out for three weeks, and then he walks in with crutches and the Persians who are great negotiators, by the way, the Iranians, the Persians are known as great, great negotiators. They look at him like how dumb is this guy he's 73 years old, he falls off a bicycle breaks his leg, and this is our negotiator. I promise you as president. I will never be in a bicycle race. I promise I promise. I give you my word. So we have a deal and I would say, fellas, you don't need them, you don't want them, we do want them. It would send a great signal to the people of Oklahoma, but it will send a great signal to the people of the United States. Do us a favor, let these four guys go, they're coming, please let them go. Let him go now you're going to have problems if you don't. We're going to kick your ass, if you don't, let them go, let them go, we want them to go now. You need the right messages because I've seen I've done so many deals. That's what I do The Art of the Deal, that's what I do, whether they liked me or not. Everybody says I'm really good at that stuff, and you know what, I know the best people in the world. I know the best. I know guys that are overrated. I know people that aren't good, but people think they are. I know people that you've never heard of that is better than all of them. I got the best in the world. I got Carl Icahn, one of the best. He wants to come in and take China. I'll give -- I'll say, Carl, congratulations, you take China. Guess what? We win, we win. Right now we have political hacks negotiating it against stuff. That's why we lose almost 400 billion a year. We have hacks, we have people that don't have a clue so we're going to bring in the best in the world, but I'd say to the Iranians, let him go, let him go now. I don't mean at the end of -- I mean before the negotiations. No, no. Hey, it's too late. Now, it's too late. So what happens? They don't do it. When John Kerry was asked about it and when President Obama remember he was very upset that they asked him this question. Oh, don't worry, he's only going to be there for a short period now. We'll bring it back, no we'll bring it back, but when they asked John Kerry and they asked President Obama honestly, they gave this answer, we didn't want to complicate the nuclear negotiation. Is that correct? They didn't want to complicate the negotiation. Now, can you imagine that? What the hell is complicated about saying, fellas, before we start, let our prisoners go, it'll be good for you, it'll be good for us. It'll set a nice tone, tone. You know, tone. Remember when Bush said to me, I don't like his tone. He's too tough. His tone isn't good, they're cutting off Christians heads. ISIS is cutting off heads, they're, dunking them and drowning them in cages and Bush says to me and Hillary Clinton said, I don't like Donald Trump's tone, we need tough tone, we need it, it's so sad. I mean, it's so sad. We have people that are just so pathetic. We have people running, some of whom I really respect. I have to tell you, but some of whom, which is what are they doing? What are they doing? You know every single poll after the debate last week, where, by the way, they had 23 million people, which is the largest in the history of CNN, is that correct CNN? Is that correct? Where the hell is CNN? Twenty-three, they had 23 million people a few weeks before that Fox had 24 million people and the only reason CNN had 23 was they made in an extra hour to sucker the advertisers out of advertising because they sold out their advertising for thousands of percent increase, thousands. They were going to get 4,000 for a 30-second ad. They ended up getting, I think, $250 thousand, all because of me, me, I mean sure as hell isn't because of a guy like a Marco Rubio and these characters, they did it because of me, and they said honestly, all of the news that they also gave me credit. What does it do? What do I get? Hey, if I don't win this thing, what a waste of time. Okay, what a waste of time. So I tell these people from Iran. I want those prisoners back and we want a deal, and what we should have done is doubled up and tripled up the sanctions they would have called in two days. They would have said, how do we make a deal? Please, please. Instead, they're dancing in the streets of our end, they think we're the dumbest people on earth, we're giving them $150 billion in order to create terror all over the world. We're fighting them in Yemen and if you think they want to stop at Yemen, but they don't want Yemen, but they want Saudi Arabia because they want the oil, they want the oil, take a look at Yemen, take a look at the border. They want to go into Saudi Arabia, then I get criticized. Listen to this, so every poll, every single poll. Time Magazine, Grudge, Slate, I think the six or seven of them they have me winning the debate. No, not everyone. Hey. I think I did fine. I think it did good for every poll. Every single poll, everyone. You know when you call up who did the best right, bing bing, hundreds of thousands of people. They don't want to report that I get on. I see these characters that were so wrong. Will he run? Oh, no, he's not gonna run. Well now, they're saying oh, he didn't do so well in the debate. I want every poll, I want every poll, then I hear some real lightweight today say well in the last 27 minutes he didn't speak. You know why, 'cause they didn't ask many questions. You know they ask you a question, you give him an answer right, so I heard one of these real dopes. It actually happens to be Senator Rubio who's got the worst attendance record in all of the Senate. He said Donald Trump didn't answer questions in the last 27 minutes. They didn't ask me any, they didn't ask me anything, you know it's one thing, they ask you give an answer, but they don't know. I could be rude and I could start jumping all over the place like Carly she's, jumping all over the place. You know I could, but that's not what we need. These people are not going to get you to the promised land. These are lightweights. These are lightweights. They're not going to get you to the promised land. We need tough, smart negotiators, we have to get our country back. We have to pay off our 18 trillion, which, by the way, is now $19 trillion. We have to get it paid off. We have to open up oil and gas, that's one of the greatest ways we can do it. No, we have to do it. We have to do it. By the way, I don't want to break this up this -- this is going good, Where's Willie, where the hell is Willie. Willie get off. Look at this guy. Look at this guy Willie. Do you love Trump? I do like me, some Trump. I got in there. Here's the deal, we're both successful businessmen. We both had pretty big shows on television. We both have wives that are a thousand times better looking than us, so I like okay. You take care of yourself. Willie, everybody, great guy. Now you know I got to know because he was on one of the shows on FOX little while ago, and they said who do you like? I love Trump. I love Trump. I said I like this guy. You know anybody that likes me, I like, okay, when they like me, call it insecurity, right, but when they like me, I like them, but he's been great and he's a great guy. So we're going to take our country back we're gonna get the greatest negotiators in the world. Let me ask you a little simple question, we have to negotiate with the toughest people in the world. Smart. Right now we have the head of China in Washington, he's being feted to the most magnificent dinners. He's, uh. It's so sad to watch. Obama is feeding him. Taking care he's, ripping us off. Be nice, but you gotta negotiate. This isn't about dinner. This isn't about it. We are going to get the greatest people. Let me give you a couple of things, and some of you have heard me say it, but I love. I love the whole thing I love talking about it. You know Michigan's having a lot of problems right, they're, losing the automobile industry. Tennessee, a great state. Tennessee was going to have a massive plant there, auto plant, all set to go and Mexico took it away before, right. Front page Wall Street Journal Mexico took it away a little while ago, so they've taken this massive automobile plant Michigan wants plants you want for everybody wants for who doesn't want plants, whether it's automobiles or not. So this is Ford, so Ford announces they're going to build a two and a half billion dollar plant in Mexico. Okay. Now let me ask you so I was a very good student at the best school, the Wharton School of Finance, great business school, and I really understand this stuff and I'm trying to figure. Let's see, how does that help us they're gonna close factories all over the United States, they're building, who the hell ever heard of a $2 billion, that is a big plan. You know you're talking about a one-story building for $2.5 billion. This is the building that never stops so they're going to build a two and a half billion. Now here's what happens. Let's say, a guy like a Marco Rubio is president, right, Marco Rubio as president, lightweight he's a lightweight, he doesn't negotiate. I mean he can't even pay his own credit cards. So let's say Marco Rubio's president or let's say Jeb Bush is president. First of all, no no. First of all, you got to be nice, got to be respectful, see I'm a respectful person, but first of all guys like this, they have packs and those packs are funded by killers, many of whom I know, I used to be one of them. I used to be I used to be like total establishment. I was a great giver. I give 250 thousand 35 thousand to the governor's associated. I give a lot of money, but let's say that these packs have total control. Believe me, damn when I say total, you know how about 99% not necessarily thought 99%. Now, when Ford happens and let's say it's a bush, so Ford happens right and he knows it's no good for this country. So let's say he wants to come out and end the deal. He'll severe are in debt to you, I'm not gonna. Let it happen the following minute, he'll get a call from one of his donors, one of his special interest people that gave millions or from a lobbyist that gave him f$4 million. You know the guys got 150 million. He may have nowhere in the poll, but when you have a nothing in the poll's about five or six or seven, but when you have nothing in the poll, but you have $150 million out there to give yourself ads, that's tough. You know things can happen. I guess I don't know and then I got accused of being nasty because I called them low energy, but you need high energy people. You need high energy. Okay, so let's say it's for sure, let's say it's Rubio lightweights. Let's say it's, let's say it's Hillary, that's the ultimate lightweight. No, no, let's say it's Hillary. It could be any one of these honestly. Can I be honest, they're all interchangeable. Nobody knows politicians, nobody knows politicians like Trump they're, all interchangeable and they will all heal. So let me just tell you so it's them, so somebody calls and they say you know we're not going to let that deal. Thales call up what they'll say, we're not going to let board will call their lobbyists. The lobbyists will call Rubio, Bush, Clinton whatever the hell it is and say, you know, you can't do that. My client gave you $5 million and you know what they're going to do, uh, you're right, you're, right, you're right. Well, I'm a self-funder, I'm, putting up my own money, okay. And I feel foolish because I'm turning down millions of dollars, I feel like such a jerk. You know it's like it's sort of like the opposite of my life. I'm turning down. People want to put up millions of dollars, I'm self-funding my campaign, so which is nice, so they call up these guys and these guys end up saying, okay, they can stay in Mexico. Okay, now its President Trump right -- and I say -- and I say I don't like that -- deal with Ford -- I don't like it. That's no good we're taking jobs out of the United States. What the hell are we getting? What are these things? No jobs, no taxes. No. Nothing, okay, you don't have to go to business school, you don't have to you -- You don't have to know anything? We get nothing. So I would say I don't like that deal and I don't like to deal that they took from Tennessee and by the way, they're going to make cars and trucks and parts and they're going to send them over the border, no tax, zero. They call it free trade. Now I like free trade, the problem with free trade is, you need smart negotiators on your side when you have stupid people like we do free trades, no good, so good you better off without it. If we're going to continue to lose. Almost 400 billion with China, if we're going to continue to lose 50 billion with Mexico and all these other places, we lose with everybody. What's the purpose, if you have a company, that's losing all that money, you shudder it up. You say, let's take the walls, and just get out, So what happens is they call me and they say, Mr. President, it's so important that we allow Ford to build in Mexico. I say, really tell me why. They won't be able to explain it. Trust me. I say no, no, no. I don't want to do that. No and I'll say I want them to move back to the United States I'll say well, we won't do that. They say we won't do that. I say yes, you will they say we won't. I say here's what's going to happen. We are going to throw a 35% tax on every product, every car, every truck, every single truck that comes into the United States when it attacks you and we're going to tax you at about 35%, which we could do much more by the way China. You got to see you know, we talk free trade with China, you got to see the taxes, they call them tariffs. It's a tariff sounds a little bit better right. They call it a tariff. You do business with China, they dump their self. Here we do business. I am friends, they do business with China, they can't number one get their product in and when they do, they pay a fortune in tax. Okay. So that's not free. That's called dumb trade. I call it dumb tray and I like free trade, but we need smart people so I'll, say you're going to do the following. You are going to pay a 35% he's going to say no, no, no, no we're not going to do that. So that's it. You're. Gonna do that good luck enjoy your plant in Mexico have a good time with your plant in Mexico. That's the story right, okay. So here's what's going to happen. Here's what's going to happen within about an hour if they're tough, no wait till the following day, but I don't think so. They will call me and they'll try once more, please Mr... And I'll say no and they'll say. Mr. President, we've decided that we're gonna build our $2.5 billion plant in the United States. Right? It's, it's easy and I don't need my killers. I don't need my Wall Street geniuses. I don't need all of these great negotiators that will be working for our country, free I'll, be working for our country free. I don't want any salary. I've already said I turned down my salary. I don't even know what the help the salary is, but I don't want the salary and we're going to have our plant built in the United States. Okay, and it's going to be a beautiful plant and it's going to produce jobs. And it's going to be just great, so we're going to shore up our border, we're going to do something special with our veterans. Are veterans are treated so bad. You know when I arrived today, I had many veterans greet me. Some were wounded warriors right. You saw it, you were there, a lot of veterans greeted me and they're desperate for help. These are the greatest people in our country, the wounded warriors. These are the greatest people. These are the greatest. How they do it. I don't know I don't know. They're getting treated like third-class citizens, the illegal immigrants in Los Angeles who now apply for driver's licenses, 50% of the licenses in Los Angeles go to illegal immigrants. These are people that come over illegally and when I took -- and I will tell you this when I announced him running for president a week -- went by no problem, then all of a sudden somebody said you know, maybe, maybe he said something a little tough. I did. I said illegal immigration is killing this country. I want legal, I want legal immigration, I want great people to come in. I want legal immigration and I'm going to do great with Hispanics by because most Hispanics, you know in Nevada, they just did a poll I'm leading with Hispanics. They did another poll recently, I'm leading with the African Americans with a number, that's so big and so much higher than any Republican has shown that if I got that number the elections over nobody reports it and remember this -- remember this about the election, because, ultimately, it's Very important we get somebody that's going to win this done. We've energized the base with Romney there was no energy if the people that's at home and didn't vote for whatever reason they just didn't have the feeling for Romney. Who knows why? I don't know good-looking guy, but nothing else worked. He had to look. He had nothing else, okay, but they didn't, they weren't energized and millions and millions of people stayed home because people say we have to get the Hispanic vote. We have to get this. The truth is that, if the people that are here tonight with this I mean, this is probably the biggest rally they've ever had here. Would you say this is the record? I think so? So if the people that are here tonight -- and it's all over the country like this, no matter where I go, it's all over the country -- if the people that are here tonight are energized and actually go out and vote you're gonna win, you're going to win And we're going to get a good slice of the Hispanic and, by the way, the Hispanics that are here legally called me and raped me there's a show in New York. It's a Hispanic show, it's got all calling it and the announcers, a friend of mine, the man who does the show. So I can't believe it all. These people call him. They love you because they're here legally, they don't want people flowing across the border, the Hispanic, but they don't want people falling . If the people were energized in the last election, Romney would have won, but they weren't energized they're energized. Now we have them energized. Now we have an unbelievably energized, and all you have to do is look behind this big stage and there's thousands of people behind there. They can't see anything. They can't see. Look at this look at these people dead, real estate. I call it they made a bad deal, they were late, they made a bad deal, you have crime, real estate, but I love them just as much so we are so energized and it's going so good and I tell you what my supporters are so loyal. You know they said, Oh, Trump just blew it he's going to be out, he's going to be out that he just blew it. He said something I won't go into it because there are somewhat controversial all over. Oh, he did this. He did that. Oh, he's out he's going to be out and then the polls come out and I go up. Nobody said, oh my god. Oh, sure it's true, I mean four or five occasions because look I'm not politically correct. I don't want to be politically correct. We don't have time, you don't have time to be politically correct. I was telling you about the Anchor babies and a look I was with -- I was actually in New Hampshire and one of the people standing up there tonight said to me, why do you use the term Anchor baby? I said what term would you use -- and he gave me an eight-word definition -- the children of undocumented workers who happen to be in the United States, pa-pa. I said, no thanks, I'm going to go. Anchor babies, but think of this, think of this. Just think of this, and I turned out to be right, as I was telling you, we don't have to support the law is on our side. Nobody knew that all we need is a simple amendment in Congress and we might not even need that. Let me tell you we're about the only country they're very few, and people come from Asia and people come from Mexico and from all over South America, Latin America and they come into the United States and they have the baby. Now we take care of that baby 85 years, right, not gonna happen any longer, not gonna happen any -- look not going to happen. So here's what we're going to do. Here's what we're going to do we're going to be so smart, we're going to be so tough. If you want to be a citizen of Mexico, it's one of the hardest countries in the world to be a citizen of Mexico is almost impossible. I can't be a citizen because they don't like wasps, they don't like white Anglo-Saxon Protestants, I think. They don't want me. I don't think I could become a citizen of Mexico and they love me and they love me. So Mexico, very tough, most countries very tough. You know why because they're smart, they're smart, so when I gave my speech at Trump Tower, I talked about the crime and everybody said all and Rush Limbaugh who's great. He said nobody, nobody has taken more incoming than Donald Trump and then he goes -- and then he has a news conference and he doubles down and then it turned out. I was talking about illegal immigration and then it turned out. I'm right you had the problem in San Francisco, beautiful Kate was killed by an illegal immigrant, came into the country. Five times shot her in the back. You had Jameel in Los Angeles. You had a woman three weeks ago, a veteran 66 years old she was raped, she was sodomized and she was killed by an illegal immigrant, and these are thousands of problems. We're going to straighten it out. We're going to make our country safe we're going to get our jobs back. We're going to stop the drug trafficking over our borders, which is massive, which is massive, we're going to make our military so strong, so strong. Nobody is going to mess with us they're not going to mess with us we're not going to use our military. You know in 2003, 2004, I said, don't go into wrecked, I'm the most militant person here, I'm the most militaristic person you'll ever meet, I believe in the military strongly, but I didn't want to see us invade Iraq because you have these two countries that are equal. They fight all the time the veterans understand and they're weak, or will we decapitate one? I said you're going to ruin the balance you're going to break it up in the Middle East. That's what happened, and I said if you go back to Reuters 2004 July, I said very simply. I said it's going to take place. You're going to see Iran take over Iraq, which is happening. We spent $2 trillion. Thousands of lives wounded warriors all over the place, who I love, by the way, all over the place. We got nothing, we don't -- We can't even go there and right now, as you are standing here, Iraq is negotiating with Iran they're gonna merge and Iran is going to get the oil. Everything that I said and the one that's going to get the rest of it is going to be ISIS. So, after all of that effort and all of that money and all of those lives, we have nothing because we're stupid. We have stupid people, it's not going to happen anymore. It's not going to happen anymore. When I was asked a question -- and I thought it, I think it's a very fair question, but I don't want to tell, you know, I have a good chance of winning. I mean, I have a good chance of winning, so so when they asked me a question, I don't want to say well, if I were president, I would do this. I would do that. I would go here. I would attack here, I would hook over here. No, I don't want to do that. I really don't. I don't want them to know what I'm thinking, does that make sense? I want people to be guessing. I want -- there was a great article about me and recently, and they said in business, I'm very hard to figure out to me. That was a great compliment. It was meant as a compliment that was given by an enemy who I absolutely beat by the way and by the way, I went 60 minutes on Sunday, night, 60 minutes okay. Why? But I don't want people to figure me out. I don't want people to know what my plan is. I have plans, I have plans, but I don't want to do it. Then they said. Oh, he doesn't know foreign policy. These people are crazy. They're given everything. If I'm president, I will engage the 6th fleet. I will do this. I will do that. I will attack Russia in Syria. This is what they say. They want to start World War. Three office area give me a break. You know Russia. Once you get ISIS right, we want to get ices rushes in Syria. Maybe we should let them do it. Let them do it the hell. Are we crazy? Are we crazy, so we're gonna be out there, we're gonna run, we're going to win? I really think we're going to win. You are going to be so proud. Obamacare will be over, we're going to have a much better we're going to have something that's so tremendous, you know, remember the great lie, 27 times a lie. Remember that? your doctor, over and over you'll have your doctor. You have your plan. How about the premiums on Obamacare they're going up 45 and 50% and it doesn't even kick in really till 16 when you have a new president and Obama is going to be out on one of my golf courses playing golf. I think I'll let him play, right. I mean, why not, but they'll think of it think of it, but we are going to do so many things, we are going to have so many victories. You are going to be so proud of your country, and hopefully you're going to be so proud of your president, we're going to win, win, win and we are going to make our country great again. Thank you, everybody. Thank you."}