{"id":505,"author":"Donald Trump","title":"Speech: Donald Trump Holds a Town Hall Event in Rochester, NH","date":"2015-09-17","link":"https://factba.se/transcript/donald-trump-speech-rochester-nh-september-17-2015","paragraphs":["We love New Hampshire. Thank you, everybody. What a great welcome. Sit down, relax. We'll be here for a while. You know I said today that we just got back. As you know, we came from Mobile, Alabama two weeks ago, we had 31,000 people, 31,000. Then, we just left Dallas where we were in the great Mavericks, as you know, the Mavericks building, the basketball team, a great team, a wonderful team.","And Mark Cuban was so nice, he called, we know Mark, right? Good guy. And what happened is he said what about using the arena? I said, well, how much do we have? How long do we have? And how many seats? It's 20,000 seats. They filled it up in two days. Is that good? I then flew from Dallas, always making speeches, I then flew because we have to make our country great again, right?","I then flew and it was sort of fun. We flew to a very nice place in Los Angeles, right? And we went to the USS Iowa and we were honored by a great vets group which gave me an endorsement. They endorsed me. The vets like me and I love the vets. We have a lot of vets here tonight. We have a lot of vets. But the vets on the USS Iowa, that is some ship by the way, they don't build them like that anymore.","But they endorsed me and then I flew as you know last night. We had a little thing called the debate at the Reagan Library and it was -- it was sort of an amazing thing. We had an incredible time. Thank you. Thank you. That was some evening. Now I'll tell you the problem with evening.","It did so well that CNN said let's make it an hour longer. Can you believe this? That debate was three hours. It felt like more than that. Now, why did they do that? For the young children here because we have to teach them to be entrepreneurs. They did it because they wanted more revenue coming from the commercials, right?","Isn't that terrible? Terrible. I think it's terrible and the money should have gone to the vets, right? Right? The money should have gone -- they made a lot of money. They made a lot of money. But in the end, it was an incredible time and we had an incredible time. And I got such great remark -- look at this.","We just wrote this down. Time Magazine, they did votes as to who won the debate last night, right? So Time Magazine, 114,000 votes as of 6:00 p.m., Trump 56, Carly Fiorina 19, Rubio 7, Ben Carson 4, the rest, not doing too good. Then, Drudge. We love Drudge. We love Drudge. Donald Trump 51%, we had a total of 668,000 votes cast, Trump 668,000. Think of it, 51%. Second, Fiorina much less, like much.","Then Rubio, then Cruz, then -- I'm not going to mention the next name because I don't like him very much. Then Newsmax way up ahead. Newsmax, you like Newsmax, I like it too. The great Chris Ruddy, I like it too. Donald Trump first place by a lot. The Street, The Street, Donald Trump 52%. That's a lot when you have all of these guys.","That's a lot. You know it's not against two people it's against -- Donald Trump 52%, first place. Then you have Slate and that's also Donald Trump. So we had a great time. Now you don't read about that so much in television because coming out, boy, Fox treated me shabbily. They treated me shabbily. But that's OK. CNN a little bit better.","They treated me a little bit better but the end result is -- people know what happened. It was an incredible time. And we are going to do something very special. There's a great movement going on and it's a special movement. It's a movement where people want to see our country be great again. They want to see things happen.","They want to see the right things happen. They want everybody to get together work, work. You know the people of New Hampshire, you love to work, don't you? Don't you love to work? Huh? And you know, so, I had a little news yesterday because he's a great person and he's a great winner. I love winners. We love winners, right?","So a great winner, Tom Brady. Tom Brady. Right? So Tom is this incredible guy, total champion, and didn't even want to tell me about it. He endorsed me yesterday, right? Everybody up here knows that. That's good. When you get Tom you're getting a champ and he's a great champ. And we have some others, I won't mention them now, but I want to tell you we have so many people that are endorsing, and so many, really, you know, it's very interesting.","Coach Ditka in Chicago and people that I don't even know are just coming out in favor of Trump because they want to see the right thing happen. When CNN did its poll recently, they had a couple of different categories, one was leadership. In leadership, I win, like, forget it. Not even a contest. So much higher than everybody else, like, two or three, I don't know.","He had all these cameras going and they can tell you. But leadership, way through. The other one is a little thing called the economy and jobs. Nobody, nobody plus -- the only thing that they didn't love was my personality. Can you believe it? And I actual -- no, it's what -- it's the only thing. So here's what happened.","So we went to Dallas. We went to Mobile, Alabama. We went to the USS Iowa, I'm making speeches all over the place. Then we had the debate last night which was exciting. And I said, you know, we're going to do tonight? No speech. Let's do question and answer. Do you want? So I wanted to just say -- I'm going to say a few words and then we're going to do question and answer and you can make them vicious, violent, horrible questions even though you're sort of probably on live tele -- how many cameras are lit?","Yeah, there's a lot of them. Every time I speak now it's on live television. You know why? It's a very simple business, ratings. If I didn't get ratings those cameras would not be on, OK? They would not be on. So when you ask your question remember you're on live television. So here's what we're going to do. We're going to talk for just a couple of minutes.","Military, we're going to make it so strong, so great, so powerful. And I always say, we'll probably never have to use it. Who wants to use it? Got to have it because right now with what's happening in the world, we need that military, and we need that protection, and we're going to have it if Trump is elected President.","That I can tell you. That I can tell you. As part of that because I consider it part, but as part of that, we're taking care of our vets, OK? And the vets are going to be so happy. But they love me, anyway. I don't have to do this. I'm just telling you. And I've been up here so many times. Where's my man?","Stand up. Have I been up here many times? With my guy and we're going to take care of things. And so many vets in New Hampshire and they're not treated right. They're not treated right but they're not treated right anywhere. You know two weeks ago on Wednesday, they had the longest wait in a waiting room that anybody can remember, OK? Think of it. The longest wait where they'd wait three days, four days, five days.","Not going to happen anymore, folks. Not going to happen anymore. Not going to happen. And we're going to come out with a plan but one of the things we're going to do when you're going to have to wait that kind of time, you're going to go to private practice, you're going to go to private hospitals, you're going to go to even if it's public.","We'll take care of costs and believe me, it'll be less expensive and you'll get much better service. But you're not going to be waiting in rooms for five and six and seven days to take care of a condition that can be taken, that can be done immediately. It's not going to happen. It's not going to happen.","The other thing I want to just dwell on for two seconds and we -- probably you've heard but we are going to build a wall at the border. We're going to build a wall. And people are going to come into this country but they're going to come in legally. They're going to be legal. They're going to come in legally into our country.","So when I announce, as you know, a couple of months ago, can you believe it? I've been a politician for almost three months. Can you believe this? I never thought in a million years I'd be a politician. I -- I know, I know, I know that -- that's the hard part. It's true. But we're running this time and this time it's going to be incredible.","And by the way, you look not just at the New Hampshire poll that I told you about 40%, but you look at all the polls. It's absolutely incredible what we're doing and what we're doing really together. So immigration. And I've been saying it and the politicians, all talk, no action. Although, we have a lot of pol -- how many politicians are in this room?","Raise your hands because these guys are great, fabulous people. These are fabulous people right here. Stand up. He's my guy. He's been with me from the beginning, right? So he's excellent. What? Low key. How about elected officials? How many elected officials? Stand up. All right. These are all fabulous people, especially, you.","So we are going to do something. And when the wall gets built, I'd been saying Mexico's going to pay for it. Now, I love Mexico and I love the Mexican people. I have people I do business with Mexico. I do business with Mexican people and entrepreneurs. I have many, many people from Hispanics working for me, many, many, many Hispanics.","But you know what the problem is whether it's China or Japan or Mexico? They're outsmarting our leaders and we're not going to let it happen anymore. We're not going to let it happen, OK? We're not going to let it happen. I asked -- I asked about a week ago, I said you know, I want to know what is the trade deficit?","United States trade deficit. What is it with China? It's almost $400 billion a year. We're talking about a year. In other words, we're losing almost $400 billion, that's only China. In Japan, it's about close to $75 billion every year. And it's been pretty steady. It's going up, of course, because, of course, why wouldn't it? They get smarter and smarter, we get dumber and dumber.","So it's getting worse. So then, we get to Mexico. And you know with Mexico it's about $45 billion, it could even be now more than that. So everybody said, I've watched these politicians, I see even the people I'm competing against, the so-called candidates, you saw them last night. Some are very nice by the way.","But you look at it and you say, and they say to me, you can't really do that. Why would Mexico pay? They won't pay. They'll never pay. Then, I say why wouldn't they pay? They owe us and just think of it, we send hundreds and hundreds of millions of dollars into Mexico. You have a huge problem at the border were tremendous, the cartels, the drug cartels pouring with drugs, pour out with money.","So they come in -- not a good deal. We're not making a good deal there. But they are coming in with hundreds of -- you have to see this. The numbers they're staggering. Get shipped all over the United States and then people say, oh, the wall doesn't work. You ask Israel whether or not a wall works. Believe me. A wall properly done, a Trump wall, a Trump wall works.","That I can tell you. That I can tell you. But you know these guys, the politicians, and the politicians. So I understand. I understand where they come from my whole life I've dealt with politicians. They'll say you can't get Mexico to pay for the wall. It'll never work. And I say, why? Well, it just doesn't work.","Why would they do that? I say, why would they do it? Because we're losing almost $50 billion. Think of it, $50 billion a year on trade. Why wouldn't they do it? It's peanuts. You know they say it's going to cost ten or 12, but that's for people that never built anything. These are people that have no idea.","You'll do it for much less, the difference is that it will be bigger and better and stronger. And people aren't going to Home Depot and buying a ladder and walking right over this -- not this wall, not this wall. And by the way, and by the way, this wall is going to have a big beautiful open gate. We're going to have a nice opening.","And when people want to come into this country legally and they want to go through the process and it's going to -- we all welcome them. Is that a correct statement? I mean, we welcome. And when someone goes to Harvard and then they're number one in their class or Stanford or the Wharton School of Finance or Yale or any of them.","And they do great and then we throw them right out and they go back to a country and they try and compete and they do very successfully. We want to keep those people. We want to keep people of talent. We want people of great talent. So we've got a plan in terms of illegal immigration. And remember this, when I first announced, and this was an incredible two weeks, believe me. Rush Limbaugh said I have never seen anybody receive more incoming.","A word I never heard before. Incoming means really bad press. I mean, it was incoming but he said I've never seen anything like it. And then he doubled down, I doubled down and it's true. And he said nobody would have done that because I knew the problem. I knew what was happening. And we have tremendous crime whether it's Kate in San Francisco, whether it's Jamiel in Los Angeles, whether it's the woman two weeks ago who was killed in California, a 66year old veteran who was raped and sodomized and killed, unbelievable, by the illegal immigrant.","And it's just not going to happen anymore, folks. You know it's not going to happen anymore. We're going to have a border and we're going to get the gang members out of here fast. You know we get a lot of gang members that are illegal immigrants. You go to Chicago and different places, you had a lot of these tough, these are tough dudes.","We're going to get them out of here so fast your head will spin. All right. Your head will spin. So I'm really honored by the crowd and we're going to have some fun now because instead of making the speech which I've been doing over and over and over I want to take questions. Don't we like that, right? OK. All right.","Let's start with this group right over here. Come on. OK. This man. I like this guy. Unidentified","Right. We need this question. This question -- Unidentified","We're going to be looking at a lot of different things and you know a lot of people are saying that. And a lot of people are saying that bad things are happening out there. We're going to be looking at that and plenty of other things. OK. Go ahead. Yes, ma'am. Go ahead. Go ahead. Unidentified","Welcome, first of all, to New Hampshire. Donald, last night was a disgrace. CNN did not touch on any of the issues that are going on with veterans healthcare, women veterans healthcare --","It's true. I actually asked them about that. There wasn't one question relating to the veterans. That's true. Unidentified","You know what. There was not one question relating to that and not too much on the military, by the way. But nothing relating to the veterans. Those days, believe me, are over. OK. Yes, ma'am. Go ahead. Go ahead. Hi. Unidentified","I just finished my master's degree and now during my job search, I'm told I'm either overly or underly qualified. I believe the unemployment rate is skewed. What can you do to improve the job market for people like me, qualified, talented, educated, U.S. citizens?","You know, it's such a question. I get it all the time. It's an amazing question. One of the things we're doing, we'll be taking our jobs back from China and Japan and all of these other places that have been ripping us for years. They have been -- I've been talking about this for 10 years, 15 years. No politician sees it. We're bringing our jobs back here.","We're bringing our manufacturing back here. One of the things and I will tell you, it's probably, maybe the question, other than the vets. Maybe it's a question I get asked the most, OK? And that's people, young, beautiful, great people. They go to college, in many cases, borrow a lot of money to get through college.","They're so proud of themselves. They do well. They're good students. They work hard. They get out. They can't get a job. With Trump, you know, there's an expression, I will be the greatest jobs President that God ever created. I tell you that that's what you need. OK. Unidentified","Go ahead. Go ahead. Go ahead. Then we're going to go right around here. We'll go around. Don't worry about it. A lot of people with hands up. OK. Let's go. Unidentified","I remember that. I remember you gave it. Unidentified","OK. We'll take a look at it. We're going to look at it. Go ahead, next. Back here. Go ahead. Unidentified","Go ahead. Unidentified","Right. Trump wall. Unidentified","The Trump wall. He goes -- see that's what's going to happen. That's why I'm going to make this wall so beautiful because when I'm gone they're going to probably change the name to the Trump wall. I've got to make it beautiful. I've got to. Big, big and powerful and beautiful. Go ahead. Toby -- he said Trump wall, I didn't. Unidentified","Not such a good one. We owe $19 trillion. I would say we're not doing too well. Unidentified","Because they make a fortune off us. They make a fortune. They make so much money. They're taking our business. You know Nabisco -- Unidentified","Do you like Oreos? The cookies, right? I'm not eating Oreos anymore. Nabisco is closing their plant, a big plant in Chicago, and they're moving it to Mexico. Ford is building a $2.5 billion plant in Mexico. Mexico is doing very well. We love Mexico but they're doing very well. We need leaders that can deal with them and deal with all the other countries and not just the three I named.","We need leaders that are smart and tough and cunning. You know, I have Carl Icahn lined up. I have some of the greatest business leaders in the country lined up, really tough, smart people, and they're going to help us. And they're going to go and negotiate and we're going to make great deals and we're going to bring jobs back so that you can get a job, OK? Do you like that?","OK. Come on over here. Question. Yes, sir. Go ahead with the hat. Unidentified","Thank you. You think it's hot enough in this place, man. This -- this, you know last night was pretty hot. This blows it away. Go ahead. Unidentified","Right. Unidentified","Don't get nervous you're in about seven television network. Don't get nervous. Don't choke. Unidentified","Go ahead. Unidentified","Right. That's right. Unidentified","There's so many things that are going to change. You know these are regulations and there -- But so many things that's one. You know one of the things, being in real estate, we have army bases, navy bases. So many are for sale and so many have been sold over the last short period of time. And you say, how many can we sell?","I see it all the time. They come across my desk. So many things are going to change. OK. Go ahead. You had a question over there? Go ahead. Go ahead you, young, handsome guy. Go ahead. Unidentified","Daniel Tabas was a great man. Unidentified","Yeah. My friend, he was my friend. He passed away. He was my friend. Unidentified","It's true. Unidentified","So Dan Tabas is from Philadelphia became a big banker but a really good banker, a real banker and he was a friend of mine. He passed away a few years ago and he was a very, very successful guy and a great guy. And you're right about it. Look, we will bring the American Dream back. That I can tell you. We're bringing it back, OK? And I understand what you're saying and I get that.","I get that from so many people. Is the American Dream dead? They're asking me the question. Is the American Dream dead? And the American Dream is in trouble. That I can tell you, OK? He said it's on life support. It's in trouble. But we're going to get it back and we're going to do some real job. How about the man with that beautiful red hat?","Stand up. Stand up. What I hat. What does that say on it? Wow. Make America Great Again. That's beautiful. Beautiful. Unidentified","And say what? Unidentified","On the Second Amendment, all for it. Unidentified","These were killers and tough cookies. And a man and a wife were in the home and the wife was totally anti-gun. She hated that the husband had guns and the guy was pro. He was a big Second Amendment guy. He was pro and all of a sudden they're waiting and these two tough cookies, tough guys, bad guys are somewhere around their home, within a little bit.","And she, all of a sudden, now is totally pro because she felt -- she was so happy that her husband had guns. And they had the gun on the table and the gun they were carrying. And you know what. They never had to use it. They never had to use it because remember only the bad guys use it. But they were secure.","And now she's bigger than the husband in terms of wanting that. So I think that's pretty much what you want to hear. No, 100% pro, Second Amendment. Yes, sir. Go ahead. Go ahead. Unidentified","Good. Wow. Good shape. Were you hurt at all? Were you wounded ever? Were you ever wounded? You look good. UnidentifiedAn IED blast and a couple of ground incidents.","Well, you look great. Go ahead. Unidentified","Well, look you have a crisis that's massive and I'm getting that question a lot as of about two weeks ago. Where you have hundreds of thousands of people. But you know there comes a point and we all have to have heart. And I think I have as big a heart as anybody. But there comes a point where this country has to say we have to get our own act together.","We have to do it. The other thing is when you're looking at ISIS and all of the problems that are being caused over there. You say to yourself, well, what happens if a lot of these people are Al-Qaida, ISIS? You know, you could have -- you could have 15 different things. You don't know. They don't know anything about them.","Now with all of that being said, Europe, they got to help themselves. Every once in awhile they're going to have to. It can't always be the United States. We have our bridges, our roads, our tunnels. We have problems here. We owe so much money. You know we owe Japan $1.4 trillion. Think of it. They sell cars by the thousands.","They come off -- I saw boats two weeks ago in Los Angeles. Thousands of cars all over the place. We owe them money. How do you do that? They're selling cars, we owe them money. Very simple. We have people that aren't very smart. China, we owe them the same amount of money, $1.4 trillion. Now it's up, $1.4 trillion.","We got to straighten out our own country. With that being said, you have the Gulf states, very rich, Saudi Arabia, Qatar, Bahrain. They take nobody. They don't want to have anybody, OK? They don't want to have anybody. All right. Nobody. You have Europe. You have all these, right. They got to help. Now what I do like is a safe zone.","You know you get a lot of sand, a lot of sand in Syria, right? I do like the concept of a safe zone where you put them there, you build it out, you have security. You create a little bit of an environment. Maybe until they can ultimately go back to their homes which most of them really want to do. They're great people.","I mean, they're caught in this horrible conflict. But the concept of a safe zone is something that really makes sense. Probably, they even like it better. They stay and we help them and we help. But we have to help Europe and the Gulf states have to contribute. You know Saudi Arabia before the oil price, but you know, in all fairness, so, now it's a little bit less for Saudi Arabia.","Saudi Arabia was making so much money beyond anything and beyond anybody's comprehension. All of these countries have to get together and they have to fund it. We have to -- we can do something but we have to get other people to help us. We can't be the patsy every time there's a problem. And in the meantime, in the meantime, our airports are third-world, our bridges are falling down, you see the safety record on bridge like, 62% are in danger.","Our roads are collapsing all over the country. We are a mess. So we want to build our country and we want to help people on a humanitarian basis. But we have to do some things to help ourselves. I mean, it's time maybe for us to help ourselves. OK. In the back, go ahead. In the back, let's go. Then, I'm going to these people have a lousy seat.","They're looking at the back of my head. But they see that it's real. That's OK. Unidentified","OK. Go ahead. Give me a question. Unidentified","Well, the pope believes in global warming, you do know that, right? Hey, in this room it's so hot in here. Maybe, I'll start to believe it myself. This room is hot. This room was not designed. The air conditioning was not designed for this many people. No, I like the pope. A lot of -- a lot of personality.","Good man. Good man. Yes, ma'am. Go ahead. Go ahead. OK. Unidentified","Good. Unidentified","They have no problem going in. They get food stamps. They get housing. They get electric. They get all of this and it's coming from our Social Security money.","I know. Unidentified","She's getting more and more excited. Look at that. Unidentified","Make it right. Well, I tell people -- Unidentified","Go ahead. Carly Fiorina, why -- say it gin because people might as well hear it. I mean, people have to learn. I thought I'd wait a couple of days before I exposed her business failure. But honestly, it's so ridiculous. Go ahead tell me. Unidentified","And that was Lucent? Unidentified","And headed up by who? Unidentified","That's right. Unidentified","That was before Hewlett Packard. Unidentified","Yeah. Well, you know, the Carly thing is sort of amazing because a lot of people don't get it. Because Lucent was a disaster you know. Unidentified","Lucent was a company that she ran prior to Hewlett Packard. When she bought Compaq she was heading up Hewlett Packard for a while, a little while, a very short while, and then made the decision to buy Compaq. Compaq Computer, I guess. And people that work there said that the company was such a great company until she got involved and until she went out and she made this horrible acquisition and it just has destroyed the company, Hewlett Packard.","In fact, yesterday on the front page of The Wall Street Journal, big story, main story that Hewlett Packard, that they're dropping about what 30,000 jobs now. They're still recovering, they may never. Who knows if they're ever going to recover but -- and she -- everyone say she made a good speech yesterday.","I don't know. I don't get it. I don't get it. I don't get it. But at some point, people are going to see and I think it's going to be a very big roadblock you know. Now when you look at Trump, OK, Trump. I built an unbelievable company, tremendous company, tremendous net worth, which I don't want to talk about, other than to say, it's the kind of mentality you need in this country, at least, for a period of time.","At least and you know as a businessman, I help Democrats, I help Repub -- I help whoever because I want to be. I did everything. I used all of the laws of the land. I'd buy a company. I'd throw it into a chapter, I chapter it, you bankrupt it, you beat the hell out of the banks. That -- I was a businessman.","I have to do that. And by the way, you have many people in my position where they do the same thing but nobody talks about it. I mean, I'll give you the list of names. In fact, we're writing up the biggest business leaders in the country have all done the same thing and nobody ever talks about it but I've done great.","And that's the kind of thinking you're going to have to need. And you know what? We'll make it rich again. We'll make it fantastic again. I'll leave and then you know what's going to happen? Somebody else can blow it. But we got to save our -- we have to save our country. So with Carly, she did a terrible job at Lucent.","She did a terrible, terrible, terrible job at Hewlett Packard. Terrible job. Stories have been written that are legendary. The head of the Yale Business School, Jeffrey Sonnenfeld. But you know who he is, right? Right? He wrote a story that was so brutal, and I mean, people are going to have to read this.","They're going to have to read it. I just don't see how she can get over that hurdle. In addition to what she cut thousands and thousands of jobs and they're still cutting them. And bottom line, you know what, she made a horrible purchase because the Compaq purchase was a disaster. She made a horrible purchase but a lot of people don't know.","Before Hewlett, you had Lucent and Lucent probably was just as bad, if not worse relatively. OK. Yes. Unidentified","You know like a -- another Holocaust. I just want you to know about that. You're welcome.","Does anybody have a towel? You know, I've lost a lot of weight. The good thing is running for President, believe it or not, every room we have is packed and nobody has enough air conditioning. Because of that and I'm losing a lot of weight so it's not so bad. Go ahead. Go ahead, darling. Unidentified","Unidentified","That sounds good. Wow, that sounds so great. Thank you, darling. Go ahead. Go ahead. Right here. Unidentified","What a great -- he's a businessman. Hey, he's from New Hampshire, what else is new? So it's such a good point and I made it last night but people don't want to hear it. They don't want to hear it. To keep we spend really I would say $200 billion a year, OK? $200 billion a year on illegal immigration. I think the number is much higher than that.","To get the bad ones out, to do the wall is peanuts, by the way, peanuts. You know, I tell the story all the time. The Great Wall of China 13,000 miles long, against our Southern border, it's 2,000 of which you really need 1,000 because you have a lot of natural barriers and a lot of other things, frankly.","But you need 1,000, so they say, oh, you can't do it. And yet two thousand years ago they had no problem, 2000 years ago. He brings up such a great point. We have a cost of I believe it's in excess and we have numbers that go from $175 billion a year to $250 billion to $260 billion. The fact is nobody knows.","Nobody even knows how many illegals we have here because you know we've been hearing for years, 11, 11, 11 never moves, right? It's always 11, give me a break. So it might be much more than that but we're a country of laws. We're a country of borders. We have to secure our border and we're going to clean it up. We're going to make our country so strong and so wonderful and so great.","OK. OK. And you're right. You're right. There's a huge offsetting cost, which by the way, will -- which will really help out. OK. Unidentified","What's your favorite? What's your favorite? Unidentified","Say it. Unidentified","Oh, boy, am I in trouble? Am I in trouble? Am I in trouble? OK. Go ahead. Yes. Yes, sir. Thank you, man. Thank you. Thank you. Go ahead. OK. Thank you. Thank you. Thank you. Go ahead. Can you hear it? Go ahead. Unidentified","If they are elected for one term, they get a lifetime pension, they get medical, they don't have to join Obamacare. If you're elected, sir --","In fact, they don't have to use Obamacare. Isn't that incredible? Unidentified","So, the first thing I'm going to do is tell you that if I'm elected President I'm accepting no salary, OK? That's not a big deal for me. But -- the next thing is when these guys go to Congress as per, as per your question, when they go to Congress. A couple of things happen. First of all, they get benefits that nobody else can even think about, OK? And then, I'd like to talk about it but we'll work on that.","We have bigger problems than that because that's peanuts in the relative scale of how this country is being hurt. But we're going to work on that very hard. But I will tell you this, we will have a system that is going to be fair to everybody. One of the things I'm doing that really has gotten a lot of praise, I'm self-funding.","I'm not getting tens of millions of dollars, hundreds of millions of dollars. And you know, it's very unnatural. No, no, it's very unnatural for me. You know in many ways, I feel foolish because people come up, they want to give you lots of money. Lobbyists, special interest, donors, they want it and I keep turning them down.","I'm the only one. I believe out of all the people running. Look, I talk about the hedge fund guys. They're going to have to pay. We're lowering taxes in this country for corporations, for the middle class -- middle income you're going to love me. We're lowering taxes. We're going to simplify. We're going lower.","We're coming out in three or four weeks with an amazing plan but we're lowering taxes in our country. But the hedge fund guys and others, the hedge fund guys are going to have to pay up. They're going to be paying. And you know what. That's OK. Somebody said that's not very Republican. I don't see anybody weeping in here.","I don't see anybody weeping. But you're going to be very, very happy when you see what we do with the taxes when you see what you do with jobs, with economic development. You are going to be very, very happy. OK. Go ahead. Yes. Unidentified","Don't get nervous. You're not getting nervous. OK. Unidentified","OK. Unidentified","Did you say safe, to keep them safe? Unidentified","What are you doing? What are you doing? Unidentified","I see how it is very much so here, yeah. Here it is. The whole court system is broken by the way, not just family court. Unidentified","If you look at what happened with Justice Roberts where he approved Obamacare twice, OK. I mean, you're talking about more than local. But the answer is yes. I do think that should be a local situation over. I'll give you an example, Jeb Bush loves Common Core. He loves Common Core meaning, no, think of it. I do like that being local.","I want to see local people teaching your kids. I want people from New Hampshire, from Iowa, from South Carolina. I want to see local people taking care of your children's education and working instead of people from Washington, that in many cases, could not care less. So think of it. Jeb Bush, and just to use him as an example, because other guys are actually ahead of him in the polls by a lot.","But Jeb Bush is totally in favor and strongly in favor of Common Core, right? And he's weak on immigration. What -- how can you have him? You can't have him. You can't have him. So I don't think he's going to do too well in New Hampshire or Iowa or anywhere else. OK. Go ahead. Unidentified","OK. Go ahead, you go first. Unidentified","How do you plan and bring back American manufacturing jobs and would you repeal NAFTA? And how do you feel about the TPP deal?","OK. Your new trade deal is a terrible deal and one of the big things that really is hurting us is currency manipulation. It is a disaster and that is -- answers that question. That deal is not the deal that should be made. I've not been a fan of NAFTA. You know about NAFTA better than anybody because your places have been just stripped out of all of New England and you know what's happened.","They've gone to Mexico. They've gone all over the place. But you -- I am not and I have never been a fan of NAFTA. We are going to bring our jobs back. We're going to have Ford and these other countries -- companies instead of going down to Mexico and lots of other places lots of other places. We're going to have them build here.","We're going to give them the incentive that they need to build here. Go ahead. Go ahead. Go ahead, darling. Unidentified","Good. Unidentified","That's an interesting quite -- let me ask you a question. OK. So we have global -- let me ask you this. OK. Take it easy, fellas. How many people, how many people here believe in global warming? Do you believe in global warming? Who believes in global warming? Who believes in global warming? Who believes in global warming?","Raise your hand. Wow, not much, huh. Do you have your hand up? A little? No. No. Nobody? One person? Unidentified","Well, it's a very interesting -- you do believe, right? Unidentified","OK. We're going to do two more questions. Two more questions. Let's go. Go ahead. Right here. Right here. UnidentifiedExcuse us. OK.","Go ahead. Unidentified","And you're saying that's what's happening, right? Yeah. No, I know that. I heard that. I heard that yesterday actually. Not a good situation. OK. One more question. One more. Make it a good one. Make it a good one. Go ahead, ma'am. Right here. Right here. You, go ahead. Go ahead give her the mic. Give her the mic, right.","Go ahead. Make it a good one. Otherwise, you have to do one more. Unidentified","We're going to save Social Security. We're going to save it. We're going to save Social Security. That was your deal, right? We are going to save Social Security. We are going to make life for the vets better than it's ever been in this country. We are going to build up the military. We are going to end, terminate, repeal Obamacare, and replace it with something really, really great, that works, that works.","Ladies and gentlemen, thank you very much. It was great. Thank you. Thank you. Thank you. Thank you. Thank you."],"text":" We love New Hampshire. Thank you, everybody. What a great welcome. Sit down, relax. We'll be here for a while. You know I said today that we just got back. As you know, we came from Mobile, Alabama two weeks ago, we had 31,000 people, 31,000. Then, we just left Dallas where we were in the great Mavericks, as you know, the Mavericks building, the basketball team, a great team, a wonderful team. And Mark Cuban was so nice, he called, we know Mark, right? Good guy. And what happened is he said what about using the arena? I said, well, how much do we have? How long do we have? And how many seats? It's 20,000 seats. They filled it up in two days. Is that good? I then flew from Dallas, always making speeches, I then flew because we have to make our country great again, right? I then flew and it was sort of fun. We flew to a very nice place in Los Angeles, right? And we went to the USS Iowa and we were honored by a great vets group which gave me an endorsement. They endorsed me. The vets like me and I love the vets. We have a lot of vets here tonight. We have a lot of vets. But the vets on the USS Iowa, that is some ship by the way, they don't build them like that anymore. But they endorsed me and then I flew as you know last night. We had a little thing called the debate at the Reagan Library and it was -- it was sort of an amazing thing. We had an incredible time. Thank you. Thank you. That was some evening. Now I'll tell you the problem with evening. It did so well that CNN said let's make it an hour longer. Can you believe this? That debate was three hours. It felt like more than that. Now, why did they do that? For the young children here because we have to teach them to be entrepreneurs. They did it because they wanted more revenue coming from the commercials, right? Isn't that terrible? Terrible. I think it's terrible and the money should have gone to the vets, right? Right? The money should have gone -- they made a lot of money. They made a lot of money. But in the end, it was an incredible time and we had an incredible time. And I got such great remark -- look at this. We just wrote this down. Time Magazine, they did votes as to who won the debate last night, right? So Time Magazine, 114,000 votes as of 6:00 p.m., Trump 56, Carly Fiorina 19, Rubio 7, Ben Carson 4, the rest, not doing too good. Then, Drudge. We love Drudge. We love Drudge. Donald Trump 51%, we had a total of 668,000 votes cast, Trump 668,000. Think of it, 51%. Second, Fiorina much less, like much. Then Rubio, then Cruz, then -- I'm not going to mention the next name because I don't like him very much. Then Newsmax way up ahead. Newsmax, you like Newsmax, I like it too. The great Chris Ruddy, I like it too. Donald Trump first place by a lot. The Street, The Street, Donald Trump 52%. That's a lot when you have all of these guys. That's a lot. You know it's not against two people it's against -- Donald Trump 52%, first place. Then you have Slate and that's also Donald Trump. So we had a great time. Now you don't read about that so much in television because coming out, boy, Fox treated me shabbily. They treated me shabbily. But that's OK. CNN a little bit better. They treated me a little bit better but the end result is -- people know what happened. It was an incredible time. And we are going to do something very special. There's a great movement going on and it's a special movement. It's a movement where people want to see our country be great again. They want to see things happen. They want to see the right things happen. They want everybody to get together work, work. You know the people of New Hampshire, you love to work, don't you? Don't you love to work? Huh? And you know, so, I had a little news yesterday because he's a great person and he's a great winner. I love winners. We love winners, right? So a great winner, Tom Brady. Tom Brady. Right? So Tom is this incredible guy, total champion, and didn't even want to tell me about it. He endorsed me yesterday, right? Everybody up here knows that. That's good. When you get Tom you're getting a champ and he's a great champ. And we have some others, I won't mention them now, but I want to tell you we have so many people that are endorsing, and so many, really, you know, it's very interesting. Coach Ditka in Chicago and people that I don't even know are just coming out in favor of Trump because they want to see the right thing happen. When CNN did its poll recently, they had a couple of different categories, one was leadership. In leadership, I win, like, forget it. Not even a contest. So much higher than everybody else, like, two or three, I don't know. He had all these cameras going and they can tell you. But leadership, way through. The other one is a little thing called the economy and jobs. Nobody, nobody plus -- the only thing that they didn't love was my personality. Can you believe it? And I actual -- no, it's what -- it's the only thing. So here's what happened. So we went to Dallas. We went to Mobile, Alabama. We went to the USS Iowa, I'm making speeches all over the place. Then we had the debate last night which was exciting. And I said, you know, we're going to do tonight? No speech. Let's do question and answer. Do you want? So I wanted to just say -- I'm going to say a few words and then we're going to do question and answer and you can make them vicious, violent, horrible questions even though you're sort of probably on live tele -- how many cameras are lit? Yeah, there's a lot of them. Every time I speak now it's on live television. You know why? It's a very simple business, ratings. If I didn't get ratings those cameras would not be on, OK? They would not be on. So when you ask your question remember you're on live television. So here's what we're going to do. We're going to talk for just a couple of minutes. Military, we're going to make it so strong, so great, so powerful. And I always say, we'll probably never have to use it. Who wants to use it? Got to have it because right now with what's happening in the world, we need that military, and we need that protection, and we're going to have it if Trump is elected President. That I can tell you. That I can tell you. As part of that because I consider it part, but as part of that, we're taking care of our vets, OK? And the vets are going to be so happy. But they love me, anyway. I don't have to do this. I'm just telling you. And I've been up here so many times. Where's my man? Stand up. Have I been up here many times? With my guy and we're going to take care of things. And so many vets in New Hampshire and they're not treated right. They're not treated right but they're not treated right anywhere. You know two weeks ago on Wednesday, they had the longest wait in a waiting room that anybody can remember, OK? Think of it. The longest wait where they'd wait three days, four days, five days. Not going to happen anymore, folks. Not going to happen anymore. Not going to happen. And we're going to come out with a plan but one of the things we're going to do when you're going to have to wait that kind of time, you're going to go to private practice, you're going to go to private hospitals, you're going to go to even if it's public. We'll take care of costs and believe me, it'll be less expensive and you'll get much better service. But you're not going to be waiting in rooms for five and six and seven days to take care of a condition that can be taken, that can be done immediately. It's not going to happen. It's not going to happen. The other thing I want to just dwell on for two seconds and we -- probably you've heard but we are going to build a wall at the border. We're going to build a wall. And people are going to come into this country but they're going to come in legally. They're going to be legal. They're going to come in legally into our country. So when I announce, as you know, a couple of months ago, can you believe it? I've been a politician for almost three months. Can you believe this? I never thought in a million years I'd be a politician. I -- I know, I know, I know that -- that's the hard part. It's true. But we're running this time and this time it's going to be incredible. And by the way, you look not just at the New Hampshire poll that I told you about 40%, but you look at all the polls. It's absolutely incredible what we're doing and what we're doing really together. So immigration. And I've been saying it and the politicians, all talk, no action. Although, we have a lot of pol -- how many politicians are in this room? Raise your hands because these guys are great, fabulous people. These are fabulous people right here. Stand up. He's my guy. He's been with me from the beginning, right? So he's excellent. What? Low key. How about elected officials? How many elected officials? Stand up. All right. These are all fabulous people, especially, you. So we are going to do something. And when the wall gets built, I'd been saying Mexico's going to pay for it. Now, I love Mexico and I love the Mexican people. I have people I do business with Mexico. I do business with Mexican people and entrepreneurs. I have many, many people from Hispanics working for me, many, many, many Hispanics. But you know what the problem is whether it's China or Japan or Mexico? They're outsmarting our leaders and we're not going to let it happen anymore. We're not going to let it happen, OK? We're not going to let it happen. I asked -- I asked about a week ago, I said you know, I want to know what is the trade deficit? United States trade deficit. What is it with China? It's almost $400 billion a year. We're talking about a year. In other words, we're losing almost $400 billion, that's only China. In Japan, it's about close to $75 billion every year. And it's been pretty steady. It's going up, of course, because, of course, why wouldn't it? They get smarter and smarter, we get dumber and dumber. So it's getting worse. So then, we get to Mexico. And you know with Mexico it's about $45 billion, it could even be now more than that. So everybody said, I've watched these politicians, I see even the people I'm competing against, the so-called candidates, you saw them last night. Some are very nice by the way. But you look at it and you say, and they say to me, you can't really do that. Why would Mexico pay? They won't pay. They'll never pay. Then, I say why wouldn't they pay? They owe us and just think of it, we send hundreds and hundreds of millions of dollars into Mexico. You have a huge problem at the border were tremendous, the cartels, the drug cartels pouring with drugs, pour out with money. So they come in -- not a good deal. We're not making a good deal there. But they are coming in with hundreds of -- you have to see this. The numbers they're staggering. Get shipped all over the United States and then people say, oh, the wall doesn't work. You ask Israel whether or not a wall works. Believe me. A wall properly done, a Trump wall, a Trump wall works. That I can tell you. That I can tell you. But you know these guys, the politicians, and the politicians. So I understand. I understand where they come from my whole life I've dealt with politicians. They'll say you can't get Mexico to pay for the wall. It'll never work. And I say, why? Well, it just doesn't work. Why would they do that? I say, why would they do it? Because we're losing almost $50 billion. Think of it, $50 billion a year on trade. Why wouldn't they do it? It's peanuts. You know they say it's going to cost ten or 12, but that's for people that never built anything. These are people that have no idea. You'll do it for much less, the difference is that it will be bigger and better and stronger. And people aren't going to Home Depot and buying a ladder and walking right over this -- not this wall, not this wall. And by the way, and by the way, this wall is going to have a big beautiful open gate. We're going to have a nice opening. And when people want to come into this country legally and they want to go through the process and it's going to -- we all welcome them. Is that a correct statement? I mean, we welcome. And when someone goes to Harvard and then they're number one in their class or Stanford or the Wharton School of Finance or Yale or any of them. And they do great and then we throw them right out and they go back to a country and they try and compete and they do very successfully. We want to keep those people. We want to keep people of talent. We want people of great talent. So we've got a plan in terms of illegal immigration. And remember this, when I first announced, and this was an incredible two weeks, believe me. Rush Limbaugh said I have never seen anybody receive more incoming. A word I never heard before. Incoming means really bad press. I mean, it was incoming but he said I've never seen anything like it. And then he doubled down, I doubled down and it's true. And he said nobody would have done that because I knew the problem. I knew what was happening. And we have tremendous crime whether it's Kate in San Francisco, whether it's Jamiel in Los Angeles, whether it's the woman two weeks ago who was killed in California, a 66year old veteran who was raped and sodomized and killed, unbelievable, by the illegal immigrant. And it's just not going to happen anymore, folks. You know it's not going to happen anymore. We're going to have a border and we're going to get the gang members out of here fast. You know we get a lot of gang members that are illegal immigrants. You go to Chicago and different places, you had a lot of these tough, these are tough dudes. We're going to get them out of here so fast your head will spin. All right. Your head will spin. So I'm really honored by the crowd and we're going to have some fun now because instead of making the speech which I've been doing over and over and over I want to take questions. Don't we like that, right? OK. All right. Let's start with this group right over here. Come on. OK. This man. I like this guy. Unidentified Right. We need this question. This question -- Unidentified We're going to be looking at a lot of different things and you know a lot of people are saying that. And a lot of people are saying that bad things are happening out there. We're going to be looking at that and plenty of other things. OK. Go ahead. Yes, ma'am. Go ahead. Go ahead. Unidentified Welcome, first of all, to New Hampshire. Donald, last night was a disgrace. CNN did not touch on any of the issues that are going on with veterans healthcare, women veterans healthcare -- It's true. I actually asked them about that. There wasn't one question relating to the veterans. That's true. Unidentified You know what. There was not one question relating to that and not too much on the military, by the way. But nothing relating to the veterans. Those days, believe me, are over. OK. Yes, ma'am. Go ahead. Go ahead. Hi. Unidentified I just finished my master's degree and now during my job search, I'm told I'm either overly or underly qualified. I believe the unemployment rate is skewed. What can you do to improve the job market for people like me, qualified, talented, educated, U.S. citizens? You know, it's such a question. I get it all the time. It's an amazing question. One of the things we're doing, we'll be taking our jobs back from China and Japan and all of these other places that have been ripping us for years. They have been -- I've been talking about this for 10 years, 15 years. No politician sees it. We're bringing our jobs back here. We're bringing our manufacturing back here. One of the things and I will tell you, it's probably, maybe the question, other than the vets. Maybe it's a question I get asked the most, OK? And that's people, young, beautiful, great people. They go to college, in many cases, borrow a lot of money to get through college. They're so proud of themselves. They do well. They're good students. They work hard. They get out. They can't get a job. With Trump, you know, there's an expression, I will be the greatest jobs President that God ever created. I tell you that that's what you need. OK. Unidentified Go ahead. Go ahead. Go ahead. Then we're going to go right around here. We'll go around. Don't worry about it. A lot of people with hands up. OK. Let's go. Unidentified I remember that. I remember you gave it. Unidentified OK. We'll take a look at it. We're going to look at it. Go ahead, next. Back here. Go ahead. Unidentified Go ahead. Unidentified Right. Trump wall. Unidentified The Trump wall. He goes -- see that's what's going to happen. That's why I'm going to make this wall so beautiful because when I'm gone they're going to probably change the name to the Trump wall. I've got to make it beautiful. I've got to. Big, big and powerful and beautiful. Go ahead. Toby -- he said Trump wall, I didn't. Unidentified Not such a good one. We owe $19 trillion. I would say we're not doing too well. Unidentified Because they make a fortune off us. They make a fortune. They make so much money. They're taking our business. You know Nabisco -- Unidentified Do you like Oreos? The cookies, right? I'm not eating Oreos anymore. Nabisco is closing their plant, a big plant in Chicago, and they're moving it to Mexico. Ford is building a $2.5 billion plant in Mexico. Mexico is doing very well. We love Mexico but they're doing very well. We need leaders that can deal with them and deal with all the other countries and not just the three I named. We need leaders that are smart and tough and cunning. You know, I have Carl Icahn lined up. I have some of the greatest business leaders in the country lined up, really tough, smart people, and they're going to help us. And they're going to go and negotiate and we're going to make great deals and we're going to bring jobs back so that you can get a job, OK? Do you like that? OK. Come on over here. Question. Yes, sir. Go ahead with the hat. Unidentified Thank you. You think it's hot enough in this place, man. This -- this, you know last night was pretty hot. This blows it away. Go ahead. Unidentified Right. Unidentified Don't get nervous you're in about seven television network. Don't get nervous. Don't choke. Unidentified Go ahead. Unidentified Right. That's right. Unidentified There's so many things that are going to change. You know these are regulations and there -- But so many things that's one. You know one of the things, being in real estate, we have army bases, navy bases. So many are for sale and so many have been sold over the last short period of time. And you say, how many can we sell? I see it all the time. They come across my desk. So many things are going to change. OK. Go ahead. You had a question over there? Go ahead. Go ahead you, young, handsome guy. Go ahead. Unidentified Daniel Tabas was a great man. Unidentified Yeah. My friend, he was my friend. He passed away. He was my friend. Unidentified It's true. Unidentified So Dan Tabas is from Philadelphia became a big banker but a really good banker, a real banker and he was a friend of mine. He passed away a few years ago and he was a very, very successful guy and a great guy. And you're right about it. Look, we will bring the American Dream back. That I can tell you. We're bringing it back, OK? And I understand what you're saying and I get that. I get that from so many people. Is the American Dream dead? They're asking me the question. Is the American Dream dead? And the American Dream is in trouble. That I can tell you, OK? He said it's on life support. It's in trouble. But we're going to get it back and we're going to do some real job. How about the man with that beautiful red hat? Stand up. Stand up. What I hat. What does that say on it? Wow. Make America Great Again. That's beautiful. Beautiful. Unidentified And say what? Unidentified On the Second Amendment, all for it. Unidentified These were killers and tough cookies. And a man and a wife were in the home and the wife was totally anti-gun. She hated that the husband had guns and the guy was pro. He was a big Second Amendment guy. He was pro and all of a sudden they're waiting and these two tough cookies, tough guys, bad guys are somewhere around their home, within a little bit. And she, all of a sudden, now is totally pro because she felt -- she was so happy that her husband had guns. And they had the gun on the table and the gun they were carrying. And you know what. They never had to use it. They never had to use it because remember only the bad guys use it. But they were secure. And now she's bigger than the husband in terms of wanting that. So I think that's pretty much what you want to hear. No, 100% pro, Second Amendment. Yes, sir. Go ahead. Go ahead. Unidentified Good. Wow. Good shape. Were you hurt at all? Were you wounded ever? Were you ever wounded? You look good. UnidentifiedAn IED blast and a couple of ground incidents. Well, you look great. Go ahead. Unidentified Well, look you have a crisis that's massive and I'm getting that question a lot as of about two weeks ago. Where you have hundreds of thousands of people. But you know there comes a point and we all have to have heart. And I think I have as big a heart as anybody. But there comes a point where this country has to say we have to get our own act together. We have to do it. The other thing is when you're looking at ISIS and all of the problems that are being caused over there. You say to yourself, well, what happens if a lot of these people are Al-Qaida, ISIS? You know, you could have -- you could have 15 different things. You don't know. They don't know anything about them. Now with all of that being said, Europe, they got to help themselves. Every once in awhile they're going to have to. It can't always be the United States. We have our bridges, our roads, our tunnels. We have problems here. We owe so much money. You know we owe Japan $1.4 trillion. Think of it. They sell cars by the thousands. They come off -- I saw boats two weeks ago in Los Angeles. Thousands of cars all over the place. We owe them money. How do you do that? They're selling cars, we owe them money. Very simple. We have people that aren't very smart. China, we owe them the same amount of money, $1.4 trillion. Now it's up, $1.4 trillion. We got to straighten out our own country. With that being said, you have the Gulf states, very rich, Saudi Arabia, Qatar, Bahrain. They take nobody. They don't want to have anybody, OK? They don't want to have anybody. All right. Nobody. You have Europe. You have all these, right. They got to help. Now what I do like is a safe zone. You know you get a lot of sand, a lot of sand in Syria, right? I do like the concept of a safe zone where you put them there, you build it out, you have security. You create a little bit of an environment. Maybe until they can ultimately go back to their homes which most of them really want to do. They're great people. I mean, they're caught in this horrible conflict. But the concept of a safe zone is something that really makes sense. Probably, they even like it better. They stay and we help them and we help. But we have to help Europe and the Gulf states have to contribute. You know Saudi Arabia before the oil price, but you know, in all fairness, so, now it's a little bit less for Saudi Arabia. Saudi Arabia was making so much money beyond anything and beyond anybody's comprehension. All of these countries have to get together and they have to fund it. We have to -- we can do something but we have to get other people to help us. We can't be the patsy every time there's a problem. And in the meantime, in the meantime, our airports are third-world, our bridges are falling down, you see the safety record on bridge like, 62% are in danger. Our roads are collapsing all over the country. We are a mess. So we want to build our country and we want to help people on a humanitarian basis. But we have to do some things to help ourselves. I mean, it's time maybe for us to help ourselves. OK. In the back, go ahead. In the back, let's go. Then, I'm going to these people have a lousy seat. They're looking at the back of my head. But they see that it's real. That's OK. Unidentified OK. Go ahead. Give me a question. Unidentified Well, the pope believes in global warming, you do know that, right? Hey, in this room it's so hot in here. Maybe, I'll start to believe it myself. This room is hot. This room was not designed. The air conditioning was not designed for this many people. No, I like the pope. A lot of -- a lot of personality. Good man. Good man. Yes, ma'am. Go ahead. Go ahead. OK. Unidentified Good. Unidentified They have no problem going in. They get food stamps. They get housing. They get electric. They get all of this and it's coming from our Social Security money. I know. Unidentified She's getting more and more excited. Look at that. Unidentified Make it right. Well, I tell people -- Unidentified Go ahead. Carly Fiorina, why -- say it gin because people might as well hear it. I mean, people have to learn. I thought I'd wait a couple of days before I exposed her business failure. But honestly, it's so ridiculous. Go ahead tell me. Unidentified And that was Lucent? Unidentified And headed up by who? Unidentified That's right. Unidentified That was before Hewlett Packard. Unidentified Yeah. Well, you know, the Carly thing is sort of amazing because a lot of people don't get it. Because Lucent was a disaster you know. Unidentified Lucent was a company that she ran prior to Hewlett Packard. When she bought Compaq she was heading up Hewlett Packard for a while, a little while, a very short while, and then made the decision to buy Compaq. Compaq Computer, I guess. And people that work there said that the company was such a great company until she got involved and until she went out and she made this horrible acquisition and it just has destroyed the company, Hewlett Packard. In fact, yesterday on the front page of The Wall Street Journal, big story, main story that Hewlett Packard, that they're dropping about what 30,000 jobs now. They're still recovering, they may never. Who knows if they're ever going to recover but -- and she -- everyone say she made a good speech yesterday. I don't know. I don't get it. I don't get it. I don't get it. But at some point, people are going to see and I think it's going to be a very big roadblock you know. Now when you look at Trump, OK, Trump. I built an unbelievable company, tremendous company, tremendous net worth, which I don't want to talk about, other than to say, it's the kind of mentality you need in this country, at least, for a period of time. At least and you know as a businessman, I help Democrats, I help Repub -- I help whoever because I want to be. I did everything. I used all of the laws of the land. I'd buy a company. I'd throw it into a chapter, I chapter it, you bankrupt it, you beat the hell out of the banks. That -- I was a businessman. I have to do that. And by the way, you have many people in my position where they do the same thing but nobody talks about it. I mean, I'll give you the list of names. In fact, we're writing up the biggest business leaders in the country have all done the same thing and nobody ever talks about it but I've done great. And that's the kind of thinking you're going to have to need. And you know what? We'll make it rich again. We'll make it fantastic again. I'll leave and then you know what's going to happen? Somebody else can blow it. But we got to save our -- we have to save our country. So with Carly, she did a terrible job at Lucent. She did a terrible, terrible, terrible job at Hewlett Packard. Terrible job. Stories have been written that are legendary. The head of the Yale Business School, Jeffrey Sonnenfeld. But you know who he is, right? Right? He wrote a story that was so brutal, and I mean, people are going to have to read this. They're going to have to read it. I just don't see how she can get over that hurdle. In addition to what she cut thousands and thousands of jobs and they're still cutting them. And bottom line, you know what, she made a horrible purchase because the Compaq purchase was a disaster. She made a horrible purchase but a lot of people don't know. Before Hewlett, you had Lucent and Lucent probably was just as bad, if not worse relatively. OK. Yes. Unidentified You know like a -- another Holocaust. I just want you to know about that. You're welcome. Does anybody have a towel? You know, I've lost a lot of weight. The good thing is running for President, believe it or not, every room we have is packed and nobody has enough air conditioning. Because of that and I'm losing a lot of weight so it's not so bad. Go ahead. Go ahead, darling. Unidentified Unidentified That sounds good. Wow, that sounds so great. Thank you, darling. Go ahead. Go ahead. Right here. Unidentified What a great -- he's a businessman. Hey, he's from New Hampshire, what else is new? So it's such a good point and I made it last night but people don't want to hear it. They don't want to hear it. To keep we spend really I would say $200 billion a year, OK? $200 billion a year on illegal immigration. I think the number is much higher than that. To get the bad ones out, to do the wall is peanuts, by the way, peanuts. You know, I tell the story all the time. The Great Wall of China 13,000 miles long, against our Southern border, it's 2,000 of which you really need 1,000 because you have a lot of natural barriers and a lot of other things, frankly. But you need 1,000, so they say, oh, you can't do it. And yet two thousand years ago they had no problem, 2000 years ago. He brings up such a great point. We have a cost of I believe it's in excess and we have numbers that go from $175 billion a year to $250 billion to $260 billion. The fact is nobody knows. Nobody even knows how many illegals we have here because you know we've been hearing for years, 11, 11, 11 never moves, right? It's always 11, give me a break. So it might be much more than that but we're a country of laws. We're a country of borders. We have to secure our border and we're going to clean it up. We're going to make our country so strong and so wonderful and so great. OK. OK. And you're right. You're right. There's a huge offsetting cost, which by the way, will -- which will really help out. OK. Unidentified What's your favorite? What's your favorite? Unidentified Say it. Unidentified Oh, boy, am I in trouble? Am I in trouble? Am I in trouble? OK. Go ahead. Yes. Yes, sir. Thank you, man. Thank you. Thank you. Go ahead. OK. Thank you. Thank you. Thank you. Go ahead. Can you hear it? Go ahead. Unidentified If they are elected for one term, they get a lifetime pension, they get medical, they don't have to join Obamacare. If you're elected, sir -- In fact, they don't have to use Obamacare. Isn't that incredible? Unidentified So, the first thing I'm going to do is tell you that if I'm elected President I'm accepting no salary, OK? That's not a big deal for me. But -- the next thing is when these guys go to Congress as per, as per your question, when they go to Congress. A couple of things happen. First of all, they get benefits that nobody else can even think about, OK? And then, I'd like to talk about it but we'll work on that. We have bigger problems than that because that's peanuts in the relative scale of how this country is being hurt. But we're going to work on that very hard. But I will tell you this, we will have a system that is going to be fair to everybody. One of the things I'm doing that really has gotten a lot of praise, I'm self-funding. I'm not getting tens of millions of dollars, hundreds of millions of dollars. And you know, it's very unnatural. No, no, it's very unnatural for me. You know in many ways, I feel foolish because people come up, they want to give you lots of money. Lobbyists, special interest, donors, they want it and I keep turning them down. I'm the only one. I believe out of all the people running. Look, I talk about the hedge fund guys. They're going to have to pay. We're lowering taxes in this country for corporations, for the middle class -- middle income you're going to love me. We're lowering taxes. We're going to simplify. We're going lower. We're coming out in three or four weeks with an amazing plan but we're lowering taxes in our country. But the hedge fund guys and others, the hedge fund guys are going to have to pay up. They're going to be paying. And you know what. That's OK. Somebody said that's not very Republican. I don't see anybody weeping in here. I don't see anybody weeping. But you're going to be very, very happy when you see what we do with the taxes when you see what you do with jobs, with economic development. You are going to be very, very happy. OK. Go ahead. Yes. Unidentified Don't get nervous. You're not getting nervous. OK. Unidentified OK. Unidentified Did you say safe, to keep them safe? Unidentified What are you doing? What are you doing? Unidentified I see how it is very much so here, yeah. Here it is. The whole court system is broken by the way, not just family court. Unidentified If you look at what happened with Justice Roberts where he approved Obamacare twice, OK. I mean, you're talking about more than local. But the answer is yes. I do think that should be a local situation over. I'll give you an example, Jeb Bush loves Common Core. He loves Common Core meaning, no, think of it. I do like that being local. I want to see local people teaching your kids. I want people from New Hampshire, from Iowa, from South Carolina. I want to see local people taking care of your children's education and working instead of people from Washington, that in many cases, could not care less. So think of it. Jeb Bush, and just to use him as an example, because other guys are actually ahead of him in the polls by a lot. But Jeb Bush is totally in favor and strongly in favor of Common Core, right? And he's weak on immigration. What -- how can you have him? You can't have him. You can't have him. So I don't think he's going to do too well in New Hampshire or Iowa or anywhere else. OK. Go ahead. Unidentified OK. Go ahead, you go first. Unidentified How do you plan and bring back American manufacturing jobs and would you repeal NAFTA? And how do you feel about the TPP deal? OK. Your new trade deal is a terrible deal and one of the big things that really is hurting us is currency manipulation. It is a disaster and that is -- answers that question. That deal is not the deal that should be made. I've not been a fan of NAFTA. You know about NAFTA better than anybody because your places have been just stripped out of all of New England and you know what's happened. They've gone to Mexico. They've gone all over the place. But you -- I am not and I have never been a fan of NAFTA. We are going to bring our jobs back. We're going to have Ford and these other countries -- companies instead of going down to Mexico and lots of other places lots of other places. We're going to have them build here. We're going to give them the incentive that they need to build here. Go ahead. Go ahead. Go ahead, darling. Unidentified Good. Unidentified That's an interesting quite -- let me ask you a question. OK. So we have global -- let me ask you this. OK. Take it easy, fellas. How many people, how many people here believe in global warming? Do you believe in global warming? Who believes in global warming? Who believes in global warming? Who believes in global warming? Raise your hand. Wow, not much, huh. Do you have your hand up? A little? No. No. Nobody? One person? Unidentified Well, it's a very interesting -- you do believe, right? Unidentified OK. We're going to do two more questions. Two more questions. Let's go. Go ahead. Right here. Right here. UnidentifiedExcuse us. OK. Go ahead. Unidentified And you're saying that's what's happening, right? Yeah. No, I know that. I heard that. I heard that yesterday actually. Not a good situation. OK. One more question. One more. Make it a good one. Make it a good one. Go ahead, ma'am. Right here. Right here. You, go ahead. Go ahead give her the mic. Give her the mic, right. Go ahead. Make it a good one. Otherwise, you have to do one more. Unidentified We're going to save Social Security. We're going to save it. We're going to save Social Security. That was your deal, right? We are going to save Social Security. We are going to make life for the vets better than it's ever been in this country. We are going to build up the military. We are going to end, terminate, repeal Obamacare, and replace it with something really, really great, that works, that works. Ladies and gentlemen, thank you very much. It was great. Thank you. Thank you. Thank you. Thank you. Thank you."}