{"id":507,"author":"Donald Trump","title":"Speech: Donald Trump in Boone, IA","date":"2015-09-12","link":"https://factba.se/transcript/donald-trump-speech-boone-ia-september-12-2015","paragraphs":["Thank you. Thank you. So this is a new hat. Does anybody like it? You like the white one, the red one or this one? A lot of people like this, what do we like? Should we give out a couple today, huh? Who is -- ri -- That's good that's, that's good, beautiful.","Do you like that? Beautiful. Don't sell it tonight? We'll see it on eBay. I love it. Thank you.","Okay. Come on let's do that. We're here, who's young, handsome and beautiful, then we'll take a little older. Who's been -- Come on up, come on up, darling, come here, come here, okay.","What's your name?","Here you go, sweetheart.","Okay. So the New York Times is doing a story tomorrow on the hat, they're saying it's the hottest thing in fashion if you can believe this? And I'm not -- at style section of the New York Times on the hat. So anyway, you know we'll do, who wants it back here? Who wants it? Good. Who wants it? Come on, give me one.","Good, good. Okay, folks. So what a nice train. Oh, beautiful, he's waving to me.","Beautiful. That's called the USA right there, right? That's called the USA. Beautiful. Man, I love that stuff.","I love that picture. So, we just came out with another, poll. A poll in Iowa, we're way ahead and that's great. Hi.","And that's, so great. And I've been here so many times I'm going to the football game, you believe it? Right after this, in fact, they said, oh, this is only 10 minutes, just say hello, Mr. Trump for ten minutes, but I said what do you mean ten minutes? Can I give him the full version of the Trump speech? They said no 10-15 minutes. So we'll just have a little fun, but I'm going actually from here to a couple of tailgating parties and then I'm going over to the football game.","Let me ask you, who's gonna win the game today? Lots of spirit. Huh? No, no, no. It's gonna be a great game. Which team is favored to win? Yeah, that's what I hear, okay, well, if you don't mind I'm not gonna pick one, does that make sense? That makes sense.","Everybody fully understands that.","So our country is in trouble. We have a lot of things going, but the best thing we have is our people and our potential and we're gonna make this country so great again, we're gonna make it strong, we're gonna make it powerful, we're gonna build up our -- our tremendous Armed Forces, you know, they've been depleted very badly. I tell the story 2,300 Humvees, think of that. Two thousand.","And when I heard that number I said, you know what, can't be possible, they mean 23, they mean two, they mean 15, 2,300 armor-plated, the best in the world, the best they've ever made, which frankly if we had them for our young men and women, they wouldn't have been injured so badly, so horribly and one bullet gets shot, up in the air and they're all gone, they go to the enemy. So the enemy has them right now because we have stupid, stupid leadership. We have people . We have people that don't know what they're doing, and we just can't go on like this.","So, for the last year, I've been talking about $18 trillion in debt. So now it's $19 trillion in debt, and now it's gonna start going up fast. Obamacare starts kicking in 16, because Obama didn't want it to kick in while he's president, and it is going to be a catastrophe. We are going to repeal Obamacare and replace it with something great with something really good.","We will do that too. And there's so many -- look at what's happening to your premiums, look at what's happening, look at what's happening to deductibles, they're going so high or unless you're dead you're not gonna be able to use them, no, I mean it's ridiculous. The deductibles are so high you're not gonna be able to use it and your premiums are through the roof. I mean, it's a total catastrophe and you know what we have so many other bad things happening, that people aren't talking about Obamacare that much anymore, do you notice it? And yet when you bring it up, remember the $5 billion website, because I'm not gonna forget it, the $5 billion website that doesn't work.","And I think we all know. So we're, gonna take care of that, we're gonna take care of our military, we're gonna have a military, and by the way, we're gonna take care of our vets got a lot of vets. We are really going to take care of our vets. You know they're our greatest people, we are gonna take care of our vets like they should be.","Two weeks ago on Wednesday, it was reported the longest wait, the longest wait in the history of the Veterans Administration. People are waiting three, four or five days to see a doctor and I tell the story, read it in one of the papers where a man pretty badly injured waited five days and after the final wait, the doctor said, I'm sorry, I can't see you now I'm going on vacation. I mean, think of it, if I go to a doctor if I have to wait more than like 12 minutes I'm going crazy. So we're a little spoiled.","But I will tell you this, we're going to take care of our vets we're gonna build up our military so big and so strong that we won't ever have to use it, perhaps, and that would be great. We are going to build the wall, we're gonna stop illegal immigration, we're gonna stop it, and you know, that's something, I hear these politicians, I just can't stand them anymore. Somebody said you're a politician, I said, please for three months I've been a politician, do you believe it? All my life I've dealt with politicians, you know, if you can't make it with a politician, you might as well give up. I've spent my whole life, I help them, they'll do whatever -- you know, it's ridi -- the whole thing gives me -- I hope we don't have too many politicians, we'll exclude the people that are in this audience, but I'm now a politician which is crazy to me, it's crazy.","I actually had something, I had jury-duty, do you believe it all of a sudden they give me for jury-duty and I -- it said occupation, and I guess I'm supposed to say politician, but I put down real estate, I can't do the politician. But politicians are all-talk they're, no-action. They go to Washington, they tell you they're going to do all these things and they never get done. And then you have some people you think, oh, these are my people, these are great, this guy or this woman is gonna be fantastic.","They go to Washington and they change. They see the -- the beautiful ceilings, the vaulted ceilings, they see the beautiful marble columns and something happens, I say they become impotent. Is that a correct word to use? They become impotent something happens to them. When they're back in Iowa and when they're back in New Hampshire and South Carolina, we're winning in all of these states.","We're winning everywhere. We just gotta poll, Georgia, Florida, how about in Florida, you have a governor from Florida and you have a senator who's actually a sitting senator, and I'm leading in Florida by a lot. I mean, can you believe it? Because people -- and I'm leading the pack, I will tell you with the people, people are tired of incompetence, they're, tired of people that don't get it done and you look at our budget, its massive, its massive. Somebody like Jeb Bush is in favor of common core, meaning your children are educated from Washington D.C.","Who could -- who could want this? And you know, when you listen to these people, like the common core people, they can't explain it, there's no justification. If I'm in Iowa. And if I have my children in Iowa, I want local education, the local teachers, and the local administrators will do a better job. Then you have people -- so I came out as you know with my immigration plan and I'll tell you what it's been really well received better than I thought.","And I thought it was a little bit stringent, a little tough and a lot of people think, oh, could you make it tougher, it's true, but it is a pretty firm plan. If you're illegal, if you're illegal, you got to go back, you got to go back. Now if somebody's great and they've been here for a long time, I don't think we can -- and I can't live with doing anything -- we can move it, we can move the process. You have people that have been here a long time, but they got to go back, they got to.","We got to build a wall and we got to get rid of the bad ones. We got some real bad ones. You know a lot of the gangs that you've been reading about in these different places including, like Chicago and -- and a lot of the places not to mention names, but a lot of the places they're illegals and they're tough dudes, they're tough, they're out of here. I'll tell you what, before I even get the wall started, they're gone the first day.","One of the first things, they're gone, they're gone. So we're going to take back our economy. Right now, if you look at what's going on, trains like this they're going -- and you know where the stuff is going? Goes to China, they don't pay us. We paid no tax, you know the whole thing with the tax a friend of mine who's a great manufacturer, he sends stuff to China, he has to pay a fortune in tax when they take his product.","They don't even take his for -- they don't want it, and yet they sent and we're stupid. We take everything, no tax, no this, no that. I like free trade. But when you have free trade, you have to have smart people, smart negotiators, we don't have those people, we don't have those people.","And believe me, if I'm elected, I know the smartest, I know the toughest, I know the meanest, some are just horrible human beings, they are, they're horrible. You would not have dinner with them, I'm telling you, this gentleman here who is a great vet, you wouldn't want anything, but you know what I want them represented. Do you agree with that? Or would you rather have a very nice person like Carolyn Kennedy, right, she's representing us in Japan? She knows nothing, she admits, she knows nothing, but we are going to have the toughest, the smartest, we're going to have people that are so good, we're gonna have the greatest nego -- I know them all. I know the good ones, I know the bad ones.","I know the overrated ones, I know the ones that will really do a good job and keep friendly, which I want, we'll have better relationships with China, Japan, Mexico, we'll have better relationships that we do right now. We don't have good relationships and they all rip us off. So last year I was just curious and last year I said how much money do we lose with China, meaning what's our deficit it's over $400 billion. Think of that.","$400billion. I said, what do we lose, just out of curiosity, what do we lose with Japan? I was surprised not that bad, about $60 billion, not that bad, not bad. You know, we only lost $60 billion. Iowa would like to have Iowa would like $60 billion, you could -- There'd be no taxes for the rest of your lives, right? So, and by the way, my tax plan is gonna come out in about three or four weeks and we're gonna lower taxes especially for the middle class.","We are going to make sure that my friends in the hedge fund business who make a fortune and pay virtually no tax, they are going to start paying taxes, they're gonna start paying taxes. I don't care, you know, I'm self-funding my campaign I'm spending my own money. When I fly here, I spend my own money. They don't -- I don't need their money.","I don't want their money and I -- I feel sort of foolish because guys are coming up to me saying. I want to put millions of dollars, one guy, $5 million and I'm turning him down. I say I don't want it. I feel like, I honestly show -- can I use a bad term? I feel like a schmuck, no, I'm turning down millions of dollars.","Bush he's raised $125 million, $125 million, he gets it from China, he gets it from the Wall Street guys, he gets it from all of these companies. And once you get -- I love that sound, oh, no, I love it. It's progress. But you know what, when I'm president that trains gonna be moving a hell of a lot faster, it's going to slow, no it's true.","Well, no that's 'cause you're an engineer, think of this, the engineer actually stopped because he wants to listen to the speech, can you believe that? No, that sucker's gonna be moving, it's gonna be loaded up, and it's gonna be -- I don't know where the hell it's going, but it's gonna be go fast. So the hedge-fund-guys' have to pay. Now they're supporting Hillary, who may not get to the starting gate folks, right? I don't know. She may not get -- I don't know, who cares, it doesn't matter, I'm not worried about her, I'm worried about the first guys.","You know, we look Perry, Islah, Indian I spend Mr. Perry, Governor Perry, he's gone. Good luck. Well, he was very nasty to me.","But you know, yesterday I put out a tweet. I said he's a wonderful man and I wish him. People couldn't believe. But you know, when you win, everybody's wonderful, right? And I think he's won.","I think... He's actually a nice guy, but he dropped out. So we have a total of 16 people. So when I'm getting nationwide, thirty to one poll came out 40, but what I'm getting 32, and it's sort of funny, I have a poll at 40, I have a pole at 32 and then I have these other polls, and you know, they're all like that. Winning in Iowa, winning in New Hampshire, winning every place, by a lot.","And then I hear here's the headline, Carly is surging, he's got 3%. I hear Ben, who's a nice guy, Ben Carson is a very nice man, he's surging, but he's way behind me, I'm saying, well, what about me I'm leading, they don't mention that. The headline is Carson surging, I keep saying what about Trump? I said, oh, well, you're leading, but you know, and by the way, I'm surging much more than him, I'm surging more than anybody because look, I mean in all fairness to Ben, Ben hit me on my faith, you don't hit a person on faith. I don't know him, he knows nothing about me, I'm Protestant, I'm Presbyterian, I believe strongly, believe in the Bible strongly.","But he hit me in my faith. No, I believe strongly. You don't hit a person on faith and he was nice enough to apologize. He actually apologized, which is nice.","Most people won't do that, so I respect that, but it's a tough thing when you get hit on faith. But the one thing we need in this country, we need energy. I see where the evangelicals are supporting Trump largely and I'm leading with the revenge -- and you know part of the reason that they like me and I think strongly if they want to see our country -- This smart people, they know that we -- I may not be perfect, and they know that, and maybe 10 years ago and four years ago, they said no, no, he's not perfect, he's, not perfect and we can't assume. But you know what I'm really good at? I'm really good at making deals and making this country rich and bringing it back.","And and I saw Pastor Jeffers, I saw a few of them on television the other night and they said why, do you explain, how do you explain to Donald Trump, and again, I'm Protestant, how do you explain that Donald Trump is leading substantially by substantial numbers with the evangelicals and they said because they're tired of losing they're tired of getting these people that don't do anything that have no energy and it's true people don't have energy. I don't think Ben has the energy, Ben is a nice man, but when you're negotiating against China and you're negotiating against these Japanese guys that are gonna come at you in waves, and they think we're all a bunch of jerks, 'cause our leaders are so stupid and so incompetent and so inept, we need people that are really smart, that have tremendous deal-making skills and that have great, great energy. We had a case where Hillary said, and Jeb said, and they used the same word and it was the same day a couple of weeks ago. I don't like Donald Trump's tone, his tone, my tone, we have people, Christians in Syria and other places, ISIS is chopping off their head, they're chopping off their head, they're drowning them, they're, killing them.","If you're a Christian, you have no chance. Do you know that if you're a Christian from Syria it's almost impossible to come into the United States. If you're a Muslim from Syria, it's, the easiest thing to do is to come into the United States, it's one of the easiest places to get in. Can you believe this? But if you're a Christian and they're the ones that need the help you can't get into the United States.","Now I don't know who's setting those regulations, I have a pretty good idea. I have a pretty good idea. But it's not gonna happen anymore, but they were saying at the same time they said his tone, t-o-n-e, tone, and I said, you know, we need that tone today. We need energy, we need strength and -- and if we can't be low-key and nice and beautiful, then a woman came up to me and she said, Mr.","Trump, I love you I'm a big supporter and it doesn't matter. But I don't know if you're nice enough to be President and I said, actually, you know what, I pride my -- I have so many friends I have great relationships, but some people don't think I'm nice, in a CNN poll I won on almost every topic and they'll tell you back there, they're shooting here, they're all here live, they're all over the place. But you know what? They'll tell you, otherwise I couldn't say it, I once used by huge by three, four times, leadership, the economy every -- almost all the part -- the only thing, I thought it was down the bottom in terms of, is he a nice person? Actually, I think someday I'm gonna win on that, 'cause I am a nice per -- but you know what I told the woman, I don't think it matters this time. I think today we're looking for real super-competence.","We ...we're tired with this nice stuff. We need people that are really, really smart and competent and can get things done. We need people, we need people with an aggressive tone, and we need people with tremendous energy, and I'm your candidate, okay? So, so just to finish off, this is a fantastic crowd and -- and I really appreciate it and they said ten minutes and I wanted to go much longer because you had so many people standing out here and it's hot and all of that. But I have to tell you, I love Iowa, I really appreciate that you understand what's going on.","The people of Iowa really do get it. They really do get it. And look, you know, you're, you're, hard-working people that really don't want anything you just want to see this country be great again and that's what I'm gonna do I'm gonna make this country great again. I'm gonna make this country greater than it has ever been before.","Better. Enjoy. Thank you. Thank you very much.","Thank you. We will make America great again."],"text":" Welcome the next president of the United States, Donald J. Trump . Thank you. Thank you. So this is a new hat. Does anybody like it? You like the white one, the red one or this one? A lot of people like this, what do we like? Should we give out a couple today, huh? Who is -- ri -- That's good that's, that's good, beautiful. Do you like that? Beautiful. Don't sell it tonight? We'll see it on eBay. I love it. Thank you. Okay. Come on let's do that. We're here, who's young, handsome and beautiful, then we'll take a little older. Who's been -- Come on up, come on up, darling, come here, come here, okay. What's your name? Haley. Here you go, sweetheart. Thank you. Okay. So the New York Times is doing a story tomorrow on the hat, they're saying it's the hottest thing in fashion if you can believe this? And I'm not -- at style section of the New York Times on the hat. So anyway, you know we'll do, who wants it back here? Who wants it? Good. Who wants it? Come on, give me one. Good, good. Okay, folks. So what a nice train. Oh, beautiful, he's waving to me. Beautiful. That's called the USA right there, right? That's called the USA. Beautiful. Man, I love that stuff. I love that picture. So, we just came out with another, poll. A poll in Iowa, we're way ahead and that's great. Hi. And that's, so great. And I've been here so many times I'm going to the football game, you believe it? Right after this, in fact, they said, oh, this is only 10 minutes, just say hello, Mr. Trump for ten minutes, but I said what do you mean ten minutes? Can I give him the full version of the Trump speech? They said no 10-15 minutes. So we'll just have a little fun, but I'm going actually from here to a couple of tailgating parties and then I'm going over to the football game. Let me ask you, who's gonna win the game today? Lots of spirit. Huh? No, no, no. It's gonna be a great game. Which team is favored to win? Yeah, that's what I hear, okay, well, if you don't mind I'm not gonna pick one, does that make sense? That makes sense. Everybody fully understands that. So our country is in trouble. We have a lot of things going, but the best thing we have is our people and our potential and we're gonna make this country so great again, we're gonna make it strong, we're gonna make it powerful, we're gonna build up our -- our tremendous Armed Forces, you know, they've been depleted very badly. I tell the story 2,300 Humvees, think of that. Two thousand. And when I heard that number I said, you know what, can't be possible, they mean 23, they mean two, they mean 15, 2,300 armor-plated, the best in the world, the best they've ever made, which frankly if we had them for our young men and women, they wouldn't have been injured so badly, so horribly and one bullet gets shot, up in the air and they're all gone, they go to the enemy. So the enemy has them right now because we have stupid, stupid leadership. We have people . We have people that don't know what they're doing, and we just can't go on like this. So, for the last year, I've been talking about $18 trillion in debt. So now it's $19 trillion in debt, and now it's gonna start going up fast. Obamacare starts kicking in 16, because Obama didn't want it to kick in while he's president, and it is going to be a catastrophe. We are going to repeal Obamacare and replace it with something great with something really good. We will do that too. And there's so many -- look at what's happening to your premiums, look at what's happening, look at what's happening to deductibles, they're going so high or unless you're dead you're not gonna be able to use them, no, I mean it's ridiculous. The deductibles are so high you're not gonna be able to use it and your premiums are through the roof. I mean, it's a total catastrophe and you know what we have so many other bad things happening, that people aren't talking about Obamacare that much anymore, do you notice it? And yet when you bring it up, remember the $5 billion website, because I'm not gonna forget it, the $5 billion website that doesn't work. And I think we all know. So we're, gonna take care of that, we're gonna take care of our military, we're gonna have a military, and by the way, we're gonna take care of our vets got a lot of vets. We are really going to take care of our vets. You know they're our greatest people, we are gonna take care of our vets like they should be. Two weeks ago on Wednesday, it was reported the longest wait, the longest wait in the history of the Veterans Administration. People are waiting three, four or five days to see a doctor and I tell the story, read it in one of the papers where a man pretty badly injured waited five days and after the final wait, the doctor said, I'm sorry, I can't see you now I'm going on vacation. I mean, think of it, if I go to a doctor if I have to wait more than like 12 minutes I'm going crazy. So we're a little spoiled. But I will tell you this, we're going to take care of our vets we're gonna build up our military so big and so strong that we won't ever have to use it, perhaps, and that would be great. We are going to build the wall, we're gonna stop illegal immigration, we're gonna stop it, and you know, that's something, I hear these politicians, I just can't stand them anymore. Somebody said you're a politician, I said, please for three months I've been a politician, do you believe it? All my life I've dealt with politicians, you know, if you can't make it with a politician, you might as well give up. I've spent my whole life, I help them, they'll do whatever -- you know, it's ridi -- the whole thing gives me -- I hope we don't have too many politicians, we'll exclude the people that are in this audience, but I'm now a politician which is crazy to me, it's crazy. I actually had something, I had jury-duty, do you believe it all of a sudden they give me for jury-duty and I -- it said occupation, and I guess I'm supposed to say politician, but I put down real estate, I can't do the politician. But politicians are all-talk they're, no-action. They go to Washington, they tell you they're going to do all these things and they never get done. And then you have some people you think, oh, these are my people, these are great, this guy or this woman is gonna be fantastic. They go to Washington and they change. They see the -- the beautiful ceilings, the vaulted ceilings, they see the beautiful marble columns and something happens, I say they become impotent. Is that a correct word to use? They become impotent something happens to them. When they're back in Iowa and when they're back in New Hampshire and South Carolina, we're winning in all of these states. We're winning everywhere. We just gotta poll, Georgia, Florida, how about in Florida, you have a governor from Florida and you have a senator who's actually a sitting senator, and I'm leading in Florida by a lot. I mean, can you believe it? Because people -- and I'm leading the pack, I will tell you with the people, people are tired of incompetence, they're, tired of people that don't get it done and you look at our budget, its massive, its massive. Somebody like Jeb Bush is in favor of common core, meaning your children are educated from Washington D.C. Who could -- who could want this? And you know, when you listen to these people, like the common core people, they can't explain it, there's no justification. If I'm in Iowa. And if I have my children in Iowa, I want local education, the local teachers, and the local administrators will do a better job. Then you have people -- so I came out as you know with my immigration plan and I'll tell you what it's been really well received better than I thought. And I thought it was a little bit stringent, a little tough and a lot of people think, oh, could you make it tougher, it's true, but it is a pretty firm plan. If you're illegal, if you're illegal, you got to go back, you got to go back. Now if somebody's great and they've been here for a long time, I don't think we can -- and I can't live with doing anything -- we can move it, we can move the process. You have people that have been here a long time, but they got to go back, they got to. We got to build a wall and we got to get rid of the bad ones. We got some real bad ones. You know a lot of the gangs that you've been reading about in these different places including, like Chicago and -- and a lot of the places not to mention names, but a lot of the places they're illegals and they're tough dudes, they're tough, they're out of here. I'll tell you what, before I even get the wall started, they're gone the first day. One of the first things, they're gone, they're gone. So we're going to take back our economy. Right now, if you look at what's going on, trains like this they're going -- and you know where the stuff is going? Goes to China, they don't pay us. We paid no tax, you know the whole thing with the tax a friend of mine who's a great manufacturer, he sends stuff to China, he has to pay a fortune in tax when they take his product. They don't even take his for -- they don't want it, and yet they sent and we're stupid. We take everything, no tax, no this, no that. I like free trade. But when you have free trade, you have to have smart people, smart negotiators, we don't have those people, we don't have those people. And believe me, if I'm elected, I know the smartest, I know the toughest, I know the meanest, some are just horrible human beings, they are, they're horrible. You would not have dinner with them, I'm telling you, this gentleman here who is a great vet, you wouldn't want anything, but you know what I want them represented. Do you agree with that? Or would you rather have a very nice person like Carolyn Kennedy, right, she's representing us in Japan? She knows nothing, she admits, she knows nothing, but we are going to have the toughest, the smartest, we're going to have people that are so good, we're gonna have the greatest nego -- I know them all. I know the good ones, I know the bad ones. I know the overrated ones, I know the ones that will really do a good job and keep friendly, which I want, we'll have better relationships with China, Japan, Mexico, we'll have better relationships that we do right now. We don't have good relationships and they all rip us off. So last year I was just curious and last year I said how much money do we lose with China, meaning what's our deficit it's over $400 billion. Think of that. $400billion. I said, what do we lose, just out of curiosity, what do we lose with Japan? I was surprised not that bad, about $60 billion, not that bad, not bad. You know, we only lost $60 billion. Iowa would like to have Iowa would like $60 billion, you could -- There'd be no taxes for the rest of your lives, right? So, and by the way, my tax plan is gonna come out in about three or four weeks and we're gonna lower taxes especially for the middle class. We are going to make sure that my friends in the hedge fund business who make a fortune and pay virtually no tax, they are going to start paying taxes, they're gonna start paying taxes. I don't care, you know, I'm self-funding my campaign I'm spending my own money. When I fly here, I spend my own money. They don't -- I don't need their money. I don't want their money and I -- I feel sort of foolish because guys are coming up to me saying. I want to put millions of dollars, one guy, $5 million and I'm turning him down. I say I don't want it. I feel like, I honestly show -- can I use a bad term? I feel like a schmuck, no, I'm turning down millions of dollars. Bush he's raised $125 million, $125 million, he gets it from China, he gets it from the Wall Street guys, he gets it from all of these companies. And once you get -- I love that sound, oh, no, I love it. It's progress. But you know what, when I'm president that trains gonna be moving a hell of a lot faster, it's going to slow, no it's true. Well, no that's 'cause you're an engineer, think of this, the engineer actually stopped because he wants to listen to the speech, can you believe that? No, that sucker's gonna be moving, it's gonna be loaded up, and it's gonna be -- I don't know where the hell it's going, but it's gonna be go fast. So the hedge-fund-guys' have to pay. Now they're supporting Hillary, who may not get to the starting gate folks, right? I don't know. She may not get -- I don't know, who cares, it doesn't matter, I'm not worried about her, I'm worried about the first guys. You know, we look Perry, Islah, Indian I spend Mr. Perry, Governor Perry, he's gone. Good luck. Well, he was very nasty to me. But you know, yesterday I put out a tweet. I said he's a wonderful man and I wish him. People couldn't believe. But you know, when you win, everybody's wonderful, right? And I think he's won. I think... He's actually a nice guy, but he dropped out. So we have a total of 16 people. So when I'm getting nationwide, thirty to one poll came out 40, but what I'm getting 32, and it's sort of funny, I have a poll at 40, I have a pole at 32 and then I have these other polls, and you know, they're all like that. Winning in Iowa, winning in New Hampshire, winning every place, by a lot. And then I hear here's the headline, Carly is surging, he's got 3%. I hear Ben, who's a nice guy, Ben Carson is a very nice man, he's surging, but he's way behind me, I'm saying, well, what about me I'm leading, they don't mention that. The headline is Carson surging, I keep saying what about Trump? I said, oh, well, you're leading, but you know, and by the way, I'm surging much more than him, I'm surging more than anybody because look, I mean in all fairness to Ben, Ben hit me on my faith, you don't hit a person on faith. I don't know him, he knows nothing about me, I'm Protestant, I'm Presbyterian, I believe strongly, believe in the Bible strongly. But he hit me in my faith. No, I believe strongly. You don't hit a person on faith and he was nice enough to apologize. He actually apologized, which is nice. Most people won't do that, so I respect that, but it's a tough thing when you get hit on faith. But the one thing we need in this country, we need energy. I see where the evangelicals are supporting Trump largely and I'm leading with the revenge -- and you know part of the reason that they like me and I think strongly if they want to see our country -- This smart people, they know that we -- I may not be perfect, and they know that, and maybe 10 years ago and four years ago, they said no, no, he's not perfect, he's, not perfect and we can't assume. But you know what I'm really good at? I'm really good at making deals and making this country rich and bringing it back. And and I saw Pastor Jeffers, I saw a few of them on television the other night and they said why, do you explain, how do you explain to Donald Trump, and again, I'm Protestant, how do you explain that Donald Trump is leading substantially by substantial numbers with the evangelicals and they said because they're tired of losing they're tired of getting these people that don't do anything that have no energy and it's true people don't have energy. I don't think Ben has the energy, Ben is a nice man, but when you're negotiating against China and you're negotiating against these Japanese guys that are gonna come at you in waves, and they think we're all a bunch of jerks, 'cause our leaders are so stupid and so incompetent and so inept, we need people that are really smart, that have tremendous deal-making skills and that have great, great energy. We had a case where Hillary said, and Jeb said, and they used the same word and it was the same day a couple of weeks ago. I don't like Donald Trump's tone, his tone, my tone, we have people, Christians in Syria and other places, ISIS is chopping off their head, they're chopping off their head, they're drowning them, they're, killing them. If you're a Christian, you have no chance. Do you know that if you're a Christian from Syria it's almost impossible to come into the United States. If you're a Muslim from Syria, it's, the easiest thing to do is to come into the United States, it's one of the easiest places to get in. Can you believe this? But if you're a Christian and they're the ones that need the help you can't get into the United States. Now I don't know who's setting those regulations, I have a pretty good idea. I have a pretty good idea. But it's not gonna happen anymore, but they were saying at the same time they said his tone, t-o-n-e, tone, and I said, you know, we need that tone today. We need energy, we need strength and -- and if we can't be low-key and nice and beautiful, then a woman came up to me and she said, Mr. Trump, I love you I'm a big supporter and it doesn't matter. But I don't know if you're nice enough to be President and I said, actually, you know what, I pride my -- I have so many friends I have great relationships, but some people don't think I'm nice, in a CNN poll I won on almost every topic and they'll tell you back there, they're shooting here, they're all here live, they're all over the place. But you know what? They'll tell you, otherwise I couldn't say it, I once used by huge by three, four times, leadership, the economy every -- almost all the part -- the only thing, I thought it was down the bottom in terms of, is he a nice person? Actually, I think someday I'm gonna win on that, 'cause I am a nice per -- but you know what I told the woman, I don't think it matters this time. I think today we're looking for real super-competence. We ...we're tired with this nice stuff. We need people that are really, really smart and competent and can get things done. We need people, we need people with an aggressive tone, and we need people with tremendous energy, and I'm your candidate, okay? So, so just to finish off, this is a fantastic crowd and -- and I really appreciate it and they said ten minutes and I wanted to go much longer because you had so many people standing out here and it's hot and all of that. But I have to tell you, I love Iowa, I really appreciate that you understand what's going on. The people of Iowa really do get it. They really do get it. And look, you know, you're, you're, hard-working people that really don't want anything you just want to see this country be great again and that's what I'm gonna do I'm gonna make this country great again. I'm gonna make this country greater than it has ever been before. Better. Enjoy. Thank you. Thank you very much. Thank you. We will make America great again."}