{"id":508,"author":"Donald Trump","title":"Speech: Donald Trump in Nashville, TN","date":"2015-08-29","link":"https://factba.se/transcript/donald-trump-speech-nashville-tn-august-29-2015","paragraphs":["So maybe should -- should I ask for charity? Maybe a nice Nashville charity and American Cancer Society and AIDS Research, and so many -- there's so many good -- Alzheimer's, you know there's so many things going on there. Maybe I should ask for a lot of money or I'm not showing up. Because you know it's interesting. So they'll get let's say two million people, a million to two million people at the debates, you know, they've been doing them for a long time.","They don't do great, especially the early Republican debate like, you know the expression who draws flies, that's what it draws. So this was one of the biggest shows in the history of cable television. I think it might have been the biggest in terms of political... In the history of cable television. So I -- I took naturally, I took full credit for it, which at no fairness I should.","I should. So bottom line is, I think I might ask for a lot of money for charity, but you know, but I did say but is it a little hokey if I do that, maybe it's not so nice. So what do you think? Should I do it or not? Maybe not. I don't -- Here's the thing if I don't do it, CNN just makes a lot of money.","I don't care about CNN, honestly. No, they're gonna make a lot of money. They just turned off the camera, like -- they're actually very nice, but they're gonna make a lot of money and, you know, I think it's something we should consider. So we'll all consider together.","But coming over today, I saw that they were having the illegal immigrants come in and somebody mentioned the term, the dreamers, having to do with children and, you know the dreams of children. And these are people that come over the country, the dreamers. And I said. What about our children? Why can't our children, that are in the country, why can't they be the dreamer? Nobody ever talks about that no, no, nobody ever talks about that.","You know, we talk about the dreamers, we talk about illegal immigrants who by the way are treated better than our vets, you know. Our vets are incredible. No, no, the illegal immigrants, in many cases, not in all cases, but in many cases are treated better than our veterans who are the greatest people we have. Our wounded warriors are -- these are the greatest people we have.","And another thing, nice about being able to make speeches without having to hire some guy to write it and write it and keep writing it and read it and put a teleprompter and then say, good morning, ladies and gentlemen. Nashville, it's wonderful, you know, it's -- is that I can sort of be very current, okay? I could be very, very current. I can talk about what's happening this morning on the television. They had a whole story about the Veterans Administration and the hospital's, how people are waiting on lines to get in.","These are our veterans, these are the people that got hurt fighting for us. Maybe we wouldn't be here for wasn't for them, to be honest with you. I mean, that's possible too and they had a story this morning on FOX, on CNN and a number of them where the veterans are just treated terribly. And they showed a desk where they're supposed to be people behind the desk and they showed this desk and there's nobody there, and the veterans -- I don't know, probably some of you saw that the veterans are saying, where are the people, and then they said, oh, this is what happened and they said, oh, this happens all the time, there's not even... Nobody even there.","And two weeks ago on Wednesday, they had the longest wait in the history, in the history of the Veterans Administration for people wanting to see a doctor. Then I go to a doctor. If I have to wait like nine minutes I'm like, get me -- I go crazy, it's true. Remember the old days when the doctors used to come to your house, right? Peter remembers that you have a cold, the doctor would come over carrying a little bag like this big, beautiful little bag being at the top and he'd come to the house, checked you out, fine, those days don't exist anymore, you know, we're in the age of Obamacare where nothing exists.","By the way, we will repeal and replace Obamacare, that I could tell you, that I can tell you. But -- so two weeks ago, Wednesday, the longest wait in the history of the Veterans Administration. So that if you go to a doctor's office, men and women are waiting four days, three days, one was five days, one case was five days or six days. Finally, got to see the doctor and the doctor excused himself because he was going on vacation.","Now you think about that, can you imagine waiting even a day or a half a day, but these people are waiting four or five days. So the waits now are the longest in history and that's the way we're treating our greatest people and it's not right and we're gonna change that, we're gonna change it. We have, right now, and people don't know this, you know, they see these phony statistics put out by politicians, basically. All-talk-no-action-politicians and I mean on both sides, in all fairness, you know, I'm a Republican, I'm a conservative, but I'm just as angry with The Republicans, because they go to Washington, something happens, they become weak, they, you know, they go to Washington, we're, gonna stop Obamacare, we're gonna stop this we're gonna do this we're going to do that.","Then they walk into these magnificent buildings with those incredible vaulted ceilings and they go, oh, I made it darling. I made it, I vote for you. I vote for you. I vote for Obamacare extensions, I'll do whatever you want me to do.","I'm in Washington. It's amazing. Isn't it amazing? Don't you agree? I mean, it won't happen to me, I promise. And if it does you're gonna, let me know about it, but it won't, I promise I promise.","I promise. But you know they show those phony statistics where we're 5.4%, unemployment 5.4. The real number, you know, I actually saw a number, it could be 42%, okay, believe it or not. But when you think about it, we have 93 million people that are right now out of the labor force, 93 million people of the 93 -- Many of these people want jobs and they quit looking.","So if you're looking for a job and you can't find it and you stop for a while, you know after a while you sort of like, it's not happening, it's not gonna happen, I don't know what they do, but they stop. They are considered statistically employed. Okay, so we have 93 million people out of the labor force. I mean, think of it it's hard to believe.","We have 50 million people in poverty, these are very new numbers, 50 million people in poverty. I mean, China's taking our money Japan's taking our money, Mexico's, beating us at the border and on trade, by the way, they're killing us on trade, you know that, but you just want to be car plant to Mexico in Tennessee, remember?","Recently, front-page, Wall Street Journal, a plant that you were going to have -- I love this guy, you know he's sitting there, holding a -- stand up turn around, jump. I love this guy he's just holding the sign up, look at him. Well, I know who he's voting for, I know who that guy's voting for, right? Thank you. That's very cute.","I mean, I love it. You know, this is a movement folks, this is not like even maybe about me, I don't want it to be about me. This is about common sense it's about doing the right thing. One of the things that came out in the poll which was really amazing, some of the polls, I mean, hey, in Iowa, we're leading big, those are great people.","We just left. Iowa, we made -- we had such an amazing evening, 4,000 people in a room that never had that many people and it was a happening. We just left Alabama, which was unbelievable, 31,000 people in the stadium and it was supposed to pour and it did, it poured, the minute my speech -- that's like luck, that's from Go,d the minute the speech was over, we got it and it poured, we had 31,000 people. It was the most unbelievable.","And the poll just came out in Alabama, leading big in, Alabama leading big in Iowa, leading tremendously big in New Hampshire, great people, leading really big in New Hampshire, leading big in Florida. How about Florida? I have a governor -- We have a low-energy governor and we have a senator and we're leading big in Florida. How do you do that? When you have a senator who's sitting, you have a governor who's been there for eight years and Trump -- I love Florida and I'm there a lot. What could be far too great weather, you know great weather, but Florida has great weather, big advantage, but you know I'm leading big in Florida, but one of the polls came out, because, in South Carolina and North Carolina, I'm leading really big.","And in South Carolina, a poll came out and -- and we had a statement that my level of popularity or favorability, you know, I'm the only one that can get a poll, and it comes out, and these guys in the back with all those red lights on, will say, I had one poll where I think I'm 41%, almost 41%. Can you Reg? 41 -- there's, 17 people. So I'm a 41 % with 17 people. And they said Trump's at 41% like, look, look, you can't even hear, you know, Trump said, look, nobody knows what they just said, but there are some people that don't like him, it's, unbelievable I'm, the only one that wins these polls and I get negative publicity it's the most, no it's incredible the press, ay, yay, yay.","No, it's terrible. Well, yesterday you might have seen me, I was in South Carolina, made a speech on how to bring it up, The New York Times to me is a big deal, you know I'm from New York, very liberal paper, but that's, okay. You know, not everybody could be like us, but it's still The New York Times, right? Do we have to admit? Still The New York Times and I'm running the front page a lot on The New York Times and to be on the front page in New York Times is a big deal. But yesterday or two days ago, they had a story about me and they have some low-level Hispanic commentator, low-level guy, this one didn't like me, by the way, I think I'm gonna win the Hispanic vote.","And I think you know in Nevada, I want the Hispanic poll, they love me. I love the Hispanic people, incredible energy, incredible people. I love the people I have so many, I have thousands that work for me in thousands and thousands over the years that have work for me they're great people, but and I said I'm gonna win and a lot of the Hispanics that are here legally, they don't want people coming in illegally, you know, it's true, it's true. So there's this poll that comes out, I think it was in South Carolina where we're way up and Lindsey Graham's at four and he's the senator, I'm at 30.","So I wrote him a note, Congratulations. I'm only beating you in your home state by 26 points. So, anyway who cares, but -- but they did something that nobody reported, they say, yeah, but do people like Trump. By the way, this election is not gonna be like, I think I'm a nice person.","I love people, I want to help people, women's health issues to me are very important. With Jeb Bush it wasn't important because he didn't want to fund him and then he said, oh, I misspoke. But you know I -- I really want to be a nice person. I am a nice person, but I think it's actually gonna be a -- an election based on competence we're tired of being like the patsy for everybody.","I really do, I think it's time, but in the poll, this was the Monmouth poll, big poll. . In another act of political magic, I don't know what's magic. Trump managed to flip his favorability rating from negative, nobody wrote this, by the way, and nobody -- nobody said it, nobody reported it.","From negative to positive. This is an exact quote, I have like this photographic memory, so darn it. But I want to be sure because if I -- if I use the word \"the\"\" incorrectly they'll say","Favorability rating from negative to positive in one poll during the span of a month, a feat that Monmouth University's Patrick Murray, highly respected pollster, called astounding, called it astounding, nobody else wrote about it that defies any rule in presidential politics that I've ever seen, said this highly respected man. Mary, the director of Polling Institute, said, he flipped it from 20 % to 52 % in one month and he said he's never seen that before. And you know what, that's because people have heard me and they say, such a nice person, no, they want -- they... They say he's, a man I've made a tremendous amount of money. I've had tremendous success.","And I don't say that regularly that's the kind of thinking we need in the country, I mean whatever it is, but to me, that statement was more important than actually literally killing everybody in the poll. We were much, much higher than -- more than double everybody. And we are more than double everybody.","You saw at Quinnipiac just came out and that was an amazing poll. I was the same thing, much, much higher, double and triple and quadruple many of these candidates. And the reason is, people in this country are smart. They don't believe a lot of what they see in the media because if you believe these people, you know, why are they doing this? I mean, why are they even saying it? You'd think that if somebody is good for the country and I'll be great for the country, cuz, I'm, gonna make great deals for our country.","We don't win anymore. Our country doesn't win anymore. Do you think if somebody's, even a liberal person or a Democrat Liberal. And I mean really liberal, somebody's gonna make the country, why are they knocking it? Why are they knocking? Why do they fight? You think they'd say, let's, do it it's good, it's good for all of us cuz I cooked these in trouble.","We owe now $19 trillion, you know, I've been saying 18 for a while, but now it starts to go up quickly. And by the way when Obamacare kicks in, which is really kicking in, in 16, you want to see bad deficits. You want to see it go up you're gonna really see it go up because that has a huge negative impact, not only our jobs but on the deficit itself because of the cost and it's no good. Have you been noticing and you've seen it yourself, the premiums have gone through the roof, right? The deductibility, unless you're close to death, you're never gonna use it, you can't use it because the deduct abilities it's so high, but the premiums are up 30, 40 and 50 percent and more it's a disaster.","And on top of that, it's going to cost the country a fortune. So it's not only costing you a lot of money it's going to cost the country a fortune. So we have to do something about it and we have to do something important about it. But when I see the people on television and I have to tell you, I won't mention names, some of them when they hear my name, I was talking.","We have a great reporter today from The Wall Street Journal with us, okay, who came down. And she actually said, you know, some of them when they hear your name, it looks they're a boiler ready to explode, it's true. Yeah, most people, and almost everybody and I jokingly say, but I mean it -- The Bible tops it by a long way.","I say that. I say that that is the first time the other night in Iowa and people like that. But it's true, nothing, nothing tops The Bible, but -- but The Art of the Deal, great success. Many books, bestsellers many, many best sellers.","Then I do the apprentice. I've never been I've never done television, I do the apprentice, it's one of the most successful shows ever on television by the way and NBC renewed The Apprentice, you know that, right? For me, they came up to my office, the head of Comcast, great guy. I won't use names just say, Steve, he said, no, honestly he's a great guy, one of the best in the country. He came up with the heads of NBC and they said six months ago, they said, Donald, we're renewing the apprentice.","Please, you have to do -- you have to do it, I said, honestly, Steve, I'm running for president. I want to make our country great, again, I want to make -- And they didn't believe me and I said it four times, they didn't, believe me, nobody believed I was gonna run. Nobody. My wife didn't even believe me, but now she does.","But she actually said, if you actually say you're, gonna run you're gonna do great because people like you, she actually said, they love you but I don't want to brag. But she said if you actually run, not -- you know, you may run, you may not run, who knows?","Thank you. But she said if you actually say -- so, the NBC guys come up, terrific people. I mean, honestly, I had a great relationship with NBC for 12 years. We had many, many, you know, number ones and The Apprentice and continues to do great.","You know, last season, you know how well it did. So they wanted to renew for many, many shows fact Mark Burnett called up, you know, Mark Burnett did Survivor, Apprentice. So, Mark Burnett, who's a great guy, he calls up because I don't believe it, you're not taking a renewal, the word is renewal, and I said, that's right, Mark, I'm gonna run for president. No, no, no.","You have to -- nobody doesn't take a renewal. It's unheard of, in prime-time television, two hours primetime. Are you crazy? You know, I said, Mark, I have to do this. I've done so well in this country.","I have to do it. We can save -- we can save our country, we can save our country. Well, thank you. You know, the funny thing about The Apprentice, there have been 15 copies of The Apprentice, every single one of them failed.","So then a reporter said to me, why do you think that is? I said because I'm special and I was kidding, I was doing a chuck -- I mean, I should have meant it to be honest, right, but I was sort of kidding and they wrote it and I hated the way it looked in writing. If you know it sounds good when you say it, but it looks so bad, okay. But so I had a great experience. So, so here I am, great schools, great brain, great success, build a great company, do The Apprentice, tremendous success.","When -- when I did The Apprentice, a critic, a certain critic said, it will never be successful because you know, to have a big hit, a really a number one hit, You have to -- and you have to remember that first season had one of the highest ratings ever, the finale of The Apprentice, oh, you remember with the great Bill Rancic and remember how that was? Incredible. But to have a great success, you have to have women, and I'll never forget. I saved the article, right, like Harry Truman said it. Words said, Truman loses and he actually won remember.","But I saved this article, they said, Trump can never succeed on television because why would women want to watch Donald Trump? And I said, am I so bad? Am I so bad? Tell me, am I so bad? And it turned out that women were the biggest base, I mean, those who are the ones that like those well. So you know I saved those things, but no matter how you cut it, we can do something so incredible. And honestly, it's gonna be hard, it's gonna be a lot of work it',s going to be a lot of time. I wouldn't leave the White House, you know Obama always leaves the White House, think of it, you're elected president you're in the White House, why would you want to leave? I think I maybe never leave.","How cool is it? He leaves to go to someplace and go fundraisers. I try, I don't know maybe there's some rule against it. So maybe I can't, but I do the fundraisers in the White House, he had his wife left, I think one was doing The Ellen Show and other was doing another show right next door in Burbank, California. They left a couple of hours difference.","One took Air Force One, one took a beautiful Boeing 757, two planes, a little bit different timing going to the same location going to the same airport to do two different shows and I say why, why aren't they flying or at least the same plane. Now I know what those suckers does, 'cause I happen to have one of them, right? So, so I know what it costs to operate these place. So I would have said much different -- More important the time and the energy and I -- but I would have said Ellen or I would have said whoever's doing the show let's do it from the White House. This way I take a half an hour ago, but I don't spend any money of the taxpayers, think of it, no, think of it, think of it.","And you know the funny thing, the funny thing is that whoever the hostess would like it better we're doing our show live from the White House or something. So we -- we don't pay any money we don't have to fuel up Air Force One, which cost -- do you ever see what it costs to travel in these things? With hundreds and hundreds of securities and you're closing down Burbank, California, I mean every time Obama comes to Manhattan to do a fundraiser, which is often, I say, what's going on? You can't move, they close down all the streets, they close down the city, and he could do it from like, Washington. Fact, he could do it in my new hotel that I buy which are only a couple of bucks, you know, I -- I just -- I'm building strew, I'm building this incredible hotel on Pennsylvania Avenue and it's gonna be incredible The Old Post Office. And I actually got it from the Obama administration, which is hard to -- people say, what's going on? How did Trump get it? One of the most heavily sought after buildings in the history of the General Services Administration, which owned it, you know, they're the ones that made the decision, and I got it and we're building this phenomenal hotel, Trump International Hotel on -- right on Pennsylvania Avenue, directly between Congress and The White House, right, it's gonna open just in time, just in time.","And by the way, listen to this one, we're under budget and ahead of schedule, do you ever hear that from government? Way under budget, so we're actually gonna be opening there, but it'll be great, but he can use my hotel, I'd let him use it free, you just come in, use it, go back to the White House, but you don't have to do that. But you say to yourself, why -- you know, it's a mindset, but more importantly even than the travel, we have so many things we have to do to straighten out our country. You don't want to waste time, you got to do this, you gotta make deals, I've got the greatest dealmakers in the world lined up to make deals for us. Carl Icahn, incredible guy, right? Incredible guy, great deal maker.","I've got some of the best dealmakers in the world. They're all calling me too, you said, you didn't ask me, I have these guys calling me up the best in the world now. I know the best. I also know guys that are overrated.","I know guys that you haven't heard of that honestly are phenomenal. I know a lot that you have heard of that aren't really that good, they're overrated, in my opinion. But I have the best in the world and they're calling me, they want it. They don't want money, they're worth billions of dollars.","But when I put, let's say, Carl Icahn in, I'll say, Carl, do me a favor and handle China we're gonna make a great deal. No, no we're gonna make a great deal because that's what happens, you know that's what happens. So we're, gonna take back our trade. If you look at China, if you look at Japan, I was in Los Angeles a few weeks ago, I saw ships, the biggest ships I've ever seen with cars pouring out, pouring out one after another made in Japan.","Very nice everything spice except it doesn't help us, where does it help us, where does it help us? We sell them beef, beef and then they don't want it because you know, do you ever see what's going on over there? We sell the beef, it goes over there, but -- and it's very perishable. So by the time, it gets over there, then they turn it around, we don't want it. And they have cars coming from these massive, massive ships, massive and they just pour off the ships I'd say what are we doing, how stupid are -- No tax? No nothing. And I'm a free trader, I believe in free trade.","You'd have to say it, but I have to be fair trade when you look at -- when you look at Japan, they take in money up here and we give them money down here. We -- we give nothing, by comparison, it's like, like peanuts, balance it out, fellas, you balance it out, you've got to balance it. A friend of mine is a great manufacturer. As you know, China has -- it's probably the greatest theft in the history of the United States what China has done to us, what they've taken our money, they've taken our jobs, they've taken everything.","They've taken so much and they're creating a bubble and you know, interestingly we're so intertwined now the bubble could take us down, you so good they're so good. And you know, one of the things I'm doing and last night was incredible. We had an amazing event in Massachusetts, right? Oh, look at this, we have a win -- What the hell are you doing in Nashville? What are you doing? What is that? I must have brought those people with me, what are you doing here? There's like Old Home Week. Anyway, so here I am -- I spent millions of dollars during the course on jet fuel, okay? I like a lot of money or jets, but somebody puts up a sign, a hundred dollars to go to this thing.","I didn't know who did it, but somebody puts up a sign. So all over the place I'm spending millions of dollars I'm turning down millions, I don't want your money. I don't want your money, somebody puts a sign up talking about contribution of which you didn't have to make, but they put it up it's all over CNN Trump is asking for $100, I fly my plane someplace, it cost me a fortune. The fuel, the $100, the money that I raised last night, which doesn't go -- it goes toward paying off like the expense or something.","The guy that had it's this great guy, Ernie, a great guy, really successful guy, you know him, right? Ernie. He'll sell you a car any day of the week, right? And you know the guy is like 2,000 people showed up, let them get a little deferment of the roast beef or whatever the hell they're serving. So they put up a sign. I don't want the money I might like four or five million that's hard to turn down, but $100 times, uh, you know some people, and we let the vets say, we'll let this -- most of the people I think came in free and I end up with this big story, Trump accepting contributions.","I can't believe it. I got so angry at my people because somebody put up a sign saying $100, and honestly it's like, first of all, it's peanuts, it doesn't mean anything, but they used it to try and marginalize, they always do. They always do. The bottom line is I am self-funding my campaign, I'm self-funding, I don't want to have anybody get -- I don't need money.","Now with that being said, the small money comes in and it's -- it's not a lot of money, but it's great money like Peter might send me some money, Peter will send me some money, but a woman sent me $7 with a beautiful letter, from Georgia, another person sent me $12, and small money and some sent me $1000. But it doesn't amount to a lot, but that I do like coming in because they invest in the campaign, how do I take the $7 check, right?And send it back to the person who sent it to me from Georgia. Dear Sarah, I'm, sorry, I don't really want your money. How do you write a letter? Like, I want them to invest in it, but you know, they're not going to tell me not to do this or not to do that for China because there are lobbyists for China and they gave me $5 million.","I had a big lobbyist ask me to have, he want to give me $5 million for my campaign. I turned him down. I turned him down And then I see this story on CNN last night. It was disgusting that look there's a sign, $100, somebody does a sign, it was actually a beautiful sign if you want to know the truth, it's so beautiful.","It was beautifully done and they're doing this big thing about all day long last night about I said we had this incredible event and they destroyed it by trying to marginalize and that's the press that's the media. \"","Yeah, the criminal media, I mean, there's truth to it. No, because a lot of times they know it's wrong, but -- but I just want to tell you so important to me and last night was such an incredible event. It was -- it had to be a record for a house. The guy is got a beautiful house, got a big lawn, put up a tent, but we had 2,000 people.","It had it be a wreck. The spirit in that group, the spirit in Alabama, the spirit was so incredible. The spirit in our last meeting in Iowa don't forget when I went to Iowa -- and you know what I love I'm leading with Tea Party, big, I love Tea Party, I love the Tea Party, Tea Party people stand up and take a bow. You have not been true it fairly, no, you haven't been treated fairly.","You have not been treated fairly. You know, people talk about the Tea Party and you talk about marginalizing, at least I have a microphone where I can fight back you people don't the Tea Party people are incredible people. These are people that work hard and they love the country and then they get just beat up all the time by the media, it's disgusting. And you will be surprised how big you are."],"text":" So maybe should -- should I ask for charity? Maybe a nice Nashville charity and American Cancer Society and AIDS Research, and so many -- there's so many good -- Alzheimer's, you know there's so many things going on there. Maybe I should ask for a lot of money or I'm not showing up. Because you know it's interesting. So they'll get let's say two million people, a million to two million people at the debates, you know, they've been doing them for a long time. They don't do great, especially the early Republican debate like, you know the expression who draws flies, that's what it draws. So this was one of the biggest shows in the history of cable television. I think it might have been the biggest in terms of political... In the history of cable television. So I -- I took naturally, I took full credit for it, which at no fairness I should. I should. So bottom line is, I think I might ask for a lot of money for charity, but you know, but I did say but is it a little hokey if I do that, maybe it's not so nice. So what do you think? Should I do it or not? Maybe not. I don't -- Here's the thing if I don't do it, CNN just makes a lot of money. I don't care about CNN, honestly. No, they're gonna make a lot of money. They just turned off the camera, like -- they're actually very nice, but they're gonna make a lot of money and, you know, I think it's something we should consider. So we'll all consider together. But coming over today, I saw that they were having the illegal immigrants come in and somebody mentioned the term, the dreamers, having to do with children and, you know the dreams of children. And these are people that come over the country, the dreamers. And I said. What about our children? Why can't our children, that are in the country, why can't they be the dreamer? Nobody ever talks about that no, no, nobody ever talks about that. You know, we talk about the dreamers, we talk about illegal immigrants who by the way are treated better than our vets, you know. Our vets are incredible. No, no, the illegal immigrants, in many cases, not in all cases, but in many cases are treated better than our veterans who are the greatest people we have. Our wounded warriors are -- these are the greatest people we have. And another thing, nice about being able to make speeches without having to hire some guy to write it and write it and keep writing it and read it and put a teleprompter and then say, good morning, ladies and gentlemen. Nashville, it's wonderful, you know, it's -- is that I can sort of be very current, okay? I could be very, very current. I can talk about what's happening this morning on the television. They had a whole story about the Veterans Administration and the hospital's, how people are waiting on lines to get in. These are our veterans, these are the people that got hurt fighting for us. Maybe we wouldn't be here for wasn't for them, to be honest with you. I mean, that's possible too and they had a story this morning on FOX, on CNN and a number of them where the veterans are just treated terribly. And they showed a desk where they're supposed to be people behind the desk and they showed this desk and there's nobody there, and the veterans -- I don't know, probably some of you saw that the veterans are saying, where are the people, and then they said, oh, this is what happened and they said, oh, this happens all the time, there's not even... Nobody even there. And two weeks ago on Wednesday, they had the longest wait in the history, in the history of the Veterans Administration for people wanting to see a doctor. Then I go to a doctor. If I have to wait like nine minutes I'm like, get me -- I go crazy, it's true. Remember the old days when the doctors used to come to your house, right? Peter remembers that you have a cold, the doctor would come over carrying a little bag like this big, beautiful little bag being at the top and he'd come to the house, checked you out, fine, those days don't exist anymore, you know, we're in the age of Obamacare where nothing exists. By the way, we will repeal and replace Obamacare, that I could tell you, that I can tell you. But -- so two weeks ago, Wednesday, the longest wait in the history of the Veterans Administration. So that if you go to a doctor's office, men and women are waiting four days, three days, one was five days, one case was five days or six days. Finally, got to see the doctor and the doctor excused himself because he was going on vacation. Now you think about that, can you imagine waiting even a day or a half a day, but these people are waiting four or five days. So the waits now are the longest in history and that's the way we're treating our greatest people and it's not right and we're gonna change that, we're gonna change it. We have, right now, and people don't know this, you know, they see these phony statistics put out by politicians, basically. All-talk-no-action-politicians and I mean on both sides, in all fairness, you know, I'm a Republican, I'm a conservative, but I'm just as angry with The Republicans, because they go to Washington, something happens, they become weak, they, you know, they go to Washington, we're, gonna stop Obamacare, we're gonna stop this we're gonna do this we're going to do that. Then they walk into these magnificent buildings with those incredible vaulted ceilings and they go, oh, I made it darling. I made it, I vote for you. I vote for you. I vote for Obamacare extensions, I'll do whatever you want me to do. I'm in Washington. It's amazing. Isn't it amazing? Don't you agree? I mean, it won't happen to me, I promise. And if it does you're gonna, let me know about it, but it won't, I promise I promise. I promise. But you know they show those phony statistics where we're 5.4%, unemployment 5.4. The real number, you know, I actually saw a number, it could be 42%, okay, believe it or not. But when you think about it, we have 93 million people that are right now out of the labor force, 93 million people of the 93 -- Many of these people want jobs and they quit looking. So if you're looking for a job and you can't find it and you stop for a while, you know after a while you sort of like, it's not happening, it's not gonna happen, I don't know what they do, but they stop. They are considered statistically employed. Okay, so we have 93 million people out of the labor force. I mean, think of it it's hard to believe. We have 50 million people in poverty, these are very new numbers, 50 million people in poverty. I mean, China's taking our money Japan's taking our money, Mexico's, beating us at the border and on trade, by the way, they're killing us on trade, you know that, but you just want to be car plant to Mexico in Tennessee, remember? Recently, front-page, Wall Street Journal, a plant that you were going to have -- I love this guy, you know he's sitting there, holding a -- stand up turn around, jump. I love this guy he's just holding the sign up, look at him. Well, I know who he's voting for, I know who that guy's voting for, right? Thank you. That's very cute. I mean, I love it. You know, this is a movement folks, this is not like even maybe about me, I don't want it to be about me. This is about common sense it's about doing the right thing. One of the things that came out in the poll which was really amazing, some of the polls, I mean, hey, in Iowa, we're leading big, those are great people. We just left. Iowa, we made -- we had such an amazing evening, 4,000 people in a room that never had that many people and it was a happening. We just left Alabama, which was unbelievable, 31,000 people in the stadium and it was supposed to pour and it did, it poured, the minute my speech -- that's like luck, that's from Go,d the minute the speech was over, we got it and it poured, we had 31,000 people. It was the most unbelievable. And the poll just came out in Alabama, leading big in, Alabama leading big in Iowa, leading tremendously big in New Hampshire, great people, leading really big in New Hampshire, leading big in Florida. How about Florida? I have a governor -- We have a low-energy governor and we have a senator and we're leading big in Florida. How do you do that? When you have a senator who's sitting, you have a governor who's been there for eight years and Trump -- I love Florida and I'm there a lot. What could be far too great weather, you know great weather, but Florida has great weather, big advantage, but you know I'm leading big in Florida, but one of the polls came out, because, in South Carolina and North Carolina, I'm leading really big. And in South Carolina, a poll came out and -- and we had a statement that my level of popularity or favorability, you know, I'm the only one that can get a poll, and it comes out, and these guys in the back with all those red lights on, will say, I had one poll where I think I'm 41%, almost 41%. Can you Reg? 41 -- there's, 17 people. So I'm a 41 % with 17 people. And they said Trump's at 41% like, look, look, you can't even hear, you know, Trump said, look, nobody knows what they just said, but there are some people that don't like him, it's, unbelievable I'm, the only one that wins these polls and I get negative publicity it's the most, no it's incredible the press, ay, yay, yay. No, it's terrible. Well, yesterday you might have seen me, I was in South Carolina, made a speech on how to bring it up, The New York Times to me is a big deal, you know I'm from New York, very liberal paper, but that's, okay. You know, not everybody could be like us, but it's still The New York Times, right? Do we have to admit? Still The New York Times and I'm running the front page a lot on The New York Times and to be on the front page in New York Times is a big deal. But yesterday or two days ago, they had a story about me and they have some low-level Hispanic commentator, low-level guy, this one didn't like me, by the way, I think I'm gonna win the Hispanic vote. And I think you know in Nevada, I want the Hispanic poll, they love me. I love the Hispanic people, incredible energy, incredible people. I love the people I have so many, I have thousands that work for me in thousands and thousands over the years that have work for me they're great people, but and I said I'm gonna win and a lot of the Hispanics that are here legally, they don't want people coming in illegally, you know, it's true, it's true. So there's this poll that comes out, I think it was in South Carolina where we're way up and Lindsey Graham's at four and he's the senator, I'm at 30. So I wrote him a note, Congratulations. I'm only beating you in your home state by 26 points. So, anyway who cares, but -- but they did something that nobody reported, they say, yeah, but do people like Trump. By the way, this election is not gonna be like, I think I'm a nice person. I love people, I want to help people, women's health issues to me are very important. With Jeb Bush it wasn't important because he didn't want to fund him and then he said, oh, I misspoke. But you know I -- I really want to be a nice person. I am a nice person, but I think it's actually gonna be a -- an election based on competence we're tired of being like the patsy for everybody. I really do, I think it's time, but in the poll, this was the Monmouth poll, big poll. . In another act of political magic, I don't know what's magic. Trump managed to flip his favorability rating from negative, nobody wrote this, by the way, and nobody -- nobody said it, nobody reported it. From negative to positive. This is an exact quote, I have like this photographic memory, so darn it. But I want to be sure because if I -- if I use the word \"the\"\" incorrectly they'll say Favorability rating from negative to positive in one poll during the span of a month, a feat that Monmouth University's Patrick Murray, highly respected pollster, called astounding, called it astounding, nobody else wrote about it that defies any rule in presidential politics that I've ever seen, said this highly respected man. Mary, the director of Polling Institute, said, he flipped it from 20 % to 52 % in one month and he said he's never seen that before. And you know what, that's because people have heard me and they say, such a nice person, no, they want -- they... They say he's, a man I've made a tremendous amount of money. I've had tremendous success. And I don't say that regularly that's the kind of thinking we need in the country, I mean whatever it is, but to me, that statement was more important than actually literally killing everybody in the poll. We were much, much higher than -- more than double everybody. And we are more than double everybody. You saw at Quinnipiac just came out and that was an amazing poll. I was the same thing, much, much higher, double and triple and quadruple many of these candidates. And the reason is, people in this country are smart. They don't believe a lot of what they see in the media because if you believe these people, you know, why are they doing this? I mean, why are they even saying it? You'd think that if somebody is good for the country and I'll be great for the country, cuz, I'm, gonna make great deals for our country. We don't win anymore. Our country doesn't win anymore. Do you think if somebody's, even a liberal person or a Democrat Liberal. And I mean really liberal, somebody's gonna make the country, why are they knocking it? Why are they knocking? Why do they fight? You think they'd say, let's, do it it's good, it's good for all of us cuz I cooked these in trouble. We owe now $19 trillion, you know, I've been saying 18 for a while, but now it starts to go up quickly. And by the way when Obamacare kicks in, which is really kicking in, in 16, you want to see bad deficits. You want to see it go up you're gonna really see it go up because that has a huge negative impact, not only our jobs but on the deficit itself because of the cost and it's no good. Have you been noticing and you've seen it yourself, the premiums have gone through the roof, right? The deductibility, unless you're close to death, you're never gonna use it, you can't use it because the deduct abilities it's so high, but the premiums are up 30, 40 and 50 percent and more it's a disaster. And on top of that, it's going to cost the country a fortune. So it's not only costing you a lot of money it's going to cost the country a fortune. So we have to do something about it and we have to do something important about it. But when I see the people on television and I have to tell you, I won't mention names, some of them when they hear my name, I was talking. We have a great reporter today from The Wall Street Journal with us, okay, who came down. And she actually said, you know, some of them when they hear your name, it looks they're a boiler ready to explode, it's true. Yeah, most people, and almost everybody and I jokingly say, but I mean it -- The Bible tops it by a long way. I say that. I say that that is the first time the other night in Iowa and people like that. But it's true, nothing, nothing tops The Bible, but -- but The Art of the Deal, great success. Many books, bestsellers many, many best sellers. Then I do the apprentice. I've never been I've never done television, I do the apprentice, it's one of the most successful shows ever on television by the way and NBC renewed The Apprentice, you know that, right? For me, they came up to my office, the head of Comcast, great guy. I won't use names just say, Steve, he said, no, honestly he's a great guy, one of the best in the country. He came up with the heads of NBC and they said six months ago, they said, Donald, we're renewing the apprentice. Please, you have to do -- you have to do it, I said, honestly, Steve, I'm running for president. I want to make our country great, again, I want to make -- And they didn't believe me and I said it four times, they didn't, believe me, nobody believed I was gonna run. Nobody. My wife didn't even believe me, but now she does. But she actually said, if you actually say you're, gonna run you're gonna do great because people like you, she actually said, they love you but I don't want to brag. But she said if you actually run, not -- you know, you may run, you may not run, who knows? Thank you. But she said if you actually say -- so, the NBC guys come up, terrific people. I mean, honestly, I had a great relationship with NBC for 12 years. We had many, many, you know, number ones and The Apprentice and continues to do great. You know, last season, you know how well it did. So they wanted to renew for many, many shows fact Mark Burnett called up, you know, Mark Burnett did Survivor, Apprentice. So, Mark Burnett, who's a great guy, he calls up because I don't believe it, you're not taking a renewal, the word is renewal, and I said, that's right, Mark, I'm gonna run for president. No, no, no. You have to -- nobody doesn't take a renewal. It's unheard of, in prime-time television, two hours primetime. Are you crazy? You know, I said, Mark, I have to do this. I've done so well in this country. I have to do it. We can save -- we can save our country, we can save our country. Well, thank you. You know, the funny thing about The Apprentice, there have been 15 copies of The Apprentice, every single one of them failed. So then a reporter said to me, why do you think that is? I said because I'm special and I was kidding, I was doing a chuck -- I mean, I should have meant it to be honest, right, but I was sort of kidding and they wrote it and I hated the way it looked in writing. If you know it sounds good when you say it, but it looks so bad, okay. But so I had a great experience. So, so here I am, great schools, great brain, great success, build a great company, do The Apprentice, tremendous success. When -- when I did The Apprentice, a critic, a certain critic said, it will never be successful because you know, to have a big hit, a really a number one hit, You have to -- and you have to remember that first season had one of the highest ratings ever, the finale of The Apprentice, oh, you remember with the great Bill Rancic and remember how that was? Incredible. But to have a great success, you have to have women, and I'll never forget. I saved the article, right, like Harry Truman said it. Words said, Truman loses and he actually won remember. But I saved this article, they said, Trump can never succeed on television because why would women want to watch Donald Trump? And I said, am I so bad? Am I so bad? Tell me, am I so bad? And it turned out that women were the biggest base, I mean, those who are the ones that like those well. So you know I saved those things, but no matter how you cut it, we can do something so incredible. And honestly, it's gonna be hard, it's gonna be a lot of work it',s going to be a lot of time. I wouldn't leave the White House, you know Obama always leaves the White House, think of it, you're elected president you're in the White House, why would you want to leave? I think I maybe never leave. How cool is it? He leaves to go to someplace and go fundraisers. I try, I don't know maybe there's some rule against it. So maybe I can't, but I do the fundraisers in the White House, he had his wife left, I think one was doing The Ellen Show and other was doing another show right next door in Burbank, California. They left a couple of hours difference. One took Air Force One, one took a beautiful Boeing 757, two planes, a little bit different timing going to the same location going to the same airport to do two different shows and I say why, why aren't they flying or at least the same plane. Now I know what those suckers does, 'cause I happen to have one of them, right? So, so I know what it costs to operate these place. So I would have said much different -- More important the time and the energy and I -- but I would have said Ellen or I would have said whoever's doing the show let's do it from the White House. This way I take a half an hour ago, but I don't spend any money of the taxpayers, think of it, no, think of it, think of it. And you know the funny thing, the funny thing is that whoever the hostess would like it better we're doing our show live from the White House or something. So we -- we don't pay any money we don't have to fuel up Air Force One, which cost -- do you ever see what it costs to travel in these things? With hundreds and hundreds of securities and you're closing down Burbank, California, I mean every time Obama comes to Manhattan to do a fundraiser, which is often, I say, what's going on? You can't move, they close down all the streets, they close down the city, and he could do it from like, Washington. Fact, he could do it in my new hotel that I buy which are only a couple of bucks, you know, I -- I just -- I'm building strew, I'm building this incredible hotel on Pennsylvania Avenue and it's gonna be incredible The Old Post Office. And I actually got it from the Obama administration, which is hard to -- people say, what's going on? How did Trump get it? One of the most heavily sought after buildings in the history of the General Services Administration, which owned it, you know, they're the ones that made the decision, and I got it and we're building this phenomenal hotel, Trump International Hotel on -- right on Pennsylvania Avenue, directly between Congress and The White House, right, it's gonna open just in time, just in time. And by the way, listen to this one, we're under budget and ahead of schedule, do you ever hear that from government? Way under budget, so we're actually gonna be opening there, but it'll be great, but he can use my hotel, I'd let him use it free, you just come in, use it, go back to the White House, but you don't have to do that. But you say to yourself, why -- you know, it's a mindset, but more importantly even than the travel, we have so many things we have to do to straighten out our country. You don't want to waste time, you got to do this, you gotta make deals, I've got the greatest dealmakers in the world lined up to make deals for us. Carl Icahn, incredible guy, right? Incredible guy, great deal maker. I've got some of the best dealmakers in the world. They're all calling me too, you said, you didn't ask me, I have these guys calling me up the best in the world now. I know the best. I also know guys that are overrated. I know guys that you haven't heard of that honestly are phenomenal. I know a lot that you have heard of that aren't really that good, they're overrated, in my opinion. But I have the best in the world and they're calling me, they want it. They don't want money, they're worth billions of dollars. But when I put, let's say, Carl Icahn in, I'll say, Carl, do me a favor and handle China we're gonna make a great deal. No, no we're gonna make a great deal because that's what happens, you know that's what happens. So we're, gonna take back our trade. If you look at China, if you look at Japan, I was in Los Angeles a few weeks ago, I saw ships, the biggest ships I've ever seen with cars pouring out, pouring out one after another made in Japan. Very nice everything spice except it doesn't help us, where does it help us, where does it help us? We sell them beef, beef and then they don't want it because you know, do you ever see what's going on over there? We sell the beef, it goes over there, but -- and it's very perishable. So by the time, it gets over there, then they turn it around, we don't want it. And they have cars coming from these massive, massive ships, massive and they just pour off the ships I'd say what are we doing, how stupid are -- No tax? No nothing. And I'm a free trader, I believe in free trade. You'd have to say it, but I have to be fair trade when you look at -- when you look at Japan, they take in money up here and we give them money down here. We -- we give nothing, by comparison, it's like, like peanuts, balance it out, fellas, you balance it out, you've got to balance it. A friend of mine is a great manufacturer. As you know, China has -- it's probably the greatest theft in the history of the United States what China has done to us, what they've taken our money, they've taken our jobs, they've taken everything. They've taken so much and they're creating a bubble and you know, interestingly we're so intertwined now the bubble could take us down, you so good they're so good. And you know, one of the things I'm doing and last night was incredible. We had an amazing event in Massachusetts, right? Oh, look at this, we have a win -- What the hell are you doing in Nashville? What are you doing? What is that? I must have brought those people with me, what are you doing here? There's like Old Home Week. Anyway, so here I am -- I spent millions of dollars during the course on jet fuel, okay? I like a lot of money or jets, but somebody puts up a sign, a hundred dollars to go to this thing. I didn't know who did it, but somebody puts up a sign. So all over the place I'm spending millions of dollars I'm turning down millions, I don't want your money. I don't want your money, somebody puts a sign up talking about contribution of which you didn't have to make, but they put it up it's all over CNN Trump is asking for $100, I fly my plane someplace, it cost me a fortune. The fuel, the $100, the money that I raised last night, which doesn't go -- it goes toward paying off like the expense or something. The guy that had it's this great guy, Ernie, a great guy, really successful guy, you know him, right? Ernie. He'll sell you a car any day of the week, right? And you know the guy is like 2,000 people showed up, let them get a little deferment of the roast beef or whatever the hell they're serving. So they put up a sign. I don't want the money I might like four or five million that's hard to turn down, but $100 times, uh, you know some people, and we let the vets say, we'll let this -- most of the people I think came in free and I end up with this big story, Trump accepting contributions. I can't believe it. I got so angry at my people because somebody put up a sign saying $100, and honestly it's like, first of all, it's peanuts, it doesn't mean anything, but they used it to try and marginalize, they always do. They always do. The bottom line is I am self-funding my campaign, I'm self-funding, I don't want to have anybody get -- I don't need money. Now with that being said, the small money comes in and it's -- it's not a lot of money, but it's great money like Peter might send me some money, Peter will send me some money, but a woman sent me $7 with a beautiful letter, from Georgia, another person sent me $12, and small money and some sent me $1000. But it doesn't amount to a lot, but that I do like coming in because they invest in the campaign, how do I take the $7 check, right?And send it back to the person who sent it to me from Georgia. Dear Sarah, I'm, sorry, I don't really want your money. How do you write a letter? Like, I want them to invest in it, but you know, they're not going to tell me not to do this or not to do that for China because there are lobbyists for China and they gave me $5 million. I had a big lobbyist ask me to have, he want to give me $5 million for my campaign. I turned him down. I turned him down And then I see this story on CNN last night. It was disgusting that look there's a sign, $100, somebody does a sign, it was actually a beautiful sign if you want to know the truth, it's so beautiful. It was beautifully done and they're doing this big thing about all day long last night about I said we had this incredible event and they destroyed it by trying to marginalize and that's the press that's the media. \" Yeah, the criminal media, I mean, there's truth to it. No, because a lot of times they know it's wrong, but -- but I just want to tell you so important to me and last night was such an incredible event. It was -- it had to be a record for a house. The guy is got a beautiful house, got a big lawn, put up a tent, but we had 2,000 people. It had it be a wreck. The spirit in that group, the spirit in Alabama, the spirit was so incredible. The spirit in our last meeting in Iowa don't forget when I went to Iowa -- and you know what I love I'm leading with Tea Party, big, I love Tea Party, I love the Tea Party, Tea Party people stand up and take a bow. You have not been true it fairly, no, you haven't been treated fairly. You have not been treated fairly. You know, people talk about the Tea Party and you talk about marginalizing, at least I have a microphone where I can fight back you people don't the Tea Party people are incredible people. These are people that work hard and they love the country and then they get just beat up all the time by the media, it's disgusting. And you will be surprised how big you are."}