{"id":509,"author":"Donald Trump","title":"Speech: Donald Trump in Norwood, MA","date":"2015-08-28","link":"https://factba.se/transcript/donald-trump-speech-norwood-ma-august-28-2015","paragraphs":["You don't know how big you are. You don't know the power tell hundreds of thousands of dollars. What do you have to do that for, every week they come out with a new poll, right?","Hey, I'm, rich, I don't need I don't I could hire a hundred poll. I don't want to -- I do I don't want to waste money, you know, why should I pay? I know in one case you guys watched like a hundred and fifty thousand a month and you know then they're arrogant guys, they think they're hot stuff, and they tell the candidate what to say. You gotta say this, got to be politically correct, no way. I don't have time to be political, no it's true, it's true.","I don't -- I don't have time to be political, it takes a lot of time to be politically correct. You saw the Anchor baby thing. Did you see that with where I'm on, and somebody from one of it's the same network, CNN again, he said, you know the name anchor baby is very insulting. I said, what would you call -- and he gave me like, too long it's anchor baby and then Bush, Jeb, Jeb Bush get it caught because he is such a nice person, honest.","If you want a nice person, honestly, you should vote for Jeb, the country's gonna go to hell, but we won't talk about -- No, no, but if you want a nice person. So Jeb has a memo that he signed basically a politically correct memo. You know, don't say this, don't say that, all these things pages of stuff, but one of the things never use the term Anchor baby. So all of a sudden he's using the term Anchor baby this last week.","And with that, with me when I use it, nobody criticizes me, they expect me, they gave up, okay, with him, they killed him, they just killed him, it didn't stop and then he blamed the Asians he said, you know, did you see that? I want to build a wall. Okay, so easy, it's so easy when this clown, Jose Reyes, or whatever the hell is, no, no he's a baseball player, Ramos, actually Jose Reyes, a baseball player, he's a nice baseball -- But when Ramos got up the other day screaming and ranting and rate going crazy and I had all these reporters, actually the reporters were mostly myself because they were all had their hand up and this guy starts screaming. So I even had liberal people from CBS. I actually said to the CBS guy, yes, and this guy stands up and starts screaming.","So when he -- and I actually got a lot of credit for the way we handled him, I didn't do anything like I didn't do anything except for The Times and that's what I alluded to before. The Times said, Donald Trump railed at him and screamed it. I didn't scream at him, but he was screaming at me and much worse than that. They said I wore a toupee can you believe it? I don't wear a toupee and I prove, I won't bring anybody up unless it's -- I won't bring anybody up, but I don't.","But think of it I'm in the front page of the New York Times and the first sentence in the first paragraph has this announcer, Hispanic announcer, that nobody ever heard of, saying they call him something, which means he wears a toupee and I don't. So I'm on the front page in New York Times I can't even talk about it, I'm embarrassed to talk about it. But they also said I was essentially screaming at this guy from Univision, who I happen to be suing for $500 million, they didn't mention it. They also didn't mention that his daughter works for Hillary Clinton.","Do you know that? His daughter works for Hillary Clinton? Oh, you didn't know that? Oh, no, they didn't mention them. No, no. They said I wear a toupee and I was screaming, but they didn't -- No, he's screaming at me. So we very nicely wis -- and then we let him come back and we actually had a nice talk.","He actually seemed like a nice guy after he calmed down a little bit. You know it's a very emotional man, but he said you can't build a wall because you can't do it. So 2,000 years ago in China, we always get back to China, 2,000 years ago The Great Wall of China, Oh, would we like to have a wall? This is a serious wall. Okay.","This is a wall you don't go through so easy. They built a wall 2,000 years ago, that's 13,000 miles, 13, that's a big wall that's serious wall, right? This was 2,000 years ago, I mean, took him like 500 years to build it, so you know, I got to be a little bit -- I got it took a long time at 13,000 miles, it's a long time. They had no tractors. They didn't have caterpillars.","Of course, today we use Komatsu's because they're made in Japan, you can buy them cheaper. How stupid is that? Because they devalue the end so much of people are buying Komatsu's instead of caterpillars. Caterpillar stalkers that it's terrible well we'll change that around believe me, believe me, but -- but they build this wall now we have really 15, I would say, look, we have 2,000 miles as opposed to 13,000, but you don't need it on all of it because some you have natural landscaping, some of you have a lot of places and actually ten years ago everybody wanted the wall built, Hilary want it built, but they couldn't have a great builder. What I do is best is build I'm, not a rendering guy.","I do the building and then do the rendering.","A lot of these guys come in with renderings and that never gets built. Does that make sense to anybody? A female, a veteran 66 -- got raped, sodomized tortured and killed. Raped, sodomized, tortured and killed 66 years old by an illegal immigrant. That they caught, that they caught.","Luckily, but this is what we have. We have stupid people in our government and we have people pouring across the border and you know what, we have great border patrol people. I went there, you probably saw that that's why the hat is so successful. The white one, right.","But I went there, everybody wants to buy the hat now, they like the white one. Then two weeks later I wore the red one, the white one didn't sell. So well the red one sell. Crazy thing but -- but I went to you the border and I got to know the people and I saw people and you know it's rough stuff too rough stuff.","And when I first came in and when I first did my opening statement that I was running for president, I talked about illegal immigration. I was -- I was killed by the Rush Limbaugh, who I think is a terrific guy, said, Rush Limbaugh said, Trump has received more incoming than any human being I've ever seen. Then he goes -- has a news conference and I think he's going to apologize and he doubles down. I got credit for, I got credit.","No, they thought I was going to apologize and I don't mind apologizing, but I have to make a mistake to apologize and I was right, no, but I was right. So for two weeks as Rush said, I took incoming, meaning the media. Hay, yay yay. In fact that was my first two weeks, I said this is gonna be like this for the next year and a half.","I don't know if I can make it. It was brutal now many of the people that talk that way, many of those people, they apologize to me. Everybody says I'm, right? And only because of me is everybody talking about illegal immigration. They wouldn't even be talking about it.","They wouldn't even be talking about it. And we're gonna build a wall and we're gonna get -- you know, the gang members in Baltimore and Chicago and these are some tough dudes, they're gonna be out so fast. One of the first things I'm gonna do is get rid of those gang we're gonna be, you know, you look at what's going on with Baltimore, you look at what's going on in Chicago and Ferguson and St. Louis the other night.","We are gonna get rid of those gang members so fast your head will spin, you know we can be really tough. I just met your cops outside, those police are tough cookies. Those guys, we need law and order. We need law and order.","I mean, they allowed, in one night that first night in Baltimore, they allowed that city to be destroyed and they set it back 35 years one night because the police were not allowed to protect people. They weren't allowed to protect people. We have incredible law enforcement in this country and we have to be -- The head of the police in Chicago is a person I know, originally from New York, he's a phenomenal guy. He can stop things if they're allowed to stop him, he can stop it.","Believe me, we have some incredible people, but we have to be tough. We have to be smart, you know and I know, you're gonna have some bad apples you're gonna have problems. I see some of the things you did too and it's disgusting and it's horrible, but that's such a tiny percentage. The problem is the good work doesn't get shown on television.","All of the good work which is 99.9%, I mean, the good work with the police, it's 99.9%, that one little thing and it's horrible. I agree, I hated some of the things I don't have to go into him. But you know the same ones I because you were sick when you looked at some of them just like I was. But we need law and order.","We need our police, they're great people, they do a phenomenal job. They're right now, afraid to do anything, they're afraid. I mean, I know cities, I won't mention names, but I know cities where police are afraid to even talk to people because they want to be able to retire and have their pension. They don't to be thrown off the police force.","And then you wonder why this crime in our cities. So we need a whole new mindset. We have to build up our military. We have to make our military so strong.","We have to make our military so powerful and so strong. So we never have to use it, we never have to use it. We have to also focus on what we have look, Ukraine, I want Ukraine to be healthy, vibrant and good, but Ukraine is near Germany and all of these European countries, we're now sending F22s that's the newest fighter, the best in the world, we're sending fighters everywhere in Germany, where are all these European countries, it affects them, it affects them and we want to stand alongside of them. I agree.","But why are we leading? The fight Putin hates us, he hates Obama today, less I think he'd like me, I'd get along great with him I think. Wanna know the truth. No, he has no respect for our president and our president doesn't like him and often they don't have good chemistry, to put it mildly, would you say, but I'd get along with these people. Think of it, every country is ripping us off now.","Russia is ripping us up because, in the Iran deal which is gonna go down as one of the worst deals ever, Russia is a big benefit because they're gonna sell air and missiles with the money we give to Iran. Think of that. So one of the biggest beneficiaries is Russia, okay. But think of it.","So Ukraine, let's take a few of these things. And then I'm getting the hell out of here, I'm going back to New York, you mind? Maybe I'll go to the Grand Olde Opry tonight. Can I do that? I'd actually rather, I love -- I, by the way, this is not a politician's speech, believe me. I hope, I love country music, I love it.","Hey, Trace Adkins, right, and who else won on The Apprentice, who else? John Rich, my -- my kids love those two guys, a John Rich and who else who did really well, Clint Black, right? Clint Black he did, he did great and my Trace, how good is Trace? Okay. You know, Trace came on to The Apprentice, and no, I said, who the hell is he. Who is he? I didn't know who Trace was, I never heard of him and he wasn't a big-name and he came on just to show you how important that show was. And his record or album or whatever you call it now, this used to be records, and album said this Nagavalli, but whatever it was, it went to number one.","And then he came to me the next year and he didn't. He came in second that he came in first, he did it twice he's and by the way he's a fantastic guy, so is John. So it's, Clint, these are great people. These are great people.","These are great people. But Trace came to me, and he goes, you know, a certain to watch, I won't mention the name, but he said, you know, last year I couldn't get into the show and this year I'm hosting it. Mr. Trump all because of you.","Nice, right? No, nice. But those three guys they're great and we, you know, we're... They're just fantastic people, but we've got to make our country so strong. We have to make our country rich again, a person came up said, oh, that's not nice what's, not nice. They said, rich, you know to say we're, gonna make our country rich, we can't make our country great if we're gonna be poor, we're a debtor nation.","We own $19 trillion. China, think of this, China, we owe $1.4 trillion to. So they come in, they take our jobs, they take our money, they take our base, they take our manufacturing, and we owe them $1.4 trillion. How do you do that? That's like a magic act, right? It's true.","Japan sells us cars by the millions. They make a fortune. They come in, they sell us cars by the millions and we owe them the exact same amount. We owe them $1.4 trillion.","How come if they're selling those cars, we owe them money, think of it put on your business. So you have a natural instinct for this stuff, you know, right? If we -- if we buy all these cars, why do I -- why do we owe that money, but we owe them because they take all that money that they make and they buy our bonds and we owe -- and we're paying interest on them and we owe them money. So it'll change, it can change it's, not even gonna be hard. We have the cards, people don't realize.","See Obama, never read The Art of the Deal. People don't realize. Oh, and somebody said, it was Sharon, where's Sharon? Stand up, Sharon. She gave me such a hard time, where's Sharon? Where the hell is she? You could have both Sharon's stand up actually.","Where are they? Both of them, Sharon. Sharon is great. Oh, did they go after her? Woah. You took him -- Where's my other Sharon, I get the hell off... Say she come on doctor.","She took a lot of incoming, Sharon, did you take some -incoming, I think so, right? Get off stage, get it... Come on, ba-bye. Thank you, darling. So we are going to do something that if I get elected, and again, they said he'd never run now and actually the pundits, the greatest thing, these guys that didn't even give me a kiss and it's... Give me a break, not gonna happen, he's a great business -- One guy said, John McLaughlin, you ever watch The McLaughlin Report, I like him, and one of the people on the little group said Donald Trump is a great businessman, but he'll never make it as a, you know, president he'll never get elected on [Inaudible. And John McLaughlin, just crusty guy, who I like, I don't know him, I never met him, I don't think, but I like he's sitting there, goes, and he got angry.","He goes why wouldn't he make it? You tell me, why he's been a tremendous success at everything he's done. I go all over the world, I see his name. I see his name all over, he's a great success. And he said I think this is the word he's a man of great achievement.","Why wouldn't he make it? And -- and I thought it was so nice and the other guy just sort of showed up, and you know, because you need somebody of great achievement you need, I produce tens of thousands of jobs over the year. I don't have to worry about Obamacare. I take such good care of my employees. I have thousands of employees.","I take good care of them. We have great plans. My employees are lucky. They hit the lotto, okay.","But I take great care education and health care. And my people are very happy, but I've done this for a long time and I've seen ups and downs, I've seen market crashes and I've seen friends of mine go bankrupt. You never seen -- I've never gone bankrupt. By the way, I've used the loss to my advantage and companies, I buy a company, I throw it into a chapter, and negotiate with banks, I kill -- you know.","And then they say, Trump goes bankrupt. These people, they don't happen to -- Now when other people do that when a car does it or they do it all the time, I mean they use it all the time it's called using your head, it's called using the laws. I did actually, I did a good job didn't I in the debate, when Chris Matthews, so angrily said and I do what every other great businessman does. I buy a company, you know it's one company was sort of interesting, a friend of mine had it, good guy.","And the banks were just killing him. They were mean and they'd be a banks can be mean right. You gotta teach him how to behave, right? So this guy was just getting beaten and I get him a favor. And I called up the banks, I said, do me this, do this, do this do that? They said we won't do that.","No, we won't do it. I say you make it a mistake. Anyway, it's sort of a little bit complicated and it's a little unknown. And I bought it immediately, I stick on the back.","I said don't do this, I threw it into a chapter and they come out with a story, Trump files back. Can you believe it? I negotiated the hell, like what I did to that Bank? Ay yay yay, that poor man. They see me walking down the street, they go, hey, hey, hey. But then I'm good at that stuff, you know, I'm really good at that stuff, but you have to use the laws to your advantage.","No, no, you have to use it to your advantage. Atlantic City, you know, you look at Atlanta City, Caesars went bankrupt, Caesars. Whoever heard of Caesars? Ceasars filed Chapter 11, nobody cares.","You're, right? Everybody in Atlantic City, I had the good sense. Seven years and actually the -- the financial media gives me great credit because I have a vision for things. I said don't go into Iraq, even though I'm a very militaristic person. I said don't go into Iraq and they shouldn't have because I said you're gonna destabilize the Middle East.","So what do we get? $2 trillion, thousands of deaths, thousands like 5,000 wounded warriors who I love all over the place. We can't even go there. Iran is taking over Iraq with the money that we're giving them they're gonna take off. They got to get the oil they're gonna get everything the oil they don't get, Isis get it.","What didn't we get? Nothing, we got nothing, we got far less than nothing. So I had a vision, in 2004, Reuters, actually is before them, but they wrote a story. Trump says don't do Iraq. Now I'm much more militaristic than Bush, even the brother.","But you got to know where to use it and when.","You got to use -- so with Atlantic City, seven years ago, I got out that's called vision, I should get credit for vision. And again this isn't bragging. Normally I wouldn't say this, but I need you freaking votes. Do you understand that? Do you understand that? Last night in front of the audience, I said we're gonna have so many victories, and then I said, we're gonna win here, we're gonna win on trade, we're gonna win militarily in terms of not having wars but just having such great strengths that nobody's gonna play with us, nobody's gonna mess with us, okay, nobody.","And we're gonna have victories, so many victories are gonna be coming out of you. In fact, you may get tired of victories, you may not want any more you'll get like, oh and everyone stood up. No, no, no, we want to keep winning. If I win, we will have victories all over.","We will win on trade, we will win on health care, we will win on everything. I will protect your Social Security without cuts. I will protect your Medicare and your Medicaid. We are going to have something that's so special and you know my whole theme is, and I'll say it once, We will make America truly great again, we will make America great.","And I'll tell you one thing, if I get in, they are going to be gone so fast out of this country. They're going to be gone so fast. I mean, you take a look what's happening and you have illegal immigrants and gangs that you wouldn't even believe they're gonna be gone. Okay.","Yeah, go ahead. Go ahead. A lot of questions in this group. Wow, how long are we gonna be doing this? There are a lot of questions.","They're great questions, but we got a lot of people out there. Go ahead.","I am patriots country and I mentioned Tom Brady, yes.","Leave Tom Brady alone, right? We love Tom Brady. Well, as you know, he's a very good friend of mine. I know Tom Brady, Tom Brady is an honest guy, he's a great guy, he's a great champion and winner, leave him alone.","Yes.","The infrastructure of the country is crying.","It's a great question. We have to rebuild the infrastructure of the United States. We're spending money supporting countries that don't even like us, we're giving military weapons to countries that flee as soon as they hear a bullet is shot. I always tell the story of 2,300 Humvees, armor-plated, the best in the world, a bullet goes off and everybody runs and the enemy takes over.","Think of it, 2,300, we have to rebuild our country, we have to rebuild our military. Our military is going to be so strong that nobody, nobody is going to mess with us, nobody, okay. And our vets are gonna be taken care of. Yes, ma'am.","You see, it's coming, you see the immigration plan, build a wall. Who likes the idea of the wall? I love it. Somebody said you can't build a wall, you know the Great Wall of China is 13,000 miles. This wall is 2,000, it's really less, but you really need a thousand.","So they could do 2,000 years ago. They could build the Great Wall of China, but then they say how do you build a thousand mile? Give me a break. So easy and it'll be great. Yes, sir, go ahead.","No, I don't think you have to raise taxes at all. There's, so much fat in Washington, that if somebody got in that knew what they were doing, you don't have to raise taxes. We want to lower taxes.","We want to lower taxes. All right. One more question. Yes, go ahead.","Well, I may change him around I know hedge-fund-guys that pay almost nothing and they make a fortune. I want to see lower taxes and I'm gonna make a determination, but on some people, they're not doing their fair share. These hedge-fund-guys, I hate to say many are friends of mine and most of them support Hillary Clinton and Jeb Bush. Just so you understand.","They're not supporting me because I told them I don't want your money, but the hedge-fund-guys have to pay up. Okay, one or two more, go ahead. Yes.","Who do I want to face in the -- I don't really don't care and I haven't focused in them I'm focusing on the 16 people, that right now are looking to do well, most of them are not doing well at all. A poll just came out. You probably saw the Gravis Fall and that poll is where at 40%, more than 40%. Yesterday you had a great poll come out, that's a 28%, we're doing great.","In New Hampshire were 35%. The public, you know, public policy, which is 35%, we're leading in Iowa, we're leading in New Hampshire, we're leading in South Carolina, in North Carolina, the State of Nevada, the State of Florida, here you have a governor and a senator from Florida and not only leading but leading by a lot. People want to see real change, not Obama-change but real change, really positive. And you know what, they want to see more than anything else.","They want to see victory. We don't have victories anymore. This country doesn't have victories anymore and they're gonna see so many victories. They may get tired of winning that much.","I don't know, it's possible they'll get tired of winning that much, you're gonna see so many victories if I'm elected president. Okay, thank you all very much. I've gotta go, you know we had -- we had a tremendous crowd at the airport. It was amazing.","I hope they were able to come over here, but we were greeted with hundreds and hundreds of people at the airport. There's something happening there's a movement going on, call it silent majority, call it whatever you want, but there is a movement going on. Thank you all very much."],"text":" You don't know how big you are. You don't know the power tell hundreds of thousands of dollars. What do you have to do that for, every week they come out with a new poll, right? Hey, I'm, rich, I don't need I don't I could hire a hundred poll. I don't want to -- I do I don't want to waste money, you know, why should I pay? I know in one case you guys watched like a hundred and fifty thousand a month and you know then they're arrogant guys, they think they're hot stuff, and they tell the candidate what to say. You gotta say this, got to be politically correct, no way. I don't have time to be political, no it's true, it's true. I don't -- I don't have time to be political, it takes a lot of time to be politically correct. You saw the Anchor baby thing. Did you see that with where I'm on, and somebody from one of it's the same network, CNN again, he said, you know the name anchor baby is very insulting. I said, what would you call -- and he gave me like, too long it's anchor baby and then Bush, Jeb, Jeb Bush get it caught because he is such a nice person, honest. If you want a nice person, honestly, you should vote for Jeb, the country's gonna go to hell, but we won't talk about -- No, no, but if you want a nice person. So Jeb has a memo that he signed basically a politically correct memo. You know, don't say this, don't say that, all these things pages of stuff, but one of the things never use the term Anchor baby. So all of a sudden he's using the term Anchor baby this last week. And with that, with me when I use it, nobody criticizes me, they expect me, they gave up, okay, with him, they killed him, they just killed him, it didn't stop and then he blamed the Asians he said, you know, did you see that? I want to build a wall. Okay, so easy, it's so easy when this clown, Jose Reyes, or whatever the hell is, no, no he's a baseball player, Ramos, actually Jose Reyes, a baseball player, he's a nice baseball -- But when Ramos got up the other day screaming and ranting and rate going crazy and I had all these reporters, actually the reporters were mostly myself because they were all had their hand up and this guy starts screaming. So I even had liberal people from CBS. I actually said to the CBS guy, yes, and this guy stands up and starts screaming. So when he -- and I actually got a lot of credit for the way we handled him, I didn't do anything like I didn't do anything except for The Times and that's what I alluded to before. The Times said, Donald Trump railed at him and screamed it. I didn't scream at him, but he was screaming at me and much worse than that. They said I wore a toupee can you believe it? I don't wear a toupee and I prove, I won't bring anybody up unless it's -- I won't bring anybody up, but I don't. But think of it I'm in the front page of the New York Times and the first sentence in the first paragraph has this announcer, Hispanic announcer, that nobody ever heard of, saying they call him something, which means he wears a toupee and I don't. So I'm on the front page in New York Times I can't even talk about it, I'm embarrassed to talk about it. But they also said I was essentially screaming at this guy from Univision, who I happen to be suing for $500 million, they didn't mention it. They also didn't mention that his daughter works for Hillary Clinton. Do you know that? His daughter works for Hillary Clinton? Oh, you didn't know that? Oh, no, they didn't mention them. No, no. They said I wear a toupee and I was screaming, but they didn't -- No, he's screaming at me. So we very nicely wis -- and then we let him come back and we actually had a nice talk. He actually seemed like a nice guy after he calmed down a little bit. You know it's a very emotional man, but he said you can't build a wall because you can't do it. So 2,000 years ago in China, we always get back to China, 2,000 years ago The Great Wall of China, Oh, would we like to have a wall? This is a serious wall. Okay. This is a wall you don't go through so easy. They built a wall 2,000 years ago, that's 13,000 miles, 13, that's a big wall that's serious wall, right? This was 2,000 years ago, I mean, took him like 500 years to build it, so you know, I got to be a little bit -- I got it took a long time at 13,000 miles, it's a long time. They had no tractors. They didn't have caterpillars. Of course, today we use Komatsu's because they're made in Japan, you can buy them cheaper. How stupid is that? Because they devalue the end so much of people are buying Komatsu's instead of caterpillars. Caterpillar stalkers that it's terrible well we'll change that around believe me, believe me, but -- but they build this wall now we have really 15, I would say, look, we have 2,000 miles as opposed to 13,000, but you don't need it on all of it because some you have natural landscaping, some of you have a lot of places and actually ten years ago everybody wanted the wall built, Hilary want it built, but they couldn't have a great builder. What I do is best is build I'm, not a rendering guy. I do the building and then do the rendering. A lot of these guys come in with renderings and that never gets built. Does that make sense to anybody? A female, a veteran 66 -- got raped, sodomized tortured and killed. Raped, sodomized, tortured and killed 66 years old by an illegal immigrant. That they caught, that they caught. Luckily, but this is what we have. We have stupid people in our government and we have people pouring across the border and you know what, we have great border patrol people. I went there, you probably saw that that's why the hat is so successful. The white one, right. But I went there, everybody wants to buy the hat now, they like the white one. Then two weeks later I wore the red one, the white one didn't sell. So well the red one sell. Crazy thing but -- but I went to you the border and I got to know the people and I saw people and you know it's rough stuff too rough stuff. And when I first came in and when I first did my opening statement that I was running for president, I talked about illegal immigration. I was -- I was killed by the Rush Limbaugh, who I think is a terrific guy, said, Rush Limbaugh said, Trump has received more incoming than any human being I've ever seen. Then he goes -- has a news conference and I think he's going to apologize and he doubles down. I got credit for, I got credit. No, they thought I was going to apologize and I don't mind apologizing, but I have to make a mistake to apologize and I was right, no, but I was right. So for two weeks as Rush said, I took incoming, meaning the media. Hay, yay yay. In fact that was my first two weeks, I said this is gonna be like this for the next year and a half. I don't know if I can make it. It was brutal now many of the people that talk that way, many of those people, they apologize to me. Everybody says I'm, right? And only because of me is everybody talking about illegal immigration. They wouldn't even be talking about it. They wouldn't even be talking about it. And we're gonna build a wall and we're gonna get -- you know, the gang members in Baltimore and Chicago and these are some tough dudes, they're gonna be out so fast. One of the first things I'm gonna do is get rid of those gang we're gonna be, you know, you look at what's going on with Baltimore, you look at what's going on in Chicago and Ferguson and St. Louis the other night. We are gonna get rid of those gang members so fast your head will spin, you know we can be really tough. I just met your cops outside, those police are tough cookies. Those guys, we need law and order. We need law and order. I mean, they allowed, in one night that first night in Baltimore, they allowed that city to be destroyed and they set it back 35 years one night because the police were not allowed to protect people. They weren't allowed to protect people. We have incredible law enforcement in this country and we have to be -- The head of the police in Chicago is a person I know, originally from New York, he's a phenomenal guy. He can stop things if they're allowed to stop him, he can stop it. Believe me, we have some incredible people, but we have to be tough. We have to be smart, you know and I know, you're gonna have some bad apples you're gonna have problems. I see some of the things you did too and it's disgusting and it's horrible, but that's such a tiny percentage. The problem is the good work doesn't get shown on television. All of the good work which is 99.9%, I mean, the good work with the police, it's 99.9%, that one little thing and it's horrible. I agree, I hated some of the things I don't have to go into him. But you know the same ones I because you were sick when you looked at some of them just like I was. But we need law and order. We need our police, they're great people, they do a phenomenal job. They're right now, afraid to do anything, they're afraid. I mean, I know cities, I won't mention names, but I know cities where police are afraid to even talk to people because they want to be able to retire and have their pension. They don't to be thrown off the police force. And then you wonder why this crime in our cities. So we need a whole new mindset. We have to build up our military. We have to make our military so strong. We have to make our military so powerful and so strong. So we never have to use it, we never have to use it. We have to also focus on what we have look, Ukraine, I want Ukraine to be healthy, vibrant and good, but Ukraine is near Germany and all of these European countries, we're now sending F22s that's the newest fighter, the best in the world, we're sending fighters everywhere in Germany, where are all these European countries, it affects them, it affects them and we want to stand alongside of them. I agree. But why are we leading? The fight Putin hates us, he hates Obama today, less I think he'd like me, I'd get along great with him I think. Wanna know the truth. No, he has no respect for our president and our president doesn't like him and often they don't have good chemistry, to put it mildly, would you say, but I'd get along with these people. Think of it, every country is ripping us off now. Russia is ripping us up because, in the Iran deal which is gonna go down as one of the worst deals ever, Russia is a big benefit because they're gonna sell air and missiles with the money we give to Iran. Think of that. So one of the biggest beneficiaries is Russia, okay. But think of it. So Ukraine, let's take a few of these things. And then I'm getting the hell out of here, I'm going back to New York, you mind? Maybe I'll go to the Grand Olde Opry tonight. Can I do that? I'd actually rather, I love -- I, by the way, this is not a politician's speech, believe me. I hope, I love country music, I love it. Hey, Trace Adkins, right, and who else won on The Apprentice, who else? John Rich, my -- my kids love those two guys, a John Rich and who else who did really well, Clint Black, right? Clint Black he did, he did great and my Trace, how good is Trace? Okay. You know, Trace came on to The Apprentice, and no, I said, who the hell is he. Who is he? I didn't know who Trace was, I never heard of him and he wasn't a big-name and he came on just to show you how important that show was. And his record or album or whatever you call it now, this used to be records, and album said this Nagavalli, but whatever it was, it went to number one. And then he came to me the next year and he didn't. He came in second that he came in first, he did it twice he's and by the way he's a fantastic guy, so is John. So it's, Clint, these are great people. These are great people. These are great people. But Trace came to me, and he goes, you know, a certain to watch, I won't mention the name, but he said, you know, last year I couldn't get into the show and this year I'm hosting it. Mr. Trump all because of you. Nice, right? No, nice. But those three guys they're great and we, you know, we're... They're just fantastic people, but we've got to make our country so strong. We have to make our country rich again, a person came up said, oh, that's not nice what's, not nice. They said, rich, you know to say we're, gonna make our country rich, we can't make our country great if we're gonna be poor, we're a debtor nation. We own $19 trillion. China, think of this, China, we owe $1.4 trillion to. So they come in, they take our jobs, they take our money, they take our base, they take our manufacturing, and we owe them $1.4 trillion. How do you do that? That's like a magic act, right? It's true. Japan sells us cars by the millions. They make a fortune. They come in, they sell us cars by the millions and we owe them the exact same amount. We owe them $1.4 trillion. How come if they're selling those cars, we owe them money, think of it put on your business. So you have a natural instinct for this stuff, you know, right? If we -- if we buy all these cars, why do I -- why do we owe that money, but we owe them because they take all that money that they make and they buy our bonds and we owe -- and we're paying interest on them and we owe them money. So it'll change, it can change it's, not even gonna be hard. We have the cards, people don't realize. See Obama, never read The Art of the Deal. People don't realize. Oh, and somebody said, it was Sharon, where's Sharon? Stand up, Sharon. She gave me such a hard time, where's Sharon? Where the hell is she? You could have both Sharon's stand up actually. Where are they? Both of them, Sharon. Sharon is great. Oh, did they go after her? Woah. You took him -- Where's my other Sharon, I get the hell off... Say she come on doctor. She took a lot of incoming, Sharon, did you take some -incoming, I think so, right? Get off stage, get it... Come on, ba-bye. Thank you, darling. So we are going to do something that if I get elected, and again, they said he'd never run now and actually the pundits, the greatest thing, these guys that didn't even give me a kiss and it's... Give me a break, not gonna happen, he's a great business -- One guy said, John McLaughlin, you ever watch The McLaughlin Report, I like him, and one of the people on the little group said Donald Trump is a great businessman, but he'll never make it as a, you know, president he'll never get elected on You're, right? Everybody in Atlantic City, I had the good sense. Seven years and actually the -- the financial media gives me great credit because I have a vision for things. I said don't go into Iraq, even though I'm a very militaristic person. I said don't go into Iraq and they shouldn't have because I said you're gonna destabilize the Middle East. So what do we get? $2 trillion, thousands of deaths, thousands like 5,000 wounded warriors who I love all over the place. We can't even go there. Iran is taking over Iraq with the money that we're giving them they're gonna take off. They got to get the oil they're gonna get everything the oil they don't get, Isis get it. What didn't we get? Nothing, we got nothing, we got far less than nothing. So I had a vision, in 2004, Reuters, actually is before them, but they wrote a story. Trump says don't do Iraq. Now I'm much more militaristic than Bush, even the brother. But you got to know where to use it and when. You got to use -- so with Atlantic City, seven years ago, I got out that's called vision, I should get credit for vision. And again this isn't bragging. Normally I wouldn't say this, but I need you freaking votes. Do you understand that? Do you understand that? Last night in front of the audience, I said we're gonna have so many victories, and then I said, we're gonna win here, we're gonna win on trade, we're gonna win militarily in terms of not having wars but just having such great strengths that nobody's gonna play with us, nobody's gonna mess with us, okay, nobody. And we're gonna have victories, so many victories are gonna be coming out of you. In fact, you may get tired of victories, you may not want any more you'll get like, oh and everyone stood up. No, no, no, we want to keep winning. If I win, we will have victories all over. We will win on trade, we will win on health care, we will win on everything. I will protect your Social Security without cuts. I will protect your Medicare and your Medicaid. We are going to have something that's so special and you know my whole theme is, and I'll say it once, We will make America truly great again, we will make America great. And I'll tell you one thing, if I get in, they are going to be gone so fast out of this country. They're going to be gone so fast. I mean, you take a look what's happening and you have illegal immigrants and gangs that you wouldn't even believe they're gonna be gone. Okay. Yeah, go ahead. Go ahead. A lot of questions in this group. Wow, how long are we gonna be doing this? There are a lot of questions. They're great questions, but we got a lot of people out there. Go ahead. Mr. Trump, you are in Patriots country, you mentioned Tom Brady, I am patriots country and I mentioned Tom Brady, yes. And the judge wants the two sides to settle. Do you think Brady should settle with the Leave Tom Brady alone, right? We love Tom Brady. Well, as you know, he's a very good friend of mine. I know Tom Brady, Tom Brady is an honest guy, he's a great guy, he's a great champion and winner, leave him alone. Yeah. Yes. Well, The infrastructure of the country is crying. That's my question, what would you do to improve infrastructure around here. It's a great question. We have to rebuild the infrastructure of the United States. We're spending money supporting countries that don't even like us, we're giving military weapons to countries that flee as soon as they hear a bullet is shot. I always tell the story of 2,300 Humvees, armor-plated, the best in the world, a bullet goes off and everybody runs and the enemy takes over. Think of it, 2,300, we have to rebuild our country, we have to rebuild our military. Our military is going to be so strong that nobody, nobody is going to mess with us, nobody, okay. And our vets are gonna be taken care of. Yes, ma'am. You see a lot of across the campaign, but not a lot of . You see, it's coming, you see the immigration plan, build a wall. Who likes the idea of the wall? I love it. Somebody said you can't build a wall, you know the Great Wall of China is 13,000 miles. This wall is 2,000, it's really less, but you really need a thousand. So they could do 2,000 years ago. They could build the Great Wall of China, but then they say how do you build a thousand mile? Give me a break. So easy and it'll be great. Yes, sir, go ahead. In infrastructure, do you have raise taxes to rebuild it? No, I don't think you have to raise taxes at all. There's, so much fat in Washington, that if somebody got in that knew what they were doing, you don't have to raise taxes. We want to lower taxes. Yeah. We want to lower taxes. All right. One more question. Yes, go ahead. More about mortgage taxes, are you going to sign the tax protection plan? Well, I may change him around I know hedge-fund-guys that pay almost nothing and they make a fortune. I want to see lower taxes and I'm gonna make a determination, but on some people, they're not doing their fair share. These hedge-fund-guys, I hate to say many are friends of mine and most of them support Hillary Clinton and Jeb Bush. Just so you understand. They're not supporting me because I told them I don't want your money, but the hedge-fund-guys have to pay up. Okay, one or two more, go ahead. Yes. Who do you want to face in a General? Hillary or Brady Who do I want to face in the -- I don't really don't care and I haven't focused in them I'm focusing on the 16 people, that right now are looking to do well, most of them are not doing well at all. A poll just came out. You probably saw the Gravis Fall and that poll is where at 40%, more than 40%. Yesterday you had a great poll come out, that's a 28%, we're doing great. In New Hampshire were 35%. The public, you know, public policy, which is 35%, we're leading in Iowa, we're leading in New Hampshire, we're leading in South Carolina, in North Carolina, the State of Nevada, the State of Florida, here you have a governor and a senator from Florida and not only leading but leading by a lot. People want to see real change, not Obama-change but real change, really positive. And you know what, they want to see more than anything else. They want to see victory. We don't have victories anymore. This country doesn't have victories anymore and they're gonna see so many victories. They may get tired of winning that much. I don't know, it's possible they'll get tired of winning that much, you're gonna see so many victories if I'm elected president. Okay, thank you all very much. I've gotta go, you know we had -- we had a tremendous crowd at the airport. It was amazing. I hope they were able to come over here, but we were greeted with hundreds and hundreds of people at the airport. There's something happening there's a movement going on, call it silent majority, call it whatever you want, but there is a movement going on. Thank you all very much. "}