{"id":510,"author":"Donald Trump","title":"Speech: Donald Trump Delivers a Campaign Speech in Greenville, SC","date":"2015-08-27","link":"https://factba.se/transcript/donald-trump-speech-greenville-sc-august-27-2015","paragraphs":["Thank you. Wow. Thank you. What a crowd. What a group. You know, sometimes it works. I said to my folks, announce the size of the crowd because you know you set the all time record. They say, 1,800 people. And I said, how were the other candidates? They said, well, Bush had 320 and most of the others were in the hundreds.","And we have 1,800. So give yourself a nice applause. Wow. It's the largest crowd they've had here and it's just an honor. You know, there is something going on that's been amazing. I talk about the silent majority, a term that you haven't heard for a long time because we have not been heard for a long time.","But we're being heard now. Big league. Big league. I wanted to show you something. And it's sort of interesting because you wake up, you pick up the papers, you read the papers. And you know, I've been saying the press is very dishonest, right? Not all of it. There they are. Look, always live television.","I've been repeating this -- every time, I go and it's live television. Other guys go, there's no television. They have a couple of reporters and that's fine. And they give a speech. They mostly read it or they use teleprompters. At that way, you don't get yourself in trouble. There is something about it, right?","And you know, I say, you shouldn't be allowed to use teleprompters because you have to test people's intelligence. If you need teleprompter -- you know, how easy it is? No, no. Do you know how easy it is? You stand there and you read a teleprompter. I don't know. Someday, I'm going to be doing it, I guess, you know.","But the press and some of it's been terrific. Some of the political coverage has been very honest, honorable people and I've met some great journalists. But some is so dishonest, a big chunk of it, 50%, 60%. That's a pretty big job. So I wake up this morning and New York Times and I love the New York Times.","It's great. But I see a story on the front page. I'm the front page. I'm always on the front page of New York Times now. We're gonna set a record for that too, like almost every day. So do you mind if I put on my glasses? Does anybody mind? You know, it's very -- the print gets smaller and smaller and smaller as they lose more and more money.","It's tough. It's true. Remember how big -- do you remember how big those pages used to be? Now, it's supposed to be like a tabloid. You know, I read it this way. But these things used to be massive. Now, they're not so big. But it's still the New York Times and we still love the New York Times. It's a different bent.","Editorially, they kill us all. They don't agree with us, but that's OK. So I pick up. Trump gets earful in Spanish as Latino outlets air disdain. And I'm just saying, what does that mean? And they start off -- now, think this is in the front page. And you know, especially if you come from New York, when you're on the front page, that means like a lot to me. Of the New York Times?","That's a lot. So it talks about a, you know, the whole thing I had with the Spanish journalist. If you call him a journalist. I don't. Actually, he's an advocate for lots of things. So they say here, there's a different person. Front page. Ricardo Sanchez, known as El Mandril on his Spanish drive time radio show in Los Angeles, has taken to calling Donald J. Trump, El hombre del peluquín.","In other words, the man of the toupee. This is on the front page of The New York Times. I don't wear a toupee. It's my hair. I swear. Come here. Come here. Come here. Come here. I'm gonna -- we're gonna settle this. You know Barbara Walters did it. Barbara Walters named me the most whatever it is of the year.","Just come on up here. They're gonna let you. I just -- you have to do an inspection. This is getting crazy. This is great. Just real quick. We don't want to mess it up too much because I do use hairspray. That I say. Come. Come. Is it real? Look. It is. Say it, please. [Audience Member Shouts \"Yes.","I believe it is.\"] Thank you. And have I ever met you before? No. But you're very nice. Thank you. Nice to meet you. Somebody has got a very nice wife. I don't know who she is, but she's got a very nice wife. So I'm on the front page in New York Times. The first sentence says I wear a toupee, and I don't. I swear to you I don't. OK. Now it goes on and it gets worse, by the way.","It says that I was accused -- Mexican immigrants, who I love. By the way, I love Mexican people. I have such a great relationship to Mexico. I hire thousands people. The rich Mexicans, they're great people, friends of mine. They buy my apartments. Just like I love the Chinese people. The problem -- sure they buy my apartments.","They're friends of mine. They live in Trump Tower. They live in many of my buildings. I love the Mexican people. They have tremendous spirit. So here, they have down here -- and they love me. And by the way, I think I'm gonna win the Mexican vote because I'm gonna bring -- and the Hispanic vote generally.","Thousands and thousands of people have worked for me over the years. Hispanic. Because I'm gonna bring jobs back from China and I'm gonna bring jobs back from Japan and all of these people. So now -- no, no. It gets worse. Don't worry. Trump, who has dismissed some Mexican immigrants, listen to this, as rapists and criminals or simply put as Hitler.","Do you believe -- now, the Hitler one I've never heard until this morning when I woke up. I'm not a fan of Hitler. So now they just added the rapist. Now they've just added Hitler into it. So then -- which is all false, by the way, and they know it. And by the way, the Hispanics that are in the country legally, they love me. This thing, we don't want people pouring through the border.","We don't want that, Mr. Trump. They love -- we have a great relationship. So now they talk about this gentleman. Mr. Trump, Spanish Language News Media, he announced his candidacy in June boiled over on Tuesday at a news conference in Iowa, which was an amazing event. You know I made my best speech the other night in Iowa and note -- and it was live on all the networks.","But nobody talked about it because I had this guy getting up and ranting and raving like a lunatic and that was all they covered. They didn't cover my speech. It was the best speech I've ever made. That's my opinion. It's true. They kept covering this maniac in Iowa when the candidate, that's me, erupted, when I erupted.","I never erupted. He erupted. Front page, New York Times. When the candidate erupted at Jorge Ramos, the main news anchor at Univision, who by the way, I'm suing for $500 million. No, I'm suing them. They broke a contract. You know, I'm really good at contracts. If you're a golfer, you know what a plus 5 is. That's really good.","That's like Tiger or Jack in their prime. Plus five -- I'm plus five on contracts. OK, so I'm suing them. They're not happy. When he tried to ask a question without being called on. So he -- so they have me erupting. All I was doing is standing. They're saying no, no, no. Because CBS was asking a question at the time, the room was packed.","It was absolutely packed. It was packed with reporters and it was a news conference. So I'm standing there and I'm saying, OK. Go ahead. Go ahead. Then all of a sudden this guy gets up starts screaming at the top of his lungs and it was unfair to the other reporters and most of them have reported that. And I said, listen, you're gonna have to stop because I haven't called on you yet.","And he wouldn't stop. And it wasn't questions. He were making statements. You all saw it. The problem is the media doesn't cover it that way. So here they have front page of The New York Times that I erupted. I never erupted. I never even raised my voice. In fact, much of the media, the fair media, even some of the liberal media said I really handled the situation well.","Can you believe it? I was shocked. Shocked. So -- but now I'm on the front page of The New York Times saying number one, I wear a toupee and number two, I erupted at this guy. And number three, they said Hitler. I don't like that, OK? So the news media here, you can have it. Anybody want? This -- by the way, there's more in there but I don't want to report it. I'm just -- hey, I'm just showing the stuff in the front page.","I don't have to go back to Page 11. That's really bad. So it's an amazing thing what happens with the -- with the news, with the media. And again, some is really good and some is really accurate and a lot of it's not and it's too bad. But we have a country that's in serious trouble. We don't have victories anymore.","We used to have victories. And you know one of the things that I've been most honored about is when I when I ran and when I decided to run, nobody thought I was gonna run. They said, he's got this great life. He's built his great company. Now a lot of people said I wouldn't run because I'd never report my financials because people thought that I was richer than I might have been.","But then I reported and they said, actually, he's much, much richer than we ever thought. Can you believe it? They didn't know I wanted to report my financials. I might have reported him, if I didn't run. I might have been the only person in history that reports his financials and says, I'm not running but I'm reporting because I like it. I'm proud of the -- I built this incredible company.","But do you remember? Do you remember they said very strongly. They said, he'll never run. The talking heads. You know they get paid like a half a million dollars a year. A lot of these guys on Fox, on CNN, talking heads. They're not very smart guys. They think they're smart but they're not. And I won't mention names because some are actually coming around.","I'm not gonna mention names. You know, I've insulted some of them so badly there's no way they can ever come to my side. The things I've said about certain of them, but a couple of them have come like full circle. They think it's a phenomena. One of them, the people who is killing me, yesterday saying, Donald Trump is a phenomena.","I almost fell off my chair when I heard this. Because what we've done has been amazing and it's not me. There's a movement going on. This is not like a normal -- you know, when you see Bush at 300 people and they're happy. And we have 1,700 or 1,800 people and and it's just such -- there's something happening.","There's something happening. And one of the things that are happening is that we just are tired of politicians who are all talk, no action, don't get anything done. Don't know what they're doing other than getting re-elected and people are tired of it. They're tired of low-energy people. You know, I don't know if you saw, in the same day, Hillary, who I think has got very big problems, by the way.","Very big problems. I think she got bigger problems than whether or not she's gonna run but we'll find out. We'll find out. But Hillary and Jeb -- I can't call him Bush. He doesn't use his last name. You ever see -- Did you ever see a sign that says Jeb Bush or Bush? Now, there's a reason he doesn't use his last name because it's not gonna work too well because we have a lot of problems with that last name.","We had a lot of problems. But in the same day, they said, his tone is not nice, his tone. You know, I view it as energy. There's no energy on the other side. We need tone. We need tough tone. We need it. I mean you know I use this analogy. They said, I don't like his tone. And I said to myself, you know, I just turned on and ISIS was chopping off the heads of three Christians, taking their heads off.","They were dunking them. You saw that with the cages where they dunk them in the ocean and drown them. And they're talking about my tone. We need tough tone. We're gonna be -- we're not gonna have a country anymore. We're not gonna have a country. So I've met so many people over the last period of time and I've met so many vets, who are being mistreated horribly by the incompetent people in Washington.","It's not even the money. They throw money but they -- between the theft that goes on, the bad management. The vets will be taken care of so well under a Trump administration. And I have tremendous support from the vets. They actually did a poll where it was Donald Trump to the vets. Donald Trump against a very well-known senator.","Who do you like better? I blew him away. I blew him away. And the reason is for many, many years, these people they're in Washington and they talk and talk and talk and nothing happens. You know, two weeks ago, on Wednesday, the vets had the longest wait in the history of the Veterans Administration. Meaning in a waiting room.","I go to a doctor. If I have to wait like 12 seconds, I even say, come to my apartment. Can you do that? You know I try and get away with that. You know -- remember the old days where they actually go to your house with my mother. If you weren't feeling well. Doctor, could you come over? he come with a little satchel, right?","Do you remember? We don't have that anymore. But you know if I had to wait like 10 seconds, I'd go nuts. These people are waiting five and six days just to see the doctor. They had one instance where he waited five days. When he got to the doctor, the doctor said I'm sorry, I'm going on vacation for two weeks.","Can you come back? He was sick. And you know a lot of this is stuff that a pill can take care of or a little incision can take care of or something can take care very quickly. You know, where it goes away. And they have to live with it. And it's unfair and it's incompetent. It's incompetent management. And it's not the money because they spend tremendous money.","They spend tremendous money, but it's incompetent people running it. And the new group doesn't know what they're doing. They threw more money. They just keep throwing money. They think throwing money helps, you know? It's like the people that are fighting me for the, for the position of running against the Democrats, who we're gonna win because nobody is gonna want another four years of this Obama stuff.","Nobody. I think we're gonna win. I know I'm gonna win. I know I'm gonna win. But it's like Jeb Bush -- and I keep using him because I used to think he was like the guy that you had to beat. But he's like down. He's going down fast. I don't even know who's second. You know a poll came out today, actually Dr. Carson second.","He's a nice guy. I can't hit him. He's been so nice towards me. It's true. I cannot hit him. And Ted Cruz, Senator Cruz has been so nice to me. I can't hit him. I may have to if he starts getting like really close. I may have to. But you know it's sort of interesting. No, but Ted Cruz has been so great. In fact, I think we're doing something next week or the week after about the Iran PAC.","We're gonna do it in Washington. We're gonna have a tremendous crowd come out. And this Iran PAC, as you talk about incompetent, I mean this is one of the all-time, one of the all-time. But it's like I really was hitting Bush hard. I actually felt sorry for him because he's such a nice person you know. And yesterday, he upped his energy and I've called him a low-energy individual.","We don't need low energy. Our country is falling apart. We're getting beaten at every single corner. We don't have one good trade deal out of hundreds. We're losing money with everybody. China's taking money like a candy from a baby's pocket. Japan is sending millions of cars to our shores. Millions. We send them beef.","We send them wheat. Do you ever see what -- they're up here and we're down here monetarily. Like they're here. We're here. And then they don't want our beef. They send it back. It doesn't last very long. It's called perishable. And I was in Los Angeles and I saw a boat, a ship, like the biggest ship I've ever seen.","Cars from Japan. And it's like so imbalanced. It's so unbalanced. And they're rough and they have a great leader, and we have Carolyn Kennedy representing us, who's a very nice person. I tell all the time. I tell you, why do I like her? Because Ivanka likes her. My daughter. Anybody my daughter likes I like, but I don't want her negotiating for me, please.","Not Carolyn. I told a story about has anyone heard how she got the job? Has anyone heard? Should I tell you the story? So I was on 60 Minutes and it was actually very accurately portrayed because I told the story once before, and it was very accurately portrayed. Carolyn Kennedy went to the White House and she said, you know, nicely, meekly.","I'd like a job. And they said, oh that's good. What would you like to do? Oh do you have anything? Well, how would you like to be the ambassador to Japan? She went, really? This was on 60 Minutes. I'm telling you it's very close because all those live cameras back there. They're gonna test me. You know I can't even exaggerate anymore.","It's true. They're testing me all the time. He said this and it wasn't quite that way. He said the Art of the Deal is the greatest selling business book of all time. I think it was. But now I say, one of them. That way I can't get in trouble. I think it was. So they have Carolyn Kennedy ambassador to Japan.","She goes, really? Wow. She goes, are you serious? They made her Ambassador to Japan. And now they show her in Japan 60 Minutes. And Abe, a killer. He's a killer. Abe is the new head of Japan, right? And Abe is wining and dining her, vetting her, you know, dinners, state dinners. Beautiful. I mean she's a wonderful person.","She doesn't have a clue. So I have Carl Icahn. Does anyone know Carl Icahn? Carl is great. He said, Donald, do me a favor. Stop calling me a killer. But I said, Carl, you're a killer. But he doesn't want me to call a killer. So I will not call him a killer. Is that OK. And I have other guys, very tough. But I said to Carl.","Carl how do you think you do against Japan? Oh, they're killing. No problem. Believe me. Put him in the room. Put them in a room. We're gonna win. All right? No problem. But we're not gonna win with Carolyn Kennedy. We're not gonna win. The first thing I say is if they're selling trillions and we're doing down here like peanuts.","It's got to equalize folks. What kind of a deal is this? China is worse. I love China. I love the people of China. I love -- just like in Mexico. I love the people. The problem with Mexico with China with Japan their leaders are much smarter than our leaders like to a point of no return. We're getting killed.","It's hard to believe. You know, I always used as an excuse, nothing to do with business, but it's a good sort of a reason. Sergeant Bergdahl, right? We know Sergeant Bergdahl, a traitor. Six people died looking for him. He left. He deserted. Went to the other side. He didn't realize the other side wasn't treating him so nice.","You know, they were not too nice to him. They roughed him up. But he says, good. I agree. Good. Drop him back. Give him bullets. Let's retrade that deal. So we get Bergdahl, a traitor, these are the same people that make our trade deals. We get Bergdahl, a traitor, that we don't want. I don't want him. Do you?","Does anybody want him? And they knew that he was a traitor because they had a general and a colonel interviewing the guys and the people that were with him. So they knew he left. It wasn't like, oh they found out later. They knew before the deal was made. So we get a traitor named Bergdahl, six people died trying to find him.","We get him. They get five killers that they've wanted for 10 years. They were released and now they're on the battlefield trying to kill everybody, including us. This is the kind of deals we make. Now you tell me, what's going on with our thinking? What's going on with our country? We're not gonna have a country soon.","So we're gonna have, if I win, the greatest people in the world. And I know more. You know, I come from New York. I got to -- I really deal like at this really high level. I built this incredible company. They said, income over $400 million a year. Do you believe that? What the hell do I want money for? They said, oh do you think he'll want to raise money for his campaign?","What do I need money for? It's ridiculous. I never thought I was gonna make this kind of money. No, I never thought I was gonna make. No, it's true. They have a line called income. And I think it says between like $350 million and $600 million a year. I said, well, that's a lot money. I didn't even know I made that much money.","It's a lot of money. I said to my accounting people that said, yeah, you do really well Mr. Trump. But you know, when I see these guys raising money and I was the king. Nobody was better than me. Don't forget when I'm sort of an outsider now because I ran because I'm not supposed to be running. It's supposed to be these politicians.","They run professionally. They're professional runners. They run. They lose. They win. They keep running. They run. Oh, who cares? With us, it takes guts. You know, business people, it takes guts to run for office. It takes guts. A lot of people said, you'll never run. Everybody was saying I'll never run.","But with a guy like Bush -- and by the way, when I did run. I just said, look, I'm gonna do it. I just saw such stupid things, you turn on, you read the papers, you see, oh how, could this be happening? It's so easy. It's so easy. We're so stupid. How can it be happening? And I saw my wife, I'm just gonna do it. And you know what I did?","The morning of -- that I announced, which was a great announcement because I brought up illegal immigration and I got killed for two weeks. They wouldn't even be talking about immigration had I not made that statement. It's true. It's true. You wouldn't be talking about it. So true. And it's far worse than what I thought.","And oh did I get killed. Rush Limbaugh said, I have never seen a human being receive more incoming. I hadn't heard that incoming, meaning press and I did. I was just being decimated. People said, can you apologize? I said, I can't do that because I know I'm right. I know I'm right. And I talked about the crime and I talked about the problems with illegal immigration.","And I talked about these things and people all of a sudden -- you had the horrible tragedy of Kate in San Francisco and you had many other tragedies. Even the other night, last week, a woman from California, 66 years old, raped, sodomized, tortured and killed by an illegal immigrant. She was a veteran, by the way.","66-year-old woman, raped, sodomized, tortured and killed. And that was in -- last week. And there's many of these instances. So I say we have to do something. We can't have weak people anymore. We just can't. Somebody said, Trump doesn't have the temperament. I have the perfect temperament. I built this great company.","I have perfect temperament. I have the right temperament. In fact, I had my -- I went for a physical because somebody say, oh did you take a physical? Oh, you feel like I'm in good shape, but you got to be careful. And the doctor said, I don't know, 110 blood pressure, like 110. The doctor said, you have the blood pressure of a great athlete.","This is impossible. I have really low blood. Can you imagine if I had high blood pressure, would I be in trouble? I wouldn't be. I would have exploded someplace about 20 years ago. It's true. No, I have low blood pressure. Can you -- nobody believes I have low blood pressure. I have great temperament and you need great temperament.","But you know the other thing that you need and I thought it was so important. Somebody said to me, it was a great compliment, one of the great business guys said, Trump is the most unpredictable guy I've ever -- that's what we need. We need some unpredictability. We really do. And and this business guy, who's a tough cookie.","He said it as a compliment. He said, he's so unpredictable. We never know which way to go. We need unpredictability. We're so predictable. We're like bad checker players and we're playing against Putin, who I would get along with great. I would get along with Putin. You see we're sending planes over. We're sending boats off.","We're sending -- why isn't Germany helping? Why isn't -- why aren't the European countries. You know we're talking about the Ukraine. I feel very strongly about the Ukraine. It's great. But why do we have to be in the lead all the time. So we got that. We're fighting. They're showing these gorgeous brand new F22s, that's the newest and the best.","They're going over for potential conflict with Ukraine. But where are the Europeans? Why are we always doing it? I love Ukraine. I love Ukraine. But what -- why do we always have to be like -- now, we have in North Korea. The guy is acting up again. You know, every six, seven months he starts to act, OK? Now two weeks I ordered 4,000 television sets.","They will come from South Korea. They're making a fortune. I don't know if anybody here -- does anybody make television sets? I swear I pay more money. They don't even make them in the United States anymore. Does anybody make television sets? You know what I mean. Samsung, LG, all of them. They all come from South Korea.","I paid a fortune. They gave me a pretty good price actually. Got a nice one you know with their nice round screen beautiful. 4,000 that's a big order for a big job. And so you ordered wanted all these television and I said, boy, I paid a lot of money. And then you look at the balance between the United States and South Korea.","They're killing us. China, did you see the deficit that we have with China? I mean if you had a business that lost money every year, you'd close it, right? You'd do something. We have a deficit with China. You don't want -- I won't even say the number. It's so ridiculous. It's massive. We have rebuilt China.","And again, I have the largest bank in the world as my tenant from China and they just renewed their lease. I said, are you sure you want to renew your lease on my building? Oh, we love you Mr. Trump. They love me because they're smart. They know I'm telling the truth. They actually just renew their lease for 10 years and -- but the largest in the world, so large they consider Citibank a small subsidiary.","I said, how does Citibank compare? They look at me like, Citibank, that's like nothing. These are massive, massive powerful banks and they can't believe they're getting away with what they're getting away with. They just can't believe it. So we can straighten this out. We need great business minds. There are minds in this room that could do a fantastic job, a fantastic job.","But when you look at what China has done and I said it the other day and I thought it was very good. The greatest theft in the history of the United States and perhaps the world. That's the money that China has taken from the United States and rebuilt itself. Greatest theft. Think of it. That's a pretty big statement, right?","Greatest theft in the history of the United States perhaps the world. Now, that's not only the money. That's the money and the jobs and everything else. So again, I respect China. Great, great, great respect. In fact, the Chinese leaders coming over here next week. We'll give them great dinner. We'll celebrate him.","You don't do that to people that -- you just have lunch. You don't need these big state dinners. You don't need them. They probably leave and they say, what a bunch of dopes. Can you believe the way they treat? So again, whether it's Japan or Mexico or China, I love them. I just wish our leaders were smart.","I know the greatest negotiators in the world. Some are overrated that you heard of. Some are underrated. Some you never heard of. I know the best, like Carl Icahn is one of the best. If I put Carl of Japan. Carl, handle Japan trade deals. It's over. Just walk away. Let him on the road. Oh, forget it. They even know that they don't have a chance, OK? It's over.","And I put another person -- you understand, OK? Not Carolyn Kennedy. I don't -- I love her. Not Carolyn. I said at one of the groups, I said, you know, the people I'm talking about are not nice people. They're vicious, horrible, miserable human beings but they're the greatest negotiators in the world. And I said to the audience, do you care?","And they gave me a standing ovation. They said, we love them. I said you'll never have dinner with them. They think horribly of you. These are terrible people, in many cases, and about 2% of the case, they're actually nice people. But who cares? I want our great negotiators negotiating our deals. I don't want these nice people that got there because they gave political contributions.","It's true. That got there, that got there because they got friendships. I want the best and the brightest and the smartest because that's what we're dealing with. In China, they're so smart. What they've done to their currency is so brilliant. They have manipulated -- now, they may be creating a bubble and they don't care because we're gonna pay the bigger price for the bubble than them.","If that -- if it is in fact a bubble. But when I see these people that are -- and I know some of them. I know some of the people that are our top trade people. I don't want to get personal because they're nice people and they see me and they like me and I like them. They don't like me. I mean, I'm sure behind my back they say bad stuff, but that's OK. They pretend they like me, I will say that, especially now since I'm leading in every poll.","Now they're really liking me. You know why? Because they want to keep their job. But that's not gonna happen. I'm sorry. We're gonna put the right people in. But when I look at Jeb Bush, who raised $125 million. I used to be one of those people. He raised $125 million. Hillary raised 60. But people are really afraid of Jeb now because -- these are people -- you know, there was an article that Jeb's funding is drying up. His -- you know, his -- no, it's drying up. You know why?","Because he's losing so badly to me. He's losing so badly. That people are starting to have -- but it doesn't matter because they thought he was like the establishment guy. He'd walk in. We'd have another Bush. Would have another -- remember the, read my lips, no more taxes. And I liked the father. But do you remember that?","Read my lips, no more -- that was the end of him. When he gave one of the largest tax increases in history. It's the same old stuff. His brother gets us into the mess in Iraq that we never recovered from, then Obama blew it by getting out the wrong way. I mean, look, everybody blew it. Everybody blew it. But when I look at Jeb raising hundreds of millions of dollars, which is honestly the only thing he has.","Without that, he's got nothing, zero. But he'll do attack ads on me at some point. And I tell people, get ready. They'll say just like communist newspaper that I threw up in the air. It will be false stuff. Everybody knows. Look, I've done a great job. Maybe a little controversial but that's OK. I've done a great job.","But when I look at that, all of those people, most of whom I know, many of whom you don't know because it's secret. You know, they should have transparency in giving. Nobody ever talks about that. I want to know who gave. If somebody gives $5 million that's OK. Let me know who he is at least so I know what it is. They don't do that.","You don't have transparency. You should have complete transparency. And the laws are so crazy. You know Jeb puts his best friend in charge of his PAC. They're not allowed to talk. They don't talk. They play golf together or they do get together for -- but they don't talk. We don't talk. We never mentioned anything.","Give me a break. OK. Give me. But when I see this kind of money put into things, the people that put up the money have total control over Jeb, over Hillary over everybody. Total control. Total control. Hey, honestly, nobody played the game better than me. I understand. I was the king. Nobody played it better than me. And it's not necessarily a good system for our country because if you have a lobbyist that gave a lot of money and that lobbyist is representing a country or a company and that lobbyist wants something, that lobbyist is gonna get it. Nine times out of ten, I could practically say 10 times out of 10 that lobbyist is gonna get what he or she wants.","A couple of weeks ago somebody came to me, very powerful lobbyists. I'd like to put money into your campaign, $5 million. I said, oh yeah. You know, I'm a business person. How do you say no, right? I said I don't want it. I don't want your money because he would come to me in two years, three years, four years, one year or six months, who knows?","And he's gonna want something. And it may be not for the good of the country and all I care about is the country. You know I built this -- thank you. You know, I was criticized the other day. They gave me like these great marks for speaking. They said his speech was incredible. But the one flaw is that he speaks through his applause.","In other words, when people get up. So that's why I waited a little while. I'm trying to. No, it's true. But they say his one flaw is his speaking but the -- they like the way I use my hands. Can you believe it. I don't know. No, it's true. They say, oh, he uses his hand so well. I say, really? OK. But the one flaw they said is he speaks through his applause and then I realized, I have to because I don't have the patience to wait.","Does that makes sense? I have so much to say. I'm thinking about so many things. And I have so much to say. I don't really have the patience. So excuse me if I speak through the applause. The hell with it. I don't want to check. But you know -- so when I see the money that we're -- and I'm not just talking about Jeb.","I'm talking so many others. You know, most of the people they have money raised and those people that gave him the money have total control over that particular politician. And one of the things that resonates when I was in Alabama last week, we had 30,000 people. It was unbelievable. Unbelievable. I was in Iowa the other night, we had 4,000 people in a room that never had that many, and it was an amazing evening.","The polls came out, by the way, leading Iowa. A poll just came out, by the way, a poll just came out two days ago, South Carolina 30%. Forget about everything else, right? 30%. In New Hampshire, a great poll, public policy just came out, 35%. I mean the second place is so far back I won't even bother mentioning.","And all of them, North Carolina, the state of Nevada, Florida. In Florida, I'm leading the governor and the senator by a lot. Can you believe that? I love Florida. But people said, this can't be right. This must be a mistake. And then another one, I'm leading by a lot. I'm way up and they're here and here, which doesn't say much for them.","Because how do you lose if you're the governor or the senator and you're losing? That's not a good sign, right? Florida. But we're leading everything. And then today, Quinnipiac just came out, you saw it, 28%. More than double, much more than double second place, which I think was at 12%. That's pretty good.","But the reason is we have a message and the message is and essentially we're not gonna take it anymore. We're just not gonna take it anymore. So a couple of weeks ago we came out with our immigration plan. And it's honestly been met with -- I know you've heard, you know, very controversial no. But generally speaking, it's been met with tremendous applause.","People are tired of what's happening and part of the plan is the wall. And I was criticized, you can't build a wall. How can you -- you're right. She's obviously in the building real estate business, right? Stand up. Are you in the real estate business? And you know what -- can trump build a wall? And it's gonna be so beautiful.","Because someday when I'm no longer around, they'll call it the Trump Wall. It's got to be the greatest wall. Gotta be the greatest. Thank you. Thank you, darling. So I heard so much about you can't build a wall. So here's the story. The wall that they have now is like this. Do you ever see it where they're doing.","They buy a ladder at Home Depot. They're over the wall. This is not the kind of wall, not that kind. I'm probably talking about 50 or 60 foot precast panels, bing, bing, bing. People aren't getting over my wall and they're not going under it. You know, then they said, oh they'll go under. Well you can't because with X-ray equipment you can't go under.","You see it right away. All right? But people who go over my wall. You can go -- do you ever see plank that's laid like for highways where they cross highways. It's concrete plank. It's precast. I'm so good at this. That's actually the thing I'm best at. Hey, is that good to have a president that's really good at construction when we have to build our country, rebuild it, our infrastructure?","We have -- our highways are crumbling. Our bridges are crumbling. Our airports are third world. I went to Dubai, they have an airport the most beautiful thing I've ever seen. Most beautiful. I went to Qatar, they have an airport, the most beautiful I've ever seen. In fact, one of the top people in Qatar was showing me the airport.","Oh, Mr. Trump and then we have this, then we have that and I'm going like -- I'm thinking about LaGuardia. Ayayayay. You know, they have they have to raise their floors, no marble. They have to raise their floors. And when it breaks -- it's 40 years old. When it breaks, they use asphalt, black asphalt on a white floor.","Fill it up with asphalt. And you -- this in the terminal. So you know I'm used to that. So this guy showing me, a wonderful guy showing me the airport in Qatar, which they say cutter I've always said Qatar. So what the hell. I don't care if I mispronounce it. It doesn't matter. I've always said Qatar. So we're in Qatar and he showed me this gorgeous airport, the most beautiful thing I've ever seen.","I said this is the most beautiful airport I've ever seen. He goes, no, no, no, Mr. Trump. No, no, no. This is just temporary. The new airport is being -- and I look at the crane, there's like 70 cranes on the other side, two miles away. I said, what is that? That's our new terminal, Mr. Trump. This gets knocked down after that's complete.","They knocked it down. And it was beautiful. And this is what? We have, we have third world. Go to LAX, LaGuardia, Kennedy, Newark, any of them. We're like third world. And they're building things in Japan and in China. You've never seen anything like it. Parts of the Middle East that haven't blown up yet, by the way.","Those parts that haven't blown up. So we have a chance to be truly great again, truly great again, truly great. I don't mean a little bit. Truly great again. We have a chance to be as good as ever, if not better, believe it or not. We have to take care of our people. We have to build up our military stronger than ever before so we don't have to use it. So we don't have to use it. I don't want to use it. Don't forget, I am the only candidate and I'm the most militaristic person you're ever gonna -- worse than anybody in this room, but you got to use it right or don't use it at all.","Don't use it at all if we can. There's no fear factor. How about we send 2,300 Humvees, armor-plated, beautiful, they're best in the world to our allies in the Middle East, right? You heard about this one too. This is -- I don't mean 23. I don't mean two. I mean 2,300. The most expensive. You know, they were being blown up and our boys and ladies are losing their legs and their arms because they didn't have the armor and all that.","Terrible. Now, we make them incredibly. They can take tremendous damage and you'll be OK. And we sent 2,300 our allies. One big group. One shot is fired. Everybody gets out. They run away. Our enemy now owns all of them, has all of them. 2,300. Think of how many that -- I said, how do you get them over there?","Because when they said that 2,000, I thought they were like you got to be kidding. And I actually thought, you mean 23? No, 2<300 Humvees, the best in the world and we don't have them. We have the ones that are without the armor because ours are old. These are the best. Our enemy has them. Our enemies have lots of our weapons because when we give them to the allies as soon as three and a half bullets go off, they run away.","And they drop everything and they take their uniforms off and they do it. No, I'm just here. I love you very much. OK? Because we're stupid. Because we're stupid and that stuff isn't gonna happen anymore. Not gonna happen anymore. You know, everybody said -- CNN actually did a poll and the poll had -- it was a wonderful poll or believe me I wouldn't be talking about it. But it was a wonderful poll, had me leading.","But more importantly, in the background, they had these different categories. Who's best on leadership? Trump, by far. Who's best on finance and economics? It was like five times so much better than -- they were in the dust. I don't mean like a little bit better. I don't mean two or three times. I mean much better.","And who's better at -- the only thing I did badly on was, is he a nice person? And people said no. He's a -- I was last in terms of niceness, but I think I'm the nicest of all. I just don't want to be taken advantage of. Does that make sense? That was my only weak thing. And a woman came up to me and she had seen the poll.","And she said, Mr. Trump, I just heard your speech. I love what you said but you know what. I don't know if you're nice enough to be president. And I said, number one, I really think I'm a nice person. I help people. I love to help people but. But I really think that this is going to be an election that's not based on niceness.","It's gonna be based on competence and smartness and toughness because we're tired of the nice. We don't need the nice. We need the competent and we're gonna have such a competent brilliant presidency, if I win. And I think we're gonna have a really good chance. You know when people were talking about the polls today, some of the people were like sort of surprised.","And John McLaughlin -- you know John McLaughlin? He does the McLaughlin. But he was arguing with somebody because my poll numbers were good. I was doing very good. He hasn't showed McLaughlin. I never met him. I never met him. I don't know who he is. But he said something that was -- he said, this man has had great achievement and accomplishment all his life, all his life.","I go to Europe, I see his name. I go all over the city, I see his name. I see buildings. I see other things he does. He's a man of great achievement. Why wouldn't he do well? And I thought it was very nice. I wrote him a letter. I said, thank you very much. Thank you very much. One of the things that I'm most proud of is that a few of the people that I'm running against really, really hit me hard.","One was Governor Perry, and he went from 5% to nothing, to nothing. And he would make speeches about me, what a bad guy. I mean he used horrible terms. He used the word cancer. He used horrible terms. I said I'm not a bad person, but he was trying, you know, he was down pretty low and he wanted to get up and I understand.","But he went down. Another one was Senator Lindsey Graham. Has anyone ever heard of Lindsey Graham. This guy, I mean he is he is out of control. I mean he's real -- so a poll came out the other day, he was at 0. 0. Even Pataki was higher. Pataki was at zero with an arrow up that means he got one. But Lindsey Graham actually had zero.","And the other day when the poll came out where I had 30, he had four. And I wrote him a note. I said thank you and congratulations on four, even though it is his home state. You know, this was in his home state. I'm not talking about national. National he still got zero. But in his home state, he had four.","The one that came out two days ago and I had a lot. I had 30. So I congratulated him on getting four and on the fact that I was only up on him by 26 points. That's a lot, right? But no, the level of viciousness from him -- and I don't understand it because he called me three, four years ago. He wanted my help.","He wanted money. He wanted everything. Oh, he'd be so easy if I wanted to. If I cared. He'd be so easy. He'd be so -- you're right. So I am telling you that there is a sense of spirit that I'm seeing in this country, that's unbelievable. The people that I've met are incredible whether it's New Hampshire or Iowa or South Carolina or California or New York.","And people that -- one of the beautiful things in this poll and the shocked. They said, he does great with the Tea Party. A lot of people -- I love the Tea Party. I love the Tea Party. These are great people. They're great people. But he does great with the Tea Party. But he also does great with the moderates and the young and the old and the rich and the poor.","He does great with everything. I even did great with the Democrats. Can you believe it? I think great with the Democrats. Because I have a really, as an expression that's so important and we've used it over and over again, and I actually went out and copyrighted it because people were using it that I'm running against.","A couple other people saw me make a speech. I got this huge standing ovation after I used this term, right? And I said, you know what, I have great lawyers and I heard this guy go and I get it copyrighted. Can you believe it? And the term is make America great again. I got to copyright it because they saw the response and how simple is it. I think this shows about our politician.","They can't even come up with their own terms. They have to copy you right? There are other good terms I could come up with. But I did so think it says anything says it better than that. You know, I use an expression, the American dream. You know the American dream, right? The American dream is dead but I'm gonna make it bigger and better and stronger than ever before.","I am going to do that. The American Dream is in very, very big trouble, but I am gonna make it bigger and better and stronger than ever before. And our military is gonna be great. And the Iran deal, uh, these people, these people. We are gonna make this company. We are gonna make this -- what? We are going to make this country so strong and so powerful and so wonderful and you're going to be so proud of it. And you know like the people that fought me, they seem to be gone.","Well, when countries fight us, without fighting we're gonna beat them. We're gonna beat them a trade. We're gonna have the best military. We're gonna have the best of everything. We are going to be so proud. If I am president, you are going to be so proud of our country. You will be the happiest people. And I just want to thank the people of South Carolina have been incredible to me from day one.","From the first time I came here, they saw what was happening. And we are going to indeed make America great again, may be better than ever before. And I just want to thank you all very much. This is a great honor and thank you all very much. We are gonna have a lot of fun doing it too. Thank you very much. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you very much."],"text":" Thank you. Wow. Thank you. What a crowd. What a group. You know, sometimes it works. I said to my folks, announce the size of the crowd because you know you set the all time record. They say, 1,800 people. And I said, how were the other candidates? They said, well, Bush had 320 and most of the others were in the hundreds. And we have 1,800. So give yourself a nice applause. Wow. It's the largest crowd they've had here and it's just an honor. You know, there is something going on that's been amazing. I talk about the silent majority, a term that you haven't heard for a long time because we have not been heard for a long time. But we're being heard now. Big league. Big league. I wanted to show you something. And it's sort of interesting because you wake up, you pick up the papers, you read the papers. And you know, I've been saying the press is very dishonest, right? Not all of it. There they are. Look, always live television. I've been repeating this -- every time, I go and it's live television. Other guys go, there's no television. They have a couple of reporters and that's fine. And they give a speech. They mostly read it or they use teleprompters. At that way, you don't get yourself in trouble. There is something about it, right? And you know, I say, you shouldn't be allowed to use teleprompters because you have to test people's intelligence. If you need teleprompter -- you know, how easy it is? No, no. Do you know how easy it is? You stand there and you read a teleprompter. I don't know. Someday, I'm going to be doing it, I guess, you know. But the press and some of it's been terrific. Some of the political coverage has been very honest, honorable people and I've met some great journalists. But some is so dishonest, a big chunk of it, 50%, 60%. That's a pretty big job. So I wake up this morning and New York Times and I love the New York Times. It's great. But I see a story on the front page. I'm the front page. I'm always on the front page of New York Times now. We're gonna set a record for that too, like almost every day. So do you mind if I put on my glasses? Does anybody mind? You know, it's very -- the print gets smaller and smaller and smaller as they lose more and more money. It's tough. It's true. Remember how big -- do you remember how big those pages used to be? Now, it's supposed to be like a tabloid. You know, I read it this way. But these things used to be massive. Now, they're not so big. But it's still the New York Times and we still love the New York Times. It's a different bent. Editorially, they kill us all. They don't agree with us, but that's OK. So I pick up. Trump gets earful in Spanish as Latino outlets air disdain. And I'm just saying, what does that mean? And they start off -- now, think this is in the front page. And you know, especially if you come from New York, when you're on the front page, that means like a lot to me. Of the New York Times? That's a lot. So it talks about a, you know, the whole thing I had with the Spanish journalist. If you call him a journalist. I don't. Actually, he's an advocate for lots of things. So they say here, there's a different person. Front page. Ricardo Sanchez, known as El Mandril on his Spanish drive time radio show in Los Angeles, has taken to calling Donald J. Trump, El hombre del peluquín. In other words, the man of the toupee. This is on the front page of The New York Times. I don't wear a toupee. It's my hair. I swear. Come here. Come here. Come here. Come here. I'm gonna -- we're gonna settle this. You know Barbara Walters did it. Barbara Walters named me the most whatever it is of the year. Just come on up here. They're gonna let you. I just -- you have to do an inspection. This is getting crazy. This is great. Just real quick. We don't want to mess it up too much because I do use hairspray. That I say. Come. Come. Is it real? Look. It is. Say it, please. Thank you. And have I ever met you before? No. But you're very nice. Thank you. Nice to meet you. Somebody has got a very nice wife. I don't know who she is, but she's got a very nice wife. So I'm on the front page in New York Times. The first sentence says I wear a toupee, and I don't. I swear to you I don't. OK. Now it goes on and it gets worse, by the way. It says that I was accused -- Mexican immigrants, who I love. By the way, I love Mexican people. I have such a great relationship to Mexico. I hire thousands people. The rich Mexicans, they're great people, friends of mine. They buy my apartments. Just like I love the Chinese people. The problem -- sure they buy my apartments. They're friends of mine. They live in Trump Tower. They live in many of my buildings. I love the Mexican people. They have tremendous spirit. So here, they have down here -- and they love me. And by the way, I think I'm gonna win the Mexican vote because I'm gonna bring -- and the Hispanic vote generally. Thousands and thousands of people have worked for me over the years. Hispanic. Because I'm gonna bring jobs back from China and I'm gonna bring jobs back from Japan and all of these people. So now -- no, no. It gets worse. Don't worry. Trump, who has dismissed some Mexican immigrants, listen to this, as rapists and criminals or simply put as Hitler. Do you believe -- now, the Hitler one I've never heard until this morning when I woke up. I'm not a fan of Hitler. So now they just added the rapist. Now they've just added Hitler into it. So then -- which is all false, by the way, and they know it. And by the way, the Hispanics that are in the country legally, they love me. This thing, we don't want people pouring through the border. We don't want that, Mr. Trump. They love -- we have a great relationship. So now they talk about this gentleman. Mr. Trump, Spanish Language News Media, he announced his candidacy in June boiled over on Tuesday at a news conference in Iowa, which was an amazing event. You know I made my best speech the other night in Iowa and note -- and it was live on all the networks. But nobody talked about it because I had this guy getting up and ranting and raving like a lunatic and that was all they covered. They didn't cover my speech. It was the best speech I've ever made. That's my opinion. It's true. They kept covering this maniac in Iowa when the candidate, that's me, erupted, when I erupted. I never erupted. He erupted. Front page, New York Times. When the candidate erupted at Jorge Ramos, the main news anchor at Univision, who by the way, I'm suing for $500 million. No, I'm suing them. They broke a contract. You know, I'm really good at contracts. If you're a golfer, you know what a plus 5 is. That's really good. That's like Tiger or Jack in their prime. Plus five -- I'm plus five on contracts. OK, so I'm suing them. They're not happy. When he tried to ask a question without being called on. So he -- so they have me erupting. All I was doing is standing. They're saying no, no, no. Because CBS was asking a question at the time, the room was packed. It was absolutely packed. It was packed with reporters and it was a news conference. So I'm standing there and I'm saying, OK. Go ahead. Go ahead. Then all of a sudden this guy gets up starts screaming at the top of his lungs and it was unfair to the other reporters and most of them have reported that. And I said, listen, you're gonna have to stop because I haven't called on you yet. And he wouldn't stop. And it wasn't questions. He were making statements. You all saw it. The problem is the media doesn't cover it that way. So here they have front page of The New York Times that I erupted. I never erupted. I never even raised my voice. In fact, much of the media, the fair media, even some of the liberal media said I really handled the situation well. Can you believe it? I was shocked. Shocked. So -- but now I'm on the front page of The New York Times saying number one, I wear a toupee and number two, I erupted at this guy. And number three, they said Hitler. I don't like that, OK? So the news media here, you can have it. Anybody want? This -- by the way, there's more in there but I don't want to report it. I'm just -- hey, I'm just showing the stuff in the front page. I don't have to go back to Page 11. That's really bad. So it's an amazing thing what happens with the -- with the news, with the media. And again, some is really good and some is really accurate and a lot of it's not and it's too bad. But we have a country that's in serious trouble. We don't have victories anymore. We used to have victories. And you know one of the things that I've been most honored about is when I when I ran and when I decided to run, nobody thought I was gonna run. They said, he's got this great life. He's built his great company. Now a lot of people said I wouldn't run because I'd never report my financials because people thought that I was richer than I might have been. But then I reported and they said, actually, he's much, much richer than we ever thought. Can you believe it? They didn't know I wanted to report my financials. I might have reported him, if I didn't run. I might have been the only person in history that reports his financials and says, I'm not running but I'm reporting because I like it. I'm proud of the -- I built this incredible company. But do you remember? Do you remember they said very strongly. They said, he'll never run. The talking heads. You know they get paid like a half a million dollars a year. A lot of these guys on Fox, on CNN, talking heads. They're not very smart guys. They think they're smart but they're not. And I won't mention names because some are actually coming around. I'm not gonna mention names. You know, I've insulted some of them so badly there's no way they can ever come to my side. The things I've said about certain of them, but a couple of them have come like full circle. They think it's a phenomena. One of them, the people who is killing me, yesterday saying, Donald Trump is a phenomena. I almost fell off my chair when I heard this. Because what we've done has been amazing and it's not me. There's a movement going on. This is not like a normal -- you know, when you see Bush at 300 people and they're happy. And we have 1,700 or 1,800 people and and it's just such -- there's something happening. There's something happening. And one of the things that are happening is that we just are tired of politicians who are all talk, no action, don't get anything done. Don't know what they're doing other than getting re-elected and people are tired of it. They're tired of low-energy people. You know, I don't know if you saw, in the same day, Hillary, who I think has got very big problems, by the way. Very big problems. I think she got bigger problems than whether or not she's gonna run but we'll find out. We'll find out. But Hillary and Jeb -- I can't call him Bush. He doesn't use his last name. You ever see -- Did you ever see a sign that says Jeb Bush or Bush? Now, there's a reason he doesn't use his last name because it's not gonna work too well because we have a lot of problems with that last name. We had a lot of problems. But in the same day, they said, his tone is not nice, his tone. You know, I view it as energy. There's no energy on the other side. We need tone. We need tough tone. We need it. I mean you know I use this analogy. They said, I don't like his tone. And I said to myself, you know, I just turned on and ISIS was chopping off the heads of three Christians, taking their heads off. They were dunking them. You saw that with the cages where they dunk them in the ocean and drown them. And they're talking about my tone. We need tough tone. We're gonna be -- we're not gonna have a country anymore. We're not gonna have a country. So I've met so many people over the last period of time and I've met so many vets, who are being mistreated horribly by the incompetent people in Washington. It's not even the money. They throw money but they -- between the theft that goes on, the bad management. The vets will be taken care of so well under a Trump administration. And I have tremendous support from the vets. They actually did a poll where it was Donald Trump to the vets. Donald Trump against a very well-known senator. Who do you like better? I blew him away. I blew him away. And the reason is for many, many years, these people they're in Washington and they talk and talk and talk and nothing happens. You know, two weeks ago, on Wednesday, the vets had the longest wait in the history of the Veterans Administration. Meaning in a waiting room. I go to a doctor. If I have to wait like 12 seconds, I even say, come to my apartment. Can you do that? You know I try and get away with that. You know -- remember the old days where they actually go to your house with my mother. If you weren't feeling well. Doctor, could you come over? he come with a little satchel, right? Do you remember? We don't have that anymore. But you know if I had to wait like 10 seconds, I'd go nuts. These people are waiting five and six days just to see the doctor. They had one instance where he waited five days. When he got to the doctor, the doctor said I'm sorry, I'm going on vacation for two weeks. Can you come back? He was sick. And you know a lot of this is stuff that a pill can take care of or a little incision can take care of or something can take care very quickly. You know, where it goes away. And they have to live with it. And it's unfair and it's incompetent. It's incompetent management. And it's not the money because they spend tremendous money. They spend tremendous money, but it's incompetent people running it. And the new group doesn't know what they're doing. They threw more money. They just keep throwing money. They think throwing money helps, you know? It's like the people that are fighting me for the, for the position of running against the Democrats, who we're gonna win because nobody is gonna want another four years of this Obama stuff. Nobody. I think we're gonna win. I know I'm gonna win. I know I'm gonna win. But it's like Jeb Bush -- and I keep using him because I used to think he was like the guy that you had to beat. But he's like down. He's going down fast. I don't even know who's second. You know a poll came out today, actually Dr. Carson second. He's a nice guy. I can't hit him. He's been so nice towards me. It's true. I cannot hit him. And Ted Cruz, Senator Cruz has been so nice to me. I can't hit him. I may have to if he starts getting like really close. I may have to. But you know it's sort of interesting. No, but Ted Cruz has been so great. In fact, I think we're doing something next week or the week after about the Iran PAC. We're gonna do it in Washington. We're gonna have a tremendous crowd come out. And this Iran PAC, as you talk about incompetent, I mean this is one of the all-time, one of the all-time. But it's like I really was hitting Bush hard. I actually felt sorry for him because he's such a nice person you know. And yesterday, he upped his energy and I've called him a low-energy individual. We don't need low energy. Our country is falling apart. We're getting beaten at every single corner. We don't have one good trade deal out of hundreds. We're losing money with everybody. China's taking money like a candy from a baby's pocket. Japan is sending millions of cars to our shores. Millions. We send them beef. We send them wheat. Do you ever see what -- they're up here and we're down here monetarily. Like they're here. We're here. And then they don't want our beef. They send it back. It doesn't last very long. It's called perishable. And I was in Los Angeles and I saw a boat, a ship, like the biggest ship I've ever seen. Cars from Japan. And it's like so imbalanced. It's so unbalanced. And they're rough and they have a great leader, and we have Carolyn Kennedy representing us, who's a very nice person. I tell all the time. I tell you, why do I like her? Because Ivanka likes her. My daughter. Anybody my daughter likes I like, but I don't want her negotiating for me, please. Not Carolyn. I told a story about has anyone heard how she got the job? Has anyone heard? Should I tell you the story? So I was on 60 Minutes and it was actually very accurately portrayed because I told the story once before, and it was very accurately portrayed. Carolyn Kennedy went to the White House and she said, you know, nicely, meekly. I'd like a job. And they said, oh that's good. What would you like to do? Oh do you have anything? Well, how would you like to be the ambassador to Japan? She went, really? This was on 60 Minutes. I'm telling you it's very close because all those live cameras back there. They're gonna test me. You know I can't even exaggerate anymore. It's true. They're testing me all the time. He said this and it wasn't quite that way. He said the Art of the Deal is the greatest selling business book of all time. I think it was. But now I say, one of them. That way I can't get in trouble. I think it was. So they have Carolyn Kennedy ambassador to Japan. She goes, really? Wow. She goes, are you serious? They made her Ambassador to Japan. And now they show her in Japan 60 Minutes. And Abe, a killer. He's a killer. Abe is the new head of Japan, right? And Abe is wining and dining her, vetting her, you know, dinners, state dinners. Beautiful. I mean she's a wonderful person. She doesn't have a clue. So I have Carl Icahn. Does anyone know Carl Icahn? Carl is great. He said, Donald, do me a favor. Stop calling me a killer. But I said, Carl, you're a killer. But he doesn't want me to call a killer. So I will not call him a killer. Is that OK. And I have other guys, very tough. But I said to Carl. Carl how do you think you do against Japan? Oh, they're killing. No problem. Believe me. Put him in the room. Put them in a room. We're gonna win. All right? No problem. But we're not gonna win with Carolyn Kennedy. We're not gonna win. The first thing I say is if they're selling trillions and we're doing down here like peanuts. It's got to equalize folks. What kind of a deal is this? China is worse. I love China. I love the people of China. I love -- just like in Mexico. I love the people. The problem with Mexico with China with Japan their leaders are much smarter than our leaders like to a point of no return. We're getting killed. It's hard to believe. You know, I always used as an excuse, nothing to do with business, but it's a good sort of a reason. Sergeant Bergdahl, right? We know Sergeant Bergdahl, a traitor. Six people died looking for him. He left. He deserted. Went to the other side. He didn't realize the other side wasn't treating him so nice. You know, they were not too nice to him. They roughed him up. But he says, good. I agree. Good. Drop him back. Give him bullets. Let's retrade that deal. So we get Bergdahl, a traitor, these are the same people that make our trade deals. We get Bergdahl, a traitor, that we don't want. I don't want him. Do you? Does anybody want him? And they knew that he was a traitor because they had a general and a colonel interviewing the guys and the people that were with him. So they knew he left. It wasn't like, oh they found out later. They knew before the deal was made. So we get a traitor named Bergdahl, six people died trying to find him. We get him. They get five killers that they've wanted for 10 years. They were released and now they're on the battlefield trying to kill everybody, including us. This is the kind of deals we make. Now you tell me, what's going on with our thinking? What's going on with our country? We're not gonna have a country soon. So we're gonna have, if I win, the greatest people in the world. And I know more. You know, I come from New York. I got to -- I really deal like at this really high level. I built this incredible company. They said, income over $400 million a year. Do you believe that? What the hell do I want money for? They said, oh do you think he'll want to raise money for his campaign? What do I need money for? It's ridiculous. I never thought I was gonna make this kind of money. No, I never thought I was gonna make. No, it's true. They have a line called income. And I think it says between like $350 million and $600 million a year. I said, well, that's a lot money. I didn't even know I made that much money. It's a lot of money. I said to my accounting people that said, yeah, you do really well Mr. Trump. But you know, when I see these guys raising money and I was the king. Nobody was better than me. Don't forget when I'm sort of an outsider now because I ran because I'm not supposed to be running. It's supposed to be these politicians. They run professionally. They're professional runners. They run. They lose. They win. They keep running. They run. Oh, who cares? With us, it takes guts. You know, business people, it takes guts to run for office. It takes guts. A lot of people said, you'll never run. Everybody was saying I'll never run. But with a guy like Bush -- and by the way, when I did run. I just said, look, I'm gonna do it. I just saw such stupid things, you turn on, you read the papers, you see, oh how, could this be happening? It's so easy. It's so easy. We're so stupid. How can it be happening? And I saw my wife, I'm just gonna do it. And you know what I did? The morning of -- that I announced, which was a great announcement because I brought up illegal immigration and I got killed for two weeks. They wouldn't even be talking about immigration had I not made that statement. It's true. It's true. You wouldn't be talking about it. So true. And it's far worse than what I thought. And oh did I get killed. Rush Limbaugh said, I have never seen a human being receive more incoming. I hadn't heard that incoming, meaning press and I did. I was just being decimated. People said, can you apologize? I said, I can't do that because I know I'm right. I know I'm right. And I talked about the crime and I talked about the problems with illegal immigration. And I talked about these things and people all of a sudden -- you had the horrible tragedy of Kate in San Francisco and you had many other tragedies. Even the other night, last week, a woman from California, 66 years old, raped, sodomized, tortured and killed by an illegal immigrant. She was a veteran, by the way. 66-year-old woman, raped, sodomized, tortured and killed. And that was in -- last week. And there's many of these instances. So I say we have to do something. We can't have weak people anymore. We just can't. Somebody said, Trump doesn't have the temperament. I have the perfect temperament. I built this great company. I have perfect temperament. I have the right temperament. In fact, I had my -- I went for a physical because somebody say, oh did you take a physical? Oh, you feel like I'm in good shape, but you got to be careful. And the doctor said, I don't know, 110 blood pressure, like 110. The doctor said, you have the blood pressure of a great athlete. This is impossible. I have really low blood. Can you imagine if I had high blood pressure, would I be in trouble? I wouldn't be. I would have exploded someplace about 20 years ago. It's true. No, I have low blood pressure. Can you -- nobody believes I have low blood pressure. I have great temperament and you need great temperament. But you know the other thing that you need and I thought it was so important. Somebody said to me, it was a great compliment, one of the great business guys said, Trump is the most unpredictable guy I've ever -- that's what we need. We need some unpredictability. We really do. And and this business guy, who's a tough cookie. He said it as a compliment. He said, he's so unpredictable. We never know which way to go. We need unpredictability. We're so predictable. We're like bad checker players and we're playing against Putin, who I would get along with great. I would get along with Putin. You see we're sending planes over. We're sending boats off. We're sending -- why isn't Germany helping? Why isn't -- why aren't the European countries. You know we're talking about the Ukraine. I feel very strongly about the Ukraine. It's great. But why do we have to be in the lead all the time. So we got that. We're fighting. They're showing these gorgeous brand new F22s, that's the newest and the best. They're going over for potential conflict with Ukraine. But where are the Europeans? Why are we always doing it? I love Ukraine. I love Ukraine. But what -- why do we always have to be like -- now, we have in North Korea. The guy is acting up again. You know, every six, seven months he starts to act, OK? Now two weeks I ordered 4,000 television sets. They will come from South Korea. They're making a fortune. I don't know if anybody here -- does anybody make television sets? I swear I pay more money. They don't even make them in the United States anymore. Does anybody make television sets? You know what I mean. Samsung, LG, all of them. They all come from South Korea. I paid a fortune. They gave me a pretty good price actually. Got a nice one you know with their nice round screen beautiful. 4,000 that's a big order for a big job. And so you ordered wanted all these television and I said, boy, I paid a lot of money. And then you look at the balance between the United States and South Korea. They're killing us. China, did you see the deficit that we have with China? I mean if you had a business that lost money every year, you'd close it, right? You'd do something. We have a deficit with China. You don't want -- I won't even say the number. It's so ridiculous. It's massive. We have rebuilt China. And again, I have the largest bank in the world as my tenant from China and they just renewed their lease. I said, are you sure you want to renew your lease on my building? Oh, we love you Mr. Trump. They love me because they're smart. They know I'm telling the truth. They actually just renew their lease for 10 years and -- but the largest in the world, so large they consider Citibank a small subsidiary. I said, how does Citibank compare? They look at me like, Citibank, that's like nothing. These are massive, massive powerful banks and they can't believe they're getting away with what they're getting away with. They just can't believe it. So we can straighten this out. We need great business minds. There are minds in this room that could do a fantastic job, a fantastic job. But when you look at what China has done and I said it the other day and I thought it was very good. The greatest theft in the history of the United States and perhaps the world. That's the money that China has taken from the United States and rebuilt itself. Greatest theft. Think of it. That's a pretty big statement, right? Greatest theft in the history of the United States perhaps the world. Now, that's not only the money. That's the money and the jobs and everything else. So again, I respect China. Great, great, great respect. In fact, the Chinese leaders coming over here next week. We'll give them great dinner. We'll celebrate him. You don't do that to people that -- you just have lunch. You don't need these big state dinners. You don't need them. They probably leave and they say, what a bunch of dopes. Can you believe the way they treat? So again, whether it's Japan or Mexico or China, I love them. I just wish our leaders were smart. I know the greatest negotiators in the world. Some are overrated that you heard of. Some are underrated. Some you never heard of. I know the best, like Carl Icahn is one of the best. If I put Carl of Japan. Carl, handle Japan trade deals. It's over. Just walk away. Let him on the road. Oh, forget it. They even know that they don't have a chance, OK? It's over. And I put another person -- you understand, OK? Not Carolyn Kennedy. I don't -- I love her. Not Carolyn. I said at one of the groups, I said, you know, the people I'm talking about are not nice people. They're vicious, horrible, miserable human beings but they're the greatest negotiators in the world. And I said to the audience, do you care? And they gave me a standing ovation. They said, we love them. I said you'll never have dinner with them. They think horribly of you. These are terrible people, in many cases, and about 2% of the case, they're actually nice people. But who cares? I want our great negotiators negotiating our deals. I don't want these nice people that got there because they gave political contributions. It's true. That got there, that got there because they got friendships. I want the best and the brightest and the smartest because that's what we're dealing with. In China, they're so smart. What they've done to their currency is so brilliant. They have manipulated -- now, they may be creating a bubble and they don't care because we're gonna pay the bigger price for the bubble than them. If that -- if it is in fact a bubble. But when I see these people that are -- and I know some of them. I know some of the people that are our top trade people. I don't want to get personal because they're nice people and they see me and they like me and I like them. They don't like me. I mean, I'm sure behind my back they say bad stuff, but that's OK. They pretend they like me, I will say that, especially now since I'm leading in every poll. Now they're really liking me. You know why? Because they want to keep their job. But that's not gonna happen. I'm sorry. We're gonna put the right people in. But when I look at Jeb Bush, who raised $125 million. I used to be one of those people. He raised $125 million. Hillary raised 60. But people are really afraid of Jeb now because -- these are people -- you know, there was an article that Jeb's funding is drying up. His -- you know, his -- no, it's drying up. You know why? Because he's losing so badly to me. He's losing so badly. That people are starting to have -- but it doesn't matter because they thought he was like the establishment guy. He'd walk in. We'd have another Bush. Would have another -- remember the, read my lips, no more taxes. And I liked the father. But do you remember that? Read my lips, no more -- that was the end of him. When he gave one of the largest tax increases in history. It's the same old stuff. His brother gets us into the mess in Iraq that we never recovered from, then Obama blew it by getting out the wrong way. I mean, look, everybody blew it. Everybody blew it. But when I look at Jeb raising hundreds of millions of dollars, which is honestly the only thing he has. Without that, he's got nothing, zero. But he'll do attack ads on me at some point. And I tell people, get ready. They'll say just like communist newspaper that I threw up in the air. It will be false stuff. Everybody knows. Look, I've done a great job. Maybe a little controversial but that's OK. I've done a great job. But when I look at that, all of those people, most of whom I know, many of whom you don't know because it's secret. You know, they should have transparency in giving. Nobody ever talks about that. I want to know who gave. If somebody gives $5 million that's OK. Let me know who he is at least so I know what it is. They don't do that. You don't have transparency. You should have complete transparency. And the laws are so crazy. You know Jeb puts his best friend in charge of his PAC. They're not allowed to talk. They don't talk. They play golf together or they do get together for -- but they don't talk. We don't talk. We never mentioned anything. Give me a break. OK. Give me. But when I see this kind of money put into things, the people that put up the money have total control over Jeb, over Hillary over everybody. Total control. Total control. Hey, honestly, nobody played the game better than me. I understand. I was the king. Nobody played it better than me. And it's not necessarily a good system for our country because if you have a lobbyist that gave a lot of money and that lobbyist is representing a country or a company and that lobbyist wants something, that lobbyist is gonna get it. Nine times out of ten, I could practically say 10 times out of 10 that lobbyist is gonna get what he or she wants. A couple of weeks ago somebody came to me, very powerful lobbyists. I'd like to put money into your campaign, $5 million. I said, oh yeah. You know, I'm a business person. How do you say no, right? I said I don't want it. I don't want your money because he would come to me in two years, three years, four years, one year or six months, who knows? And he's gonna want something. And it may be not for the good of the country and all I care about is the country. You know I built this -- thank you. You know, I was criticized the other day. They gave me like these great marks for speaking. They said his speech was incredible. But the one flaw is that he speaks through his applause. In other words, when people get up. So that's why I waited a little while. I'm trying to. No, it's true. But they say his one flaw is his speaking but the -- they like the way I use my hands. Can you believe it. I don't know. No, it's true. They say, oh, he uses his hand so well. I say, really? OK. But the one flaw they said is he speaks through his applause and then I realized, I have to because I don't have the patience to wait. Does that makes sense? I have so much to say. I'm thinking about so many things. And I have so much to say. I don't really have the patience. So excuse me if I speak through the applause. The hell with it. I don't want to check. But you know -- so when I see the money that we're -- and I'm not just talking about Jeb. I'm talking so many others. You know, most of the people they have money raised and those people that gave him the money have total control over that particular politician. And one of the things that resonates when I was in Alabama last week, we had 30,000 people. It was unbelievable. Unbelievable. I was in Iowa the other night, we had 4,000 people in a room that never had that many, and it was an amazing evening. The polls came out, by the way, leading Iowa. A poll just came out, by the way, a poll just came out two days ago, South Carolina 30%. Forget about everything else, right? 30%. In New Hampshire, a great poll, public policy just came out, 35%. I mean the second place is so far back I won't even bother mentioning. And all of them, North Carolina, the state of Nevada, Florida. In Florida, I'm leading the governor and the senator by a lot. Can you believe that? I love Florida. But people said, this can't be right. This must be a mistake. And then another one, I'm leading by a lot. I'm way up and they're here and here, which doesn't say much for them. Because how do you lose if you're the governor or the senator and you're losing? That's not a good sign, right? Florida. But we're leading everything. And then today, Quinnipiac just came out, you saw it, 28%. More than double, much more than double second place, which I think was at 12%. That's pretty good. But the reason is we have a message and the message is and essentially we're not gonna take it anymore. We're just not gonna take it anymore. So a couple of weeks ago we came out with our immigration plan. And it's honestly been met with -- I know you've heard, you know, very controversial no. But generally speaking, it's been met with tremendous applause. People are tired of what's happening and part of the plan is the wall. And I was criticized, you can't build a wall. How can you -- you're right. She's obviously in the building real estate business, right? Stand up. Are you in the real estate business? And you know what -- can trump build a wall? And it's gonna be so beautiful. Because someday when I'm no longer around, they'll call it the Trump Wall. It's got to be the greatest wall. Gotta be the greatest. Thank you. Thank you, darling. So I heard so much about you can't build a wall. So here's the story. The wall that they have now is like this. Do you ever see it where they're doing. They buy a ladder at Home Depot. They're over the wall. This is not the kind of wall, not that kind. I'm probably talking about 50 or 60 foot precast panels, bing, bing, bing. People aren't getting over my wall and they're not going under it. You know, then they said, oh they'll go under. Well you can't because with X-ray equipment you can't go under. You see it right away. All right? But people who go over my wall. You can go -- do you ever see plank that's laid like for highways where they cross highways. It's concrete plank. It's precast. I'm so good at this. That's actually the thing I'm best at. Hey, is that good to have a president that's really good at construction when we have to build our country, rebuild it, our infrastructure? We have -- our highways are crumbling. Our bridges are crumbling. Our airports are third world. I went to Dubai, they have an airport the most beautiful thing I've ever seen. Most beautiful. I went to Qatar, they have an airport, the most beautiful I've ever seen. In fact, one of the top people in Qatar was showing me the airport. Oh, Mr. Trump and then we have this, then we have that and I'm going like -- I'm thinking about LaGuardia. Ayayayay. You know, they have they have to raise their floors, no marble. They have to raise their floors. And when it breaks -- it's 40 years old. When it breaks, they use asphalt, black asphalt on a white floor. Fill it up with asphalt. And you -- this in the terminal. So you know I'm used to that. So this guy showing me, a wonderful guy showing me the airport in Qatar, which they say cutter I've always said Qatar. So what the hell. I don't care if I mispronounce it. It doesn't matter. I've always said Qatar. So we're in Qatar and he showed me this gorgeous airport, the most beautiful thing I've ever seen. I said this is the most beautiful airport I've ever seen. He goes, no, no, no, Mr. Trump. No, no, no. This is just temporary. The new airport is being -- and I look at the crane, there's like 70 cranes on the other side, two miles away. I said, what is that? That's our new terminal, Mr. Trump. This gets knocked down after that's complete. They knocked it down. And it was beautiful. And this is what? We have, we have third world. Go to LAX, LaGuardia, Kennedy, Newark, any of them. We're like third world. And they're building things in Japan and in China. You've never seen anything like it. Parts of the Middle East that haven't blown up yet, by the way. Those parts that haven't blown up. So we have a chance to be truly great again, truly great again, truly great. I don't mean a little bit. Truly great again. We have a chance to be as good as ever, if not better, believe it or not. We have to take care of our people. We have to build up our military stronger than ever before so we don't have to use it. So we don't have to use it. I don't want to use it. Don't forget, I am the only candidate and I'm the most militaristic person you're ever gonna -- worse than anybody in this room, but you got to use it right or don't use it at all. Don't use it at all if we can. There's no fear factor. How about we send 2,300 Humvees, armor-plated, beautiful, they're best in the world to our allies in the Middle East, right? You heard about this one too. This is -- I don't mean 23. I don't mean two. I mean 2,300. The most expensive. You know, they were being blown up and our boys and ladies are losing their legs and their arms because they didn't have the armor and all that. Terrible. Now, we make them incredibly. They can take tremendous damage and you'll be OK. And we sent 2,300 our allies. One big group. One shot is fired. Everybody gets out. They run away. Our enemy now owns all of them, has all of them. 2,300. Think of how many that -- I said, how do you get them over there? Because when they said that 2,000, I thought they were like you got to be kidding. And I actually thought, you mean 23? No, 2<300 Humvees, the best in the world and we don't have them. We have the ones that are without the armor because ours are old. These are the best. Our enemy has them. Our enemies have lots of our weapons because when we give them to the allies as soon as three and a half bullets go off, they run away. And they drop everything and they take their uniforms off and they do it. No, I'm just here. I love you very much. OK? Because we're stupid. Because we're stupid and that stuff isn't gonna happen anymore. Not gonna happen anymore. You know, everybody said -- CNN actually did a poll and the poll had -- it was a wonderful poll or believe me I wouldn't be talking about it. But it was a wonderful poll, had me leading. But more importantly, in the background, they had these different categories. Who's best on leadership? Trump, by far. Who's best on finance and economics? It was like five times so much better than -- they were in the dust. I don't mean like a little bit better. I don't mean two or three times. I mean much better. And who's better at -- the only thing I did badly on was, is he a nice person? And people said no. He's a -- I was last in terms of niceness, but I think I'm the nicest of all. I just don't want to be taken advantage of. Does that make sense? That was my only weak thing. And a woman came up to me and she had seen the poll. And she said, Mr. Trump, I just heard your speech. I love what you said but you know what. I don't know if you're nice enough to be president. And I said, number one, I really think I'm a nice person. I help people. I love to help people but. But I really think that this is going to be an election that's not based on niceness. It's gonna be based on competence and smartness and toughness because we're tired of the nice. We don't need the nice. We need the competent and we're gonna have such a competent brilliant presidency, if I win. And I think we're gonna have a really good chance. You know when people were talking about the polls today, some of the people were like sort of surprised. And John McLaughlin -- you know John McLaughlin? He does the McLaughlin. But he was arguing with somebody because my poll numbers were good. I was doing very good. He hasn't showed McLaughlin. I never met him. I never met him. I don't know who he is. But he said something that was -- he said, this man has had great achievement and accomplishment all his life, all his life. I go to Europe, I see his name. I go all over the city, I see his name. I see buildings. I see other things he does. He's a man of great achievement. Why wouldn't he do well? And I thought it was very nice. I wrote him a letter. I said, thank you very much. Thank you very much. One of the things that I'm most proud of is that a few of the people that I'm running against really, really hit me hard. One was Governor Perry, and he went from 5% to nothing, to nothing. And he would make speeches about me, what a bad guy. I mean he used horrible terms. He used the word cancer. He used horrible terms. I said I'm not a bad person, but he was trying, you know, he was down pretty low and he wanted to get up and I understand. But he went down. Another one was Senator Lindsey Graham. Has anyone ever heard of Lindsey Graham. This guy, I mean he is he is out of control. I mean he's real -- so a poll came out the other day, he was at 0. 0. Even Pataki was higher. Pataki was at zero with an arrow up that means he got one. But Lindsey Graham actually had zero. And the other day when the poll came out where I had 30, he had four. And I wrote him a note. I said thank you and congratulations on four, even though it is his home state. You know, this was in his home state. I'm not talking about national. National he still got zero. But in his home state, he had four. The one that came out two days ago and I had a lot. I had 30. So I congratulated him on getting four and on the fact that I was only up on him by 26 points. That's a lot, right? But no, the level of viciousness from him -- and I don't understand it because he called me three, four years ago. He wanted my help. He wanted money. He wanted everything. Oh, he'd be so easy if I wanted to. If I cared. He'd be so easy. He'd be so -- you're right. So I am telling you that there is a sense of spirit that I'm seeing in this country, that's unbelievable. The people that I've met are incredible whether it's New Hampshire or Iowa or South Carolina or California or New York. And people that -- one of the beautiful things in this poll and the shocked. They said, he does great with the Tea Party. A lot of people -- I love the Tea Party. I love the Tea Party. These are great people. They're great people. But he does great with the Tea Party. But he also does great with the moderates and the young and the old and the rich and the poor. He does great with everything. I even did great with the Democrats. Can you believe it? I think great with the Democrats. Because I have a really, as an expression that's so important and we've used it over and over again, and I actually went out and copyrighted it because people were using it that I'm running against. A couple other people saw me make a speech. I got this huge standing ovation after I used this term, right? And I said, you know what, I have great lawyers and I heard this guy go and I get it copyrighted. Can you believe it? And the term is make America great again. I got to copyright it because they saw the response and how simple is it. I think this shows about our politician. They can't even come up with their own terms. They have to copy you right? There are other good terms I could come up with. But I did so think it says anything says it better than that. You know, I use an expression, the American dream. You know the American dream, right? The American dream is dead but I'm gonna make it bigger and better and stronger than ever before. I am going to do that. The American Dream is in very, very big trouble, but I am gonna make it bigger and better and stronger than ever before. And our military is gonna be great. And the Iran deal, uh, these people, these people. We are gonna make this company. We are gonna make this -- what? We are going to make this country so strong and so powerful and so wonderful and you're going to be so proud of it. And you know like the people that fought me, they seem to be gone. Well, when countries fight us, without fighting we're gonna beat them. We're gonna beat them a trade. We're gonna have the best military. We're gonna have the best of everything. We are going to be so proud. If I am president, you are going to be so proud of our country. You will be the happiest people. And I just want to thank the people of South Carolina have been incredible to me from day one. From the first time I came here, they saw what was happening. And we are going to indeed make America great again, may be better than ever before. And I just want to thank you all very much. This is a great honor and thank you all very much. We are gonna have a lot of fun doing it too. Thank you very much. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you very much."}